{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "Now that you’ve taken COVID-19 vaccine, is it safe to hug? Experts respond",
          "summary": "Prior to the availability of COVID-19 vaccine globally, social distancing was advised, even as physical contact was strongly forbidden, as the coronavirus could spread through close physical contact.\nHowever, with the availability of the COVID-19 vaccine globally, as well as in Nigeria, many people probably believe that it is safe to hug again.\nNigeria received her batch of the Oxford-Astrazeneca brand of the COVID-19 vaccine on March 2 through the COVAX efforts, and the country commenced vaccination on March 5.\nProf. Tomori had earlier explained that anyone is only fully protected when fully vaccinated.\nContinuing, he said, “Immunity to the coronavirus is not guaranteed, because an infected person can transmit it to a vaccinated person if the vaccinated person is not wearing a mask.",
          "link": "https://healthwise.punchng.com/now-that-youve-taken-covid-19-vaccine-is-it-safe-to-hug-experts-respond/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "safe",
            "covid19",
            "vaccinated",
            "tomori",
            "respond",
            "received",
            "protected",
            "fully",
            "person",
            "taken",
            "vaccine",
            "youve",
            "country",
            "hug",
            "experts"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Girls education key to progressive society, Sanwo-Olu",
          "summary": "Kindly Share This Story:By Olasunkanmi AkoniLagos State Governor, Mr. Babajide Sanwo-Olu, has expressed his administration’s commitment to quality education and promotion of equal opportunities for the girl child.\nNigeria’s success is very important to the United Kingdom and the continent of Africa.\nI think this is really an exciting time for Nigeria and the United Kingdom relations.\n“Girls education is something that is very close to the Prime Minister’s heart.\nHe has said that he wants every girl to get 12 years of quality education and we know that is good for girls.",
          "link": "https://www.vanguardngr.com/2021/05/girls-education-key-to-progressive-society-sanwo-olu/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "progressive",
            "kingdom",
            "lagos",
            "education",
            "uk",
            "girl",
            "quality",
            "sanwoolu",
            "united",
            "prime",
            "society",
            "girls",
            "key"
          ]
        },
        {
          "title": "Woman arrested for using children as beggars in Lagos",
          "summary": "Kindly Share This Story:…As guest accuses hotel staff of sneaking into the room to assault herBy Nimat OtoriThe Lagos State Police Command has arrested a woman popularly known as Mama Ajayi, for allegedly using children to beg for alms in the Chisco area of Lekki, Lagos.\nThis is just as a hotel attendant was arrested, following a complaint by a guest that he sneaked into her hotel room at night to assault her sexually.\nCommissioner of Police, Lagos State Police Command, CP Hakeem Odumosu, who paraded some suspects arrested within the month of April, at the command headquarters, Ikeja, disclosed that Mama Ajayi was arrested alongside one Segun Ajayi.\nHe explained that “ It is a case of child trafficking and abuse reported via written petition by Auntlanda’s Bethel Foundation located at 17 Jide Agbalaya street, Chevy View Estate, Lekki Lagos against Mama Ajayi ‘f’ of Chisco area, Lekki Lagos.\nAt about 1.30 am the next day, the suspect broke into the complainant’s room through the toilet window and assaulted her sexually.",
          "link": "https://www.vanguardngr.com/2021/05/woman-arrested-for-using-children-as-beggars-in-lagos/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "case",
            "lagos",
            "using",
            "suspect",
            "mama",
            "state",
            "children",
            "lekki",
            "woman",
            "hotel",
            "room",
            "arrested",
            "beggars",
            "command"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Biafra: Ebubagu not after ESN, IPOB in south easth",
          "summary": "The Chairman of the South East Governors forum and Governor of Ebonyi State, David Umahi, on Friday said that Ebubeagu security outfit is not after the EASTERN Security network and Indigenous People of Biafra, IPOB, contrary to the rumour making the rounds in the region.\nThe governor equally said no member of the indigenous People of Biafra, IPOB, ESN is after him as rumoured by people in the state.\nHe said: “Let me correct an impression, no criminal is after the governor of Ebonyi state.\nNo IPOB member or ESN is after Ebonyi state governor.\n“What happened two days back was not the activities of IPOB or ESN but a pure criminality.",
          "link": "https://dailypost.ng/2021/04/30/biafra-ebubagu-not-after-esn-ipob-in-south-easth-umahi/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "ipob",
            "south",
            "ebubagu",
            "nation",
            "state",
            "youths",
            "ebonyi",
            "biafra",
            "governor",
            "leaders",
            "easth",
            "security",
            "esn",
            "takes"
          ]
        },
        {
          "title": "Presidency, Fr Mbaka are scammers",
          "summary": "The governor equally said no member of the indigenous People of Biafra, IPOB, ESN is after him as rumoured by people in the state.\nHe also announced his preparedness to dialogue with Ebonyi youths, groups and vowed to empower them but takes them to stop further destruction of lives and properties in various areas of the state.\nHe said: “Let me correct an impression, no criminal is after the governor of Ebonyi state.\nNo IPOB member or ESN is after Ebonyi state governor.\n“What happened two days back was not the activities of IPOB or ESN but a pure criminality.",
          "link": "https://dailypost.ng/2021/04/30/presidency-fr-mbaka-are-scammers-fayose/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "ipob",
            "scammers",
            "fr",
            "presidency",
            "mbaka",
            "nation",
            "state",
            "youths",
            "ebonyi",
            "leaders",
            "governor",
            "security",
            "esn",
            "takes"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Pfizer, BioNTech seek EU's approval to use COVID-19 vaccine on kids",
          "summary": "The children will continue to be monitored for longer-term protection and safety for another two years.\nBioNTech and Pfizer have previously requested their emergency use authorization with the U.S. Food and Drug Administration also be extended to children 12 to 15 years old.\nADVERTISEMENTGerman Health Minister, Jens Spahn, welcomed the news that the vaccine might soon get the green light for older children.\n“This can make a further real difference to our vaccine campaign, if approval is granted,” he said on the sidelines of a visit to a vaccine manufacturing plant in the German town of Reinbek.\nThe COVID-19 vaccine made by Pfizer and BioNTech was the first one to be granted a greenlight by the EMA last December, when it was licensed for anyone 16 and over across the 27-nation EU bloc.",
          "link": "https://thenationonlineng.net/pfizer-biontech-seek-eus-approval-to-use-covid-19-vaccine-on-kids/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "european",
            "approval",
            "pfizer",
            "covid19",
            "biontech",
            "children",
            "granted",
            "15",
            "extended",
            "kids",
            "drug",
            "eus",
            "vaccine",
            "seek"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "I get depressed when men drool over my boobs – Kemi Ikuseedun",
          "summary": "But mention ‘Mummy Wa’ and you see several heads turn.\nHowever, one thing makes Mummy Wa stand out and it’s the fact that she’s quite endowed in the upper region.\nIn a chat with Saturday Sun, the ‘wife’ of popular Internet comedian, Mr. Macaroni played by Debo Adebayo, bemoans her sexual harassment encounters.\n“I think every girl, beautiful or not, has faced sexual harassment before.\nI love how I look.”On what turns her off in a relationship, Mummy Wa says it’s dishonesty and lack of respect.",
          "link": "https://www.sunnewsonline.com/i-get-depressed-when-men-drool-over-my-boobs-kemi-ikuseedun-mummy-wa/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kemi",
            "physical",
            "look",
            "way",
            "boobs",
            "sexual",
            "maybe",
            "drool",
            "girl",
            "wa",
            "men",
            "harassment",
            "guys",
            "ikuseedun",
            "depressed",
            "mummy"
          ]
        },
        {
          "title": "Ibarapa: ‘Kidnappers, killer herders still perpetrating crime from forests’",
          "summary": "The Chief Hunter of the seven principal Ibarapa towns of Eruwa, Lanlate, Igboora, Idere, Ayete, Tapa and Igangan, Alhaji Bilau Dare Congo, confirmed the situation to Saturday Sun during an interview with him.\nHe said the criminals would emerge from the forest, perpetrate their evil activities and also disappear into the forest.\nSaid the Chief Hunter: “Killings and kidnapping have not stopped in all the seven towns of Ibarapa.\nMany people have false information that all the Fulani in Ibarapa have been evicted.\nHe wondered why the Amotekun Corps personnel deployed to Ibarapa were not allowed by the government to enter into the forest.",
          "link": "https://www.sunnewsonline.com/ibarapa-kidnappers-killer-herders-still-perpetrating-crime-from-forests/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "wakili",
            "killer",
            "herders",
            "way",
            "state",
            "crime",
            "forests",
            "fulani",
            "towns",
            "seven",
            "kidnappers",
            "security",
            "ibarapa",
            "forest",
            "perpetrating",
            "chief"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Buhari: We’ll Defeat Forces of Evil and Overcome Current Security Challenges",
          "summary": "Security council reconvenes TuesdayBy Deji Elumoye President Muhammadu Buhari has said that Nigeria will overcome all the current security problems and defeat the forces of evil marauding about in different parts of the country.\nThe President’s assurance was contained in a statement issued Friday by the National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), at the end of the National Security Council meeting at the State House, Abuja.\nThe NSA stressed the readiness of President Muhammadu Buhari to decisively end all form of security assault on the nation.\nPresident Buhari had convened a meeting of the National Security Council (NSC) at the Presidential Villa, Abuja Friday, following the escalation of security challenges in different parts of the country and general outcry by various stakeholders with many calling for an urgent action from the President.\nThe meeting was attended by Vice President Yemi Osinbajo, the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha; the Chief of Staff to the President, Prof Ibrahim Gambari; and the National Security Adviser (NSA), Major-General Babagana Monguno (rtd).",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/buhari-well-defeat-forces-of-evil-and-overcome-current-security-challenges/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "chief",
            "overcome",
            "staff",
            "nation",
            "nsa",
            "current",
            "evil",
            "president",
            "defeat",
            "forces",
            "challenges",
            "security",
            "meeting",
            "council",
            "parts",
            "national",
            "buhari"
          ]
        },
        {
          "title": "Bandits Kill 323, Kidnapped 949 Others in Kaduna in Three Months, Says Commissioner",
          "summary": "By John ShiklamThe Kaduna State Government has disclosed that 323 persons were killed, while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nAruwan also said 64 bandits were neutralised by troops, while several gunrunners were arrested during the same period.\nAccording to the commissioner, “The report covers banditry, kidnapping, cattle-rustling, attacks and reprisals.\nAccording to him, “Out of the 323 citizens killed, 292 were males.\n“Southern Kaduna Senatorial District had 68 deaths in total, of which five were women and two below the age of 18.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/bandits-kill-323-kidnapped-949-others-in-kaduna-in-three-months-says-commissioner/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kaduna",
            "deaths",
            "kidnapped",
            "months",
            "kill",
            "neutralised",
            "state",
            "missions",
            "killed",
            "security",
            "bandits",
            "commissioner",
            "949",
            "report",
            "323"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "auwalun",
            "dead",
            "schoolboys",
            "repentance",
            "daudawa",
            "leader",
            "abduction",
            "state",
            "shot",
            "breaking",
            "men",
            "bandits",
            "zamfara",
            "forest",
            "gang",
            "kankara",
            "returned"
          ]
        },
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "auwalun",
            "dead",
            "schoolboys",
            "repentance",
            "daudawa",
            "leader",
            "abduction",
            "state",
            "shot",
            "breaking",
            "men",
            "bandits",
            "zamfara",
            "forest",
            "gang",
            "kankara",
            "returned"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "FACT CHECK: Did COVID-19 vaccine knock down a woman in Kaduna as Oyedepo claimed?",
          "summary": "On April 17, David Oyedepo, presiding bishop of Living Faith Church Worldwide, said he won’t take the COVID-19 vaccine and also asked his followers not to take it.\nAdvertisementWhile delivering a sermon in his church, he told the congregation that a certain woman went down after taking the vaccine injection in Kaduna.\nTheCable presents what we know so far about the incident and COVID-19 vaccination in Nigeria at present.\nSORTING FACTS FROM FICTIONNigeria commenced nationwide vaccination of the Oxford/AstraZeneca COVID-19 vaccine on March 5 after receiving 3.9 million doses courtesy of the UN-led COVAX facility.\nThe European Medicines Agency (EMA) also declared the AstraZeneca COVID-19 vaccine safe and effective.",
          "link": "https://www.thecable.ng/fact-check-did-covid-19-vaccine-knock-down-a-woman-in-kaduna-as-oyedepo-claimed",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kaduna",
            "check",
            "hospital",
            "claimed",
            "fact",
            "covid19",
            "vaccinated",
            "oyedepo",
            "injection",
            "woman",
            "administration",
            "tanko",
            "vaccination",
            "knock",
            "vaccine",
            "health"
          ]
        },
        {
          "title": "Nasarawa governor: It’s unfair to say Buhari doesn't have the capacity to end insecurity",
          "summary": "Abdullahi Sule, governor of Nasarawa state, says it is unfair to say President Muhammadu Buhari does not have the capacity to end the security challenges in the country.\nThe development has heightened pressure on the Buhari-led administration to put an end to the security challenges.\n‘’You will remember in 2015, most of the security challenges are restricted to the northern part of the country, predominantly in the north-eastern part of the country.\nHaving outside support doesn’t necessarily mean that we don’t have the capacity.\nMost of the wars that have been fought in the world, a lot of countries ask for foreign support,” Sule added.",
          "link": "https://www.thecable.ng/nasarawa-gov-its-unfair-to-say-buhari-doesnt-have-the-capacity-to-end-insecurity",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nasarawa",
            "end",
            "capacity",
            "saying",
            "unfair",
            "say",
            "sule",
            "governor",
            "support",
            "challenges",
            "president",
            "security",
            "think",
            "insecurity",
            "buhari",
            "doesnt"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "bruised",
            "skye",
            "sanusi",
            "banks",
            "tradition",
            "bank",
            "governor",
            "cbn",
            "enforces",
            "board",
            "sacking",
            "took",
            "otudeko",
            "emefiele"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "company",
            "partnerships",
            "companies",
            "country",
            "startups",
            "fintech",
            "business",
            "aggressive",
            "expansion",
            "market",
            "size",
            "expand",
            "value"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "ne",
            "followed",
            "locations",
            "nigerian",
            "counterinsurgency",
            "observer",
            "operation",
            "renames",
            "coas",
            "defeat",
            "army",
            "renaming",
            "disclosed",
            "counterterrorism"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "underaged",
            "highways",
            "immediate",
            "cattle",
            "19",
            "register",
            "movement",
            "prohibited",
            "web",
            "wish",
            "outlawed",
            "nightgrazing",
            "jan"
          ]
        },
        {
          "title": "FG admits hike in electricity tariff, says increase not significant",
          "summary": "Sale Mamman, has dismissed rumours of a major hike in electricity tariff, clarifying that there is no plan to “significantly” raise tariff, but only “minor” adjustments.\nIn a statement in Abuja on Thursday, the minister said instead of significant hike in electricity tariff, Nigerians should expect an increase efficiency in the sector to reduce tariffs while managing headwinds from foreign exchange and inflation.\nAccording to the minister, the clarification came amidst reports of possible major increase in the price of electricity that has dominated the public space.\nHe said the review planned by NERC is in accordance with Section 76 of the Electric Power Sector Reform Act of 2005.\nThus, as in January a minor review will occur in June.",
          "link": "https://hallmarknews.com/fg-admits-hike-in-electricity-tariff-says-increase-not-significant/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "significant",
            "hike",
            "increase",
            "minister",
            "admits",
            "sector",
            "minor",
            "tariff",
            "electricity",
            "extraordinary",
            "reduce",
            "tariffs",
            "power",
            "fg",
            "review"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "BREAKING: Abductor Of Kankara Schoolboys Shot Dead",
          "summary": "ADVERTISEMENTBY OUR CORRESPONDENTArmed bandits have reportedly killed Auwalun Daudawa, the notorious bandits’ leader who led attack on a Kankara School, Katsina State in December last year while President Muhammadu Buhari was holidaying in his hometown of Daura.\nMultiple sources said Daudawa was killed on Friday in a Zamfara Forest by bandits.\nRecall that Auwalun Daudawa was recently reported to has gone back to banditry, less than three months after his celebrated repentance and was given amnesty.",
          "link": "https://leadership.ng/breaking-abductor-of-kankara-schoolboys-shot-dead/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "auwalun",
            "dead",
            "schoolboys",
            "abductor",
            "daudawa",
            "reported",
            "state",
            "school",
            "reportedly",
            "shot",
            "breaking",
            "killed",
            "bandits",
            "zamfara",
            "sources",
            "kankara"
          ]
        },
        {
          "title": "Celebrity Plastic Surgeon, Dr. William Rahal, Strives To Provide Confidence For His Patients",
          "summary": "However, there’s another thing that makes Dr. William Rahal one of the most followed celebrity cosmetic surgeons in the US – his looks!\nHere are five boy-next-door looks of Dr. William Rahal that are over and above drool-worthy.\nDr. William Rahal says that the purpose of his work is to provide patients with the confidence they lack in their lives, which significantly benefits their quality of life.\nAmidst so much competition, the thing that motivates Dr. William Rahal the most is patient satisfaction.\nDr. William Rahal will continue to build his class-leading brand based on genuine services, authentic principles, and value that adds to the patients’ lives.",
          "link": "https://leadership.ng/celebrity-plastic-surgeon-dr-william-rahal-strives-to-provide-confidence-for-his-patients/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "field",
            "cosmetic",
            "celebrity",
            "medical",
            "patients",
            "surgeon",
            "plastic",
            "care",
            "patient",
            "provide",
            "strives",
            "lives",
            "confidence",
            "william",
            "dr",
            "rahal"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Chibok Girls: House moves to investigate N500m school rehabilitation fund",
          "summary": "By Tom OkpeThe House of Representatives on Wednesday said there is every need to investigate the 500 milion naira Chibok School rehabilitation fund.\nThe House ecalled the unfortunate incidence of 2014 when 230 girl students of Government Secondary School Chibok were abducted by the Boko Haram sect with the School, vandalised.\nThe abduction attracted national and international condemnation which led to the formation of the ‘Bring Back Our Girls’ (BBOG) movement by coalitions of Civil Society and Human Rights Organisation.\n“The House is also, Informed that the school when rebuilt and fully rehabilitated is expected to have a state of the art library, a laboratory, a computer and ICT Centre, a sports arena and a clinic.\n“However, the House is worried that seven years after the foundation laying ceremony of the Safe School Initiative and announcement of a 500 Million Naira Fund by the government for the rehabilitation of the Chibok School, nothing have been done in the school and the school has remained closed.”Recognizes the need for a detail investigation of what happened to the 500 million naira Chibok School Rebuilding Fund and the Safe School Initiative, it was resolved that an Ad-Hoc Committee to investigate the status of the rebuilding Fund and the Safe School Initiative and report back in 4 weeks.",
          "link": "https://dailytimes.ng/chibok-girls-house-moves-to-investigate-n500m-school-rehabilitation-fund/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "moves",
            "n500m",
            "chibok",
            "safe",
            "million",
            "school",
            "investigate",
            "rehabilitation",
            "initiative",
            "naira",
            "house",
            "girls",
            "500",
            "rebuilding",
            "fund"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Workers’ Day: Obi laments poor condition of Nigerian workers … Urges them to keep hope alive",
          "summary": "By CHIKA CHIMEZIEThe Vice Presidential candidate of the Peoples Democratic Party (PDP) in the 2019 elections, Mr. Peter Obi, has felicitated with workers as the world celebrates Workers’ Day today, May 1, 2021.\nIn a release made available to the press on Friday by his Media Office, Obi noted that the universality of worker’s day testifies to the unity in the goal of labour worldwide, which he said was for the uplift of the society and the ennobling of the human person.\nLamenting the poor condition of workers in Nigeria, Obi noted that things are made worse because poor economic realities in the country subject workers, as he said, “to live even below frugal comfort when even the agreed salaries are not paid.”Obi said it was most pathetic that retirees are owed pension and gratuities even now they require all possible care.\nOn the part of the leaders, Obi said that it was about time poor leadership, that had got Nigeria and Nigerians, including workers on their knees was checked.\nHe called for reasonability in the way those in government treated workers, reminding them of workers’ role and contributions to the growth of the country thus urging them to use the occasion of Workers Day to reflect about the country.",
          "link": "https://daylightng.com/workers-day-obi-laments-poor-condition-of-nigerian-workers-urges-them-to-keep-hope-alive/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "obi",
            "noted",
            "poor",
            "nigerian",
            "condition",
            "alive",
            "leadership",
            "day",
            "hope",
            "salaries",
            "nigerians",
            "laments",
            "country",
            "urges",
            "workers"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "bookmaker",
            "account",
            "page",
            "version",
            "place",
            "1xbet",
            "website",
            "mobile",
            "launches",
            "site",
            "emerges",
            "popular",
            "offers",
            "convenient"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "callup",
            "gridlock",
            "truck",
            "electronic",
            "road",
            "apapa",
            "trucks",
            "roads",
            "ecall",
            "drivers",
            "system",
            "npa",
            "worsening",
            "amidst"
          ]
        }
      ]
    }
  }
}