{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "Baby’s first stool can help predict risk of developing asthma later in life, says study",
          "text": "It may seem like an unusual place to go looking for answers, but the contents of a baby’s first diaper can reveal a lot about a newborn’s future health.\n\nIn a new study published in Cell Reports Medicine, a team of University of British Columbia researchers says that the composition of a baby’s first poop — a thick, dark green substance known as meconium — is associated with whether or not a child will develop allergies within their first year of life; with the observation that children with allergies are at the highest risk of also developing asthma.\n\nCell Reports Medicine is a cutting-edge open access research in translational and clinical biomedical sciences that inform and influence human health and medicine.\n\nSpeaking about the study, senior co-author Dr. Brett Finlay, a professor at the Michael Smith Laboratories at UBC, says, “Our analysis revealed that newborns who developed allergic sensitisation by one year of age had significantly less ‘rich’ meconium at birth, compared to those who didn’t develop allergic sensitisation.”\n\nMeconium, which is typically passed within the first day of life, is made up of a variety of materials ingested and excreted during development, ranging from skin cells, amniotic fluid and various molecules known as metabolites.\n\n“Meconium is like a time capsule, revealing what the infant was exposed to before it was born.\n\n“It contains all sorts of molecules encountered and accumulated from the mother while in the womb, and it then becomes the initial food source for the earliest gut microbes,” says the study’s lead author, Dr. Charisse Petersen, a research associate in UBC’s department of paediatrics.\n\nAs part of the study, the researchers analysed meconium samples from 100 infants enrolled in the CHILD Cohort Study, a world-leading birth cohort study in maternal, newborn and child health research.\n\nThey discovered that the fewer different types of molecules a baby’s meconium contained, the greater the child’s risk of developing allergies by one year.\n\nThey also found that a reduction in certain molecules was associated with changes to key bacterial groups. These bacteria groups play a critical role in the development and maturation of a vast ecosystem of gut microbes, known as the microbiota, which is a powerful player in health and disease.\n\n“This work shows that the development of a healthy immune system and microbiota may actually start well before a child is born — and signals that the tiny molecules an infant is exposed to in the womb play a fundamental role in future health,” says Dr. Petersen.\n\nUsing a machine-learning algorithm, the researchers combined meconium, microbe and clinical data to predict with a high degree of accuracy (76 per cent), and more reliably than ever before, whether or not an infant would develop allergies by one year of age.\n\nThe study findings have important implications for at-risk infants, say the researchers.\n\n“We know that children with allergies are at the highest risk of also developing asthma. Now, we have an opportunity to identify at-risk infants who could benefit from early interventions before they even begin to show signs and symptoms of allergies or asthma later in life,” says the study’s senior co-author Dr. Stuart Turvey, a professor in UBC’s department of paediatrics.",
          "summary": "Cell Reports Medicine is a cutting-edge open access research in translational and clinical biomedical sciences that inform and influence human health and medicine.\n“Meconium is like a time capsule, revealing what the infant was exposed to before it was born.\nAs part of the study, the researchers analysed meconium samples from 100 infants enrolled in the CHILD Cohort Study, a world-leading birth cohort study in maternal, newborn and child health research.\nThey discovered that the fewer different types of molecules a baby’s meconium contained, the greater the child’s risk of developing allergies by one year.\n“We know that children with allergies are at the highest risk of also developing asthma.",
          "link": "https://healthwise.punchng.com/babys-first-stool-can-help-predict-risk-of-developing-allergies-says-study/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "babys",
            "study",
            "child",
            "help",
            "researchers",
            "health",
            "dr",
            "stool",
            "life",
            "later",
            "developing",
            "molecules",
            "asthma",
            "meconium",
            "risk",
            "allergies",
            "predict"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "PDP’ll pressure Buhari’s govt to rescue Nigeria from insecurity — Saraki",
          "text": "Kindly Share This Story:\n\nABUJA—Former Senate President, Bukola Saraki, has said the Peoples Democratic Party, PDP, will put pressure on the administration of President Muhammadu Buhari to rescue the country from insecurity.\n\nAddressing a press conference at the PDP national secretariat in Abuja on Monday, Saraki said the opposition party will continue to proffer solutions to insecurity and other challenges confronting the country.\n\nThe former senate president said pressure — through constitutional means — will yield results that the citizens yearn for.\n\nREAD ALSO\n\n“We, the opposition party, will continue to play our own role in letting the government be aware of lapses and continue to put pressure through constitutional means in telling them what they need to do, so we will not get tired,” he said.\n\n“When you see changes in the world, it has gone through constitutional means. It might look like a long journey but the truth will prevail and the right thing will be done.\n\n“Pressure on the government will eventually yield results. We will continue to follow that through the constitutional means. That is why we are here at this press conference. We will continue to demand that the right thing is done and we will play our own role.\n\n“Let me assure all the people of Nigeria that we are committed on this part. It is just a matter of months and we are hopeful that during this short period of time we will start a great journey for this great country.\n\nWhen we talk about security, it is not about political parties. It affects all Nigerians. That responsibility of government is to all of us as Nigerians.”\n\nVanguard News Nigeria\n\nKindly Share This Story:",
          "summary": "Kindly Share This Story:ABUJA—Former Senate President, Bukola Saraki, has said the Peoples Democratic Party, PDP, will put pressure on the administration of President Muhammadu Buhari to rescue the country from insecurity.\nAddressing a press conference at the PDP national secretariat in Abuja on Monday, Saraki said the opposition party will continue to proffer solutions to insecurity and other challenges confronting the country.\nThe former senate president said pressure — through constitutional means — will yield results that the citizens yearn for.\n“When you see changes in the world, it has gone through constitutional means.\nWe will continue to follow that through the constitutional means.",
          "link": "https://www.vanguardngr.com/2021/05/pdpll-pressure-buharis-govt-to-rescue-nigeria-from-insecurity-saraki/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "means",
            "share",
            "insecurity",
            "thing",
            "nigeria",
            "saraki",
            "continue",
            "yield",
            "president",
            "party",
            "senate",
            "constitutional",
            "govt",
            "buharis",
            "pdpll",
            "pressure",
            "rescue"
          ]
        },
        {
          "title": "Bill Gates announces divorce from wife Melinda",
          "text": "Kindly Share This Story:\n\nBy Emmanuel Okogba\n\nBill Gates said in a tweet on Monday that he and his wife, Melinda Gates, will be splitting up after 27 years.\n\n“After a great deal of thought and a lot of work on our relationship, we have made the decision to end our marriage. Over the last 27 years, we have raised three incredible children and built a foundation that works all over the world to enable all people to lead healthy, productive lives. We continue to share a belief in that mission and will continue our work together at the foundation, but we no longer believe we can grow together as a couple in this next phase of our lives. We ask for space and privacy for our family as we begin to navigate this new life.” Bill and Melinda Gates wrote in a statement that Bill Gates tweeted out.\n\nThe couple met in 1987, soon after Melinda joined Microsoft. Melinda recalled, in a 2019 Netflix documentary, how she found Bill compiling a list of the pros and cons of marriage on a whiteboard before he proposed.\n\nFinancial Times reports that depending on the terms of any divorce settlement, Melinda Gates could immediately rival Jeff Bezos’ ex-wife, Scott MacKenzie, whose fortune is put by Forbes at $60bn, for influence in the philanthropy world in her own right.\n\nThe two will keep working together on philanthropic efforts, which have addressed education, gender equality and health care.\n\nVanguard News Nigeria\n\nKindly Share This Story:",
          "summary": "Kindly Share This Story:By Emmanuel OkogbaBill Gates said in a tweet on Monday that he and his wife, Melinda Gates, will be splitting up after 27 years.\n“After a great deal of thought and a lot of work on our relationship, we have made the decision to end our marriage.\nWe ask for space and privacy for our family as we begin to navigate this new life.” Bill and Melinda Gates wrote in a statement that Bill Gates tweeted out.\nMelinda recalled, in a 2019 Netflix documentary, how she found Bill compiling a list of the pros and cons of marriage on a whiteboard before he proposed.\nFinancial Times reports that depending on the terms of any divorce settlement, Melinda Gates could immediately rival Jeff Bezos’ ex-wife, Scott MacKenzie, whose fortune is put by Forbes at $60bn, for influence in the philanthropy world in her own right.",
          "link": "https://www.vanguardngr.com/2021/05/breaking-bill-gates-announces-divorce-from-wife-melinda/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "announces",
            "couple",
            "share",
            "world",
            "wife",
            "melinda",
            "work",
            "divorce",
            "marriage",
            "foundation",
            "gates",
            "lives",
            "bill"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Nigerian govt extends NIN-SIM registration till June 30",
          "text": "Nigerian government has extended the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise till June 30.\n\nIsa Pantami, minister of communications and digital economy, announced this in a statement jointly signed by Ikechukwu Adinde, director of public affairs and Kayode Adegoke, head of corporate communications at the National Identity Management Commission (NIMC).\n\nThis is coming few days before the May 6 deadline earlier announced.\n\nThe NIN extension was granted based on stakeholders’ request and in order to give Nigerians more time to register.\n\nSo far 54 million Nigerians with an estimated 190 million mobile numbers have obtained their NIN.\n\nPart of the statement read: “The postponement of the deadline was also based on the request by stakeholders for an extension till 30th of June in order to make it easier for all Nigerians and legal residents to continue registration .\n\n“The Federal Government has approved the extension as part of its effort to make it easier for citizens and residents to obtain the NIN and it is important to take advantage of the extension.”\n\nHe reiterated government’s commitment to ease the pains of the Nigerians with regard to issues related to NIN and SIM registration as telecoms open more centers across the country.\n\nThis is the fifth time the government will extend the NIN-SIM linkage exercise.",
          "summary": "Nigerian government has extended the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise till June 30.\nThe NIN extension was granted based on stakeholders’ request and in order to give Nigerians more time to register.\nSo far 54 million Nigerians with an estimated 190 million mobile numbers have obtained their NIN.\nPart of the statement read: “The postponement of the deadline was also based on the request by stakeholders for an extension till 30th of June in order to make it easier for all Nigerians and legal residents to continue registration .\nThis is the fifth time the government will extend the NIN-SIM linkage exercise.",
          "link": "https://dailypost.ng/2021/05/04/nigerian-govt-extends-nin-sim-registration-till-june-30/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "till",
            "extension",
            "extends",
            "nin",
            "registration",
            "residents",
            "sim",
            "statement",
            "stakeholders",
            "govt",
            "30",
            "nigerian",
            "ninsim",
            "nigerians",
            "request"
          ]
        },
        {
          "title": "Bill Gates’s daughter, Jennifer laments parents' divorce",
          "text": "Following the news of Bill and Melinda Gates divorce, their oldest child, Jennifer Gates, has spoken on the issue.\n\nDAILY POST reported that Bill and Melinda announced on Monday that they will be going for a divorce after 27 years of marriage.\n\nThey said they could no longer work together but will continue to share a belief in the mission and will continue to work together at the foundation.\n\nTheir 25-year-old daughter, reacting to the news, disclosed that the family has been going through a ‘challenging stretch of time’ ever since the couple had the idea.\n\nJennifer, who is the oldest child of the Gates, on her Instagram page, said it’s been painful watching her parents split.\n\nHer post read: “I am still learning how to best support my own process and emotions as well as my family members at this time and am grateful for the space to do so.\n\n“I wouldn’t personally comment any further on their separation but please note your support and kind words mean the world to me.”\n\nBill and Melinda Gates have three children together. Jennifer is the oldest, followed by Rory, 21, and 18-year-old Phoebe.",
          "summary": "Following the news of Bill and Melinda Gates divorce, their oldest child, Jennifer Gates, has spoken on the issue.\nDAILY POST reported that Bill and Melinda announced on Monday that they will be going for a divorce after 27 years of marriage.\nJennifer, who is the oldest child of the Gates, on her Instagram page, said it’s been painful watching her parents split.\n“I wouldn’t personally comment any further on their separation but please note your support and kind words mean the world to me.”Bill and Melinda Gates have three children together.\nJennifer is the oldest, followed by Rory, 21, and 18-year-old Phoebe.",
          "link": "https://dailypost.ng/2021/05/04/bill-gatess-daughter-jennifer-laments-parents-divorce/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "work",
            "going",
            "family",
            "melinda",
            "post",
            "bill",
            "divorce",
            "support",
            "gates",
            "daughter",
            "gatess",
            "oldest",
            "laments",
            "jennifer",
            "parents"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "How Bill, Melinda Gates met, married, divorced after 27 years",
          "text": "By Alao Abiodun\n\nThe news of Bill Gates and his wife, Melinda Gates planned divorce has elicited a flurry of reactions.\n\nWhile the two are known for their incredible contributions to the tech world, all eyes are on their personal lives to see what happens with the divorce.\n\nThe Nation reports the billionaires, who are co-founders of one of the world’s largest private charitable foundations, the Bill and Melinda Gates Foundation, said they have come to an agreement on how to split their assets.\n\nThe couple said they would continue to work jointly at the foundation.\n\nBill Gates and Melinda Gates have been together for 27 years.\n\nThe two met via Microsoft, which is also how they amassed their enormous fortune.\n\n“We have raised three incredible children and built a foundation that works all over the world to enable all people to lead healthy, productive lives”\n\n“We ask for space and privacy for our family as we begin to navigate this new life,” the couple said in a statement posted on their separate Twitter handles.\n\nHow Bill and Melinda Gates met\n\nWilliam H. Gates grew up in Seattle and fell in love with machines and computer programming as a geeky-looking 13-year-old.\n\nADVERTISEMENT\n\nRead Also: Bill Gates ends marriage with Melinda\n\nHe was born on October 28, 1955.\n\nHe left Harvard University after two years to start “Micro-soft”, a software company, with a childhood friend.\n\nAlso, Melinda Gates was born Melinda French on August 15, 1964 in Dallas, Texas.\n\nThe first computer she ever used was an Apple II, and she developed an interest in computer games and programming at school.\n\nIn 1987, Melinda was hired as a product manager for the company, and she met Bill just three weeks after getting hired when she traveled to New York. Bill Gates’ age was just 32 at the time, and Melinda was 23.\n\nAfter their first meeting, Bill asked Melinda to go out dancing — but Melinda declined. They reconnected several months later, though.\n\nWhile Melinda declined Bill’s advances once again, they eventually went on a date. And it seems the rest is history.\n\nBill had to make sacrifices to make his relationship with Melinda work and run Microsoft but he decided it was worth it.\n\nThe two married in 1994.\n\nHow they got married\n\nThey got were married in 1994 in Hawaii after her work stint at Microsoft as a product manager in 1987.\n\nIn her 2019 memoir, “The Moment of Lift,” Melinda Gates wrote about her childhood, life, and private struggles as the wife of a public icon and stay-at-home mom with three kids.\n\nShe won Bill Gates’ heart after meeting at a work dinner, sharing a mutual love of puzzles and beating him at a math game.\n\nThey launched the Bill & Melinda Gates Foundation in 2000.\n\nBill and Melinda Gates foundation\n\nThe Bill and Melinda Gates Foundation is the most influential private foundation in the world, with an endowment worth nearly $50 billion, according to checks by The Nation.\n\nIt has focused on global health and development and US education issues since incorporating in 2000.\n\nAs the public face of the foundation’s COVID-19 grants and advocacy work, Bill Gates has come under fire for being a staunch supporter of intellectual property rights for vaccine makers.\n\nWhile the tech icon says protecting the shots’ recipes will ensure incentives for research and development, critics claim that mentality hampers supply in favor of drug company profits.\n\nLast year, Bill Gates said he was stepping down from Microsoft’s board to focus on philanthropy.\n\nHe was Microsoft’s CEO until 2000 and since then has gradually scaled back his involvement in the company he started with Paul Allen in 1975.\n\nHe transitioned out of a day-to-day role in Microsoft in 2008 and served as chairman of the board until 2014.",
          "summary": "By Alao AbiodunThe news of Bill Gates and his wife, Melinda Gates planned divorce has elicited a flurry of reactions.\nBill Gates and Melinda Gates have been together for 27 years.\nAlso, Melinda Gates was born Melinda French on August 15, 1964 in Dallas, Texas.\nThey launched the Bill & Melinda Gates Foundation in 2000.\nBill and Melinda Gates foundationThe Bill and Melinda Gates Foundation is the most influential private foundation in the world, with an endowment worth nearly $50 billion, according to checks by The Nation.",
          "link": "https://thenationonlineng.net/how-bill-melinda-gates-met-married-divorced-after-27-years/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "married",
            "work",
            "world",
            "melinda",
            "private",
            "microsoft",
            "foundation",
            "27",
            "gates",
            "company",
            "computer",
            "met",
            "divorced",
            "bill"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "BREAKING: FG again extends NIN deadline by 8 weeks",
          "text": "From Benjamin Babine, Abuja\n\nThe Federal Government through the Ministry of Communications and Digital Economy, has on Tuesday announced the extension of the deadline for the NIN-SIM linkage and verification by eight weeks, till June 30, 2021.\n\nThe extension which was disclosed in a jointly signed statement by the Nigerian Communications Commission (NCC) and the National Identity Management Commission (NIMC), is said to be because of requests by stakeholders so as to make it easier for all citizens and legal residents to register.\n\nThe meeting which was chaired by the Minister of Communications and Digital Economy, Dr Isa Pantami, was attended by the the Executive Vice Chairman/CEO of NCC, Prof Umar Dambatta, the Director-General/CEO of the National Identity Management Commission (NIMC), Engr Aliyu Azeez, amongst others.\n\nThe statement read in part: “The postponement of the deadline was also based on the request by stakeholders for an extension till 30th of June in order to make it easier for all citizens and legal residents to register.\n\n“Significant progress has been made in the NIN-SIM verification process. For example, almost 54 Million people have obtained their NIN and this can translate to up to 190 Million mobile numbers, since empirical evidence suggests that each unique NIN maps to 3 to 4 phone lines. The much awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\n\n“Furthermore, the telecom providers and other enrolment agents have also opened several centres across the country to make it easier for eligible citizens and residents to obtain and link their NINs.”\n\n“The Federal Government has approved the extension as part of its effort to make it easier for its citizens and residents to obtain the NIN and it is important to take advantage of the extension. Dr Pantami wishes to thank Nigerians for their patience and compliance with the Federal Government’s directive on the NIN-SIM registration exercise. He again reiterated government’s commitment to continually taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.”",
          "summary": "From Benjamin Babine, AbujaThe Federal Government through the Ministry of Communications and Digital Economy, has on Tuesday announced the extension of the deadline for the NIN-SIM linkage and verification by eight weeks, till June 30, 2021.\n“Significant progress has been made in the NIN-SIM verification process.\nThe much awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\nDr Pantami wishes to thank Nigerians for their patience and compliance with the Federal Government’s directive on the NIN-SIM registration exercise.\nHe again reiterated government’s commitment to continually taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.”",
          "link": "https://www.sunnewsonline.com/breaking-fg-again-extends-nin-deadline-by-8-weeks/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "extension",
            "nin",
            "extends",
            "residents",
            "weeks",
            "communications",
            "citizens",
            "easier",
            "federal",
            "breaking",
            "verification",
            "deadline",
            "fg",
            "commission",
            "ninsim"
          ]
        },
        {
          "title": "Jonathan advocates media freedom, responsible journalism",
          "text": "Goodluck Jonathan Foundation (GJF) has called on governments in Africa to ensure press freedom in their countries even as it calls on media professionals to use information as a tool for nation-building.\n\nThe foundation stated that the continent will be better off when information is used for public good and not as weapons of destruction and disintegration.\n\nA statement by the foundation Communications Officer, Dickson Ominabo, to commemorate the 2021 World Press Freedom Day (WPFD), quoted Executive Director of the Foundation, Ann Iyonu, as saying this year’s theme: ‘Information as a Public Good,’ is a call to action on the shared responsibilities between citizens and government to use information to advance justice, peace, security and development.\n\nThe foundation maintained that journalists and other media professionals are partners in progress in a quest for peace and sustainable development. Therefore, should be treated with respect and dignity.\n\n“GJF joins the rest of the world to celebrate journalists and media professionals on this year’s world press freedom day.\n\n“We renew our call for press freedom, access to information and the respect of the rights of journalists in Africa.\n\n“Across our continent are unsavoury reports of deaths of journalists, violations of their rights and media censorship by state actors.\n\n“According to the 2021 WPFD index by Reporters without Borders, there is a 13 percent deterioration in the abuse of rights and privileges of journalists in Africa in the last one year.\n\n“This, according to them, is ‘one of the reasons Africa remains the world’s most dangerous continent for journalists in 2021.’\n\n“Journalists and other media professionals are partners in progress in our quest for peace and sustainable development. They, like other professionals in our society, are patriots who deserve our support, encouragement and respect, therefore they should be treated with dignity and love.\n\n“We urge all stakeholders to reflect on the theme of this year’s celebration: ‘Information as a Public Good’, which serves as a call to action on the shared responsibilities between citizens and government to use information to advance justice, peace, security and development.\n\n“Our nations will be better off when information is used for public good and not as weapons of destruction and disintegration.\n\n“In this era of digital communications and media convergence, misinformation, fake news, and hate speech are becoming threats to press freedom, justice, unity, and development.\n\n“We, therefore, urge everyone; organisations and governments to place public interest ahead of other interests in their conversations and the discharge of their responsibilities even as we seek for a free press that will propagate truth and pursue hope and justice for all.”",
          "summary": "Goodluck Jonathan Foundation (GJF) has called on governments in Africa to ensure press freedom in their countries even as it calls on media professionals to use information as a tool for nation-building.\nThe foundation maintained that journalists and other media professionals are partners in progress in a quest for peace and sustainable development.\n“GJF joins the rest of the world to celebrate journalists and media professionals on this year’s world press freedom day.\n“We renew our call for press freedom, access to information and the respect of the rights of journalists in Africa.\n“In this era of digital communications and media convergence, misinformation, fake news, and hate speech are becoming threats to press freedom, justice, unity, and development.",
          "link": "https://www.sunnewsonline.com/jonathan-advocates-media-freedom-responsible-journalism/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "press",
            "professionals",
            "peace",
            "responsible",
            "media",
            "jonathan",
            "information",
            "journalism",
            "journalists",
            "public",
            "foundation",
            "justice",
            "advocates",
            "freedom"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "FG Extends NIN-SIM Linkage to June 30, as Enrolment Hits 54m",
          "text": "By Emma Okonji\n\nThe federal government has approved the extension of the deadline for National Identity Number (NIN)-SIM data verification from May 6 to June 30, 2021.\n\nThe decision to extend the date was reached at a virtual meeting chaired by the Minister of Communications and Digital Economy, Dr. Isa Ibrahim Pantami, which was attended by the Chairman of the Nigerian Communications Commission (NCC), Prof. Adeolu Akande; the Executive Vice-Chairman/CEO of NCC, Prof. Umar Garba Dambatta; and the Director-General/CEO of the National Identity Management Commission (NIMC), Aliyu Azeez.\n\nThe recent extension, which is the sixth since December 2020, when the directive for NIN-SIM integration exercise was first issued, was based on the request by stakeholders for an extension till June 30 in order to make it easier for all citizens and legal residents to register their NIN and link same with their registered SIM cards.\n\nThe Director, Public Affairs at NCC, Dr. Ikechukwu Adinde, and the Head, Corporate Communications at NIMC, Mr. Kayode Adegoke, who announced the recent extension in a joint statement signed by both of them, also announced that NIN enrolment has tranches 54 million.\n\nAccording to the statement, “Significant progress has been made in the NIN-SIM verification process. For example, almost 54 million people have obtained their NIN and this can translate to up to 190 million mobile numbers, since empirical evidence suggests that each unique NIN maps to 3 to 4 phone lines. The much awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\n\n“Furthermore, the telecom providers and other enrolment agents have also opened several centres across the country to make it easier for eligible citizens and residents to obtain and link their NINs.”\n\nIt is noteworthy that Sections 27 and 29 of the National Identity Management Commission Act, 2007 provides for the mandatory use of NIN for accessing several government services.\n\nThis is similar to the use of Social Security Number and National Insurance Number for accessing services in the United States of America and the United Kingdom respectively.\n\nThe federal government has approved the extension as part of its effort to make it easier for its citizens and residents to obtain the NIN and it is important to take advantage of the extension, the statement further said.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "By Emma OkonjiThe federal government has approved the extension of the deadline for National Identity Number (NIN)-SIM data verification from May 6 to June 30, 2021.\nThe Director, Public Affairs at NCC, Dr. Ikechukwu Adinde, and the Head, Corporate Communications at NIMC, Mr. Kayode Adegoke, who announced the recent extension in a joint statement signed by both of them, also announced that NIN enrolment has tranches 54 million.\nAccording to the statement, “Significant progress has been made in the NIN-SIM verification process.\nThe much awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\nThis is similar to the use of Social Security Number and National Insurance Number for accessing services in the United States of America and the United Kingdom respectively.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/fg-extends-nin-sim-linkage-to-june-30-as-enrolment-hits-54m/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "extension",
            "extends",
            "nin",
            "residents",
            "hits",
            "number",
            "national",
            "statement",
            "linkage",
            "enrolment",
            "54m",
            "ncc",
            "fg",
            "30",
            "identity",
            "ninsim"
          ]
        },
        {
          "title": "FG Moves to Curb Small Arms Influx, Establishes Control Centre",
          "text": "•Bauchi raises the alarm over Boko Haram threat to four LGAs\n\n•National Security Council reconvenes today\n\nBy Deji Elumoye, Kingsley Nwezeh in Abuja and Segun Awofadeji in Bauchi\n\nThe federal government yesterday intensified its efforts to curb the rising influx of small arms and light weapons into the country, a phenomenon believed to be responsible for the worsening insecurity in the polity.\n\nIt established the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\n\nA statement yesterday by the Office of the National Security Adviser (ONSA) and signed by Head, Strategic Communication, Mr. Zachari Usman, said the centre would be headed by Maj. Gen. A.M. Dikko (rtd) as pioneer coordinator.\n\nThis comes as the Bauchi State Government raised the alarm that bandits and people displaced by Boko Haram insurgents in the neighbouring Yobe State have infiltrated four local government areas in the state.\n\nHowever, as part of efforts to finetune strategy at combating insecurity, the National Security Council (NSC), headed by President Muhammadu Buhari, will reconvene today in Abuja to proffer lasting solutions to the security challenges facing the country.\n\nThe ONSA statement said the new centre, to be domiciled in the Office of the National Security Adviser, would replace the defunct Presidential Committee on Small Arms and Light Weapons and serve as the institutional mechanism for policy guidance, research and monitoring of all aspects of Small Arms and Light Weapons (SALW) in Nigeria.\n\nIt added: “This decision is part of the ongoing restructuring of Nigeria’s security architecture to address emerging threats and strengthen the regional mechanism for the control, prevention and regulation of SALW.\n\n“The impact of the proliferation of SALW across national borders in Africa and the Sahel region has resulted in terrorism, human trafficking, organised crime, and insurrections in West Africa and Nigeria.\n\n“As one of the measures in tackling this threat, the new centre will be fulfilling the requirements of the ECOWAS Moratorium on Import, Export, and Manufacture of Light Weapons as well as the UN Plan of Action to prevent, combat and eradicate the illicit trade in SALW.”\n\nIt said the centre would serve as the national focal point on SALW in Nigeria and lead a multi-stakeholder process involving government Ministries, Departments, Agencies (MDAs) and the civil society in implementing all national, the United Nations and ECOWAS plans of action on the control of SALW.\n\n“The centre will maintain international cooperation and also operate zonal offices in the six geo-political zones to ensure quick response and effective mobilisation of resources,” it added.\n\nThe ONSA said the pioneer National Coordinator, Dikko, had served in various capacities in and outside Nigeria.\n\nHe was a course director at the Kofi Annan International Peacekeeping Centre and Chief Instructor of the Nigerian Army Peacekeeping Centre.\n\nHe was also a Military Adviser, United Nation Office for West Africa, Director Peacekeeping Operations Defence Headquarters, Commander Operation Last Hold as well as Commander, Operation Lafiya Dole.\n\nHowever, security analysts have criticised the federal government’s action, saying the establishment of the centre without a strategy for the control of the influx of arms through the nation’s porous borders and the application of technology to monitor the movement of arms will make the centre become another bureaucratic arrangement not too different from the defunct presidential committee originally set up for the same purpose.\n\nA former Director of State Security (DSS), Mr. Mike Ejiofor, said the federal government should have applied the funding in procuring arms instead of creating another bureaucracy for diversion of funds.\n\nHe stated: “What is there? There was a committee on small and light weapons that was in place before. There should have been an audit of the one there before to see the successes and failures. It’s just another source of diversion of funds to me.\n\n“As I said we need to restructure and we need state police. I don’t think they will achieve any results. Are you going to force people to bring their arms without the existing structure, the security agencies?”\n\nHe added that the funding for the centre would have been deployed in the procurement of arms.\n\n“That is a diversion and still aimed at wasting our resources that would have been used to purchase armament,” he said.\n\nA retired security personnel of the equivalent rank of major general, who spoke on the condition of anonymity, described the centre as another duplication of bureaucracy, stressing that bureaucracies would not be able to manage borders.\n\n“It’s a duplication of bureaucracy. Whatever they try to do is a waste of time if the necessary things are not done.\n\n“They need a drone capacity that works 24 hours, seven days a week.\n\n“If they are serious about mopping up arms, the centre will need strong vehicular and air platforms (helicopters) to be able to respond quickly when arms smugglers are cited. That is where the work of such a centre is located,” he said.\n\nHe stated that if the centre would not be able to manage porous borders and apply drone technology in monitoring borders, it would not be successful.\n\n“If it cannot monitor the borders, it won’t work. Bureaucracies cannot manage borders without technology. A drone technology that will be able to see who is coming in through the borders to monitor who is bringing in arms”, he said.\n\nAccording to him, the borders in the North are almost unmanageable and a free for all situation.\n\nAlso, Executive Director, Rule of Law and Advocacy Center (RULAAC), Mr. Okechukwu Nwangwuma, said the government’s strategy to counter the threat of terrorism was ineffective.\n\nHe stated: “The responses adopted by the government are replete with flaws. The counterterrorism efforts of the government of Nigeria are mainly centred on military action and not guided by the national strategy (National Counter-Terrorism Strategy) released in 2014.\n\n“Even the NACTEST has been found to be fraught with gaps that question its suitability as a policy document for countering terrorism in Nigeria.\n\n“It is absolutely necessary to emplace a people-centred strategy for countering terrorism in Nigeria. Such a strategy must employ both government and non-governmental approaches.\n\n“I truly don’t see where the establishment of a centre for small and light weapons control comes in within the existing strategy. Experience shows that many people in government saddled with responsibilities think rather more about how to create new opportunities for patronage rather than well thought through initiatives that address the issues”.\n\nIn his contribution, a Principal Officer of the International Society for Civil Liberties and Rule of Law (Intersociety), Mr. Emeka Umeagbalasi, said security challenges confronting the nation at the moment might render the centre ineffective.\n\nHe wondered if the centre would deal with all components of the country fairly in its operations.\n\nHe said: “The question is how will the policy or centre work? Will it be evenly or unevenly implemented?\n\n“How do you recover arms from Boko Haram, ISWAP and herdsmen who have already taken up arms against the state?”\n\nHe stated that if the centre intended to mop up arms, it would require “mobilised disarmament” at peacetime which he said was better organised by international agencies.\n\nAccording to him, NCCSALW would be more effective when the country is seen as one.\n\n“In summary, it is a fire brigade approach and a smokescreen,” he added.\n\nOffering further clarification, a source at ONSA said six zonal coordinating offices were being set up.\n\n“The presidential committee (defunct) didn’t have an institutional mechanism because currently, the disposition does not favour a whole new bureaucracy to undertake law enforcement work. The NCCSALW, like the Counter Terrorism Centre, will serve the purpose, coordinating other security agencies to effectively tackle the proliferation of SALW.\n\n“Recall that the Border Closure Swift Response Exercise became Joint Border Patrol Team in which Nigeria is working with neighbouring countries in several areas including on small arms and light weapons.\n\n“The new centre will now have personnel drawn from other services to provide the technical input and undertake the work of mopping up illegal arms,” he added.\n\nBauchi Raises the Alarm over Boko Haram Threat to Four LGAs\n\nMeanwhile, the Bauchi State Government has raised the alarm that bandits and people displaced by Boko Haram insurgents in the neighbouring Yobe State have infiltrated four local governments of Dambam, Gamawa, Darazo and Zaki in the state.\n\nThe Secretary to the State Government (SSG), Mr. Mohammed Baba, raised the alarm yesterday while addressing journalists after an emergency security council meeting in Bauchi.\n\n“Following the overrunning of Geidam in Yobe State by the Boko Haram militants, there has been an influx of people into the state through four LGAs in the northern part of the Bauchi State. This influx of the displaced people has put the state under security threat; our facilities are now overstretched and we are not comfortable with the development,” he said.\n\nHe, however, said the government had taken steps to ensure that the threat did not turn into an attack, adding that “profiling of all the people coming into Bauchi State, particularly in the four affected LGAs, will be done in order to discover those with dangerous weapons and demonise them.”\n\nThe SSG assured the people that the state government would ensure that the joint operations of the security agencies would be intensified, particularly air surveillance around the affected LGAs.\n\nHe added that the people were not camped in a particular area but moving around the four LGAs and were harboured by residents of the communities, saying that security agencies would fish them out.\n\nThe government also said that five of the bandits who reportedly destroyed the MTN mast in Gamawa LGA in their bid to facilitate their nefarious activities had been arrested.\n\n“Some bandits have been arrested for vandalising the MTN installation in Gamawa LGA with the intention of blocking communication in the area in preparation for an attack,” he stated.\n\nNational Security Council Reconvenes Today\n\nThe National Security Council (NSC) headed by President Muhammadu Buhari will reconvene today in Abuja to proffer lasting solutions to the security challenges facing the country.\n\nThe council, which had met last Friday, could not conclude deliberations on the security position of the nation and had to adjourn till today to come with a holistic position on the security crisis.\n\nTHISDAY learnt that the meeting will hold at the Conference Hall of the First Lady by 10 am with Buhari presiding as usual.\n\nThose expected to attend the meeting include Vice President Yemi Osinbajo; the Secretary to the Government of the Federation (SGF), Mr. Boss Mustapha; the Chief of Staff to the President, Prof. Ibrahim Gambari and the National Security Adviser (NSA), Major-General Babagana Monguno (rtd).\n\nOthers are: Chief of Defence Staff (CDS), General Lucky Irabor; Chief of Army Staff, Lieutenant-General Ibrahim Attahiru; Chief of Naval Staff, Vice Admiral Awwal Zubairu; Chief of Air Staff; Chief of Air Staff, Air Marshal Ishiaka Oladayo Amoo and the Acting Inspector-General of Police (IGP), Usman Alkali Baba.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "It established the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThere was a committee on small and light weapons that was in place before.\nThe counterterrorism efforts of the government of Nigeria are mainly centred on military action and not guided by the national strategy (National Counter-Terrorism Strategy) released in 2014.\n“I truly don’t see where the establishment of a centre for small and light weapons control comes in within the existing strategy.\nNational Security Council Reconvenes TodayThe National Security Council (NSC) headed by President Muhammadu Buhari will reconvene today in Abuja to proffer lasting solutions to the security challenges facing the country.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/fg-moves-to-curb-small-arms-influx-establishes-control-centre/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "control",
            "moves",
            "centre",
            "influx",
            "light",
            "national",
            "small",
            "curb",
            "weapons",
            "fg",
            "arms",
            "strategy",
            "borders",
            "security",
            "state",
            "establishes"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "#MySARSStory: Out of Nowhere",
          "text": "A policeman, for no reason, opened fire on Godwin Udoh´s innocent family, changing their lives forever\n\n\n\nMy family and I were returning home from church, when we encountered some policemen. It was nighttime, and the headlights of our Keke (tricycle motor) illuminated the officers, making them visible. They seemed to be discussing something.\n\nGodwin Udoh\n\nAs we drove nearer, one of them brought out a gun and tried to hit me with it. Alarmed, I parked the Keke and went over to meet them, just to make sure everything was okay. My wife followed. Neither I nor any member of my family have ever had problems with the police, so we did not have anything to fear or hide.\n\nThe police men started to ask us questions. Then, one of them demanded a 2000 naira bribe. I told them I did not have 2000 naira on me. I was on my way home from church - not work. And I was with my family - as they could see by the presence of my wife by me and my children in the Keke.\n\nOne of the officers, upon recognizing that my story checked out - that I was indeed innocently in the company of my family - asked me to go.\n\nIn the process of getting back into the Keke, however, I suddenly heard gunshots. It came from behind me, where we had met the officers.\n\nIn that split second, I discovered my jaw had burst open. I had been shot.\n\nFile Photo\n\nConfused and in severe pain, I instinctively held my jaw and mouth together to prevent the loss of my blood, which was by that time gushing out like a pipe faucet forced open.\n\nThen, I heard shouts of ´Mummy is dying! Mummy is dying!´\n\nMy wife had been shot too, and she was bleeding even more seriously than I was, especially from her head.\n\nShe had sat back into our Keke and had been holding our baby when a bullet ripped through the back of the vehicle, ramming into her head and causing her to slump over the crying baby, who my daughter later picked up.\n\nLATE COMFORT IDONGESIT UDOH\n\nI later found out that the policeman who opened fire on us, unprovoked, was the same one who had earlier tried to hit me with a gun. I have still not understood why he fired so heartlessly at an unarmed family, when his colleague had asked us to drive on.\n\nWith my wife in a pool of blood, and my children wailing, I swallowed my own pain and tried to save my family by calling out for help. None of the cars passing by stopped to come to our aid, as they claimed they didn't want to be involved with anything concerning the infamously brutal police.\n\nOne good and brave samaritan however, eventually stopped and had mercy on us. He was a bus driver, and with the help of another kind lady who was around, they helped carry us to the hospital.\n\nWe were unsuccessful with getting treatment at two hospitals, before finally ending up at Ikorodu General Hospital. There, we were asked to submit a police report before receiving medical attention.\n\nWe went to the Idimu Area Command to get a report, but we were told to go back to the hospital because our case was an emergency which did not require a report.\n\nWe told the police that we had already told the hospital staff - and indeed they (the hospital staff) themselves could see that we were an emergency case - yet they still insisted on us producing a report before they would treat us.\n\nWe went back to Ikorodu General Hospital with the instructions the Idimu Area M Command had given us, but the hospital staff were still adamant: no police report, no treatment.\n\nThe driver of the bus had to go back to the Area Command to try again for a police report. Fortunately, and finally, he was able to obtain one. The staff of Ikorodu Hospital had begun first aid treatment on us by the time the driver returned with the report.\n\nWe were later referred to the Lagos University Teaching Hospital (LUTH), but just when we were about to set off, more problems arose: Our good samaritan found out that his bus had run out of fuel. We decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\n\nWhen we got to the Area Command, we met some top police officials who had just arrived there. They told us that they were coming from the Isheri Police Station, where the officers who had attacked us earlier were based. The police chiefs assured us that the officers had been arrested, and that the matter would be handled with the justice it deserved.\n\nThey then released a vehicle to convey us to LUTH. With the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.\n\nWhile my jaw and right hand sustained damage that still gives me issues today, my wife however couldn't live to tell her story.\n\nI really wish she had sustained only injuries like I had, but it wasn to be. This innocent, loving woman was a mother to my children and I, and now she is no more - for reasons no one can still explain.\n\nLosing the wife of my youth has been akin to losing my very life. I feel lost. I am not okay. I am in pain, physically and emotionally, and my children are out of school too.\n\nMy life has been turned upside down, and I have barely had help coming through for me. I am calling on all Nigerians, especially our President, His Excellency Muhammadu Buhari, the Governor of Lagos State, Babajide Sanwo-Olu, and the Governor of Akwa Ibom State, Udom Gabriel Emmanuel, to come to my aid.\n\nI pray people have compassion on my family, at least for the sake of my children, because I do not want this cruel tragedy to rob them of a good education. I do not want their future ruined because of this.\n\nThey will share these exclusive stories directly to your inbox as well as on their website.\n\n\n\nTo subscribe so you get the stories, click this link ð\u009f\u0091\u0089ð\u009f\u008f¾ https://t.co/RdKLhH8BQw ð\u009f\u0091\u0088ð\u009f\u008f¾ @tigereyefound\n\n\n\nTogether, we will end police brutality.\n\n[2/2] — Sahara Reporters (@SaharaReporters) April 20, 2021\n\n_______\n\nThis story is part of a multimedia project by Tiger Eye Foundation and media partners across Nigeria, documenting police brutality in Nigeria, and advocating for police reform.",
          "summary": "Godwin UdohAs we drove nearer, one of them brought out a gun and tried to hit me with it.\nThe driver of the bus had to go back to the Area Command to try again for a police report.\nWe decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\nWhen we got to the Area Command, we met some top police officials who had just arrived there.\nWith the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.",
          "link": "http://saharareporters.com/2021/05/04/mysarsstory-out-nowhere",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "help",
            "command",
            "family",
            "wife",
            "hospital",
            "children",
            "area",
            "mysarsstory",
            "report",
            "told",
            "officers"
          ]
        },
        {
          "title": "#MySARSStory: Out of Nowhere",
          "text": "A policeman, for no reason, opened fire on Godwin Udoh´s innocent family, changing their lives forever\n\n\n\nMy family and I were returning home from church, when we encountered some policemen. It was nighttime, and the headlights of our Keke (tricycle motor) illuminated the officers, making them visible. They seemed to be discussing something.\n\nGodwin Udoh\n\nAs we drove nearer, one of them brought out a gun and tried to hit me with it. Alarmed, I parked the Keke and went over to meet them, just to make sure everything was okay. My wife followed. Neither I nor any member of my family have ever had problems with the police, so we did not have anything to fear or hide.\n\nThe police men started to ask us questions. Then, one of them demanded a 2000 naira bribe. I told them I did not have 2000 naira on me. I was on my way home from church - not work. And I was with my family - as they could see by the presence of my wife by me and my children in the Keke.\n\nOne of the officers, upon recognizing that my story checked out - that I was indeed innocently in the company of my family - asked me to go.\n\nIn the process of getting back into the Keke, however, I suddenly heard gunshots. It came from behind me, where we had met the officers.\n\nIn that split second, I discovered my jaw had burst open. I had been shot.\n\nFile Photo\n\nConfused and in severe pain, I instinctively held my jaw and mouth together to prevent the loss of my blood, which was by that time gushing out like a pipe faucet forced open.\n\nThen, I heard shouts of ´Mummy is dying! Mummy is dying!´\n\nMy wife had been shot too, and she was bleeding even more seriously than I was, especially from her head.\n\nShe had sat back into our Keke and had been holding our baby when a bullet ripped through the back of the vehicle, ramming into her head and causing her to slump over the crying baby, who my daughter later picked up.\n\nLATE COMFORT IDONGESIT UDOH\n\nI later found out that the policeman who opened fire on us, unprovoked, was the same one who had earlier tried to hit me with a gun. I have still not understood why he fired so heartlessly at an unarmed family, when his colleague had asked us to drive on.\n\nWith my wife in a pool of blood, and my children wailing, I swallowed my own pain and tried to save my family by calling out for help. None of the cars passing by stopped to come to our aid, as they claimed they didn't want to be involved with anything concerning the infamously brutal police.\n\nOne good and brave samaritan however, eventually stopped and had mercy on us. He was a bus driver, and with the help of another kind lady who was around, they helped carry us to the hospital.\n\nWe were unsuccessful with getting treatment at two hospitals, before finally ending up at Ikorodu General Hospital. There, we were asked to submit a police report before receiving medical attention.\n\nWe went to the Idimu Area Command to get a report, but we were told to go back to the hospital because our case was an emergency which did not require a report.\n\nWe told the police that we had already told the hospital staff - and indeed they (the hospital staff) themselves could see that we were an emergency case - yet they still insisted on us producing a report before they would treat us.\n\nWe went back to Ikorodu General Hospital with the instructions the Idimu Area M Command had given us, but the hospital staff were still adamant: no police report, no treatment.\n\nThe driver of the bus had to go back to the Area Command to try again for a police report. Fortunately, and finally, he was able to obtain one. The staff of Ikorodu Hospital had begun first aid treatment on us by the time the driver returned with the report.\n\nWe were later referred to the Lagos University Teaching Hospital (LUTH), but just when we were about to set off, more problems arose: Our good samaritan found out that his bus had run out of fuel. We decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\n\nWhen we got to the Area Command, we met some top police officials who had just arrived there. They told us that they were coming from the Isheri Police Station, where the officers who had attacked us earlier were based. The police chiefs assured us that the officers had been arrested, and that the matter would be handled with the justice it deserved.\n\nThey then released a vehicle to convey us to LUTH. With the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.\n\nWhile my jaw and right hand sustained damage that still gives me issues today, my wife however couldn't live to tell her story.\n\nI really wish she had sustained only injuries like I had, but it wasn to be. This innocent, loving woman was a mother to my children and I, and now she is no more - for reasons no one can still explain.\n\nLosing the wife of my youth has been akin to losing my very life. I feel lost. I am not okay. I am in pain, physically and emotionally, and my children are out of school too.\n\nMy life has been turned upside down, and I have barely had help coming through for me. I am calling on all Nigerians, especially our President, His Excellency Muhammadu Buhari, the Governor of Lagos State, Babajide Sanwo-Olu, and the Governor of Akwa Ibom State, Udom Gabriel Emmanuel, to come to my aid.\n\nI pray people have compassion on my family, at least for the sake of my children, because I do not want this cruel tragedy to rob them of a good education. I do not want their future ruined because of this.\n\nThey will share these exclusive stories directly to your inbox as well as on their website.\n\n\n\nTo subscribe so you get the stories, click this link ð\u009f\u0091\u0089ð\u009f\u008f¾ https://t.co/RdKLhH8BQw ð\u009f\u0091\u0088ð\u009f\u008f¾ @tigereyefound\n\n\n\nTogether, we will end police brutality.\n\n[2/2] — Sahara Reporters (@SaharaReporters) April 20, 2021\n\n_______\n\nThis story is part of a multimedia project by Tiger Eye Foundation and media partners across Nigeria, documenting police brutality in Nigeria, and advocating for police reform.",
          "summary": "Godwin UdohAs we drove nearer, one of them brought out a gun and tried to hit me with it.\nThe driver of the bus had to go back to the Area Command to try again for a police report.\nWe decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\nWhen we got to the Area Command, we met some top police officials who had just arrived there.\nWith the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.",
          "link": "http://saharareporters.com/2021/05/04/mysarsstory-out-nowhere#disqus_thread",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "help",
            "command",
            "family",
            "wife",
            "hospital",
            "children",
            "area",
            "mysarsstory",
            "report",
            "told",
            "officers"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "FG to arraign 400 suspects arrested for funding Boko Haram, bandits",
          "text": "The federal government will arraign 400 suspects arrested for funding Boko Haram insurgents and bandits.\n\nAdvertisement\n\nThe suspects were arrested in an operation coordinated by the Defence Intelligence Agency (DIA), the Department of State Services (DSS), Nigerian Financial Intelligence Unit (NFIU) and the Central Bank of Nigeria (CBN).\n\nThey were arrested in Kano, Borno, Abuja, Lagos, Sokoto, Adamawa, Kaduna and Zamfara.\n\nThe operation was said to have been approved by President Muhammadu Buhari in 2020.\n\nAdvertisement\n\nA list of 957 suspects comprising bureau de change (BDC) operators, gold miners and sellers, and other business persons is still being acted upon.\n\nSome of the BDC operators arrested include Baba Usaini, Abubakar Yellow (Amfani), Yusuf Ali Yusuf (Babangida), Ibrahim Shani, Auwal Fagge, and Muhammad Lawan Sani, a gold dealer.\n\nUmar Gwandu, spokesperson to Abubakar Malami, attorney-general of the federation (AGF), on Monday, said criminal charges bordering on terrorism were already being prepared against the suspects while investigation continues.\n\nAdvertisement\n\nAlthough the spokesperson declined to give further details, he said the prosecution of the suspects “will commence as quickly as possible”.\n\nBut all courts across the country have been shut since April 6 owing to the nationwide strike by the Judiciary Staff Union of Nigeria (JUSUN) over financial autonomy for the judiciary.",
          "summary": "The federal government will arraign 400 suspects arrested for funding Boko Haram insurgents and bandits.\nAdvertisementThe suspects were arrested in an operation coordinated by the Defence Intelligence Agency (DIA), the Department of State Services (DSS), Nigerian Financial Intelligence Unit (NFIU) and the Central Bank of Nigeria (CBN).\nAdvertisementA list of 957 suspects comprising bureau de change (BDC) operators, gold miners and sellers, and other business persons is still being acted upon.\nSome of the BDC operators arrested include Baba Usaini, Abubakar Yellow (Amfani), Yusuf Ali Yusuf (Babangida), Ibrahim Shani, Auwal Fagge, and Muhammad Lawan Sani, a gold dealer.\nAdvertisementAlthough the spokesperson declined to give further details, he said the prosecution of the suspects “will commence as quickly as possible”.",
          "link": "https://www.thecable.ng/fg-to-arraign-400-suspects-arrested-for-funding-boko-haram-bandits",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "400",
            "operation",
            "bandits",
            "suspects",
            "spokesperson",
            "operators",
            "arrested",
            "nigeria",
            "judiciary",
            "arraign",
            "intelligence",
            "haram",
            "fg",
            "boko",
            "funding",
            "gold",
            "yusuf"
          ]
        },
        {
          "title": "Man sentenced for using dead mother's name to vote for Trump",
          "text": "Bruce Bartman, a Pennsylvania man who used his dead mother’s name to cast a vote for ex-President Donald Trump in the November 2020 election, has been sentenced to five years of probation.\n\nAdvertisement\n\nBartman was sentenced by the court after pleading guilty to two counts of perjury and one count of unlawful voting.\n\nHe was also barred from voting for four years.\n\nAccording to CNN, 70-year-old Bartman was accused of registering Elizabeth Bartman — his late mother — and Elizabeth Weihman, — his deceased mother-in-law — on the Pennsylvania voter registration portal as Republican voters.\n\nAdvertisement\n\nBartman, thereafter, sent in the absentee ballot for his deceased mother during the election.\n\nFollowing the judgment, Samuel Stretton, Bartman’s attorney, reportedly said his client’s action was “a misguided political mistake” and that he regrets the decision.\n\nBartman had reportedly explained to the court that he had been isolated at home owing to the COVID-19 pandemic and that he was misled by “propaganda and statements” that were made about voter fraud.\n\nAdvertisement\n\n“This was his way of misguided political dissent. He accepts the responsibility.” Stretton was quoted to have said.\n\nJoe Biden was declared president after polling more than 270 electoral votes, the threshold needed to win.\n\nBut Trump had alleged that he won the election by a wide margin, claiming the exercise was characterised by fraud.\n\nThe former US president had filed a series of lawsuits to challenge the outcome of the election but his claims were thrown out.\n\nAdvertisement\n\nHis supporters had also invaded Capitol Hill to protest the confirmation of Biden’s victory by the US congress.\n\nAfter the protest and backlash, he finally agreed to hand over to Biden after congress ratified the president-elect’s victory in the election.",
          "summary": "Bruce Bartman, a Pennsylvania man who used his dead mother’s name to cast a vote for ex-President Donald Trump in the November 2020 election, has been sentenced to five years of probation.\nAdvertisementBartman was sentenced by the court after pleading guilty to two counts of perjury and one count of unlawful voting.\nBut Trump had alleged that he won the election by a wide margin, claiming the exercise was characterised by fraud.\nAdvertisementHis supporters had also invaded Capitol Hill to protest the confirmation of Biden’s victory by the US congress.\nAfter the protest and backlash, he finally agreed to hand over to Biden after congress ratified the president-elect’s victory in the election.",
          "link": "https://www.thecable.ng/man-sentenced-for-using-dead-mothers-name-to-vote-for-trump",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "stretton",
            "bartman",
            "voter",
            "mothers",
            "sentenced",
            "dead",
            "victory",
            "reportedly",
            "trump",
            "man",
            "president",
            "protest",
            "using",
            "election",
            "vote"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Designing and building sustainable commercial spaces in Nigeria",
          "text": "It takes a great team to build an equally great product. Centre Stage exists to tell the behind-the-scenes stories of how products and companies are built in Africa. A new Centre Stage story drops every Monday at 3 PM.\n\nAs workplaces continue to re-open, many organizations are adopting the hybrid work model – a new working style that combines work remotely and from the office.\n\nThe hybrid work model is perfect for most businesses, especially those with heavy dependence on their operations and customer service teams.\n\nKobo360 is an example of a company with a robust operational and customer service team. The logistics startup helps cargo owners request and schedule trucks to pick up and deliver their goods to specified destinations.\n\nIt’s not hard to imagine how difficult it would have been to manage a call centre via Zoom and Meet. Kobo360 needed a new office that was uniquely designed to fit their business operations needs.\n\nTheir office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts. Innovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\n\nInterior photos of 360 Office at Surulere, Lagos.\n\nYinka meets Kobo360’s co-founders\n\nSo, what goes into planning and setting up a meeting with the founders of a YC-backed startup?\n\nThe first time I met with them was at the end of 2019. During our first meeting, we discussed what they needed in the space and what they were looking for in terms of design and style. And meeting them was a really great experience. Sometimes because of the scale of projects we work on, a lot of our clientele are usually older people. So it was really exciting to work with younger people. They are really brilliant guys.\n\nWas designing the office just a job for you?\n\nNo, it wasn’t. I enjoyed working with them. They understood everything I was saying and we were on the same wavelength. They encouraged and allowed us to be as creative as possible. It was like a match made in heaven for me.”\n\nDealing with tight deadlines and the 2020 pandemic:\n\nWhen you met them, had the company been accepted into YC?\n\n“Yes, they had. I first met them at the tail-end of 2018 and the following year, we pretty much came to an agreement about the work that needed to be done, amongst other things.”\n\nDid you know? When Obi Ozor was asked what was getting in the way of Kobo360 becoming a unicorn (a company valued at $1bn or more), Ozor responded with, “Working capital.”\n\nWhen did work officially start at the site?\n\n[laughs] They gave my team and I a really tight deadline so work pretty much began about two months after I met them. We had a month to design a concept, negotiate and all that; after the ink dried they wanted us on the job ASAP.\n\nWow. That was a really close first start. When was the project completed?\n\nIt was in different phases actually – the first phase was completed in the middle of 2020 and the second at the end of 2020.\n\nHow did the pandemic affect the work you did for kobo360?\n\nThe pandemic impacted our work in major ways. First, it affected the way we phased and spread out the work. Usually, when we carry out commercial projects, we like to work in four or five phases. It also affected our on-site procedures. We had to regulate working hours and the number of bodies we needed at the site. Proper planning and scheduling became even more important to accomplish our project goals.\n\nKobo360’s office design process\n\nCan you say more about the decision to work in phases and what that looked like for the kobo360 project?\n\nOkay, the first phase I think was the operations floor, and then the call centre. We phase our projects out for several reasons. One reason is financial. We try to ease our client’s financial burdens in terms of commitments. We also consider Kobo360’s operational team. They needed a space to transition into after the lockdown eased in Nigeria. Like I said, we had a really really tight deadline. We pretty much wrapped up the first phase in about a month or two. Wrapping up the first phase quickly allowed us to complete the other portions of the project in good time.\n\nYou mentioned that the founders cared about creativity. Can you tell me about how you accessed the creative side of your mind to specifically do this project.\n\nWe usually try to make all our projects as tailored to the client as much as possible. And we kept that same energy with Kobo360. They are a logistics company which means they pretty much empower freight trucks across Africa.\n\nKeeping their mission in mind, we visualized the expressways and highways freight trucks drive on and utilized them as inspiration for the design of the spine that connects the different functional spaces on the floor. Elements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\n\nWe wanted the space to be a physical representation of what the company actually does in the ecosystem.\n\nInterior photos of 360 Office at Surulere, Lagos.\n\nHow did you and your team visualize what Kobo360’s office would look like?\n\nIt was an iterative process. We watched a few videos about Kobo360 as our own way of trying to get inside the soul of the company. Our research into the company, outside of my conversations with the co-founders, informed our design process. Once we finally got to a place that we were comfortable with, we created 3D renderings and video walkthroughs and presented them to Kobo3060. There were a few back and forth feedback sessions – which are to be expected – but we wanted to satisfy our clients.\n\nSource: Innovate Concepts LTD.\n\nTell me something about design that most people don’t know?\n\nDesign must be organic.\n\nOrganic? Say more…\n\nSo, I remember being in school and whenever I heard constructive criticism about my design I got upset because I wanted to have my own way. But later I realised that to be a successful architect, you have to be willing to get other people’s perspectives. So design being organic means it being able to bend and make room for stakeholders in the process.\n\nLet’s return to Kobo360’s office. What areas in the space required special attention?\n\nThe part of the building that houses Kobo360’s call centre required special attention. You know there’s a lot of conversation and noise that happens in call centres. So in designing that space, we made it secluded from the general floor and also used a lot of sound-absorbing materials– like acoustic ceilings. Sound absorbent materials reduce noise and make an office a more conducive environment for employees to function in.\n\nInterior shoot of Kobo360 Office at Costain Lagos.\n\nSustainability, Nigeria’s architectural industry and Yinka’s early years\n\nHow should Nigeria approach innovation in your industry?\n\nIn Nigeria we typically don’t pay attention to being sustainable and eco-friendly. We prioritize costs and getting the work done quickly. Getting work done quickly is good, but Nigerian architects need to start designing with sustainability in mind. When we scope a building, we construct pathways for natural ventilation and daylight. We also prioritize using local materials over processed ones. This way of thinking seems expensive but in the long term, you actually save more money on energy.\n\nHmm…\n\nWith Kobo360, we used a lot of daylighting in the space. So again, during the day they hardly actually put on any of the artificial lights because there’s a lot of natural light coming in through the large windows placed around the office.\n\nWhy architecture? What inspired you to go down this path?\n\nWhy did I want to study architecture? it’s just something that you know has always been a passion. Funny enough, I was actually inspired by my father. He’s also an architect, so I guess that’s who planted the seed. But yeah I mean I tried it in university and loved it and I’ve never looked back. Architecture is what I have always wanted to do.\n\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria. Yinka moved back home to make a difference in the architectural industry; and he’s doing so by guiding Innovate Concepts, into the future of eco-friendly and culturally relevant design.",
          "summary": "Their office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts.\nInnovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\nLike I said, we had a really really tight deadline.\nElements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria.",
          "link": "https://techcabal.com/2021/05/03/designing-and-building-sustainable-commercial-spaces-in-nigeria/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "kobo360",
            "really",
            "design",
            "centre",
            "work",
            "nigeria",
            "wanted",
            "way",
            "commercial",
            "company",
            "space",
            "designing",
            "building",
            "office",
            "sustainable",
            "spaces"
          ]
        },
        {
          "title": "The Next Wave: Emefiele and other risks",
          "text": "Accelerators target a kind of company: a few months or a couple years old; ambitious; raw. Probably founded by people who have never built a fast-growing company from scratch, but have managerial or product-building experience.\n\nSome organisations set themselves up as places where teachable builders come to find ideas. But your typical accelerator works with founders who have a useful, usable and desirable product. Or at least a product that excites.\n\n(I use “accelerators” as the family name for these organisations. There are some differences, as Justin Norman shows in this piece from August last year.)\n\nWhat’s in the lab?\n\nY Combinator sets out to help founders make something people want. Michael Seibel, the firm’s MD for Early Stage told me YC doesn’t claim to be experts with answers.\n\nInstead, YC is a set of resources: an alumni network, a set of advice, a set of accountability practices, and access to more investors. It’s up to founders to use these as best fits their business.\n\n[ Read: Y Combinator’s MD wants to visit Nigeria and Egypt soon. What will he learn? ]\n\nYC critics always point out that the firm has no Africa partners. It limits the local context they can apply in advising and keeping startups accountable. So do accelerators with boots in Africa have an advantage to exploit?\n\nFounders Factory Africa claims it is becoming “the go-to innovation partner for startups, investors, governments, and corporates” in Africa and beyond. It was founded in 2018, is based in South Africa and offers separate programs for startups at build and scale stages.\n\nLike YC, Startupbootcamp Afritech is a 3-month program. But unlike YC, they are not shy about their “expert-led sessions” and “exclusive opportunities to take part in leading Commerce conferences.”\n\nSo if you put the accelerator’s pitch in three buckets, it would be money, market mentorship and management advisory.\n\nWhat’s missing?\n\nWhen I asked an African government advisor his thoughts on what holds startups back, he responded with two acronyms: VUCA and BYOE.\n\nVolatility. Uncertainty. Complexity. Ambiguity.\n\nBring Your Own Everything.\n\nThere are rich studies on both concepts but few focus on Africa, especially on how startups should deal with policy and regulatory risks.\n\nThis gap is yet to be filled in the African startup accelerator and ecosystem building wave; a structured approach to helping startups deal with teething public policy challenges.\n\nMaybe it’s because business schools have not developed many case studies to inform expert opinion. Maybe it’s because accelerators have insufficient experience dealing with African regulators.\n\nOr they don’t yet appreciate how much unilateral power some African regulators, like Nigeria’s Emefiele, have.",
          "summary": "Instead, YC is a set of resources: an alumni network, a set of advice, a set of accountability practices, and access to more investors.\nFounders Factory Africa claims it is becoming “the go-to innovation partner for startups, investors, governments, and corporates” in Africa and beyond.\nThere are rich studies on both concepts but few focus on Africa, especially on how startups should deal with policy and regulatory risks.\nThis gap is yet to be filled in the African startup accelerator and ecosystem building wave; a structured approach to helping startups deal with teething public policy challenges.\nOr they don’t yet appreciate how much unilateral power some African regulators, like Nigeria’s Emefiele, have.",
          "link": "https://techcabal.com/2021/05/03/the-next-wave-emefiele-and-other-risks/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "emefiele",
            "product",
            "policy",
            "startups",
            "africa",
            "wave",
            "set",
            "african",
            "studies",
            "accelerators",
            "yc",
            "founders",
            "risks"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Obaseki recommits to press freedom, charges journalists on peace, development journalism – Nigerian Observer",
          "text": "Share Facebook\n\nTwitter\n\nStumbleupon\n\nLinkedIn\n\nPinterest\n\nBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\n\nThe governor gave the charge in commemoration of this year’s World Press Freedom Day, marked by the United Nations and other sister agencies with the theme, “Information as a Public Good.”\n\nObaseki said journalists being the mirror of the society must discharge their duties diligently, upholding the ethics of the profession and providing only reliable, fact-based and accurate information to the public.\n\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n\n“Amid the many challenges currently facing the country, it is pertinent that the media as the watchdog of the society and members of the exalted fourth estate of realm, in the best interest of all Nigerians, use the pen to unite the people, focusing on contents and reportage that fosters unity, peace and development.”\n\nHe further tasked journalists on framing their reports to promote non-violent resolution of conflicts and other pressing societal issues, noting that such an approach to their duties will drive sustainable development.\n\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\n\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991. It is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.\n\nAccording to the UN, “The theme ‘Information as a Public Good’ serves as a call to renew the global commitment to freedom of expression, press freedom, and freedom of information, while acknowledging the new economic challenges faced by the media sector, the gate-keeping role of internet companies and their need for greater transparency, as well as the strong need for Media and Information Literacy capacities to be strengthened worldwide.”\n\n...",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991.\nIt is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.",
          "link": "http://nigerianobservernews.com/2021/05/obaseki-recommits-to-press-freedom-charges-journalists-on-peace-development-journalism/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "development",
            "press",
            "governor",
            "peace",
            "world",
            "challenges",
            "obaseki",
            "media",
            "journalists",
            "journalism",
            "recommits",
            "observer",
            "information",
            "public",
            "nigerian",
            "day",
            "freedom"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "text": "Night-grazing is banned with immediate effect. Movement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed. those who wish to carry on with their cattle-rearing business to register",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "immediate",
            "register",
            "web",
            "jan",
            "underaged",
            "movement",
            "highways",
            "wish",
            "cattle",
            "prohibited",
            "outlawed",
            "19",
            "nightgrazing"
          ]
        },
        {
          "title": "Dangote Cement to pay N40.3bn tax in Q1, 2021",
          "text": "Nigeria’s leading cement maker, Dangote Cement Plc will pay N40.39 billion in taxation to the nation’s treasury from its operational result in the first quarter of 2021, the company said.\n\nIn a statement, the cement manufacturer cited its published financial result on Friday, April 30, 2021, stating that the amount is due from corporate tax for the period ended March 31, 2021.\n\nThe taxation amount is 47.3 per cent higher this quarter than the N27.42bn paid in Q1 2020.\n\nDangote Cement currently pays over N240 million Value Added Tax (VAT) daily to the government, making it one of the biggest private-sector taxpayers, it stated.\n\nAccording to the company, it opted to provide funding for the construction of major roads in Lagos and Kogi states. “The roads are the critical Lagos Apapa Port road leading to the old toll gate and the Lokoja-Obajana-Kabba road straddling Kogi and Kwara states.”\n\nAccording to the report, the company ramped up production capacity in the Obajana Line 5 and resumed production at the Gboko plant to meet rising demands.\n\nThe firm also increased the total volume of cement sold in Q1 2021 from its Nigerian operations to 4.9 metric tonnes (MT) compared to the 4MT sold in Q1 2020. Its pan-African operations sold 2.6MT of cement compared to 2.3MT in the first quarter of last year.\n\nCommenting on the financial result, Dangote Cement GMD/Chief Executive Officer, Michel Puchercos, said the company started the first quarter of 2021 on a positive note with N89.7bn profit after tax.\n\n“We took the strategic decision to pause our clinker exports to ensure we meet the rapid volume growth in the Nigerian domestic market. We are improving the output of our existing and new assets and aim to recommence clinker exports in the second quarter.\n\n“Our Pan-Africa operations have reached new heights, with an EBITDA margin of 25.5 per cent and volume growth of 12.8% reported during the quarter.”",
          "summary": "Nigeria’s leading cement maker, Dangote Cement Plc will pay N40.39 billion in taxation to the nation’s treasury from its operational result in the first quarter of 2021, the company said.\nIn a statement, the cement manufacturer cited its published financial result on Friday, April 30, 2021, stating that the amount is due from corporate tax for the period ended March 31, 2021.\nThe firm also increased the total volume of cement sold in Q1 2021 from its Nigerian operations to 4.9 metric tonnes (MT) compared to the 4MT sold in Q1 2020.\nIts pan-African operations sold 2.6MT of cement compared to 2.3MT in the first quarter of last year.\nCommenting on the financial result, Dangote Cement GMD/Chief Executive Officer, Michel Puchercos, said the company started the first quarter of 2021 on a positive note with N89.7bn profit after tax.",
          "link": "https://hallmarknews.com/dangote-cement-to-pay-n40-3bn-tax-in-q1-2021/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "quarter",
            "result",
            "tax",
            "2021",
            "n403bn",
            "volume",
            "operations",
            "pay",
            "company",
            "q1",
            "dangote",
            "cement",
            "taxation",
            "sold"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Lawyers At WCTL Speak On Police Brutality In Light Of George Floyd’s Death And #BLM Protests",
          "text": "By Our Correspondent\n\nGeorge Floyd’s death has caused a conversation about police brutality like never before in America.\n\nProtests around the county have brought Black Lives Matter into the public consciousness, and this has led to an awareness of how the police treat the people they’re supposed to protect.\n\nThe lawyers at West Coast Trial Lawyers (WCTL) are highly sympathetic to the Black Lives Matter movement’s supporters and want to help their clients move the discourse forward.\n\nNeama Rahmani is the President and Chief Executive Officer of WCTL. He spent years defending big organizations and corporations like Disney and the Catholic Church but realized that he wanted to work for the people.\n\nHe feels strongly that the Black Lives Matter movement is transforming America.\n\n“No one should face violence just for being Black,” Neama said.\n\n“I’m willing to pursue lawsuits for my clients that will fight against police brutality.” Indeed, Neama recently filed a $10 million claim for a client who was hit by a rubber bullet at a protest about George Floyd’s death.\n\nADVERTISEMENT\n\n“Protesting isn’t a crime, and my client wasn’t doing anything to hurt the police. Using rubber bullets was unfounded, and I can’t wait until we see our day in court.”\n\nAllen Patatanyan is the firm’s co-founder, and he also feels strongly about helping Black people who have faced police brutality.\n\n“The way policing is done has gotten out of hand,” he said. “I hope that George Floyd’s trial will bring to light the horrible ways that the cops treated him and the fact that kneeling on his neck for so long really is murder.”\n\nThe staff at WCTL are passionate about helping everyday people from all walks of life. This includes marginalized people like protestors and Black individuals who have experienced police brutality.",
          "summary": "By Our CorrespondentGeorge Floyd’s death has caused a conversation about police brutality like never before in America.\nProtests around the county have brought Black Lives Matter into the public consciousness, and this has led to an awareness of how the police treat the people they’re supposed to protect.\nThe lawyers at West Coast Trial Lawyers (WCTL) are highly sympathetic to the Black Lives Matter movement’s supporters and want to help their clients move the discourse forward.\nHe feels strongly that the Black Lives Matter movement is transforming America.\n“No one should face violence just for being Black,” Neama said.",
          "link": "https://leadership.ng/lawyers-at-wctl-speak-on-police-brutality-in-light-of-george-floyds-death-and-blm-protests/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "brutality",
            "protests",
            "wctl",
            "light",
            "lives",
            "rubber",
            "floyds",
            "matter",
            "strongly",
            "neama",
            "black",
            "trial",
            "speak",
            "blm",
            "george",
            "death",
            "lawyers"
          ]
        },
        {
          "title": "BREAKING: Federal Govt Extends NIN-SIM Linkage To June",
          "text": "BY OUR CORRESPONDENT\n\nThe Federal Government has extended the ongoing National Identification Number (NIN) registration and linkage with Subscriber Identity Module (SIM) exercises with a new deadline of June 30, 2021.\n\nThis was disclosed in a statement jointly signed by the head of Corporate Communications (NIMC), Kayode Adegoke and Director of Public Affairs (NCC), Dr Ikechukwu Adinde made available to journalists in Abuja, on Tuesday.\n\nThey noted that the extension was as a result of the virtual meeting chaired by the Minister of Communications and Digital Economy, Dr Isa Ali Ibrahim Pantami, and attended by the chairman of the Nigerian Communications Commission (NCC), Prof Adeolu Akande.\n\nOther in attendance were the Executive Vice Chairman/CEO of NCC, Prof Umar Garba Dambatta and the Director-General/CEO of the National Identity Management Commission (NIMC), Engr Aliyu Azeez.\n\nThe postponement of the deadline was also based on the request by stakeholders for an extension till June 30 in order to make it easier for all citizens and legal residents to register.\n\nThe statement reads: “Significant progress has been made in the NIN-SIM verification process. For example, almost 54 Million people have obtained their NIN and this can translate to up to 190 million mobile numbers, since empirical evidence suggests that each unique NIN maps to 3 to 4 phone lines. The much awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\n\n“Furthermore, the telecom providers and other enrolment agents have also opened several centres across the country to make it easier for eligible citizens and residents to obtain and link their NINs.\n\nADVERTISEMENT\n\n“It is noteworthy that Sections 27 and 29 of the National Identity Management Commission Act 2007 provides for the mandatory use of National Identity Number for accessing several government services. This is similar to the use of Social Security Number and National Insurance Number for accessing services in the United States of America and the United Kingdom respectively.\n\n“The Federal Government has approved the extension as part of its effort to make it easier for its citizens and residents to obtain the NIN and it is important to take advantage of the extension.”\n\nPantami also thanked Nigerians for their patience and compliance with the Federal Government’s directive on the NIN-SIM registration exercise.\n\nHe reiterated government’s commitment to continually taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.",
          "summary": "BY OUR CORRESPONDENTThe Federal Government has extended the ongoing National Identification Number (NIN) registration and linkage with Subscriber Identity Module (SIM) exercises with a new deadline of June 30, 2021.\nOther in attendance were the Executive Vice Chairman/CEO of NCC, Prof Umar Garba Dambatta and the Director-General/CEO of the National Identity Management Commission (NIMC), Engr Aliyu Azeez.\nADVERTISEMENT“It is noteworthy that Sections 27 and 29 of the National Identity Management Commission Act 2007 provides for the mandatory use of National Identity Number for accessing several government services.\nThis is similar to the use of Social Security Number and National Insurance Number for accessing services in the United States of America and the United Kingdom respectively.\nHe reiterated government’s commitment to continually taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.",
          "link": "https://leadership.ng/breaking-federal-govt-extends-nin-sim-linkage-to-june/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "extension",
            "extends",
            "nin",
            "residents",
            "number",
            "citizens",
            "federal",
            "breaking",
            "national",
            "linkage",
            "ncc",
            "govt",
            "registration",
            "identity",
            "ninsim"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "NIN-SIM Linkage: Federal government extends to June 30th",
          "text": "The ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise has been extended till June 30 by the federal government.\n\nMinister of communications and digital economy, Isa Pantami reportedly gave the directive after a virtual meeting with Adeolu Akande, NCC chairman; Umar Garba Dambatta, executive vice president of NCC, and Aliyu Azeez, director-general of NIMC.\n\nThis was confirmed in a statement jointly signed by Ikechukwu Adinde, Director of Public Affairs at the Nigerian Communications Commission (NCC), and Kayode Adegoke, Head of Corporate Communications at the National Identity Management Commission (NIMC).\n\nIt was also learnt that almost 54 million Nigerians with an estimated 190 million mobile numbers have obtained their NIN.\n\nThe statement read; “The postponement of the deadline was also based on the request by stakeholders for an extension till 30th of June in order to make it easier for all citizens and legal residents to register.\n\nREAD ALSO: Warri Kingdom’s missing crown: Police recover keys to where items are kept\n\n“Significant progress has been made in the NIN-SIM verification process. For example, almost 54 million people have obtained their NIN and this can translate to up to 190 million mobile numbers since empirical evidence suggests that each unique NIN maps to 3 to 4 phone lines.”\n\nThe Ministry which stated that the NIN is similar to the social security number and the national insurance number in the United States and the United Kingdom respectively, added that it is important for accessing public services in line with sections 27 and 29 of the NIMC Act, 2007.\n\nThe statement added; “The much-awaited Android enrolment system is now ready for deployment and this has the potential to significantly accelerate the speed and ease of enrolments.\n\n“Furthermore, the telecom providers and other enrolment agents have also opened several centres across the country to make it easier for eligible citizens and residents to obtain and link their NINs.\n\n“The Federal Government has approved the extension as part of its effort to make it easier for its citizens and residents to obtain the NIN and it is important to take advantage of the extension.\n\n“Dr. Pantami wishes to thank Nigerians for their patience and compliance with the Federal Government’s directive on the NIN-SIM registration exercise. He again reiterated the government’s commitment to continue taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.”",
          "summary": "The ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise has been extended till June 30 by the federal government.\nIt was also learnt that almost 54 million Nigerians with an estimated 190 million mobile numbers have obtained their NIN.\nREAD ALSO: Warri Kingdom’s missing crown: Police recover keys to where items are kept“Significant progress has been made in the NIN-SIM verification process.\nPantami wishes to thank Nigerians for their patience and compliance with the Federal Government’s directive on the NIN-SIM registration exercise.\nHe again reiterated the government’s commitment to continue taking decisions aimed at easing the pains of the citizens with regard to issues related to NIN and SIM registration.”",
          "link": "https://dailytimes.ng/nin-sim-linkage-federal-government-extends-to-june-30th/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "extends",
            "nin",
            "residents",
            "30th",
            "million",
            "federal",
            "citizens",
            "easier",
            "statement",
            "national",
            "linkage",
            "ncc",
            "number",
            "ninsim"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "FG extends NIN-SIM linkage till June 30",
          "text": "The ongoing National Identification Number and Subscriber Identity Module integration exercise has been extended till June 30, 2021, Minister of Communications and Digital Economy, Isa Pantami, has said.\n\nThis was contained in a statement jointly signed by the Director, Public Affairs, Nigerian Communications Commission, Ikechukwu Adinde; and the Head, Corporate Communications, National Identity Management Commission, Káyọ̀dé Adegoke.\n\nThe minister, who has been under fore of late over his past pro-Taliban radical comments, was also said to have disclosed that 54 million SIM cards have been linked with NIN.\n\nDetails later…Punch\n\nShare this: Twitter\n\nFacebook\n\n\n\nLike this: Like Loading...",
          "summary": "The ongoing National Identification Number and Subscriber Identity Module integration exercise has been extended till June 30, 2021, Minister of Communications and Digital Economy, Isa Pantami, has said.\nThis was contained in a statement jointly signed by the Director, Public Affairs, Nigerian Communications Commission, Ikechukwu Adinde; and the Head, Corporate Communications, National Identity Management Commission, Káyọ̀dé Adegoke.\nThe minister, who has been under fore of late over his past pro-Taliban radical comments, was also said to have disclosed that 54 million SIM cards have been linked with NIN.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading...",
          "link": "https://daylightng.com/fg-extends-nin-sim-linkage-till-june-30/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "till",
            "extends",
            "communications",
            "subscriber",
            "sim",
            "minister",
            "national",
            "statement",
            "linkage",
            "twitterfacebooklike",
            "fg",
            "30",
            "commission",
            "identity",
            "ninsim"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Importance Of World Press Freedom Day",
          "text": "May 3, 2021 230\n\nAs people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\n\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\n\nHistory of World Press Freedom Day\n\nThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\n\nThe conference convened in Windhoek, Namibia was themed ‘Promoting an Independent and Pluralistic African Media’.\n\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\n\nREAD ALSO: Ngige Faults Governors Paying Below Minimum Wage\n\nSignificance of the Celebration\n\nGlobally, journalists are often objects of attack due to the role they play in spotlighting fact-based stories exposing a rot in a system.\n\nAccording to Article 19, there were 51 incidents of attacks on journalists in 2020 alone, while in the prior year, 19 journalists were attacked by government officials in Nigeria.\n\nThe article showed that three journalists were killed in 2020: two by unidentified individuals and one by security forces in Nigeria’s capital Abuja.\n\nWhile in other parts of the country, 31 journalists faced various forms of attacks.\n\nGovernment officials remain the strongest opposition to journalism in Nigeria, leaving journalists exposed to assaults without proper protection.\n\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.\n\nThe report compiled by Reporters without Borders stated, “Nigeria is now one of West Africa’s most dangerous and difficult countries for journalists, who are often spied on, attacked, arbitrarily arrested or even killed.”\n\nIt added that “the defence of quality journalism and the protection of journalists are very far from being government priorities.”\n\nReports such as those mentioned above prove that World Press Freedom Day continues to remain significant, as journalists need to thrive in less hostile environments to conduct their journalistic businesses in a fair manner.",
          "summary": "May 3, 2021 230As people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\nHistory of World Press Freedom DayThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.",
          "link": "https://bizwatchnigeria.ng/importance-of-world-press-freedom-day/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "press",
            "importance",
            "world",
            "nigeria",
            "united",
            "territories",
            "journalists",
            "themed",
            "freedom",
            "day",
            "countries"
          ]
        },
        {
          "title": "ANALYSIS: New Policy Fails To Reverse Gas Flaring, Importation",
          "text": "May 3, 2021 439\n\nTo reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\n\nThe initiative was introduced in 2016 to eliminate gas flaring by capturing it during oil exploration and making the gas available for sale to private firms who will be screened through a transparent bidding process.\n\nThe plan was that by 2020, the programme being handled by a team of professionals led by the Project Manager, Justice Derefaka, will bring gas flaring to an end.\n\nHowever, as of April 2021, the practice which leads to waste of significant volume of gas resources and potential revenue continues despite the existence of a regulation and insufficient local supply of gas to meet demand.\n\nIn order to achieve zero gas flaring by 2020, a framework was designed to ensure an open, fair and transparent bidding process by investors who will monetise flare gas, that the investors get the gas at a fair price, improve flare gas monitoring and flare payment enforcement.\n\nThe country has missed the 2020 target as this valuable energy resource is wasted and more money is misused on importation of gas to plug gaps in local production. At the same time, Nigeria’s gas-powered electricity plants suffer from gas shortage leading to widespread regular power outage.\n\nREAD ALSO: Nigeria Imports 58% Cooking Gas From Equatorial Guinea, Others\n\nNigeria has been in the practice of setting gas flaring elimination targets and missing them as seen in the target set for 2007, 2008, and 2010.\n\nWhy Is Gas Flaring A Problem For Nigeria?\n\nFor over 60 years, Nigeria has been battling with gas flaring, which is a common practice during oil extraction when natural gas is burned instead of removing, re-injection or storing for sale.\n\nThis natural gas that is allowed to burn in the atmosphere leaves releases excess amount to carbondioxide and methane, causing environmental pollution, affecting health, safety, and quality of life in the environment.\n\nNigeria successive government administrations have reiterated their commitment to cleaning up the industry and the Nigeria Delta region but despite warnings and deadlines by the Federal Government to oil companies to stop gas flaring, the practice still continues.\n\nNigeria has the largest proven reserve of gas in Africa and the seventh largest gas flaring nation in the world for nine years running according to a latest report by the World Bank.\n\nHowever, the report stated that Nigerian has recorded significant progress over the past 15 years as the country has reduced its gas flaring by 70 percent to just 7 billion cubic metres in 2020.\n\nIn 2015, data from the Department of Petroleum Resource (DPR) showed that oil and gas companies flared 330.93 million scf of gas equivalent to a potential revenue loss of N243.04 billion.\n\nThe following year, the country lost 288.92 million scf of gas to flaring amounting to N229.86 billion. In 2017, over 324.19 million scf of gas was flared equivalent to potential revenue of N267.85 billion while in 2018, 282.08 million scf gas valued at N233.05 billion was burnt off and wasted.\n\nIn January and February alone, data obtained from the Nigerian National Petroleum Corporation (NNPC) showed that a total of 26.06 billion standard cubic feet of natural gas was flared in January and February 2021.\n\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\n\nImporting Gas In The Midst Of Abundant Reserves\n\nFor some years now, Nigeria has been importing Liquefied Petroleum Gas (LPG), also known as cooking gas for neighboring countries as well as the India and United States in order to meet up with local demand.\n\nAccording to the data obtained by BizWatch Nigeria from the Petroleum Products Pricing Regulatory Agency (PPPRA)), more than half of the cooking gas consumed in the country in the first three months of the year was imported from Equatorial Guinea and two other countries.\n\nNigeria, which ranks as the ninth largest natural gas reserve globally, imports cooking gas from Equatorial Guinea, which has only 1.3 trillion cubic feet gas reserves and ranks as the 65th largest globally.\n\nMarketers also imported from the United States and Argentina during the period under review to bridge the production shortfall.\n\nThe report showed that marketers imported a total of 170,419.286 metric tonnes from January to March this year.\n\nREAD ALSO: OPEC Agrees To Ease Crude Oil Production Cuts From May\n\nWhile they were only able to produce 123,498.317 metric tonnes of cooking gas during the period under review, representing 42 per cent of total gas consumed during that period.\n\nMeanwhile, the Executive Secretary/Chief Executive Officer, Nigerian Association of Liquefied Petroleum Gas Marketers, Mr Bassey Essien, explained that the majority of the cooking gas produced is exported and reimported.\n\nHe said, “Most of the gas we consume is imported, with the associated high costs, based on foreign exchange availability.\n\n“So, when gas is readily available, and supply outstrips demand, then the price will hover at a very comfortable region. But when at every point in time, the demand outstrips supply, the price will go up.\n\nAgain, the commodity comes into the country at a high cost. Sometime last year, a 20-metric-tonne truck was sold for N3.6m.\n\nAccording to him, the commodity has become expensive as the price is N5million and N6million.\n\nEssien called for full domestication of LPG in the country to prevent capital flight through importation of the commodity.\n\nNew Target Set For 2025\n\nWith the country failing to meet the 2020 target to end gas flaring, Minister of State for Petroleum Resources, Timipre Sylva, says the country is committed to a new target for the elimination of gas flaring.\n\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\n\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent. If you all recall, in 2020, the ministry of petroleum started what we call the National Gas Expansion Programme and we declared year 2020 as the year of gas,” Sylva said.\n\n“At the beginning of this year, we also declared year 2021 the beginning of the gas decade. We believe that with all the programmes we have in place, we are on course to achieving complete elimination of gas flaring by 2025.”\n\nThe Federal Government has made commitments to the Paris Agreement of the United Nations Framework Convention on Climate Change (UNFCCC) to be part of the global flare-out by 2030.\n\nIt remains to be seen if the government would be able to surmount the hurdles and achieve the new target to eliminate flaring by 2025.",
          "summary": "May 3, 2021 439To reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent.",
          "link": "https://bizwatchnigeria.ng/analysis-new-policy-fails-to-reverse-gas-flaring-importation/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "importation",
            "petroleum",
            "flaring",
            "policy",
            "2020",
            "gas",
            "nigeria",
            "analysis",
            "target",
            "fails",
            "country",
            "reverse",
            "oil",
            "nigerian",
            "cooking"
          ]
        }
      ]
    }
  }
}