{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Africa's first agricultural electronic centre launched in Ibadan -",
          "summary": "Kindly Share This Story:By Adeola BadruInspired by the determination to make precision farming more accessible and affordable to farmers anywhere on African soil, a leading agribusiness expert, Azeez Oluwole, has launched Africa’s first agricultural electronic centre in Ibadan, the capital of Oyo State.\nThe launching which was officially performed yesterday, by Governor ‘Seyi Makinde, held at the international headquarters of FarmKonnect Agribusiness Nigeria Plc, at Bashorun, Ibadan, was also aimed at changing the digital-data narrative of Africa’s agricultural system.\nOluwole, the Chief Executive Officer of FarmKonnect Agribusiness Nigeria, while speaking, noted that it was time the country looked towards deliberate and aggressive collaborative investments into food security.\nOluwole disclosed that the two components of the initiative are FarmKonnect Agricultural Electronic extension Service Centre (FAgEX) and FarmKonnect Institute for Data and Agricultural Studies (FIDAS).\nHe said: “FarmKonnect Agricultural Electronic Extension Service Centre (FAgEX) is established with the intent to accelerate controlled environment farming practices in Africa.",
          "link": "https://www.vanguardngr.com/2021/04/africas-first-agricultural-electronic-centre-launched-in-ibadan-2/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "agriculture",
            "centre",
            "food",
            "farmkonnect",
            "data",
            "security",
            "agribusiness",
            "africa",
            "launched",
            "modern",
            "agricultural",
            "africas",
            "nigeria",
            "ibadan",
            "electronic"
          ]
        },
        {
          "title": "Africa’s first agricultural electronic centre launched in Ibadan",
          "summary": "Kindly Share This Story:By Adeola BadruInspired by the determination to make precision farming more accessible and affordable to farmers anywhere on African soil, a leading agribusiness expert, Azeez Oluwole, has launched Africa’s first agricultural electronic centre in Ibadan, the capital of Oyo State.\nThe launching which was officially performed yesterday, by Governor ‘Seyi Makinde, held at the international headquarters of FarmKonnect Agribusiness Nigeria Plc, at Bashorun, Ibadan, was also aimed at changing the digital-data narrative of Africa’s agricultural system.\nOluwole, the Chief Executive Officer of FarmKonnect Agribusiness Nigeria, while speaking, noted that it was time the country looked towards deliberate and aggressive collaborative investments into food security.\nOluwole disclosed that the two components of the initiative are FarmKonnect Agricultural Electronic extension Service Centre (FAgEX) and FarmKonnect Institute for Data and Agricultural Studies (FIDAS).\nHe said: “FarmKonnect Agricultural Electronic Extension Service Centre (FAgEX) is established with the intent to accelerate controlled environment farming practices in Africa.",
          "link": "https://www.vanguardngr.com/2021/04/africas-first-agricultural-electronic-centre-launched-in-ibadan/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "agriculture",
            "centre",
            "food",
            "farmkonnect",
            "data",
            "security",
            "agribusiness",
            "africa",
            "launched",
            "agricultural",
            "africas",
            "nigeria",
            "farming",
            "ibadan",
            "electronic"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "We will overcome insecurity",
          "summary": "President Muhammadu Buhari has assured Nigerians that the nation will overcome the current security challenges.\nMajor General Babagana Monguno (rtd), National Security Adviser, made this known on Friday after a parley the President summoned.\nOn Friday, Buhari hosted security chiefs at the State House to deliberate the active threats to lives and property of the citizens nationwide.\nAccording to Monguno, the Nigerian leader said “while the insurgents, bandits and criminals are still at it, he has no doubt that the security agencies and all of us as a nation will certainly overcome the current security problems”.\nPresident is very prepared to take profound measures in the wider interest of the people and the Nigerian nation.",
          "link": "https://dailypost.ng/2021/04/30/we-will-overcome-insecurity-buhari-assures-nigerians/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "wider",
            "monguno",
            "current",
            "threats",
            "buhari",
            "security",
            "nation",
            "nigerian",
            "overcome",
            "president",
            "insecurity"
          ]
        },
        {
          "title": "Reviewed pensions to take effect from 2019",
          "summary": "The Acting Chairman of the National Salaries, Income and Wages Commission, Ekpo Nta has said that the reviewed pension for retired workers will take effect from April 2019.\nNta explained that no pensioner will be cheated as the backlog of the reviewed pensions will be paid to all pensioners.\nHe said this in Calabar while speaking on the status of the new pension which was approved by the president two years ago.\n“The circular indicating the pension increases for pensioners under the defined pension scheme was issued yesterday to all relevant stakeholders for immediate implementation with effect from 18th April 2019.\n“I thank all stakeholders and our patient pensioners for bearing with the processes that have finally culminated in the successful conclusion of the matter.",
          "link": "https://dailypost.ng/2021/04/30/reviewed-pensions-to-take-effect-from-2019-ekpo-nta/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "effect",
            "seamless",
            "country",
            "implementation",
            "stakeholders",
            "pensioners",
            "increases",
            "reviewed",
            "pensions",
            "pension",
            "proactive",
            "2019"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "We’ll do all it takes to end insecurity – Buhari",
          "summary": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari has said his administration would do all that is required to tackle the debilitating security crisis besetting it from all fronts.\nThe President’s assurance was expressed in a statement by the National Security Adviser (NSA) Major-General Babagana Monguno (Rtd) after Friday’s crucial National Security Council meeting.\nPresident is very prepared to take profound measures in the wider interest of the people and the Nigerian nation.\nVarious stakeholders have been tasking Buhari to take all steps to reverse the trend of violent events across the country.\nThe meeting came on the heels of escalating insecurity in different parts of the country and general outcry by various stakeholders calling for an urgent action from the President.",
          "link": "https://thenationonlineng.net/well-do-all-it-takes-to-end-insecurity-buhari/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "national",
            "parts",
            "monguno",
            "buhari",
            "security",
            "nation",
            "staff",
            "takes",
            "end",
            "meeting",
            "chief",
            "nigerian",
            "president",
            "insecurity"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Insecurity: I’m prepared to defeat you, Buhari warns insurgents, bandits, others",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has warned insurgents, bandits and other criminal elements that his administration is determined to decisively end the assault on the nation and will do all that it takes to achieve that.\nHe gave the warning at Friday’s security meeting, according to National Security Adviser, Major-General Babagana Monguno (retd), who confirmed the meeting will reconvene on Tuesday, adding that he is prepared to take profound measures in the wider interest of the people and the Nigerian nation.\n“At today’s meeting the President made it abundantly clear that while the insurgents, bandits and criminals are still at it, he has no doubt that the Nigerian Security agencies and all of us as a nation will certainly overcome all the current security problems and defeat the forces of evil marauding about in different parts of the country.\nPresident is very prepared to take profound measures in the wider interest of the people and the Nigerian nation.\nThere shall be no relenting until peace and security is significantly restored in our communities.”",
          "link": "https://www.sunnewsonline.com/insecurity-im-prepared-to-defeat-you-buhari-warns-insurgents-bandits-others/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "insurgents",
            "defeat",
            "bandits",
            "todays",
            "wider",
            "warns",
            "buhari",
            "security",
            "im",
            "prepared",
            "nation",
            "profound",
            "meeting",
            "nigerian",
            "statement",
            "president",
            "insecurity"
          ]
        },
        {
          "title": "Buhari is not aware of Shehu’s statement – Ortom",
          "summary": "From Rose Ejembi, MakurdiBenue State Governor, Samuel Ortom has said that President Muhammadu Buhari is not aware that his Media aide, Garba Shehu made any statement saying he (Buhari) was disappointed in him (Ortom).\nReacting to the statement, Governor Ortom, through his Chief Press Secretary, Terver Akase, said he is convinced that the President was not aware that his aide, Shehu made such a statement on his behalf.\n“It is clear that the media aide didn’t speak for the President in the said statement.\nAre those killings occurring as a result of the comments of Governors of the affected states?\nAkase noted that the President’s Media aide is aware that Governor Ortom has on several occasions raised alarm against activities of the rampaging herdsmen whose sole aim is to take over the ancestral lands of Benue people and other Nigerians.",
          "link": "https://www.sunnewsonline.com/buhari-is-not-aware-of-shehus-statement-ortom/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "governor",
            "shehus",
            "shehu",
            "buhari",
            "security",
            "aide",
            "statement",
            "ortom",
            "president",
            "benue",
            "media",
            "aware",
            "state"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Buhari: We’ll Defeat Forces of Evil and Overcome Current Security Challenges",
          "summary": "Security council reconvenes TuesdayBy Deji Elumoye President Muhammadu Buhari has said that Nigeria will overcome all the current security problems and defeat the forces of evil marauding about in different parts of the country.\nThe President’s assurance was contained in a statement issued Friday by the National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), at the end of the National Security Council meeting at the State House, Abuja.\nThe NSA stressed the readiness of President Muhammadu Buhari to decisively end all form of security assault on the nation.\nPresident Buhari had convened a meeting of the National Security Council (NSC) at the Presidential Villa, Abuja Friday, following the escalation of security challenges in different parts of the country and general outcry by various stakeholders with many calling for an urgent action from the President.\nThe meeting was attended by Vice President Yemi Osinbajo, the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha; the Chief of Staff to the President, Prof Ibrahim Gambari; and the National Security Adviser (NSA), Major-General Babagana Monguno (rtd).",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/buhari-well-defeat-forces-of-evil-and-overcome-current-security-challenges/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "defeat",
            "national",
            "parts",
            "forces",
            "current",
            "evil",
            "challenges",
            "buhari",
            "security",
            "nation",
            "staff",
            "meeting",
            "chief",
            "overcome",
            "president",
            "council",
            "nsa"
          ]
        },
        {
          "title": "Bandits Kill 323, Kidnapped 949 Others in Kaduna in Three Months, Says Commissioner",
          "summary": "By John ShiklamThe Kaduna State Government has disclosed that 323 persons were killed, while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nAruwan also said 64 bandits were neutralised by troops, while several gunrunners were arrested during the same period.\nAccording to the commissioner, “The report covers banditry, kidnapping, cattle-rustling, attacks and reprisals.\nAccording to him, “Out of the 323 citizens killed, 292 were males.\n“Southern Kaduna Senatorial District had 68 deaths in total, of which five were women and two below the age of 18.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/bandits-kill-323-kidnapped-949-others-in-kaduna-in-three-months-says-commissioner/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "bandits",
            "kidnapped",
            "months",
            "commissioner",
            "security",
            "kaduna",
            "kill",
            "949",
            "neutralised",
            "killed",
            "323",
            "deaths",
            "report",
            "state",
            "missions"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "FLASHBACK: How Bandits’ Leader Behind Kankara Schoolboys' Abduction, Auwalun 'Defrauded' Zamfara Govt Of Millions Of Naira",
          "summary": "He and his lieutenants surrendered 20 AK 47 rifles, ammunition and a rocket-propelled grenade (RPG) launcher to the Zamfara state government.\nDays after, SaharaReporters exposed how he was paid millions of naira to surrender.\nKatsina State governor, Aminu Bello Masari, also said insinuations that ransom was paid for the release of the boys from their abductors were false.\nWe want peace but this governor has no integrity.”Mota was arrested a few days later over alleged ties with bandits.\nAuwalun Daudawa and his lieutenants have now returned to the forest and his old ways by picking up arms again.",
          "link": "http://saharareporters.com/2021/04/30/flashback-how-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-defrauded",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "bandits",
            "governor",
            "zamfara",
            "kankara",
            "paid",
            "govt",
            "million",
            "claimed",
            "schoolboys",
            "naira",
            "flashback",
            "daudawa",
            "defrauded",
            "auwalun",
            "gang",
            "millions",
            "state",
            "leader"
          ]
        },
        {
          "title": "FLASHBACK: How Bandits’ Leader Behind Kankara Schoolboys' Abduction, Auwalun 'Defrauded' Zamfara Govt Of Millions Of Naira",
          "summary": "He and his lieutenants surrendered 20 AK 47 rifles, ammunition and a rocket-propelled grenade (RPG) launcher to the Zamfara state government.\nDays after, SaharaReporters exposed how he was paid millions of naira to surrender.\nKatsina State governor, Aminu Bello Masari, also said insinuations that ransom was paid for the release of the boys from their abductors were false.\nWe want peace but this governor has no integrity.”Mota was arrested a few days later over alleged ties with bandits.\nAuwalun Daudawa and his lieutenants have now returned to the forest and his old ways by picking up arms again.",
          "link": "http://saharareporters.com/2021/04/30/flashback-how-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-defrauded",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "bandits",
            "governor",
            "zamfara",
            "kankara",
            "paid",
            "govt",
            "million",
            "claimed",
            "schoolboys",
            "naira",
            "flashback",
            "daudawa",
            "defrauded",
            "auwalun",
            "gang",
            "millions",
            "state",
            "leader"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Nigerian teen gets 19 scholarship offers ‘worth $5m’ from US, Canada varsities",
          "summary": "Victory Yinka-Banjo, a 17-year-old Nigerian, has secured 19 fully funded scholarship offers from universities across the United States and Canada following her academic strides.\nAdvertisementAccording to CNN, the total scholarship offers are worth over $5 million, based on admission documents and estimates of financial aid awards.\nThe US varsities include Ivy League schools, Yale College, Princeton University, Harvard College, Brown University, the Massachusetts Institute of Technology (MIT), Stanford University, Johns Hopkins University, and the University of Virginia.\nOffers from Canada include the Lester B. Pearson scholarship from the University of Toronto and the Karen McKellin International Leader of Tomorrow (KMILOT) scholarship from the University of British Columbia.\nIn her reaction, the teenager described the feat as “unbelievable”, noting that she initially doubted that she would get the scholarship while making applications to the various varsities.",
          "link": "https://lifestyle.thecable.ng/nigerian-teen-19-scholarship-offers-5m-us-canada-varsities/#new_tab",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "schools",
            "scholarship",
            "19",
            "work",
            "offers",
            "school",
            "gets",
            "5m",
            "various",
            "university",
            "worth",
            "canada",
            "yinkabanjo",
            "nigerian",
            "teen",
            "varsities",
            "academic"
          ]
        },
        {
          "title": "Smart Adeyemi: Establishing agricultural varsity in Kogi will end farmer-herder clashes",
          "summary": "Smart Adeyemi, senator representing Kogi west, says the establishment of a federal university of agriculture in Kabba is a step towards ending the farmer-herder crisis in the state and the country at large.\nThe legislator said a university of agriculture in Kabba will “accelerate” the country’s economic activities.\n“It will end farmer-herder clashes by producing more young graduates, who will know the technology that is required to set up modern cattle ranching.\n“Presently, we have one federal university of agriculture in each geopolitical zone.\nThe time has now come for the federal government to establish three federal universities of agriculture in each of the geopolitical zones.",
          "link": "https://www.thecable.ng/smart-adeyemi-establishing-agricultural-varsity-in-kogi-will-end-farmer-herder-clashes",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "federal",
            "university",
            "nation",
            "end",
            "technology",
            "farmerherder",
            "smart",
            "young",
            "set",
            "kabba",
            "president",
            "kogi",
            "senator",
            "agriculture",
            "establishing",
            "clashes",
            "agricultural",
            "adeyemi",
            "varsity"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "governor",
            "emefiele",
            "cbn",
            "bank",
            "sanusi",
            "skye",
            "otudeko",
            "sacking",
            "took",
            "banks",
            "board",
            "bruised",
            "tradition",
            "enforces"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "country",
            "company",
            "value",
            "size",
            "expand",
            "business",
            "expansion",
            "aggressive",
            "fintech",
            "market",
            "partnerships",
            "nigeria",
            "startups",
            "companies"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "FG trains 30 coconut farmers on nursery, processing in Edo – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Ministry of Agriculture and Rural Development says it has trained 30 coconut farmers on nursery establishment, field development, harvesting, processing and marketing in Edo.\nHe spoke at the opening of capacity building workshop for coconut farmers in collaboration with the Nigeria Institute for Oil Palm Research (NIFOR).\nHe said that the capacity building workshop was coming at a very crucial moment when the country was recovering from a difficult spell of the COVID-19 pandemic.\nThe Acting Executive Director of NIFOR, Dr. Celestine Ikuenobe, said that coconut production offered great opportunities for export earnings.\nEarlier, Mrs Okoroji Okechukwu, the National President, National Coconut Producers, Processors and Marketers Association of Nigeria, commended the sponsors of the workshop, saying that it would transform the agricultural sector.",
          "link": "http://nigerianobservernews.com/2021/04/fg-trains-30-coconut-farmers-on-nursery-processing-in-edo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "federal",
            "nigerian",
            "30",
            "nifor",
            "national",
            "ministry",
            "workshop",
            "fg",
            "capacity",
            "observer",
            "nursery",
            "president",
            "trains",
            "nigeria",
            "processing",
            "farmers",
            "coconut",
            "building",
            "edo"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "19",
            "register",
            "underaged",
            "outlawed",
            "immediate",
            "prohibited",
            "web",
            "highways",
            "nightgrazing",
            "cattle",
            "movement",
            "wish",
            "jan"
          ]
        },
        {
          "title": "BREAKING: Mbaka begged Buhari for contracts – Garba Shehu claims",
          "summary": "Senior Special Adviser to President Muhammadu Buhari on Media and Publicity, Garba Shehu, has alleged that the Spiritual Director of the Adoration Ministry (AMEN), Rev.\nEjike Mbaka, asked President Muhammadu Buhari for contracts but was rebuffed.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\n“The President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\nNow, this is what is eating Father Mbaka.”",
          "link": "https://hallmarknews.com/breaking-mbaka-begged-buhari-for-contracts-garba-shehu-claims/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "breaking",
            "contracts",
            "presidential",
            "mbaka",
            "begged",
            "shehu",
            "muhammadu",
            "buhari",
            "asked",
            "garba",
            "president",
            "claims",
            "resign",
            "father"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Big Brother Naija: Season 6 Audition Begins May 3",
          "summary": "ADVERTISEMENTThe organisers of the annual Big Brother Naija Reality Show, Multichoice Nigeria, has announced that the audition for season six of the reality TV show would begin on Monday, May 3, 2021.\nMultichoice made the announcement via statement posted on its verified Twitter handle on Friday.\n“Following this, they are to log on to www.africamagic.tv/BBAudition to fill out the online registration form and upload their videos.\n“The online Audition is free and open to interested male and female participants, who are of Nigerian nationality with a valid identity document, and must be 21 years of age by June 1, 2021,” Multichoice stated.\nThis year’s winner of the reality TV show will go home with a grand prize of N90million, the highest for a reality TV show in Africa.",
          "link": "https://leadership.ng/big-brother-naija-season-6-audition-begins-may-3/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "reality",
            "begins",
            "big",
            "brother",
            "season",
            "naija",
            "online",
            "multichoice",
            "tv",
            "statement",
            "wwwafricamagictvbbaudition",
            "winner",
            "audition",
            "interested"
          ]
        },
        {
          "title": "JUST-IN: Mbaka Angry With Buhari Because He Didn’t Get Contracts – Presidency",
          "summary": "He said, “an outsider distilling the avalanche of verbiage, will be surprised that after supporting the President two times to win the presidency, Father Mbaka has made a complete U-Turn, preposterously asking President Buhari to resign or be impeached.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\nThe President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\nADVERTISEMENT“Anyone familiar with President Buhari knows that he doesn’t break the laid down rules in dealing with contracts or any other government business for that matter.\nNow, this is what is eating Father Mbaka,” he added.",
          "link": "https://leadership.ng/just-in-mbaka-angry-with-buhari-because-he-didnt-get-contracts-presidency/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "national",
            "contracts",
            "presidential",
            "mbaka",
            "presidency",
            "buhari",
            "angry",
            "asked",
            "president",
            "didnt",
            "resign",
            "father",
            "justin"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Buhari reappoints Runsewe for another four years — Daily Times Nigeria",
          "summary": "By Ebere ChibuzorJust on the dot of the end of his first active and progressive four years as Director General National Council for Arts and Culture, NCAC, Otunba Segun Runsewe, was handed another term of four years to deepen the Nigerian cultural economy.\nGarba Shehu, President Senior Special Assistant, Media, announced few hours ago, that the President found Runsewe worthy to continue the good work he is doing at NCAC and for Nigerian Culture.\nREAD ALSO: Minimum wage: PTAD gets presidential approval to implement pension benefitsThe announcement also captured some other appointments in the parastatals under the Ministry of Culture and Tourism.\nThere is massive jubilation across the sector on the president decision as NCAC remains at the heart of president Buhari Cultural tourism reformation agenda.\nActing President Federation of Tourism Associations of Nigeria (FTAN,)Mr Nkerewuem onung and President, National Association of Nigeria Travel Agencies (NANTA)Mrs Susan Akporiaye were two top industry leaders who called to appreciate the president Buhari gesture and also thank the Honourable Minister of Culture and Tourism, Alhaji Lai Mohammed for his support for NCAC and the culture sector.",
          "link": "https://dailytimes.ng/buhari-reappoints-runsewe-for-another-four-years/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "national",
            "ncac",
            "ministry",
            "buhari",
            "reappoints",
            "sector",
            "nigerian",
            "culture",
            "daily",
            "nigeria",
            "times",
            "president",
            "tourism",
            "runsewe"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Woman collapses in Christ Apostolic Church while fasting, dies in hospital",
          "summary": "The family of a woman, Joy Owoyele, is in grief after she died during a 14-day fasting in the Isheri Olofin area of Lagos State.\nPUNCH Metro gathered that Owoyele had sought spiritual help regarding her matrimonial challenges at the Christ Apostolic Church, Ori-Oke Gbogunmi, aka Ajanpelenbe Mountain, located on Pipeline Road, Isheri Olofin.\n“Her daughter, Oluwatise, was also with her in the church during the spiritual exercise and they always slept together.\n“Around 7am on the day of the incident, Owoyele fainted and was rushed to the Igando General Hospital, where she was pronounced dead.\n“Detectives led by Inspector Bridget Edosa visited the scene, inspected the corpse and deposited it in the Yaba General Hospital morgue for autopsy.",
          "link": "https://daylightng.com/woman-collapses-in-christ-apostolic-church-while-fasting-dies-in-hospital/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "family",
            "dies",
            "spiritual",
            "day",
            "woman",
            "general",
            "christ",
            "church",
            "hospital",
            "investigation",
            "owoyele",
            "fasting",
            "incident",
            "collapses",
            "apostolic"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "convenient",
            "site",
            "offers",
            "emerges",
            "version",
            "website",
            "place",
            "account",
            "1xbet",
            "popular",
            "launches",
            "page",
            "bookmaker",
            "mobile"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "npa",
            "roads",
            "ecall",
            "gridlock",
            "callup",
            "system",
            "apapa",
            "worsening",
            "drivers",
            "trucks",
            "electronic",
            "truck",
            "road",
            "amidst"
          ]
        }
      ]
    }
  }
}