{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Impeachment: APC threatens to 'expose' Mbaka to the Vatican",
          "summary": "Ejike Mbaka, against making statements that could cause instability in the country, threatening to expose him to the Pope.\nMbaka had called on the National Assembly to impeach President Muhammadu Buhari if he fails to resign over increased insecurity in the country.\n“One would wonder who Father Mbaka is emulating because the Lord Jesus Christ did not threaten to bring down the government during his own time, in fact, Jesus Christ obeyed and honoured constituted authority.\n“We are calling on Father Mbaka to concentrate on his spiritual calling and stop speaking like politicians who it is obvious he (Mbaka) has been dining and wining with.\nFather Mbaka should not, however, take his luck too far because there is a lot to tell the Vatican and the Pope about his person and his sources of inspiration”, Nabena said.",
          "link": "https://www.vanguardngr.com/2021/04/impeachment-apc-threatens-to-expose-mbaka/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "threatens",
            "jesus",
            "spiritual",
            "vatican",
            "apc",
            "father",
            "impeachment",
            "nabena",
            "expose",
            "threatening",
            "god",
            "christ",
            "storm",
            "speaking",
            "mbaka"
          ]
        },
        {
          "title": "New operating consortium promises Nigeria better value from 4 oil assets",
          "summary": "The new partners also disclosed that they have commenced engagement with Addax to ensure a smooth and amicable transition of operations at the assets.\nThe Kaztec/Salvic consortium said that the Department of Petroleum Resources, DPR, deserved to be commended for doing due diligence and following relevant laws in making them the choice operators of the assets.\n“The choice of the consortium is also per the Nigerian Oil and Gas Industry Content Development (Local Content) Act which was enacted in 2010 to promote the indigenous operation of Nigeria’s oil and gas assets.\nUnder the Act, seasoned Nigerian independent operators like Kaztec and Salvic are to be given first consideration in the award of oil blocks and oil field licenses,” the statement said.\nThe consortium noted that the DPR also directed that Addax and the new consortium engaged in an amicable resolution of all issues, including a commercial settlement if needed.",
          "link": "https://www.vanguardngr.com/2021/04/new-operating-consortium-promises-nigeria-better-value-from-4-oil-assets/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "petroleum",
            "local",
            "operating",
            "promises",
            "better",
            "production",
            "oil",
            "assets",
            "nigerian",
            "value",
            "content",
            "nigeria",
            "consortium",
            "dpr",
            "addax"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Buhari presides over crucial security meeting",
          "summary": "President Muhammadu Buhari is currently presiding over a security meeting, with Vice-President Yemi Osinbajo and Security chiefs in attendance at the Presidential Villa, Abuja.\nThe meeting is being held at the First Lady Conference Hall.\nOthers in attendance at the meeting include Secretary to the Government of the Federation (SGF), Boss Mustapha; Chief of Staff to the President, Prof. Ibrahim Gambari, and the Minister of Defence, retired Maj-Gen. Bashir Magashi as well as National Security Adviser, retired Maj.-Gen. Babagana Monguno (Rtd).\nMeanwhile, there have been calls for President Muhammadu Buhari’s resignation and impeachment due to the high level of insecurity in the country.\nOn Thursday, the Catholic Priest and Spiritual Director of Adoration Ministry, Fr Mbaka said Buhari has failed Nigeria woefully and should resign now.",
          "link": "https://dailypost.ng/2021/04/30/buhari-presides-over-crucial-security-meeting/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "crucial",
            "presides",
            "chief",
            "muhammadu",
            "security",
            "staff",
            "majgen",
            "president",
            "ibrahim",
            "pastor",
            "meeting",
            "buhari",
            "retired"
          ]
        },
        {
          "title": "We’ll expose your source of inspiration, report you to Pope",
          "summary": "Deputy national publicity secretary of the All Progressives Congress (APC), Yekini Nabena, has threatened to report and expose Rev.\nFr Ejike Mbaka’s source of inspiration over his call for President Muhammadu Buhari’s impeachment.\n”If Mbaka has found another political ally, it is better to leave a political message for politicians,” he said.\nNabena further explained that call for Buhari’s resignation or impeachment because of the current challenges in the country is ungodly.\n”Father Mbaka should not, however, take his luck too far because there is a lot to tell the Vatican and the Pope about his person and his sources of inspiration”, Nabena added.",
          "link": "https://dailypost.ng/2021/04/30/well-expose-your-source-of-inspiration-report-you-to-pope-apc-threatens-fr-mbaka/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "pope",
            "spiritual",
            "source",
            "politicians",
            "inspiration",
            "nabena",
            "expose",
            "god",
            "threatening",
            "threaten",
            "speaking",
            "country",
            "report",
            "mbaka"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Two businessmen in court for alleged N16.5m fraud",
          "summary": "Agency ReporterTwo businessmen, John Olufemi and Abraham Omotosho, on Friday appeared in a Yaba Chief Magistrates’ Court in Lagos for allegedly defrauding a man of 10.000 pounds (N16.5million).\nThe defendants, who both reside at Yaba area of Lagos, are charged with three counts of conspiracy, theft and obtaining by false pretences.\nThe prosecutor, ASP Rita Momah, told the court that the defendants committed the offence in 2013, in Lagos.\nThe offence, she said, contravened the provisions of sections 314, 287 and 411 of the Criminal Law of Lagos State, 2015 (Revised).\nshe added that the sureties should be gainfully employed with evidence of three years tax payment to the Lagos State Government.",
          "link": "https://thenationonlineng.net/two-businessmen-in-court-for-alleged-n16-5m-fraud/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "court",
            "businessmen",
            "chief",
            "state",
            "n165m",
            "lagos",
            "yaba",
            "reside",
            "alleged",
            "offence",
            "told",
            "sureties",
            "fraud",
            "defendants"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Breaking: Buhari, Osinbajo meet security chiefs",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently presiding over a Security Meeting at the Statehouse, Abuja.\nThe meeting holding at the First Lady Conference room as the Council Chambers is undergoing renovation, has Vice President Yemi Osinbajo in attendance.\nIn attendance at the meeting are Secretary to the Government of the Federation (SGF), Boss Mustapha; Chief of Staff to the President, Professor Ibrahim Gambari, and Defense Minister, Major-General Bashir Magashi (Rtd); and National Security Adviser, Major-General Babagana Monguno (Rtd).\nOthers were Chief of Defence Staff, General Lucky Irabor, Chief of Army Staff; Lieutenant-General Ibrahim Attahiru, Chief of Naval Staff; Vice Admiral Awwal Zubairu, and Chief of Air Staff, Air Marshal Ishiaka Oladayo Amoo.\nThe acting Inspector General of Police, IGP, Usman Alkali is also in attendance.",
          "link": "https://www.sunnewsonline.com/breaking-buhari-osinbajo-meet-security-chiefs/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "osinbajo",
            "vice",
            "breaking",
            "chief",
            "chiefs",
            "air",
            "general",
            "security",
            "staff",
            "president",
            "meet",
            "ibrahim",
            "majorgeneral",
            "meeting",
            "buhari"
          ]
        },
        {
          "title": "CAF Confederation Cup quarter-finals: Kalu congratulates Enyimba",
          "summary": "Pillar of Sports in Africa and Chief Whip of the Senate, Dr. Orji Uzoh Kalu has congratulated Nigerians on the victory of Enyimba Football Club (FC) of Nigeria against Orlando Pirates of South Africa in the final Group A match in the Confederation of Africa Football (CAF) tournament.\nKalu commended the players and officials of the football club for their skills and determination.\nRecall, during Kalu’s stint as Governor of Abia State, Enyimba International FC was repositioned, with the team clinching the CAF Champions League Cup back to back in 2003 and 2004.\nThe Senate Chief Whip, who is also a soccer enthusiast stressed that football brings people together and ultimately promotes peace and unity.\nHe said, “I felicitate with Enyimba FC on their well-deserved victory against Orlando Pirates in the CAF tournament.",
          "link": "https://www.sunnewsonline.com/caf-confederation-cup-quarter-finals-kalu-congratulates-enyimba/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "senate",
            "whip",
            "victory",
            "enyimba",
            "quarterfinals",
            "kalu",
            "fc",
            "africa",
            "football",
            "caf",
            "cup",
            "team",
            "confederation",
            "congratulates",
            "players"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": []
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "FLASHBACK: How Bandits’ Leader Behind Kankara Schoolboys' Abduction, Auwalun 'Defrauded' Zamfara Govt Of Millions Of Naira",
          "summary": "He and his lieutenants surrendered 20 AK 47 rifles, ammunition and a rocket-propelled grenade (RPG) launcher to the Zamfara state government.\nDays after, SaharaReporters exposed how he was paid millions of naira to surrender.\nKatsina State governor, Aminu Bello Masari, also said insinuations that ransom was paid for the release of the boys from their abductors were false.\nWe want peace but this governor has no integrity.”Mota was arrested a few days later over alleged ties with bandits.\nAuwalun Daudawa and his lieutenants have now returned to the forest and his old ways by picking up arms again.",
          "link": "http://saharareporters.com/2021/04/30/flashback-how-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-defrauded",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "millions",
            "govt",
            "leader",
            "naira",
            "flashback",
            "bandits",
            "auwalun",
            "gang",
            "state",
            "million",
            "paid",
            "defrauded",
            "daudawa",
            "claimed",
            "governor",
            "kankara",
            "zamfara",
            "schoolboys"
          ]
        },
        {
          "title": "FLASHBACK: How Bandits’ Leader Behind Kankara Schoolboys' Abduction, Auwalun 'Defrauded' Zamfara Govt Of Millions Of Naira",
          "summary": "He and his lieutenants surrendered 20 AK 47 rifles, ammunition and a rocket-propelled grenade (RPG) launcher to the Zamfara state government.\nDays after, SaharaReporters exposed how he was paid millions of naira to surrender.\nKatsina State governor, Aminu Bello Masari, also said insinuations that ransom was paid for the release of the boys from their abductors were false.\nWe want peace but this governor has no integrity.”Mota was arrested a few days later over alleged ties with bandits.\nAuwalun Daudawa and his lieutenants have now returned to the forest and his old ways by picking up arms again.",
          "link": "http://saharareporters.com/2021/04/30/flashback-how-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-defrauded",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "millions",
            "govt",
            "leader",
            "naira",
            "flashback",
            "bandits",
            "auwalun",
            "gang",
            "state",
            "million",
            "paid",
            "defrauded",
            "daudawa",
            "claimed",
            "governor",
            "kankara",
            "zamfara",
            "schoolboys"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "NSCDC deploys special operatives at airports over suspected attacks",
          "summary": "Ahmed Audi, commandant-general of the Nigeria Security and Civil Defence Corps (NSCDC), has assured Nigerians of a highly coordinated approach to avert any attack on airport facilities across the country.\nAdvertisementEarlier in April, the Federal Airports Authority of Nigeria (FAAN) warned that it received an alert from the ministry of aviation over planned attacks on airports across the country.\nThe airports listed were those in Kaduna, Maiduguri, Sokoto, Kano, Abuja, and Lagos.\nAdvertisementAudi directed all concerned state commandants to adequately deploy specialised units operatives of the corps to airports.\n“Operatives from specialised units such as Counter-Terrorism, Anti-Vandalism, Crisis and Disaster Management as well as Intelligence and Surveillance personnel for covert operations to all the Airports in the country, “the statement said.",
          "link": "https://www.thecable.ng/nscdc-deploys-special-operatives-in-airports-over-suspected-attacks",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nscdc",
            "statement",
            "units",
            "management",
            "security",
            "suspected",
            "deploys",
            "nigerians",
            "specialised",
            "attacks",
            "nigeria",
            "airports",
            "special",
            "corps",
            "operatives"
          ]
        },
        {
          "title": "Dare dissolves ALL boards of Olympics sports federations",
          "summary": "Sunday Dare, minister of youth and sports development, has announced the dissolution of all boards of the national Olympic sports federations (NSF) in Nigeria.\nAdvertisementThe minister pronounced the dissolution in a statement released on Friday.\n“Within the last 4 years, a few of the National Sports Federations Boards performed remarkably well while many others have been bogged down by unnecessary bickering and divisions among the board members,” the statement read.\n“In order to ensure continuity in the administration of the federations, caretaker committees are hereby put in place to manage the affairs of the Federations until elections are conducted and the new boards inaugurated,” the statement added.\n“Mindful of the Olympic games in July 2021, the caretaker committees will work assiduously towards enhancing team Nigeria participation at the games.",
          "link": "https://www.thecable.ng/are-dissolves-all-boards-of-olympics-sports-federations",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "statement",
            "dissolves",
            "federations",
            "committees",
            "olympics",
            "ministry",
            "caretaker",
            "boards",
            "dare",
            "nigeria",
            "elections",
            "olympic",
            "national"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "tradition",
            "sacking",
            "enforces",
            "took",
            "board",
            "otudeko",
            "bank",
            "emefiele",
            "sanusi",
            "skye",
            "banks",
            "governor",
            "cbn",
            "bruised"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nigeria",
            "expansion",
            "market",
            "expand",
            "size",
            "fintech",
            "companies",
            "startups",
            "aggressive",
            "country",
            "value",
            "partnerships",
            "business",
            "company"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "FG trains 30 coconut farmers on nursery, processing in Edo – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Ministry of Agriculture and Rural Development says it has trained 30 coconut farmers on nursery establishment, field development, harvesting, processing and marketing in Edo.\nHe spoke at the opening of capacity building workshop for coconut farmers in collaboration with the Nigeria Institute for Oil Palm Research (NIFOR).\nHe said that the capacity building workshop was coming at a very crucial moment when the country was recovering from a difficult spell of the COVID-19 pandemic.\nThe Acting Executive Director of NIFOR, Dr. Celestine Ikuenobe, said that coconut production offered great opportunities for export earnings.\nEarlier, Mrs Okoroji Okechukwu, the National President, National Coconut Producers, Processors and Marketers Association of Nigeria, commended the sponsors of the workshop, saying that it would transform the agricultural sector.",
          "link": "http://nigerianobservernews.com/2021/04/fg-trains-30-coconut-farmers-on-nursery-processing-in-edo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "workshop",
            "president",
            "nigerian",
            "processing",
            "national",
            "coconut",
            "building",
            "nursery",
            "nifor",
            "capacity",
            "edo",
            "30",
            "nigeria",
            "trains",
            "ministry",
            "observer",
            "federal",
            "fg",
            "farmers"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "underaged",
            "19",
            "nightgrazing",
            "wish",
            "cattle",
            "register",
            "prohibited",
            "highways",
            "jan",
            "movement",
            "immediate",
            "outlawed",
            "web"
          ]
        },
        {
          "title": "Access Bank posts N60.1bn profit in Q1, 2021",
          "summary": "OBINNA EZUGWUAccess Bank Plc, has posted gross earnings of N222.1 billion for the first quarter of 2021, ended March 31, a six percent increase from N2029.8 billion posted in the corresponding period of 2020.\nThe bank also grew its Profit Before Tax (PBT) by 30 percent to N60.1 billion, from N46.2 billion recorded in the same period last year, and impressive performance despite the challenging operating environment.\n“As a result of effective implementation of our cost reduction strategy, operating expenses remained flat, despite the inflationary environment and increased regulatory cost.\nAccording to Wigwe, in furtherance of their vision to be the World’s most respected African bank and Africa’s payment gateway, they remain committed to a disciplined and thoughtful expansion strategy.\n“Leveraging the African Continental Free Trade Agreement (AfCFTA), we will focus on key markets to drive outside Africa and intra-Africa trade.",
          "link": "https://hallmarknews.com/access-bank-posts-n60-1bn-profit-in-q1-2021/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "reduction",
            "q1",
            "african",
            "2021",
            "wigwe",
            "robust",
            "ratio",
            "growth",
            "n601bn",
            "operating",
            "cent",
            "bank",
            "access",
            "billion",
            "posts",
            "profit"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Minister Dissolves Board Of Sports Federation, Set Up Caretaker Committee",
          "summary": "By Salifu Usman, AbujaBarely three months to Tokyo 2020 Olympic Games, the Minister of youth and sports federation, Chief Sunday Dare has dissolved all the boards of 31 National Sports Federations and set up caretaker committees to run the fairs of the federation.\n“Within the last 4 years, a few of the National Sports Federations Boards performed remarkably well while many others have been bogged down by unnecessary bickerings and divisions among the board members.\nI wish to thank all the Board members for their contributions within the period they served in their various Federations Boards.\nADVERTISEMENT“Mindful of the Olympic Games in July 2021, the Caretaker Committees will work assiduously towards enhancing team Nigeria participation at the Games.\nThe Ministry in partnership with the NOC, will release in due course, the time-table for the elections into National Sport Federation Boards.",
          "link": "https://leadership.ng/minister-dissolves-board-of-sports-federation-set-up-caretaker-committee/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "federation1",
            "federation",
            "secretary",
            "dissolves",
            "board",
            "federations",
            "minister",
            "caretaker",
            "boards",
            "nigeria1",
            "chairman2",
            "nigeria",
            "set",
            "committee",
            "olympic",
            "member3"
          ]
        },
        {
          "title": "NDE To Empower Ex-Convicts In Ekiti",
          "summary": "BY ALO ABIOLA, Ado EkitiThe National Directorate of Employment (NDE), has promised to allot a certain percentage of all its vocational and entrepreneurial programmes to repentant ex-convicts.\nThe move according to the federal government’s agency was part of the efforts to reduce unemployment and stamp out crimes in the country.\nThe Deputy Director, Ekiti NDE office, Mrs Folasade Ajiboye, made the pledge yesterday in Ado Ekiti Correctional Centre, during an evangelism and empowerment programme facilitated by a non- governmental Organisation Christ The Healing Stream Initiative (CTHSI) for the inmates .\nMrs Ajiboye said the empowerment programme would be done in partnership with a non- governmental Organisation.\n“This programme is going to be cost-free and they are meant to boost the abilities of ex-convicts , because Correctional Centres are expected to be rehabilitation centres”.",
          "link": "https://leadership.ng/nde-to-empower-ex-convicts-in-ekiti/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "exconvicts",
            "ekiti",
            "nde",
            "mrs",
            "empowerment",
            "empower",
            "correctional",
            "programme",
            "partnership",
            "governmental",
            "entrepreneurial",
            "non"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "President Buhari flays Ortom over comments on soldiers, citizens killings",
          "summary": "Kamarudeen OgundelePresident Muhammadu Buhari has condemned Governor Samuel Ortom of Benue State over comments made on the killings of soldiers and Internally Displaced Persons (IDPs) in their camp.\nHe, however, expressed condolences to the families of those who lost their loved ones in the recent spate of killings in Benue State.\nThe President said the rising levels of incidents, especially the killings and violence in various parts of the country called for further collaboration with security agencies to curb its recurrence.\n“President Buhari took an oath to defend the life and property of every citizen, a duty he takes seriously and is committed to ensuring.\n“The future of Benue State and indeed that of the entire country lies in harmony and the respect for law, order, and the constitution.",
          "link": "https://dailytimes.ng/president-buhari-flays-ortom-over-comments-on-soldiers-citizens-killings/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "comments",
            "state",
            "killings",
            "progress",
            "flays",
            "benue",
            "president",
            "law",
            "country",
            "parts",
            "soldiers",
            "citizens",
            "buhari",
            "ortom"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Why I want to buy Arsenal, billionaire Spotify owner, Daniel Ek",
          "summary": "Spotify founder and CEO, Daniel Ek, has revealed why he intends to buy London-based football club, Arsenal, from its current American owners, Kroenke Sports & Entertainment.\n“I want to establish trust with fans and I want to engage with fans again,” said Ek.\nThe protest was a reaction to the club owners signing up to the now nearly disbanded European Super League without first consulting the fans.\nEk had tweeted earlier that he has been a lifelong Arsenal fan: “As a kid growing up, I’ve cheered for Arsenal as long as I can remember.\nIf KSE would like to sell Arsenal I’d be happy to throw my hat in the ring.”Since announcing his interest to buy the club, Ek has teamed up with club legends, Thierry Henry, Dennis Bergkamp, and Patrick Vieira.",
          "link": "https://daylightng.com/why-i-want-to-buy-arsenal-billionaire-spotify-owner-daniel-ek/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "owner",
            "buy",
            "owners",
            "think",
            "club",
            "swedish",
            "kroenke",
            "bring",
            "spotify",
            "arsenal",
            "ek",
            "fans",
            "protest",
            "billionaire",
            "daniel"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "electronic",
            "ecall",
            "gridlock",
            "road",
            "system",
            "worsening",
            "truck",
            "apapa",
            "roads",
            "drivers",
            "trucks",
            "amidst",
            "npa",
            "callup"
          ]
        },
        {
          "title": "3 Ways Sub-Saharan Africa Can Foster Growth In Her Regions",
          "summary": "Aggregation of DataData equals knowledge which is why countries in sub-Sahara Africa need to take aggregation of data very seriously.\nWith accurate data, sub-Sahara Africa can understand prevalent issues, how to tackle them and compare their progress with other countries of the world.\nPeople InclusivenessIf sub-Saharan Africa wants to solve her problems, she needs to include her people in the process (they know where the shoe pinches).\nGrowth and development is attainable at a rapid pace in sub-Sahara Africa.\nWe might not be advancing at the speed required to achieve the 2030 SGDs but sub-Saharan Africa will not be left behind, let’s take action now!",
          "link": "https://bizwatchnigeria.ng/3-ways-sub-saharan-africa-can-foster-growth-in-her-regions/",
          "published": "04/27/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "problems",
            "foster",
            "data",
            "subsaharan",
            "world",
            "need",
            "growth",
            "subsahara",
            "achieve",
            "africa",
            "development",
            "regions",
            "countries",
            "ways"
          ]
        }
      ]
    }
  }
}