{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "Lagos locates 150-bed children’s hospital near LAWMA refuse loading station",
          "summary": "Sanwo- Olu had, on April 28, inaugurated the construction of Massey Street Children’s Hospital, a 150-bed specialist facility for children in the state.\n“The current Massey Children’s Hospital was established in 1914 as the First General Outpatient Clinic and Referral Centre in Lagos State.\nThe hospital is close to a LAWMA facility that receives and transfers refuse on a daily basis.\n“The LAWMA facility is not a facility that holds waste.\nWhen you go there, you will not perceive any odour,” the commissioner told his radio host, Jimi Disu, who had also decried the proposed children’s hospital location.",
          "link": "https://healthwise.punchng.com/lagos-locates-150-bed-childrens-hospital-near-lawma-refuse-loading-station/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "area",
            "healthwise",
            "150bed",
            "state",
            "trucks",
            "locates",
            "station",
            "lawma",
            "lagos",
            "childrens",
            "road",
            "refuse",
            "hospital",
            "facility",
            "near",
            "loading",
            "correspondent"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Insecurity: We're justified in our decision not to support Buhari ― Afenifere",
          "summary": "Kindly Share This Story:By Dayo Johnson – AkureThe Pan Yoruba Socio-political group, Afenifere, said weekend that it has been justified for not supporting President Muhammad Buhari during the 2015 and 2019 elections.\nAccording to him, the recent crisis of confidence among ethnic groups in the country, insecurity amongst others justified our stance in not supporting the election of President Muhammadu Buhari in his first and second term.\n“The insecurity, corruption, and nepotism ravaging the government of President Buhari justified that the decisions taken in 2015 and 2019 elections by Afenifere were in the best interest of not only the Yoruba but Nigerians”.\nFasoranti lamented that “corruption and nepotism are the hallmarks of Buhari’s administration since he assumed office six years ago.\n“We were justified in not supporting President Muhammadu Buhari.",
          "link": "https://www.vanguardngr.com/2021/05/nepotism-insecurity-were-justified-in-our-decision-not-to-support-buhari-%e2%80%95-afenifere/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "support",
            "office",
            "state",
            "afenifere",
            "justified",
            "yoruba",
            "decision",
            "president",
            "supporting",
            "group",
            "buhari",
            "corruption",
            "insecurity"
          ]
        },
        {
          "title": "I never said IPoB was responsible for killings in S-East — Nwodo",
          "summary": "Kindly Share This Story:By Ikechukwu Odu, NSUKKAThe former President General of Ohanaeze Ndigbo, Chief John Nniah Nwodo, has distanced himself from a social media report alleging that he fingered members of the Indigenous People of Biafra, IPoB, as being responsible for the ongoing killings in South East region.\nNwodo who described the report as “provocative,” said the originator wanted to put him on a collision course with IPoB, adding that he never indicated interest to run for the presidency in 2023.\n“It is also instructive that in the twilight of my service to Ohanaeze Ndigbo, we had reached an understanding to work in concert with IPOB to achieve the desired objective for Ndigbo.\n“Where and when did I fall out with IPOB to make a public statement accusing them of any crime or denouncing their activities?\nNobody gains anything from unjustifiably engaging in a smear campaign on an innocent person.”Vanguard News NigeriaKindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/05/i-never-said-ipob-was-responsible-for-killings-in-s-east-nwodo/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "ohanaeze",
            "nwodo",
            "killings",
            "ipob",
            "ndigbo",
            "share",
            "president",
            "statement",
            "public",
            "responsible",
            "general",
            "south",
            "seast"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Senate to summon Customs CG, Ali over invasion of Ibadan markets",
          "summary": "Reno Omokri, on behalf of former President Goodluck Jonathan’s media office, has written Catholic pontiff, Pope Francis, reporting Rev.\nMbaka had last week asked President Muhammadu Buhari to resign forthwith or be impeached by the House of representatives.\nBut some of his associates have challenged Garba Shehu to reply to the priest’s comments on Buhari and the insecurity in Nigeria.\n“In the opinion of many Nigerians, Reverend Father Mbaka has brought the Catholic Church into disrepute, and undermined the faith of the faithful, by his conduct.\nAccording to the cleric and gospel singer, said the President has failed the citizens woefully, demanding his immediate resignation.",
          "link": "https://dailypost.ng/2021/05/02/senate-to-summon-customs-cg-ali-over-invasion-of-ibadan-markets/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "rev",
            "jonathan",
            "catholic",
            "customs",
            "invasion",
            "cg",
            "senate",
            "reverend",
            "nigerians",
            "mbaka",
            "president",
            "summon",
            "public",
            "father",
            "buhari",
            "ali",
            "ibadan",
            "markets"
          ]
        },
        {
          "title": "Iniobong Umoren: Police arrest one over rape, murder of job seeker in Akwa Ibom",
          "summary": "The Akwa Ibom State Police Command said it has arrested one Uduak Frank Akpan, 20, over the murder of one Miss Iniobong Umoren, who was declared missing a few days ago.\nThe statement in part, “The Akwa Ibom State Police Command has arrested one Uduak Frank Akpan, 20 years old for kidnapping, raping and murdering one Miss Iniobong Umoren.\nTo cover his tracks, he dragged and buried her in a shallow grave in his father’s compound.\n“The suspect confessed to have told his local government chairman of his atrocity before escaping to Calabar and was never at any time handed over to the Police by anyone.\n“Suspect is a confessed serial rapist who has owned up to the raping of other victims.",
          "link": "https://dailypost.ng/2021/05/02/police-arrest-one-over-rape-murder-of-job-seeker-in-akwa-ibom/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "victim",
            "akwa",
            "seeker",
            "confessed",
            "arrest",
            "job",
            "ibom",
            "state",
            "uduak",
            "tracks",
            "command",
            "statement",
            "umoren",
            "rape",
            "iniobong",
            "suspect",
            "arrested",
            "murder",
            "house"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Gunmen kill Kogi Commissioner, abduct council chair",
          "summary": "Agency ReporterGunmen have killed a Commissioner in the Kogi State Pension Board, Mr Solomon Akeweje, and abducted the Chairman of Yagba West Local Government, Mr Pius Kolawole.\nSpokesman of the Police Command, DSP William Aya, who confirmed the incident, said the Commissioner and Kolawole were travelling in the same vehicle when they were attacked.\nThe police spokesman said the victims were attacked at Eruku, a border community between Kwara and Kogi States.\nREAD ALSO: Senate passes bills to establish two universities in KogiAccording to Aya, Akeweje and Kolawole were travelling back to Egbe from Kwara State when they were attacked by yet-to-be-identified gunmen.\nHowever, the driver of the vehicle survived the attack while the corpse of Akeweje was deposited at the morgue of ECWA Hospital, Egbe.",
          "link": "https://thenationonlineng.net/gunmen-kill-kogi-commissioner-abduct-council-chair/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "gunmen",
            "state",
            "akeweje",
            "mr",
            "kogi",
            "vehicle",
            "egbe",
            "report",
            "chair",
            "travelling",
            "commissioner",
            "kolawole",
            "abduct",
            "council",
            "kwara",
            "kill"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "BREAKING: COVID-19: FG to stop travellers from Brazil, India, Turkey from entering Nigeria",
          "summary": "Brazil records 406,437 fatalities, India 211,853, while Turkey has recorded 4,849,408 cases, it crossed the 40,000 fatalities.\nWithin 24 hours of arrival shall take a COVID-19 PCR testii.\nIf positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf negative, the passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day seven of their quarantine.\nCarry out a COVID-19 PCR test on day 7 at selected laboratory.",
          "link": "https://www.sunnewsonline.com/breaking-covid-19-fg-to-stop-travellers-from-brazil-india-turkey-from-entering-nigeria/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "turkey",
            "fg",
            "risk",
            "shall",
            "pcr",
            "test",
            "covid19",
            "travellers",
            "stop",
            "countries",
            "breaking",
            "entering",
            "day",
            "passenger",
            "nigeria",
            "brazil",
            "cases",
            "india"
          ]
        },
        {
          "title": "BREAKING: Policeman missing, another injured as gunmen attack police station in Ebonyi",
          "summary": "From Chijioke Agwu, AbakalikiA police officer attached to the Abaomege Police station in Onicha local government area of Ebonyi state has been declared missing following attack on the station by gunmen on Saturday.\nSources in the area told our correspondent that the gunmen attacked the station around 8pm.\nOur correspondent gathered that another police officer on duty during the attack was seriously injured and has been hospitalized.\nThe goverment official who pleaded for anonymity said the injured officer had been taken to a hospital in Abakaliki for treatment.\n“The gunmen attacked the Abaomege Police station Saturday evening.",
          "link": "https://www.sunnewsonline.com/breaking-policeman-missing-another-injured-as-gunmen-attack-police-station-in-ebonyi/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "policeman",
            "ebonyi",
            "officer",
            "gunmen",
            "correspondent",
            "breaking",
            "station",
            "missing",
            "injured",
            "attack",
            "hospital",
            "attacked",
            "area"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Covid-19: FG to Deny Travellers Entry from India, Brazil and Turkey",
          "summary": "These precautionary measures are a necessary step to minimize the risk of a surge in COVID-19 cases introduced to Nigeria from other countries, while national response activities continue.\nAccording to him, “Any person who has visited Brazil, India or Turkey within fourteen (14) days preceding travel to Nigeria, shall be denied entry into Nigeria.\nThe following condition shall apply to such passengers: Within 24 hours of arrival shall take a COVID-19 PCR test.\n“If positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf Negative, the Passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day 7 of their quarantine.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/covid-19-fg-to-deny-travellers-entry-from-india-brazil-and-turkey/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "turkey",
            "fg",
            "pcr",
            "shall",
            "covid19",
            "travel",
            "travellers",
            "countries",
            "deny",
            "entry",
            "federal",
            "passenger",
            "passengers",
            "nigeria",
            "brazil",
            "cases",
            "india"
          ]
        },
        {
          "title": "PDP Govs, National Caucus Chide FG over Insecurity",
          "summary": "The Sokoto State governor made the call again early Saturday, when the party held its National Caucus meeting in Abuja.\nThe National Caucus of the party met on Friday night till the early morning of Saturday to appraise the worrisome security situation in the country.\nThe meeting, which had in attendance elected National Officers of the party, Governors, PDP leaders in the National Assembly and other stakeholders, focused entirely on the worsening security situation in the country.\nIn the view of the meeting, President Buhari has failed the people at a time of grave national crises,” the national caucus of the PDP stated.\n“The party and government definitely share concerns of well-meaning Nigerians, including PDP governors.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/pdp-govs-national-caucus-chide-fg-over-insecurity/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "govs",
            "fg",
            "security",
            "party",
            "governors",
            "meeting",
            "president",
            "caucus",
            "nigeria",
            "buhari",
            "national",
            "chide",
            "pdp",
            "insecurity"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Ballot Boxes, Others Destroyed As Hoodlums Burn Down National Electoral Commission Office In Akwa Ibom",
          "summary": "The Independent National Electoral Commission (INEC) has announced that one of its offices in Akwa Ibom State has been set ablaze by unknown persons.\nThis was announced by Festus Okoye, INEC's National Commissioner and Chairman, Information and Voter Education Committee on Sunday in a statement titled 'INEC Local Government Are Office In Akwa Ibom State Set Ablaze'.\nIt read, The Resident Electoral Commissioner for Akwa Ibom State, Mike Igini, has reported that our office in Essien Udim Local Government Area has been set ablaze.\nItems destroyed include 345 ballot boxes, 135 voting cubicles, mega phones, water tanks and office furniture.\n\"Nevertheless the commission wishes to assure Nigerians that we will leave no stone unturned to recover from the incident in Akwa Ibom State as we continue to prepare for the electoral activities.\"",
          "link": "http://saharareporters.com/2021/05/02/breaking-ballot-boxes-others-destroyed-hoodlums-burn-down-national-electoral-commission",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "commission",
            "voting",
            "local",
            "akwa",
            "office",
            "ibom",
            "boxes",
            "set",
            "state",
            "hoodlums",
            "breaking",
            "burn",
            "incident",
            "national",
            "udim",
            "destroyed",
            "electoral"
          ]
        },
        {
          "title": "BREAKING: Ballot Boxes, Others Destroyed As Hoodlums Burn Down National Electoral Commission Office In Akwa Ibom",
          "summary": "The Independent National Electoral Commission (INEC) has announced that one of its offices in Akwa Ibom State has been set ablaze by unknown persons.\nThis was announced by Festus Okoye, INEC's National Commissioner and Chairman, Information and Voter Education Committee on Sunday in a statement titled 'INEC Local Government Are Office In Akwa Ibom State Set Ablaze'.\nIt read, The Resident Electoral Commissioner for Akwa Ibom State, Mike Igini, has reported that our office in Essien Udim Local Government Area has been set ablaze.\nItems destroyed include 345 ballot boxes, 135 voting cubicles, mega phones, water tanks and office furniture.\n\"Nevertheless the commission wishes to assure Nigerians that we will leave no stone unturned to recover from the incident in Akwa Ibom State as we continue to prepare for the electoral activities.\"",
          "link": "http://saharareporters.com/2021/05/02/breaking-ballot-boxes-others-destroyed-hoodlums-burn-down-national-electoral-commission#disqus_thread",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "commission",
            "voting",
            "local",
            "akwa",
            "office",
            "ibom",
            "boxes",
            "set",
            "state",
            "hoodlums",
            "breaking",
            "burn",
            "incident",
            "national",
            "udim",
            "destroyed",
            "electoral"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Reno Omokri writes Pope, lists 'many sins' of Mbaka",
          "summary": "Reno Omokri, former aide to ex-President Goodluck Jonathan, has asked Pope Francis, world leader of the Catholic Church, to investigate Ejike Mbaka, a priest in Enugu state, for his alleged involvement in political matters.\nAdvertisementIn a letter to the Vatican, Omokri accused Mbaka, spiritual director of Adoration Ministry Enugu, Nigeria (AMEN), of making false allegations and other unethical practices.\nHe said the conduct of the controversial Catholic priest has brought disrepute to the church, asking the Pope to ensure that disciplinary measures are brought against Mbaka.\n“You may or may not have heard of a certain Reverend Father Ejike Mbaka, a Catholic priest in Enugu, Nigeria, who has left the calling he took holy oaths to abide by, to dabble disastrously in politics,” Omokri said.\nThat I am willing to make an oath on a sworn affidavit that that allegation is false, and that at the material time when he made that allegation, I called on Reverend Mbaka to substantiate them with evidentiary proof, of which he never did.",
          "link": "https://www.thecable.ng/reno-omokri-writes-pope-lists-many-sins-of-mbaka",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "writes",
            "jonathan",
            "catholic",
            "priest",
            "lists",
            "pope",
            "sins",
            "omokri",
            "reverend",
            "mbaka",
            "church",
            "brought",
            "buhari",
            "nigeria",
            "reno"
          ]
        },
        {
          "title": "EXTRA: Fayose uses, markets herbal concoction for ‘man extra power’",
          "summary": "Ayo Fayose, former governor of Ekiti state, has been spotted in a video marketing a herbal concoction.\nAdvertisementIn the video, Fayose is seen explaining that he has used the drink a number of times and can testify that it works.\n“Honestly, Man O Man is fantastic.\nI recommend Man O Man for whosoever that has to use it.\nIt’s a herbal mixture without headache, pain,” he said.",
          "link": "https://lifestyle.thecable.ng/extra-fayose-uses-markets-herbal-concoction-for-man-extra-power/#new_tab",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "governor",
            "recommend",
            "fayose",
            "herbal",
            "power",
            "times",
            "mixture",
            "video",
            "uses",
            "man",
            "extra",
            "concoction",
            "drink",
            "pain",
            "markets"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "tradition",
            "bruised",
            "board",
            "governor",
            "enforces",
            "skye",
            "sacking",
            "bank",
            "took",
            "otudeko",
            "banks",
            "sanusi",
            "cbn",
            "emefiele"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "aggressive",
            "value",
            "business",
            "expand",
            "partnerships",
            "startups",
            "market",
            "size",
            "companies",
            "expansion",
            "fintech",
            "country",
            "nigeria",
            "company"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "army",
            "coas",
            "renaming",
            "locations",
            "followed",
            "counterinsurgency",
            "ne",
            "observer",
            "defeat",
            "disclosed",
            "renames",
            "counterterrorism",
            "nigerian",
            "operation"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "outlawed",
            "nightgrazing",
            "movement",
            "highways",
            "immediate",
            "jan",
            "cattle",
            "wish",
            "web",
            "underaged",
            "register",
            "19",
            "prohibited"
          ]
        },
        {
          "title": "Non remittance of deductions: Abiodun appeals to Ogun workers to be more patient",
          "summary": "IDOWU OLAKUNLEOgun State Governor, Prince Dapo Abiodun, at the weekend pleaded with the entire workforce in the state to be patient and to show more understanding with his administration.\nAbiodun made the plea while speaking at this year’s International Workers’ Day Celebrations, which took place at the MKO Stadium, Abeokuta on Saturday.\nThe governor’s appeal followed complaints by leaders of the State Labour Congress over the government’s alleged non remittance of deductions and neglect of other statutory entitlements, accruing to workers.\nAbiodun assured workers in the state that his government would continue to provide conducive atmosphere to enhance their productivity, by renovating their various offices.\nAll these we do to demonstrate our commitment towards improving our workers welfare, and ensure productivity of the Ogun State Public Service.",
          "link": "https://hallmarknews.com/non-remittance-of-deductions-abiodun-appeals-to-ogun-workers-to-be-more-patient/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "non",
            "governor",
            "commitment",
            "remittance",
            "deductions",
            "state",
            "patient",
            "workers",
            "ogun",
            "administration",
            "public",
            "day",
            "appeals",
            "quarterly",
            "ensure",
            "abiodun"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Yadda Jirgin Kasa Ya Yi Hadari A Kaduna",
          "summary": "",
          "link": "https://hausa.leadership.ng/yadda-jirgin-kasa-ya-yi-hadari-a-kaduna/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "kasa",
            "ya",
            "yi",
            "jirgin",
            "hadari",
            "yadda",
            "kaduna"
          ]
        },
        {
          "title": "Wani Mutum Ya Kwashe Dan Makwabcinsa Da Ya Yi Garkuwa Da Shi A Kaduna",
          "summary": "",
          "link": "https://hausa.leadership.ng/wani-mutum-ya-kwashe-dan-makwabcinsa-da-ya-yi-garkuwa-da-shi-a-kaduna/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "garkuwa",
            "shi",
            "ya",
            "yi",
            "mutum",
            "makwabcinsa",
            "da",
            "kwashe",
            "wani",
            "kaduna"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "High Registration fee: We did not target baptist girls academy",
          "summary": "Giving a detailed account of what transpired, Dr. Benjamin explained that the Registrar was on a scheduled inspection of the ongoing 2021 UTME registration exercise in the South-West.\n“The Registrar was on a scheduled inspection of the ongoing 2021 UTME registration exercise in the South-West.\n“On getting to Lagos, he held a press conference after which he proceeded to JKK Computer-Based Test Centre, one of the Board’s approved UTME Registration centres to assess the registration there.\nHe asked them how much they had paid for the UTME registration and the name of their school.\n“The students replied that they were from Baptist Girls Academy and that they had paid N8000 to their school for the 2021 UTME registration.",
          "link": "https://dailytimes.ng/high-registration-fee-we-did-not-target-baptist-girls-academy-jamb/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "board",
            "girls",
            "utme",
            "interview",
            "academy",
            "paid",
            "students",
            "fee",
            "registration",
            "schools",
            "exercise",
            "registrar",
            "baptist",
            "high",
            "target"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Senate: Our hands tied on Pantami’s case",
          "summary": "Some Nigerians have also blamed the Senate for not doing a thorough screening on Pantami before his appointment was confirmed by the red chamber.\nBasiru added that no petition had been sent to the Senate, detailing specific allegations against Pantami, since the matter came to the limelight penultimate week.\nHe nevertheless said the current controversy around the minister does not constitute any grounds for his sacking which only Buhari had the exclusive power to do.\n“The Senate can only act based on the information at its disposal as of the time of the screening.\nThe Senate does not have the power to remove a minister.",
          "link": "https://daylightng.com/senate-our-hands-tied-on-pantamis-case/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "based",
            "pantamis",
            "security",
            "does",
            "pantami",
            "minister",
            "information",
            "case",
            "screening",
            "tied",
            "media",
            "fact",
            "senate",
            "hands"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "popular",
            "account",
            "version",
            "page",
            "place",
            "mobile",
            "emerges",
            "offers",
            "launches",
            "convenient",
            "website",
            "site",
            "bookmaker",
            "1xbet"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "roads",
            "callup",
            "road",
            "amidst",
            "trucks",
            "gridlock",
            "drivers",
            "npa",
            "truck",
            "electronic",
            "apapa",
            "ecall",
            "system",
            "worsening"
          ]
        }
      ]
    }
  }
}