{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "My predecessor’s housing projects are now miscreants’ den ― Abiodun",
          "summary": "Kindly Share This Story:By James Ogunnaike, AbeokutaOgun State Governor, Prince Dapo Abiodun has disclosed that, some of the yet to be occupied housing estates built by his predecessor, Senator Ibikunle Amosun have become den of miscreants.\nAbiodun noted that his administration in the last two years had built more houses than what any other administration had done.\nHe said, “We are doing some housing projects in Kobape, Ilaro, Ota, Sagamu and Ijebu-Ode.\nToday we have built more houses in two years in office that others have built in four to six years.\n“We intend to ensure that these houses are acquired by the people that need it and they truly affordable.",
          "link": "https://www.vanguardngr.com/2021/05/my-predecessors-housing-projects-are-now-miscreants-den-%e2%80%95-abiodun/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "abiodun",
            "administration",
            "projects",
            "houses",
            "predecessors",
            "built",
            "tribes",
            "den",
            "president",
            "regime",
            "share",
            "housing",
            "state",
            "regional",
            "miscreants",
            "started"
          ]
        },
        {
          "title": "Security Challenges: Buhari vows to defeat forces of evil",
          "summary": "The National Security Adviser to the President, retired Maj.-Gen. Babagana Monguno, said the president made this known at a crucial security meeting in Abuja on Friday.\nMonguno stated that the meeting was summoned by the president to address the persisting security challenges in some parts of the country.\nHe disclosed that the meeting which had been adjourned to Tuesday next week, deliberated on vital national security issues.\nHe said: ‘Concerned about the persisting security challenges in parts of the country, Mr President summoned a crucial meeting of the National Security Council today as he continues to frontally confront the situation in the country.\n”Mr President is very prepared to take profound measures in the wider interest of the people and the Nigerian nation.",
          "link": "https://www.vanguardngr.com/2021/05/security-challenges-buhari-vows-to-defeat-forces-of-evil/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "national",
            "forces",
            "defeat",
            "meeting",
            "vows",
            "president",
            "nigerian",
            "summoned",
            "buhari",
            "todays",
            "evil",
            "security",
            "nation",
            "parts",
            "challenges",
            "stated"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Biafra: Ebubagu not after ESN, IPOB in south easth",
          "summary": "The Chairman of the South East Governors forum and Governor of Ebonyi State, David Umahi, on Friday said that Ebubeagu security outfit is not after the EASTERN Security network and Indigenous People of Biafra, IPOB, contrary to the rumour making the rounds in the region.\nThe governor equally said no member of the indigenous People of Biafra, IPOB, ESN is after him as rumoured by people in the state.\nHe said: “Let me correct an impression, no criminal is after the governor of Ebonyi state.\nNo IPOB member or ESN is after Ebonyi state governor.\n“What happened two days back was not the activities of IPOB or ESN but a pure criminality.",
          "link": "https://dailypost.ng/2021/04/30/biafra-ebubagu-not-after-esn-ipob-in-south-easth-umahi/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "easth",
            "leaders",
            "security",
            "esn",
            "south",
            "ebubagu",
            "ipob",
            "state",
            "biafra",
            "governor",
            "nation",
            "ebonyi",
            "youths",
            "takes"
          ]
        },
        {
          "title": "Presidency, Fr Mbaka are scammers",
          "summary": "The governor equally said no member of the indigenous People of Biafra, IPOB, ESN is after him as rumoured by people in the state.\nHe also announced his preparedness to dialogue with Ebonyi youths, groups and vowed to empower them but takes them to stop further destruction of lives and properties in various areas of the state.\nHe said: “Let me correct an impression, no criminal is after the governor of Ebonyi state.\nNo IPOB member or ESN is after Ebonyi state governor.\n“What happened two days back was not the activities of IPOB or ESN but a pure criminality.",
          "link": "https://dailypost.ng/2021/04/30/presidency-fr-mbaka-are-scammers-fayose/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "mbaka",
            "leaders",
            "security",
            "esn",
            "fr",
            "scammers",
            "presidency",
            "governor",
            "state",
            "ebonyi",
            "ipob",
            "nation",
            "youths",
            "takes"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "UFC: Usman gets N584m after beating Masvidal",
          "summary": "Kamaru Usman has raked in a mammoth £1.1million, about N584.2 million after his impressive knockout victory over Jorge Masvidal on Saturday night, Sportivation.com.ng reports.\nADVERTISEMENTAccording to Daily Mail, Usman earned £538,000 to show up, £459,000 pay-per-view bonus, a £43,000 sponsorship bonus and a well deserved £35,000 Performance of the Night bonus.\nJorge Masvidal also earned £358,000 to show, £186,000 in pay-per-view money and a £28,000 sponsorship bonus.\nThis is the biggest payday of Usman’s career so far and the Welterweight champion also benefited from the fact that Masvidal is also a top draw for the fans.\nKamaru Usman is a Nigerian-American professional mixed martial artist, former freestyle wrestler and graduated folkstyle wrestler.",
          "link": "https://thenationonlineng.net/ufc-usman-gets-n584m-after-beating-masvidal/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "sponsorship",
            "masvidal",
            "witnessed",
            "payperview",
            "usman",
            "bonus",
            "earned",
            "gets",
            "beating",
            "night",
            "n584m",
            "ufc",
            "wrestler",
            "performance"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "CAF CUP quarter finals: Kalu congratulates Enyimba FC",
          "summary": "Pillar of Sports in Africa and Chief Whip of the Senate, Dr. Orji Kalu has congratulated Nigerians on the victory of Enyimba Football Club (FC) of Nigeria against Orlando Pirates of South Africa in the final Group A match in the confederation of Africa Football (CAF) tournament.\nRecall, during Kalu’s stint as Governor of Abia state, Enyimba FC was repositioned, with the team clinching the CAF cup back to back in 2003 and 2004.\nThe Senate Chief Whip, who is also a soccer enthusiast, stressed that football brings people together and ultimately promotes peace and unity.\nHe said, “I felicitate with Enyimba FC on their well deserved victory against Orlando Pirates in the CAF tournament.\nKalu advocated private sector participation in sports development, adding that sports should not be seen as a leisure activity but business opportunity.",
          "link": "https://www.sunnewsonline.com/caf-cup-quarter-finals-kalu-congratulates-enyimba-fc/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "congratulates",
            "football",
            "africa",
            "quarter",
            "players",
            "finals",
            "fc",
            "victory",
            "team",
            "whip",
            "cup",
            "caf",
            "senate",
            "kalu",
            "enyimba"
          ]
        },
        {
          "title": "Ebubeagu not formed to fight IPOB, ESN –S’East Govs.",
          "summary": "From Chijioke Agwu AbakalikiGovernors of the South East region yesterday said the zone’s joint Security outfit Known as Ebubeagu was not formed to confront the Indigenous People of Biafra(IPOB) or it’s Security arm, Eastern Security Network (ESN).\nChairman of the forum and Governor of Ebonyi state, Chief David Umahi,stated this in Abakaliki while distributing 40 Siena Bus and 20 Hilux Vans to members of Ebubeagu and other security outfits in the state.\nHe noted that the formation of Ebubeagu became imperative in order to complement the police and other conventional security agencies in protecting the lives and properties of the people.\nHe urged political leaders especially in the zone to desist from actions and comments capable of worsening the security situation in the zone.",
          "link": "https://www.sunnewsonline.com/ebubeagu-not-formed-to-fight-ipob-esn-seast-govs/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "zone",
            "formed",
            "vans",
            "ebubeagu",
            "esn",
            "umahistated",
            "statehe",
            "fight",
            "zones",
            "worsening",
            "ipob",
            "govs",
            "security",
            "seast",
            "urged",
            "yesterday"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Buhari: We’ll Defeat Forces of Evil and Overcome Current Security Challenges",
          "summary": "Security council reconvenes TuesdayBy Deji Elumoye President Muhammadu Buhari has said that Nigeria will overcome all the current security problems and defeat the forces of evil marauding about in different parts of the country.\nThe President’s assurance was contained in a statement issued Friday by the National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), at the end of the National Security Council meeting at the State House, Abuja.\nThe NSA stressed the readiness of President Muhammadu Buhari to decisively end all form of security assault on the nation.\nPresident Buhari had convened a meeting of the National Security Council (NSC) at the Presidential Villa, Abuja Friday, following the escalation of security challenges in different parts of the country and general outcry by various stakeholders with many calling for an urgent action from the President.\nThe meeting was attended by Vice President Yemi Osinbajo, the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha; the Chief of Staff to the President, Prof Ibrahim Gambari; and the National Security Adviser (NSA), Major-General Babagana Monguno (rtd).",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/buhari-well-defeat-forces-of-evil-and-overcome-current-security-challenges/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "national",
            "chief",
            "current",
            "forces",
            "nation",
            "overcome",
            "defeat",
            "meeting",
            "president",
            "nsa",
            "buhari",
            "staff",
            "evil",
            "security",
            "council",
            "parts",
            "challenges"
          ]
        },
        {
          "title": "Bandits Kill 323, Kidnapped 949 Others in Kaduna in Three Months, Says Commissioner",
          "summary": "By John ShiklamThe Kaduna State Government has disclosed that 323 persons were killed, while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nAruwan also said 64 bandits were neutralised by troops, while several gunrunners were arrested during the same period.\nAccording to the commissioner, “The report covers banditry, kidnapping, cattle-rustling, attacks and reprisals.\nAccording to him, “Out of the 323 citizens killed, 292 were males.\n“Southern Kaduna Senatorial District had 68 deaths in total, of which five were women and two below the age of 18.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/bandits-kill-323-kidnapped-949-others-in-kaduna-in-three-months-says-commissioner/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "months",
            "949",
            "report",
            "kaduna",
            "deaths",
            "commissioner",
            "killed",
            "kill",
            "missions",
            "kidnapped",
            "state",
            "security",
            "neutralised",
            "323",
            "bandits"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "returned",
            "kankara",
            "men",
            "repentance",
            "leader",
            "forest",
            "shot",
            "schoolboys",
            "abduction",
            "auwalun",
            "gang",
            "state",
            "dead",
            "daudawa",
            "zamfara",
            "breaking",
            "bandits"
          ]
        },
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "returned",
            "kankara",
            "men",
            "repentance",
            "leader",
            "forest",
            "shot",
            "schoolboys",
            "abduction",
            "auwalun",
            "gang",
            "state",
            "dead",
            "daudawa",
            "zamfara",
            "breaking",
            "bandits"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "FACT CHECK: Did COVID-19 vaccine knock down a woman in Kaduna as Oyedepo claimed?",
          "summary": "On April 17, David Oyedepo, presiding bishop of Living Faith Church Worldwide, said he won’t take the COVID-19 vaccine and also asked his followers not to take it.\nAdvertisementWhile delivering a sermon in his church, he told the congregation that a certain woman went down after taking the vaccine injection in Kaduna.\nTheCable presents what we know so far about the incident and COVID-19 vaccination in Nigeria at present.\nSORTING FACTS FROM FICTIONNigeria commenced nationwide vaccination of the Oxford/AstraZeneca COVID-19 vaccine on March 5 after receiving 3.9 million doses courtesy of the UN-led COVAX facility.\nThe European Medicines Agency (EMA) also declared the AstraZeneca COVID-19 vaccine safe and effective.",
          "link": "https://www.thecable.ng/fact-check-did-covid-19-vaccine-knock-down-a-woman-in-kaduna-as-oyedepo-claimed",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "claimed",
            "tanko",
            "vaccination",
            "kaduna",
            "woman",
            "check",
            "oyedepo",
            "hospital",
            "administration",
            "vaccinated",
            "fact",
            "knock",
            "health",
            "covid19",
            "injection",
            "vaccine"
          ]
        },
        {
          "title": "Nasarawa governor: It’s unfair to say Buhari doesn't have the capacity to end insecurity",
          "summary": "Abdullahi Sule, governor of Nasarawa state, says it is unfair to say President Muhammadu Buhari does not have the capacity to end the security challenges in the country.\nThe development has heightened pressure on the Buhari-led administration to put an end to the security challenges.\n‘’You will remember in 2015, most of the security challenges are restricted to the northern part of the country, predominantly in the north-eastern part of the country.\nHaving outside support doesn’t necessarily mean that we don’t have the capacity.\nMost of the wars that have been fought in the world, a lot of countries ask for foreign support,” Sule added.",
          "link": "https://www.thecable.ng/nasarawa-gov-its-unfair-to-say-buhari-doesnt-have-the-capacity-to-end-insecurity",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "saying",
            "unfair",
            "think",
            "sule",
            "doesnt",
            "nasarawa",
            "president",
            "end",
            "capacity",
            "buhari",
            "governor",
            "security",
            "insecurity",
            "support",
            "say",
            "challenges"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "cbn",
            "tradition",
            "sacking",
            "board",
            "bruised",
            "bank",
            "banks",
            "skye",
            "emefiele",
            "governor",
            "enforces",
            "took",
            "otudeko",
            "sanusi"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "market",
            "expand",
            "companies",
            "business",
            "nigeria",
            "expansion",
            "country",
            "startups",
            "value",
            "company",
            "aggressive",
            "partnerships",
            "fintech",
            "size"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "disclosed",
            "operation",
            "locations",
            "defeat",
            "nigerian",
            "renames",
            "coas",
            "counterinsurgency",
            "followed",
            "observer",
            "ne",
            "renaming",
            "counterterrorism",
            "army"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "cattle",
            "underaged",
            "nightgrazing",
            "immediate",
            "19",
            "register",
            "web",
            "highways",
            "wish",
            "prohibited",
            "jan",
            "movement",
            "outlawed"
          ]
        },
        {
          "title": "FG admits hike in electricity tariff, says increase not significant",
          "summary": "Sale Mamman, has dismissed rumours of a major hike in electricity tariff, clarifying that there is no plan to “significantly” raise tariff, but only “minor” adjustments.\nIn a statement in Abuja on Thursday, the minister said instead of significant hike in electricity tariff, Nigerians should expect an increase efficiency in the sector to reduce tariffs while managing headwinds from foreign exchange and inflation.\nAccording to the minister, the clarification came amidst reports of possible major increase in the price of electricity that has dominated the public space.\nHe said the review planned by NERC is in accordance with Section 76 of the Electric Power Sector Reform Act of 2005.\nThus, as in January a minor review will occur in June.",
          "link": "https://hallmarknews.com/fg-admits-hike-in-electricity-tariff-says-increase-not-significant/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "admits",
            "reduce",
            "electricity",
            "tariff",
            "hike",
            "sector",
            "tariffs",
            "fg",
            "minister",
            "extraordinary",
            "increase",
            "review",
            "power",
            "significant",
            "minor"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Celebrity Plastic Surgeon, Dr. William Rahal, Strives To Provide Confidence For His Patients",
          "summary": "However, there’s another thing that makes Dr. William Rahal one of the most followed celebrity cosmetic surgeons in the US – his looks!\nHere are five boy-next-door looks of Dr. William Rahal that are over and above drool-worthy.\nDr. William Rahal says that the purpose of his work is to provide patients with the confidence they lack in their lives, which significantly benefits their quality of life.\nAmidst so much competition, the thing that motivates Dr. William Rahal the most is patient satisfaction.\nDr. William Rahal will continue to build his class-leading brand based on genuine services, authentic principles, and value that adds to the patients’ lives.",
          "link": "https://leadership.ng/celebrity-plastic-surgeon-dr-william-rahal-strives-to-provide-confidence-for-his-patients/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "plastic",
            "rahal",
            "patients",
            "medical",
            "celebrity",
            "field",
            "cosmetic",
            "provide",
            "surgeon",
            "confidence",
            "care",
            "dr",
            "strives",
            "william",
            "lives",
            "patient"
          ]
        },
        {
          "title": "Lulu’s Holistics: An Inspiring Humble-Beginnings Story",
          "summary": "While the mother-daughter team behind Lulu’s Holistics respects the marketing hustle, they urge business owners to realize that no amount of advertising spent can ever take the place of a solid business idea executed with careful precision.\n“My mom Janet, who is a vegan, created her own skincare line in the kitchen for personal use,” remembers Deannee.\nEight months later, we opened our first store in Florida.”Because Lulu’s products were originally conceptualized and developed for personal use, they have a particular appeal to the needs of Black women.\nI myself get acne, and razor bumps, so we definitely know how to cater to our customers’ needs,” says Deannee.\nNow, Lulu’s Holistics prides itself on having a complete line of products catering to the skincare needs of the whole family, albeit still with a special focus on women’s needs.",
          "link": "https://leadership.ng/lulus-holistics-an-inspiring-humble-beginnings-story/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "skincare",
            "real",
            "deannee",
            "inspiring",
            "products",
            "business",
            "janet",
            "lulus",
            "store",
            "needs",
            "marketing",
            "humblebeginnings",
            "holistics"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Chibok Girls: House moves to investigate N500m school rehabilitation fund",
          "summary": "By Tom OkpeThe House of Representatives on Wednesday said there is every need to investigate the 500 milion naira Chibok School rehabilitation fund.\nThe House ecalled the unfortunate incidence of 2014 when 230 girl students of Government Secondary School Chibok were abducted by the Boko Haram sect with the School, vandalised.\nThe abduction attracted national and international condemnation which led to the formation of the ‘Bring Back Our Girls’ (BBOG) movement by coalitions of Civil Society and Human Rights Organisation.\n“The House is also, Informed that the school when rebuilt and fully rehabilitated is expected to have a state of the art library, a laboratory, a computer and ICT Centre, a sports arena and a clinic.\n“However, the House is worried that seven years after the foundation laying ceremony of the Safe School Initiative and announcement of a 500 Million Naira Fund by the government for the rehabilitation of the Chibok School, nothing have been done in the school and the school has remained closed.”Recognizes the need for a detail investigation of what happened to the 500 million naira Chibok School Rebuilding Fund and the Safe School Initiative, it was resolved that an Ad-Hoc Committee to investigate the status of the rebuilding Fund and the Safe School Initiative and report back in 4 weeks.",
          "link": "https://dailytimes.ng/chibok-girls-house-moves-to-investigate-n500m-school-rehabilitation-fund/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "school",
            "initiative",
            "chibok",
            "n500m",
            "investigate",
            "500",
            "girls",
            "moves",
            "rehabilitation",
            "rebuilding",
            "million",
            "fund",
            "naira",
            "safe",
            "house"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Workers’ Day: Obi laments poor condition of Nigerian workers … Urges them to keep hope alive",
          "summary": "By CHIKA CHIMEZIEThe Vice Presidential candidate of the Peoples Democratic Party (PDP) in the 2019 elections, Mr. Peter Obi, has felicitated with workers as the world celebrates Workers’ Day today, May 1, 2021.\nIn a release made available to the press on Friday by his Media Office, Obi noted that the universality of worker’s day testifies to the unity in the goal of labour worldwide, which he said was for the uplift of the society and the ennobling of the human person.\nLamenting the poor condition of workers in Nigeria, Obi noted that things are made worse because poor economic realities in the country subject workers, as he said, “to live even below frugal comfort when even the agreed salaries are not paid.”Obi said it was most pathetic that retirees are owed pension and gratuities even now they require all possible care.\nOn the part of the leaders, Obi said that it was about time poor leadership, that had got Nigeria and Nigerians, including workers on their knees was checked.\nHe called for reasonability in the way those in government treated workers, reminding them of workers’ role and contributions to the growth of the country thus urging them to use the occasion of Workers Day to reflect about the country.",
          "link": "https://daylightng.com/workers-day-obi-laments-poor-condition-of-nigerian-workers-urges-them-to-keep-hope-alive/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "day",
            "hope",
            "alive",
            "urges",
            "nigerians",
            "nigeria",
            "leadership",
            "nigerian",
            "condition",
            "noted",
            "country",
            "laments",
            "workers",
            "salaries",
            "obi",
            "poor"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "account",
            "bookmaker",
            "emerges",
            "launches",
            "website",
            "version",
            "offers",
            "page",
            "mobile",
            "popular",
            "1xbet",
            "place",
            "site",
            "convenient"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "ecall",
            "truck",
            "callup",
            "trucks",
            "apapa",
            "drivers",
            "npa",
            "gridlock",
            "roads",
            "worsening",
            "amidst",
            "system",
            "electronic",
            "road"
          ]
        }
      ]
    }
  }
}