{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Mbaka is a contractor — Presidency",
          "summary": "The statement with the title, “Father Mbaka is everything apart from what he claims” read, “An outsider distilling the avalanche of verbiage, will be surprised that after supporting the President two times to win the Presidency, Father Mbaka has made a complete U-Turn, preposterously asking President Buhari to resign or be impeached.\n“ Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\nThe President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\n“Anyone familiar with President Buhari knows that he doesn’t break the laid down rules in dealing with contracts or any other government business for that matter.\n“We are calling on Father Mbaka to concentrate on his spiritual calling and stop speaking like politicians who it is obvious he (Mbaka) has been dining and wining with.",
          "link": "https://www.vanguardngr.com/2021/05/mbaka-is-a-contractor-presidency/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "presidency",
            "buhari",
            "spiritual",
            "president",
            "contractor",
            "father",
            "jesus",
            "nabena",
            "god",
            "threatening",
            "statement",
            "mbaka"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Buhari govt has failed – FENRAD",
          "summary": "The Foundation for Environmental Rights Advocacy and Development, FENRAD, a pro-democracy and rights group, has lamented the spate of killings across Nigeria.\nGreenfield University and Federal College of Mechanisation Afaka both in Kaduna State are latest cases in point.\n“Away from insecurity, the economy which is itself another administrative pillar of the federal government prior to 2015 has contracted.\n“The government still pays huge amount in the name of subsidy given that maritime and coastal costs for petroleum products differ upon landing.\nLanding costs which include charges on jetty throughput, NPA charge, lightering cost, NIMASA charge and other logistics usually taken care of by the federal government make up the subsidy payment.",
          "link": "https://dailypost.ng/2021/05/01/insecurity-buhari-govt-has-failed-fenrad/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "buhari",
            "failed",
            "fenrad",
            "federal",
            "war",
            "rights",
            "petroleum",
            "payment",
            "release",
            "subsidy",
            "insecurity",
            "state",
            "govt",
            "nation"
          ]
        },
        {
          "title": "First Bank: 'Decision to sack Adeduntan was in best interest'",
          "summary": "The approval came after the Upper Chamber considered a report by the Committee on Local and Foreign Debts during plenary.\nOut of the total sum approved, $1.5 billion is to be sourced from the World Bank; €671 million euros from the Export-Import Bank of Brazil; and another €324 million euros from the Deutsche Bank of Germany.\nHe explained that the loan would be sourced from the International Monetary Fund, World Bank, African Development Bank, Export, Import Bank of Brazil and the African Export, Import Bank.\nAccording to President Buhari, out of the total $5.513 billion (USD) loan request, the sum of $3.4 billion (USD) would be sourced from the International Monetary Fund; $1.5 billion (USD) from the World Bank; $500 million (USD) from the African Development Bank; and $113 million (USD) from the Islamic Development Bank.\nIt is not enough to base the recommendations on the interest rate alone, or the moratorium or tenor.",
          "link": "https://dailypost.ng/2021/05/01/first-bank-decision-to-sack-adeduntan-was-in-best-interest-awosika-insists/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "best",
            "adeduntan",
            "sack",
            "million",
            "sum",
            "finance",
            "local",
            "federal",
            "committee",
            "loan",
            "usd",
            "bank",
            "decision",
            "billion",
            "interest"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Real Madrid captain Ramos ruled out of Osasuna game",
          "summary": "Our ReporterReal Madrid captain Sergio Ramos will once again be absent when they take on Osasuna in LaLiga on Saturday, despite returning to full training on Friday.\nCoach Zinedine Zidane said earlier on Friday that Ramos was fit and available for selection after missing the last nine games through injury.\nLaLiga appears set for the closest title race in recent years with three points separating the top four – Atletico Madrid, Real, Barcelona and Sevilla.\nDefending champions Real sit second on 71 points, two off leaders Atletico, with five games remaining.\nThe Frenchman said defender Marcelo will be available for the game at Chelsea despite being called up to work at a polling station for Tuesday’s regional elections in Madrid.",
          "link": "https://thenationonlineng.net/real-madrid-captain-ramos-ruled-out-of-osasuna-game/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "madrid",
            "training",
            "zidane",
            "title",
            "real",
            "second",
            "points",
            "ramos",
            "captain",
            "osasuna",
            "game",
            "games",
            "ruled"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "My regret for Enyimba, sports in Nigeria – Kalu",
          "summary": "Enyimba was everything to Aba people, the team was worshipped and it like after God, Enyimba was next in Abia State.\nI created two teams- Enyimba in Aba and Orji Uzoh Kalu Babes in Umuahia but they changed the name.\nI encourage state governor, the federal government and looking at Enyimba today, you will agree with me that the ream is a brand now.\nWhy did Enyimba as an international brand fail to attract sponsorship during you term as governor of Abia State?\nAs governor of Abia State, it was only at the Enyimba Stadium that you could come and play well and win.",
          "link": "https://www.sunnewsonline.com/my-regret-for-enyimba-sports-in-nigeria-kalu/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "regret",
            "enyimba",
            "nigeria",
            "team",
            "club",
            "abia",
            "football",
            "players",
            "governor",
            "kalu",
            "caf",
            "left",
            "state"
          ]
        },
        {
          "title": "I get depressed when men drool over my boobs – Kemi Ikuseedun",
          "summary": "But mention ‘Mummy Wa’ and you see several heads turn.\nHowever, one thing makes Mummy Wa stand out and it’s the fact that she’s quite endowed in the upper region.\nIn a chat with Saturday Sun, the ‘wife’ of popular Internet comedian, Mr. Macaroni played by Debo Adebayo, bemoans her sexual harassment encounters.\n“I think every girl, beautiful or not, has faced sexual harassment before.\nI love how I look.”On what turns her off in a relationship, Mummy Wa says it’s dishonesty and lack of respect.",
          "link": "https://www.sunnewsonline.com/i-get-depressed-when-men-drool-over-my-boobs-kemi-ikuseedun-mummy-wa/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "maybe",
            "kemi",
            "girl",
            "men",
            "ikuseedun",
            "guys",
            "depressed",
            "mummy",
            "sexual",
            "harassment",
            "way",
            "look",
            "boobs",
            "wa",
            "physical",
            "drool"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "FirstBank: I Acted in Honour, Integrity, Says Awosika",
          "summary": "By Obinna ChimaThe sacked Chairman of First Bank Nigeria Limited, Mrs. Ibukun Awosika, has said that she acted in honour and integrity with the interest of the institution, all its stakeholders and the nation during her 11-year reign at the bank.\nAwosika, wrote this in an article she titled: “My FBN Group Journey,” posted on instagram, a social media platform.\nEmefiele had announced the appointment of a former Minister of State for Finance and former Executive Director of First Bank, Mr. Remi Babalola, as chairman of FBN Holdings.\nFirst Bank Nigeria Limited’s new Chairman is Tunde Hassan-Odukale, who replaced Awosika.\nGbenga Shobo, deputy managing director; and Remi Oni and Abdullahi Ibrahim, executive directors, are members of the reconstituted board.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/firstbank-i-acted-in-honour-integrity-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "integrity",
            "honour",
            "board",
            "interest",
            "stakeholders",
            "limited",
            "fbn",
            "firstbank",
            "bank",
            "awosika",
            "remi",
            "mr",
            "acted"
          ]
        },
        {
          "title": "Amid Unending Killings, Buhari Mulls Fresh Strategy at Security Meeting",
          "summary": "It also emerged yesterday that 323 persons had been killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), in a statement after the meeting, stressed the readiness of President Buhari to decisively end all forms of security challenges facing the nation.\nSpokesman of the Yobe State Police Command, ASP Dungus Abdulkarim confirmed the attack.\nIn 3 Months, Bandits Kill 323 in Kaduna StateThe Kaduna State Government yesterday disclosed that 323 persons were killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe Commissioner for Internal Security and Home Affairs, Mr. Samuel Aruwan stated this yesterday while presenting a report on the security situation in the state at a security meeting which held at the Government House, Kaduna.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/amid-unending-killings-buhari-mulls-fresh-strategy-at-security-meeting/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "meeting",
            "fresh",
            "buhari",
            "amid",
            "president",
            "deaths",
            "bandits",
            "security",
            "mulls",
            "strategy",
            "unending",
            "haram",
            "323",
            "killings",
            "yobe",
            "state",
            "kaduna"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "men",
            "leader",
            "bandits",
            "kankara",
            "schoolboys",
            "dead",
            "breaking",
            "forest",
            "zamfara",
            "returned",
            "auwalun",
            "state",
            "daudawa",
            "shot",
            "gang",
            "abduction",
            "repentance"
          ]
        },
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "men",
            "leader",
            "bandits",
            "kankara",
            "schoolboys",
            "dead",
            "breaking",
            "forest",
            "zamfara",
            "returned",
            "auwalun",
            "state",
            "daudawa",
            "shot",
            "gang",
            "abduction",
            "repentance"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Daily COVID Tracker: Nigeria records 55 infections, and WHO approves Moderna vaccine for use",
          "summary": "Advertisement NAFDAC Approves Pfizer COVID VaccineThe National Agency for Food and Drug Administration and Control (NAFDAC) has approved Pfizer Biotech COVID-19 vaccine for emergency use in Nigeria.\nWHO approves Moderna COVID-19 vaccine for emergency useAdvertisementThe World Health Organization (WHO) has listed Moderna COVID-19 vaccine for emergency use.\nNigeria records 55 infectionsAdvertisementThe Nigerian Center for Disease Control (NCDC) has reported 55 new cases of COVID-19 across 7 states and the federal capital territory (FCT).\nLagos, the pandemic hotspot in Nigeria, recorded 21 new infections, followed closely by Yobe with 19 cases.\nSaturday’s figure is slightly higher than the 1,027 cases reported Thursday.",
          "link": "https://www.thecable.ng/daily-covid-tracker-nigeria-records-55-infections-and-who-approves-moderna-vaccine-for-use",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "covid19",
            "nigeria",
            "daily",
            "records",
            "tracker",
            "covid",
            "reported",
            "states",
            "approves",
            "moderna",
            "infections",
            "55",
            "emergency",
            "vaccine",
            "vaccines",
            "recorded",
            "cases"
          ]
        },
        {
          "title": "You guys were friends before anything, Davido’s cousin tells Chioma",
          "summary": "Clarks Adeleke, Davido‘s cousin, has spoken of the singer’s relationship with Chioma Avril Rowland, his estranged fiancee, at her birthday dinner night.\nTheCable Lifestyle had earlier reported how Chioma pulled down photos of Davido from her Instagram page.\nAdvertisementOn Friday, Chioma marked her 26th birthday at a dinner night that united her loved ones with the Adeleke family.\nHappy birthday, Chioma, from the whole Adeleke family.”Davido proposed to Chioma in September 2019 after the couple had staged a low-key introduction ceremony.\nSpeaking of their relationship in an interview, Davido said: “I’ve known Chioma for seven years.",
          "link": "https://lifestyle.thecable.ng/you-guys-were-friends-before-anything-davidos-cousin-tells-chioma/#new_tab",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "didnt",
            "matter",
            "guys",
            "tells",
            "cousin",
            "song",
            "relationship",
            "birthday",
            "davidos",
            "couple",
            "went",
            "chioma",
            "adeleke",
            "davido",
            "friends"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "emefiele",
            "sacking",
            "otudeko",
            "bruised",
            "took",
            "skye",
            "enforces",
            "banks",
            "board",
            "cbn",
            "governor",
            "sanusi",
            "bank",
            "tradition"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "business",
            "nigeria",
            "startups",
            "market",
            "value",
            "aggressive",
            "country",
            "company",
            "partnerships",
            "companies",
            "expansion",
            "expand",
            "fintech",
            "size"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "disclosed",
            "locations",
            "renaming",
            "nigerian",
            "defeat",
            "counterterrorism",
            "ne",
            "army",
            "renames",
            "observer",
            "counterinsurgency",
            "followed",
            "operation",
            "coas"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "movement",
            "prohibited",
            "immediate",
            "jan",
            "web",
            "underaged",
            "outlawed",
            "highways",
            "nightgrazing",
            "wish",
            "19",
            "cattle",
            "register"
          ]
        },
        {
          "title": "Zenith Bank grows profit by 4% to N61bn in Q1, 2021",
          "summary": "According to the unaudited statement of account presented to the Nigerian Stock Exchange (NSE) on Friday, 30th April 2021, Profit After Tax (PAT) also grew by 5% from N50.5 billion in Q1 2020 to N53.1 billion in Q1 2021, despite the challenging macroeconomic environment aggravated by the COVID-19 pandemic.\nThe profitability, the Bank said, was driven by the optimisation of the cost of funds and improvement in non-interest income.\nThe Bank’s cost of funds reduced significantly from 2.6% in March 2020 to 1.1% in March 2021.\nNon-interest income increased by 10% from N46.6 billion to N51.2 billion, driven by growth in credit-related fees and fees on electronic products.\nCustomer deposits grew by 6% from N5.34 trillion in December 2020 to N5.68 trillion in March 2021.",
          "link": "https://hallmarknews.com/zenith-bank-grows-profit-by-4-to-n61bn-in-q1-2021/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "2021",
            "n61bn",
            "grows",
            "q1",
            "banks",
            "trillion",
            "zenith",
            "fees",
            "grew",
            "2020",
            "bank",
            "profit",
            "income",
            "billion",
            "increased"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "MONEY MATTERS: Golden Rules Of Investing",
          "summary": "When it comes to managing your money, investing is a key part of building wealth.\nBut try following some simple golden rules of investing can help you stay on the right track.\nIf you feel behind with investing, don’t get discouraged.\nYou’ll be investing for many years, so it’s important to do regular check-ins to stay on top of your money.\nIn all, If you’re wondering how to invest, use these golden rules of investing to get started.",
          "link": "https://leadership.ng/money-matters-golden-rules-of-investing/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "simple",
            "investments",
            "golden",
            "matters",
            "investing",
            "dont",
            "key",
            "stay",
            "financial",
            "wealth",
            "help",
            "money",
            "rules"
          ]
        },
        {
          "title": "Five Personal Finance Books You Should Be Reading In 2021",
          "summary": "It takes an in-depth look at the ways we spend, invest, borrow and waste money from a psychological perspective.\nThis book has had a place on my shelf for twenty years and is one I recommend to everyone.\nBy understanding and implementing the ideas in this book, anyone with an income has the opportunity to grow their wealth.\nThe opinions expressed in this commentary are those of the author and may not necessarily reflect those held by Kestra Investment Services, LLC or Kestra Advisory Services, LLC.\nThis is for general information only and is not intended to provide specific investment advice or recommendations for any individual.",
          "link": "https://leadership.ng/five-personal-finance-books-you-should-be-reading-in-2021/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "finance",
            "personal",
            "2021",
            "women",
            "reading",
            "sound",
            "book",
            "financial",
            "investment",
            "theres",
            "money",
            "think",
            "services",
            "books",
            "ways"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Nigerian father stops son from marrying lady who also had an affair with him years ago",
          "summary": "A young lady has shared a sad story about her love life.\nThe woman took to social media to narrate how her boyfriend’s father stopped his son from getting married to her, because they had an affair years ago.\nI had an affair with my boyfriend’s father years before I knew his son.\nHe invited me over a week ago to come and see him, but I refused to go because I know he wants something to do with me.\nShould I tell my fiance or continue to fight the battle?”",
          "link": "https://dailytimes.ng/nigerian-father-stops-son-from-marrying-lady-who-also-had-an-affair-with-him-years-ago/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "boyfriends",
            "nigerian",
            "woman",
            "marrying",
            "wants",
            "young",
            "father",
            "son",
            "week",
            "ago",
            "dead",
            "stops",
            "wrote",
            "lady",
            "affair"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Suspected herders burn houses in Nasarawa community, many displaced",
          "summary": "Houses were reportedly torched by suspected herdsmen in parts of Keana and Doma Local Government Areas of Nasarawa State.\nThe President of Tiv Youths Organisation in the state, Barnabas Zayol, stated this while speaking with our correspondent on Friday in Lafia, the state capital.\nZayol said that most of the houses burnt down belonged to about 50,000 Tiv farmers chased out of their communities by the suspected herdsmen.\nThese herdsmen have chased us out of our villages and the houses we laboured to build have been burnt down.”Zoyol identified the affected communities to include Ategher, Avewua, Ugbele Aondokaa, Ikper, Gborgyo and Uluwa Kwanankele.\nA member of the state House of Assembly representing Keana constituency, Mohammed Omedefu, has assured the victims of the state government’s support.",
          "link": "https://daylightng.com/suspected-herders-burn-houses-in-nasarawa-community-many-displaced/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "herders",
            "community",
            "constituency",
            "representing",
            "nasarawa",
            "suspected",
            "displaced",
            "affected",
            "tiv",
            "burn",
            "situation",
            "houses",
            "speaking",
            "state",
            "communities"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "1xbet",
            "website",
            "account",
            "site",
            "emerges",
            "bookmaker",
            "page",
            "version",
            "launches",
            "offers",
            "popular",
            "convenient",
            "mobile",
            "place"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "gridlock",
            "road",
            "callup",
            "amidst",
            "worsening",
            "system",
            "electronic",
            "roads",
            "trucks",
            "npa",
            "drivers",
            "apapa",
            "truck",
            "ecall"
          ]
        }
      ]
    }
  }
}