{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "FG committed to solving housing deficit – Fashola",
          "summary": "The Minister of Works and Housing, Mr Raji Fashola, says Federal Government is committed and passionate about solving the housing deficit in the country.\nFashola said this in Ibadan on Thursday during an inspection tour of the Federal Government Housing project, situated on the Ibadan-Oyo Expressway.\nHe said that the Federal Government was determined to do something more in the area of housing.\nThe News Agency of Nigeria (NAN) reports that the housing project is made up of 72 units.\nThe Federal Controller of Works in Oyo State, Mr Kayode Ibrahim and other management staff of the Works and Housing Ministry were among the minister’s entourage.",
          "link": "https://www.vanguardngr.com/2021/04/fg-committed-to-solving-housing-deficit-fashola-2/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "rent",
            "minister",
            "solving",
            "committed",
            "late",
            "deficit",
            "federal",
            "works",
            "fg",
            "housing",
            "nigeria",
            "koladaisi",
            "state",
            "project",
            "fashola"
          ]
        },
        {
          "title": "World Malaria Day: Godrej Nigeria holds clean-up exercise in Oyingbo",
          "summary": "Kindly Share This Story:By Juliet EbirimCharity they say begins at home and the state of one’s environment and living conditions are indeed two sides of the same coin.\nThis, therefore, suggests that the state of cleanliness of a community determines the lifestyle of its occupants.\nIt takes a healthy community to produce sound individuals that contribute to its positive development, which is only some of the reasons Godrej Nigeria organized a community clean-up exercise as part of their corporate social responsibility and to mark World Malaria Day 2021.\nAlso, social media influencers including Waje, Aproko Doctor among others joined in lending their voices to the cause.\nThe Good Knight Nigeria Team is poised to continue efforts in its counter-malaria quest while working hand in hand with the Ministry of Health and other relevant entities to show that zero malaria is achievable in Nigeria.",
          "link": "https://www.vanguardngr.com/2021/04/world-malaria-day-godrej-nigeria-holds-clean-up-exercise-in-oyingbo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "day",
            "oyingbo",
            "social",
            "cleanup",
            "zero",
            "state",
            "environment",
            "nigeria",
            "holds",
            "exercise",
            "malaria",
            "community",
            "world",
            "share",
            "godrej"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Herdsmen: 'IPOB'll go after all terrorists'",
          "summary": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has reacted to threat by the Miyetti Allah Cattle Breeders Association, MACBAN, to avenge the death of herdsmen in Anambra State.\nKanu warned that IPOB would go after every killer Fulani herdsmen terrorists in the Southeast.\nSaleh Alhassan, had said Kanu and IPOB members would pay dearly for the killing of about 50 herdsmen recently in the Southeast.\nHowever, the IPOB leader said the implementation of such a threat would be the last of herdsmen in the Southeast.\nWe are after you Fulani terrorists and murderers masquerading as herdsmen.",
          "link": "https://dailypost.ng/2021/04/29/herdsmen-ipobll-go-after-all-terrorists-nnamdi-kanu-replies-miyetti-allahs-threat/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "ipobll",
            "terrorists",
            "southeast",
            "threat",
            "nnamdi",
            "miyetti",
            "leader",
            "herdsmen",
            "macban",
            "ipob",
            "kanu"
          ]
        },
        {
          "title": "I am angered, troubled by attacks in Nigeria",
          "summary": "Former Lagos State Governor, Bola Tinubu, has condemned the violent attacks in many states of Nigeria.\nIn a statement on Thursday, the All Progressives Congress (APC) leader said he was “angered and troubled”.\nTinubu observed the attacks have caused many to disparage the Nigerian military and security forces.\nGovernment also must continue to encourage the security forces to do their utmost to subdue this threat.\nHe added that the enemy’s attacks seem to focus on schools, religious institutions and security forces in order to extinguish the light of knowledge and hope.",
          "link": "https://dailypost.ng/2021/04/29/i-am-angered-troubled-by-attacks-in-nigeria-tinubu/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "visited",
            "forces",
            "lives",
            "violent",
            "security",
            "yobe",
            "angered",
            "nigeria",
            "women",
            "attacks",
            "troubled",
            "nigerians",
            "win"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Ebere Uneze becomes IMSU alumni BoT chairman",
          "summary": "By OLADAPO SOFOWORASoft-spoken Executive Director, Assets Management Corporation of Nigeria, (AMCON) Dr. Ebere Fortunate Uneze is one silent achiever that doesn’t brag about his numerous achievements both locally and internationally.\nThe internationally acclaimed economist and development strategist recently emerged as the new chairman, Board of Trustees (BoT) of the Imo State University Alumni Association.\nADVERTISEMENTOthers on the list include Barrister Chinwe Mbakwem who is the new secretary; Hon, Abba Chimaroke; High Chief Enyioha Chris Anyanwu; Hon.\nAmbrose Obioha; Architect Okwukwe Onuzo; Pastor John Maduka; Magistrate Ebitimi Ebitare and High chief Clovis Okereke.\nThe new BoT promises to take the alumni to the next level and beyond.",
          "link": "https://thenationonlineng.net/ebere-uneze-becomes-imsu-alumni-bot-chairman/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "recently",
            "imsu",
            "chairman",
            "high",
            "ebere",
            "hon",
            "chief",
            "alumni",
            "members",
            "trustees",
            "bot",
            "executive",
            "board",
            "uneze",
            "association"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Amotekun arrests 11 bandits, 183 cows in Oyo",
          "summary": "From Oluseye Ojo, IbadanEleven suspected bandits and their 183 cows have been arrested by the operatives of Amotekun Corps in Oyo State over criminal activities.\nCommandant of Amotekun Corps in the state, Col. Olayinka Olayanju (retd), said the feat was achieved by the security outfit, in collaboration with Oodua Peoples Congress (OPC) and Vigilante Group of Nigeria (VGN).\nBesides, another five suspected bandits were arrested in Saki East on April 29, 2021, and have been handed over to the Divisional Police Officer in the area for further investigation.\nHe said six among the suspects were nabbed at Kajola Local Government of the state when the three security outfits were on a joint routine patrol, in the early hours of yesterday, adding that they were arrested along two separate routes within the local government.\nOlayanju explained that the six suspects were arrested in separate encounters at two roadblocks, illegally mounted by the suspected bandits, adding that members of one of the groups were arrested at a spot along Okeho-Ilua Road, while the arrest of the other group took place at a place along Okeho-Iseyin Road, at about 4am yesterday.",
          "link": "https://www.sunnewsonline.com/amotekun-arrests-11-bandits-183-cows-in-oyo/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "183",
            "suspected",
            "separate",
            "road",
            "amotekun",
            "cows",
            "suspects",
            "arrests",
            "security",
            "yesterday",
            "arrested",
            "place",
            "state",
            "oyo",
            "11",
            "bandits"
          ]
        },
        {
          "title": "Ex-president Jonathan cautions NASS against delisting LGAs",
          "summary": "We started the struggle in 2016 and the 7th and 8th Assemblies graciously passed the LGA autonomy bill into law.\n“I don’t know why the LGAs that are the most reliable, dependable and acceptable tier of government should be delisted?\nAnd to solve insecurity, we must seek local solutions by allowing LGAs to have local police, since states have been over policed over time.\nAnd this cannot be taken for granted because the LGAs are the mirror of the nation being the closest to the people.\nSo, any bill set out to delist LGAs is an anti-people bill,” he said.",
          "link": "https://www.sunnewsonline.com/ex-president-jonathan-cautions-nass-against-delisting-lgas/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "states",
            "delist",
            "delisting",
            "bill",
            "local",
            "president",
            "grassroots",
            "autonomy",
            "national",
            "lgas",
            "nass",
            "cautions",
            "jonathan",
            "tier",
            "expresident"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "CBN Appoints New Board for FBN Holdings, FirstBank",
          "summary": "By Obinna ChimaThe Central Bank of Nigeria (CBN) has reinstated Dr. Adesola Adeduntan who was summarily retired on Wednesday as the Managing Director/Chief Executive Officer of First Bank Nigeria Limited by the board.\nAlso, the banking sector regulator Thursday removed, effective immediately, all directors of the bank as well as those of its parent company, FBN Holdings Plc.\nAccording to the CBN Governor, Mr. Remi Babalola, a former Minister of State for Finance is now Chairman FBN Holdings.\nOther new directors on the FBN Holdings’ Board are Fatade Abiodun Oluwole, Kofo Dosekun, Remi Lasaki, Dr. Alimi Abdulrasaq, Ahmed Modibbo, Khalifa Imam, Sir Peter Aliogo, while Mr. UK Eke retains his position as Managing Director of FBN Holdings.\nOn the other hand, for First Bank Nigeria Limited, the new Chairman is Tunde Hassan-Odukale.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/29/cbn-appoints-new-board-for-fbn-holdings-firstbank/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "mr",
            "holdings",
            "remi",
            "managing",
            "appoints",
            "firstbank",
            "board",
            "bank",
            "fbn",
            "nigeria",
            "banking",
            "cbn",
            "stability"
          ]
        },
        {
          "title": "CBN Sacks All First Bank Directors (See Governor Godwin Emefiele’s Statement)",
          "summary": "GOVERNOR’S STATEMENT ON THE PURPORTED MANAGEMENT CHANGE AT THE FIRST BANK OF NIGERIA LTD1.0 Good afternoon ladies and gentlemen.\n3.0 Ordinarily the board is vested with the authority to make changes in the management team subject to CBN approval.\nThe shareholders of the bank and FBN Holding Plc also lacked the capacity to recapitalize the bank to minimum requirements.\n7.0 The CBN stepped in to stabilize the bank in its quest to maintain financial stability, especially given FBN’s systemic importance as enumerated earlier.\nThe appointment of the following persons as directors in FBN Ltd and FBN Holdings PlcHoldco1.Chairman – Remi Babalola2.Dr.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/29/cbn-sacks-all-first-bank-directors-see-governor-godwin-emefieles-statement/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "emefieles",
            "cbn",
            "directors",
            "management",
            "godwin",
            "loans",
            "regulatory",
            "governor",
            "statement",
            "board",
            "bank",
            "fbn",
            "financial",
            "sacks",
            "stability"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "FLASHBACK: Without A Peaceful, Friendly Heart, You Can’t Bring Peace To The People, Jonathan Told Buhari, Other APC Chieftains Before 2015 Polls",
          "summary": "He noted that for anyone to bring peace, they must preach peace.\nAccording to him, somebody that asks you to kill cannot bring peace but crises that can set the country ablaze.\nIf you do not have a peaceful heart and a friendly heart, you cannot bring peace to the people.\nFor you to bring peace, you must be somebody who can forgive, somebody who preaches peace.\n\"It’s not somebody that asks you to go and kill that will bring peace.",
          "link": "http://saharareporters.com/2021/04/29/flashback-without-peaceful-friendly-heart-you-can’t-bring-peace-people-jonathan-told",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "heart",
            "friendly",
            "change",
            "president",
            "venom",
            "cant",
            "jonathan",
            "chieftains",
            "polls",
            "country",
            "flashback",
            "set",
            "nigerians",
            "peaceful",
            "somebody",
            "told",
            "party",
            "bring",
            "peace"
          ]
        },
        {
          "title": "FLASHBACK: Without A Peaceful, Friendly Heart, You Can’t Bring Peace To The People, Jonathan Told Buhari, Other APC Chieftains Before 2015 Polls",
          "summary": "He noted that for anyone to bring peace, they must preach peace.\nAccording to him, somebody that asks you to kill cannot bring peace but crises that can set the country ablaze.\nIf you do not have a peaceful heart and a friendly heart, you cannot bring peace to the people.\nFor you to bring peace, you must be somebody who can forgive, somebody who preaches peace.\n\"It’s not somebody that asks you to go and kill that will bring peace.",
          "link": "http://saharareporters.com/2021/04/29/flashback-without-peaceful-friendly-heart-you-can%E2%80%99t-bring-peace-people-jonathan-told",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "heart",
            "friendly",
            "change",
            "president",
            "venom",
            "cant",
            "jonathan",
            "chieftains",
            "polls",
            "country",
            "flashback",
            "set",
            "nigerians",
            "peaceful",
            "somebody",
            "told",
            "party",
            "bring",
            "peace"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Police warn against Yoruba nation rally in Ogun",
          "summary": "The police in Ogun state say the planned rally to promote the concept of a Yoruba nation, scheduled to hold in Ogun state on May 1, is not approved by the command.\nAdvertisementAbimbola Oyeyemi, spokesman of the Ogun police command, in a statement on Thursday, urged the organisers of the rally to shelve all plans so as not to disrupt peace in the state.\nThe same group staged another rally in Shagamu on 16/4/2021 where they made an attempt to attack Shagamu police station for no reason.\n“The same group is again planning to hold another mass rally on 1st May, 2021 at Abeokuta, making it the 4th rally in the State in quick succession.\n“It is also instructive to note that available intelligence shows that the organisers of these rallies are being sponsored by certain individuals outside the State and the country to destabilise Ogun State.",
          "link": "https://www.thecable.ng/police-warn-against-yoruba-nation-rally-in-ogun",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "organisers",
            "command",
            "note",
            "yoruba",
            "ogun",
            "nation",
            "group",
            "warn",
            "rally",
            "state",
            "public",
            "rallies",
            "hold"
          ]
        },
        {
          "title": "Insecurity: Oyo to deploy Man O’ War operatives to schools",
          "summary": "The Oyo government says it will deploy Man O’ War operatives to primary and secondary schools across the state to beef up security.\nAdvertisementSeyi Makinde, governor of Oyo, disclosed this when he received national executives of the paramilitary organisation at his office on Thursday.\nI can testify to the role Man O’ War played during the elections that I participated in as governorship candidate in 2015 and 2019.\nSo, I will renew my commitment in Man O’ War,” Makinde said.\nHere also in Oyo state, we have been dealing with kidnapping, farmer/herder clashes and people have suddenly become temperamental.",
          "link": "https://www.thecable.ng/insecurity-oyo-to-deploy-man-o-war-operatives-to-schools",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "operatives",
            "war",
            "command",
            "state",
            "schools",
            "makinde",
            "security",
            "paramilitary",
            "man",
            "national",
            "insecurity",
            "deploy",
            "oyo"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "CBN sacks all directors of First Bank Limited and FBN holdings",
          "summary": "The Central Bank of Nigeria has announced the immediate removal of all of the directors of First Bank Nigeria Limited as well as FBN holdings.\nNevertheless, one of the important points in the CBN’s announcement this evening is the return of Dr. Sola Adedutan as the MD/CEO of FirstBank of Nigeria.\nYesterday, the board of First Bank had announced Adedutan’s retirement and appointed Gbenga Shobo in his place.\nThe CBN had also warned FirstBank in a separate memo that Adedutan’s removal was improper because his tenure had not elapsed.\nAlso, the CBN has announced a new board of directors for FirstBank.",
          "link": "https://techcabal.com/2021/04/29/cbn-sacks-first-bank-directors/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "holdings",
            "directors",
            "cbn",
            "announced",
            "removal",
            "group",
            "shobo",
            "executive",
            "nigeria",
            "board",
            "bank",
            "fbn",
            "firstbank",
            "limited",
            "sacks"
          ]
        },
        {
          "title": "EXCLUSIVE: CBN asks First Bank to call in Otudeko’s Honeywell Flour Mills loan facility within 48 hours",
          "summary": "The Central Bank of Nigeria has directed the Oba Otudeko owned Honeywell Flour Mills to repay a loan to First Bank within 48 hours, according to a memo seen by TechCabal.\nBut the CBN is alleging that First Bank gave special treatment to Honeywell Flour Mills in restructuring its loan facility.\nOne big regulatory concern was Honeywell Flour Mill’s collateral for the loan facility.\nThis order to divest from the apex bank has its roots in yet another bank loan involving Ecobank, Oba Otudeko and some Airtel shares used as a collateral.\nAccording to news reports, Otudeko’s Airtel shares were used as collateral for Honeywell’s Ecobank loan.",
          "link": "https://techcabal.com/2021/04/29/cbn-first-bank-otudeko/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "mills",
            "facility",
            "exclusive",
            "airtel",
            "honeywell",
            "otudeko",
            "shares",
            "flour",
            "nigeria",
            "loan",
            "bank",
            "otudekos",
            "hours",
            "cbn"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "FG trains 30 coconut farmers on nursery, processing in Edo – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Ministry of Agriculture and Rural Development says it has trained 30 coconut farmers on nursery establishment, field development, harvesting, processing and marketing in Edo.\nHe spoke at the opening of capacity building workshop for coconut farmers in collaboration with the Nigeria Institute for Oil Palm Research (NIFOR).\nHe said that the capacity building workshop was coming at a very crucial moment when the country was recovering from a difficult spell of the COVID-19 pandemic.\nThe Acting Executive Director of NIFOR, Dr. Celestine Ikuenobe, said that coconut production offered great opportunities for export earnings.\nEarlier, Mrs Okoroji Okechukwu, the National President, National Coconut Producers, Processors and Marketers Association of Nigeria, commended the sponsors of the workshop, saying that it would transform the agricultural sector.",
          "link": "http://nigerianobservernews.com/2021/04/fg-trains-30-coconut-farmers-on-nursery-processing-in-edo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "processing",
            "president",
            "national",
            "nifor",
            "workshop",
            "capacity",
            "30",
            "trains",
            "coconut",
            "observer",
            "nursery",
            "farmers",
            "nigeria",
            "nigerian",
            "federal",
            "ministry",
            "fg",
            "edo",
            "building"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "underaged",
            "immediate",
            "jan",
            "web",
            "prohibited",
            "nightgrazing",
            "movement",
            "cattle",
            "outlawed",
            "19",
            "highways",
            "wish",
            "register"
          ]
        },
        {
          "title": "Buhari expresses disappointment over Ortom’s attack, says he’s not to blame for insecurity",
          "summary": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has expressed disappointment over what he described as attack on him by Benue State Governor, Samuel Ortom.\nOrtom had on several occasions, blamed the president for failing to bring Fulani herdsmen attacking communities in the state to book.\nHe said the herders were displacing communities in the state, while wondering why the Buhari administration has not acted to put an end to the violence.\n” The future of Benue State and indeed that of the entire country lies in harmony and the respect for law, order, and the constitution.\nA government voted into office by the people, should treat the people as its masters and not as its servants.”",
          "link": "https://hallmarknews.com/buhari-expresses-disappointment-over-ortoms-attack-says-hes-not-to-blame-for-insecurity/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "ortoms",
            "country",
            "blame",
            "benue",
            "attack",
            "president",
            "disappointment",
            "citizens",
            "buhari",
            "progress",
            "governor",
            "statement",
            "parts",
            "insecurity",
            "state",
            "hes",
            "expresses"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "JUST-IN: Boko Haram Attacks Yobe Town, Residents Flee To Niger Republic",
          "summary": "Kanamma, which is situated along the border with Niger Republic is the maintown of Yunusari local government and was the destination for some of the residents, who fled ISWAP siege on Gaidam town.\nOur correspondent leant that the attack this Thursday evening at about 5:30pm, forced many people indoor as others fled to other areas including neighbouring Niger Republic for safety.\n“The insurgents’ interest in having Kanamma is because the town shares a border with Niger Republic,” he added.\n“Let me tell you that there was a Boko Haram attack on Kanamma.\nWhile the military has intensified its efforts in fighting Boko Haram, but the insurgents have continue to carry out daring attacks on some Yobe towns of recent.",
          "link": "https://leadership.ng/just-in-boko-haram-attacks-yobe-town-residents-flee-to-niger-republic/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "kanamma",
            "haram",
            "area",
            "justin",
            "residents",
            "niger",
            "yunusari",
            "town",
            "local",
            "republic",
            "yobe",
            "mohammed",
            "boko",
            "flee",
            "attacks",
            "attack"
          ]
        },
        {
          "title": "FOREIGN: China Continues To Increase Internet Speed, Quality",
          "summary": "The proportion of fiber optic Internet users in all users of fixed broadband in China has risen from 56 percent at the end of 2015 to 94 percent.\nIn terms of mobile network, China’s 4G base stations constitute over half of the world’s total.\nIn addition, China has managed to cover all prefecture-level cities with 5G standalone (SA) network and made initial achievements in building the world’s largest 5G mobile network.\nThe average monthly Internet traffic of mobile Internet users has jumped more than 40 times to 10.85 GB from 205 MB in early 2015.\nADVERTISEMENTChina has also evidently narrowed the digital gap between the rural and urban areas by quickening the pace to tackle the weak links in rural network infrastructure.",
          "link": "https://leadership.ng/foreign-china-continues-to-increase-internet-speed-quality/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "internet",
            "5g",
            "china",
            "speed",
            "continues",
            "rural",
            "broadband",
            "rates",
            "foreign",
            "mobile",
            "increase",
            "quality",
            "users",
            "network",
            "services"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Resident Doctor’s Strike: Gbajabiamila meets govt officials, avert resumption of strike",
          "summary": "By Tom OkpeSpeaker of the House of Representatives, Femi Gbajabiamila, on Thursday, met with the relevant government officials with a view to averting the resumption of the strike by the National Association of Resident Doctors (NARD).\nAt the meeting, issues such as non-payment of house officers, abolishment of bench fees, non-payment of national minimum wage, salary shortfall for 2014, 2015, and 2016, residency training allowance, and payment of resident Doctors on GIFMIS platform were discussed.\nThe resident Doctors had earlier this month embarked on an indefinite strike, making some demands and insisting that they must be met before they would call off the strike.\nHowever, with the intervention of Speaker Gbajabiamila and other top government officials, the Doctors suspended the strike and said if the issues were not resolved, they would resume on May 7.\nRecall that since the assumption of office, Gbajabiamila has been on the issue of the resident Doctors, who had threatened to embark on strike at different times.",
          "link": "https://dailytimes.ng/resident-doctors-strike-gbajabiamila-meets-govt-officials-avert-resumption-of-strike/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "meeting",
            "doctors",
            "issues",
            "resumption",
            "govt",
            "secretary",
            "avert",
            "meets",
            "gbajabiamila",
            "officials",
            "speaker",
            "strike",
            "taken",
            "resident"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Ortom only sees the problems of others, he doesn’t see his own – Presidency",
          "summary": "By GARBA SHEHUThe President expresses his condolences to the families of our dear citizens who lost their loved ones in the recent spate of killings in Benue State.\nHe also states his disappointment and sadness to hear Samuel Ortom, the Governor of Benue State make a litany of accusations against his person and his government of following the recent unfortunate incidents in the state.\nPresident Buhari took an oath to defend the life and property of every citizen, a duty he takes seriously and is committed to ensuring.\nThe future of Benue State and indeed that of the entire country lies in harmony and the respect for law, order, and the constitution.\nA government voted into office by the people, should treat the people as its masters and not as its servants.",
          "link": "https://daylightng.com/ortom-only-sees-the-problems-of-others-he-doesnt-see-his-own-presidency/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "states",
            "country",
            "problems",
            "benue",
            "law",
            "presidency",
            "president",
            "citizens",
            "doesnt",
            "progress",
            "sees",
            "parts",
            "state",
            "ortom"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "road",
            "roads",
            "worsening",
            "callup",
            "npa",
            "electronic",
            "apapa",
            "truck",
            "system",
            "amidst",
            "gridlock",
            "trucks",
            "ecall",
            "drivers"
          ]
        },
        {
          "title": "3 Ways Sub-Saharan Africa Can Foster Growth In Her Regions",
          "summary": "Aggregation of DataData equals knowledge which is why countries in sub-Sahara Africa need to take aggregation of data very seriously.\nWith accurate data, sub-Sahara Africa can understand prevalent issues, how to tackle them and compare their progress with other countries of the world.\nPeople InclusivenessIf sub-Saharan Africa wants to solve her problems, she needs to include her people in the process (they know where the shoe pinches).\nGrowth and development is attainable at a rapid pace in sub-Sahara Africa.\nWe might not be advancing at the speed required to achieve the 2030 SGDs but sub-Saharan Africa will not be left behind, let’s take action now!",
          "link": "https://bizwatchnigeria.ng/3-ways-sub-saharan-africa-can-foster-growth-in-her-regions/",
          "published": "04/27/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "ways",
            "countries",
            "problems",
            "development",
            "subsahara",
            "foster",
            "data",
            "growth",
            "regions",
            "subsaharan",
            "africa",
            "achieve",
            "need",
            "world"
          ]
        }
      ]
    }
  }
}