{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "President Buhari re-appoints Heads of NCAC, NTDC, NFVCB",
          "summary": "Kindly Share This Story:By Ayo OnikoyiPresident Muhammadu Buhari has approved the re-appointment of the following Chief Executive Officers for another term of four years.\nThey are Otunba Segun Runsewe, Director-General, National Council for Arts and Culture (NCAC), Mr Folorunso Coker, Director-General, Nigeria Tourism Development Corporation (NTDC) and Alhaji Adedayo Thomas, Executive Director National Film and Video Censors Board (NFVCB).\nREAD ALSO:The President also approved the appointment of Alhaji Ahmed Mohammed Ahmed as the Chief Executive Officer /Artistic Director of the National Troupe of Nigeria.\nAlhaji Ahmed was until his appointment, Director of Culture in the Ministry of Culture and Tourism, Bauchi State.\nVanguard News NigeriaKindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/04/president-buhari-re-appoints-heads-of-ncac-ntdc-nfvcb/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "approved",
            "ncac",
            "director",
            "culture",
            "share",
            "national",
            "buhari",
            "reappoints",
            "heads",
            "ahmed",
            "tourism",
            "chief",
            "executive",
            "president",
            "ntdc",
            "nfvcb",
            "directorgeneral"
          ]
        },
        {
          "title": "IPOB: South East Govs willing tools to imperial powers",
          "summary": "Kindly Share This Story:By Johnbosco AgbakwuruThe South-East governors have been accused of being willing tools to powerful elements outside the zone which have made them work against the collective interest of their people.\nRetired Col. Tony Nyiam made the allegation when he appeared on the African Independent Television, AIT, programme in Abuja.\nHe also condemned the approach of the Federal Government in handling the security situation in the South East, adding that the approach would intensify the problem instead of minimizing it.\nHe said, “First of all, Governor Hope Uzodinma is a long time friend.\nThe Governors of the Southeast are losing ground because they are willing tools of the Imperial power.",
          "link": "https://www.vanguardngr.com/2021/04/ipob-south-east-govs-willing-tools-to-imperial-powers-col-nyiam/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "powers",
            "southeast",
            "east",
            "governors",
            "willing",
            "imperial",
            "approach",
            "president",
            "south",
            "ipob",
            "tools",
            "situation",
            "governor",
            "govs"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Minimum wage: Buhari approves payment of upward adjustment to pensioners",
          "summary": "President Muhammadu Buhari has approved the payment of the consequential adjustment to pensioners.\nBuhari’s approval of the Defined Benefit Scheme (DBS) is in line with the minimum wage approved in 2019.\nChioma Ejikeme, the Executive Secretary, Pension Transitional Arrangement Directorate (PTAD), confirmed the development to reporters in Abuja.\nEjikeme said PTAD was now empowered to start the upward adjustment of all pensioners’ benefits according to the approved template.\nThe payment would start from May 2021 and the arrears would cover the period of the implementation of the minimum wage.",
          "link": "https://dailypost.ng/2021/04/30/minimum-wage-buhari-approves-payment-of-upward-adjustment-to-pensioners/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "payment",
            "approves",
            "wage",
            "buhari",
            "benefit",
            "arrears",
            "ptad",
            "2021",
            "pensioners",
            "minimum",
            "start",
            "upward",
            "approved",
            "adjustment"
          ]
        },
        {
          "title": "BREAKING: US to prioritise student visa applications for Nigerians",
          "summary": "The United States Mission in Nigeria has said it will prioritise visa applications for students who hope to resume academic studies in the states by September 2021.\nThe statement said the Mission said it would prioritise visa interview appointments for Nigerian students in advance of their programme start date.\n“We will increase the number of student visa appointments in May and June to ensure that we can offer appointments to as many students as possible.\n“All student visa appointments must be booked through the US Travel Docs website.\n“However, applicants are warned against the use of third-party services, including touts, and fixers who broker visa appointments,” the statement said.",
          "link": "https://dailypost.ng/2021/04/30/breaking-us-to-prioritise-student-visa-applications-for-nigerians/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "breaking",
            "mission",
            "tuller",
            "states",
            "statement",
            "student",
            "prioritise",
            "studies",
            "appointments",
            "students",
            "visa",
            "nigerians",
            "applications"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Big Brother Naija opens auditions for season 6",
          "summary": "By Ekaete BasseyOrganisers of popular reality television show, Big Brother Naija, have announced commencement of open auditions ahead of the sixth season.\nInterested participants are expected to record a two-minute video, stating why they should be picked to be a housemate in season 6 of BBNaija.\nADVERTISEMENTParticipants of the initially announced early auditions have been advised not to participate in the new auditions.\nThe Nation had reported the return of Big Brother Naija for its sixth edition in 2021 in March.\nIt was also reported Multichoice Nigeria announced a grand prize of N90 million, which is the highest for a reality TV show on the continent.",
          "link": "https://thenationonlineng.net/big-brother-naija-opens-auditions-for-season-6/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "big",
            "auditions",
            "reported",
            "video",
            "season",
            "announced",
            "sixth",
            "reality",
            "opens",
            "naija",
            "virtual",
            "brother"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Breaking: First aircraft lands in Anambra Int’l Cargo Airport",
          "summary": "From Obinna Odogwu, Awka and Aloysius Attah, OnitshaFirst aircraft have landed on the Anambra International Cargo and Passenger Airport in Umueri community, Anambra East Local Government Area of the state.\nThe aircraft are are owned by Air Peace.\nThe first one marked 5N-BUJ landed at exactly 2:25pm while the second one landed at about 2:45pm.\nThat was the inaugural flight on the new airport.\nFull details later…",
          "link": "https://www.sunnewsonline.com/breaking-first-aircraft-lands-in-anambra-intl-cargo-airport/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "intl",
            "cargo",
            "breaking",
            "anambra",
            "second",
            "airport",
            "umueri",
            "landed",
            "onitshafirst",
            "lands",
            "owned",
            "state",
            "peacethe",
            "passenger",
            "aircraft"
          ]
        },
        {
          "title": "First Bank reiterates commitment towards providing reliable services",
          "summary": "By Chinwendu ObienyiFirst Bank Plc has reassured depositors, creditors and other stakeholders that it will continue to deliver reliable services and ensure stability in the financial system.\nThis is coming after the Central Bank of Nigeria (CBN) sacked the entire board of directors of FBN Holdings Plc and its subsidiary First Bank of Nigeria Ltd.First Bank had on Wednesday, announced that it had appointed Gbenga Shobo as its Managing Director/Chief Executive Officer (CEO).\nThe Governor, CBN, Godwin Emefiele, cited insider abuse, insider credit and breakdown of corporate governance as the reason behind the sacking of the board of FBN Holdings, Nigeria’s largest bank.\nThe CBN governor further announced the reinstatement of Dr Sola Adeduntan as the Managing Director of the interim Board after he was removed by the now sacked board of First Bank Plc.\n“The Board of Directors of First Bank of Nigeria Limited is now comprised as follows:1.",
          "link": "https://www.sunnewsonline.com/first-bank-reiterates-commitment-towards-providing-reliable-services/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "commitment",
            "services",
            "dr",
            "nigeria",
            "reliable",
            "bank",
            "mr",
            "board",
            "cbn",
            "executive",
            "reiterates",
            "managing",
            "governor",
            "providing",
            "stakeholders"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "News in Photographs: Buhari Chairs Security Meeting",
          "summary": "By Deji ElumoyePresident Muhammadu Buhari is currently presiding over a meeting of National Security Council (NSC) at the Presidential Villa, Abuja.\nThe meeting is coming in the wake of escalating security challenges in different parts of the country and general outcry by various stakeholders with many calling for an urgent action from the President.\nThose attending the meeting include Vice President Yemi Osinbajo, the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha; the Chief of Staff to the President, Prof Ibrahim Gambari; and the National Security Adviser (NSA), Major-General Babagana Monguno (rtd).\nOthers are Chief of Defence Staff (CDS), General Lucky Irabor; Chief of Army Staff, Lieutenant-General Ibrahim Attahiru; Chief of Naval Staff, Vice Admiral Awwal Zubairu; Chief of Air Staff and Chief of Air Staff, Air Marshal Ishiaka Oladayo Amoo.\nThe Acting Inspector-General of Police (IGP), Usman Alkali Baba, is also attending the meeting.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/news-in-photographs-buhari-chairs-security-meeting/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "national",
            "photographs",
            "air",
            "buhari",
            "ibrahim",
            "security",
            "general",
            "chief",
            "chairs",
            "meeting",
            "president",
            "staff",
            "vice"
          ]
        },
        {
          "title": "Military, Police Ring Abuja to Forestall Boko Haram Attack",
          "summary": "However, the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, yesterday restated the Nigerian Army’s determination to annihilate Boko Haram.\nThe security of the nation’s airports was also in focus yesterday as the Office of the National Security Adviser (ONSA) said there was no threat to them.\nAddressing members of the National Executive Committee (NEC) in Abuja, Secondus said: “We are worried Abuja is not even safe.\nArmy Chief Vows to Wipe Out Boko HaramThe army yesterday reiterated its commitment to wipe out Boko Haram.\n“We will take on Boko Haram decisively, and we are committed to the focus of the operations, which is the total annihilation of Boko Haram from Nigeria,” he said.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/military-police-ring-abuja-to-forestall-boko-haram-attack/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "boko",
            "federal",
            "declaration",
            "national",
            "attack",
            "emergency",
            "security",
            "ring",
            "military",
            "forestall",
            "yesterday",
            "abuja",
            "state",
            "staff",
            "haram"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Two Borno Communities",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād are currently attacking Gwoza and Wulgo towns ‪in Borno‬ state.\nThe latest attack is coming barely 24 hours after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents.",
          "link": "http://saharareporters.com/2021/04/26/breaking-boko-haram-currently-attacking-two-borno-communities",
          "published": "04/26/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "currently",
            "boko",
            "soldiers",
            "breaking",
            "area",
            "communities",
            "gathered",
            "borno",
            "military",
            "killed",
            "islamic",
            "attacking",
            "haram",
            "state",
            "insurgents"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Two Borno Communities",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād are currently attacking Gwoza and Wulgo towns ‪in Borno‬ state.\nThe latest attack is coming barely 24 hours after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents.",
          "link": "http://saharareporters.com/2021/04/26/breaking-boko-haram-currently-attacking-two-borno-communities#disqus_thread",
          "published": "04/26/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "currently",
            "boko",
            "soldiers",
            "breaking",
            "area",
            "communities",
            "gathered",
            "borno",
            "military",
            "killed",
            "islamic",
            "attacking",
            "haram",
            "state",
            "insurgents"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Enyimba to face FC Pyramid in CAFCC quarter-final",
          "summary": "Enyimba will square up against FC Pyramid in the 2020/21 CAF Confederation Cup quarter-final.\nEnyimba finished top of Group A but had to wait until the last day to secure passage into the knock out phase.\nAdvertisementThe two-time CAF Champions League winners qualified following a nervy 1-0 win against South Africa’s Orlando Pirates at the Aba Stadium on Wednesday.\nEnyimba will take on the winner between Raja Casablanca of Morocco and Orlando Pirates — if they overcome FC Pyramid.\nAdvertisementCAF CC quarter-final pairingsCS Sfaxien Vs JS KabyleOrlando Pirates vs Raja CasablancaASC Jaaraf Vs Cotton SportEnyimba vs FC Pyramid",
          "link": "https://www.thecable.ng/enyimba-to-face-egypts-fc-pyramid-in-caf-confederation-quarter-final",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "vs",
            "fc",
            "aba",
            "leg",
            "caf",
            "face",
            "cairo",
            "cafcc",
            "pyramid",
            "enyimba",
            "orlando",
            "pirates",
            "raja",
            "quarterfinal"
          ]
        },
        {
          "title": "family of Lagos amputee hawker breaks silence",
          "summary": "Mary Daniel, the now-viral Lagos amputee hawker, whose story has continued to fetch her massive goodwill from Nigerians, lied to evoke sympathy, TheCable can exclusively report.\nBlessing Adedamola, her aunt, told TheCable that Mary’s claim that she has no family to cater for her was a lie.\n“Then she told mama that it was the same guy that she came home with earlier.\nMama told her that she’s a grandmother, that if she really wants to marry, she should take the boy to her paternal family.\nShe explained that she had thereafter confronted her to stop destroying the family’s reputation with her lies and vowed to let Nigerians know the truth.",
          "link": "https://lifestyle.thecable.ng/exclusive-shes-lying-embarrassing-us-family-of-lagos-amputee-hawker-breaks-silence/#new_tab",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "amputee",
            "mary",
            "thecable",
            "ojonuwa",
            "mama",
            "know",
            "lagos",
            "marys",
            "shes",
            "told",
            "nigerians",
            "silence",
            "family",
            "hawker",
            "breaks"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "sanusi",
            "banks",
            "tradition",
            "took",
            "enforces",
            "board",
            "bruised",
            "cbn",
            "skye",
            "emefiele",
            "otudeko",
            "sacking",
            "governor",
            "bank"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "value",
            "nigeria",
            "partnerships",
            "market",
            "fintech",
            "companies",
            "size",
            "expansion",
            "startups",
            "company",
            "country",
            "aggressive",
            "expand",
            "business"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "FG trains 30 coconut farmers on nursery, processing in Edo – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Ministry of Agriculture and Rural Development says it has trained 30 coconut farmers on nursery establishment, field development, harvesting, processing and marketing in Edo.\nHe spoke at the opening of capacity building workshop for coconut farmers in collaboration with the Nigeria Institute for Oil Palm Research (NIFOR).\nHe said that the capacity building workshop was coming at a very crucial moment when the country was recovering from a difficult spell of the COVID-19 pandemic.\nThe Acting Executive Director of NIFOR, Dr. Celestine Ikuenobe, said that coconut production offered great opportunities for export earnings.\nEarlier, Mrs Okoroji Okechukwu, the National President, National Coconut Producers, Processors and Marketers Association of Nigeria, commended the sponsors of the workshop, saying that it would transform the agricultural sector.",
          "link": "http://nigerianobservernews.com/2021/04/fg-trains-30-coconut-farmers-on-nursery-processing-in-edo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "federal",
            "national",
            "nursery",
            "coconut",
            "president",
            "nigeria",
            "fg",
            "30",
            "trains",
            "workshop",
            "nifor",
            "capacity",
            "farmers",
            "ministry",
            "processing",
            "edo",
            "nigerian",
            "building",
            "observer"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "outlawed",
            "movement",
            "wish",
            "19",
            "highways",
            "underaged",
            "immediate",
            "prohibited",
            "register",
            "cattle",
            "web",
            "jan",
            "nightgrazing"
          ]
        },
        {
          "title": "United States to prioritise student visa applications by Nigerians",
          "summary": "The United States Mission in Nigeria has said it will prioritise visa applications by Nigerians students who hope to resume academic studies in the States by September 2021.\nThe statement titled, ‘US Announces Priority Appointments for Student Visa Applicants,’ said the mission would prioritise visa interview appointments for Nigerian students in advance of their programme start date.\n“We will increase the number of student visa appointments in May and June to ensure that we can offer appointments to as many students as possible.\n“Both Nigeria and the United States benefit when Nigerian students study at one of our world-class educational institutions.\nIn academic year 2019-2020, a record-breaking number of nearly 14,000 Nigerians pursued graduate and undergraduate degrees in the United States.",
          "link": "https://hallmarknews.com/united-states-to-prioritise-student-visa-applications-by-nigerians/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nigeria",
            "mission",
            "states",
            "statement",
            "student",
            "prioritise",
            "appointments",
            "students",
            "united",
            "visa",
            "applicants",
            "nigerians",
            "applications"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": []
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Minimum wage: PTAD gets presidential approval to implement pension...",
          "summary": "PHILIP CLEMENT, ABUJAThere is succor at last for Nigerian pensioners as the Pension Transitional Arrangement Directorate (PTAD) has announced the presidential approval for consequential adjustments for pension benefits in line with the new minimum wage.\nDr. Ejikeme states that, “the Presidential approval for the implementation of the consequential adjustment to the pension benefits occasioned by the new minimum wage of 2019 has been granted and the circular released.”She said, “With this approval, PTAD is now empowered to start the upward adjustment of all pensioners’ benefits according to the approved template.\n“The consequential adjustment of the new pension payment will start from the May 2021 payroll.\nThe PTDA boss recalled that on the 22nd of April, 2021, she issued a Press Release to inform the general public of the sincerity of President Buhari to implement the consequential adjustment on the pension benefits.\nThey should report any scammer or anyone requesting for gratification before their benefits would be paid to PTAD.",
          "link": "https://dailytimes.ng/minimum-wage-ptad-gets-presidential-approval-to-implement-pension-benefits/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "pension",
            "payment",
            "presidential",
            "wage",
            "approval",
            "2021",
            "ptad",
            "implement",
            "gets",
            "minimum",
            "pensioners",
            "benefits",
            "adjustment",
            "continue",
            "consequential",
            "ejikeme"
          ]
        },
        {
          "title": "Revenue projection not a reflection of our overall financial standing,,,",
          "summary": "Doosuur Iwambe,AbujaThe Nigerian National Petroleum Corporation (NNPC) has clarified that the revenue projection contained in the letter to the Accountant General of the Federation is not a reflection of the overall financial performance of the Corporation.\nA press release by the Corporation’s spokesman, Dr. Kennie Obateru noted that the Projection cited in the media pertains only to the federation revenue stream being managed by the Corporation.\nKyari stated that the clarification became necessary in the light of media reports insinuating that the Corporation was in financial straits.\n“The shortfall will be remedied by the Corporation as it relates only to the Federation revenue stream being managed by the NNPC and does not reflect the overall financial performance of the Corporation.\nNNPC, however, assures that it would continue to meet its financial obligations to the Federation.",
          "link": "https://dailytimes.ng/revenue-projection-not-a-reflection-of-our-overall-financial-standing-nnpc-clarifies/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "corporation",
            "petroleum",
            "standing",
            "stream",
            "overall",
            "reflection",
            "projected",
            "projection",
            "revenue",
            "reports",
            "nnpc",
            "federation",
            "financial"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Woman collapses in Christ Apostolic Church while fasting, dies in hospital",
          "summary": "The family of a woman, Joy Owoyele, is in grief after she died during a 14-day fasting in the Isheri Olofin area of Lagos State.\nPUNCH Metro gathered that Owoyele had sought spiritual help regarding her matrimonial challenges at the Christ Apostolic Church, Ori-Oke Gbogunmi, aka Ajanpelenbe Mountain, located on Pipeline Road, Isheri Olofin.\n“Her daughter, Oluwatise, was also with her in the church during the spiritual exercise and they always slept together.\n“Around 7am on the day of the incident, Owoyele fainted and was rushed to the Igando General Hospital, where she was pronounced dead.\n“Detectives led by Inspector Bridget Edosa visited the scene, inspected the corpse and deposited it in the Yaba General Hospital morgue for autopsy.",
          "link": "https://daylightng.com/woman-collapses-in-christ-apostolic-church-while-fasting-dies-in-hospital/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "incident",
            "apostolic",
            "fasting",
            "collapses",
            "hospital",
            "woman",
            "owoyele",
            "spiritual",
            "dies",
            "church",
            "general",
            "day",
            "investigation",
            "family",
            "christ"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "callup",
            "trucks",
            "ecall",
            "system",
            "worsening",
            "gridlock",
            "npa",
            "apapa",
            "roads",
            "drivers",
            "electronic",
            "amidst",
            "road",
            "truck"
          ]
        },
        {
          "title": "3 Ways Sub-Saharan Africa Can Foster Growth In Her Regions",
          "summary": "Aggregation of DataData equals knowledge which is why countries in sub-Sahara Africa need to take aggregation of data very seriously.\nWith accurate data, sub-Sahara Africa can understand prevalent issues, how to tackle them and compare their progress with other countries of the world.\nPeople InclusivenessIf sub-Saharan Africa wants to solve her problems, she needs to include her people in the process (they know where the shoe pinches).\nGrowth and development is attainable at a rapid pace in sub-Sahara Africa.\nWe might not be advancing at the speed required to achieve the 2030 SGDs but sub-Saharan Africa will not be left behind, let’s take action now!",
          "link": "https://bizwatchnigeria.ng/3-ways-sub-saharan-africa-can-foster-growth-in-her-regions/",
          "published": "04/27/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "regions",
            "data",
            "africa",
            "ways",
            "problems",
            "growth",
            "countries",
            "subsahara",
            "need",
            "world",
            "subsaharan",
            "achieve",
            "foster",
            "development"
          ]
        }
      ]
    }
  }
}