{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "FRSC Sector Commander seeks stakeholders’ support on Apapa gridlock",
          "summary": "Kindly Share This Story:The Lagos Sector Commander of the Federal Road Safety Corps (FRSC), Corps Commander, Olusegun Ogungbemide, has called for the continuous support of stakeholders in the transport sector to stop the perennial Apapa gridlock.\nHe said if all transport stakeholders collaborated with government officials, the traffic gridlock would be a thing of the past.\n“The problem of Apapa is beyond traffic management, we have economic boom but no boom for individuals in terms of infrastructure.\nHe said it was discovered recently that trucks carrying export goods were in large numbers on Apapa road.\n“Lagos State is very dynamic and I have determined to change Lagos traffic positively.",
          "link": "https://www.vanguardngr.com/2021/04/frsc-sector-commander-seeks-stakeholders-support-on-apapa-gridlock/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "seeks",
            "frsc",
            "support",
            "sector",
            "gridlock",
            "stakeholders",
            "road",
            "traffic",
            "tcan",
            "apapa",
            "corps",
            "transport",
            "lagos",
            "management",
            "commander"
          ]
        },
        {
          "title": "Diaspora group tasks FG on transparency, evaluation of Chinese loans",
          "summary": "However, details of the loans are shrouded in secrecy and the demands of Nigeria’s Fiscal Responsibility Act, (FRA) for concessional loans have not been transparently met.\nThe risks associated with the Chinese loans constitute clear, present and future danger despite the relatively small proportion of the loans to Nigeria’s overall debt”.\nThe loans minimally translate to Nigeria’s benefit as the control of all related activities is not in the hands of Nigerians.\nThese are examples of direct foreign “investments” that negatively contribute to the Gross Domestic product as the valuable economic resources are promptly evacuated from Nigeria by foreigners.\nTURN would like to see concrete actions and a government white paper issued to address the concerns outlined above”.",
          "link": "https://www.vanguardngr.com/2021/04/diaspora-group-tasks-fg-on-transparency-evaluation-of-chinese-loans/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "socioeconomic",
            "transparency",
            "nigerias",
            "china",
            "loans",
            "conditions",
            "evaluation",
            "group",
            "nigeria",
            "fg",
            "diaspora",
            "owed",
            "terms",
            "turn",
            "chinese",
            "tasks"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Boko Haram terrorists attack Kanamma in Yobe",
          "summary": "“He (Governor Mohammed) is always in contact with security agencies, giving them all the help they need.\nIf you remember, about three days ago, the governor gave about 50 vehicles to security agencies to enhance the security situation in the State.\nHe, however, said despite this, his administration could not afford to compromise the security of lives and property of the people of the state.\n“Our population has risen from the official record of 6.5 million to about 10 million in Bauchi, thereby, overstretching our services and infrastructures.\nThere is high expectation from the polity, thereby overstretching our security agencies,” he said.",
          "link": "https://dailypost.ng/2021/04/30/boko-haram-terrorists-attack-kanamma-in-yobe/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "agencies",
            "attack",
            "terrorists",
            "bandits",
            "states",
            "haram",
            "despite",
            "peaceful",
            "bauchi",
            "boko",
            "kanamma",
            "peace",
            "northeast",
            "security",
            "state",
            "yobe"
          ]
        },
        {
          "title": "Insecurity: Fear in Bauchi over influx of people from neighbouring states, possible attack",
          "summary": "“He (Governor Mohammed) is always in contact with security agencies, giving them all the help they need.\nIf you remember, about three days ago, the governor gave about 50 vehicles to security agencies to enhance the security situation in the State.\nWe have to supply useful information to security agencies for them to take prompt and timely actions to prevent security breach.””As a result of its peaceful nature, there have been the influx of people from the North-West and neighbouring North-East states into Bauchi State.\nThis is with its attendant negative impact on the State with Governor Mohammed recently lamenting that the influx of people from neighbouring states into the state from states has overstretched the state’s infrastructures.\nThere is high expectation from the polity, thereby overstretching our security agencies,” he said.",
          "link": "https://dailypost.ng/2021/04/30/insecurity-fear-in-bauchi-over-influx-of-people-from-neighbouring-states-possible-attack/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "influx",
            "attack",
            "agencies",
            "bandits",
            "states",
            "despite",
            "bauchi",
            "possible",
            "peace",
            "northeast",
            "security",
            "neighbouring",
            "state",
            "peaceful",
            "insecurity",
            "fear"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "BREAKING: CBN sacks First Bank directors",
          "summary": "The Central Bank of Nigeria (CBN) has sacked all the board members of First Bank Nigeria Ltd and First Bank of Nigeria Holdings Plc.\nThe apex bank had queried the Board of the bank for removing Adesola Adeduntan as the Managing Director/Chief Executive Officer and appointing Gbenga Shobo as MD/CEO designate without regulatory approval.\nThe CBN also faulted appointment of Abdullahi Ibrahim as Deputy Managing Director as well as the appointment of Ini Ebong, Segun Alebiosu, Seyi Oyefeso and Bashirat Odunewu, as executive directors.\nBut at a briefing on Friday, CBN Governor, Godwin Emefiele, announced the sacking of all members of the board of the bank for the supposed affront.\nEmefiele also reinstated Adeduntan as the MD/CEO of the bank.",
          "link": "http://community.thenationonlineng.net/forum/breaking-cbn-sacks-first-bank-directors",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "managing",
            "sacks",
            "members",
            "mdceo",
            "directors",
            "nigeria",
            "bank",
            "cbn",
            "adeduntan",
            "appointment",
            "executive",
            "breaking",
            "board"
          ]
        },
        {
          "title": "VIDEO: Buhari should resign, God is angry with him – Mbaka",
          "summary": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator.",
          "link": "http://community.thenationonlineng.net/forum/video-buhari-should-resign-god-is-angry-with-him-mbaka",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nation",
            "javascript",
            "mbaka",
            "communityplease",
            "enable",
            "newspaper",
            "contact",
            "system",
            "angry",
            "settings",
            "resign",
            "need",
            "buhari",
            "video",
            "god",
            "hello"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "CAF Confederation Cup quarter-finals: Kalu congratulates Enyimba",
          "summary": "Pillar of Sports in Africa and Chief Whip of the Senate, Dr. Orji Uzoh Kalu has congratulated Nigerians on the victory of Enyimba Football Club (FC) of Nigeria against Orlando Pirates of South Africa in the final Group A match in the Confederation of Africa Football (CAF) tournament.\nKalu commended the players and officials of the football club for their skills and determination.\nRecall, during Kalu’s stint as Governor of Abia State, Enyimba International FC was repositioned, with the team clinching the CAF Champions League Cup back to back in 2003 and 2004.\nThe Senate Chief Whip, who is also a soccer enthusiast stressed that football brings people together and ultimately promotes peace and unity.\nHe said, “I felicitate with Enyimba FC on their well-deserved victory against Orlando Pirates in the CAF tournament.",
          "link": "https://www.sunnewsonline.com/caf-confederation-cup-quarter-finals-kalu-congratulates-enyimba/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "cup",
            "football",
            "africa",
            "congratulates",
            "confederation",
            "players",
            "kalu",
            "team",
            "whip",
            "quarterfinals",
            "fc",
            "senate",
            "victory",
            "caf",
            "enyimba"
          ]
        },
        {
          "title": "Noise pollution: Why we can’t secure conviction of religious bodies –Lagos",
          "summary": "By Lukman OlabiyiLagos State Government, yesterday, gave reason it has not yet secured any conviction from noise pollution by religious organisations in the state.\nCommissioner for Environment and Water Resources, Mr. Tunji Bello, said anything bordering on religion is always a sensitive issue and care has to be taken, in order not to create a bigger problem as solution to a minor issue that can be amicably resolved between parties.\nHe said not that no religious organisation had been cut in the act of noise pollution in various communities across the state, but instead of prosecuting organisations for violating the law, the government would rather issue warning, dialogue with the culprits and, if there no changes, sanction would be the last option.\nBello, in giving account of Sanwo-Olu’s led administration scorecard in the area of environment and water resources, emphasised that Lagos State has moved from the notoriety of a flood ravaged coastal city to one with cleaned, dredged and free flowing drainage channels all year round.",
          "link": "https://www.sunnewsonline.com/noise-pollution-why-we-cant-secure-conviction-of-religious-bodies-lagos/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "pollution",
            "water",
            "yesterday",
            "bodies",
            "noise",
            "religious",
            "environment",
            "lagos",
            "conviction",
            "resources",
            "secure",
            "issue",
            "state",
            "organisations",
            "cant"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "First Bank: CBN Reinstates Adeduntan, Sacks Otudeko, Bank’s Boards",
          "summary": "He said the central bank took the actions in order to preserve the stability of the bank and protect minority shareholders and depositors.\nThe CBN had on Wednesday queried the erstwhile board of First Bank Nigeria Limited over the removal of Adeduntan, saying the action was without regulatory approval.\nHowever, the CBN, to douse tension generated by the boardroom crisis in the bank, assured depositors, creditors and other stakeholders of its commitment to safeguard the bank.\nAccording to him, the CBN will insist on proper re-capitalisation of the bank to restore its capital adequacy ratio.\nWith this, he said the CBN stepped in to stabilise the bank in its quest to maintain financial stability, especially given First Bank’s systemic importance.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/first-bank-cbn-reinstates-adeduntan-sacks-otudeko-banks-boards/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "shareholders",
            "otudeko",
            "boards",
            "managing",
            "sacks",
            "reinstates",
            "regulatory",
            "financial",
            "directors",
            "fbn",
            "banks",
            "bank",
            "cbn",
            "adeduntan",
            "insider",
            "board"
          ]
        },
        {
          "title": "Jonathan Pushes for LG Reform, Autonomy",
          "summary": "Onungwe Obe in YenagoaFormer President Goodluck Jonathan has called for the reform and autonomy of local government areas, as they would only be able to generate revenues if independent.\nHe said any bill targeted at delisting LGAs from the constitution was an abuse of democratic tenets and procedures.\nAnd whatever restructuring we are talking about, finally, Nigerians must sit down to discuss and the issue of LGA autonomy must be considered.\n“As long as we have weak local governments, we would have difficulty managing this country.\nSo this appointment system has made council chairmen become like aides to the governor and we must discourage that.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram",
          "link": "https://www.thisdaylive.com/index.php/2021/04/30/jonathan-pushes-for-lg-reform-autonomy/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "jonathan",
            "constitution",
            "autonomy",
            "council",
            "pushes",
            "national",
            "reform",
            "local",
            "president",
            "chairmen",
            "lg",
            "appointment",
            "state",
            "weak",
            "lgas"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "REVEALED: How Nigerian Police, Judiciary Frustrate Justice For Rape Victims",
          "summary": "The rape victims have mostly been minors and young adults from one to 15 years and 16 to 25 years.\nFrom police to court, rape victims are frustrated by the inability to obtain justice, forcing many to avoid reporting rape at all.\nTombari Dumka-Kote, Executive Director, Centre for Justice, Empowerment and Development (C4J), noted that the delay in adjudication deprives rape victims of justice.\nHe pointed out that police officers need more enlightenment on how to handle rape cases.\n“Often, they are more interested in making money from perpetrators, and thereby released the perpetrators rather than helping the society to give justice to rape victims,” he claimed.",
          "link": "http://saharareporters.com/2021/04/30/revealed-how-nigerian-police-judiciary-frustrate-justice-rape-victims",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nigerian",
            "daughter",
            "rape",
            "reported",
            "revealed",
            "court",
            "ms",
            "told",
            "frustrate",
            "judiciary",
            "justice",
            "victims",
            "case",
            "cases"
          ]
        },
        {
          "title": "REVEALED: How Nigerian Police, Judiciary Frustrate Justice For Rape Victims",
          "summary": "The rape victims have mostly been minors and young adults from one to 15 years and 16 to 25 years.\nFrom police to court, rape victims are frustrated by the inability to obtain justice, forcing many to avoid reporting rape at all.\nTombari Dumka-Kote, Executive Director, Centre for Justice, Empowerment and Development (C4J), noted that the delay in adjudication deprives rape victims of justice.\nHe pointed out that police officers need more enlightenment on how to handle rape cases.\n“Often, they are more interested in making money from perpetrators, and thereby released the perpetrators rather than helping the society to give justice to rape victims,” he claimed.",
          "link": "http://saharareporters.com/2021/04/30/revealed-how-nigerian-police-judiciary-frustrate-justice-rape-victims#disqus_thread",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nigerian",
            "daughter",
            "rape",
            "reported",
            "revealed",
            "court",
            "ms",
            "told",
            "frustrate",
            "judiciary",
            "justice",
            "victims",
            "case",
            "cases"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Police warn against Yoruba nation rally in Ogun",
          "summary": "The police in Ogun state say the planned rally to promote the concept of a Yoruba nation, scheduled to hold in Ogun state on May 1, is not approved by the command.\nAdvertisementAbimbola Oyeyemi, spokesman of the Ogun police command, in a statement on Thursday, urged the organisers of the rally to shelve all plans so as not to disrupt peace in the state.\nThe same group staged another rally in Shagamu on 16/4/2021 where they made an attempt to attack Shagamu police station for no reason.\n“The same group is again planning to hold another mass rally on 1st May, 2021 at Abeokuta, making it the 4th rally in the State in quick succession.\n“It is also instructive to note that available intelligence shows that the organisers of these rallies are being sponsored by certain individuals outside the State and the country to destabilise Ogun State.",
          "link": "https://www.thecable.ng/police-warn-against-yoruba-nation-rally-in-ogun",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nation",
            "ogun",
            "hold",
            "rally",
            "note",
            "group",
            "warn",
            "yoruba",
            "command",
            "public",
            "organisers",
            "rallies",
            "state"
          ]
        },
        {
          "title": "Insecurity: Oyo to deploy Man O’ War operatives to schools",
          "summary": "The Oyo government says it will deploy Man O’ War operatives to primary and secondary schools across the state to beef up security.\nAdvertisementSeyi Makinde, governor of Oyo, disclosed this when he received national executives of the paramilitary organisation at his office on Thursday.\nI can testify to the role Man O’ War played during the elections that I participated in as governorship candidate in 2015 and 2019.\nSo, I will renew my commitment in Man O’ War,” Makinde said.\nHere also in Oyo state, we have been dealing with kidnapping, farmer/herder clashes and people have suddenly become temperamental.",
          "link": "https://www.thecable.ng/insecurity-oyo-to-deploy-man-o-war-operatives-to-schools",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "makinde",
            "deploy",
            "oyo",
            "schools",
            "operatives",
            "national",
            "man",
            "command",
            "war",
            "paramilitary",
            "security",
            "state",
            "insecurity"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "CBN sacks all directors of First Bank Limited and FBN holdings",
          "summary": "The Central Bank of Nigeria has announced the immediate removal of all of the directors of First Bank Nigeria Limited as well as FBN holdings.\nNevertheless, one of the important points in the CBN’s announcement this evening is the return of Dr. Sola Adedutan as the MD/CEO of FirstBank of Nigeria.\nYesterday, the board of First Bank had announced Adedutan’s retirement and appointed Gbenga Shobo in his place.\nThe CBN had also warned FirstBank in a separate memo that Adedutan’s removal was improper because his tenure had not elapsed.\nAlso, the CBN has announced a new board of directors for FirstBank.",
          "link": "https://techcabal.com/2021/04/29/cbn-sacks-first-bank-directors/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "board",
            "sacks",
            "removal",
            "holdings",
            "fbn",
            "directors",
            "firstbank",
            "group",
            "nigeria",
            "bank",
            "cbn",
            "executive",
            "shobo",
            "announced",
            "limited"
          ]
        },
        {
          "title": "EXCLUSIVE: CBN asks First Bank to call in Otudeko’s Honeywell Flour Mills loan facility within 48 hours",
          "summary": "The Central Bank of Nigeria has directed the Oba Otudeko owned Honeywell Flour Mills to repay a loan to First Bank within 48 hours, according to a memo seen by TechCabal.\nBut the CBN is alleging that First Bank gave special treatment to Honeywell Flour Mills in restructuring its loan facility.\nOne big regulatory concern was Honeywell Flour Mill’s collateral for the loan facility.\nThis order to divest from the apex bank has its roots in yet another bank loan involving Ecobank, Oba Otudeko and some Airtel shares used as a collateral.\nAccording to news reports, Otudeko’s Airtel shares were used as collateral for Honeywell’s Ecobank loan.",
          "link": "https://techcabal.com/2021/04/29/cbn-first-bank-otudeko/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "loan",
            "otudeko",
            "hours",
            "facility",
            "honeywell",
            "exclusive",
            "otudekos",
            "bank",
            "nigeria",
            "flour",
            "cbn",
            "shares",
            "mills",
            "airtel"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "FG trains 30 coconut farmers on nursery, processing in Edo – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Federal Ministry of Agriculture and Rural Development says it has trained 30 coconut farmers on nursery establishment, field development, harvesting, processing and marketing in Edo.\nHe spoke at the opening of capacity building workshop for coconut farmers in collaboration with the Nigeria Institute for Oil Palm Research (NIFOR).\nHe said that the capacity building workshop was coming at a very crucial moment when the country was recovering from a difficult spell of the COVID-19 pandemic.\nThe Acting Executive Director of NIFOR, Dr. Celestine Ikuenobe, said that coconut production offered great opportunities for export earnings.\nEarlier, Mrs Okoroji Okechukwu, the National President, National Coconut Producers, Processors and Marketers Association of Nigeria, commended the sponsors of the workshop, saying that it would transform the agricultural sector.",
          "link": "http://nigerianobservernews.com/2021/04/fg-trains-30-coconut-farmers-on-nursery-processing-in-edo/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nigerian",
            "coconut",
            "edo",
            "nigeria",
            "farmers",
            "national",
            "trains",
            "president",
            "federal",
            "processing",
            "observer",
            "30",
            "capacity",
            "nifor",
            "fg",
            "workshop",
            "building",
            "ministry",
            "nursery"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "web",
            "highways",
            "register",
            "nightgrazing",
            "jan",
            "underaged",
            "wish",
            "immediate",
            "outlawed",
            "movement",
            "prohibited",
            "cattle",
            "19"
          ]
        },
        {
          "title": "Buhari expresses disappointment over Ortom’s attack, says he’s not to blame for insecurity",
          "summary": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has expressed disappointment over what he described as attack on him by Benue State Governor, Samuel Ortom.\nOrtom had on several occasions, blamed the president for failing to bring Fulani herdsmen attacking communities in the state to book.\nHe said the herders were displacing communities in the state, while wondering why the Buhari administration has not acted to put an end to the violence.\n” The future of Benue State and indeed that of the entire country lies in harmony and the respect for law, order, and the constitution.\nA government voted into office by the people, should treat the people as its masters and not as its servants.”",
          "link": "https://hallmarknews.com/buhari-expresses-disappointment-over-ortoms-attack-says-hes-not-to-blame-for-insecurity/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "blame",
            "expresses",
            "buhari",
            "hes",
            "attack",
            "governor",
            "parts",
            "statement",
            "country",
            "president",
            "ortoms",
            "benue",
            "progress",
            "citizens",
            "disappointment",
            "state",
            "insecurity"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Gwamnatin Tarayya Da Jihar Yobe Sun Kaddamar Da Aikin Samar Da Ruwan Sha A Damaturu",
          "summary": "",
          "link": "https://hausa.leadership.ng/gwamnatin-tarayya-da-jihar-yobe-sun-kaddamar-da-aikin-samar-da-ruwan-sha-a-damaturu/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "da",
            "samar",
            "ruwan",
            "tarayya",
            "sha",
            "kaddamar",
            "damaturu",
            "gwamnatin",
            "yobe",
            "jihar"
          ]
        },
        {
          "title": "A U Gama Farm Ta Yaye Dalibai A Kan Kiyon Kaji Da Kyankyasa",
          "summary": "",
          "link": "https://hausa.leadership.ng/a-u-gama-farm-ta-yaye-dalibai-a-kan-kiyon-kaji-da-kyankyasa/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "ta",
            "kaji",
            "kiyon",
            "da",
            "kyankyasa",
            "yaye",
            "dalibai",
            "kan",
            "gama",
            "farm"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Senate summons Finance minister, Chief of Army Staff over budgetary...",
          "summary": "They are to appear before the Senate Committee on Army on Tuesday May 5 alongside the Director-General of the Budget Office, Ben Akabueze.\nMeanwhile, the chairman of the committee; Senator Ali Ndume, knocked the minister for her alleged disregard for its invitations.\n“We have invited the Minister now to explain why her ministry was not funding the operations of the Army and she is not here.\nThis is not acceptable.”However, on hand to clarify issues was the Permanent Secretary, Special Duties in the Finance Ministry, Aliyu Shinkafi.\nBut Committee chairman produced Ndume a letter in which the Chief of Defence Staff purportedly claimed that the military authorities had shortfall in releases from the Finance Ministry.",
          "link": "https://dailytimes.ng/senate-summons-finance-minister-chief-of-army-staff-over-budgetary-releases-for-war/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "finance",
            "staff",
            "committee",
            "budgetary",
            "summons",
            "ndume",
            "chief",
            "senate",
            "operations",
            "army",
            "minister",
            "releases",
            "released",
            "ministry",
            "appropriated"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "VIDEO: Nollywood & State of the Nation- Ejike Asiegbu",
          "summary": "You might also like",
          "link": "https://daylightng.com/video-nollywood-state-of-the-nation-ejike-asiegbu/",
          "published": "04/30/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "nation",
            "video",
            "asiegbu",
            "nollywood",
            "state",
            "ejike"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "drivers",
            "worsening",
            "gridlock",
            "callup",
            "trucks",
            "npa",
            "road",
            "ecall",
            "apapa",
            "system",
            "electronic",
            "truck",
            "roads",
            "amidst"
          ]
        },
        {
          "title": "3 Ways Sub-Saharan Africa Can Foster Growth In Her Regions",
          "summary": "Aggregation of DataData equals knowledge which is why countries in sub-Sahara Africa need to take aggregation of data very seriously.\nWith accurate data, sub-Sahara Africa can understand prevalent issues, how to tackle them and compare their progress with other countries of the world.\nPeople InclusivenessIf sub-Saharan Africa wants to solve her problems, she needs to include her people in the process (they know where the shoe pinches).\nGrowth and development is attainable at a rapid pace in sub-Sahara Africa.\nWe might not be advancing at the speed required to achieve the 2030 SGDs but sub-Saharan Africa will not be left behind, let’s take action now!",
          "link": "https://bizwatchnigeria.ng/3-ways-sub-saharan-africa-can-foster-growth-in-her-regions/",
          "published": "04/27/2021",
          "scraped_date": "04/30/2021",
          "keywords": [
            "development",
            "achieve",
            "africa",
            "subsahara",
            "foster",
            "regions",
            "countries",
            "data",
            "need",
            "ways",
            "problems",
            "subsaharan",
            "growth",
            "world"
          ]
        }
      ]
    }
  }
}