{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Why govt is yet to reopen burnt Lagos Airport flyover — Sanwo-Olu’s aide",
          "summary": "Kindly Share This Story:By Olasunkanmi AkoniThe Lagos State Government has attributed lack of fund as the main factor delaying repairs and reopening of the burnt Airport Road Flyover, along Oshodi-Apapa Expressway, Lagos.\nAlso, the Federal Controller of Works in Lagos State, Mr Olukayode Popoola, on the second day of the incident, urged the public to stay off Airport Road flyover pending the determination of its structural safety.\nAccording to the controller, the Federal Highway Act empowers the Federal Ministry of Works and Housing to prosecute whoever caused damage to assets of the Federal Government.\nPopoola noted that the ministry had been working in collaboration with Lagos State Government to tackle trucks’ menace and other infractions affecting road infrastructure.\nAlso, Mr Cyril Zango, Deputy Corps Commander (Operations), Lagos Sector Command of the Federal Roads Safety Corps, said the offending truck had been impounded.",
          "link": "https://www.vanguardngr.com/2021/05/why-govt-is-yet-to-reopen-burnt-lagos-airport-flyover-sanwo-olus-aide/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "safety",
            "airport",
            "govt",
            "aide",
            "works",
            "reopen",
            "sanwoolus",
            "burnt",
            "road",
            "federal",
            "structural",
            "ministry",
            "public",
            "state",
            "lagos",
            "flyover"
          ]
        },
        {
          "title": "India logs 400,000 virus cases with vaccine campaign also overwhelmed",
          "summary": "Eight Covid-19 patients died at Delhi’s Batra Hospital on Saturday after it ran short of oxygen supplies, hospital director Sudhanshu Bankata said.\nIt is crucial that we get inoculated and help the world beat this horrible pandemic,” Divya, a 37-year-old homemaker, told broadcaster NDTV at a south Delhi hospital.\nOnly 2.7 million doses were administered on Friday compared to a peak of 4.5 million doses on April 5.\nThe country currently produces around 75 million doses a month and is expected to reach 100 million monthly doses by June, domestic media reported.\nGovernment policy makers hope the vaccine supplies will improve in the coming months, as production is ramped up and new vaccines such as Russia’s Sputnik V have recently been approved.",
          "link": "https://www.vanguardngr.com/2021/05/india-logs-400000-virus-cases-with-vaccine-campaign-also-overwhelmed/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "hospital",
            "400000",
            "cases",
            "doses",
            "covid19",
            "campaign",
            "overwhelmed",
            "vaccine",
            "india",
            "delhi",
            "daily",
            "million",
            "supplies",
            "logs",
            "virus",
            "oxygen"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Fresh attack on Taraba community as gunmen snatch pregnant women, others",
          "summary": "Gunmen suspected to be militia have continued to make life unbearable for the people of Taraba State as they have continued to carry out attacks on residents of the State.\nDAILY POST gathered that two pregnant women and several other persons in Suntai village of Bali Local Government Council of the state have been abducted.\nSuntai village is the country home of the former late Governor Danbaba Danfulani Suntai, who was involved in a plane crash in 2012 which rendered him incapacitated, leading to his death.\nA few residents of the community claimed to have on several occasions drew the attention of the security operatives to their plights, but no actions were taken.\nThey lamented that if the security operatives were proactive enough, the recent abduction would have been averted, beckoning on the federal lgovernmnet to deploy more security operatives to the area.",
          "link": "https://dailypost.ng/2021/05/01/fresh-attack-on-taraba-community-as-gunmen-snatch-pregnant-women-others/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "fresh",
            "attack",
            "residents",
            "pregnant",
            "women",
            "community",
            "security",
            "operatives",
            "council",
            "command",
            "village",
            "officer",
            "victims",
            "state",
            "suntai",
            "gunmen",
            "taraba",
            "snatch"
          ]
        },
        {
          "title": "May Day: Kaduna Assembly Speaker, Zailani hails frontline workers against insurgency, COVID-19",
          "summary": "The Speaker, Kaduna House of Assembly, Yusuf Ibrahim Zailani, has commended the contributions of Nigerian workers to the growth of the country’s economy as the world celebrates Workers’ Day.\nZailani, who is also the Chairman of the Northern Speakers Forum, hailed the courage of workers across Nigeria in the face of difficulties.\n“I want to salute the courage of Nigerian workers, who have over the years given their best to their work.\n“I urge the Nigerian workers to redouble their efforts at this time of our national development.\nHe noted that these challenges have clearly shown how resilient and hardworking Nigerian workers are and urged them not to relent but to remain committed and resourceful as always.",
          "link": "https://dailypost.ng/2021/05/01/may-day-kaduna-assembly-speaker-zailani-hails-frontline-workers-against-insurgency-covid-19/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "yusuf",
            "nigerian",
            "workers",
            "assembly",
            "work",
            "youi",
            "insurgency",
            "frontline",
            "hails",
            "covid19",
            "courage",
            "speaker",
            "day",
            "nigeria",
            "best",
            "zailani",
            "kaduna"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Marwa, NDLEA and the Houdini act",
          "summary": "And for the country’s anti-narcotics organisation, the National Drug Law Enforcement Agency, NDLEA, there is a gale of public appreciation.\nHence, it did not escape the notice of the public that there is a new approach to the war against drug abuse and drug trafficking.\nHow Marwa did it is no Houdini act; what he did was more of a management masterstroke.\nIn three months, Marwa has been able to build and still building an overwhelming coalition against drug trafficking in Nigeria.\nMarwa in three months has matched his promise to dismantle drug cartels in the country with positive actions and good results.",
          "link": "https://thenationonlineng.net/marwa-ndlea-and-the-houdini-act/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "marwa",
            "drugs",
            "agency",
            "nigeria",
            "act",
            "war",
            "houdini",
            "ndlea",
            "public",
            "months",
            "drug",
            "trafficking"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Amotekun intercepts trailer-load of 45 Hausa youths in Ondo",
          "summary": "From Bamigbola Gbolagunte, AkureNo fewer than 45 suspected miscreants in Okitipupa, headquarters of Okitipupa Local Government Area of Ondo State have been arrested by Amotekun security operatives.\nThe development, Sundays Sun gathered, forced residents of the town to call the attention of security agents to the situation in the town.\nA source disclosed that “the Amotekun corps arrested the youths who were loaded in a trailer in front of the army barracks.\n“As the Amotekun corps accosted them, some of them jumped down from the vehicles and ran into the town but about 45 of them were arrested.\nThe state commander of the corps, Chief Adetunji Adeleye, confirmed the arrest, saying investigations had commenced on the matter.",
          "link": "https://www.sunnewsonline.com/amotekun-intercepts-trailer-load-of-45-hausa-youths-in-ondo/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "vehicles",
            "hausa",
            "local",
            "gathered",
            "okitipupa",
            "45",
            "town",
            "trailerload",
            "security",
            "amotekun",
            "intercepts",
            "state",
            "corps",
            "ondo",
            "youths"
          ]
        },
        {
          "title": "Fr. Mbaka: Diaspora Nigerians tackle Buhari",
          "summary": "Mbaka begs the question of insecurity and senseless killings in Nigeria, which the priest tasked thee Federal Government to address.\n“The ministry and indeed Nigerians are not new to such accusation against Fr.\n“The insecurity Fr.\nMbaka is tasking the government to tackle is not only for the Igbo land, but for the entire country.\n“Moreover, it is indeed laughable for the APC or anyone to threaten to report Fr.",
          "link": "https://www.sunnewsonline.com/fr-mbaka-diaspora-nigerians-tackle-buhari/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "country",
            "presidency",
            "report",
            "mbaka",
            "tackle",
            "nigerians",
            "truth",
            "diaspora",
            "nigeria",
            "fr",
            "buhari",
            "insecurity"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Video: Fire Engulfs Buiilding in Apapa",
          "summary": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/video-fire-engulfs-buiilding-in-apapa/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "policy",
            "control",
            "uses",
            "site",
            "buiilding",
            "cookies",
            "apapa",
            "cookie",
            "useto",
            "engulfs",
            "privacy",
            "video",
            "including",
            "website"
          ]
        },
        {
          "title": "FirstBank: I Acted in Honour, Integrity, Says Awosika",
          "summary": "By Obinna ChimaThe sacked Chairman of First Bank Nigeria Limited, Mrs. Ibukun Awosika, has said that she acted in honour and integrity with the interest of the institution, all its stakeholders and the nation during her 11-year reign at the bank.\nAwosika, wrote this in an article she titled: “My FBN Group Journey,” posted on instagram, a social media platform.\nEmefiele had announced the appointment of a former Minister of State for Finance and former Executive Director of First Bank, Mr. Remi Babalola, as chairman of FBN Holdings.\nFirst Bank Nigeria Limited’s new Chairman is Tunde Hassan-Odukale, who replaced Awosika.\nGbenga Shobo, deputy managing director; and Remi Oni and Abdullahi Ibrahim, executive directors, are members of the reconstituted board.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/firstbank-i-acted-in-honour-integrity-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "mr",
            "limited",
            "fbn",
            "acted",
            "awosika",
            "interest",
            "honour",
            "integrity",
            "stakeholders",
            "nigeria",
            "board",
            "remi",
            "firstbank",
            "bank"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "currently",
            "insurgents",
            "haram",
            "residents",
            "flee",
            "breaking",
            "boko",
            "attacking",
            "area",
            "gathered",
            "community",
            "borno",
            "state",
            "islamic",
            "soldiers",
            "killed",
            "military"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "currently",
            "insurgents",
            "haram",
            "residents",
            "flee",
            "breaking",
            "boko",
            "attacking",
            "area",
            "gathered",
            "community",
            "borno",
            "state",
            "islamic",
            "soldiers",
            "killed",
            "military"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Mr President, Nigeria must not go down",
          "summary": "President, Nigeria Is Going Down’.\nI recall, and repeat, the opening salvo: “Mr President, I don’t know how you would take this, but there is no nicer way of putting it – Nigeria is going down.\nI will tell you a very short story, Mr President.\nHaving said that, Mr President, I now want to make my point: Nigeria is going down, and very fast.\nI do not for a minute, Mr President, underestimate some of your strides.",
          "link": "https://www.thecable.ng/mr-president-nigeria-must-not-go-down",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "know",
            "president",
            "mr",
            "things",
            "haram",
            "political",
            "boko",
            "excellency",
            "nigeria",
            "insecurity"
          ]
        },
        {
          "title": "Crimson as colour of Remi Tinubu’s wolf and sheep allegory",
          "summary": "That was what she did last week when she introduced the wolf and sheep allegory into the current national discourse on the security situation in Nigeria.\nBenue State governor, Samuel Ortom, stood before seven bodies lying prostrate or face-up, in different postures.\nUpon the wolf having grown, unknown to the shepherd, the wolf returned to the flesh-eating gastronomy of its wolf ancestry.\nAgain, it is apposite to ask whether former Miss Ikusebiala was speaking like a mother when she made that wolf and sheep statement.\nAdvertisementUpper week, Yobe State governor and All Progressives Congress (APC’s) interim national chairman, Mai Mala Buni, walked that same boastfully ruinous path.",
          "link": "https://www.thecable.ng/crimson-as-colour-of-remi-tinubus-wolf-and-sheep-allegory",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "crimson",
            "party",
            "governor",
            "apc",
            "national",
            "ikusebiala",
            "allegory",
            "colour",
            "nigeria",
            "sheep",
            "remi",
            "wolf",
            "state",
            "tinubus",
            "fulani"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "cbn",
            "sanusi",
            "governor",
            "bank",
            "emefiele",
            "skye",
            "bruised",
            "enforces",
            "took",
            "board",
            "sacking",
            "otudeko",
            "tradition",
            "banks"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "expansion",
            "partnerships",
            "startups",
            "fintech",
            "aggressive",
            "nigeria",
            "company",
            "size",
            "market",
            "business",
            "value",
            "companies",
            "country",
            "expand"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "observer",
            "nigerian",
            "army",
            "renaming",
            "renames",
            "counterinsurgency",
            "counterterrorism",
            "defeat",
            "operation",
            "locations",
            "followed",
            "ne",
            "coas",
            "disclosed"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "prohibited",
            "outlawed",
            "highways",
            "19",
            "underaged",
            "jan",
            "wish",
            "register",
            "cattle",
            "immediate",
            "movement",
            "web",
            "nightgrazing"
          ]
        },
        {
          "title": "Fidelity Bank Approves 22 Kobo Dividend Per Share For FY2020",
          "summary": "The shareholders of Fidelity Bank Plc have unanimously endorsed the payment of a cash dividend of 22 kobo per share to all Shareholders whose names appear in the Register of Members at the close of business on April 16, 2021.\nThis translates to a dividend yield of 9.2%, making it the 4th most rewarding Bank to investors in the Nigerian Capital Market.\nMustapha Chike-Obi, Chairman of the Board of Directors of Fidelity Bank, reassured shareholders at the AGM that the board and management of the bank would maintain the high corporate governance standard synonymous with Fidelity Bank and also ensure the bank continued in its growth trajectory in the years ahead.\nTotal savings deposits now account for about 25.0 percent of total deposits, an attestation of the Bank’s increasing market share in the retail market segment.\nOnyeali-Ikpe thanked the shareholders and the members of the Board for their continued confidence in the management team and specially appreciated Fidelity Bank customers for their patronage and loyalty.",
          "link": "https://hallmarknews.com/fidelity-bank-approves-22-kobo-dividend-per-share-for-fy2020/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "performance",
            "fy2020",
            "share",
            "22",
            "approves",
            "period",
            "growth",
            "fidelity",
            "shareholders",
            "deposits",
            "total",
            "kobo",
            "dividend",
            "billion",
            "bank"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "I Acted In FirstBank’s Interest, Says Awosika",
          "summary": "BY OLUSHOLA Bello |The immediate past chairman of the Board of First Bank of Nigeria Limited, Dr. Ibukun Awosika, has said her team acted in what it believed to be in the interest of the bank.\nShe made this known while opening up on her relationship with the First Bank Group family 42 hours after she was fired by the Central Bank of Nigeria (CBN).\nAwosika, who spoke in a statement, titled: ‘My FBN Group Journey’, made her position known two days after the Governor of the CBN, Godwin Emefiele, announced her sack alongside other Board members, including Oba Otudeko.\nReacting to the development through her Instagram page, Awosika, also the founder of the The Chair Centre Group and Author of: ‘The Girl Entrepreneurs’, said she did her best while with the First Bank Group.\n“Without a shadow of doubt, I will unequivocally state that I have always acted in honour and integrity with the utmost interest of the institution, all our stakeholders and the nation.”",
          "link": "https://leadership.ng/i-acted-in-firstbanks-interest-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "firstbanks",
            "nation",
            "utmost",
            "worked",
            "fbn",
            "interest",
            "awosika",
            "acted",
            "team",
            "stakeholders",
            "nigeria",
            "board",
            "group",
            "bank"
          ]
        },
        {
          "title": "Again, Gunmen Kill 2 Policemen, Set Police Vehicles Ablaze In A’Ibom",
          "summary": "By Bernard Tolani Dada, Uyo |Armed men again on Saturday invaded a police station at Ibiaku Ntok Okpo in Ikono local government area of Akwa Ibom State and killed two police officers on duty.\nIt was gathered that another female police officer was injured while five vehicles belonging to the station were set ablaze during the attack, which occurred around 3am.\nThe press secretary to the chairman of Ikono LGA, Nsisong Ntuk, in a Facebook post, said a flag hoisted at the police station was also carted away.\nConfirming the incident the public relations officer, Odiko Macdon, said the situation is being assessed by the policemen mobilised to be the scene.\nHe said: “There was an attack on our Ikono base, it wasn’t razed down and as we speak police officers drafted to the scene are assessing the situation already”",
          "link": "https://leadership.ng/again-gunmen-kill-2-policemen-set-police-vehicles-ablaze-in-aibom/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "set",
            "vehicles",
            "attack",
            "local",
            "aibom",
            "kill",
            "officer",
            "security",
            "station",
            "officers",
            "chairman",
            "ablaze",
            "ikono",
            "area",
            "gunmen",
            "killed",
            "policemen"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police inspector accidentally shot self, not suicide – PPRO —",
          "summary": "A Police Inspector identified as Ochofie Ijimbile, attached to MOPOL 55 Aba, Abia State, has allegedly shot and killed himself while servicing his rifle in readiness for the day’s job.\nPolice spokesman in the Command, SP Geoffrey Ogbonna, while describing the incident as sad and unfortunate, told reporters that Inspector Ijimbile accidentally shot himself on the chest.\nFollowing the incident, he was immediately rushed to the hospital, where he was confirmed dead.\nWhile stating that the late policeman could be unaware that there was bullet in his rifle chamber, called on policemen in Abia and across the country, especially those handling rifles to always exercise extra carefulness while servicing their arms.\nHis corpse has since been deposited in the morgue while efforts are on to reach the family members",
          "link": "https://dailytimes.ng/police-inspector-accidentally-shot-self-not-suicide-ppro/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "unaware",
            "shot",
            "ppro",
            "incident",
            "rifle",
            "suicide",
            "inspector",
            "self",
            "abia",
            "accidentally",
            "told",
            "unfortunate",
            "servicing",
            "ijimbile"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Public outrage: El-Rufai missing at The Platform",
          "summary": "Kaduna State Governor, Nasir El-Rufai, may have caved in to pressure from some Nigerians who opposed his being listed as a speaker at the 2021 edition of The Platform, an annual conference organised by the Senior Pastor of the Covenant Christian Centre, Lagos, Poju Oyemade.\nThe programme was themed, ‘Is Devolution of Powers The Solution To Nigeria’s Problems’.\nHowever, El-Rufai, who was announced as one of the speakers at the event, was conspicuously absent from the programme on Saturday.\nAlso, the organisers of the programme did not give any reason why El-Rufai was not present at the event.\nSome Twitter users had kicked against the choice of El-Rufai as a speaker on The Platform when the flyer inviting people to the event went viral with the governor as one of the speakers.",
          "link": "https://daylightng.com/public-outrage-el-rufai-missing-at-the-platform/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "line",
            "missing",
            "governor",
            "state",
            "outrage",
            "event",
            "went",
            "elrufai",
            "speakers",
            "speaker",
            "public",
            "programme",
            "platform"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "launches",
            "page",
            "bookmaker",
            "version",
            "mobile",
            "site",
            "offers",
            "place",
            "1xbet",
            "convenient",
            "account",
            "emerges",
            "website",
            "popular"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "gridlock",
            "npa",
            "callup",
            "roads",
            "truck",
            "drivers",
            "amidst",
            "worsening",
            "apapa",
            "road",
            "ecall",
            "trucks",
            "electronic",
            "system"
          ]
        }
      ]
    }
  }
}