{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "‘Getting COVID-19 within two weeks of vaccination evidence of carelessness’",
          "summary": "Scientific Advisory Group for Emergencies says that ‘good real world evidence’ has proved that COVID-19 vaccines work after the first dose.\nThe Scientific Advisory Group for Emergencies, or SAGE, is a British Government advisory body that advises central government in emergencies.\nIt, however, stated that, as the trials demonstrated, a small minority of people – particularly those who are frail, elderly and immunologically compromised – will not acquire protection against COVID-19 through vaccination.\nAnalysis conducted by SAGE found that out of 52,000 patients who were admitted to hospital between December 8 and 10th of April, 3,598 had received the first dose of a COVID-19 vaccine.\n“Many people are acquiring COVID-19 within two weeks of being vaccinated, which does indicate that people are letting their guard down.",
          "link": "https://healthwise.punchng.com/getting-covid-19-within-two-weeks-of-vaccination-evidence-of-carelessness/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "covid19",
            "trials",
            "vaccination",
            "vaccines",
            "evidence",
            "weeks",
            "vaccine",
            "patients",
            "vaccinated",
            "united",
            "hospital",
            "getting",
            "carelessness"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "MAY DAY: Review upward pension, workers salaries NICOT tells Buhari",
          "summary": "Kindly Share This Story:By Chinonso Alozie – OwerriThe President of the Nigerian Community in Turkey, Prince Emre Magboh, yesterday called on the President of Nigeria, Muhammadu Buhari, to review upward the salaries of Nigerian workers as well as that of pensioners in the country.\nMagboh, spoke in a statement made available to newsmen in Owerri, from his office, Istanbul, while commenting on the worker’s day celebration.\nHe said that his call for upward review of workers’ salaries was to end the incessant protests by workers.\nREAD ALSO: Suspected Okada thief burnt to death by angry mob in IlorinAccording to NICOT president, “The workers day celebration as observed annually is a day set aside to encourage the tireless contributions of workers towards nation-building” adding that, “appreciating their efforts will motivate them to be committed in doing their job efficiently.\nI also used this opportunity to call on the workers to adhere to safety measures in carrying out their day-to-day activities until the fight against the covid-19 is won.",
          "link": "https://www.vanguardngr.com/2021/05/may-day-review-upward-pension-workers-salaries-nicot-tells-buhari/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "workers",
            "share",
            "protests",
            "salaries",
            "review",
            "pension",
            "nigeria",
            "nigerian",
            "tells",
            "buhari",
            "day",
            "nicot",
            "president",
            "upward"
          ]
        },
        {
          "title": "Suspected Okada thief burnt to death by angry mob in Ilorin",
          "summary": "Kindly Share This Story:By Demola Akinyemi – IlorinA suspected motorcyclist theft specialist met his waterloo on Friday in Ilorin as an angry mob around Maraba area of the state capital set him ablaze for allegedly stealing a motorcycle popularly called okada.\nThe angry mob after beating him black and blue thereafter took a used tyre, sprinkle petrol on it put it on the suspect in the middle of the road, and set him ablaze.\nWhen Sunday Vanguard visited the scene yesterday, his charred remains have been removed.\nSpeaking on the issue, a resident of the area who does not want his name in print said, “We learnt they snatched an okada around Akerebiata after shooting the owner.\n“They intercepted and overpowered him, collected his gun, and burnt him to death after he had been seriously beaten with blood all over his body.",
          "link": "https://www.vanguardngr.com/2021/05/suspected-okada-thief-burnt-to-death-by-angry-mob-in-ilorin/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "incident",
            "suspect",
            "youths",
            "okada",
            "angry",
            "led",
            "took",
            "maraba",
            "ilorin",
            "suspected",
            "death",
            "area",
            "burnt",
            "spot",
            "vanguard",
            "thief",
            "state",
            "mob"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Fresh attack on Taraba community as gunmen snatch pregnant women, others",
          "summary": "Gunmen suspected to be militia have continued to make life unbearable for the people of Taraba State as they have continued to carry out attacks on residents of the State.\nDAILY POST gathered that two pregnant women and several other persons in Suntai village of Bali Local Government Council of the state have been abducted.\nSuntai village is the country home of the former late Governor Danbaba Danfulani Suntai, who was involved in a plane crash in 2012 which rendered him incapacitated, leading to his death.\nA few residents of the community claimed to have on several occasions drew the attention of the security operatives to their plights, but no actions were taken.\nThey lamented that if the security operatives were proactive enough, the recent abduction would have been averted, beckoning on the federal lgovernmnet to deploy more security operatives to the area.",
          "link": "https://dailypost.ng/2021/05/01/fresh-attack-on-taraba-community-as-gunmen-snatch-pregnant-women-others/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "fresh",
            "security",
            "pregnant",
            "women",
            "state",
            "council",
            "gunmen",
            "suntai",
            "operatives",
            "officer",
            "command",
            "snatch",
            "victims",
            "village",
            "attack",
            "community",
            "residents",
            "taraba"
          ]
        },
        {
          "title": "May Day: Kaduna Assembly Speaker, Zailani hails frontline workers against insurgency, COVID-19",
          "summary": "The Speaker, Kaduna House of Assembly, Yusuf Ibrahim Zailani, has commended the contributions of Nigerian workers to the growth of the country’s economy as the world celebrates Workers’ Day.\nZailani, who is also the Chairman of the Northern Speakers Forum, hailed the courage of workers across Nigeria in the face of difficulties.\n“I want to salute the courage of Nigerian workers, who have over the years given their best to their work.\n“I urge the Nigerian workers to redouble their efforts at this time of our national development.\nHe noted that these challenges have clearly shown how resilient and hardworking Nigerian workers are and urged them not to relent but to remain committed and resourceful as always.",
          "link": "https://dailypost.ng/2021/05/01/may-day-kaduna-assembly-speaker-zailani-hails-frontline-workers-against-insurgency-covid-19/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "workers",
            "frontline",
            "covid19",
            "yusuf",
            "work",
            "nigeria",
            "zailani",
            "nigerian",
            "best",
            "youi",
            "speaker",
            "hails",
            "assembly",
            "day",
            "courage",
            "kaduna",
            "insurgency"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Army phases out Operation Lafiya Dole, launches Operation Hadin Kai",
          "summary": "By Okodili Ndidi, AbujaThe Nigerian Army has renamed the flagship counterinsurgency operation, Operation Lafiya Dole Operation Hadin Kai (OPHK).\nThe Chief of Army Staff Lieutenant General Ibrahim Attahiru, approved the name change.\nThe statement reads “The Chief of Army Staff (COAS) Lieutenant General Ibrahim Attahiru has approved the renaming of the ongoing Cointerinsurgency Operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\n“This is premised on the fact that the Nigerian Army (NA) has made a lot of progress over the years and needs to re-align for better efficiency.\nADVERTISEMENT“The renaming is in line with the COAS Vision of having “A Nigerian Army that is Repositioned to Professionally Defeat all Adversaries in a Joint Environment”.",
          "link": "https://thenationonlineng.net/army-phases-out-operation-lafiya-dole-launches-operation-hadin-kai/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "lafiya",
            "dole",
            "renaming",
            "statement",
            "locations",
            "phases",
            "general",
            "progress",
            "operation",
            "kai",
            "nigerian",
            "staff",
            "coas",
            "army",
            "hadin",
            "launches"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Black Saturday in Imo as truck crushes 30 market women to death",
          "summary": "From Stanley Uzoaru, OwerriNo fewer than 30 women lost their lives in a ghastly auto crash when a truck lost its brake and rammed into roadside traders at Nkwommiri market in Nwangele, Imo State, on Saturday, an eye witness told Sunday Sun.\nAccording to the source, the incident, which occurred around 12 noon at the Anara- Orlu expressway, where the market is situated, left many injured.\nA truck that lost its brakes has killed women trading on the road at Nkwommiri, and it looks like more are even injured and some trapped under the vehicle.\nA community leader, Frank Ozuruigbo, gave the assurance that the community is working with government official to rescue the trapped victims.\nWhen contacted, the police spokesman Orlando Ikeokwu said that rescue operation was ongoing but confirmed the death of only two women.",
          "link": "https://www.sunnewsonline.com/black-saturday-in-imo-as-truck-crushes-30-market-women-to-death/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "black",
            "women",
            "rescue",
            "nkwommiri",
            "imo",
            "crushes",
            "lost",
            "death",
            "road",
            "trapped",
            "told",
            "truck",
            "community",
            "30",
            "market"
          ]
        },
        {
          "title": "Black Saturday in Imo as truck crushes 10 market women",
          "summary": "No fewer than ten women lost their lives in a ghastly auto crash when a truck lost its brake and rammed into women trading at the roadside of Nkwommiri market in Nwangele Local Government Area of Imo State on Saturday.\nAccording to an eye witness, the incident which occurred at 12 noon at the Anara- Orlu expressway where the market was situated also left many injured.\nOur reporter gathered that the truck was attempting to climb the hilly road when its brake failed and crushed the women as well as other vehicles on the roadside.\nA truck that lost its brakes has killed women trading on the road at Nkwommiri, and it looks like more are even injured and some trapped under the vehicle.\nWhen contacted, the police Spokesperson in the state, Orlando Ikeokwu, said that rescue operation was ongoing but confirmed the death of the ten women.",
          "link": "https://www.sunnewsonline.com/black-saturday-in-imo-as-truck-crushes-10-market-women/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "market",
            "black",
            "women",
            "rescue",
            "trading",
            "nkwommiri",
            "imo",
            "lost",
            "road",
            "truck",
            "community",
            "state",
            "crushes"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Video: Fire Engulfs Buiilding in Apapa",
          "summary": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/video-fire-engulfs-buiilding-in-apapa/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "engulfs",
            "site",
            "including",
            "policy",
            "control",
            "uses",
            "privacy",
            "cookie",
            "buiilding",
            "useto",
            "website",
            "cookies",
            "apapa",
            "video"
          ]
        },
        {
          "title": "FirstBank: I Acted in Honour, Integrity, Says Awosika",
          "summary": "By Obinna ChimaThe sacked Chairman of First Bank Nigeria Limited, Mrs. Ibukun Awosika, has said that she acted in honour and integrity with the interest of the institution, all its stakeholders and the nation during her 11-year reign at the bank.\nAwosika, wrote this in an article she titled: “My FBN Group Journey,” posted on instagram, a social media platform.\nEmefiele had announced the appointment of a former Minister of State for Finance and former Executive Director of First Bank, Mr. Remi Babalola, as chairman of FBN Holdings.\nFirst Bank Nigeria Limited’s new Chairman is Tunde Hassan-Odukale, who replaced Awosika.\nGbenga Shobo, deputy managing director; and Remi Oni and Abdullahi Ibrahim, executive directors, are members of the reconstituted board.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/firstbank-i-acted-in-honour-integrity-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "integrity",
            "stakeholders",
            "remi",
            "limited",
            "bank",
            "firstbank",
            "fbn",
            "interest",
            "nigeria",
            "honour",
            "mr",
            "acted",
            "awosika",
            "board"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "currently",
            "breaking",
            "borno",
            "flee",
            "boko",
            "state",
            "gathered",
            "haram",
            "area",
            "soldiers",
            "killed",
            "islamic",
            "insurgents",
            "military",
            "community",
            "residents",
            "attacking"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "currently",
            "breaking",
            "borno",
            "flee",
            "boko",
            "state",
            "gathered",
            "haram",
            "area",
            "soldiers",
            "killed",
            "islamic",
            "insurgents",
            "military",
            "community",
            "residents",
            "attacking"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "PHOTOS: Sanwo-Olu celebrates workers' day, donates hectares of land for estate",
          "summary": "Babajide Sanwo-Olu, governor of Lagos, on Saturday, celebrated the 2021 International Workers’ Day in the state.\nAdvertisementIn commemoration of the event, Sanwo-Olu approved 10 hectares of land for a workers housing estate and donated official vehicles to leaders of Nigeria Labour Congress (NLC) and Trade Union Congress (TUC) in Lagos.\nThe celebration, which took place at the Onikan stadium, was attended by various unions who also organised parades.\nBelow are photos from the programme:AdvertisementAdvertisementAdvertisementAdvertisement",
          "link": "https://www.thecable.ng/photos-sanwo-olu-celebrates-workers-day-donates-hectares-of-land-for-estate",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "workers",
            "union",
            "celebrates",
            "tuc",
            "vehicles",
            "trade",
            "took",
            "various",
            "sanwoolu",
            "hectares",
            "unions",
            "day",
            "photos",
            "estate",
            "land",
            "donates",
            "congress"
          ]
        },
        {
          "title": "Chidoka: Buhari's cabinet doesn't understand fintechs -- only how to borrow from CBN",
          "summary": "Osita Chidoka, former minister of aviation, says the cabinet members in the Buhari administration do not understand how fintech companies operate.\nHe said the ministers do not understand how modern society works but only how to borrow from the Central Bank of Nigeria (CBN).\nOur cabinet does not reflect Nigeria.\nThey cannot understand Paystack, they cannot understand Flutterwave, they cannot understand kobo360,” he said at the event in Lagos.\n“So we need young people like you to be the chairman of FIRS.",
          "link": "https://www.thecable.ng/chidoka-buharis-cabinet-doesnt-understand-fintechs-only-how-to-borrow-from-cbn",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "understand",
            "young",
            "reflect",
            "unlock",
            "revenue",
            "nigeria",
            "need",
            "cabinet",
            "borrow",
            "cbn",
            "chidoka",
            "tax",
            "responsibility",
            "buharis",
            "doesnt",
            "fintechs"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "bruised",
            "emefiele",
            "bank",
            "sacking",
            "governor",
            "took",
            "banks",
            "tradition",
            "enforces",
            "sanusi",
            "otudeko",
            "cbn",
            "skye",
            "board"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "aggressive",
            "expand",
            "country",
            "company",
            "nigeria",
            "size",
            "fintech",
            "startups",
            "business",
            "value",
            "expansion",
            "partnerships",
            "market",
            "companies"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "followed",
            "observer",
            "renaming",
            "disclosed",
            "locations",
            "counterinsurgency",
            "operation",
            "nigerian",
            "ne",
            "renames",
            "coas",
            "army",
            "counterterrorism",
            "defeat"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "register",
            "prohibited",
            "underaged",
            "nightgrazing",
            "movement",
            "cattle",
            "outlawed",
            "wish",
            "immediate",
            "19",
            "highways",
            "web",
            "jan"
          ]
        },
        {
          "title": "Fidelity Bank Approves 22 Kobo Dividend Per Share For FY2020",
          "summary": "The shareholders of Fidelity Bank Plc have unanimously endorsed the payment of a cash dividend of 22 kobo per share to all Shareholders whose names appear in the Register of Members at the close of business on April 16, 2021.\nThis translates to a dividend yield of 9.2%, making it the 4th most rewarding Bank to investors in the Nigerian Capital Market.\nMustapha Chike-Obi, Chairman of the Board of Directors of Fidelity Bank, reassured shareholders at the AGM that the board and management of the bank would maintain the high corporate governance standard synonymous with Fidelity Bank and also ensure the bank continued in its growth trajectory in the years ahead.\nTotal savings deposits now account for about 25.0 percent of total deposits, an attestation of the Bank’s increasing market share in the retail market segment.\nOnyeali-Ikpe thanked the shareholders and the members of the Board for their continued confidence in the management team and specially appreciated Fidelity Bank customers for their patronage and loyalty.",
          "link": "https://hallmarknews.com/fidelity-bank-approves-22-kobo-dividend-per-share-for-fy2020/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "share",
            "approves",
            "shareholders",
            "total",
            "period",
            "bank",
            "kobo",
            "fidelity",
            "fy2020",
            "deposits",
            "performance",
            "growth",
            "22",
            "billion",
            "dividend"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Again, Gunmen Kill 2 Policemen, Set Police Vehicles Ablaze In A’Ibom",
          "summary": "By Bernard Tolani Dada, Uyo |Armed men again on Saturday invaded a police station at Ibiaku Ntok Okpo in Ikono local government area of Akwa Ibom State and killed two police officers on duty.\nIt was gathered that another female police officer was injured while five vehicles belonging to the station were set ablaze during the attack, which occurred around 3am.\nThe press secretary to the chairman of Ikono LGA, Nsisong Ntuk, in a Facebook post, said a flag hoisted at the police station was also carted away.\nConfirming the incident the public relations officer, Odiko Macdon, said the situation is being assessed by the policemen mobilised to be the scene.\nHe said: “There was an attack on our Ikono base, it wasn’t razed down and as we speak police officers drafted to the scene are assessing the situation already”",
          "link": "https://leadership.ng/again-gunmen-kill-2-policemen-set-police-vehicles-ablaze-in-aibom/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "security",
            "local",
            "vehicles",
            "set",
            "gunmen",
            "chairman",
            "policemen",
            "officer",
            "kill",
            "ablaze",
            "station",
            "killed",
            "ikono",
            "area",
            "attack",
            "aibom",
            "officers"
          ]
        },
        {
          "title": "PSN Chief, Ohuabunwa, Urges Nigerians To Embrace Alternative Medicine",
          "summary": "Ohuabunwa made the call while granting audience to the management of STK Biotech, where he addressed relevant health concerns currently ravaging the country.\nThe PSN boss also pleaded with Nigerians not to let their guard down regarding COVID-19 and health safety precautions, praying that Nigeria does not experience the worse of the virus.\nOhuabunwa in his presentation reiterated his support for the amazing research and scientific work being done at STK Biotech, and promised his support to ensure that the products are made available for all Nigerians.\n“I am taking the STK immune boosters on the road to help maintain my vitality and boost my immune function naturally, and I am very pleased with the safety and tolerability.\nHe recalled that in the past 18 months, NIPRD, PSN and the Medical Laboratory Scientists of Nigerian (MLSN) have visited STK Facility in Imo state and commended the quality of sourcing and production of STK biotech products.",
          "link": "https://leadership.ng/psn-chief-ohuabunwa-urges-nigerians-to-embrace-alternative-medicine/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "biotech",
            "natural",
            "immune",
            "nigeria",
            "products",
            "embrace",
            "ohuabunwa",
            "stk",
            "medicine",
            "chief",
            "group",
            "psn",
            "health",
            "nigerians",
            "alternative",
            "urges"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police inspector accidentally shot self, not suicide – PPRO —",
          "summary": "A Police Inspector identified as Ochofie Ijimbile, attached to MOPOL 55 Aba, Abia State, has allegedly shot and killed himself while servicing his rifle in readiness for the day’s job.\nPolice spokesman in the Command, SP Geoffrey Ogbonna, while describing the incident as sad and unfortunate, told reporters that Inspector Ijimbile accidentally shot himself on the chest.\nFollowing the incident, he was immediately rushed to the hospital, where he was confirmed dead.\nWhile stating that the late policeman could be unaware that there was bullet in his rifle chamber, called on policemen in Abia and across the country, especially those handling rifles to always exercise extra carefulness while servicing their arms.\nHis corpse has since been deposited in the morgue while efforts are on to reach the family members",
          "link": "https://dailytimes.ng/police-inspector-accidentally-shot-self-not-suicide-ppro/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "suicide",
            "incident",
            "inspector",
            "shot",
            "rifle",
            "ijimbile",
            "unaware",
            "abia",
            "ppro",
            "told",
            "accidentally",
            "self",
            "servicing",
            "unfortunate"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Reuben Abati: The fallacies of a ‘prescient’ analyst – By ROTIMI ADEBAYO – Daylight",
          "summary": "One reason for the unfortunate diminution of the hitherto great Abati was his foray into politics.\nAnyone who knows Abati will know that he can rationalise anything.\nAbati was unfazed because all he cared for is what that mercurial Ekiti politician Ayodele Fayose would call stomach infrastructure.\nIn assessing their chances in the race, Abati, betrayed his below-par understanding of the politics of the 2023 election.\nPolitical writer Abati wilfully cancelled Asiwaju Tinubu, Osinbajo and Amosun in the upcoming race, even if they eventually threw their hats into the ring.",
          "link": "https://daylightng.com/reuben-abati-the-fallacies-of-a-prescient-analyst-by-rotimi-adebayo/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "abati",
            "southwest",
            "reuben",
            "know",
            "rotimi",
            "political",
            "analyst",
            "politics",
            "adebayo",
            "won",
            "race",
            "daylight",
            "osinbajo",
            "prescient",
            "fallacies",
            "president",
            "asiwaju"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "popular",
            "mobile",
            "bookmaker",
            "account",
            "page",
            "version",
            "1xbet",
            "place",
            "website",
            "launches",
            "offers",
            "convenient",
            "emerges",
            "site"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "drivers",
            "npa",
            "electronic",
            "amidst",
            "gridlock",
            "road",
            "trucks",
            "roads",
            "callup",
            "worsening",
            "truck",
            "ecall",
            "apapa",
            "system"
          ]
        }
      ]
    }
  }
}