{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "BREAKING: Bill Gates announces divorce from wife Melinda",
          "summary": "The Microsoft founder-turned philanthropist, Bill Gates, has announced a divorce from his wife, Melinda, after a 27-year marriage.\nThe announcement from one of the world’s wealthiest couples, with an estimated net worth of $130 billion, was made on Twitter on Monday.\n“We continue our work together at the foundation, but we no longer believe we can grow together as a couple in this phase of our lives,” a joint statement tweeted by Bill Gates read.\nThe two, who met in the late 1980s when Melinda joined Bill’s Microsoft firm, have three children.\nThey jointly run the Bill & Melinda Gates Foundation, which has spent billions fighting health-related causes.",
          "link": "https://punchng.com/breaking-bill-gates-announces-divorce-from-wife-melinda/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "worlds",
            "worth",
            "announces",
            "microsoft",
            "gates",
            "divorce",
            "breaking",
            "bill",
            "world",
            "work",
            "foundation",
            "wife",
            "melinda",
            "works"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Nigeria’ll collapse in 6 months time, Robert Clarke swears by his father’s grave",
          "summary": "Kindly Share This Story:Victor OgunyinkaSenior Advocate of Nigeria, Robert Clarke, has sworn by his father’s grave saying that Nigeria will collapse in six months time if care is not taken.\nThe small boys that looted under Sani Abacha set up political parties to help him retain power are part of the problems.\n“Nigeria was better in 1982 under Shehu Shagari than it is now in 2021…“Nigeria will collapse in six months’time if care is not take, I swear by my father’s grave,” he said.\nIt is instructive to note that the ballot box remains the vehicle of change in a democracy.\n“In this regard, self-centred individuals and groups are warned to stop engaging in acts inimical to the peace and sovereignty of this nation.",
          "link": "https://www.vanguardngr.com/2021/05/nigeriall-collapse-in-6-months-time-robert-clarke-swears-by-his-fathers-grave/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "robert",
            "warned",
            "nigeriall",
            "fathers",
            "security",
            "leaders",
            "change",
            "tolerate",
            "grave",
            "nigeria",
            "dss",
            "political",
            "trying",
            "swears",
            "clarke",
            "cause",
            "months",
            "collapse"
          ]
        },
        {
          "title": "Everyone connected with Umoren’s death will be punished — Gov Emmanuel",
          "summary": "The Governor who represented by Secretary to the State Government (SSG), Dr Emmanuel Ekuwem, expressed deep pain over the gruesome manner in which the innocent girl had gone out in search of a responsible means of livelihood met her untimely death.\nResponding on behalf of the family, the elder brother of the deceased, Mr Ukeme Umoren expressed deep pains over the loss of their sister who had just concluded her University education.\n“She decided to look for a job to make a living, to cater for her needs before leaving for the mandatory National service.\nI appeal to the state government to ensure that justice takes its course, by bringing all the perpetrators to book.\nVanguard News NigeriaKindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/05/everyone-connected-with-umorens-death-will-be-punished-gov-emmanuel/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "visit",
            "umoren",
            "death",
            "connected",
            "family",
            "emmanuel",
            "strategy",
            "share",
            "umorens",
            "punished",
            "gov",
            "secretary",
            "ssg",
            "state",
            "service",
            "governor"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "BREAKING: Bill, Melinda Gates marriage hit the rocks, part ways after 27 years",
          "summary": "Bill and Melinda Gates have announced they are divorcing after 27 years of marriage.\nThe couple, one of the most famous in the world, built a $127billion fortune.\nOn Monday, Gates, 65, announced their decision in a tweet.\nThe Microsoft founder said after a great deal of thought and a lot of work, “we have made the decision to end our marriage”.\nGates said they continue to share a belief in that mission and will continue to work together at the foundation.",
          "link": "https://dailypost.ng/2021/05/03/breaking-bill-melinda-gates-marriage-hit-the-rocks-part-ways-after-27-years/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "hit",
            "marriage",
            "couple",
            "continue",
            "decision",
            "gates",
            "thought",
            "breaking",
            "bill",
            "built",
            "world",
            "tweetthe",
            "work",
            "ways",
            "melinda",
            "rocks",
            "27",
            "announced"
          ]
        },
        {
          "title": "Lagos govt takes step to prevent COVID-19 third wave",
          "summary": "The Lagos State Government has said all its facilities have been placed on high alert, to ensure a third wave of COVID-19 does not happen in the state.\nAccording to Abayomi, it was important to be proactive, after they flattened the curve of the second wave.\nHe warned that a trigger for a third wave was likely to be importation of new COVID-19 strains from inbound travelers.\n“Currently, countries like India, Brazil, Argentina, Iraq, Qatar, Peru and Uruguay are being ravaged by a vicious third or fourth wave following a less active and insignificant second or third wave.\n“Whilst we commiserate with countries like these, it is important that we protect our environment and residents against this virus.",
          "link": "https://dailypost.ng/2021/05/03/lagos-govt-takes-step-to-prevent-covid-19-third-wave/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "cent",
            "abayomi",
            "prevent",
            "govt",
            "india",
            "takes",
            "second",
            "countries",
            "weeks",
            "wave",
            "step",
            "lagos",
            "covid19",
            "important",
            "strains"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Hit-and-run drivers kill husband, pregnant wife in Delta",
          "summary": "By Elo Edremoda, WarriA couple, Mr. and Mrs. Kingsley Akpor, was on Sunday evening knocked down by hit-and-run drivers opposite PTI Conference Centre, along the East-West Road in Uvwie council area of Delta state.\nThe Nation learnt that incident occurred around 8pm while they were crossing the expressway.\nIt was gathered the wife, Ajoke, was heavily pregnant and due for delivery of their first child this week.\nA source close to the deceased couple told The Nation that they were returning from a birthday celebration at PTI Conference Centre.\n“She was the one that did the makeup for the celebrant while the husband took the photographs of the party,” the source said.",
          "link": "https://thenationonlineng.net/hit-and-run-drivers-kill-husband-pregnant-wife-in-delta/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "couple",
            "learnt",
            "knocked",
            "kill",
            "rushed",
            "pti",
            "delta",
            "wife",
            "drivers",
            "husband",
            "makeup",
            "hitandrun",
            "pregnant",
            "source",
            "nation",
            "road"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Bandit, kidnappers now have monopoly of violence, Alaafin, Ooni tell FG",
          "summary": "By Lukman OlabiyiAlaafin of Oyo, Oba Lamidi Adeyemi, has flayed the Federal Government for allowing bandits and kidnappers have monopoly of violence.\nOba Adeyemi, who disclosed this in Lagos over the weekend during the 51st birthday celebration of Aare onakakanfo of Yoruba Land, Iba Gani Adams, said monopoly of violence which ought to be the prorogative of government has been assumed by bandits and kidnappers.\n“The monopoly of violence must be concentrated in government but regrettably we are not having that now.\n“Aare Gani Adams’ appointment is divine and based on merit.\nHe extolled the virtues of the Aare Onakakanfo, saying the traditional institution would always support him in ensuring that the South West is safe.",
          "link": "https://www.sunnewsonline.com/bandit-kidnappers-now-have-monopoly-of-violence-alaafin-ooni-tell-fg/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "adams",
            "violence",
            "gani",
            "ooni",
            "safe",
            "fg",
            "south",
            "tell",
            "bandit",
            "onakakanfo",
            "oba",
            "monopoly",
            "west",
            "yoruba",
            "alaafin",
            "kidnappers"
          ]
        },
        {
          "title": "Fidelity Bank targets Tier-1 bank status by 2025",
          "summary": "By Chinwendu ObienyiFidelity Bank Plc has revealed plans to attain the Tier-1 bank status in Nigeria and achieve 7.5 per cent of total market share of deposits by 2025.\nThis translates to a dividend yield of 9.2 per cent, making it the fourth most rewarding bank to investors in the Nigerian Capital Market (NCM).\nAddressing shareholders at the bank’s 33rd Annual General Meeting (AGM) in Lagos on Friday, the Chief Executive Officer, Fidelity Bank Plc, Nneka Onyeali-Ikpe, announced her management plans to make the bank one of Nigeria’s Tier 1 banks by 2025.\nOnyeali-Ikpe noted that Fidelity Bank’s local currency deposits grew by 49.6 per cent to N1,400.8 billion and constituted 82.5 percent of total customer deposits while foreign currency deposits grew by 3.3 percent to N298.2 billion accounting for 17.5 percent of total deposits.\nEarlier in his opening remark, the Chairman, Board of Directors, Fidelity Bank Plc, Mustapha Chike-Obi, reassured shareholders at the AGM that the bank would maintain the high corporate governance standard and also ensure the bank continued in its growth trajectory in the years ahead.",
          "link": "https://www.sunnewsonline.com/fidelity-bank-targets-tier-1-bank-status-by-2025/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "bank",
            "deposits",
            "continue",
            "status",
            "2025",
            "plc",
            "targets",
            "total",
            "tier1",
            "banks",
            "shareholders",
            "management",
            "share",
            "market",
            "fidelity"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Breaking: Bill and Melinda Gates Announce Divorce",
          "summary": "Bill and Melinda Gates have announced dicorve after 27 years of marriage, saying “we no longer believe we can grow together as a couple.”Announcing their divorce in a joint statement tweeted on Monday, Bill and Melinda said: “After a great deal of thought and a lot of work on our relationship, we have made the decision to end our marriage”.\nSee tweet linkhttps://twitter.com/BillGates/status/1389316412259270657?s=08Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/breaking-bill-and-melinda-gates-announce-divorce/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "tweeted",
            "saying",
            "marriage",
            "gates",
            "thought",
            "relationship",
            "divorce",
            "breaking",
            "bill",
            "statement",
            "work",
            "marriagesee",
            "melinda",
            "announce"
          ]
        },
        {
          "title": "Bauchi Raises the Alarm over Influx of Bandits from Yobe",
          "summary": "* Says 5 suspects arrested for vandalising communication mast in preparation for attackBy Segun AwofadejiBauchi State Government has raised the alarm over the influx of bandits from neighboring Yobe state.\nIt said the bandits had infiltrated four local governments.\nTHISDAY reports that the gateway local government areas are Gamawa, Dambam, Darazo and Zaki, which are sharing boundaries with Yobe state and close to Geidam, recently seized by Boko Haram militants.\nThe government also announced the arrest of five bandits who vandalised a mast belonging to MTN in Gamawa local government area in their bid to launch attack.\nThe SSG however assured that the state government will ensure that the joint operations of the security agencies will be intensified, particularly air surveillance around the affected LGAs.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/bauchi-raises-the-alarm-over-influx-of-bandits-from-yobe/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "security",
            "bauchi",
            "raises",
            "yobe",
            "local",
            "gamawa",
            "area",
            "alarm",
            "ssg",
            "lgas",
            "state",
            "influx",
            "bandits"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Terrorists Raiding Four Local Councils In Bauchi",
          "summary": "Boko Haram insurgents from neighbouring Yobe State have infiltrated at least four local government areas of Bauchi State, destroying some facilities.\nAjiri is a community in the Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the Borno State capital.\nThe attack came a few days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.",
          "link": "http://saharareporters.com/2021/05/03/breaking-boko-haram-terrorists-raiding-four-local-councils-bauchi",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "terrorists",
            "bauchi",
            "raiding",
            "gathered",
            "breaking",
            "borno",
            "military",
            "area",
            "gun",
            "state",
            "councils",
            "insurgents",
            "local",
            "boko",
            "islamic",
            "haram"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Terrorists Raiding Four Local Councils In Bauchi",
          "summary": "Boko Haram insurgents from neighbouring Yobe State have infiltrated at least four local government areas of Bauchi State, destroying some facilities.\nAjiri is a community in the Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the Borno State capital.\nThe attack came a few days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.",
          "link": "http://saharareporters.com/2021/05/03/breaking-boko-haram-terrorists-raiding-four-local-councils-bauchi#disqus_thread",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "terrorists",
            "bauchi",
            "raiding",
            "gathered",
            "breaking",
            "borno",
            "military",
            "area",
            "gun",
            "state",
            "councils",
            "insurgents",
            "local",
            "boko",
            "islamic",
            "haram"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "BREAKING: Bill and Melinda Gates announce divorce -- after 27 years",
          "summary": "Bill Gates, co-founder of Microsoft, and his wife, Melinda, have announced plans to end their marriage.\nAdvertisementThe couple, who posted the news on their personal Twitter handles on Monday, said the decision was reached after due consideration.\nThe couple have been together for 27 years.\nMore to follow…",
          "link": "https://www.thecable.ng/breaking-bill-and-melinda-gates-announce-divorce-after-27-years",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "couple",
            "yearsmore",
            "microsoft",
            "gates",
            "divorce",
            "breaking",
            "bill",
            "reached",
            "plans",
            "wife",
            "melinda",
            "personal",
            "27",
            "posted",
            "twitter",
            "announce"
          ]
        },
        {
          "title": "Sanwo-Olu: Lagos gives many Nigerians hope -- we'll ensure safety for all",
          "summary": "Babajide Sanwo-Olu, governor of Lagos, says his administration will stop at nothing to ensure that the state remains safe for all residents.\nThe governor added that his administration will deliver on the six-pillar developmental agenda for “Greater Lagos”.\nLagos is a state that gives hope to a lot of Nigerians.\nLagos is a state that gives hope to all of Nigeria.\nI can assure you with every sense of commitment that we will stop at nothing to make sure that Lagos remains safe and secure.",
          "link": "https://www.thecable.ng/sanwo-olu-lagos-gives-many-nigerians-hope-well-ensure-safety-for-all",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "administration",
            "security",
            "gives",
            "safe",
            "remains",
            "sanwoolu",
            "hope",
            "lagos",
            "safety",
            "ensure",
            "know",
            "stop",
            "state",
            "nigerians",
            "sure"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Designing and building sustainable commercial spaces in Nigeria",
          "summary": "Their office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts.\nInnovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\nLike I said, we had a really really tight deadline.\nElements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria.",
          "link": "https://techcabal.com/2021/05/03/designing-and-building-sustainable-commercial-spaces-in-nigeria/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "design",
            "building",
            "kobo360",
            "wanted",
            "spaces",
            "work",
            "office",
            "nigeria",
            "sustainable",
            "space",
            "really",
            "way",
            "commercial",
            "company",
            "designing",
            "centre"
          ]
        },
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "bank",
            "enforces",
            "emefiele",
            "banks",
            "board",
            "cbn",
            "skye",
            "otudeko",
            "sanusi",
            "took",
            "sacking",
            "governor",
            "tradition",
            "bruised"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Obaseki recommits to press freedom, charges journalists on peace, development journalism – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991.\nIt is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.",
          "link": "http://nigerianobservernews.com/2021/05/obaseki-recommits-to-press-freedom-charges-journalists-on-peace-development-journalism/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "information",
            "freedom",
            "journalists",
            "nigerian",
            "obaseki",
            "observer",
            "press",
            "world",
            "development",
            "public",
            "recommits",
            "challenges",
            "media",
            "journalism",
            "governor",
            "peace",
            "day"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "web",
            "jan",
            "19",
            "immediate",
            "underaged",
            "movement",
            "highways",
            "outlawed",
            "prohibited",
            "nightgrazing",
            "register",
            "wish",
            "cattle"
          ]
        },
        {
          "title": "Bill Gates and Melinda Gates are separating after 27 years of marriage",
          "summary": "OBINNA EZUGWUMicrosoft co-founder on Monday, said in a statement posted via his twitter page on Monday that he and his wife, Melinda Gates, will be splitting up after 27 years.\nBill Gates owns 1.37% of Microsoft’s outstanding shares, which are worth more than $26 billion, according to FactSet.\nHe began spending more time on the nonprofit Bill and Melinda Gates Foundation alongside Melinda Gates.\nThe two got married in Hawaii in 1994 after Bill Gates had weighed the pros and cons on a blackboard, according to Reuters.\nBill Gates and Jeff Bezos are among the world’s richest people, and Amazon and Microsoft compete in the cloud computing business",
          "link": "https://hallmarknews.com/bill-gates-and-melinda-gates-are-separating-after-27-years-of-marriage/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "marriage",
            "27",
            "microsofts",
            "microsoft",
            "gates",
            "statement",
            "bill",
            "world",
            "work",
            "foundation",
            "wife",
            "melinda",
            "separating"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "FOREIGN: Biden To Begin Reuniting Families Separated At Border",
          "summary": "The administration of United States President Joe Biden has said that four families that were separated at the Mexico border during Donald Trump’s presidency will be reunited this week.\nHomeland Security Secretary Alejandro Mayorkas called Monday’s announcement “just the beginning” of a broader effort by the administration to reunite separated family members in the US.\nTwo of the four families include mothers who were separated from their children in late 2017, one Honduran and another Mexican, Mayorkas said, declining to detail their identities.\nThe Biden administration is doing its own count going back to Trump’s inauguration in January 2017 and, according to Brane, believes more than 1,000 families remain separated.\nWhile family separation under “zero-tolerance” ended in June 2018 under court order and shortly after Trump reversed course, Biden has repeatedly assailed the practice as an act of cruelty.",
          "link": "https://leadership.ng/biden-to-begin-reuniting-families-separated-at-border/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "families",
            "children",
            "administration",
            "parents",
            "border",
            "mayorkas",
            "family",
            "reuniting",
            "separated",
            "foreign",
            "biden",
            "begin",
            "trump",
            "reunite"
          ]
        },
        {
          "title": "BREAKING: Microsoft Founder, Bill Gates, Wife Divorce After 27 Years Of Marriage",
          "summary": "ADVERTISEMENTBillionaire founder of Microsoft, Bill Gates and wife, Melinda have announced getting divorced after 27 years of marriage.\nThey made the announcement on Monday though Bill’s Twitter account, saying, “we no longer believe we can grow together as a couple.”They further wrote: “After a great deal of thought and a lot of work on our relationship, we have made the decision to end our marriage.”The two met in the late 1980s when Melinda joined Bill’s Microsoft firm and they have three children together.\nBefore now, they jointly run the Bill & Melinda Gates Foundation.",
          "link": "https://leadership.ng/breaking-microsoft-founder-bill-gates-wife-divorce-after-27-years-of-marriage/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "marriage",
            "microsoft",
            "gates",
            "divorce",
            "breaking",
            "bill",
            "wrote",
            "bills",
            "work",
            "wife",
            "melinda",
            "27",
            "togetherbefore",
            "twitter",
            "founder"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Buhari appoints Dikko head of new agency to control small arms, weapons",
          "summary": "Nigeria President Muhammadu Buhari has appointed Rtd Major General A.M. Dikko as the pioneer coordinator of the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThe presidency in a statement said Buhari approved the establishment of NCCSALW on Monday.\nThe agency will be domiciled in the Office of the National Security Adviser.\nThe NCCSALW replaces the defunct Presidential Committee on Small Arms and Light Weapons and will serve as the institutional mechanism for policy guidance, research and monitoring of all aspects of small arms and light weapons (SALW) in Nigeria.\nHe was a Course Director at the Kofi Annan International Peacekeeping Centre and Chief Instructor of the Nigerian Army Peacekeeping Centre.",
          "link": "https://dailytimes.ng/buhari-appoints-dikko-head-of-new-agency-to-control-small-arms-weapons/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "appoints",
            "peacekeeping",
            "national",
            "control",
            "salwthe",
            "presidency",
            "arms",
            "buhari",
            "dikko",
            "nigeria",
            "salw",
            "head",
            "small",
            "light",
            "agency",
            "weapons",
            "centre"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Ibori loot: Malami explains delay in retrieving £4.2m from UK",
          "summary": "The Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami, has explained the delay in the final retrieval of the £4.2million Ibori loot from the United Kingdom (UK) was as a result of some logistic challenges currently being addressed.\nThe British High Commissioner to Nigeria, Ms. Catriona Laing, announced on March 9 at a meeting with the AGF that her country has concluded plans to return to Nigeria money recovered from friends and family members of the former governor of Delta State, James Ibori.\nLaing, who said the return of the £4.2m was the first of such from the UK to Nigeria, under a memorandum of understanding signed between both countries in 2016, was however silent on the actual date the money would be released.\nIn a statement on Monday by his Special Assistant on Media, Dr. Umar Jibril Gwandu, Malami said the Federal Government was working tirelessly to ensure the return of looted Nigerian assets kept outside the country’s territorial boundariesMalami assured that any moment from now, Nigeria would receive the Ibori loot, explaining sometimes, when a country transfers funds, it may take a little bit more time than expected due to some documentations.\nNationShare this: TwitterFacebookLike this: Like Loading...",
          "link": "https://daylightng.com/ibori-loot-malami-explains-delay-in-retrieving-4-2m-from-uk/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "malami",
            "loot",
            "42m",
            "money",
            "ibori",
            "agf",
            "country",
            "uk",
            "explains",
            "nigeria",
            "return",
            "working",
            "delay",
            "retrieving"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Importance Of World Press Freedom Day",
          "summary": "May 3, 2021 161As people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\nHistory of World Press Freedom DayThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.",
          "link": "https://bizwatchnigeria.ng/importance-of-world-press-freedom-day/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "freedom",
            "journalists",
            "countries",
            "united",
            "world",
            "press",
            "importance",
            "nigeria",
            "themed",
            "territories",
            "day"
          ]
        },
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "page",
            "1xbet",
            "site",
            "popular",
            "convenient",
            "account",
            "mobile",
            "emerges",
            "offers",
            "website",
            "launches",
            "bookmaker",
            "version",
            "place"
          ]
        }
      ]
    }
  }
}