{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "There’s nexus between educational backwardness, overpopulation, poverty, insecurity — Ilori",
          "summary": "Kindly Share This Story:— Gives out educational materials to 1500 indigent students in OndoDayo Johnson AkureThe special adviser to the Minister on the interior, Hon Bola llori has said that there is a nexus between educational backwardness, overpopulation, poverty, and insecurity.\nIiori said this in Ondo city during the distribution of educational materials to 1500 indigent students in both primary and secondary schools to mark his birthday celebration.\n” A deep reflection on the insecurity narrative in Nigeria will reveal a clear nexus between educational backwardness, overpopulation, poverty, and insecurity.\n“For our school children of indigent background, keeping hope alive is more difficult.\nThe Minister of State, Niger Delta, Chief Tayo Alasoadura told the school children that there was no easy way to the top than to be diligent and forthright.",
          "link": "https://www.vanguardngr.com/2021/04/theres-nexus-between-educational-backwardness-overpopulation-poverty-insecurity-ilori/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "school",
            "poverty",
            "backwardness",
            "overpopulation",
            "insecurity",
            "education",
            "theres",
            "community",
            "ilori",
            "nexus",
            "world",
            "educational",
            "children",
            "indigent",
            "students"
          ]
        },
        {
          "title": "Wike imposes night curfew at all Rivers’ land borders",
          "summary": "Kindly Share This Story:By Davies Iheamnachor, Port-HarcourtThe Governor of Rivers State, Chief Nyesom Wike, has imposed night curfew at all entry and exit points into the state, Abia, Akwa Ibom, Bayelsa, and Imo States.\nWike in State broadcast on Tuesday said the curfew which takes effect from Wednesday night, is necessitated by the recent security breaches and deadly attacks on security personnel by yet-to-be-identified gunmen.\nHe said: “The Government of Rivers State has decided to restrict night movements into and out of the State from the land borders of the State.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow (Wednesday) 28 April 2021 until further notice.\n“Neither do we also know the motives of the deranged characters or group behind these senseless assaults on our State and the lives of security operatives working to keep us safe and secure.",
          "link": "https://www.vanguardngr.com/2021/04/wike-imposes-night-curfew-at-all-rivers-land-borders/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "curfew",
            "imposes",
            "security",
            "wike",
            "view",
            "state",
            "rivers",
            "borders",
            "land",
            "night",
            "agencies",
            "statethe",
            "governor"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Nigerian celebrities cry out to Buhari govt",
          "summary": "Some Nigerian celebrities have urged President Muhammadu Buhari to proffer immediate solutions to insecurity in the country.\nBanky W in his outrage said ‘unfit for office persons were calling the shots in Nigeria.\nOther celebrities also vented their frustration over the nation’s security situation on Twitter.\n“We don talk, We don taya, We don pray we don taya.\nFrom Anambra State to Kaduna, Yobe, Niger and Lagos States, there were reports of violence and bloodshed.",
          "link": "https://dailypost.ng/2021/04/27/insecurity-nigerian-celebrities-cry-out-to-buhari-govt/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "security",
            "unfit",
            "shots",
            "cry",
            "don",
            "celebrities",
            "nigeria",
            "insecurity",
            "state",
            "reports",
            "govt",
            "violence",
            "uti",
            "situation",
            "nigerian",
            "buhari"
          ]
        },
        {
          "title": "Igbo women's group decry high insecurity in Southeast",
          "summary": "A women’s group, Mothers of Ndigbo has decried the high level of insecurity in the Southeast, calling on the federal government to quickly wade in and stop the incessant killings.\nThe group which consists of Igbo women from the age of 60 and above at a press conference on Tuesday said the insecurity in the zone has gotten to a climax.\nThe group said since 2015, there have been systematic attacks on peace and tranquillity which has existed in the region over the years, with attendant economic hardships on citizens.\nThey said the attacks and other insecurity problem has forced the zone into poverty according to the National Bureau of Statistics’ rating.\n“All killer herdsmen, clandestinely aided and protected by federal security forces who have now permanently settled in farmlands, bushes and forests in our land and our key neighbouring states must be moved out and relocated back to wherever they were brought from.”",
          "link": "https://dailypost.ng/2021/04/27/igbo-womens-group-decry-high-insecurity-in-southeast/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "security",
            "southeast",
            "federal",
            "womens",
            "high",
            "south",
            "group",
            "insecurity",
            "region",
            "zone",
            "decry",
            "watch",
            "situation",
            "igbo"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "BREAKING: Pandemonium as gunmen storm Ebonyi community",
          "summary": "By Ogochukwu Anioke, AbakalikiThere was pandemonium on Tuesday in Onueke, Ezra South local government area of Ebonyi when gunmen stormed the town shooting sporadically and robbing some businesses.\nThe gunmen, numbering about five, it was gathered, had trailed a customer to a bank in the area.\nThey shot sporadically in the air near the bank causing customers and staff to scamper in various directions for safety.\nA source, who was at the bank, said the gunmen shot the man they trailed to the bank.\nHowever, the gunmen were said to have moved from the bank to some businesses in the area which they robbed.",
          "link": "https://thenationonlineng.net/breaking-pandemonium-as-gunmen-storm-ebonyi-community/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "gunmen",
            "shot",
            "ebonyi",
            "community",
            "pandemonium",
            "nearby",
            "robbing",
            "source",
            "bank",
            "moved",
            "trailed",
            "away",
            "breaking",
            "storm",
            "sporadically"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity",
          "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later",
          "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "security",
            "summon",
            "urged",
            "summoned",
            "reps",
            "rising",
            "house",
            "insecurity",
            "state",
            "speaker",
            "session",
            "nsa",
            "countrythe",
            "chiefs",
            "service",
            "services",
            "breaking"
          ]
        },
        {
          "title": "BREAKING: Federal high court Abakaliki on fire",
          "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.",
          "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "court",
            "federal",
            "went",
            "high",
            "state",
            "located",
            "hours",
            "highway",
            "gutted",
            "abakaliki",
            "later",
            "breaking",
            "reportdetails",
            "tuesdaythe"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Insecurity: Seek Help, Saraki Tells Buhari",
          "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "president",
            "security",
            "solutions",
            "state",
            "seek",
            "insecurity",
            "statement",
            "national",
            "issue",
            "help",
            "need",
            "saraki",
            "tells",
            "finding",
            "buhari"
          ]
        },
        {
          "title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges",
          "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "security",
            "president",
            "seeks",
            "blinken",
            "challenges",
            "united",
            "nigeria",
            "states",
            "tackle",
            "africa",
            "climate",
            "countries",
            "paris",
            "help",
            "buhari",
            "meeting"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects",
          "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.",
          "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "toro",
            "villages",
            "exposed",
            "posted",
            "internet",
            "pictures",
            "saharareporters",
            "lawmaker",
            "deep",
            "group",
            "lawal",
            "projects",
            "apc",
            "downloaded",
            "constituency",
            "wells",
            "towns"
          ]
        },
        {
          "title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects",
          "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.",
          "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects#disqus_thread",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "toro",
            "villages",
            "exposed",
            "posted",
            "internet",
            "pictures",
            "saharareporters",
            "lawmaker",
            "deep",
            "group",
            "lawal",
            "projects",
            "apc",
            "downloaded",
            "constituency",
            "wells",
            "towns"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Tinubu: Every nation will go through difficult times -- we must unite to succeed",
          "summary": "Bola Tinubu, national leader of the All Progressives Congress (APC), says Nigeria needs unity to surmount the current security challenges.\nAnd yes, every nation will go through these curves and difficult times.\nThere’s no president or leader that will want his nation fractured by tribalism, religious differences and all that.\nIt calls for serious management and serious evaluation and dialogue once in a while.”Speaking on the rumoured unhealthy relationship between him and the president, Tinubu said he maintains a cordial relationship with Buhari.\nWe’ll continue to work for a better Nigeria and that’s what you need,” Tinubu said.",
          "link": "https://www.thecable.ng/tinubu-every-nation-will-go-through-difficult-times-we-must-unite-to-succeed",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "president",
            "unity",
            "unite",
            "relationship",
            "unhealthy",
            "tinubu",
            "nation",
            "succeed",
            "times",
            "difficult",
            "work",
            "country",
            "dont",
            "nigeria"
          ]
        },
        {
          "title": "Insecurity: Buni asks Yobe residents to expose bad eggs 'even if they are relatives'",
          "summary": "Mai Mala Buni, governor of Yobe, has asked residents to expose “bad eggs” in their midst amid the growing insecurity in the state.\nAdvertisementSpeaking during a security meeting in Damaturu on Tuesday, the governor said residents must report suspicious movements even when they concern their relatives.\nAdvertisementBumi condemned the attack, saying that Yobe’s security situation needs quick response and reassessment.\n“The sad events in Geidam call for quick response and reassessment of the security situation in our respective communities and the state generally,” he said.\n“It is our responsibility to report suspicious movements in or near our communities.",
          "link": "https://www.thecable.ng/insecurity-buni-asks-yobe-residents-to-expose-bad-eggs-even-if-they-are-relatives",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "security",
            "asks",
            "communities",
            "state",
            "situation",
            "insecurity",
            "response",
            "quick",
            "expose",
            "residents",
            "eggs",
            "buni",
            "yobe",
            "relatives",
            "bad",
            "suspicious",
            "report",
            "movements"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria",
          "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.",
          "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "hospitaltohome",
            "plan",
            "healthcare",
            "medical",
            "communities",
            "inoyo",
            "health",
            "nwokoye",
            "bringing",
            "clafiya",
            "itoro",
            "rural",
            "services",
            "access",
            "nigeria",
            "jennie"
          ]
        },
        {
          "title": "Can NIBSS save BVN from bank scams and be a fair umpire?",
          "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.",
          "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "bvn",
            "banks",
            "fair",
            "data",
            "customers",
            "nigerias",
            "umpire",
            "fintechs",
            "bank",
            "nibss",
            "access",
            "scams",
            "save",
            "number"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "video",
            "sale",
            "come",
            "soldiers",
            "force",
            "govt",
            "sent",
            "kidnapped",
            "appealing",
            "appeal",
            "student",
            "yusuf",
            "rescue",
            "dont",
            "free",
            "students"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "siblings",
            "phones",
            "arrest",
            "peddlers",
            "drug",
            "decomposing",
            "suspected",
            "delta",
            "suspects",
            "recovered",
            "led",
            "corpses",
            "abraka",
            "recover",
            "bodies",
            "warri",
            "car"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Hoodlums set Federal High Court, Abakaliki ablaze – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Unidentified hoodlums were reportedly set ablazed the premises of the Federal High Court in Abakaliki, Ebonyi State in the early hours of Tuesday.\nThe Police Public Relations Officer, PPRO, of Ebonyi, Mrs Loveth Odah, who confirmed the incident said that no arrest had been made.\n“Hoodlums in the early hours of Tuesday wielding dangerous weapons stormed the Federal High Court premises and burnt part of the building.\n“The Commissioner of Police, Mr Aliyu Garba, has promised to arrest the perpetrators and bring them to justice,” Odah said.\nMeanwhile, a detachment of the Nigerian Mobile Police, MOPOL, has been drafted to the area to secure the court premises.",
          "link": "https://nigerianobservernews.com/2021/04/hoodlums-set-federal-high-court-abakaliki-ablaze/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "investigation",
            "court",
            "ablaze",
            "federal",
            "arrest",
            "odah",
            "high",
            "abakaliki",
            "ebonyi",
            "observer",
            "hoodlums",
            "hours",
            "premises",
            "set",
            "early",
            "nigerian"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "cattle",
            "register",
            "prohibited",
            "outlawed",
            "jan",
            "wish",
            "nightgrazing",
            "underaged",
            "movement",
            "immediate",
            "19",
            "web",
            "highways"
          ]
        },
        {
          "title": "Channels TV has apologised for breach of broadcasting code – NBC",
          "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised over its breach of broadcasting code.\nAccording to her, the letter is asking Channels TV to explain why it gave credence to an organisation that was already proscribed by the Federal Government.\n“It is possible to bridge the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying we apologise, we did wrong.\n“And I will be able to communicate to the media about it but this letter that went to Channels TV is our way of regulating the broadcasting industry.\nShe said that in the exercise of its power as the regulatory body, NBC wrote a letter asking Channels TV to explain why it gave credence to the spokesman of the proscribed organisation.",
          "link": "https://hallmarknews.com/channels-tv-has-apologised-for-breach-of-broadcasting-code-nbc/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "nbc",
            "public",
            "particular",
            "bridge",
            "broadcasting",
            "apologised",
            "channels",
            "station",
            "code",
            "letter",
            "say",
            "breach",
            "tv"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Tabarbarewar Tsaro: Majalisar Wakilai Ta Bukaci A Sanya Dokar Ta-baci",
          "summary": "",
          "link": "https://hausa.leadership.ng/tabarbarewar-tsaro-majalisar-wakilai-ta-bukaci-a-sanya-dokar-ta-baci/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "tabaci",
            "dokar",
            "tsaro",
            "wakilai",
            "majalisar",
            "sanya",
            "bukaci",
            "ta",
            "tabarbarewar"
          ]
        },
        {
          "title": "Tsaro: Ba Za Mu Dagawa ‘Yan Bindiga Kafa Ba, Inji El-Rufai",
          "summary": "",
          "link": "https://hausa.leadership.ng/tsaro-ba-za-mu-dagawa-yan-bindiga-kafa-ba-inji-el-rufai/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "ba",
            "za",
            "tsaro",
            "mu",
            "inji",
            "yan",
            "elrufai",
            "bindiga",
            "kafa",
            "dagawa"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": [
        {
          "title": "’Yan bindiga sun saki sabon bidiyon daliban Kwalejin Afaka",
          "summary": "",
          "link": "https://aminiya.dailytrust.com/yan-bindiga-sun-saki-sabon-bidiyon-daliban-kwalejin-afaka",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "yan",
            "kwalejin",
            "daliban",
            "saki",
            "bidiyon",
            "afaka",
            "bindiga",
            "sabon"
          ]
        },
        {
          "title": "‘Kauyukan Neja 42 ne ke karkashin ikon Boko Haram’",
          "summary": "",
          "link": "https://aminiya.dailytrust.com/kauyukan-neja-42-ne-ke-karkashin-ikon-boko-haram",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "ke",
            "ne",
            "boko",
            "kauyukan",
            "haram",
            "neja",
            "42",
            "karkashin",
            "ikon"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Photos: Nollywood star, Ejike Asiegbu visits DAYLIGHT Dome",
          "summary": "You might also like",
          "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "photos",
            "dome",
            "daylight",
            "visits",
            "star",
            "nollywood",
            "ejike",
            "asiegbu"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}