{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Water scarcity in Borum: Community digs tube wells to meet water needs",
          "summary": "READ ALSO:So doing, they were able to restore the water facility of the clinic at least pending the government’s intervention to resolve the community’s water needs.\nIn contrast, in the rural areas, some 38% have access to a basic water service, 26% to limited water service, and an interesting 37% have no water service.\nIn hospitals or health centers around Nigeria, the report shows that 92% have an improved water source, while 8% have no water source.\nUNICEF defines Basic water supply as water from an Improved source within 30 minutes round trip collection time; while Limited water supply is water from an improved source over 30 minutes round trip collection time; Unimproved water supply on the other hand is water from an unimproved source that does not protect against contamination.\n“In 2017, 785 million people still lack a basic water service and among them 144 million people still collected drinking water directly from rivers, lakes and other surface water sources.",
          "link": "https://www.vanguardngr.com/2021/04/water-scarcity-in-borum-community-digs-tube-wells-to-meet-needs/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "borum",
            "tube",
            "wells",
            "digs",
            "phc",
            "health",
            "supply",
            "boreholes",
            "water",
            "facility",
            "scarcity",
            "service",
            "community",
            "source",
            "meet",
            "needs"
          ]
        },
        {
          "title": "IYC urged to shun planned protest over NDDC board",
          "summary": "Any attempt to put the board in place without concluding the ongoing investigations will derail the forensic audit.\n“As a former IYC President, I also want the board to be inaugurated.\nBut I have since observed that having a board has never been the problems of the NDDC.\nIf at the end of the audit, we have a responsible and accountable NDDC, then it is worth the wait.\nI urge all stakeholders and our Ijaw Youths to exercise more patience and allow the conclusion of this audit.",
          "link": "https://www.vanguardngr.com/2021/04/iyc-urged-to-shun-planned-protest-over-nddc-board/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "audit",
            "commission",
            "planned",
            "ijaw",
            "iyc",
            "protest",
            "board",
            "shun",
            "ongoing",
            "youths",
            "urged",
            "akwa",
            "nddc",
            "president"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: US AFRICOM will recolonise, turn Africa into Syria, Korea",
          "summary": "President Muhammadu Buhari has been warned against his recent call for the United States to relocate its US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, close to the Theatre of Operation.\nBuhari admonished the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\nBut Shehu Sani, a former lawmaker from Kaduna central senatorial district, described the plea as ‘unconscionable,’ and an open invitation for recolonization of Africa.\nThe call for the US to relocate its @USAfricaCommand HQ to Africa is unconscionable,” he tweeted.\nAccording to Sani, a lawmaker of the 8th national assembly, “The President’s call for World powers military HQ on African Soil is an open invitation for recolonization of Africa.",
          "link": "https://dailypost.ng/2021/04/28/insecurity-us-africom-will-recolonise-turn-africa-into-syria-korea-shehu-sani-warns-buhari/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "africom",
            "tell",
            "open",
            "korea",
            "sani",
            "recolonise",
            "relocate",
            "security",
            "africa",
            "hq",
            "warned",
            "insecurity",
            "syria",
            "turn",
            "recolonization",
            "unconscionable"
          ]
        },
        {
          "title": "BREAKING: Resign, Nigeria boiling",
          "summary": "Emmanuel Chukwuma, on Wednesday, asked the administration of President Muhammadu Buhari to leave the Government.\nArchbishop Chukwuma, at a press briefing to mark his 31st Episcopal ordination, said Buhari Government should step aside if it cannot pull the country out of the present security quagmire.\nHe said Nigerians had lost total confidence in Buhari’s administration and for that he should consider stepping aside to avoid pushing the country into a coup situation.\n“They should not move this country to coup situation.”He added that, “the Federal Government under Buhari has failed the nation, and we have no confidence any more on them.\n“We have lost confidence in the economy, we have lost confidence in the political system, we have lost confidence in governance, we have lost confidence in security and something must be done.",
          "link": "https://dailypost.ng/2021/04/28/breaking-resign-nigeria-boiling-archbishop-chukwuma-to-buhari/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "country",
            "resign",
            "confidence",
            "boiling",
            "aside",
            "buhari",
            "present",
            "nigeria",
            "coup",
            "chukwuma",
            "security",
            "breaking",
            "lost",
            "leave"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "VIDEO: Bandits release new video of abducted Kaduna students",
          "summary": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator.",
          "link": "http://community.thenationonlineng.net/forum/video-bandits-release-new-video-of-abducted-kaduna-students",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "kaduna",
            "nation",
            "contact",
            "system",
            "hello",
            "bandits",
            "abducted",
            "communityplease",
            "students",
            "newspaper",
            "enable",
            "need",
            "video",
            "release",
            "settings",
            "javascript"
          ]
        },
        {
          "title": "Teni: It had to be Davido",
          "summary": "Singer, songwriter and entertainer Teniola Apata, popularly known as Teni reveals in a live chat why she featured just Davido in her very first album.\nHer debut album ‘WONDALAND’ was crafted for over two years in cities like London, New York, Orlando, Ondo, Lagos and Abuja; and features guest appearances from DMW boss, Davido.\nWhen asked why she featured just one person in her 17-track album, the talented singer who has won quite a number of awards excitedly said: “It had to be Davido.\nDavido is such an amazing guy and you know…Big ups to everybody else, cause everybody else shows me love.\n“But David is special because I’ve known David since Atlanta.",
          "link": "http://community.thenationonlineng.net/forum/teni-it-had-to-be-davido",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "youre",
            "david",
            "known",
            "words",
            "everybody",
            "featured",
            "album",
            "singer",
            "york",
            "davido",
            "teni"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Buhari presides over 43rd virtual cabinet meeting",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is presiding over the 43rd virtual meeting of the Federal Executive Council (FEC) at the First Lady Conference Room, Presidential Villa, Abuja.\nVice President Yemi Osinbajo, Secretary to the Government of the Federation Boss Mustapha and Chief of Staff to the President Ibrahim Gambari are physically attending the meeting, which started at 10:00 am.\nSeven ministers are physically attending the meeting.\nThey include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed; Justice, Abubakar Malami and Foreign Affairs, Geoffery Onyeama.\nThe Head of Service of the Federation, Dr. Folasade Yemi-Esan and other Ministers are participating in the weekly cabinet meeting from their various offices in Abuja.",
          "link": "https://www.sunnewsonline.com/buhari-presides-over-43rd-virtual-cabinet-meeting/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "meeting",
            "43rd",
            "buhari",
            "ministers",
            "physically",
            "federal",
            "presides",
            "attending",
            "federation",
            "affairs",
            "cabinet",
            "minister",
            "virtual",
            "mohammed",
            "president"
          ]
        },
        {
          "title": "Boko Haram may overrun Abuja, Senators warn",
          "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.",
          "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "senators",
            "senate",
            "communities",
            "niger",
            "abuja",
            "president",
            "target",
            "warn",
            "terrorists",
            "overrun",
            "haram",
            "state",
            "boko"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": []
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course",
          "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.",
          "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "school",
            "uk",
            "st",
            "resources",
            "professorship",
            "thomasabecket",
            "honorary",
            "management",
            "university",
            "governor",
            "flaunts",
            "peace",
            "building",
            "nonexistent",
            "course",
            "kogi",
            "human",
            "nondegeee"
          ]
        },
        {
          "title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course",
          "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.",
          "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "school",
            "uk",
            "st",
            "resources",
            "professorship",
            "thomasabecket",
            "honorary",
            "management",
            "university",
            "governor",
            "flaunts",
            "peace",
            "building",
            "nonexistent",
            "course",
            "kogi",
            "human",
            "nondegeee"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Osinbajo: Value4Dairy consortium set to boost domestic milk production",
          "summary": "Vice-President Yemi Osinbajo says the Value4Dairy consortium, a group of five global players in the dairy industry, will increase domestic milk production capacity.\nAdvertisementThe consortium is made up of FrieslandCampina WAMCO, URUS, Barenbrug and Agrifirm.\nThe CBN, however, exempted companies that have commenced investments in local milk production as part of the bank’s backward integration plan.\nAdvertisementSpeaking at the launch of the consortium on April 20, Osinbajo commended the commitment of the companies to improving local production of milk and other dairy products.\nAdvertisementHe said the consortium brings to the dairy sector specialised milk collection and processing (FrieslandCampina WAMCO), better breeding (URUS), proper roughage production (Barenbrug) and fitting animal feed (Agrifirm).",
          "link": "https://www.thecable.ng/osinbajo-value4dairy-consortium-set-to-boost-domestic-milk-production",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "consortium",
            "wamco",
            "milk",
            "osinbajo",
            "frieslandcampina",
            "industry",
            "dairy",
            "companies",
            "boost",
            "set",
            "sector",
            "domestic",
            "production",
            "value4dairy",
            "local"
          ]
        },
        {
          "title": "Saraki to Buhari: Seeking help to tackle insecurity not a sign of weakness",
          "summary": "Bukola Saraki, former senate president, has advised the Buhari administration to seek external help to address Nigeria’s worsening security challenges.\nAdvertisementSaraki said seeking assistance in the present situation is “not a sign of weakness” even if done across party lines.\nThe Peoples Democratic Party (PDP) chieftain was speaking via a statement on Tuesday, in which he lamented nation’s security woes.\nTheCable had reported how Nigeria recorded more than 10 security incidents on Monday as killings and attacks continued across the country.\nSaraki said there is a need for President Muhammadu Buhari to convene a security meeting of all those who could help solve the challenge.",
          "link": "https://www.thecable.ng/saraki-to-buhari-seeking-help-to-tackle-insecurity-not-a-sign-of-weakness",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "tackle",
            "saraki",
            "help",
            "buhari",
            "nigeria",
            "muhammadu",
            "seeking",
            "security",
            "sign",
            "serving",
            "party",
            "weakness",
            "suggestion",
            "nations",
            "include",
            "insecurity",
            "president"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria",
          "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.",
          "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "itoro",
            "bringing",
            "nwokoye",
            "communities",
            "plan",
            "medical",
            "inoyo",
            "nigeria",
            "clafiya",
            "health",
            "access",
            "services",
            "rural",
            "jennie",
            "healthcare",
            "hospitaltohome"
          ]
        },
        {
          "title": "Can NIBSS save BVN from bank scams and be a fair umpire?",
          "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.",
          "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "fintechs",
            "scams",
            "bank",
            "data",
            "customers",
            "fair",
            "access",
            "number",
            "save",
            "nibss",
            "banks",
            "nigerias",
            "bvn",
            "umpire"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "dont",
            "appealing",
            "soldiers",
            "free",
            "kidnapped",
            "student",
            "come",
            "sent",
            "students",
            "yusuf",
            "rescue",
            "force",
            "video",
            "appeal",
            "govt",
            "sale"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "suspects",
            "peddlers",
            "recover",
            "arrest",
            "siblings",
            "suspected",
            "recovered",
            "led",
            "bodies",
            "delta",
            "car",
            "warri",
            "phones",
            "drug",
            "abraka",
            "decomposing",
            "corpses"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer",
          "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.",
          "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "country",
            "fairness",
            "observer",
            "lasting",
            "god",
            "nigeria",
            "nigerian",
            "equity",
            "security",
            "peace",
            "justice",
            "level",
            "governor",
            "ortom",
            "state",
            "insecurity"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "prohibited",
            "jan",
            "outlawed",
            "underaged",
            "cattle",
            "movement",
            "wish",
            "immediate",
            "nightgrazing",
            "highways",
            "web",
            "register",
            "19"
          ]
        },
        {
          "title": "Polaris Bank declares N28.9bn profit in 2020 financial year",
          "summary": "OBINNA EZUGWUPolaris Bank Limited has declared N28.9 billion profit before tax for full year 2020 ended December 31, a 4% growth from the corresponding period of 2019.\nThe performance, the bank’s financial statements said, is driven by the combination of the significant reduction in interest expense due to its pursuit of low interest-bearing deposits as well as lowering impairment charges on loans and other financial assets.\nThe Bank recorded Return on Asset (ROA) and Return on Equity (ROE) of 2.4% and 29.4% respectively which favorably place the Bank as a key player in the industry.\nCommenting on the Bank’s performance, the Managing Director/Chief Executive Officer (MD/CEO) of Polaris Bank Limited, Mr. Innocent C. Ike who took over in the course of the year from Mr. Tokunbo Abiru explained that “Polaris Bank has achieved significant milestones since its inception in September 21, 2018 when we started this journey.\n“We have since grown to earn the confidence of the banking publics, offering quality banking services at the cutting edge of technology”.",
          "link": "https://hallmarknews.com/polaris-bank-declares-n28-9bn-profit-in-2020-financial-year/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "bank",
            "declares",
            "polaris",
            "loans",
            "quality",
            "performance",
            "return",
            "2020",
            "mr",
            "banks",
            "n289bn",
            "significant",
            "financial",
            "profit",
            "deposits"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "How Baba Ijesa Defiled My Foster Daughter – Comedienne, Princess",
          "summary": "BY BODE GBADEBOPopular comedienne, Oluwadamilola Adekoya, popularly known as Princess, has narrated how fellow practitioner in the Nollywood, Olarenwaju Omiyinka, a.k.a.\nBaba Ijesha, was caught sexually molesting her 14-year-old adopted daughter.\nAccording to her, Baba Ijesha betrayed her trust and years of mentorship by his shameful act.\n“Baba Ijesha had challenges and he needed my help in getting into UNILAG.\n“I decided to call Baba Ijesha but my friend asked us to be wise, that people will want to support Baba Ijesha If we don’t have enough evidence.",
          "link": "https://leadership.ng/how-baba-ijesa-defiled-my-foster-daughter-comedienne-princess/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "ijesa",
            "cctv",
            "come",
            "baba",
            "comedienne",
            "house",
            "foster",
            "suspect",
            "defiled",
            "children",
            "set",
            "daughter",
            "princess",
            "ijesha"
          ]
        },
        {
          "title": "Secession, Restructuring Clamours Won’t Create Better Life For Nigerians – Sowore",
          "summary": "By Tunde Oguntola, AbujaThe African Action Congress (AAC) has said the clamour for restructuring, power rotation and secession by various groups in the country would not meet the long-term aspirations of Nigerians.\nThe AAC chairman urged the Independent National Electoral Commission (INEC) to stop efforts at sacking the state chairman of the party.\nAccording to him, “Secession is lawful but too expensive, divisive, and doubtful.\nWe have also passed the stage of restructuring the country if restructuring means going back to the 1963 constitution while having the same people in power.\n“Only those who believe we can vote out bad leaders without a fight will simply wait for a power rotation in 2023.",
          "link": "https://leadership.ng/secession-restructuring-clamours-wont-create-better-life-for-nigerians-sowore/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "country",
            "better",
            "lawful",
            "nigerians",
            "wont",
            "secession",
            "restructuring",
            "clamours",
            "various",
            "aac",
            "national",
            "wait",
            "create",
            "life",
            "sowore",
            "simply",
            "chairman"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "UFC: Usman, McGregor in war of words",
          "summary": "There might be a clash in the future between reigning UFC welterweight champion Kamaru Usman and Conor McGregor after both superstars reignited their rivalry on social media on Monday.\nUsman defended his welterweight title for the fourth time with a second round knockout victory over Jorge Masvidal at the UFC 261 at the VyStar Veterans Memorial Arena in Jacksonville, Florida, on Sunday in front of 15,000 screaming fans.\nMcGregor has created a knack for taunting Usman after every win the Nigerian records, claiming he will one day come for the title in the welterweight division.\nThe Irish fighter, in a post on Twitter, accused Usman of copying his moves in knocking out Masvidal, stating that he would destroy the Nigerian when they clash.\nIn his reply, Usman referred to the former UFC featherweight and lightweight champion as a washed out fighter who got beaten easily in his preferred weight class.",
          "link": "https://daylightng.com/ufc-usman-mcgregor-in-war-of-words/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "shots",
            "welterweight",
            "fight",
            "words",
            "war",
            "nigerian",
            "usman",
            "fighter",
            "mcgregor",
            "title",
            "ufc",
            "masvidal"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}