{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Attacks on Prisons: FG declares Prisons ‘Red Zones’",
          "summary": "This was as he said some of the inmates who escaped from the custodial centres have been rearrested for murder.\nHe said; “Our Custodial Centres must be red zones.\n“We are with you absolutely to make our Custodial Centres inviolable.\n“If this meeting must make any meaning at all, you will be held absolutely responsible going forward for any attack on our custodial facilities.\n“The custodial facilities are a symbol of the authority of the Nigerian State.",
          "link": "https://www.vanguardngr.com/2021/05/attacks-on-prisons-fg-declares-prisons-red-zones/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "inmates",
            "facilities",
            "attacks",
            "zones",
            "red",
            "personnel",
            "declares",
            "attack",
            "fg",
            "custodial",
            "centre",
            "rearrested",
            "prisons",
            "centres",
            "defend"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Presidential Villa empty, Nigeria's future must be discussed",
          "summary": "He insisted that President Buhari might have lost touch with realities.\nLet me tell you if it is in a civilized country, by now, President Buhari will resign with what is happening.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\nThe President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\n“Anyone familiar with President Buhari knows that he doesn’t break the laid down rules in dealing with contracts or any other government business for that matter.",
          "link": "https://dailypost.ng/2021/05/01/presidential-villa-empty-nigerias-future-must-be-discussed-oby-ezekwesili/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "villa",
            "impeachment",
            "future",
            "speaking",
            "father",
            "nigerias",
            "discussed",
            "nigerians",
            "presidential",
            "priest",
            "god",
            "country",
            "buhari",
            "mbaka",
            "president"
          ]
        },
        {
          "title": "Mbaka vs Presidency: Nigerians question prophecies",
          "summary": "Let me tell you if it is in a civilized country, by now, President Buhari will resign with what is happening.\nHe said: “360 u-turn from father Mbaka is in the right direction.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\nThe President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\nNow, this is what is eating Father Mbaka.”",
          "link": "https://dailypost.ng/2021/05/01/mbaka-vs-presidency-nigerians-question-prophecies/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "impeachment",
            "speaking",
            "father",
            "vs",
            "presidency",
            "nigerians",
            "priest",
            "president",
            "question",
            "god",
            "country",
            "buhari",
            "mbaka",
            "prophecies"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Alleged Rape: Lagos lists possible charges against Baba Ijesha",
          "summary": "By Alao AbiodunThe Lagos State Domestic and Sexual Violence Team has said that it is actively following up on the case of James Olanrewaju a.k.a.\nThe agency, in series of tweets, stated that it was also in direct contact with the complainant with a view to providing the necessary support.\nIt said: “We confirm that the duplicate case file has been forwarded to the Directorate of Public Prosecution (DPP) for legal advice.\nFor avoidance of doubt, the following allegations are being considered:”(1) Sexual Assault by Penetration- S 261 of the Criminal law of Lagos State, 2015 punishable by Life imprisonment, (2) Attempted Sexual Assault by Penetration-S262 of the Criminal law, punishable by 14 years imprisonmentADVERTISEMENT”(3) Sexual Assault- S263 of the Criminal Law, punishable by 3 years imprisonment.\nIt reiterated the Lagos State Government’s position on zero tolerance to all forms of sexual and gender-based violence and its firm commitment in ensuring justice for survivors.",
          "link": "https://thenationonlineng.net/alleged-rape-lagos-lists-possible-charges-against-baba-ijesha/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "justice",
            "state",
            "rape",
            "ijesha",
            "law",
            "baba",
            "violence",
            "punishable",
            "criminal",
            "support",
            "lagos",
            "sexual",
            "assault",
            "lists",
            "alleged",
            "charges",
            "possible"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "My regret for Enyimba, sports in Nigeria – Kalu",
          "summary": "Enyimba was everything to Aba people, the team was worshipped and it like after God, Enyimba was next in Abia State.\nI created two teams- Enyimba in Aba and Orji Uzoh Kalu Babes in Umuahia but they changed the name.\nI encourage state governor, the federal government and looking at Enyimba today, you will agree with me that the ream is a brand now.\nWhy did Enyimba as an international brand fail to attract sponsorship during you term as governor of Abia State?\nAs governor of Abia State, it was only at the Enyimba Stadium that you could come and play well and win.",
          "link": "https://www.sunnewsonline.com/my-regret-for-enyimba-sports-in-nigeria-kalu/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "enyimba",
            "state",
            "governor",
            "regret",
            "kalu",
            "club",
            "players",
            "left",
            "abia",
            "football",
            "nigeria",
            "caf",
            "team"
          ]
        },
        {
          "title": "I get depressed when men drool over my boobs – Kemi Ikuseedun",
          "summary": "But mention ‘Mummy Wa’ and you see several heads turn.\nHowever, one thing makes Mummy Wa stand out and it’s the fact that she’s quite endowed in the upper region.\nIn a chat with Saturday Sun, the ‘wife’ of popular Internet comedian, Mr. Macaroni played by Debo Adebayo, bemoans her sexual harassment encounters.\n“I think every girl, beautiful or not, has faced sexual harassment before.\nI love how I look.”On what turns her off in a relationship, Mummy Wa says it’s dishonesty and lack of respect.",
          "link": "https://www.sunnewsonline.com/i-get-depressed-when-men-drool-over-my-boobs-kemi-ikuseedun-mummy-wa/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "way",
            "men",
            "guys",
            "kemi",
            "drool",
            "harassment",
            "physical",
            "mummy",
            "look",
            "girl",
            "sexual",
            "ikuseedun",
            "boobs",
            "wa",
            "depressed",
            "maybe"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Amid Unending Killings, Buhari Mulls Fresh Strategy at Security Meeting",
          "summary": "It also emerged yesterday that 323 persons had been killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), in a statement after the meeting, stressed the readiness of President Buhari to decisively end all forms of security challenges facing the nation.\nSpokesman of the Yobe State Police Command, ASP Dungus Abdulkarim confirmed the attack.\nIn 3 Months, Bandits Kill 323 in Kaduna StateThe Kaduna State Government yesterday disclosed that 323 persons were killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe Commissioner for Internal Security and Home Affairs, Mr. Samuel Aruwan stated this yesterday while presenting a report on the security situation in the state at a security meeting which held at the Government House, Kaduna.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/amid-unending-killings-buhari-mulls-fresh-strategy-at-security-meeting/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "323",
            "meeting",
            "security",
            "state",
            "deaths",
            "haram",
            "unending",
            "fresh",
            "amid",
            "kaduna",
            "bandits",
            "mulls",
            "strategy",
            "buhari",
            "yobe",
            "president",
            "killings"
          ]
        },
        {
          "title": "Masari: The North is Not Afraid of Restructuring",
          "summary": "Masari, who spoke in an exclusive interview with THISDAY recently, noted that it was false and misleading to say that prominent politicians in the region were against the restructuring of Africa’s most populous country.\nHe said: “Who said the North is not interested in restructuring?\nYou see, there have being different definitions of restructuring.\nI think the North believed that there should be devolution and in devolving you know many things are going to come with it.\nSo, the North is not afraid of restructuring.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/masari-the-north-is-not-afraid-of-restructuring/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "masari",
            "grazing",
            "afraid",
            "federal",
            "state",
            "countryhe",
            "north",
            "states",
            "local",
            "proper",
            "system",
            "restructuring"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits’-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kankara",
            "men",
            "abduction",
            "state",
            "returned",
            "daudawa",
            "leader",
            "shot",
            "zamfara",
            "dead",
            "gang",
            "auwalun",
            "breaking",
            "repentance",
            "bandits",
            "forest",
            "schoolboys"
          ]
        },
        {
          "title": "BREAKING: Bandits’ Leader Behind Kankara Schoolboys Abduction, Auwalun Daudawa Shot Dead",
          "summary": "According to Daily Trust, Daudawa was shot dead Friday evening during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government Area in Zamfara state and Batsari Local Government Area in Katsina state.\nThe notorious bandit shot to prominence after he masterminded the attack on Government Secondary School, Kankara where he abducted over 300 schoolboys overnight.\nThe newspaper had on Thursday reported how Daudawa returned to the forest and his old ways after he vacated his new abode in Damba, on the outskirts of Gusau.\nSources said the bandits’ leader was killed while leading his men on a revenge attack on bandits loyal to another gang called Ballolo.\nA source said while Daudawa’s gang succeeded in killing some persons in the opposing gang, their leader was felled down by bullets of Ballolo’s boys.",
          "link": "http://saharareporters.com/2021/04/30/breaking-bandits%E2%80%99-leader-behind-kankara-schoolboys-abduction-auwalun-daudawa-shot-dead",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kankara",
            "men",
            "abduction",
            "state",
            "returned",
            "daudawa",
            "leader",
            "shot",
            "zamfara",
            "dead",
            "gang",
            "auwalun",
            "breaking",
            "repentance",
            "bandits",
            "forest",
            "schoolboys"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "FACT CHECK: Did COVID-19 vaccine knock down a woman in Kaduna as Oyedepo claimed?",
          "summary": "On April 17, David Oyedepo, presiding bishop of Living Faith Church Worldwide, said he won’t take the COVID-19 vaccine and also asked his followers not to take it.\nAdvertisementWhile delivering a sermon in his church, he told the congregation that a certain woman went down after taking the vaccine injection in Kaduna.\nTheCable presents what we know so far about the incident and COVID-19 vaccination in Nigeria at present.\nSORTING FACTS FROM FICTIONNigeria commenced nationwide vaccination of the Oxford/AstraZeneca COVID-19 vaccine on March 5 after receiving 3.9 million doses courtesy of the UN-led COVAX facility.\nThe European Medicines Agency (EMA) also declared the AstraZeneca COVID-19 vaccine safe and effective.",
          "link": "https://www.thecable.ng/fact-check-did-covid-19-vaccine-knock-down-a-woman-in-kaduna-as-oyedepo-claimed",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "vaccine",
            "fact",
            "vaccinated",
            "knock",
            "vaccination",
            "oyedepo",
            "health",
            "hospital",
            "injection",
            "tanko",
            "woman",
            "kaduna",
            "check",
            "covid19",
            "administration",
            "claimed"
          ]
        },
        {
          "title": "Nasarawa governor: It’s unfair to say Buhari doesn't have the capacity to end insecurity",
          "summary": "Abdullahi Sule, governor of Nasarawa state, says it is unfair to say President Muhammadu Buhari does not have the capacity to end the security challenges in the country.\nThe development has heightened pressure on the Buhari-led administration to put an end to the security challenges.\n‘’You will remember in 2015, most of the security challenges are restricted to the northern part of the country, predominantly in the north-eastern part of the country.\nHaving outside support doesn’t necessarily mean that we don’t have the capacity.\nMost of the wars that have been fought in the world, a lot of countries ask for foreign support,” Sule added.",
          "link": "https://www.thecable.ng/nasarawa-gov-its-unfair-to-say-buhari-doesnt-have-the-capacity-to-end-insecurity",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nasarawa",
            "challenges",
            "security",
            "insecurity",
            "governor",
            "end",
            "saying",
            "support",
            "unfair",
            "sule",
            "capacity",
            "say",
            "doesnt",
            "buhari",
            "president",
            "think"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "banks",
            "took",
            "bank",
            "otudeko",
            "sacking",
            "sanusi",
            "governor",
            "skye",
            "emefiele",
            "bruised",
            "enforces",
            "tradition",
            "cbn",
            "board"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "expand",
            "aggressive",
            "expansion",
            "market",
            "startups",
            "size",
            "business",
            "companies",
            "company",
            "fintech",
            "nigeria",
            "partnerships",
            "value",
            "country"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "defeat",
            "coas",
            "operation",
            "ne",
            "observer",
            "renames",
            "counterinsurgency",
            "renaming",
            "disclosed",
            "nigerian",
            "counterterrorism",
            "followed",
            "locations",
            "army"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nightgrazing",
            "wish",
            "web",
            "jan",
            "underaged",
            "immediate",
            "highways",
            "register",
            "outlawed",
            "movement",
            "prohibited",
            "19",
            "cattle"
          ]
        },
        {
          "title": "Abductor Of Kankara schoolboys shot dead four days after returning to forest",
          "summary": "Notorious Zamfara bandit, Auwal Daudawa, who masterminded the abduction of Kankara schoolboys in Katsina State has been shot dead.\nDaudawa who was initially granted amnesty by the Zamfara State government after he ‘repented’ later changed his mind four days ago and returned to the forest where he was shot dead by a rival gang.\nSources to Daily Trust that Daudawa was shot dead during a gun duel with a rival gang at Dumburum forest located between Zurmi Local Government in Zamfara State and Batsari Local Government in Katsina State, on Friday evening.\nThe notorious bandit shot to prominence after he masterminded attack on Government Secondary School, Kankara, where he abducted over 300 schoolboys.\nConfirming the story to Daily Trust, Zamfara Commissioner for Security and Home Affairs, Abubakar Dauran, said Daudawa was killed after he murdered somebody and rustled his cattle.",
          "link": "https://hallmarknews.com/abductor-of-kankara-schoolboys-shot-dead-four-days-after-returning-to-forest/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "kankara",
            "trust",
            "state",
            "men",
            "days",
            "killed",
            "zamfara",
            "daudawa",
            "shot",
            "dead",
            "gang",
            "returning",
            "bandit",
            "abductor",
            "forest",
            "schoolboys"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Iheanacho Has Silenced Critics With Goal Run – Rodgers",
          "summary": "ADVERTISEMENTLeicester City manager, Brender Rodgers, has said red-hot striker Kelechi Iheanacho has finally silenced the moaners with his goal run.\nThe Nigerian, 24, endured a tough start at the Foxes following his £25m moves from Manchester City in 2017.\nBut his 12 goals in nine games have cemented the third spot and put Leicester into next month’s FA Cup final.\nBut I don’t think there’s any now.\nThat’s a testament to Kelechi,” Rodgers said.",
          "link": "https://leadership.ng/iheanacho-has-silenced-critics-with-goal-run-rodgers/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "theres",
            "striker",
            "kelechi",
            "tough",
            "goal",
            "thats",
            "iheanacho",
            "silenced",
            "city",
            "start",
            "run",
            "critics",
            "testament",
            "rodgers",
            "think"
          ]
        },
        {
          "title": "Premier League Overtakes La Liga As Europe’s Best League",
          "summary": "The English Premier League has become the number one ranked league in Europe thanks to Manchester United’s 6-2 victory over Roma in Thursday’s Europa League first-leg, Daily Mail reports.\nUnited’s Europa League glory has seen the Premier League lead the UEFA rankings for the first time in nine years, pushing LaLiga down into second place.\nAs it stands, England and the Premier League have a coefficient score of 98.997 after the nation’s success in both the Champions League and Europa League.\nWith two Premier League clubs in both the semi-finals of the Champions League and Europa League – the English top-flight has officially outperformed LaLiga in three of the last five seasons.\nEven Champions League and Europa League glory will leave Spain and LaLiga sitting in England’s shadow.",
          "link": "https://leadership.ng/premier-league-overtakes-la-liga-as-europes-best-league/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "europa",
            "manchester",
            "madrid",
            "score",
            "overtakes",
            "premier",
            "liga",
            "best",
            "league",
            "europes",
            "la",
            "spain",
            "rankings",
            "coefficient",
            "champions"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Why Father Mbaka wants Buhari impeached- Presidency",
          "summary": "Let me tell you if it is in a civilized country, by now, President Buhari will resign with what is happening.\nThe Presidency said: “An outsider distilling the avalanche of verbiage will be surprised that after supporting the President two times to win the Presidency, Father Mbaka has made a complete U-Turn, preposterously asking President Buhari to resign or be impeached.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\n“The President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\n“The Presidency and Father Mbaka are nothing but blackmailers and scammers.",
          "link": "https://dailytimes.ng/why-father-mbaka-wants-buhari-impeached-presidency/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "contracts",
            "father",
            "fr",
            "presidency",
            "dont",
            "buhari",
            "impeached",
            "resign",
            "country",
            "wants",
            "mbaka",
            "president"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Twitter not relocating to Ghana, says founder",
          "summary": "Twitter co-founder, Jack Dorsey, revealed on Friday that he has no plans to relocate to Accra yet though the social networking service has set up its African office in Ghana.\nAccording to Ghana Web, Ghanaian Communications Minister, Ursula Owusu-Ekuful, had disclosed that Jack is expected to relocate Accra in June 2021.\nA tweep, @asaaseradio995, subsequently tweeted, “Jack Dorsey is expected to relocate to Ghana in June as Twitter sets up its African headquarters in Accra.”But replying via his official handle, @jack, the Twitter CEO wrote, “No plans yet!\n), has in recent time sought stiffer penalties for persons who “misuse social media”.\nIt seeks to criminalise the use of the social media in peddling false or malicious information.",
          "link": "https://daylightng.com/twitter-not-relocating-to-ghana-says-founder/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "minister",
            "media",
            "founder",
            "ghana",
            "social",
            "african",
            "accra",
            "party",
            "relocate",
            "relocating",
            "jack",
            "twitter"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "website",
            "emerges",
            "launches",
            "popular",
            "bookmaker",
            "offers",
            "place",
            "page",
            "1xbet",
            "version",
            "convenient",
            "mobile",
            "site",
            "account"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "npa",
            "apapa",
            "truck",
            "roads",
            "road",
            "electronic",
            "system",
            "ecall",
            "worsening",
            "gridlock",
            "callup",
            "amidst",
            "drivers",
            "trucks"
          ]
        }
      ]
    }
  }
}