{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "We die alone, burry our people alone, what we get are statements from govt",
          "summary": "According to him, “people are dying and all we get are simple statements from Government”.\nAnd we don’t get a sense that those who govern us understand and share in our pain.\n“We don’t see them at the funerals, we don’t see them on condolence visit, neither do they call on phone.\nA woman who just loss her husband for example, you go to her and tell her she will be okay.\nPresidency through the Senior Special Assistant, Media and Publicity to the president issues statements to condole anyone that loses a dear.",
          "link": "https://www.vanguardngr.com/2021/05/we-die-alone-bury-our-people-alone-what-we-get-are-statements-from-govt-kukah/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "dying",
            "die",
            "govt",
            "president",
            "pain",
            "okay",
            "kukah",
            "dont",
            "statements",
            "tell",
            "share",
            "death",
            "burry"
          ]
        },
        {
          "title": "Devolution of power not the answer, let’s address poverty, Olisa Agbakoba says",
          "summary": "Kindly Share This Story:Human Right activist and lawyer, Olisa Agbakoba, has asked Nigerians to forget about devolution of power for now and tackle poverty.\nThis is just as he said the governors have a huge role to play in birthing a new Nigeria.\nSpeaking at The Platform with the theme: IS DEVOLUTION OF POWER SOLUTION TO NIGERIA’S PROBLEM?\nWhich was monitored by Vanguard, Agbakoba emphatically said the problem with Nigeria is not the constitution but the leader.\n– Olisa Agbakoba, human rights activist and former President of Nigerian Bar Association.#TheplatformNG#CTVTweets pic.twitter.com/l44BUNNcHq — Channels Television (@channelstv) May 1, 2021Kindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/05/devolution-of-power-not-the-answer-lets-address-poverty-olisa-agbakoba-says/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "governors",
            "leadership",
            "answer",
            "nigerias",
            "power",
            "constitution",
            "lets",
            "agbakoba",
            "address",
            "problem",
            "devolution",
            "poverty",
            "nigeria",
            "share",
            "olisa"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Fresh attack on Taraba community as gunmen snatch pregnant women, others",
          "summary": "Gunmen suspected to be militia have continued to make life unbearable for the people of Taraba State as they have continued to carry out attacks on residents of the State.\nDAILY POST gathered that two pregnant women and several other persons in Suntai village of Bali Local Government Council of the state have been abducted.\nSuntai village is the country home of the former late Governor Danbaba Danfulani Suntai, who was involved in a plane crash in 2012 which rendered him incapacitated, leading to his death.\nA few residents of the community claimed to have on several occasions drew the attention of the security operatives to their plights, but no actions were taken.\nThey lamented that if the security operatives were proactive enough, the recent abduction would have been averted, beckoning on the federal lgovernmnet to deploy more security operatives to the area.",
          "link": "https://dailypost.ng/2021/05/01/fresh-attack-on-taraba-community-as-gunmen-snatch-pregnant-women-others/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "women",
            "state",
            "victims",
            "attack",
            "residents",
            "gunmen",
            "security",
            "taraba",
            "village",
            "fresh",
            "community",
            "command",
            "snatch",
            "suntai",
            "council",
            "officer",
            "pregnant",
            "operatives"
          ]
        },
        {
          "title": "May Day: Kaduna Assembly Speaker, Zailani hails frontline workers against insurgency, COVID-19",
          "summary": "The Speaker, Kaduna House of Assembly, Yusuf Ibrahim Zailani, has commended the contributions of Nigerian workers to the growth of the country’s economy as the world celebrates Workers’ Day.\nZailani, who is also the Chairman of the Northern Speakers Forum, hailed the courage of workers across Nigeria in the face of difficulties.\n“I want to salute the courage of Nigerian workers, who have over the years given their best to their work.\n“I urge the Nigerian workers to redouble their efforts at this time of our national development.\nHe noted that these challenges have clearly shown how resilient and hardworking Nigerian workers are and urged them not to relent but to remain committed and resourceful as always.",
          "link": "https://dailypost.ng/2021/05/01/may-day-kaduna-assembly-speaker-zailani-hails-frontline-workers-against-insurgency-covid-19/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "best",
            "kaduna",
            "covid19",
            "frontline",
            "assembly",
            "workers",
            "zailani",
            "insurgency",
            "work",
            "hails",
            "speaker",
            "day",
            "nigeria",
            "courage",
            "yusuf",
            "youi",
            "nigerian"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "‘Denying girls education in my days was sheer ignorance’",
          "summary": "I started reading Daily Times newspapers when I was in primary school because I wanted to learn English Language.\n”In the olden days girls were not given proper education; they were not allowed to go to school because their fathers believed that after their education, they would serve their husbands.\nHe later started speaking in another language no one could understand, he was speaking in tongue.\nThat was how he became a member of Cherubim and Seraphim Church.\nHe became the Arch Bishop of United Cherubim and Seraphim Church Worldwide.",
          "link": "https://thenationonlineng.net/denying-girls-education-in-my-days-was-sheer-ignorance/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "later",
            "started",
            "god",
            "ignorance",
            "st",
            "denying",
            "days",
            "church",
            "school",
            "reading",
            "seraphim",
            "sheer",
            "teaching",
            "education",
            "girls",
            "husband"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "I’ve been depressed, rejected because of my crossed-eyes –Faith Ajayi, beauty queen",
          "summary": "Edo-born Faith Ajayi is pretty, but cross-eyed, and because of this, she was rejected several times by modeling agencies and beauty pageant organisers.\nRecently, she contested and won the Miss Melanin beauty pageant.\nI checked it out and was reluctant to apply because of my crossed-eyes, which made modeling agencies and beauty pageant organisers to disqualify me a number of times.\nInitially, my father wanted me to attend a military secondary school, but his death stopped me.\nYes, at some point, before the beauty pageant idea came to my mind.",
          "link": "https://www.sunnewsonline.com/ive-been-depressed-rejected-because-of-my-crossed-eyes-faith-ajayi-beauty-queen/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "depressed",
            "faith",
            "crossedeyes",
            "mother",
            "beauty",
            "father",
            "modeling",
            "pageant",
            "person",
            "rejected",
            "wanted",
            "ajayi",
            "tell",
            "ive",
            "eyes",
            "told",
            "queen"
          ]
        },
        {
          "title": "Bad governance fuelling separatist agitations – Segun Oni",
          "summary": "By Omoniyi SalaudeenUntil recently when former Governor Segun Oni of Ekiti State sought a reunion with the Peoples Democratic Party (PDP), he was the vice chairman (Southwest) of the ruling All Progressives Congress (APC).\nHaving concluded the Southwest zonal congress of your party, the Peoples Democratic Party (PDP), would you say all issues have been permanently resolved?\nDid anybody hear PDP talk about the misrule of the past military government when former President Olusegun Obasanjo took over?\nAs they say, security is the responsibility of all Nigerians.\nNow that the country has been put in jeopardy through bad governance, is it also wise for us to make projection about governorship ambition?",
          "link": "https://www.sunnewsonline.com/bad-governance-fuelling-separatist-agitations-segun-oni/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "state",
            "agitations",
            "pdp",
            "power",
            "oni",
            "say",
            "security",
            "party",
            "bad",
            "governance",
            "separatist",
            "segun",
            "fuelling",
            "nigeria",
            "misrule",
            "southwest"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Video: Fire Engulfs Buiilding in Apapa",
          "summary": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/video-fire-engulfs-buiilding-in-apapa/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "uses",
            "video",
            "privacy",
            "buiilding",
            "including",
            "engulfs",
            "apapa",
            "control",
            "useto",
            "site",
            "policy",
            "cookie",
            "website",
            "cookies"
          ]
        },
        {
          "title": "FirstBank: I Acted in Honour, Integrity, Says Awosika",
          "summary": "By Obinna ChimaThe sacked Chairman of First Bank Nigeria Limited, Mrs. Ibukun Awosika, has said that she acted in honour and integrity with the interest of the institution, all its stakeholders and the nation during her 11-year reign at the bank.\nAwosika, wrote this in an article she titled: “My FBN Group Journey,” posted on instagram, a social media platform.\nEmefiele had announced the appointment of a former Minister of State for Finance and former Executive Director of First Bank, Mr. Remi Babalola, as chairman of FBN Holdings.\nFirst Bank Nigeria Limited’s new Chairman is Tunde Hassan-Odukale, who replaced Awosika.\nGbenga Shobo, deputy managing director; and Remi Oni and Abdullahi Ibrahim, executive directors, are members of the reconstituted board.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/firstbank-i-acted-in-honour-integrity-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "limited",
            "firstbank",
            "bank",
            "fbn",
            "stakeholders",
            "honour",
            "nigeria",
            "integrity",
            "acted",
            "awosika",
            "board",
            "remi",
            "interest",
            "mr"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "killed",
            "state",
            "insurgents",
            "residents",
            "currently",
            "boko",
            "flee",
            "gathered",
            "community",
            "islamic",
            "breaking",
            "attacking",
            "soldiers",
            "borno",
            "military",
            "area",
            "haram"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "killed",
            "state",
            "insurgents",
            "residents",
            "currently",
            "boko",
            "flee",
            "gathered",
            "community",
            "islamic",
            "breaking",
            "attacking",
            "soldiers",
            "borno",
            "military",
            "area",
            "haram"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Mr President, Nigeria must not go down",
          "summary": "President, Nigeria Is Going Down’.\nI recall, and repeat, the opening salvo: “Mr President, I don’t know how you would take this, but there is no nicer way of putting it – Nigeria is going down.\nI will tell you a very short story, Mr President.\nHaving said that, Mr President, I now want to make my point: Nigeria is going down, and very fast.\nI do not for a minute, Mr President, underestimate some of your strides.",
          "link": "https://www.thecable.ng/mr-president-nigeria-must-not-go-down",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "know",
            "things",
            "boko",
            "president",
            "excellency",
            "political",
            "nigeria",
            "mr",
            "insecurity",
            "haram"
          ]
        },
        {
          "title": "Crimson as colour of Remi Tinubu’s wolf and sheep allegory",
          "summary": "That was what she did last week when she introduced the wolf and sheep allegory into the current national discourse on the security situation in Nigeria.\nBenue State governor, Samuel Ortom, stood before seven bodies lying prostrate or face-up, in different postures.\nUpon the wolf having grown, unknown to the shepherd, the wolf returned to the flesh-eating gastronomy of its wolf ancestry.\nAgain, it is apposite to ask whether former Miss Ikusebiala was speaking like a mother when she made that wolf and sheep statement.\nAdvertisementUpper week, Yobe State governor and All Progressives Congress (APC’s) interim national chairman, Mai Mala Buni, walked that same boastfully ruinous path.",
          "link": "https://www.thecable.ng/crimson-as-colour-of-remi-tinubus-wolf-and-sheep-allegory",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "state",
            "tinubus",
            "apc",
            "wolf",
            "national",
            "crimson",
            "sheep",
            "party",
            "governor",
            "ikusebiala",
            "colour",
            "nigeria",
            "fulani",
            "remi",
            "allegory"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "tradition",
            "cbn",
            "sacking",
            "took",
            "sanusi",
            "bank",
            "governor",
            "banks",
            "skye",
            "otudeko",
            "board",
            "bruised",
            "emefiele",
            "enforces"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "fintech",
            "expansion",
            "partnerships",
            "value",
            "aggressive",
            "country",
            "business",
            "nigeria",
            "startups",
            "company",
            "size",
            "companies",
            "expand",
            "market"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "ne",
            "army",
            "observer",
            "counterterrorism",
            "coas",
            "counterinsurgency",
            "defeat",
            "renaming",
            "locations",
            "operation",
            "followed",
            "renames",
            "disclosed",
            "nigerian"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "wish",
            "outlawed",
            "jan",
            "prohibited",
            "cattle",
            "19",
            "immediate",
            "nightgrazing",
            "web",
            "highways",
            "register",
            "underaged",
            "movement"
          ]
        },
        {
          "title": "Fidelity Bank Approves 22 Kobo Dividend Per Share For FY2020",
          "summary": "The shareholders of Fidelity Bank Plc have unanimously endorsed the payment of a cash dividend of 22 kobo per share to all Shareholders whose names appear in the Register of Members at the close of business on April 16, 2021.\nThis translates to a dividend yield of 9.2%, making it the 4th most rewarding Bank to investors in the Nigerian Capital Market.\nMustapha Chike-Obi, Chairman of the Board of Directors of Fidelity Bank, reassured shareholders at the AGM that the board and management of the bank would maintain the high corporate governance standard synonymous with Fidelity Bank and also ensure the bank continued in its growth trajectory in the years ahead.\nTotal savings deposits now account for about 25.0 percent of total deposits, an attestation of the Bank’s increasing market share in the retail market segment.\nOnyeali-Ikpe thanked the shareholders and the members of the Board for their continued confidence in the management team and specially appreciated Fidelity Bank customers for their patronage and loyalty.",
          "link": "https://hallmarknews.com/fidelity-bank-approves-22-kobo-dividend-per-share-for-fy2020/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "performance",
            "billion",
            "kobo",
            "bank",
            "22",
            "period",
            "fidelity",
            "dividend",
            "total",
            "fy2020",
            "share",
            "shareholders",
            "growth",
            "approves",
            "deposits"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Mabiyan Addini A Jihar Xinjiang Na Gamsuwa Da Yanayin Rayuwarsu A Cikin Watan Ramadhan",
          "summary": "",
          "link": "https://hausa.leadership.ng/mabiyan-addini-a-jihar-xinjiang-na-gamsuwa-da-yanayin-rayuwarsu-a-cikin-watan-ramadhan/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "ramadhan",
            "watan",
            "da",
            "rayuwarsu",
            "gamsuwa",
            "yanayin",
            "jihar",
            "cikin",
            "mabiyan",
            "xinjiang"
          ]
        },
        {
          "title": "Masanin Nijeriya: JKS Na Da Tarihin Tsawon Shekaru 100",
          "summary": "",
          "link": "https://hausa.leadership.ng/masanin-nijeriya-jks-na-da-tarihin-tsawon-shekaru-100/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "jks",
            "tsawon",
            "masanin",
            "nijeriya",
            "da",
            "shekaru",
            "tarihin",
            "100"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police inspector accidentally shot self, not suicide – PPRO —",
          "summary": "A Police Inspector identified as Ochofie Ijimbile, attached to MOPOL 55 Aba, Abia State, has allegedly shot and killed himself while servicing his rifle in readiness for the day’s job.\nPolice spokesman in the Command, SP Geoffrey Ogbonna, while describing the incident as sad and unfortunate, told reporters that Inspector Ijimbile accidentally shot himself on the chest.\nFollowing the incident, he was immediately rushed to the hospital, where he was confirmed dead.\nWhile stating that the late policeman could be unaware that there was bullet in his rifle chamber, called on policemen in Abia and across the country, especially those handling rifles to always exercise extra carefulness while servicing their arms.\nHis corpse has since been deposited in the morgue while efforts are on to reach the family members",
          "link": "https://dailytimes.ng/police-inspector-accidentally-shot-self-not-suicide-ppro/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "inspector",
            "told",
            "unfortunate",
            "ijimbile",
            "shot",
            "suicide",
            "incident",
            "unaware",
            "accidentally",
            "servicing",
            "ppro",
            "rifle",
            "self",
            "abia"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Public outrage: El-Rufai missing at The Platform",
          "summary": "Kaduna State Governor, Nasir El-Rufai, may have caved in to pressure from some Nigerians who opposed his being listed as a speaker at the 2021 edition of The Platform, an annual conference organised by the Senior Pastor of the Covenant Christian Centre, Lagos, Poju Oyemade.\nThe programme was themed, ‘Is Devolution of Powers The Solution To Nigeria’s Problems’.\nHowever, El-Rufai, who was announced as one of the speakers at the event, was conspicuously absent from the programme on Saturday.\nAlso, the organisers of the programme did not give any reason why El-Rufai was not present at the event.\nSome Twitter users had kicked against the choice of El-Rufai as a speaker on The Platform when the flyer inviting people to the event went viral with the governor as one of the speakers.",
          "link": "https://daylightng.com/public-outrage-el-rufai-missing-at-the-platform/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "elrufai",
            "public",
            "state",
            "outrage",
            "governor",
            "speakers",
            "event",
            "platform",
            "missing",
            "programme",
            "line",
            "speaker",
            "went"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "bookmaker",
            "version",
            "offers",
            "convenient",
            "1xbet",
            "site",
            "account",
            "website",
            "popular",
            "place",
            "mobile",
            "page",
            "launches",
            "emerges"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "ecall",
            "roads",
            "electronic",
            "worsening",
            "apapa",
            "npa",
            "trucks",
            "callup",
            "truck",
            "system",
            "drivers",
            "amidst",
            "road",
            "gridlock"
          ]
        }
      ]
    }
  }
}