{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Kwara Police nabs suspected ritualist, 24, with fresh human head, hand in Ajase-Ipo",
          "summary": "Kindly Share This Story:By Demola Akinyemi – IlorinNemesis caught up with a suspected ritualist by the name of Kehinde John Moses aged 24 on Monday in Ajase-Ipo in Irepodun local government area of Kwara state when he was caught with fresh human head and hand.\nVanguard reliably gathered in Ajase-Ipo that the suspect who concealed the human parts in a black nylon bag with his partner in the crime was taking them to give a yet-to-be-identified herbalist for money ritual when they ran out of luck.\nThey were said to have freshly severed the head of the victim name Mohammed in Ajase-Ipo, as blood was still dripping from the human parts.\nThe team who suspected a foul play immediately held Kehinde down inside the commercial bus with the black nylon back only to found the freshly severed human parts therein.\nThe suspect reportedly took the police to where the remaining parts of the body were dumped in Ajase-Ipo.",
          "link": "https://www.vanguardngr.com/2021/05/kwara-police-nabs-suspected-ritualist-24-with-fresh-human-head-hand-in-ajase-ipo/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "parts",
            "black",
            "suspect",
            "kehinde",
            "24",
            "state",
            "kwara",
            "head",
            "hand",
            "nylon",
            "ajaseipo",
            "nabs",
            "fresh",
            "suspected",
            "bus",
            "ritualist",
            "human"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "How over 400 people were killed, 100 houses burnt in four years",
          "summary": "Some traditional rulers in Andoni Local Government Area of Rivers State have decried increasing insecurity in the local government, which has persisted for over three years.\nThe Paramount ruler of Atah-Obolo community noted that the said King was illegally installed by the political class and some other traditional rulers in Andoni.\n“As we speak, grasses have taken over and overgrown our homes which had either been vandalized, destroyed, looted or utterly burnt.\nHe disclosed that almost all the houses in Egendem community in the Local Government were also vandalised, forcing over ninety percent of the residents to flee for safety.\nAccording to him the palace of late King Ngo town was also vandalized alongside about five other houses within the period in review”.",
          "link": "https://dailypost.ng/2021/05/03/how-over-400-people-were-killed-100-houses-burnt-in-four-years-andoni-chiefs/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "100",
            "local",
            "houses",
            "vandalized",
            "king",
            "burnt",
            "andoni",
            "rulers",
            "area",
            "community",
            "400",
            "traditional",
            "destroyed",
            "killed"
          ]
        },
        {
          "title": "Shehu Sani reacts as bandits vow to kill Greenfield students on Tuesday",
          "summary": "A former federal legislator, Shehu Sani, has called on those in authorities to do everything possible to ensure that the abductors of students of Greenfield University, Kaduna State, do not kill them.\nThe kidnappers, who are suspected bandits, have vowed to kill the remaining 17 students if ransom is not paid.\nThe gunmen within a week, killed five of the victims as the state governor, Nasir Ahmad El-Rufai vowed not to engage in negotiations with any bandit.\nReacting to the sad news, Sani, who represented Kaduna central senatorial district in the 8th assembly, said, “The leader of the murderous Kaduna Bandits, Baleri who kidnapped the Greenfield Students gave tomorrow as the deadline for their lives.\n“Kebbi Governor asked Nigerians to seek ‘Divine Intervention’…Mr Governor be careful with that call for ‘Divine Intervention’… the Intervention fit come in the way you no go like am.”",
          "link": "https://dailypost.ng/2021/05/03/shehu-sani-reacts-as-bandits-vow-to-kill-greenfield-students-on-tuesday/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "kaduna",
            "vow",
            "sani",
            "greenfield",
            "kill",
            "bandits",
            "governor",
            "state",
            "students",
            "vowed",
            "divine",
            "reacts",
            "intervention",
            "shehu",
            "nigerians"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Man strangles girlfriend, two daughters a day after burial of his son",
          "summary": "A father of two, simply identified as Arzel Ivery, has been arrested after he reportedly strangled his girlfriend and his two daughters.\nDaily Star UK reported on Saturday, that the body of his girlfriend, identified as Amarah Banks, was found in a garage in Milwaukee, Tennessee, the US.\nThe deceased was discovered alongside her daughters – Camaria Banks, 4, and Zaniya Banks, 5, – just one day after authorities issued an “Amber Alert” for the two girls.\nTheir remains were found on February 16th, 2020, a day after Arzel was taken into custody in Nashville, Tennessee.\nIvery then said that the two argued before he grabbed Banks and pushed her head into the wall before he “strangled Banks with both hands”.",
          "link": "http://community.thenationonlineng.net/forum/man-strangles-girlfriend-two-daughters-a-day-after-burial-of-his-",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "banks",
            "girlfriend",
            "man",
            "ivery",
            "daughters",
            "son",
            "world",
            "work",
            "burial",
            "strangled",
            "mother",
            "went",
            "day",
            "strangles",
            "children"
          ]
        },
        {
          "title": "Eedris Abdulkareem disses Keyamo again in new song",
          "summary": "“Senior Advocate of Nonsense” is currently trending on social media after Nigerian singer Eedris Abdulkareem dropped a follow-up diss song for Festus Keyamo, minister of state for labour and employment.\nIn the new song titled “Jaga Jaga Oti Get e”, Abdulkareem called Keyamo a “Senior Advocate of Nonsense”.\nThe diss track is a follow-up to ‘Jaga Jaga Reloaded’ which led to social media war between the duo who were once close.\nMr Keyamo had held nothing back in counter-attacking Eedris, claiming the singer made a poor attempt at blackmailing him in his new song ‘Jaja Jaga Reloaded’.\n~Where is the lie in the sentence “Senior Advocate of Nonsense”pic.twitter.com/SpzvgQaEg4 — CHINEDU OKORE (@iamCHINEDUOKORE) May 2, 2021Senior Advocate of Nonsense 😭 Eedris is petty pic.twitter.com/XISAFN84WP — Clark Kent (Freelance Writer) ✍️ 🧚 (@LibraLord88) May 2, 2021Eedris Abdulkareem really called Festus Keyamo Senior Advocate of Nonsense in his new song?!",
          "link": "http://community.thenationonlineng.net/forum/eedris-abdulkareem-disses-keyamo-again-in-new-song",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "song",
            "eedris",
            "media",
            "keyamo",
            "jaga",
            "abdulkareem",
            "advocate",
            "minister",
            "senior",
            "disses",
            "nonsense"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Bandit, kidnappers now have monopoly of violence, Alaafin, Ooni tell FG",
          "summary": "By Lukman OlabiyiAlaafin of Oyo, Oba Lamidi Adeyemi, has flayed the Federal Government for allowing bandits and kidnappers have monopoly of violence.\nOba Adeyemi, who disclosed this in Lagos over the weekend during the 51st birthday celebration of Aare onakakanfo of Yoruba Land, Iba Gani Adams, said monopoly of violence which ought to be the prorogative of government has been assumed by bandits and kidnappers.\n“The monopoly of violence must be concentrated in government but regrettably we are not having that now.\n“Aare Gani Adams’ appointment is divine and based on merit.\nHe extolled the virtues of the Aare Onakakanfo, saying the traditional institution would always support him in ensuring that the South West is safe.",
          "link": "https://www.sunnewsonline.com/bandit-kidnappers-now-have-monopoly-of-violence-alaafin-ooni-tell-fg/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "adams",
            "tell",
            "violence",
            "gani",
            "fg",
            "ooni",
            "monopoly",
            "yoruba",
            "alaafin",
            "south",
            "safe",
            "bandit",
            "kidnappers",
            "oba",
            "onakakanfo",
            "west"
          ]
        },
        {
          "title": "Fidelity Bank targets Tier-1 bank status by 2025",
          "summary": "By Chinwendu ObienyiFidelity Bank Plc has revealed plans to attain the Tier-1 bank status in Nigeria and achieve 7.5 per cent of total market share of deposits by 2025.\nThis translates to a dividend yield of 9.2 per cent, making it the fourth most rewarding bank to investors in the Nigerian Capital Market (NCM).\nAddressing shareholders at the bank’s 33rd Annual General Meeting (AGM) in Lagos on Friday, the Chief Executive Officer, Fidelity Bank Plc, Nneka Onyeali-Ikpe, announced her management plans to make the bank one of Nigeria’s Tier 1 banks by 2025.\nOnyeali-Ikpe noted that Fidelity Bank’s local currency deposits grew by 49.6 per cent to N1,400.8 billion and constituted 82.5 percent of total customer deposits while foreign currency deposits grew by 3.3 percent to N298.2 billion accounting for 17.5 percent of total deposits.\nEarlier in his opening remark, the Chairman, Board of Directors, Fidelity Bank Plc, Mustapha Chike-Obi, reassured shareholders at the AGM that the bank would maintain the high corporate governance standard and also ensure the bank continued in its growth trajectory in the years ahead.",
          "link": "https://www.sunnewsonline.com/fidelity-bank-targets-tier-1-bank-status-by-2025/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "continue",
            "banks",
            "share",
            "bank",
            "tier1",
            "management",
            "status",
            "targets",
            "fidelity",
            "plc",
            "deposits",
            "market",
            "2025",
            "shareholders",
            "total"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Nigeria to Receive £2.4m Ibori Loot Soon, Says Malami",
          "summary": "The expected funds have brought the Delta State Government in conflict with the federal government which had already decided the funds would be spent on three of its priority projects.\nDelta State Government and people have been clamouring that the funds be given the state since it was stolen from the state or at best be expended on projects in Delta State that would be of benefit to Deltans.\n“There is neither complacency nor any delay as efforts are being made to ensure successful transfer of the looted funds,” he said.\nThe funds would be the first of seized assets to be returned by the UK under the UK-Nigeria MOU entered in 2016.\nHowever, the federal government in the 2016 MOU has been pursuing the return of the monies and others in the UK to Nigeria.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/nigeria-to-receive-2-4m-ibori-loot-soon-says-malami/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "mou",
            "recovered",
            "delta",
            "loot",
            "transfer",
            "assets",
            "uk",
            "funds",
            "statement",
            "soon",
            "24m",
            "state",
            "nigeria",
            "federal",
            "malami",
            "ibori",
            "receive"
          ]
        },
        {
          "title": "With Dwindling Allocations, States Eye IGR Drive, Initiate Cost-cutting Measures",
          "summary": "The Ekiti State government said it had set up a committee to advise it on measures to adopt to survive the dwindling FACC allocations.\nAkwa Ibom and Gombe States are looking at measures to reduce wage bills by using biometrics to eliminate ghost workers.\nAkin Omole, told THISDAY that all the states of the federation would be affected by the inability of the NNPC to remit revenues to the FAAC.\nThe dwindling revenue, it added, has made it difficult for the state to pay its over N1.5 billion monthly wage bill.\nIn Nasarawa State, the state government said it had streamlined all IGR into Treasury Single Account (TSA) to cope with the dwindling allocations.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/with-dwindling-allocations-states-eye-igr-drive-initiate-cost-cutting-measures/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "dwindling",
            "revenue",
            "mr",
            "eye",
            "state",
            "costcutting",
            "wage",
            "allocations",
            "thisday",
            "workers",
            "igr",
            "billion",
            "tax",
            "told",
            "drive",
            "governor",
            "measures",
            "initiate",
            "states"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Terrorists Raiding Four Local Councils In Bauchi",
          "summary": "Boko Haram insurgents from neighbouring Yobe State have infiltrated at least four local government areas of Bauchi State, destroying some facilities.\nAjiri is a community in the Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the Borno State capital.\nThe attack came a few days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.",
          "link": "http://saharareporters.com/2021/05/03/breaking-boko-haram-terrorists-raiding-four-local-councils-bauchi",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "military",
            "local",
            "islamic",
            "borno",
            "boko",
            "councils",
            "gathered",
            "haram",
            "bauchi",
            "area",
            "terrorists",
            "gun",
            "state",
            "breaking",
            "insurgents",
            "raiding"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Terrorists Raiding Four Local Councils In Bauchi",
          "summary": "Boko Haram insurgents from neighbouring Yobe State have infiltrated at least four local government areas of Bauchi State, destroying some facilities.\nAjiri is a community in the Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the Borno State capital.\nThe attack came a few days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.",
          "link": "http://saharareporters.com/2021/05/03/breaking-boko-haram-terrorists-raiding-four-local-councils-bauchi#disqus_thread",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "military",
            "local",
            "islamic",
            "borno",
            "boko",
            "councils",
            "gathered",
            "haram",
            "bauchi",
            "area",
            "terrorists",
            "gun",
            "state",
            "breaking",
            "insurgents",
            "raiding"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Nengi to fans: If you love me because of your fantasies, unstan me",
          "summary": "Rebecca Nengi Hampson has taken to social media to express her disappointment over how some of her fans “constantly disrespect” her brand, friends, and team.\nStressing the importance of her personal brand, Nengi said the “constant disrespect” is unacceptable.\nShe also asked fantasy-driven die-hard fans to “un-stan” her if her personal image isn’t enough for them.\nIf you also love me because of your fantasies, UNSTAN ME.\nIf you also love me because of your fantasies, unstan me.",
          "link": "https://lifestyle.thecable.ng/nengi-to-fans-if-you-love-me-because-of-your-fantasies-unstan-me/#new_tab",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "unstan",
            "friends",
            "fans",
            "brand",
            "family",
            "insulting",
            "disrespect",
            "nengi",
            "love",
            "important",
            "lets",
            "team",
            "fantasies"
          ]
        },
        {
          "title": "Like Cynthia Osokogu, like Iniubong Umoren",
          "summary": "BY ISRAEL USULORAdvertisementWhen news broke that Iniubong Umoren, an innocent job seeker who was last seen on April 29, when she left home to attend an interview had been found dead, the manner in which she was murdered immediately brought back sad memories of Cynthia Osokogu who was killed in similar fashion in 2012.\nAlthough her killers, Messers Nwabufo and Ezike were duly tried and sentenced to death in 2017, the pain of her death remains.\nIniubong Umoren, killed a few days ago in Uyo after been raped is the latest victim of the increasing use of social media to perpetrate heinous crimes.\nOn April 27, she tweeted that she needed a job and would like to be assisted in finding one.\nShe was allegedly raped and killed by Uduak Frank Akpan who is now in the police detention.",
          "link": "https://lifestyle.thecable.ng/like-cynthia-osokogu-like-iniubong-umoren/#new_tab",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "raped",
            "death",
            "iniubong",
            "twitter",
            "osokogu",
            "killed",
            "hotel",
            "uyo",
            "umoren",
            "job",
            "cynthia",
            "victim"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Designing and building sustainable commercial spaces in Nigeria",
          "summary": "Their office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts.\nInnovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\nLike I said, we had a really really tight deadline.\nElements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria.",
          "link": "https://techcabal.com/2021/05/03/designing-and-building-sustainable-commercial-spaces-in-nigeria/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "kobo360",
            "wanted",
            "really",
            "way",
            "designing",
            "nigeria",
            "building",
            "design",
            "centre",
            "work",
            "sustainable",
            "space",
            "office",
            "spaces",
            "company",
            "commercial"
          ]
        },
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "banks",
            "enforces",
            "took",
            "board",
            "governor",
            "bank",
            "sacking",
            "bruised",
            "emefiele",
            "sanusi",
            "skye",
            "cbn",
            "otudeko",
            "tradition"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Obaseki recommits to press freedom, charges journalists on peace, development journalism – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991.\nIt is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.",
          "link": "http://nigerianobservernews.com/2021/05/obaseki-recommits-to-press-freedom-charges-journalists-on-peace-development-journalism/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "obaseki",
            "nigerian",
            "day",
            "development",
            "governor",
            "media",
            "public",
            "challenges",
            "journalism",
            "freedom",
            "information",
            "world",
            "journalists",
            "observer",
            "peace",
            "recommits",
            "press"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "web",
            "immediate",
            "movement",
            "underaged",
            "outlawed",
            "register",
            "prohibited",
            "jan",
            "wish",
            "19",
            "nightgrazing",
            "cattle",
            "highways"
          ]
        },
        {
          "title": "Oyetola emerges Champion Newspaper Governor of the Year",
          "summary": "Recall that Governor Oyetola emerged and received the Business Day Newspaper Best Governor of the Year in February and subsequently emerged the Blueprint Newspaper Governor of the Year.\nShe said: “I am highly elated to be here and I bring you greetings from the Board and Directorate of the Champion Newspaper.\nIn his remarks, Governor Oyetola thanked the Management of the newspaper for considering him worthy of the double awards.\n“I must thank you most sincerely, the Champion newspaper entourage led by the GMD/Editor-in-Chief.\nI have the Business Day Newspaper award coming from the West, I have the Blueprint Newspaper award coming from the North and the Champion Newspaper award coming from the East.",
          "link": "https://hallmarknews.com/oyetola-emerges-champion-newspaper-governor-of-the-year/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "particularly",
            "development",
            "governor",
            "award",
            "good",
            "administration",
            "oyetola",
            "newspaper",
            "state",
            "champion",
            "emerges"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "£4.2m Ibori Loot To Be Handed Over To Nigeria Soon, Malami Assures",
          "summary": "The minister attributed the delay in the return of the money to Nigeria to issues around bank documentations.\nHe said government had expected the money to be handed over within two weeks but was impossible because of bank documentations.\nThe Special Assistant on Media and Public Relations to the minister, Dr Umar Gwandu, disclosed this on Monday in a statement titled ‘Ibori loot expected soon -Malami’.\nMalami, had on March 9, 2021 signed a Memorandum of Understanding with the UK on the return of the Ibori loot.\nADVERTISEMENT“We anticipated two weeks but we are not in control of the banks,” the statement quoted Malami as saying.",
          "link": "https://leadership.ng/4-2m-ibori-loot-to-be-handed-over-to-nigeria-soon-malami-assures/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "handed",
            "loot",
            "42m",
            "expected",
            "minister",
            "delay",
            "quoted",
            "return",
            "statement",
            "soon",
            "weeks",
            "nigeria",
            "assures",
            "malami",
            "ibori"
          ]
        },
        {
          "title": "Sheikh Dahiru Bauchi Urges Muslims To Take COVID-19 Vaccine",
          "summary": "BY ISAIAH BENJAMIN, Kaduna |A renowned Islamic scholar, Sheikh Dr. Dahiru Usman Bauchi, has called on Muslims in the country to accept COVID-19 vaccine in order to check the spread of the virus.\nThe Islamic scholar made the call at his Kaduna residence while speaking at a Ramadan breakfast organised by Journalists Against Polio (JAP).\nHe said, “COVID-19 is real, I have been vaccinated and I urged the Muslims to make themselves available for the COVID-19 vaccination.”He described coronavirus disease as a global problem which required the support of all.\nSheikh Dahiru Bauchi urged the Muslim Umma to ensure the use of facemasks, ensure regular hand washing and other precautionary measures with a view to ensuring safety of all.\nBauchi promised to support COVID-19 activities in all forms so as to end the disease in Nigeria in particular and the world in general.",
          "link": "https://leadership.ng/sheikh-dahiru-bauchi-urges-muslims-to-take-covid-19-vaccine/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "muslims",
            "kaduna",
            "view",
            "islamic",
            "ensure",
            "urged",
            "sheikh",
            "covid19",
            "vaccine",
            "bauchi",
            "support",
            "scholar",
            "health",
            "urges",
            "dahiru"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Buhari appoints Dikko head of new agency to control small arms, weapons",
          "summary": "Nigeria President Muhammadu Buhari has appointed Rtd Major General A.M. Dikko as the pioneer coordinator of the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThe presidency in a statement said Buhari approved the establishment of NCCSALW on Monday.\nThe agency will be domiciled in the Office of the National Security Adviser.\nThe NCCSALW replaces the defunct Presidential Committee on Small Arms and Light Weapons and will serve as the institutional mechanism for policy guidance, research and monitoring of all aspects of small arms and light weapons (SALW) in Nigeria.\nHe was a Course Director at the Kofi Annan International Peacekeeping Centre and Chief Instructor of the Nigerian Army Peacekeeping Centre.",
          "link": "https://dailytimes.ng/buhari-appoints-dikko-head-of-new-agency-to-control-small-arms-weapons/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "arms",
            "agency",
            "salwthe",
            "centre",
            "head",
            "presidency",
            "dikko",
            "light",
            "buhari",
            "control",
            "national",
            "peacekeeping",
            "nigeria",
            "salw",
            "small",
            "appoints",
            "weapons"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Fee collection: Baptist Church condemns JAMB’s allegation",
          "summary": "The leadership of Nigerian Baptist Convention (NBC) has questioned the action of Registrar of Joint Admission and Matriculation Board (JAMB), Prof. Is-haq Oloyede, over the alleged N8,000 collected by the Baptist Girls Academy for JAMB registration.\nGiven this, Baptist Mission Schools abhor illicit and sharp practices; and same are disallowed in their engagements within and outside.\nIn the video clip, Prof. Oloyede assumed the role of a ‘prosecutor and judge’ against the defenceless teacher, Mr. Kayode Oloyede, who was also on a scheduled assignment.\nIn the video clip, the JAMB Registrar, Prof. Is-haq Oloyede publicly put on ‘trial’ Mr. Oloyede, a teacher at Baptist Girls Academy.\n“The school, Baptist Girls Academy did not charge #8000,00 for JAMB Registration as alleged by Prof. Oloyede.",
          "link": "https://daylightng.com/fee-collection-baptist-church-condemns-jambs-allegation/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "allegation",
            "alleged",
            "collection",
            "church",
            "registration",
            "registrar",
            "academy",
            "baptist",
            "jambs",
            "oloyede",
            "jamb",
            "girls",
            "teacher",
            "condemns",
            "fee",
            "prof"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Importance Of World Press Freedom Day",
          "summary": "May 3, 2021 150As people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\nHistory of World Press Freedom DayThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.",
          "link": "https://bizwatchnigeria.ng/importance-of-world-press-freedom-day/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "territories",
            "world",
            "freedom",
            "themed",
            "journalists",
            "importance",
            "nigeria",
            "day",
            "united",
            "press",
            "countries"
          ]
        },
        {
          "title": "ANALYSIS: New Policy Fails To Reverse Gas Flaring, Importation",
          "summary": "May 3, 2021 306To reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent.",
          "link": "https://bizwatchnigeria.ng/analysis-new-policy-fails-to-reverse-gas-flaring-importation/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "analysis",
            "nigerian",
            "reverse",
            "flaring",
            "country",
            "cooking",
            "target",
            "fails",
            "gas",
            "petroleum",
            "policy",
            "2020",
            "oil",
            "nigeria",
            "importation"
          ]
        }
      ]
    }
  }
}