{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Whoever said I requested contracts is a shame to himself, those he represents – Mbaka",
          "summary": "Ejike Mbaka has described as childish and laughable allegations that he is attacking President Muhammadu Buhari because he requested contracts and was rebuffed.\nAddressing the allegation in his Sunday sermon obtained by Vanguard, Mbaka said, “When they talk about giving Fr Mbaka contracts, I don’t want to talk about that because it is a laughable, childish accusation.\n“The Fr Mbaka who was speaking is not just a priest but by the special grace of God a job provider.\n“That person challenging Fr Mbaka, how many people are you feeding?\n“The last person this administration should fight is Fr Mbaka.” He saidVanguard News NigeriaKindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/05/whoever-said-i-requested-contracts-is-a-shame-to-himself-those-he-represents-mbaka/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "help",
            "contracts",
            "shame",
            "talk",
            "represents",
            "challenging",
            "god",
            "mbaka",
            "fr",
            "insecurity",
            "men",
            "mbakas",
            "requested"
          ]
        },
        {
          "title": "INEC says attacks on facilities may affect future polls",
          "summary": "Kindly Share This Story:The Independent National Electoral Commission (INEC) says recent attacks on its facilities if remained unchecked, may affect future polls.\nThe commission expressed concern, particularly with the ongoing conversion of voting points to polling units, voter registration, and the conduct of future elections.\nINEC National Commissioner and Chairman, Information and Voter Education Committee, Festus Okoye, said this in a statement in Abuja on Sunday, while confirming a fire attack on the commission’s office in Akwa Ibom.\nOkoye said that the Resident Electoral Commissioner for Akwa Ibom, Mike Igini, reported that INEC office in Essien Udim Local Government Area was set ablaze at the early hours of Sunday morning.\n“The police, which has also been battling with attacks on its facilities and personnel in the area, are aware of the incident and have commenced an investigation,” Okoye said.",
          "link": "https://www.vanguardngr.com/2021/05/inec-says-attacks-on-facilities-may-affect-future-polls/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "affect",
            "voting",
            "voter",
            "future",
            "office",
            "akwa",
            "attacks",
            "commission",
            "commissioner",
            "national",
            "electoral",
            "units",
            "inec",
            "polls",
            "facilities"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "VON DG, Okechukwu accuses Fayemi of anti-party",
          "summary": "The Labour Party in Ogun State has said it is unintelligent to support the secession of the Yoruba race from the Nigerian nation.\nIn recent times, calls for Oduduwa Republic have gathered so much momentum, especially in Ogun State where the agitators clashed with the police during a rally on Saturday.\n“We as a nation should not allow temporary political set-back and political partisanship to impair our capacity to reason well.\n“The Yorubas are too intelligent to be railroaded into any kind of regrettable commitment as in separating from the nation.\nAll we need to do is to ensure that we join hands as one and single nation to collectively defeat the ongoing large – scale national insecurity,” Arabambi submitted.",
          "link": "https://dailypost.ng/2021/05/03/2023-governors-holding-democracy-down-von-dg-okechukwu-accuses-fayemi-of-anti-party/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "antiparty",
            "separation",
            "okechukwu",
            "yorubas",
            "von",
            "fayemi",
            "state",
            "party",
            "ogun",
            "arabambi",
            "insecurity",
            "political",
            "dg",
            "nation",
            "labour",
            "accuses"
          ]
        },
        {
          "title": "Minimum wage: Ngige threatens governors not paying N30, 000",
          "summary": "The Labour Party in Ogun State has said it is unintelligent to support the secession of the Yoruba race from the Nigerian nation.\nIn recent times, calls for Oduduwa Republic have gathered so much momentum, especially in Ogun State where the agitators clashed with the police during a rally on Saturday.\n“We as a nation should not allow temporary political set-back and political partisanship to impair our capacity to reason well.\n“The Yorubas are too intelligent to be railroaded into any kind of regrettable commitment as in separating from the nation.\nAll we need to do is to ensure that we join hands as one and single nation to collectively defeat the ongoing large – scale national insecurity,” Arabambi submitted.",
          "link": "https://dailypost.ng/2021/05/03/minimum-wage-ngige-threatens-governors-not-paying-n30-000/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "threatens",
            "separation",
            "yorubas",
            "party",
            "ogun",
            "state",
            "wage",
            "n30",
            "arabambi",
            "insecurity",
            "political",
            "nation",
            "governors",
            "labour",
            "000",
            "paying",
            "minimum",
            "ngige"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "APC, PDP clash over worsening insecurity",
          "summary": "PDP governors accused the President of failing Nigerians at a time of grave national crises.\nIn a communiqué after their Abuja meeting, PDP governors said Nigeria was descending into anarchy.\nBut APC Caretaker/Extra-Ordinary Convention Planning Committee Secretary Senator John James Akpanudoedehe, said the PDP governors failed in reading the government’s approach correctly.\nAkpanudoedehe said: “While high-level investigations are ongoing to fish out sponsors and perpetrators of the security incidents, President Buhari has already given marching orders to our security services to check the security incidents.\n“The party and government definitely share concerns of well-meaning Nigerians, including PDP governors.",
          "link": "https://thenationonlineng.net/apc-pdp-clash-over-worsening-insecurity/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "support",
            "state",
            "pdp",
            "apc",
            "kogi",
            "insecurity",
            "buhari",
            "worsening",
            "governors",
            "political",
            "nigerians",
            "president",
            "security",
            "clash"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Bandit, kidnappers now have monopoly of violence, Alaafin, Ooni tell FG",
          "summary": "By Lukman OlabiyiAlaafin of Oyo, Oba Lamidi Adeyemi, has flayed the Federal Government for allowing bandits and kidnappers have monopoly of violence.\nOba Adeyemi, who disclosed this in Lagos over the weekend during the 51st birthday celebration of Aare onakakanfo of Yoruba Land, Iba Gani Adams, said monopoly of violence which ought to be the prorogative of government has been assumed by bandits and kidnappers.\n“The monopoly of violence must be concentrated in government but regrettably we are not having that now.\n“Aare Gani Adams’ appointment is divine and based on merit.\nHe extolled the virtues of the Aare Onakakanfo, saying the traditional institution would always support him in ensuring that the South West is safe.",
          "link": "https://www.sunnewsonline.com/bandit-kidnappers-now-have-monopoly-of-violence-alaafin-ooni-tell-fg/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "yoruba",
            "onakakanfo",
            "alaafin",
            "gani",
            "ooni",
            "south",
            "safe",
            "west",
            "bandit",
            "kidnappers",
            "monopoly",
            "tell",
            "violence",
            "fg",
            "adams",
            "oba"
          ]
        },
        {
          "title": "Fidelity Bank targets Tier-1 bank status by 2025",
          "summary": "By Chinwendu ObienyiFidelity Bank Plc has revealed plans to attain the Tier-1 bank status in Nigeria and achieve 7.5 per cent of total market share of deposits by 2025.\nThis translates to a dividend yield of 9.2 per cent, making it the fourth most rewarding bank to investors in the Nigerian Capital Market (NCM).\nAddressing shareholders at the bank’s 33rd Annual General Meeting (AGM) in Lagos on Friday, the Chief Executive Officer, Fidelity Bank Plc, Nneka Onyeali-Ikpe, announced her management plans to make the bank one of Nigeria’s Tier 1 banks by 2025.\nOnyeali-Ikpe noted that Fidelity Bank’s local currency deposits grew by 49.6 per cent to N1,400.8 billion and constituted 82.5 percent of total customer deposits while foreign currency deposits grew by 3.3 percent to N298.2 billion accounting for 17.5 percent of total deposits.\nEarlier in his opening remark, the Chairman, Board of Directors, Fidelity Bank Plc, Mustapha Chike-Obi, reassured shareholders at the AGM that the bank would maintain the high corporate governance standard and also ensure the bank continued in its growth trajectory in the years ahead.",
          "link": "https://www.sunnewsonline.com/fidelity-bank-targets-tier-1-bank-status-by-2025/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "deposits",
            "banks",
            "share",
            "bank",
            "shareholders",
            "targets",
            "tier1",
            "total",
            "continue",
            "plc",
            "management",
            "status",
            "2025",
            "market",
            "fidelity"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "With Dwindling Allocations, States Eye IGR Drive, Initiate Cost-cutting Measures",
          "summary": "The Ekiti State government said it had set up a committee to advise it on measures to adopt to survive the dwindling FACC allocations.\nAkwa Ibom and Gombe States are looking at measures to reduce wage bills by using biometrics to eliminate ghost workers.\nAkin Omole, told THISDAY that all the states of the federation would be affected by the inability of the NNPC to remit revenues to the FAAC.\nThe dwindling revenue, it added, has made it difficult for the state to pay its over N1.5 billion monthly wage bill.\nIn Nasarawa State, the state government said it had streamlined all IGR into Treasury Single Account (TSA) to cope with the dwindling allocations.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/with-dwindling-allocations-states-eye-igr-drive-initiate-cost-cutting-measures/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "workers",
            "eye",
            "igr",
            "dwindling",
            "drive",
            "wage",
            "measures",
            "mr",
            "state",
            "revenue",
            "thisday",
            "governor",
            "states",
            "tax",
            "initiate",
            "allocations",
            "told",
            "billion",
            "costcutting"
          ]
        },
        {
          "title": "Rising Oil Price Puts More Pressure on NNPC’s Finances",
          "summary": "India, one of Nigeria’s crude oil buyers, has recently been hit hard by a second wave that has pummelled fuel consumption and stretched the health-care system beyond its limits.\n“The production cost pricing model allows the government to manage the national petrol market in the interest of sustainable economic development.\n“The production cost-pricing method assumes that the petrol prices are based on the cost of domestic crude oil production and refining in the domestic market.\nThis method implies that crude oil is produced and refined in the country.\nAnd in Saudi Arabia, expensive refining cost accounts for 43 per cent of the petrol price,” it stated.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/rising-oil-price-puts-more-pressure-on-nnpcs-finances/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "nnpcs",
            "electricity",
            "nigeria",
            "market",
            "cost",
            "finances",
            "pressure",
            "price",
            "oil",
            "labour",
            "crude",
            "production",
            "rising",
            "petrol",
            "puts"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "REVEALED: Policemen In South-East Abandon Stations, Uniforms, Lobby For Redeployment Due To Insecurity",
          "summary": "According to Daily Trust, with the absence of police officers from stations came the disappearance of checkpoints in the South-East states.\nThis is unlike in the past when security checkpoints were mounted for stop-and-search exercises on motorists.\nThe roads and streets of Enugu, the capital of Enugu State, are lacking uniformed police officers and the usual security checkpoints.\nThis is not unconnected with the hike in violent attacks on security men and formations in the zone.\nSome of the policemen are seeking help from both serving and retired senior police officers and their political godfathers.",
          "link": "http://saharareporters.com/2021/05/03/revealed-policemen-south-east-abandon-stations-uniforms-lobby-redeployment-due-insecurity",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "redeployment",
            "revealed",
            "personnel",
            "fear",
            "uniforms",
            "state",
            "lobby",
            "attacks",
            "southeast",
            "stations",
            "insecurity",
            "abandon",
            "officers",
            "enugu",
            "men",
            "security",
            "policemen",
            "checkpoints"
          ]
        },
        {
          "title": "REVEALED: Policemen In South-East Abandon Stations, Uniforms, Lobby For Redeployment Due To Insecurity",
          "summary": "According to Daily Trust, with the absence of police officers from stations came the disappearance of checkpoints in the South-East states.\nThis is unlike in the past when security checkpoints were mounted for stop-and-search exercises on motorists.\nThe roads and streets of Enugu, the capital of Enugu State, are lacking uniformed police officers and the usual security checkpoints.\nThis is not unconnected with the hike in violent attacks on security men and formations in the zone.\nSome of the policemen are seeking help from both serving and retired senior police officers and their political godfathers.",
          "link": "http://saharareporters.com/2021/05/03/revealed-policemen-south-east-abandon-stations-uniforms-lobby-redeployment-due-insecurity#disqus_thread",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "redeployment",
            "revealed",
            "personnel",
            "fear",
            "uniforms",
            "state",
            "lobby",
            "attacks",
            "southeast",
            "stations",
            "insecurity",
            "abandon",
            "officers",
            "enugu",
            "men",
            "security",
            "policemen",
            "checkpoints"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Mbaka admits discussing contract with Buhari",
          "summary": "Ejike Mbaka, spiritual director of the Adoration Ministry (AMEN), has admitted meeting President Muhammadu Buhari with three persons over a contract that has become controversial.\nAdvertisementAccording to Garba Shehu, the presidential spokesman that made the allegation, “Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\n“Shehu, may God bless you for telling everybody that you are not giving me a contract.\nFortunately, they reported that they denied me of the contract — which contract?”“And even the people they are talking about that went there, I didn’t even discuss one percent of ‘if you get this contract’; contract of securing the country?\nAs if to say when he pushes that, Father Mbaka is no longer a Nigerian,” he said.",
          "link": "https://www.thecable.ng/mbaka-admits-discussing-contract-with-buhari",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "contract",
            "shehu",
            "dont",
            "discussing",
            "meeting",
            "rome",
            "country",
            "mbaka",
            "buhari",
            "insecurity",
            "admits",
            "father",
            "president"
          ]
        },
        {
          "title": "LISTEN: Eedris Abdulkareem hits Keyamo in another diss song",
          "summary": "Eedris Abdulkareem has come through with a follow-up diss song for Festus Keyamo, minister of state for labour and employment.\nAdvertisementThe less than three-minute diss track was released on the back of the minister’s recent Twitter tirade over the singer’s ‘Jaga Jaga Reloaded’.\nOn Sunday, the diss song which dwells on Keyamo surfaced online, with the musician further taking a hit at the minister.\nAdvertisementEdris Abdulkareem has gone to the studio for Festus Keyamo pic.twitter.com/F71W44Youv — Maybeks (@MayUbeku) May 2, 2021In the song, Abdulkareem made a number of allegations including one about his assailant using Stephanie Otobo, a Canada-based singer, to blackmail Apostle Suleman, the clergyman who battled a relationship scandal years ago.\nThat’s why I recorded ‘Obasanjo Write Buhari Letter’ to help you in that process,” he sang.",
          "link": "https://lifestyle.thecable.ng/listen-eedris-abdulkareem-hits-keyamo-in-another-diss-song/#new_tab",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "twitter",
            "keyamo",
            "song",
            "diss",
            "thought",
            "listen",
            "buhari",
            "musician",
            "abdulkareem",
            "track",
            "hits",
            "eedris",
            "minister"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "banks",
            "emefiele",
            "bank",
            "enforces",
            "cbn",
            "skye",
            "bruised",
            "sacking",
            "board",
            "sanusi",
            "otudeko",
            "tradition",
            "governor",
            "took"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "business",
            "fintech",
            "companies",
            "size",
            "expand",
            "nigeria",
            "expansion",
            "aggressive",
            "value",
            "country",
            "partnerships",
            "startups",
            "company",
            "market"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "EdoJobs, Azura Power train youths on solar power installation, cassava cultivation, others – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government Skills Development Agency, EdoJobs in collaboration with Azura Power has trained twenty-one youths in Edo State on solar installation, natural skincare, hair styling, cassava cultivation and ruminant rearing.\nThe Managing Director, EdoJobs, Mrs. Ukinebo Dare, said the beneficiaries participated in a two-month intensive skill acquisition programme, noting that on completion of the training, the beneficiaries were given startup kits to assist them set up their own business.\nDare added that the partnership with Azura-Edo also benefits the company’s host community who will be provided with the training programmes to improve their livelihood.\nAccording to her, the beneficiaries are taken through intensive training on various areas of specialization.\nShe urged the participants to make good use of the startup kits and put to practice what they have learnt to scale their businesses.",
          "link": "http://nigerianobservernews.com/2021/05/edojobs-azura-power-train-youths-on-solar-power-installation-cassava-cultivation-others/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "power",
            "cultivation",
            "training",
            "solar",
            "nigerian",
            "edo",
            "state",
            "ventures",
            "cassava",
            "youths",
            "startup",
            "edojobs",
            "kits",
            "observer",
            "intensive",
            "train",
            "beneficiaries",
            "installation"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": [
        {
          "title": "Ja’afar Ja’afar ya yi hijira zuwa Birtaniya har sai Ganduje ya daina farautar sa",
          "summary": "",
          "link": "https://hausa.premiumtimesng.com/2021/05/jaafar-jaafar-ya-yi-hijira-zuwa-birtaniya-har-sai-ganduje-ya-daina-farautar-sa/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "har",
            "sai",
            "daina",
            "yi",
            "ya",
            "hijira",
            "ganduje",
            "farautar",
            "jaafar",
            "zuwa"
          ]
        },
        {
          "title": "Ja’afar Ja’afar ya yi hijira zuwa Birtaniya har sai Ganduje ya daina farautar sa",
          "summary": "",
          "link": "https://hausa.premiumtimesng.com/2021/05/jaafar-jaafar-ya-yi-hijira-zuwa-birtaniya-har-sai-ganduje-ya-daina-farautar-sa/#respond",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "har",
            "sai",
            "daina",
            "yi",
            "ya",
            "hijira",
            "ganduje",
            "farautar",
            "jaafar",
            "zuwa"
          ]
        }
      ]
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "cattle",
            "highways",
            "web",
            "register",
            "wish",
            "prohibited",
            "movement",
            "19",
            "underaged",
            "nightgrazing",
            "jan",
            "outlawed",
            "immediate"
          ]
        },
        {
          "title": "DSS warns clerics, politicians against utterances aimed at plunging Nigeria into anarchy",
          "summary": "Ejike Mbaka, called on the National Assembly to impeach President Muhammadu Buhari if he fails to resign over rising insecurity in the country.\nThe DSS in a statement by its spokesman, Peter Afunanya said it won’t allow some individuals to break up the country through their unsavoury statements.\n”It has been established that the main objective for these is to cause a disintegration of the country.\n”The Service has also noted their desperation and penchant to collaborate with external forces and influences against Nigeria.\n”In this regard, self-centred individuals and groups are warned to stop engaging in acts inimical to the peace and sovereignty of this nation.",
          "link": "https://hallmarknews.com/dss-warns-clerics-politicians-against-utterances-aimed-at-plunging-nigeria-into-anarchy/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "clerics",
            "aimed",
            "anarchy",
            "nigeria",
            "throw",
            "state",
            "dss",
            "warns",
            "service",
            "country",
            "individuals",
            "plunging",
            "utterances",
            "politicians",
            "tolerate",
            "subversive",
            "unsavoury",
            "groups"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Why Iwobi Struggling At Everton’ – Ancelotti",
          "summary": "ADVERTISEMENTEverton manager Carlo Ancelotti failed to blame Alex Iwobi for his performances for the club this season, saying the versatile winger failed to impress due to the mistakes of the team and not the player.\nThe Nigerian international has been widely criticized by the club’s supporters and pundits for not doing enough for the Toffees, but Ancelotti does not feel that way despite acknowledging the attacker has put in some disappointing performances, he laid the blame with the mistakes of the team and not the player.\n“I think he had some good performances, and he had some difficult performances: he is part of the squad and after that he had some games where he played really well, and was really helpful for the team, and in other games I tried to change a little bit the strategy…it didn’t work well but not for his fault, [it was] the team’s fault and the team’s mistakes,” Ancelotti said.\n“He is professional, but of course when there is competition sometimes you play and sometimes you are on the bench.”Asked if he found Iwobi a frustrating player to manage, the Blues boss said: “He is not a frustrating player because he is really professional, really serious, always ready, not at all is he a frustrating player, because he is a really good professional with a fantastic attitude.”",
          "link": "https://leadership.ng/why-iwobi-struggling-at-everton-ancelotti/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "player",
            "ancelotti",
            "everton",
            "struggling",
            "team",
            "teams",
            "iwobi",
            "frustrating",
            "really",
            "mistakes",
            "professional",
            "performances"
          ]
        },
        {
          "title": "Champions League Final: I’ll Die On The Pitch To Beat Man City-Neymar",
          "summary": "Neymar says he will do anything to help Paris Saint-Germain beat Manchester City, even if it means that he has to “die on the pitch” to reach the Champions League final.\nPSG suffered a 2-1 defeat to City at Parc des Princes in the first leg of their Champions League semi-final, which leaves them with a mountain to climb in the second leg at Etihad Stadium on Tuesday.\nSpeaking after scoring in PSG’s 2-1 win against Lens in Ligue 1 on Saturday, the Brazilian told the club’s official media channel: “The first thing to do now is to rest and then really refocus on the Champions League.\n“We had a very tough first leg against Manchester City but we have to believe it no matter what the stats say or our percentage chance of winning.\nI’m in the front line, and I’ll be the first warrior who goes into battle for the team.",
          "link": "https://leadership.ng/champions-league-final-ill-die-on-the-pitch-to-beat-man-city-neymar/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "ill",
            "lead",
            "cityneymar",
            "leg",
            "man",
            "die",
            "second",
            "manchester",
            "matter",
            "beat",
            "champions",
            "stadium",
            "reach",
            "final",
            "league",
            "pitch",
            "city"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Power firms for sale, consumers to pay higher tariffs from July —",
          "summary": "It listed the five in-service generation plants to be Geregu Generation Company Ltd with gross installed capacity at ISO condition of 506 Megawatts (MW) and Benin (Ihovbor) Generation Company Ltd with 507 MW.\nOthers are Calabar Generation Ltd with 634MW, Omotosho Generation Ltd with 513MW and Olorunsogo Generation Company Ltd with 754MW.\n“Each bidder must be an experienced power generation company that owns and/or operates utility size power plants.\n“In case of a consortium, at least one of the consortium members must be an experienced power generation company (the “Technical Partner”).\nSale Mamman, at the weekend allayed consumers’ fear there will be no significant tariff increase.",
          "link": "https://dailytimes.ng/power-firms-for-sale-consumers-to-pay-higher-tariffs-from-july/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "power",
            "generation",
            "company",
            "nerc",
            "tariff",
            "ikedc",
            "tariffs",
            "proposed",
            "higher",
            "pay",
            "consumers",
            "electricity",
            "review",
            "increase",
            "firms",
            "sale"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "DSS warns: Buhari’s critics planning to disintegrate Nigeria",
          "summary": "The Department of State Services has knocked those calling for the resignation of the President, Major-General Muhammadu Buhari (retd.\nIt described the critics as misguided elements and accused them of threatening the government, sovereignty, and corporate existence of the country.\nEjike Mbaka had called on the National Assembly to impeach the President for incompetency if he failed to resign.\n“It has been established that the main objective for these is to cause a disintegration of the country.\n“Recently, the Service invited and cautioned some persons who deniably recounted their earlier statements or said they were quoted out of context.",
          "link": "https://daylightng.com/dss-warns-buharis-critics-planning-to-disintegrate-nigeria/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "secret",
            "critics",
            "nigeria",
            "noted",
            "dss",
            "warns",
            "disintegrate",
            "sovereignty",
            "service",
            "planning",
            "individuals",
            "statement",
            "utterances",
            "statements",
            "unsavoury",
            "president",
            "buharis"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "emerges",
            "popular",
            "site",
            "mobile",
            "1xbet",
            "offers",
            "account",
            "convenient",
            "place",
            "page",
            "website",
            "version",
            "launches",
            "bookmaker"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "electronic",
            "callup",
            "drivers",
            "amidst",
            "road",
            "ecall",
            "truck",
            "npa",
            "system",
            "trucks",
            "gridlock",
            "apapa",
            "roads",
            "worsening"
          ]
        }
      ]
    }
  }
}