{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Baba Ijesha: It’s criminal to molest or use a minor as trap to gather evidence — Yomi Fabiyi",
          "summary": "Kindly Share This Story:…I stand in solidarity with Princess, says Iyabo OjoBy Esther OnyegbulaSEQUEL to the released closed circuit television, CCTV, footage of a minor being sexually molested by Nollywood actor, Olarenwaju Omiyinka, alias ‘Baba Ijesha’, another actor, Yomi Fabiyi, has said that it is criminal to molest or use a minor as a trap to gather evidence.\nBut another Nollywood actress, Iyabo Ojo has thrown her weight behind popular comedian, Princess Damilola Adekoya, over the publication of the CCTV video footage by a national newspaper.\nFabiyi, who wrote on his Instagram page, said: “It is disturbing and unfortunate viewing the images of the released CCTV footage of a minor being sexually abused by a senior colleague.\nBesides, he said: “The only person free from arrest and prosecution is the young lady.\n“We are of the solemn belief it was unauthorised, unlawful and a sheer violation of the victim’s fundamental human rights to dignity, privacy and life.",
          "link": "https://www.vanguardngr.com/2021/05/baba-ijesha-its-criminal-to-molest-or-use-a-minor-as-trap-to-gather-evidence-yomi-fabiyi/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "criminal",
            "princess",
            "released",
            "iyabo",
            "yomi",
            "minor",
            "evidence",
            "stand",
            "ijesha",
            "solidarity",
            "molest",
            "footage",
            "cctv",
            "trap",
            "video",
            "share",
            "baba",
            "gather",
            "fabiyi"
          ]
        },
        {
          "title": "INSECURITY: ‘How herdsmen collaborate with NGOs to infiltrate South’",
          "summary": "Kindly Share This Story:…Ondo govt, Amotekun reactBy Dayo JohnsonFRESH facts emerged, yesterday, of how some herdsmen and bandits are devising new methods to infiltrate the Southern part of the country.\nSecurity sources informed Vanguard that buses loaded with Northern youths have been arriving in various parts of the south, especially South-West, mostly at night.\nIt was gathered that collaborators of suspected sponsors have established non-governmental organizations, NGOs, who engage in what they term ‘security surveillance jobs’.\nThe Ondo State Government Security outfit, codenamed Amotekun, evicted 42 Northern youths from Ondo State.\nVanguard learned that such groups of Fulani youths were in various parts of the state for unknown reasons.",
          "link": "https://www.vanguardngr.com/2021/05/insecurity-how-herdsmen-collaborate-with-ngos-to-infiltrate-south/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "insecurity",
            "day",
            "parts",
            "security",
            "infiltrate",
            "state",
            "ngos",
            "amotekun",
            "youths",
            "collaborate",
            "army",
            "various",
            "northern",
            "share",
            "south",
            "herdsmen"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Nigerians should repent, seek divine intervention",
          "summary": "The Eselu of Iselu kingdom in Ogun State, Oba Akintunde Akinyemi, has declared his total support for the actualisation of Yoruba nation.\nThe people agitating for Yoruba nation are doing so because they could not get the best from this nation called Nigeria.\nKabiyesi, if you eventually have a Yoruba nation, do you think there will be a difference?\nWell, whatever issue we may be having in Yoruba land, don’t forget we share the same culture, we share the same opinion and ideology.\nThey don’t need to have confrontations with the police because they don’t have any business with the police.",
          "link": "https://dailypost.ng/2021/05/04/insecurity-nigerians-should-repent-seek-divine-intervention-kebbi-gov-atiku/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "divine",
            "best",
            "insecurity",
            "need",
            "yoruba",
            "getting",
            "seek",
            "repent",
            "nation",
            "intervention",
            "nigeria",
            "dont",
            "country",
            "peacefully",
            "nigerians",
            "land"
          ]
        },
        {
          "title": "I support Yoruba nation, enough of the killings",
          "summary": "The Eselu of Iselu kingdom in Ogun State, Oba Akintunde Akinyemi, has declared his total support for the actualisation of Yoruba nation.\nThe people agitating for Yoruba nation are doing so because they could not get the best from this nation called Nigeria.\nKabiyesi, if you eventually have a Yoruba nation, do you think there will be a difference?\nSo, can it be said that you are in support of Yoruba nation?\nI don’t expect a normal person not to support Yoruba nation if we are not getting results from the country called Nigeria.",
          "link": "https://dailypost.ng/2021/05/04/i-support-yoruba-nation-enough-of-the-killings-ogun-oba-eselu-declares/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "best",
            "support",
            "need",
            "yoruba",
            "getting",
            "nigeria",
            "dont",
            "nation",
            "country",
            "peacefully",
            "killings",
            "land"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Press freedom day: Ganduje wants journalists to be accurate, objective",
          "summary": "By Fanen Ihyongo, KanoKano State Governor Abdullahi Umar Ganduje on Monday urged journalists to be resolute in maintaining accuracy, objectivity and professional ethics in their line of duty to deepen good governance without heating up the polity.\nHe spoke as a friend-of-the-press to mark the occasion of the United Nations World Press Freedom Day, celebrated on May 3, each year.\nGanduje, in a statement by the Commissioner for Information, Malam Muhammad Garba said as a crucial stakeholder, he would want journalists to exercise their profession within the realm of law and the journalism profession.\nHe said: “Accurate and factual reporting is the important part of the code of ethics guiding the journalism profession anywhere in the world.\nThe governor assured journalists that his administration would continue to be media-friendly.",
          "link": "https://thenationonlineng.net/press-freedom-day-ganduje-wants-journalists-to-be-accurate-objective/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "profession",
            "guiding",
            "objective",
            "day",
            "journalism",
            "good",
            "information",
            "press",
            "journalists",
            "public",
            "governor",
            "accurate",
            "freedom",
            "ganduje",
            "wants",
            "media"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Jonathan advocates media freedom, responsible journalism",
          "summary": "Goodluck Jonathan Foundation (GJF) has called on governments in Africa to ensure press freedom in their countries even as it calls on media professionals to use information as a tool for nation-building.\nThe foundation maintained that journalists and other media professionals are partners in progress in a quest for peace and sustainable development.\n“GJF joins the rest of the world to celebrate journalists and media professionals on this year’s world press freedom day.\n“We renew our call for press freedom, access to information and the respect of the rights of journalists in Africa.\n“In this era of digital communications and media convergence, misinformation, fake news, and hate speech are becoming threats to press freedom, justice, unity, and development.",
          "link": "https://www.sunnewsonline.com/jonathan-advocates-media-freedom-responsible-journalism/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "foundation",
            "justice",
            "journalism",
            "jonathan",
            "information",
            "press",
            "journalists",
            "public",
            "professionals",
            "peace",
            "responsible",
            "freedom",
            "advocates",
            "media"
          ]
        },
        {
          "title": "… Kalu applauds professionals, calls for objectivity",
          "summary": "Former Governor of Abia State and Senate Chief Whip, Orji Uzor Kalu, has congratulated media professionals on the occasion of the 2021 World Press Freedom Day (WPFD).\nKalu said: “I join the media industry in celebrating this year’s WPFD.\n“The media professionals should be seen as strategic partners and stakeholders in building a just and fair society.\n“The media industry should be supported by all and sundry.\nThe Senate chief whip wished media professionals a remarkable celebration.",
          "link": "https://www.sunnewsonline.com/kalu-applauds-professionals-calls-for-objectivity/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "role",
            "objectivity",
            "adding",
            "industry",
            "journalists",
            "whip",
            "kalu",
            "stakeholders",
            "media",
            "senate",
            "society",
            "applauds",
            "calls",
            "professionals"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "FG Moves to Curb Small Arms Influx, Establishes Control Centre",
          "summary": "It established the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThere was a committee on small and light weapons that was in place before.\nThe counterterrorism efforts of the government of Nigeria are mainly centred on military action and not guided by the national strategy (National Counter-Terrorism Strategy) released in 2014.\n“I truly don’t see where the establishment of a centre for small and light weapons control comes in within the existing strategy.\nNational Security Council Reconvenes TodayThe National Security Council (NSC) headed by President Muhammadu Buhari will reconvene today in Abuja to proffer lasting solutions to the security challenges facing the country.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/fg-moves-to-curb-small-arms-influx-establishes-control-centre/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "fg",
            "small",
            "security",
            "national",
            "influx",
            "strategy",
            "light",
            "control",
            "state",
            "weapons",
            "centre",
            "curb",
            "arms",
            "moves",
            "establishes",
            "borders"
          ]
        },
        {
          "title": "Bandits Threaten to Kill Abducted Greenfield University Students Today",
          "summary": "The Kaduna students, numbering about 22, were abducted on April 18 when the hoodlums invaded the school about 8:30 pm.\nJalingo said 17 students, comprising 15 girls and two boys, were in his custody, including the grandson of the late Emir of Zazzau, Alhaji Shehu Idris, whose name was given as Hamza.\nHe stated that the families of the abducted students had already paid N55 million, but they had spent the money to feed the students.\nHe said five of the abducted students were killed to prove that the state and the federal governments had failed.\nA pastor in the area, Mr. Sule Sunday, on behalf of the Christian community, expressed sadness over the persistent attack on the communities.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/bandits-threaten-to-kill-abducted-greenfield-university-students-today/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "students",
            "abducted",
            "university",
            "kill",
            "security",
            "ransom",
            "area",
            "17",
            "state",
            "greenfield",
            "herdsmen",
            "attack",
            "threaten",
            "today",
            "mr",
            "bandits"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "#MySARSStory: Out of Nowhere",
          "summary": "Godwin UdohAs we drove nearer, one of them brought out a gun and tried to hit me with it.\nThe driver of the bus had to go back to the Area Command to try again for a police report.\nWe decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\nWhen we got to the Area Command, we met some top police officials who had just arrived there.\nWith the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.",
          "link": "http://saharareporters.com/2021/05/04/mysarsstory-out-nowhere",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "family",
            "area",
            "told",
            "officers",
            "mysarsstory",
            "hospital",
            "help",
            "wife",
            "command",
            "children",
            "report"
          ]
        },
        {
          "title": "#MySARSStory: Out of Nowhere",
          "summary": "Godwin UdohAs we drove nearer, one of them brought out a gun and tried to hit me with it.\nThe driver of the bus had to go back to the Area Command to try again for a police report.\nWe decided to go back to the Area Command so they could help us with a vehicle to transport us to LUTH.\nWhen we got to the Area Command, we met some top police officials who had just arrived there.\nWith the help of the officers, and CSO there, we were given urgent attention, with the police paying the bills our treatment.",
          "link": "http://saharareporters.com/2021/05/04/mysarsstory-out-nowhere#disqus_thread",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "family",
            "area",
            "told",
            "officers",
            "mysarsstory",
            "hospital",
            "help",
            "wife",
            "command",
            "children",
            "report"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Retirement hell: BBC Africa Eye uncovers corruption in pension system",
          "summary": "Africa Eye also uncovered a list of over a thousand people in Cross River state whose pensions had been stopped because the state had decided they were no longer alive.\nAnd this doesn’t just happen in Cross River state, but is replicated in states throughout the country.\nAdvertisementAfrica Eye hears first-hand testimonies about the extreme hardship caused by being arbitrarily declared ‘dead’, and trying to survive without a pension.\nAs one politician says: “What a typical state governor takes home as pension can settle the wages of over 3-4000 teachers.\nThe government alleges members of the Pension Reform Taskforce opened fake accounts and were using them to launder money that was stolen from pension funds.",
          "link": "https://www.thecable.ng/retirement-hell-bbc-africa-eye-uncovers-corruption-in-pension-system",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "money",
            "pension",
            "pensioners",
            "system",
            "river",
            "payments",
            "eye",
            "state",
            "hell",
            "bbc",
            "retirement",
            "africa",
            "trying",
            "investigation",
            "pensions",
            "uncovers",
            "corruption"
          ]
        },
        {
          "title": "'Residents killed' as gunmen attack Benue communities",
          "summary": "Unknown gunmen have attackedsome communities in Gwer west LGA of Benue state.\nCatherine Anene, Benue police spokesperson, confirmed the attack on Monday, adding that the command has not received full details of what took place.\nAccording to NAN, Anene said the gunmen invaded Mbamondu and Vengav in Avihijume council ward in Udam, and Tse Amgbem which is around Aondona.\nCommunities in Benue have also been attacked, with residents killed and several others injured.\nFollowing the rising insecurity affecting his state, Samuel Ortom, Benue state governor, had called on the federal government to declare a state of emergency.",
          "link": "https://www.thecable.ng/residents-killed-as-gunmen-attack-benue-communities",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "residents",
            "benue",
            "recent",
            "killed",
            "gunmen",
            "invaded",
            "state",
            "anene",
            "attack",
            "communities",
            "lga"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Designing and building sustainable commercial spaces in Nigeria",
          "summary": "Their office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts.\nInnovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\nLike I said, we had a really really tight deadline.\nElements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria.",
          "link": "https://techcabal.com/2021/05/03/designing-and-building-sustainable-commercial-spaces-in-nigeria/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "commercial",
            "work",
            "company",
            "really",
            "building",
            "design",
            "sustainable",
            "centre",
            "way",
            "space",
            "nigeria",
            "designing",
            "kobo360",
            "office",
            "spaces",
            "wanted"
          ]
        },
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "board",
            "bank",
            "sacking",
            "otudeko",
            "enforces",
            "governor",
            "emefiele",
            "tradition",
            "sanusi",
            "skye",
            "bruised",
            "took",
            "cbn",
            "banks"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Obaseki recommits to press freedom, charges journalists on peace, development journalism – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991.\nIt is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.",
          "link": "http://nigerianobservernews.com/2021/05/obaseki-recommits-to-press-freedom-charges-journalists-on-peace-development-journalism/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "day",
            "journalism",
            "challenges",
            "information",
            "press",
            "peace",
            "obaseki",
            "journalists",
            "public",
            "governor",
            "freedom",
            "media",
            "observer",
            "development",
            "world",
            "nigerian",
            "recommits"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "web",
            "nightgrazing",
            "immediate",
            "wish",
            "register",
            "jan",
            "underaged",
            "prohibited",
            "cattle",
            "highways",
            "19",
            "movement",
            "outlawed"
          ]
        },
        {
          "title": "BudgIT highlights corruption in Nigeria’s budget process, calls for urgent reforms",
          "summary": "A civic-tech non-profit organisation, BudgIT, has called on the government to audit security spending and close loopholes for corruption in the budget process.\nIn the 2021 budget, a total of 117 federal agencies received allocations for “Security Votes” worth N24.3bn, despite many of these agencies already having allocations for “Security Charges” to cover each agency’s security needs.\nFurthermore, BudgIT observed that the little budgetary allocation provided to other sectors are plagued with various loopholes for leakages and theft of public funds.\n“Our investigations into the 2021 budget revealed at least 316 duplicated capital projects worth N39.5bn, with 115 of those duplicate projects occurring in the Ministry of Health.\nNigeria’s budget can be an excellent tool to accelerate economic recovery, but if the budget is left with the current loopholes, it can cover corruption and grand theft.",
          "link": "https://hallmarknews.com/budgit-highlights-corruption-in-nigerias-budget-process-calls-for-urgent-reforms/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "nigerias",
            "2021",
            "federal",
            "process",
            "agencies",
            "budget",
            "security",
            "projects",
            "loopholes",
            "budgit",
            "provided",
            "sectors",
            "highlights",
            "urgent",
            "calls",
            "reforms",
            "allocations",
            "corruption"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "AFN Crisis: Focus On Your Training, Leave Administrators With Bickering, Minister Charges Athletes",
          "summary": "While showering encomium on some of athletes for their impressive performance so far, he urged them to remain focused in unity and leave self-seeking administrators with their bickering, saying Nigeria has a brighter chance of podium performance in Tokyo.\nLeave us with administrators and all them alone, don’t listen to their noise, focus on your training and goal ahead.\n“You’re the Team Nigeria and we’ll support you.\nWhether you are home-based or foreign-based, Team Nigeria is one hence we decided to take you to the US to join others so that you can blend as a team,” Dare said.\nADVERTISEMENTThe minister also made a surprise announcement after watching the home-based athletes training at the Moshood Abiola National Stadium in Abuja by adopting Enock Adegoke under the ‘Adopt-an-Athlete Initiative’.",
          "link": "https://leadership.ng/afn-crisis-focus-on-your-training-leave-administrators-with-bickering-minister-charges-athletes/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "saying",
            "stadium",
            "minister",
            "afn",
            "focus",
            "podium",
            "performance",
            "olympics",
            "leave",
            "training",
            "administrators",
            "nigeria",
            "charges",
            "team",
            "crisis",
            "bickering",
            "athletes"
          ]
        },
        {
          "title": "NTTF Presidency: Stakeholders To Determine My Ambition For -Tikon",
          "summary": "ADVERTISEMENTBy Olawale Ayeni, AbujaChairman of Nigeria Table Tennis Federation (NTTF) caretaker committee, Ishaku Tikon, has said that his ambition to seek reelection as the president of the NTTF would be strongly determined by the stakeholders.\nTikon, who spoke to LEADERSHIP Sports, said he would be meeting with the stakeholders when they converged in Lagos for the 2021 National Open Championship later this month where his future would be decided ahead of the upcoming federations election.\n“We just have Aso Table Tennis competition and then after the Salah break we will be holding the National Open Championship in Lagos where all the stakeholders will converge for the event.\nThese are some of the programmes to show the stakeholders if I have fulfilled my campaign promises in the last four years.\nIt should be noted that under Tikon’s tenure as the president of the NTTF the country’s table tennis federation has witnessed a significant turnaround as more athletes have been ranked among the best in the world.",
          "link": "https://leadership.ng/nttf-presidency-stakeholders-to-determine-my-ambition-for-tikon/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "determine",
            "table",
            "president",
            "national",
            "later",
            "say",
            "tennis",
            "tikon",
            "stakeholders",
            "open",
            "ambition",
            "presidency",
            "reelection",
            "nttf"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Updated: Bandits threaten to kill 17 varsity students — Daily Times Nigeria",
          "summary": "The bandits issued the threat in an interview with the Hausa Service of Voice of America (VOA), monitored in Kaduna.\nHe vowed that it was his final warning and should government or the students’ families fail to meet his demands, all the students will be killed.\nWe heard the utterances of the Kaduna State Governor that he will not pay ransom to bandits to purchase additional arms,” he said.\nIn a related development, abductors of Mr. Pius Kolawole, Chairman of Yagba West Local government in Kogi State have demanded N100 million for the release of the elected chairman.\nReportedly, the kidnappers also have reached the Kogi State Chairman, Association of Local Government of Nigeria (ALGON), Mr. Taofik Isah who doubled as the chairman of Ijumu Council Area.",
          "link": "https://dailytimes.ng/updated-bandits-threaten-to-kill-17-varsity-students/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "motorcycles",
            "varsity",
            "million",
            "bandits",
            "kill",
            "kogi",
            "chairman",
            "threaten",
            "students",
            "fail",
            "daily",
            "state",
            "pay",
            "remaining",
            "updated",
            "17",
            "families",
            "nigeria",
            "times"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "FG extends NIN-SIM linkage till June 30",
          "summary": "The ongoing National Identification Number and Subscriber Identity Module integration exercise has been extended till June 30, 2021, Minister of Communications and Digital Economy, Isa Pantami, has said.\nThis was contained in a statement jointly signed by the Director, Public Affairs, Nigerian Communications Commission, Ikechukwu Adinde; and the Head, Corporate Communications, National Identity Management Commission, Káyọ̀dé Adegoke.\nThe minister, who has been under fore of late over his past pro-Taliban radical comments, was also said to have disclosed that 54 million SIM cards have been linked with NIN.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading...",
          "link": "https://daylightng.com/fg-extends-nin-sim-linkage-till-june-30/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "fg",
            "30",
            "subscriber",
            "sim",
            "identity",
            "minister",
            "national",
            "ninsim",
            "till",
            "communications",
            "statement",
            "extends",
            "twitterfacebooklike",
            "commission",
            "linkage"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Importance Of World Press Freedom Day",
          "summary": "May 3, 2021 205As people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\nHistory of World Press Freedom DayThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.",
          "link": "https://bizwatchnigeria.ng/importance-of-world-press-freedom-day/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "united",
            "countries",
            "day",
            "importance",
            "press",
            "journalists",
            "territories",
            "freedom",
            "nigeria",
            "world",
            "themed"
          ]
        },
        {
          "title": "ANALYSIS: New Policy Fails To Reverse Gas Flaring, Importation",
          "summary": "May 3, 2021 412To reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent.",
          "link": "https://bizwatchnigeria.ng/analysis-new-policy-fails-to-reverse-gas-flaring-importation/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "petroleum",
            "flaring",
            "target",
            "importation",
            "cooking",
            "fails",
            "reverse",
            "2020",
            "analysis",
            "nigeria",
            "oil",
            "gas",
            "policy",
            "nigerian",
            "country"
          ]
        }
      ]
    }
  }
}