{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Insecurity: Tearful Ortom, Reps, call for emergency",
          "summary": "Mr. President must rise.\nMr. President must rise to address the nation himself, not his aides.\nThe body language, the action and inaction of Mr. President shows that he is only the President of Fulani people.\nHis body language is what is being played out; Mr President gives orders, another person, a minister comes and counters.\nI am not the Commander-in-Chief of the Armed Forces, Mr President is the Commander-in-Chief of the Armed Forces.",
          "link": "https://www.vanguardngr.com/2021/04/insecurity-tearful-ortom-reps-call-for-emergency/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "idps",
            "house",
            "emergency",
            "mr",
            "state",
            "country",
            "states",
            "governor",
            "insecurity",
            "president",
            "reps",
            "tearful",
            "situation",
            "ortom"
          ]
        },
        {
          "title": "NPA appoints 4 GMs and 8 AGMs",
          "summary": "Kindly Share This Story:By Providence AdeyinkaTHE Nigerian Ports Authority, NPA, has announced the appointment of four new general managers and eight assistant general managers.\nThe newly appointed general managers are: Olaseni Alakija, who becomes general manager, corporate and strategic communications, Patricia Aboh (Mrs), general manager Servicom; Engr.\nSylvester Nwankwo, general manager, MD’s Office and Engr (Mrs.) Anthonia Ohagwa, general manager, ICT.\nOthers include Benjamin Oluyori; AGM, Enterprise and Risk Management, Ruth Boyo (Mrs), AGM, Investments, Engr.\nWith these appointments, the Authority has a total number of 21 GMs and 60 AGMs.",
          "link": "https://www.vanguardngr.com/2021/04/npa-appoints-4-gms-and-8-agms/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "npa",
            "managers",
            "gms",
            "agm",
            "appoints",
            "strategic",
            "general",
            "communications",
            "manager",
            "corporate",
            "authority",
            "mrs",
            "agms",
            "engr"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Nigerians will storm Abuja, force Buhari out of Aso Rock",
          "summary": "The situation in Niger State is fast becoming hopeless, as two LGAs, Munya and Shiroro, have practically become bandits’ killing fields.\nRespected Nobel Laureate, Professor Wole Soyinka, shortly after the killing of three of the abducted students of Greenfield University, pointedly told President Buhari to swallow his pride and seek for help!\nThey also claimed that the security situation in the country had improved from what it used to be under the Goodluck Jonathan administration that ended on May 29, 2015.\nHe said: “I am confirming that there are Boko Haram elements in Niger State, around Kaure.\nHe said: “It is obvious that President Muhammadu Buhari and the All Progressives Congress government need help.",
          "link": "https://dailypost.ng/2021/04/28/insecurity-nigerians-will-storm-abuja-force-buhari-out-of-aso-rock-pastor-giwa/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "haram",
            "storm",
            "state",
            "country",
            "force",
            "nigerians",
            "buhari",
            "abuja",
            "insecurity",
            "president",
            "boko",
            "rock",
            "help",
            "situation",
            "aso"
          ]
        },
        {
          "title": "Pantami is part of Buhari's plan to islamise Nigeria",
          "summary": "The situation in Niger State is fast becoming hopeless, as two LGAs, Munya and Shiroro, have practically become bandits’ killing fields.\nAccording to Soyinka, Nigeria is at war but the government continues to pretend that “these are mere birth-pangs of a glorious entity”.\nThey also claimed that the security situation in the country had improved from what it used to be under the Goodluck Jonathan administration that ended on May 29, 2015.\nHe said: “I am confirming that there are Boko Haram elements in Niger State, around Kaure.\nHe is the President of the Federal Republic of Nigeria and over the 250 nationalities that are in this country; Mr President is their President, we all voted him.",
          "link": "https://dailypost.ng/2021/04/28/pantami-is-part-of-buharis-plan-to-islamise-nigeria-massob/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "haram",
            "pantami",
            "state",
            "country",
            "islamise",
            "buhari",
            "nigerians",
            "president",
            "boko",
            "help",
            "buharis",
            "situation",
            "plan",
            "nigeria"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "‘10m jobs can come from mushroom subsector’",
          "summary": "The President of the group, Chief Michael Awunor, said mushroom can increase the country’s non-oil earnings.\nAwunor spoke at a briefing on the first National Mushroom Summit/ Exhibition with the theme, ‘Harnessing the nation non-oil commodities through the development of mushroom value chain’ scheduled for Abuja.\nADVERTISEMENTHe said the world production for mushroom in 2018 was 8.99million tons with China producing 46 per cent of global output.\nThe global market for mushroom is quite huge and growing exponentially.\nHe also said the growing market for mushroom is due to the rising awareness for healthy foods which made mushroom highly preferred substitute for meat in protein, vitamin and minerals.",
          "link": "https://thenationonlineng.net/10m-jobs-can-come-from-mushroom-subsector/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "10m",
            "value",
            "growing",
            "chain",
            "mushroom",
            "market",
            "global",
            "come",
            "subsector",
            "production",
            "tons",
            "increase",
            "nonoil",
            "jobs"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Boko Haram may overrun Abuja, Senators warn",
          "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.",
          "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "haram",
            "target",
            "senate",
            "overrun",
            "state",
            "abuja",
            "communities",
            "president",
            "boko",
            "senators",
            "warn",
            "niger",
            "terrorists"
          ]
        },
        {
          "title": "Insecurity: Buhari begs international community for support",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, urged the United States to reconsider relocating its Africa Command (AFRICOM) from Stuttgart, Germany to Africa, nearer the Theatre of Operation, and implored the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers to other countries.\nA statement by Special Adviser to the President on Media and Publicity, Femi Adesina, quoted Buhari as stating this in a virtual meeting with US Secretary of State, Mr. Anthony Blinken.\nCompounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes.\n“Nigeria attaches great importance to its relations with the United States.\nPresident Buhari noted that Nigeria remains resolute in its commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.",
          "link": "https://www.sunnewsonline.com/insecurity-buhari-begs-international-community-for-support/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "nigeria",
            "partners",
            "support",
            "nations",
            "united",
            "buhari",
            "begs",
            "states",
            "insecurity",
            "president",
            "international",
            "muslim",
            "africa",
            "community"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "N’Assembly Laments over Worsening Insecurity as Buhari Seeks US’ Help",
          "summary": "In the Senate, many senators fumed over the worsening insecurity and mandated its leadership to book an appointment with the president and service chiefs to discuss the issue and proffer solutions.\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes.\nFemi Gbajabiamila, read the resolutions of the lawmakers after a three-hour executive session yesterday to discuss the deteriorating security situation in the country.\nAtiku, Saraki Proffer SolutionsMeanwhile, a former Senate President, Dr. Bukola Saraki, has advised Buhari to seek help to tackle the increasing insecurity in the country.\nHe said: “It is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/nassembly-laments-over-worsening-insecurity-as-buhari-seeks-us-help/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "seeks",
            "senate",
            "nassembly",
            "house",
            "state",
            "worsening",
            "buhari",
            "laments",
            "insecurity",
            "president",
            "service",
            "help",
            "africa",
            "situation",
            "nigeria"
          ]
        },
        {
          "title": "Tambuwal, El-Rufai Rally North-west States to Combat Banditry",
          "summary": "By John ShiklamKaduna State Governor, Mallam Nasir el-Rufai, and his Sokoto State counterpart, Hon.\nAminu Tambuwal, yesterday called for cooperation among the seven states in the North-west in tackling banditry and kidnapping.\nHe stated that governors of the seven states in the North-west have been working closely with President Muhammad Buhari to end banditry and kidnapping in the zone.\nTambuwal said the latest was the murder of a Divisional Police Officer (DPO) and eight policemen in Kebbi on Monday and the recent attack on Dange Local Government of Sokoto State, during which lives were lost.\nThe Kaduna State Government said it had been consistently transparent about its security challenges.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/tambuwal-el-rufai-rally-north-west-states-to-combat-banditry/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "northwest",
            "rally",
            "banditry",
            "state",
            "statement",
            "sokoto",
            "states",
            "criminals",
            "kaduna",
            "combat",
            "tambuwal",
            "elrufai",
            "surrender"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": []
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Corps member accuses Ogun school principal of assault",
          "summary": "A video has surfaced and gone viral wherein a corps member alleged that she was assaulted by the principal of a school she was posted to for her place of primary assignment (PPA) in Ogun state.\nThe corps member claimed that when she met the school principal, he started insulting her during their conversation.\nWhile it remained unclear what led to the face-off between the pair, she alleged that the principal also beat her.\nShe went ahead to accuse other staff of the school of backing the principal during the incident.\nAll the staff in the school are also supporting him.”The principal could, however, be heard in the video dismissing the corps member’s claim.",
          "link": "https://lifestyle.thecable.ng/corps-member-accuses-ogun-school-principal-of-assault/#new_tab",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "accuses",
            "beat",
            "thecable",
            "school",
            "member",
            "principal",
            "post",
            "corps",
            "video",
            "stone",
            "staff",
            "ogun",
            "posted",
            "assault"
          ]
        },
        {
          "title": "Beyoncé and I won’t force our kids into showbiz, says Jay-Z",
          "summary": "Jay-Z, US rapper and record producer, says he and Beyoncé, his wife, will not force their kids into showbusiness.\nAdvertisementThe 51-year-old spoke with The Times about life in quarantine with his wife, Blue Ivy, their 9-year-old daughter, and their twins Rumi and Sir.\nHe said he’s aware of the legacy his children may feel like they have to live up to but added that he and Beyoncé have a plan.\nI have no idea, right?\nBeyond music, Jay-Z has continued to gain influence as an entrepreneur.",
          "link": "https://lifestyle.thecable.ng/beyonce-and-i-wont-force-our-kids-into-showbiz-says-jay-z/#new_tab",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "idea",
            "right",
            "ivy",
            "showbiz",
            "im",
            "jayz",
            "force",
            "beyoncé",
            "wife",
            "really",
            "loving",
            "wont",
            "music",
            "kids"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria",
          "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.",
          "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "itoro",
            "bringing",
            "medical",
            "clafiya",
            "communities",
            "access",
            "health",
            "hospitaltohome",
            "services",
            "jennie",
            "rural",
            "inoyo",
            "healthcare",
            "plan",
            "nwokoye",
            "nigeria"
          ]
        },
        {
          "title": "Can NIBSS save BVN from bank scams and be a fair umpire?",
          "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.",
          "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "fintechs",
            "scams",
            "umpire",
            "save",
            "nibss",
            "bvn",
            "access",
            "nigerias",
            "customers",
            "bank",
            "data",
            "banks",
            "number",
            "fair"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "appealing",
            "appeal",
            "force",
            "student",
            "video",
            "rescue",
            "students",
            "kidnapped",
            "free",
            "sale",
            "come",
            "sent",
            "soldiers",
            "yusuf",
            "govt",
            "dont"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "suspects",
            "warri",
            "bodies",
            "decomposing",
            "recover",
            "recovered",
            "suspected",
            "phones",
            "abraka",
            "peddlers",
            "corpses",
            "car",
            "delta",
            "drug",
            "arrest",
            "siblings",
            "led"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer",
          "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.",
          "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "god",
            "state",
            "country",
            "nigerian",
            "lasting",
            "fairness",
            "insecurity",
            "governor",
            "observer",
            "level",
            "equity",
            "peace",
            "justice",
            "ortom",
            "nigeria"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "prohibited",
            "cattle",
            "jan",
            "19",
            "register",
            "outlawed",
            "movement",
            "wish",
            "underaged",
            "highways",
            "nightgrazing",
            "web",
            "immediate"
          ]
        },
        {
          "title": "Abiodun seeks collaboration with Ogun indigenes in military, others to tackle insecurity",
          "summary": "Kunle IdowuThe Ogun State governor, Dapo Abiodun, has expressed the readiness of his administration to collaborate with indigenes of the state who are high ranking officers in the military and paramilitary agencies to find solution to the issues of insecurity.\nThe governor equally said that his administration would be hosting the officers to motivate and celebrate their achievements.\nHe made this known on Monday when he received the new Brigade Commander, 35 Artillery Brigade, Alamala, Abeokuta, Brigadier General Adewale Abiodun Adekoya, in his office at Oke Mosan, Abeokuta.\nAdekoya is an indigene of Ogun state from Ago-Iwoye in the Ijebu North Local Government Area of the state.\nIn his remarks, the former Brigade Commander, Joseph Amadasun appreciated the state governor for his unalloyed support to security agencies in the state, attributing his success to the continuous support of the state governor.",
          "link": "https://hallmarknews.com/abiodun-seeks-collaboration-with-ogun-indigenes-in-military-others-to-tackle-insecurity/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "seeks",
            "collaboration",
            "military",
            "act",
            "support",
            "tackle",
            "state",
            "brigade",
            "governor",
            "insecurity",
            "ogun",
            "commander",
            "indigenes",
            "abiodun",
            "necessary",
            "administration"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Insecurity: ADC Wants APC, FG to End Spate of Killing",
          "summary": "The African Democratic Congress (ADC) yesterday called on the All Progressive Congress ( APC ) led Federal goverment to end the spare of killings , banditry and kidnappings in varroius parts of the country.\n“ Today, the security situation in the country has come down to zero, the party in goverment must rise to end it now, we cannot afford to be losing innocent Nigerians , civilians, police officers and soldiers, the time for the governent to act is now.\nHe said” In 22 years of our democracy, PDP and APC have done so much damage to the peace, security and instability of Nigeria.\nIt appears that they now target to destroy the future of our Youths from Chibok school girls to the current Spate of kidnapping, killings and bizarre terrorist activities, it is time for APC and PDP to leave governance and save our country.\nADVERTISEMENT“Our hearts bleed for the youths that have been killed by bandits everywhere across Nigeria and especially, the Green Field University students that have become targets of daily murder and butchering, enough is enough",
          "link": "https://leadership.ng/insecurity-adc-wants-apc-fg-to-end-spate-of-killing/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "end",
            "security",
            "spate",
            "adc",
            "country",
            "party",
            "save",
            "goverment",
            "insecurity",
            "apc",
            "killing",
            "yesterday",
            "senseless",
            "fg",
            "youths",
            "wants",
            "killings"
          ]
        },
        {
          "title": "Declare State Of Emergency On Security, Reps Tell Buhari",
          "summary": "* Seek immediate recruitment into police, armed forces |By ADEBIYI ADEDAPO, AbujaThe House of Representatives on Tuesday urged President Muhammadu Buhari to declare a state of emergency in the security sector.\n“Considering the security situation, the President should immediately declare a State of Emergency on Security so as to fast track all measures to ensure the restoration of peace in the country,” Gbajabiamila said.\nThey also urged government to provide emergency relief to all communities that have been adversely affected by recent attacks across the country.\n“The President should as a matter of urgency, ensure financial autonomy to Local Government Councils to guarantee their functionality to serve the local populace.\n“The Federal Government should ensure the protection of National Infrastructure assets, particularly the Shiroro and Kainji Dams in Niger State.",
          "link": "https://leadership.ng/declare-state-of-emergency-on-security-reps-tell-buhari-2/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "security",
            "house",
            "emergency",
            "state",
            "country",
            "buhari",
            "tell",
            "local",
            "president",
            "terrorism",
            "urged",
            "reps",
            "declare",
            "ensure"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Imah, Orika, Others Enjoin Mbala People To Participate Actively In Abia Politics",
          "summary": "Edozie Richard Imah has called on the people of Mbala Isuochi in the Umunneochi Local Government Area of Abia State to wake up from their slumber and participate actively in the build-up to the 2023 general elections in Nigeria.\nImah spoke at the first Mbala political summit which held recently at his palatial home at Umuobasi Mbala Isuochi, in the Umunneochi Local Government Area of Abia State.\n“The political summit is the first in the series lined up this year.\nIn a keynote address at the occasion, former governorship aspirant in Abia State, Surv.\nOrika noted that the greatest challenge faced by Mbala people in the politics of Umunneochi and indeed, Abia State is the people’s apathy towards politics and insisted that as long as this attitude is sustained, Mbala will continue to lag behind in Umunneochi nay Abia politics.",
          "link": "https://daylightng.com/imah-orika-others-enjoin-mbala-people-to-participate-actively-in-abia-politics/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "isuochi",
            "support",
            "actively",
            "state",
            "enjoin",
            "politics",
            "umunneochi",
            "abia",
            "orika",
            "imah",
            "summit",
            "participate",
            "political",
            "mbala",
            "community"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}