{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Wellbeing of Lagos residents, non-negotiable — Sanwo-Olu assures",
          "summary": "Sanwo-Olu, also speaking at the Lagos State Occupational Safety and Health Conference, organized by the Lagos State Safety Commission, LSSC, in commemoration of this year’s ‘World Day for Safety,’ to enforce occupational safety guidelines in workplaces, saying the safety of the residents can no longer be taken for granted.\nOn the wellbeing of residents, the governor, made the pledge on Wednesday, at the commissioning of Blood Transfusion Service Office, Oxygen Plant and Oxygen Triage Centre and ground-breaking of Doctors’ 24-unit staff quarters at Gbagada General Hospital in Lagos.\nAlso read:Governor Sanwo-Olu said the three critical health facilities and state-of-the-art equipment are vital projects that will scale up his administration’s most recent achievements in the health sector to further enhance healthcare service delivery to residents.\n“We will continue to ensure that all Lagosians have access to quality healthcare irrespective of their socio-economic status.\nSpeaking at the event, Lagos State Commissioner for Health, Prof. Akin Abayomi, said his ministry is working systematically to rehabilitate Gbagada General Hospital and other hospitals in the State and build new hospitals.",
          "link": "https://www.vanguardngr.com/2021/04/wellbeing-of-lagos-residents-non-negotiable-sanwo-olu-assures/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "wellbeing",
            "lagos",
            "healthcare",
            "nonnegotiable",
            "safety",
            "health",
            "oxygen",
            "sanwoolu",
            "blood",
            "assures",
            "state",
            "sector",
            "quality",
            "residents"
          ]
        },
        {
          "title": "We've seized over N80b worth of illicit drugs in 100 days ― NDLEA",
          "summary": "Kindly Share This Story:The National Drug Law Enforcement Agency (NDLEA) has intercepted and seized 200 million kilograms of assorted drugs with a street value of over N80 billion, NDLEA chairman, retired Brig.\nAccording to him, banditry, terrorism and other related crimes were generally triggered by intake and consumption of illicit drugs.\n“The NDLEA has remained upstanding and in 100 days, we have made these heavy and large arrests and seizures.\nIn his remarks, the Acting Inspector General of Police, Usman Baba, commended the NDLEA for the number of seizures so far made.\n“We want to assure the agency that we will always be ready to work and do anything to ensure the use of illicit drugs and substances were curbed and reduced to the barest minimum.",
          "link": "https://www.vanguardngr.com/2021/04/weve-seized-over-n80b-worth-of-illicit-drugs-in-100-days-%e2%80%95-ndlea/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "days",
            "seized",
            "illicit",
            "work",
            "100",
            "share",
            "support",
            "n80b",
            "baba",
            "ndlea",
            "weve",
            "usman",
            "worth",
            "drugs",
            "collaboration",
            "substances"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Agba Jalingo’s detention: ECOWAS Court to rule in suit against Nigeria",
          "summary": "The ECOWAS Court of Justice will on June 29, 2021 deliver judgement in a suit against Nigeria and Cross River State, challenging the arrest and prosecution of a journalist, Agba Jalingo.\nAt a virtual court session, the court heard his oral testimony.\nThe applicant contends that the defendants and their agents have consistently used the provisions of the Terrorism Act, Cybercrime Act and other repressive laws to harass, arbitrarily arrest, detain and prosecute journalists, activists and other Nigerians.\nSERAP wants an order directing the defendants to drop all charges against Jalingo and unconditionally set him free from prison.\nThe court had struck out the second defendant, Cross River State from the suit, for not being a proper defendant before the ECOWAS Court, and a signatory of the Revised Treaty of ECOWAS.",
          "link": "https://dailypost.ng/2021/04/28/agba-jalingos-detention-ecowas-court-to-rule-in-suit-against-nigeria/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "court",
            "agba",
            "ecowas",
            "nigeria",
            "detention",
            "jalingo",
            "act",
            "defendants",
            "terrorism",
            "state",
            "suit",
            "jalingos",
            "river",
            "rule"
          ]
        },
        {
          "title": "2023: INEC announces plans to create over polling units",
          "summary": "The Independent National Electoral Commission, INEC, has announced plans to create additional two thousand four hundred and twenty four polling units in Rivers State.\nThe move takes the total number of polling units in the state to six thousand eight hundred and sixty six.\nThe Resident Electoral Commission, REC in Rivers state, Obo Effanga who made the disclosure in a media briefing in Port Harcourt, said the last time additional polling units were created in Nigeria was twenty five years ago.\nIn his words, “We know where the new polling units will be created and that is what we are implementing”“Currently in Rivers state, there are four thousand four hundred and forty two polling units and based on the lower threshold of five hundred and higher threshold of seven hundred and fifty registered voters determined by the commission, INEC looks to convert two thousand four hundred and twenty four voting points in Rivers state to polling units.\n“When this new proposed polling units are verified and ratified, the total number of polling units will be about six thousand eight hundred and sixty six and those number we believe will be adequate to serve the current registered voters of three million, three two hundred and eighteen thousand two hundred and seventy three.”The REC also announced that the continuous voter’s registration will commence on June 28, 2021 across the country, adding that all new registrants and current voters would be transferred to the new polling units where they fall into.",
          "link": "https://dailypost.ng/2021/04/28/2023-inec-announces-plans-to-create-over-polling-units/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "polling",
            "threshold",
            "voters",
            "commission",
            "units",
            "state",
            "plans",
            "thousand",
            "2023",
            "number",
            "inec",
            "announces",
            "rivers",
            "create",
            "total"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Athletes to undergo daily COVID-19 tests during Tokyo Games",
          "summary": "Agency ReporterAthletes and all those in close contact with them will be tested every day during the Tokyo Olympic Games, organisers announced in Tokyo on Wednesday.\nThe meeting also had representatives of the Tokyo metropolitan government, the Japanese government and the International Paralympic Committee (IPC) in attendance.\nADVERTISEMENTBach said at the virtual meeting that the IOC was “fully committed to the successful and safe delivery of the Olympic and Paralympic Games”.\nThe playbooks added some “new rules which have to be observed by everyone involved in the Games during their stay in Japan”.\n“All other Games participants will be tested daily for three days after their arrival.",
          "link": "https://thenationonlineng.net/athletes-to-undergo-daily-covid-19-tests-during-tokyo-games/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "public",
            "days",
            "games",
            "participants",
            "olympic",
            "tested",
            "japan",
            "tests",
            "covid19",
            "athletes",
            "meeting",
            "tokyo",
            "principle",
            "daily",
            "undergo"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Buhari presides over 43rd virtual cabinet meeting",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is presiding over the 43rd virtual meeting of the Federal Executive Council (FEC) at the First Lady Conference Room, Presidential Villa, Abuja.\nVice President Yemi Osinbajo, Secretary to the Government of the Federation Boss Mustapha and Chief of Staff to the President Ibrahim Gambari are physically attending the meeting, which started at 10:00 am.\nSeven ministers are physically attending the meeting.\nThey include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed; Justice, Abubakar Malami and Foreign Affairs, Geoffery Onyeama.\nThe Head of Service of the Federation, Dr. Folasade Yemi-Esan and other Ministers are participating in the weekly cabinet meeting from their various offices in Abuja.",
          "link": "https://www.sunnewsonline.com/buhari-presides-over-43rd-virtual-cabinet-meeting/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "presides",
            "43rd",
            "mohammed",
            "physically",
            "federation",
            "meeting",
            "minister",
            "federal",
            "buhari",
            "attending",
            "cabinet",
            "ministers",
            "affairs",
            "virtual",
            "president"
          ]
        },
        {
          "title": "Boko Haram may overrun Abuja, Senators warn",
          "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.",
          "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "boko",
            "communities",
            "senators",
            "haram",
            "target",
            "state",
            "abuja",
            "terrorists",
            "overrun",
            "warn",
            "senate",
            "niger",
            "president"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "First Bank Appoints Shobo MD/CEO, Adeduntan Retires",
          "summary": "By Obinna ChimaThe Board of Directors of First Bank of Nigeria Limited has approved the appointment of Mr. Gbenga Shobo as its Managing Director/Chief Executive Officer (CEO), effective today (Wednesday).\nUntil the appointment, Shobo was the bank’s Deputy Managing Director.\nShobo succeeds Mr. Adesola Adeduntan, who will be leaving the financial institution in accordance with its term limits for Chief Executives, after leading the bank since January 2016.\nCommenting on the appointment, the Chairman, First Bank, Mrs. Ibukun Awosika said: “We are proud to announce Gbenga Shobo as our new MD/CEO.\nWe wish him well in his future endeavours outside the FirstBank Group.”The statement explained that Shobo has had a successful career in the bank and elsewhere, culminating in his appointment as Deputy Managing Director.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/first-bank-appoints-shobo-md-ceo-adeduntan-retires/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "bank",
            "mr",
            "mdceo",
            "appointment",
            "subject",
            "director",
            "managing",
            "term",
            "shobo",
            "deputy",
            "adeduntan",
            "executive",
            "appoints",
            "retires"
          ]
        },
        {
          "title": "News in Photographs: Security Tops Agenda as Buhari Chairs FEC Meeting",
          "summary": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with President Muhammadu Buhari presiding.\nThe meeting holding at the First Lady’s Conference Room, is physically being attended by Vice President Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha, and Chief of Staff to the President, Prof Ibrahim Gambari.\nSeven Ministers who are also physically attending the meeting include those of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed; Justice, Abubakar Malami and Foreign Affairs, Geoffery Onyeama.\nOther Ministers and the Head of Service of the Federation, Dr. Folasade Yemi-Esan, are participating in the weekly cabinet meeting from their various offices in Abuja.\nThe meeting is expected to discuss the rising wave of insecurity in th3 country.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/news-in-photographs-security-tops-agenda-as-buhari-chairs-fec-meeting/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "chairs",
            "agenda",
            "weekly",
            "mohammed",
            "tops",
            "holding",
            "physically",
            "state",
            "meeting",
            "security",
            "federation",
            "federal",
            "photographs",
            "fec",
            "buhari",
            "ministers",
            "president"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Boko Haram Releases Photos Of Newly Acquired Armoured Tanks, Operation Vehicles, Others Captured From Nigerian Army",
          "summary": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have displayed different models of armoured tanks and operational hilux vehicles the group captured from Nigerian soldiers.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in Northeastern Nigeria.\nSee Also Boko Haram Boko Haram Kills ‘Many Soldiers’, Displays Armed Personnel Carrier, SUVs, Ammunition Captured From Nigerian MilitaryHundreds of soldiers and officers have been reportedly killed since January 2021.\nThe group also claimed four military vehicles were destroyed.\nSaharaReporters gathered that the soldiers were on patrol to clear some Boko Haram elements in the area following credible intelligence when they were ambushed by the group.",
          "link": "http://saharareporters.com/2021/04/28/boko-haram-releases-photos-newly-acquired-armoured-tanks-operation-vehicles-others",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "boko",
            "releases",
            "newly",
            "operation",
            "haram",
            "captured",
            "soldiers",
            "group",
            "killed",
            "tanks",
            "military",
            "state",
            "photos",
            "nigerian",
            "vehicles"
          ]
        },
        {
          "title": "Boko Haram Releases Photos Of Newly Acquired Armoured Tanks, Operation Vehicles, Others Captured From Nigerian Army",
          "summary": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have displayed different models of armoured tanks and operational hilux vehicles the group captured from Nigerian soldiers.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in Northeastern Nigeria.\nSee Also Boko Haram Boko Haram Kills ‘Many Soldiers’, Displays Armed Personnel Carrier, SUVs, Ammunition Captured From Nigerian MilitaryHundreds of soldiers and officers have been reportedly killed since January 2021.\nThe group also claimed four military vehicles were destroyed.\nSaharaReporters gathered that the soldiers were on patrol to clear some Boko Haram elements in the area following credible intelligence when they were ambushed by the group.",
          "link": "http://saharareporters.com/2021/04/28/boko-haram-releases-photos-newly-acquired-armoured-tanks-operation-vehicles-others#disqus_thread",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "boko",
            "releases",
            "newly",
            "operation",
            "haram",
            "captured",
            "soldiers",
            "group",
            "killed",
            "tanks",
            "military",
            "state",
            "photos",
            "nigerian",
            "vehicles"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Basketmouth announces release date for ‘The Confession of a Bandit’",
          "summary": "Basketmouth, Nigerian comedian, says he will be releasing a new short film titled ‘The Confession of a Bandit’ on May 3.\nAdvertisementThe 42-year-old entertainer took to his Instagram page on Tuesday to announce the release date alongside the poster for his latest production.\nThe much-anticipated film is also expected to feature a number of comedians including Funnybone, Buchi, and Senator.\nBasketmouth recently started a web series titled ‘Papa Benji’ and thereafter accompanied the project with the release of ‘Yabasi’, a highlife album.\nThe comedian had also partnered with Filmone, a movie production company, to produce his first feature film ‘Scorpio’ in October 2020.",
          "link": "https://lifestyle.thecable.ng/basketmouth-release-date-the-confession-of-a-bandit/#new_tab",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "series",
            "feature",
            "comedian",
            "basketmouth",
            "release",
            "post",
            "date",
            "instagram",
            "film",
            "confession",
            "announces",
            "titled",
            "bandit",
            "yabasi"
          ]
        },
        {
          "title": "INEC to release 2023 elections time table after Anambra guber poll",
          "summary": "The Independent National Electoral Commission (INEC) will release the schedule for the 2023 general elections after the November 6 governorship poll in Anambra state.\nAdvertisementMahmood Yakubu, INEC chairman, disclosed this at a public hearing on the electoral act amendment bill organised in Abuja on Wednesday.\n“By the principle established by the commission, the 2023 general elections will hold on Saturday, February 18, 2023 which is exactly one year, nine months, two weeks and six days or 660 days from today,” he said.\nAdvertisement“We hope to release the timetable and schedule of activities for the general election immediately after the Anambra governorship election scheduled to hold on 6th November 2021.\nAdvertisement“Of the numerous responsibilities carried out by the commission, the prosecution of electoral offenders, has been one of the most challenging,” he said.",
          "link": "https://www.thecable.ng/inec-to-release-2023-elections-time-table-after-anambra-guber-poll",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "table",
            "guber",
            "anambra",
            "electoral",
            "release",
            "general",
            "schedule",
            "election",
            "sponsors",
            "elections",
            "commission",
            "2023",
            "prosecution",
            "poll",
            "inec"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Tunecore’s Jade Leaf is putting people first as she creates infrastructure for the African music industry",
          "summary": "“I grew up in a place called Durban in South Africa.”This is how Jade Leaf begins her story.\n“I was like, here’s something that’s half art, half science,” she told me as we talked about her time studying architecture at the University of Cape Town (UCT).\nThese agencies were in Cape Town because a lot of the brands were there – from Adidas to Woolworths.\nJade Leaf and Shekhinah“I think it was the single biggest move of my career.\nOne of the things about Tunecore’s offering that Jade Leaf is most proud of is their commitment to giving independent artists 100% of their revenue without taking any cuts.",
          "link": "https://techcabal.com/2021/04/28/tunecores-jade-leaf-is-creating-infrastructure-for-the-african-music-industry/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "degree",
            "town",
            "leaf",
            "infrastructure",
            "jade",
            "creates",
            "african",
            "role",
            "cape",
            "tunecores",
            "music",
            "artists",
            "think",
            "putting",
            "marketing",
            "industry"
          ]
        },
        {
          "title": "South Africa’s richest black couple float $2million agritech funding programme with Milken Institute",
          "summary": "A funding initiative focused on driving technological innovations and new business models for Africa has been announced today by Milken Institute and Motsepe Foundation.\nMilken Institute is a non-profit think tank based in the United States.\nPatrice Motsepe, as of press time, is worth $3.1bn and Africa’s 9th richest man according to Forbes.\nAt the heart of the Motsepes’ initiative with Milken Institute is spurring innovation that will be in line with the United Nations Sustainable Development Goals.\nMike Milken, chairman of the Milken Institute, describes the South African couple as “good friends” with whom the institute has partnered on other initiatives before now.",
          "link": "https://techcabal.com/2021/04/28/milken-institute-motsepe-foundation-2million-dollars-agritech/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "milken",
            "richest",
            "funding",
            "programme",
            "black",
            "agriculture",
            "south",
            "float",
            "innovation",
            "initiative",
            "solutions",
            "hopes",
            "motsepe",
            "africa",
            "couple",
            "institute",
            "agritech",
            "million"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Subscribe to our e-copies by clicking here",
          "summary": "The House also on Friday expressed grave concern over allegations made by the National Security Adviser…Apprehension In Kano Over Foreign Camel CaravansRESIDENTS of Rimin Zakara and Doraji Babba communities of Gwale and Ungogo Local Government areas of Kano state have since Wednesday been filled with apprehension and fear over the presence of foreign camel caravans in their neighbourhood.\nIt was gathered that some residents of the communities on seeing the strange caravans decided to relocate their families for fear of the unknown.\nOne Malam Muhammed Ibrahim…Arms Procurement: Billions Spent, No Weapon Seen —NSA •No Money Is Missing, Weapons Being Delivered —Presidency •No money is missing, weapons being delivered —Presidency •NSA was quoted out of context —ONSA •Disclosure weighty, must be probed —PANDEF, Gani AdamsTHE National Security A d v i s e r ( N S A ) , Babagana Monguno, said on Friday that billions were spent on procurement of weapons with the supplies not met on ground by the new service chiefs.\nMonguno said in a British Broadcasting Corporation (BBC) Hausa Service interview that the new service chiefs did not meet weapons for which the money was approved when they assumed…Refer Buratai, Others To EFCC, Falana Tells BuhariLeading rights lawyer, Mr. Femi Falana has asked that the alleged missing arms money under the leadership of the immediate service chiefs, be referred to the Economic and Financial Crimes Commission (EFCC) for investigation.\nIn a short statement Friday night, the senior advocate of Nigeria, said a direct probe by President Muhammadu Buhari as promised by the office of the National Security Adviser, would be wasteful and diversionary…How We Grabbed Wakili Before He Entered His Room Of Charms —OPC MembersMembers of Oodua People’s Congress who arrested and handed over a Fulani man, popularly called Wakili, to the police have given graphic details of how the alleged kidnap kingpin was arrested by them.",
          "link": "https://tribuneonlineng.com/subscribe-to-our-e-copies-by-clicking-here/",
          "published": "03/01/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "wakili",
            "money",
            "days",
            "ngn",
            "service",
            "clicking",
            "opc",
            "state",
            "security",
            "weapons",
            "subscribe",
            "ecopies",
            "national"
          ]
        },
        {
          "title": "Security situation threatening but Nigeria won’t be consumed ― Obasanjo",
          "summary": "Former President Olusegun Obasanjo has expressed optimism that though the nation is in a threatening state of insecurity, it won’t be consumed by the situation.\nObasanjo expressed this optimism in his remarks at the 108th Annual Convention in Session of the Nigerian Baptist Convention held at Baptist International Conference Centre, KM 54 Lagos-Ibadan Expressway.\n“The situation in Nigeria threatening but we won’t be consumed by it.\nYOU SHOULD NOT MISS THESE HEADLINES FROM NIGERIAN TRIBUNECOVID-19: Nigeria Recorded 624 New Infections Last Week, Lowest In Over Five MonthsLast week, Nigeria recorded 624 new COVID-19 infections which is the lowest the country recorded in five months, Tribune Online analysis shows.\nThe 624 new cases reported between March 28 and April 3 is a reduction from the 849 recorded the previous week…Security situation threatening but Nigeria won’t be consumed ― ObasanjoSecurity situation threatening but Nigeria won’t be consumed ― Obasanjo",
          "link": "https://tribuneonlineng.com/security-situation-threatening-but-nigeria-wont-be-consumed-%e2%80%95-obasanjo/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "obasanjo",
            "wont",
            "threatening",
            "recorded",
            "nigeria",
            "situation",
            "convention",
            "security",
            "baptist",
            "state",
            "reverend",
            "consumed",
            "nation"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer",
          "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.",
          "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "fairness",
            "ortom",
            "equity",
            "country",
            "god",
            "nigeria",
            "level",
            "insecurity",
            "state",
            "security",
            "lasting",
            "governor",
            "justice",
            "nigerian",
            "observer",
            "peace"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "movement",
            "immediate",
            "web",
            "cattle",
            "prohibited",
            "jan",
            "register",
            "nightgrazing",
            "19",
            "underaged",
            "highways",
            "outlawed",
            "wish"
          ]
        },
        {
          "title": "14, 000 Nigerians spent $501m on education in America last year – US Govt",
          "summary": "The information said about 100,000 Nigerians visit the United States in a year.\n“With over 100,000 travelers to the United States each year, Nigerians boost American businesses, colleges, and universities.\nThere are over 8,800 education and exchange program alumni from Nigeria and the United States,” it said.\nThe United States looks forward to delivering twelve A-29 Super Tucano aircraft this year.\n“The United States promotes strong and broad collaboration between government and civil society at all levels, including civil society organizations led by women and members of marginalized groups.",
          "link": "https://hallmarknews.com/14-000-nigerians-spent-501m-on-education-in-america-last-year-us-govt/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "million",
            "nigerians",
            "america",
            "14",
            "universities",
            "students",
            "nigeria",
            "000",
            "states",
            "largest",
            "spent",
            "united",
            "international",
            "education",
            "govt",
            "piracy",
            "501m"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Ogun Monarchs Canvass Support For Border Institute Bill",
          "summary": "ADVERTISEMENTBY BODE GBADEBO, AbujaTraditional rulers from border towns of Ogun State on Monday stormed the National Assembly complex to throw their weight behind the Border Institute Bill, sponsored by Senator Tolu Odebiyi (APC, Ogun West) .\nThe Bill seeks the establishment of the National Institute for Border Studies, in Imeko in Ogun West senatorial district.\nAccording to the piece of legislation, the institute is proposed to be a degree awarding institution, with the power to admit students and award degree certificates upon the completion of their statutory academic years and after satisfying the requirements of the institute’s council.\nAlso, the institute is designed to develop and conduct courses for training of students as well as teachers in the teaching profession, expand the horizon for indigenous research and provide the basis for cooperation, partnership and collaboration with relevant institutions, researchers and stakeholders in Nigeria and beyond.\nThe traditional rulers at separate interviews with journalists, said their presence was to openly demonstrate the seriousness and eagerness of the Yelwa people of Ogun State for the Institute, which according to them, will have positive multiplier effects on their various communities.",
          "link": "https://leadership.ng/ogun-monarchs-canvass-support-for-border-institute-bill/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "west",
            "yewa",
            "students",
            "canvass",
            "support",
            "ogun",
            "state",
            "bill",
            "oba",
            "rulers",
            "institute",
            "monarchs",
            "border"
          ]
        },
        {
          "title": "Be Yourself And Be Passionate, Says Instagram Star, Rexi James",
          "summary": "By Our CorrespondentIn a world where many youngsters, particularly females, are led to believe you can’t make it as a model unless you conform to certain stereotypes, runaway Instagram success Rexi James is a breath of fresh air.\nA 21-year-old from Portland Oregon, Rexi James was born with Arthrogryposis Amyoplasia, a disability that affects her joints, tendons, and muscles.\nAmongst her many talents, Rexi has a proven track record of producing the sort of content that quickly goes viral.\nUnoriginal people create unoriginal content.\nIf you care too much about what people think your content will always be lacking in substance.",
          "link": "https://leadership.ng/be-yourself-and-be-passionate-says-instagram-star-rexi-james/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "james",
            "different",
            "lot",
            "youre",
            "content",
            "model",
            "unoriginal",
            "passionate",
            "disability",
            "throw",
            "think",
            "instagram",
            "star",
            "rexi"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "UFC: Usman, McGregor in war of words",
          "summary": "There might be a clash in the future between reigning UFC welterweight champion Kamaru Usman and Conor McGregor after both superstars reignited their rivalry on social media on Monday.\nUsman defended his welterweight title for the fourth time with a second round knockout victory over Jorge Masvidal at the UFC 261 at the VyStar Veterans Memorial Arena in Jacksonville, Florida, on Sunday in front of 15,000 screaming fans.\nMcGregor has created a knack for taunting Usman after every win the Nigerian records, claiming he will one day come for the title in the welterweight division.\nThe Irish fighter, in a post on Twitter, accused Usman of copying his moves in knocking out Masvidal, stating that he would destroy the Nigerian when they clash.\nIn his reply, Usman referred to the former UFC featherweight and lightweight champion as a washed out fighter who got beaten easily in his preferred weight class.",
          "link": "https://daylightng.com/ufc-usman-mcgregor-in-war-of-words/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "words",
            "fight",
            "mcgregor",
            "masvidal",
            "war",
            "welterweight",
            "usman",
            "title",
            "shots",
            "nigerian",
            "ufc",
            "fighter"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}