{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "New Minimum Pension: FEPPPAN gears-up to engage Salaries, Wages Commission",
          "summary": "The NSIWC had in the circular of the consequential adjustment of the new minimum pension listed the category of workers that were captured directly.\nIt commended President Mohammadu Buhari-led federal government for approving national minimum pension and issuance of circular for the commencement of the consequential adjustment of the new payment.\nIt also appreciated the entire management of Pensions Transitional Arrangement Directorate (PTAD), led by its Executive Secretary, Dr. Chioma Ejikeme, for swiftly stating that it will commence payment payroll for the new minimum pension by this month.\n“We commend President Muhammadu Buhari for granting the awaited approval of the recommendations of the committee of stakeholders Report as soon as he returned to office from medical break.\nChairman of the NSIWC Ekpo U. O. Nta Esq.",
          "link": "https://www.vanguardngr.com/2021/05/new-minimum-pension-fepppan-gears-up-to-engage-salaries-wages-commission/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "federal",
            "commission",
            "secretary",
            "pension",
            "nigeria",
            "pensioners",
            "nsiwc",
            "fepppan",
            "circular",
            "minimum",
            "engage",
            "wages",
            "pensions",
            "salaries",
            "gearsup",
            "listed"
          ]
        },
        {
          "title": "Benue killings: We’ll defend our land,law",
          "summary": "Kindly Share This Story:claims herdsmen groups using Presidency to blackmailing, Gov.\nOrtom, Benue peopleBy Peter Duru, MakurdiBothered by the silence of the presidency on the unending attacks on Benue communities by suspected armed herdsmen militia, Benue youths under the aegis of Benue Youth Forum, BYF, yesterday vowed to defend the state and its extant laws.\nThe group also alleged that Fulani herdsmen groups have resorted to using the presidency to blackmail Governor Samuel Ortom and the Benue people despite the ongoing killings in the state.\nIn order to carry the occupation plot in a hitch-free fashion, they have resorted to using presidency to blackmail Governor Samuel Ortom and the Benue people.\n“We must make this loud and clear that the entire Benue State is fully mobilized to defend its laws and land against any threat posed by members of Miyetti Allah Kautal Hore and any other violent Fulani group.",
          "link": "https://www.vanguardngr.com/2021/05/benue-killings-well-defend-our-landlaw-benue-youths-vow/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "defend",
            "landlaw",
            "state",
            "president",
            "ortom",
            "killings",
            "shehu",
            "ruga",
            "media",
            "using",
            "garba",
            "presidency",
            "benue"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Call in mercenaries now, no one is safe",
          "summary": "Akume’s man also questioned the use of security votes by the governor and submitted that his constant criticism of President Buhari has made it impossible for Mr. President to stop the killings in Benue.\nIs Governor Ortom guilty of antagonising Mr. President and showing him disrespect by calling on him to rise to his sworn responsibility to protect the lives and properties of the Benue people?\nHas Governor Ortom not expressed gratitude to Mr. President for the siting of tertiary institutions of learning in the state?\nAre those tenable as excuses for Mr. President’s failure to protect Benue people from killer herdsmen?\nBemgba Iortyom is the PDP Publicity Secretary in Benue State and can be reached at 08035948148",
          "link": "https://dailypost.ng/2021/05/01/insecurity-call-in-mercenaries-now-no-one-is-safe-ondo-workers-tell-buhari/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "governor",
            "mercenaries",
            "ortom",
            "protect",
            "mr",
            "benue",
            "akume",
            "insecurity",
            "security",
            "votes",
            "president",
            "safe"
          ]
        },
        {
          "title": "Bemgba Iortyom: Abagena killings: Akume finally speaks through Mkor",
          "summary": "Akume’s man also questioned the use of security votes by the governor and submitted that his constant criticism of President Buhari has made it impossible for Mr. President to stop the killings in Benue.\nIs Governor Ortom guilty of antagonising Mr. President and showing him disrespect by calling on him to rise to his sworn responsibility to protect the lives and properties of the Benue people?\nHas Governor Ortom not expressed gratitude to Mr. President for the siting of tertiary institutions of learning in the state?\nAre those tenable as excuses for Mr. President’s failure to protect Benue people from killer herdsmen?\nBemgba Iortyom is the PDP Publicity Secretary in Benue State and can be reached at 08035948148",
          "link": "https://dailypost.ng/2021/05/01/bemgba-iortyom-abagena-killings-akume-finally-speaks-through-mkor/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "bemgba",
            "abagena",
            "governor",
            "ortom",
            "killings",
            "finally",
            "mr",
            "iortyom",
            "benue",
            "akume",
            "protect",
            "security",
            "speaks",
            "votes",
            "president",
            "mkor"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "BREAKING: You wanted contracts but was rebuffed - Presidency replies Mbaka",
          "summary": "Ejike Mbaka, turned against President Muhammadu Buhari after supporting him in 2015 and 2019.\nMbaka, it alleged, wanted contracts for supporting Buhari but was rebuffed.\n“Here is the point of departure: Father Mbaka asked for a meeting and to the shock of Presidential Aides, he came accompanied by three contractors.\nThe President graciously allowed them in, and to everyone’s surprise, Father Mbaka asked for contracts as compensation for his support.\n“Anyone familiar with President Buhari knows that he doesn’t break the laid down rules in dealing with contracts or any other government business for that matter.",
          "link": "http://community.thenationonlineng.net/forum/breaking-you-wanted-contracts-but-was-rebuffed-presidency-replies",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "wanted",
            "breaking",
            "national",
            "father",
            "supporting",
            "matter",
            "rebuffed",
            "replies",
            "buhari",
            "asked",
            "presidency",
            "contracts",
            "president",
            "mbaka"
          ]
        },
        {
          "title": "VIDEO: 'If you make it pass 3rd round I’ll quit' - Tyson Fury tells Anthony Joshua",
          "summary": "WBC heavyweight champion Tyson Fury has claimed that he will quit in his corner if Anthony Joshua makes it further than three rounds with him in their all-British world heavyweight title unification showdown.\nFury was keen to keep the promotion going on his Instagram this week, once again calling out Joshua, while making a ridiculous claim in the process.\nThat’s Anthony Joshua.\n“AJ, if you’re out there, let’s make this fight happen, you big dosser.\nYou big s***house bum dosser.",
          "link": "http://community.thenationonlineng.net/forum/video-if-you-make-it-pass-3rd-round-i-ll-quit-tyson-fury-tells-an",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "shouse",
            "joshua",
            "rounds",
            "dosser",
            "pass",
            "fury",
            "wrong",
            "quit",
            "big",
            "week",
            "thats",
            "tyson",
            "im",
            "anthony",
            "round",
            "tells",
            "ill",
            "video"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Black Saturday in Imo as truck crushes 10 market women",
          "summary": "No fewer than ten women lost their lives in a ghastly auto crash when a truck lost its brake and rammed into women trading at the roadside of Nkwommiri market in Nwangele Local Government Area of Imo State on Saturday.\nAccording to an eye witness, the incident which occurred at 12 noon at the Anara- Orlu expressway where the market was situated also left many injured.\nOur reporter gathered that the truck was attempting to climb the hilly road when its brake failed and crushed the women as well as other vehicles on the roadside.\nA truck that lost its brakes has killed women trading on the road at Nkwommiri, and it looks like more are even injured and some trapped under the vehicle.\nWhen contacted, the police Spokesperson in the state, Orlando Ikeokwu, said that rescue operation was ongoing but confirmed the death of the ten women.",
          "link": "https://www.sunnewsonline.com/black-saturday-in-imo-as-truck-crushes-10-market-women/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "lost",
            "imo",
            "market",
            "crushes",
            "trading",
            "women",
            "rescue",
            "black",
            "nkwommiri",
            "community",
            "truck",
            "road"
          ]
        },
        {
          "title": "My regret for Enyimba, sports in Nigeria – Kalu",
          "summary": "Enyimba was everything to Aba people, the team was worshipped and it like after God, Enyimba was next in Abia State.\nI created two teams- Enyimba in Aba and Orji Uzoh Kalu Babes in Umuahia but they changed the name.\nI encourage state governor, the federal government and looking at Enyimba today, you will agree with me that the ream is a brand now.\nWhy did Enyimba as an international brand fail to attract sponsorship during you term as governor of Abia State?\nAs governor of Abia State, it was only at the Enyimba Stadium that you could come and play well and win.",
          "link": "https://www.sunnewsonline.com/my-regret-for-enyimba-sports-in-nigeria-kalu/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "caf",
            "state",
            "nigeria",
            "governor",
            "left",
            "regret",
            "kalu",
            "club",
            "abia",
            "enyimba",
            "football",
            "players",
            "team"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "FirstBank: I Acted in Honour, Integrity, Says Awosika",
          "summary": "By Obinna ChimaThe sacked Chairman of First Bank Nigeria Limited, Mrs. Ibukun Awosika, has said that she acted in honour and integrity with the interest of the institution, all its stakeholders and the nation during her 11-year reign at the bank.\nAwosika, wrote this in an article she titled: “My FBN Group Journey,” posted on instagram, a social media platform.\nEmefiele had announced the appointment of a former Minister of State for Finance and former Executive Director of First Bank, Mr. Remi Babalola, as chairman of FBN Holdings.\nFirst Bank Nigeria Limited’s new Chairman is Tunde Hassan-Odukale, who replaced Awosika.\nGbenga Shobo, deputy managing director; and Remi Oni and Abdullahi Ibrahim, executive directors, are members of the reconstituted board.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/firstbank-i-acted-in-honour-integrity-says-awosika/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "acted",
            "remi",
            "firstbank",
            "nigeria",
            "integrity",
            "bank",
            "mr",
            "board",
            "stakeholders",
            "limited",
            "interest",
            "awosika",
            "honour",
            "fbn"
          ]
        },
        {
          "title": "Amid Unending Killings, Buhari Mulls Fresh Strategy at Security Meeting",
          "summary": "It also emerged yesterday that 323 persons had been killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe National Security Adviser (NSA) to the President, Major-General Babagana Monguno (rtd), in a statement after the meeting, stressed the readiness of President Buhari to decisively end all forms of security challenges facing the nation.\nSpokesman of the Yobe State Police Command, ASP Dungus Abdulkarim confirmed the attack.\nIn 3 Months, Bandits Kill 323 in Kaduna StateThe Kaduna State Government yesterday disclosed that 323 persons were killed while 949 others were kidnapped by bandits in the last three months across Kaduna State.\nThe Commissioner for Internal Security and Home Affairs, Mr. Samuel Aruwan stated this yesterday while presenting a report on the security situation in the state at a security meeting which held at the Government House, Kaduna.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/01/amid-unending-killings-buhari-mulls-fresh-strategy-at-security-meeting/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "deaths",
            "unending",
            "bandits",
            "yobe",
            "meeting",
            "strategy",
            "killings",
            "amid",
            "buhari",
            "mulls",
            "security",
            "fresh",
            "323",
            "haram",
            "president",
            "kaduna"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Buhari Called On United States To Relocate AFRICOM To Africa Because He Was Scared Terrorists, Bandits And Militants Could Sack His Government -Falana",
          "summary": "WATCH: @MBuhariâ\u0080\u0099s Call On United States of America To Relocate @USAfricaCommand To Africa Was Because He Was Scared Terrorists, Bandits And Militants Could Sack His Government -FalanaFULL VIDEO: https://t.co/Og5fO44U7f pic.twitter.com/wlmPosgX74",
          "link": "http://saharareporters.com/2021/05/01/buhari-called-united-states-relocate-africom-africa-because-he-was-scared-terrorists",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "falana",
            "watch",
            "relocate",
            "united",
            "militants",
            "sack",
            "states",
            "buhari",
            "called",
            "pictwittercomwlmposgx74",
            "terrorists",
            "scared",
            "usafricacommand",
            "video"
          ]
        },
        {
          "title": "Buhari Called On United States To Relocate AFRICOM To Africa Because He Was Scared Terrorists, Bandits And Militants Could Sack His Government -Falana",
          "summary": "WATCH: @MBuhariâ\u0080\u0099s Call On United States of America To Relocate @USAfricaCommand To Africa Was Because He Was Scared Terrorists, Bandits And Militants Could Sack His Government -FalanaFULL VIDEO: https://t.co/Og5fO44U7f pic.twitter.com/wlmPosgX74",
          "link": "http://saharareporters.com/2021/05/01/buhari-called-united-states-relocate-africom-africa-because-he-was-scared-terrorists#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "falana",
            "watch",
            "relocate",
            "united",
            "militants",
            "sack",
            "states",
            "buhari",
            "called",
            "pictwittercomwlmposgx74",
            "terrorists",
            "scared",
            "usafricacommand",
            "video"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Matawalle hints Zamfara can't pay minimum wage, asks workers to start businesses",
          "summary": "Bello Matawalle, governor of Zamfara, has hinted that the state government cannot pay the new minimum wage.\nThe new minimum wage bill was signed into law in April 2019 by President Muhammadu Buhari.\nThe law stipulates an increase from N18,500 to N30,000 as minimum wage in Nigeria.\nAdvertisementThe governor also urged the workers to start their own businesses which they can fall back on after retirement.\nThe government house also got an allocation of N1 billion each for the purchase of water equipment and electrical cables.",
          "link": "https://www.thecable.ng/matawalle-hints-zamfara-cant-pay-minimum-wage-asks-workers-to-start-businesses",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "hints",
            "million",
            "governor",
            "allocation",
            "pay",
            "wage",
            "start",
            "workers",
            "minimum",
            "zamfara",
            "businesses",
            "billion",
            "matawalle",
            "cant",
            "sum"
          ]
        },
        {
          "title": "Kukah: Nigerians demanding secession may be right but staying united is cheaper",
          "summary": "Matthew Kukah, Catholic bishop of Sokoto diocese, says it is far cheaper for Nigeria to remain as one country than breaking up into smaller units.\nAdvertisementSpeaking at ‘The Platform’ on Saturday, Kukah, however, added that those seeking to secede from Nigeria may be right regarding their concerns.\nHis comments come amid continued calls for Nigeria’s breakup from both the proponents of a Biafran government and other aggrieved citizens.\nBut the cost of staying together is far cheaper than the cost of everybody going his way,” he said.\nHe condemned the incessant killings across the country, adding that it is unclear whether those in power understand the pain of many Nigerians.",
          "link": "https://www.thecable.ng/kukah-nigerians-demanding-secession-may-be-right-but-staying-united-is-cheaper",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "understand",
            "demanding",
            "nigeria",
            "nigerias",
            "united",
            "kukah",
            "cheaper",
            "worth",
            "seen",
            "sense",
            "nigerians",
            "pain",
            "empathy",
            "secession",
            "right",
            "staying",
            "country"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "otudeko",
            "took",
            "cbn",
            "governor",
            "tradition",
            "skye",
            "bruised",
            "bank",
            "board",
            "sacking",
            "banks",
            "enforces",
            "emefiele",
            "sanusi"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "nigeria",
            "companies",
            "market",
            "startups",
            "expansion",
            "fintech",
            "size",
            "business",
            "value",
            "aggressive",
            "expand",
            "company",
            "country",
            "partnerships"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "counterinsurgency",
            "followed",
            "nigerian",
            "ne",
            "observer",
            "defeat",
            "operation",
            "counterterrorism",
            "army",
            "coas",
            "disclosed",
            "renames",
            "renaming",
            "locations"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "register",
            "underaged",
            "jan",
            "cattle",
            "prohibited",
            "19",
            "wish",
            "web",
            "outlawed",
            "highways",
            "nightgrazing",
            "movement",
            "immediate"
          ]
        },
        {
          "title": "May Day Celebration: Osun Workers Reitrate Unalloyed Support for Oyetola’s govt.",
          "summary": "Workers in Osun State today, joined their counterpart nationwide to celebrate this year’s May Day celebration, just as they pledged their unalloyed support for the administration of Governor Adegboyega Oyetola, describing his leadership as an established fatherhood that is deserving of their support and cooperation as children.\nIn his address, the Chairman, Osun Chapter of the Nigerian Labour Congress, NLC, Comrade Jacob Babatunde Adekomi, lauded Governor Oyetola for committing to the development of the State without compromising the interest of workers.\nIn his remarks, Governor Adegboyega Oyetola appreciated the workers of the State for their hard work, resilience and sacrifice even in the face of daunting challenges.\nHe restated the commitment of his administration to the welfare and wellbeing of workers, stating that, “as an administration, we are unapologetically people and worker centered.\n“Looking through the rear mirror, we can exhibit with pride, the mutual accomplishments and privileges our partnership as government and workers have produced.",
          "link": "https://hallmarknews.com/may-day-celebration-osun-workers-reitrate-unalloyed-support-for-oyetolas-govt/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "celebration",
            "state",
            "unalloyed",
            "oyetolas",
            "osun",
            "governor",
            "cooperation",
            "oyetola",
            "workers",
            "development",
            "reitrate",
            "support",
            "govt",
            "day",
            "administration"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "US Embassy To Prioritise Appointments For Student Visa Applicants",
          "summary": "BY DUSTAN AGHEDO, LagosThe United States Embassy in Nigeria has announced that it would give priority to applicants of student visa by increasing the number of appointments and ensuring that Nigerian students resuming this fall semester get their visa interview appointments in advance of their programmes’ start date.\nThis was announced on Friday by the US Mission Country Consular Coordinator, Susan Tuller, who said the embassy in Abuja and the Consulate General in Lagos would make every effort to assist student visa applicants in a timely fashion while keeping personnel and customers safe.\nShe said; “As we continue to prioritise the health and safety of our staff and customers, processing student visas remains a high priority for the US Mission in Nigeria.\n“We will increase the number of student visa appointments in May and June to ensure that we can offer appointments to as many students as possible.\nAccording to her, agents or third parties often seek to benefit by charging fees for their services and they may not always provide the correct information, which could harm an applicant’s chances of qualifying for visa.",
          "link": "https://leadership.ng/us-embassy-to-prioritise-appointments-for-student-visa-applicants/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "embassy",
            "student",
            "number",
            "appointments",
            "students",
            "services",
            "applicants",
            "mission",
            "visa",
            "fall",
            "prioritise",
            "priority"
          ]
        },
        {
          "title": "Restructuring, Decentralised Economy Will Enhance States’ Development – Makinde",
          "summary": "BY ADEBAYO WAHEED, IbadanOyo State governor, Seyi Makinde, has called for restructuring of the country and decentralisation of its economy to give states the opportunity to develop their resources at their own pace.\nMakinde stated this while receiving the University of Lagos Faculty of Engineering alumni association which paid him a courtesy visit at the State Secretariat, Agodi, Ibadan.\nThe governor’s chief press secretary, Taiwo Adisa, said in a statement that the governor stressed that though restructuring might not be a total solution, it would address the major challenges in the country.\nAnd it is also tied to our request for a restructured country.\nADVERTISEMENTEarlier, the national president of the Faculty of Engineering Alumni Association, Engineer Dideolu Falobi, who lauded the development programmes of Governor Makinde, described him as a good ambassador of the faculty and the institution at large.",
          "link": "https://leadership.ng/restructuring-decentralised-economy-will-enhance-states-development-makinde/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "makinde",
            "engineering",
            "governor",
            "solution",
            "stated",
            "restructuring",
            "restructured",
            "development",
            "states",
            "enhance",
            "faculty",
            "economy",
            "decentralised",
            "alumni",
            "country"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police inspector accidentally shot self, not suicide – PPRO —",
          "summary": "A Police Inspector identified as Ochofie Ijimbile, attached to MOPOL 55 Aba, Abia State, has allegedly shot and killed himself while servicing his rifle in readiness for the day’s job.\nPolice spokesman in the Command, SP Geoffrey Ogbonna, while describing the incident as sad and unfortunate, told reporters that Inspector Ijimbile accidentally shot himself on the chest.\nFollowing the incident, he was immediately rushed to the hospital, where he was confirmed dead.\nWhile stating that the late policeman could be unaware that there was bullet in his rifle chamber, called on policemen in Abia and across the country, especially those handling rifles to always exercise extra carefulness while servicing their arms.\nHis corpse has since been deposited in the morgue while efforts are on to reach the family members",
          "link": "https://dailytimes.ng/police-inspector-accidentally-shot-self-not-suicide-ppro/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "inspector",
            "rifle",
            "ijimbile",
            "told",
            "servicing",
            "ppro",
            "unfortunate",
            "accidentally",
            "abia",
            "self",
            "unaware",
            "incident",
            "suicide",
            "shot"
          ]
        },
        {
          "title": "Woman, collapses, dies in Lagos church after 10-day fast over her matrimonal issues",
          "summary": "A woman, Joy Owoyele, has died in the Isheri Olofin area of Lagos State after fasting for 10 days.\n“Her daughter, Oluwatise, was also with her in the church during the spiritual exercise and they always slept together.\n“During the spiritual exercise, she was fasting and praying, and usually broke her fast with honey and water.\n“Around 7am on the day of the incident, Owoyele fainted and was rushed to the Igando General Hospital, where she was pronounced dead.\n“Detectives led by Inspector Bridget Edosa visited the scene, inspected the corpse and deposited it in the Yaba General Hospital morgue for autopsy.",
          "link": "https://dailytimes.ng/woman-collapses-dies-in-lagos-church-after-10-day-fast-over-her-matrimonal-issues/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "fasting",
            "collapses",
            "lagos",
            "matrimonal",
            "spiritual",
            "fast",
            "investigation",
            "hospital",
            "issues",
            "woman",
            "general",
            "church",
            "owoyele",
            "incident",
            "exercise",
            "dies",
            "10day",
            "day"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Suspected herders burn houses in Nasarawa community, many displaced",
          "summary": "Houses were reportedly torched by suspected herdsmen in parts of Keana and Doma Local Government Areas of Nasarawa State.\nThe President of Tiv Youths Organisation in the state, Barnabas Zayol, stated this while speaking with our correspondent on Friday in Lafia, the state capital.\nZayol said that most of the houses burnt down belonged to about 50,000 Tiv farmers chased out of their communities by the suspected herdsmen.\nThese herdsmen have chased us out of our villages and the houses we laboured to build have been burnt down.”Zoyol identified the affected communities to include Ategher, Avewua, Ugbele Aondokaa, Ikper, Gborgyo and Uluwa Kwanankele.\nA member of the state House of Assembly representing Keana constituency, Mohammed Omedefu, has assured the victims of the state government’s support.",
          "link": "https://daylightng.com/suspected-herders-burn-houses-in-nasarawa-community-many-displaced/",
          "published": "05/01/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "state",
            "suspected",
            "herders",
            "displaced",
            "houses",
            "representing",
            "burn",
            "situation",
            "affected",
            "constituency",
            "tiv",
            "community",
            "communities",
            "speaking",
            "nasarawa"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "account",
            "bookmaker",
            "version",
            "site",
            "popular",
            "launches",
            "1xbet",
            "offers",
            "website",
            "page",
            "convenient",
            "place",
            "emerges",
            "mobile"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/01/2021",
          "keywords": [
            "electronic",
            "drivers",
            "callup",
            "roads",
            "system",
            "gridlock",
            "amidst",
            "apapa",
            "ecall",
            "trucks",
            "npa",
            "worsening",
            "truck",
            "road"
          ]
        }
      ]
    }
  }
}