{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Attacks: We are under siege, Tiv leader cries out in Nasarawa",
          "summary": "Sule for protectionBy David Odama, LafiaPresident of Tiv Youth Organization in Nasarawa state, Barr.\nBarnabas Zayol has cried out over the incessant attacks on Tiv communities in Nasarawa state that has claimed the lives of scores, injured many more, with over 50,000 displaced.\nTiv people in Nasarawa state are peace-loving and friendly to other tribes in the state.\nMeanwhile, the Nasarawa State Governor, Engr.\nWhen contacted, the Aldo of Fulani herdsmen in Nasarawa state, Alhaji Lawal Dono declined to comment on the matter.",
          "link": "https://www.vanguardngr.com/2021/04/attacks-we-are-under-siege-tiv-leader-cries-out-in-nasarawa/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "leader",
            "siege",
            "state",
            "doma",
            "attacks",
            "security",
            "community",
            "nasarawa",
            "tiv",
            "zayol",
            "herdsmen",
            "cries",
            "suspected",
            "operatives"
          ]
        },
        {
          "title": "NDLEA nabs 2 drug traffickers with N264m cocaine in Abuja",
          "summary": "Kindly Share This Story:By Kingsley OmonobiA trans-border trafficker, Emeka Okoro and another drug dealer, Ibrahim Bello have been arrested in Abuja by operatives of the National Drug Law Enforcement Agency, NDLEA, with cocaine weighing 1.1kilogramme, which has a street value of N264million.\nThe suspect, Emeka Okoro revealed that this has been the trend in the past months, the FCT Commander of NDLEA disclosed.\nAccording to the Commander, Kogi state Command of the Agency, Adewunmi Alfred, the suspect and his consignment were intercepted at a patrol point in Lokoja, the state capital.\nIn his reaction, Chairman/Chief Executive of NDLEA, Brig.\nGeneral Mohamed Buba Marwa (Retd) commended officers and men of the FCT and Kogi state Commands of the Agency for their vigilance and commitment to the task of ridding the country of illicit drugs.",
          "link": "https://www.vanguardngr.com/2021/04/ndlea-nabs-2-drug-traffickers-with-n264m-cocaine-in-abuja/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "traffickers",
            "cocaine",
            "agency",
            "state",
            "abuja",
            "suspect",
            "okoro",
            "kogi",
            "fct",
            "drug",
            "intercepted",
            "ndlea",
            "nabs",
            "n264m"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "FG’s investigative panel storms Akwa Ibom Poly over financial appropriation",
          "summary": "The investigative panel on the financial appropriation in Federal Government owned tertiary institutions had arrived Ukana Federal polytechnic, Akwa Ibom State.\nHe, however, called for cooperation between the Management of the Polytechnic, host community and stakeholders to enable the panel to complete its job successfully and on record time.\nThe Chairman explained that the panel was appointed by President Muhammadu Buhari to review the activities of the polytechnic between 2014 to 2020 and examine the relationship between the institution and the various statutory bodies it interacts with among other things.\nProf. Abdullahi said, “the panel shall interact with various stakeholders of the Federal Polytechnic, Ukana with a view to getting first-hand information and inputs.\nHe assured the Panel of maximum cooperation and support in actualization of its assigned task and expressed optimism that the recommendations by the panel would enhance academic productivity and excellence at the institution.",
          "link": "https://dailypost.ng/2021/04/28/fgs-investigative-panel-storms-akwa-ibom-poly-over-financial-appropriation/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "cooperation",
            "storms",
            "investigative",
            "fgs",
            "ibom",
            "academic",
            "view",
            "polytechnic",
            "appropriation",
            "relationship",
            "financial",
            "federal",
            "panel",
            "management",
            "institution",
            "poly",
            "various",
            "akwa"
          ]
        },
        {
          "title": "Insecurity: Everyone will suffer if war breaks out",
          "summary": "Vice President, Yemi Osinbajo, has said that Nigeria cannot afford another civil war because it will not augur well for the country.\n“The thing about the kind of conflict in this part of the world, developing countries, is that it is usually a war without end.\n“Even if you don’t suffer, parents, children, young and old people and relations will suffer.\nWe cannot afford a war in this country, we can`t afford it,’’ he said.\n“At the end of the day, it is the political elite that determines what happens in every society, keeping quiet could lead to a more dangerous situation,” he said.",
          "link": "https://dailypost.ng/2021/04/28/insecurity-everyone-will-suffer-if-war-breaks-out-osinbajo/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "vice",
            "truth",
            "suffer",
            "thinks",
            "afford",
            "elite",
            "country",
            "speak",
            "war",
            "political",
            "insecurity",
            "conflict",
            "breaks"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "NASS legislative aides protest unpaid salaries",
          "summary": "By Nicholas Kalu, AbujaThe National Assembly Legislative Aides Forum (NASSLAF) on Wednesday protested the non-payment of their salaries since last year.\nThey also complained about the Consolidated Legislative Aides Salary Structure, the non-payment of minimum wage and duty tour allowance among other issues.\nADVERTISEMENTOne of them, Lawson Oviasogie, said: “We are a body of close to 5000 legislative aides assigned to lawmakers of the Federal Republic of Nigeria and we are here to draw the world’s attention to the impunity and reckless disregard for authority happening here.\n“We assumed this ninth Assembly on the 11th of June 2019 and salaries of aides that was appropriated for and we have not been paid.\n“The other issue is the issue of minimum wage, which some executive agencies have been receiving since last year.",
          "link": "https://thenationonlineng.net/nass-legislative-aides-protest-unpaid-salaries/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "tour",
            "assembly",
            "protest",
            "aides",
            "staff",
            "wage",
            "unpaid",
            "salaries",
            "legislative",
            "salary",
            "nass",
            "issue",
            "paid"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Buhari presides over 43rd virtual cabinet meeting",
          "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is presiding over the 43rd virtual meeting of the Federal Executive Council (FEC) at the First Lady Conference Room, Presidential Villa, Abuja.\nVice President Yemi Osinbajo, Secretary to the Government of the Federation Boss Mustapha and Chief of Staff to the President Ibrahim Gambari are physically attending the meeting, which started at 10:00 am.\nSeven ministers are physically attending the meeting.\nThey include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed; Justice, Abubakar Malami and Foreign Affairs, Geoffery Onyeama.\nThe Head of Service of the Federation, Dr. Folasade Yemi-Esan and other Ministers are participating in the weekly cabinet meeting from their various offices in Abuja.",
          "link": "https://www.sunnewsonline.com/buhari-presides-over-43rd-virtual-cabinet-meeting/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "mohammed",
            "minister",
            "attending",
            "federation",
            "buhari",
            "ministers",
            "presides",
            "president",
            "meeting",
            "federal",
            "43rd",
            "physically",
            "affairs",
            "cabinet",
            "virtual"
          ]
        },
        {
          "title": "Boko Haram may overrun Abuja, Senators warn",
          "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.",
          "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "target",
            "overrun",
            "haram",
            "state",
            "abuja",
            "communities",
            "senate",
            "terrorists",
            "boko",
            "niger",
            "president",
            "senators",
            "warn"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "N’Assembly Laments over Worsening Insecurity as Buhari Seeks US’ Help",
          "summary": "In the Senate, many senators fumed over the worsening insecurity and mandated its leadership to book an appointment with the president and service chiefs to discuss the issue and proffer solutions.\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes.\nFemi Gbajabiamila, read the resolutions of the lawmakers after a three-hour executive session yesterday to discuss the deteriorating security situation in the country.\nAtiku, Saraki Proffer SolutionsMeanwhile, a former Senate President, Dr. Bukola Saraki, has advised Buhari to seek help to tackle the increasing insecurity in the country.\nHe said: “It is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/nassembly-laments-over-worsening-insecurity-as-buhari-seeks-us-help/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "laments",
            "help",
            "africa",
            "state",
            "nassembly",
            "nigeria",
            "buhari",
            "senate",
            "situation",
            "security",
            "seeks",
            "president",
            "service",
            "house",
            "insecurity",
            "worsening"
          ]
        },
        {
          "title": "Tambuwal, El-Rufai Rally North-west States to Combat Banditry",
          "summary": "By John ShiklamKaduna State Governor, Mallam Nasir el-Rufai, and his Sokoto State counterpart, Hon.\nAminu Tambuwal, yesterday called for cooperation among the seven states in the North-west in tackling banditry and kidnapping.\nHe stated that governors of the seven states in the North-west have been working closely with President Muhammad Buhari to end banditry and kidnapping in the zone.\nTambuwal said the latest was the murder of a Divisional Police Officer (DPO) and eight policemen in Kebbi on Monday and the recent attack on Dange Local Government of Sokoto State, during which lives were lost.\nThe Kaduna State Government said it had been consistently transparent about its security challenges.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/28/tambuwal-el-rufai-rally-north-west-states-to-combat-banditry/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "criminals",
            "state",
            "rally",
            "elrufai",
            "kaduna",
            "security",
            "banditry",
            "sokoto",
            "combat",
            "states",
            "statement",
            "surrender",
            "northwest",
            "tambuwal"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "NNPC Writes Accountant-General Over N111billion Shortfall In Oil Revenue, Says No Contributions To Federal Allocations For April, May",
          "summary": "The Nigerian National Petroleum Corporation has written to the Accountant-General of the Federation, raising the alarm that it recorded a value shortfall of N111,966,456,903.74 in February 2021 which will affect its contributions to the Federal Allocations to states for April and May.\nHe stated that the NNPC would therefore not be contributing to the FAAC for April and May which will in turn affect the revenue to be shared among states of the federation.\n“As the discussions between Government and the Labour are yet to be concluded, NNPC recorded a value short fall of N111,966,456,903.74 in February 2021 as a result of the difference highlighted above.\nAccordingly, a projection of remittance to the Federation for the next three months is presented in the attached schedule.\n“This is to ensure the continuous supply of Petroleum Products to the nation and guarantee energy security.",
          "link": "http://saharareporters.com/2021/04/28/nnpc-writes-accountant-general-over-n111billion-shortfall-oil-revenue-says-no",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "federal",
            "petroleum",
            "litre",
            "federation",
            "remittance",
            "nnpc",
            "accountantgeneral",
            "oil",
            "revenue",
            "shortfall",
            "contributions",
            "landing",
            "writes",
            "2021",
            "n11196645690374",
            "month",
            "finance",
            "n111billion",
            "allocations"
          ]
        },
        {
          "title": "NNPC Writes Accountant-General Over N111billion Shortfall In Oil Revenue, Says No Contributions To Federal Allocations For April, May",
          "summary": "The Nigerian National Petroleum Corporation has written to the Accountant-General of the Federation, raising the alarm that it recorded a value shortfall of N111,966,456,903.74 in February 2021 which will affect its contributions to the Federal Allocations to states for April and May.\nHe stated that the NNPC would therefore not be contributing to the FAAC for April and May which will in turn affect the revenue to be shared among states of the federation.\n“As the discussions between Government and the Labour are yet to be concluded, NNPC recorded a value short fall of N111,966,456,903.74 in February 2021 as a result of the difference highlighted above.\nAccordingly, a projection of remittance to the Federation for the next three months is presented in the attached schedule.\n“This is to ensure the continuous supply of Petroleum Products to the nation and guarantee energy security.",
          "link": "http://saharareporters.com/2021/04/28/nnpc-writes-accountant-general-over-n111billion-shortfall-oil-revenue-says-no#disqus_thread",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "federal",
            "petroleum",
            "litre",
            "federation",
            "remittance",
            "nnpc",
            "accountantgeneral",
            "oil",
            "revenue",
            "shortfall",
            "contributions",
            "landing",
            "writes",
            "2021",
            "n11196645690374",
            "month",
            "finance",
            "n111billion",
            "allocations"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "It's invitation to recolonisation, says Shehu Sani on Buhari's call for relocation of AFRICOM",
          "summary": "Shehu Sani, former senator, has faulted the position of President Muhammadu Buhari on the relocation of the US Africa Command (AFRICOM).\nDuring a virtual meeting with Anthony Blinken, US secretary of state, on Tuesday, Buhari asked the US to consider relocating AFRICOM to Africa.\nThe call for the US to relocate its US Africa Command HQ to Africa is unconscionable,” he tweeted.\n“The President’s call for World powers military HQ on African soil is an open invitation for recolonisation of Africa.\n— Senator Shehu Sani (@ShehuSani) April 28, 2021",
          "link": "https://www.thecable.ng/its-invitation-to-recolonisation-says-shehu-sani-on-buharis-call-for-relocation-of-africom",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "shehu",
            "sani",
            "buharis",
            "tell",
            "africa",
            "hq",
            "invitation",
            "security",
            "relocation",
            "african",
            "africom",
            "unconscionable",
            "senator",
            "recolonisation"
          ]
        },
        {
          "title": "Nigeria's Flutterwave is only African firm on TIME’s most influential companies in 2021",
          "summary": "Flutterwave, a Nigerian digital payment platform, has been named a “Pioneer” on the TIME’s 2021 list of the 100 most influential companies in the world.\nAdvertisementThe fintech firm is the only African firm listed in the TIME’s inaugural list of companies making extraordinary impact across the world.\nThe list was divided into five categories namely: pioneers, leaders, innovation, titans, and disruptors.\nAdvertisementTIME reports that the fintech company was chosen for its efforts in recharging retailers after the pandemic slowed travel in Nigeria.\nAdvertisementTIME’s quoted Agboola, who named the free campaign as “keeping the lights on.”In March 2021, Flutterwave raised $170 million from investors, pushing its valuation to over $1 billion.",
          "link": "https://www.thecable.ng/nigerias-flutterwave-is-only-african-firm-on-times-most-influential-companies-in-2021",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "pandemic",
            "named",
            "flutterwave",
            "nigerias",
            "times",
            "fintech",
            "think",
            "african",
            "digital",
            "list",
            "influential",
            "companies",
            "2021",
            "firm"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Amazon to invest $280m in Africa headquarters",
          "summary": "Amazon’s history in South Africa dates back to 2004, with a customer service unit operating since 2010.\nOver the last decade, Amazon has also boosted its customer service capacity centre in South Africa.\nIn 2019, Amazon Web Services (AWS) in South Africa had just 50 jobs listed.\nAlmost all these jobs are referred to as Virtual Customer Service (VCS) positions, which allow applicants anywhere in South Africa to apply.\nCould the announcement of its African headquarters and its increasing job listing be a hint that Amazon might be revisiting its eCommerce play in Africa?",
          "link": "https://techcabal.com/2021/04/28/amazons-africa-headquarters-will-be-in-south-africa/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "customer",
            "south",
            "africa",
            "science",
            "million",
            "amazon",
            "service",
            "african",
            "positions",
            "headquarters",
            "jobs",
            "invest",
            "280m"
          ]
        },
        {
          "title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria",
          "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.",
          "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "itoro",
            "nwokoye",
            "health",
            "communities",
            "nigeria",
            "hospitaltohome",
            "jennie",
            "healthcare",
            "access",
            "rural",
            "services",
            "inoyo",
            "bringing",
            "plan",
            "medical",
            "clafiya"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "rescue",
            "appealing",
            "govt",
            "kidnapped",
            "yusuf",
            "sent",
            "dont",
            "free",
            "soldiers",
            "video",
            "sale",
            "student",
            "force",
            "students",
            "come",
            "appeal"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "suspects",
            "corpses",
            "abraka",
            "warri",
            "drug",
            "led",
            "peddlers",
            "car",
            "bodies",
            "recover",
            "recovered",
            "decomposing",
            "siblings",
            "arrest",
            "suspected",
            "delta",
            "phones"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer",
          "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.",
          "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/",
          "published": "04/27/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "justice",
            "fairness",
            "state",
            "nigeria",
            "nigerian",
            "level",
            "security",
            "country",
            "governor",
            "ortom",
            "peace",
            "lasting",
            "god",
            "insecurity",
            "observer",
            "equity"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "underaged",
            "outlawed",
            "wish",
            "19",
            "register",
            "immediate",
            "web",
            "jan",
            "cattle",
            "highways",
            "nightgrazing",
            "movement",
            "prohibited"
          ]
        },
        {
          "title": "Polaris Bank declares N28.9bn profit in 2020 financial year",
          "summary": "OBINNA EZUGWUPolaris Bank Limited has declared N28.9 billion profit before tax for full year 2020 ended December 31, a 4% growth from the corresponding period of 2019.\nThe performance, the bank’s financial statements said, is driven by the combination of the significant reduction in interest expense due to its pursuit of low interest-bearing deposits as well as lowering impairment charges on loans and other financial assets.\nThe Bank recorded Return on Asset (ROA) and Return on Equity (ROE) of 2.4% and 29.4% respectively which favorably place the Bank as a key player in the industry.\nCommenting on the Bank’s performance, the Managing Director/Chief Executive Officer (MD/CEO) of Polaris Bank Limited, Mr. Innocent C. Ike who took over in the course of the year from Mr. Tokunbo Abiru explained that “Polaris Bank has achieved significant milestones since its inception in September 21, 2018 when we started this journey.\n“We have since grown to earn the confidence of the banking publics, offering quality banking services at the cutting edge of technology”.",
          "link": "https://hallmarknews.com/polaris-bank-declares-n28-9bn-profit-in-2020-financial-year/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "banks",
            "return",
            "bank",
            "2020",
            "mr",
            "significant",
            "polaris",
            "financial",
            "loans",
            "quality",
            "n289bn",
            "deposits",
            "performance",
            "profit",
            "declares"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "How Mao Lal Forged His Success Story From The Ground Up",
          "summary": "One such entrepreneur from Europe is Mao Lal.\nMao Lal, through Bitsons, is providing an opportunity to everyone for building up an additional income.\nIt was in 2010 that Mao Lal had started mining bitcoin with his own computer.\nAsk him what excites him the most in his business and Mao Lal replies, “Success”.\nADVERTISEMENTAlso, Mao Lal has made a unique place for himself in the industry as he has been involved with blockchain technology from the very beginning.",
          "link": "https://leadership.ng/how-mao-lal-forged-his-success-story-from-the-ground-up/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "mao",
            "lal",
            "world",
            "industry",
            "bitcoin",
            "industries",
            "trading",
            "forged",
            "business",
            "bitsons",
            "blockchain",
            "success",
            "ground"
          ]
        },
        {
          "title": "Jimmy Smacks Emphasises Importance Of Truth And Transparency As An Artist",
          "summary": "BY OUR CORRESPONDENTWhile the platform OnlyFans has become well-known for adult content, it is not solely an NSFW site.\nThe most famous name, of course, is that of Jimmy Smacks.\nSmacks used his success to take care of his family financially and has met several of his idols.\nHe emphasizes the importance of truth and transparency plus focusing on the things that bring us happiness.\nShowing a welcome trait in celebrities, Jimmy Smacks believes in being open with people and living the same life offstage that you do in public.",
          "link": "https://leadership.ng/jimmy-smacks-emphasises-importance-of-truth-and-transparency-as-an-artist/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "emphasises",
            "z",
            "content",
            "truth",
            "living",
            "family",
            "transparency",
            "jimmy",
            "public",
            "artist",
            "onlyfans",
            "success",
            "importance",
            "platform",
            "smacks"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "UFC: Usman, McGregor in war of words",
          "summary": "There might be a clash in the future between reigning UFC welterweight champion Kamaru Usman and Conor McGregor after both superstars reignited their rivalry on social media on Monday.\nUsman defended his welterweight title for the fourth time with a second round knockout victory over Jorge Masvidal at the UFC 261 at the VyStar Veterans Memorial Arena in Jacksonville, Florida, on Sunday in front of 15,000 screaming fans.\nMcGregor has created a knack for taunting Usman after every win the Nigerian records, claiming he will one day come for the title in the welterweight division.\nThe Irish fighter, in a post on Twitter, accused Usman of copying his moves in knocking out Masvidal, stating that he would destroy the Nigerian when they clash.\nIn his reply, Usman referred to the former UFC featherweight and lightweight champion as a washed out fighter who got beaten easily in his preferred weight class.",
          "link": "https://daylightng.com/ufc-usman-mcgregor-in-war-of-words/",
          "published": "04/28/2021",
          "scraped_date": "04/28/2021",
          "keywords": [
            "shots",
            "usman",
            "nigerian",
            "fight",
            "ufc",
            "words",
            "mcgregor",
            "war",
            "fighter",
            "title",
            "masvidal",
            "welterweight"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}