{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "Lagos locates 150-bed children’s hospital near LAWMA refuse loading station",
          "summary": "Sanwo- Olu had, on April 28, inaugurated the construction of Massey Street Children’s Hospital, a 150-bed specialist facility for children in the state.\n“The current Massey Children’s Hospital was established in 1914 as the First General Outpatient Clinic and Referral Centre in Lagos State.\nThe hospital is close to a LAWMA facility that receives and transfers refuse on a daily basis.\n“The LAWMA facility is not a facility that holds waste.\nWhen you go there, you will not perceive any odour,” the commissioner told his radio host, Jimi Disu, who had also decried the proposed children’s hospital location.",
          "link": "https://healthwise.punchng.com/lagos-locates-150-bed-childrens-hospital-near-lawma-refuse-loading-station/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "station",
            "lagos",
            "loading",
            "hospital",
            "150bed",
            "trucks",
            "healthwise",
            "refuse",
            "correspondent",
            "childrens",
            "lawma",
            "road",
            "area",
            "locates",
            "state",
            "near",
            "facility"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "MASSOB declares May 30 as ‘Biafra Day’",
          "summary": "Kindly Share This Story:By Anayo OkoliThe Movement for the Actualization of the Sovereign State of Biafra, MASSOB, has declared May 30th as Biafra Day.\nThe group explained that it will not be celebrated but urged all markets, schools, banks and all other public offices in Biafra land to observe a sit at home exercise as a mark of respect for their fatherland.\nThis was contained in a statement by their National Director of Information, Samuel Edeson in which the body explained that it took the decision after its National meeting at MASSOB headquarters in Enugu during which it insisted on commemorating Biafra Day on May 30th in respect of the ordinances of the late Warlord and leader of Biafra, Dim Chukwuemeka Odumegwu Ojukwu.\nThey urged Biafrans to observe special prayers and supplication for all their fallen heroes and enjoined their people to prepare for what they described as a great anniversary and reminder of their struggle.\nVanguard News NigeriaKindly Share This Story:",
          "link": "https://www.vanguardngr.com/2021/05/massob-declares-may-30-as-biafra-day/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "30",
            "day",
            "statement",
            "biafra",
            "30th",
            "observe",
            "declares",
            "anniversary",
            "urged",
            "great",
            "massob",
            "respect",
            "group",
            "explained"
          ]
        },
        {
          "title": "‘We were robbed by hawkers, beggars at gunpoint’",
          "summary": "It has been varied experiences from one area to the other especially along Ikorodu Road, precisely Ketu/Ojota, Mile 12, Fadeyi, Maryland and Costain.\nFor instance, a motorist, Mrs. Serifat Babalola, said a traffic robber removed her necklace during a traffic robbery.\nAt Alakuko Bus-stop, Pastor Oluwasemilogo Moradeyo said he lost Automated Teller Machine (ATM) cards to traffic robbers who attacked him.\nAt different fora, Lagos State Commissioner of Police, CP Hakeem Odumosu, said various strategies had been put in place to eradicate traffic robbery across Lagos.\nOdumosu said a number of traffic robbers had been apprehended and their cases referred to the State Criminal Investigative Department, Yaba for investigation and possible prosecution.",
          "link": "https://www.vanguardngr.com/2021/05/we-were-robbed-by-hawkers-beggars-at-gunpoint/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "lagos",
            "traffic",
            "parts",
            "robbers",
            "security",
            "robbed",
            "hawkers",
            "road",
            "mile",
            "gunpoint",
            "ikorodu",
            "robbery",
            "beggars",
            "victims"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Nigeria will overcome tough times",
          "summary": "Mr. Geoffrey Onyeama, Nigeria’s Foreign Affairs minister, weekend, acknowledged that the country was passing through a tough phase.\nHe, however, said with a collaborative effort of all, including the younger generation, the challenges would be surmounted.\nHe said, “things are tough in Nigeria at the moment; Nigeria not rich as it ought to be, so we are going to rely on even you, the younger generation.\nSo, we believe that investment on the young generation is the way to go.\nWe believe that if we can secure quality education for our youths, a bright future is secure for Nigeria.",
          "link": "https://dailypost.ng/2021/05/02/nigeria-will-overcome-tough-times-foreign-affairs-minister-onyeama/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "best",
            "younger",
            "nigeria",
            "tough",
            "schools",
            "education",
            "generation",
            "overcome",
            "believe",
            "youths",
            "young",
            "country",
            "times"
          ]
        },
        {
          "title": "‘They have paralysed judiciary, only go to Abuja’ – Agbakoba blasts Nigerian governors",
          "summary": "He, however, said with a collaborative effort of all, including the younger generation, the challenges would be surmounted.\nHe said, “things are tough in Nigeria at the moment; Nigeria not rich as it ought to be, so we are going to rely on even you, the younger generation.\nSo, we believe that investment on the young generation is the way to go.\n“This is just the beginning; I believe that education is the core, it is the most important asset of every developing country.\nWe believe that if we can secure quality education for our youths, a bright future is secure for Nigeria.",
          "link": "https://dailypost.ng/2021/05/02/they-have-paralysed-judiciary-only-go-to-abuja-agbakoba-blasts-nigerian-governors/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "best",
            "younger",
            "governors",
            "nigeria",
            "schools",
            "agbakoba",
            "education",
            "judiciary",
            "generation",
            "blasts",
            "nigerian",
            "believe",
            "youths",
            "paralysed",
            "abuja",
            "young",
            "country"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Guardiola in love with ‘incredible’ Aguero",
          "summary": "Sergio Aguero’s Manchester City career is in its final weeks but the 32-year-old provided evidence of just how much he will be missed on Saturday.\nInjury, illness and manager Pep Guardiola’s preference for a line-up featuring no orthodox striker have limited Aguero’s appearances in his final season, a decade after joining.\nADVERTISEMENTBut given a rare start at Crystal Palace he produced a stunning strike to send City on their way to a 2-0 win and to the brink of a fifth Premier League title in 10 seasons.\nAguero has been integral in the other four, and while his fifth will have been limited to cameo roles, he remains a player who will attract interest from around the world.\nRead Also: Solskjaer rules out Aguero for Man UnitedGuardiola was generous in his praise for City’s all-time leading scorer after he took his Premier League tally for the club to 182 goals in 273 appearances.",
          "link": "https://thenationonlineng.net/guardiola-in-love-with-incredible-aguero/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "city",
            "aguero",
            "premier",
            "guardiola",
            "agueros",
            "incredible",
            "love",
            "goal",
            "final",
            "fifth",
            "player",
            "league",
            "limited",
            "man"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Anxiety as NIN registration ends on Thursday",
          "summary": "In the run-up to the expiry of the fourth deadline, Sunday Sun presents a random sample of reports from states on the NIN registration exercise.\nAt another NIN registration centre at the bustling Ojuoye market, the agents charge N2,000 before they register anyone.\nHowever, not all branches of the bank do NIN registration, probably because they were not allowed to charge minimal fees.\nHowever, many Rivers residents still doubt Federal Government’s sincerity in the purpose for the NIN registration.\nOnly the designated NIN enrollment centres and the Birnin Kebbi offices of GSM network providers were allowed to handle NIN enrollment on behalf of the NIMC.",
          "link": "https://www.sunnewsonline.com/anxiety-as-nin-registration-ends-on-thursday/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "anxiety",
            "registered",
            "registration",
            "nin",
            "nimc",
            "centres",
            "register",
            "enrollment",
            "ends",
            "sim",
            "business",
            "centre"
          ]
        },
        {
          "title": "I’ve been depressed, rejected because of my crossed-eyes –Faith Ajayi, beauty queen",
          "summary": "Edo-born Faith Ajayi is pretty, but cross-eyed, and because of this, she was rejected several times by modeling agencies and beauty pageant organisers.\nRecently, she contested and won the Miss Melanin beauty pageant.\nI checked it out and was reluctant to apply because of my crossed-eyes, which made modeling agencies and beauty pageant organisers to disqualify me a number of times.\nInitially, my father wanted me to attend a military secondary school, but his death stopped me.\nYes, at some point, before the beauty pageant idea came to my mind.",
          "link": "https://www.sunnewsonline.com/ive-been-depressed-rejected-because-of-my-crossed-eyes-faith-ajayi-beauty-queen/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "ajayi",
            "rejected",
            "crossedeyes",
            "beauty",
            "faith",
            "wanted",
            "eyes",
            "depressed",
            "mother",
            "tell",
            "queen",
            "modeling",
            "ive",
            "told",
            "person",
            "father",
            "pageant"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Covid-19: FG to Deny Travellers Entry from India, Brazil and Turkey",
          "summary": "These precautionary measures are a necessary step to minimize the risk of a surge in COVID-19 cases introduced to Nigeria from other countries, while national response activities continue.\nAccording to him, “Any person who has visited Brazil, India or Turkey within fourteen (14) days preceding travel to Nigeria, shall be denied entry into Nigeria.\nThe following condition shall apply to such passengers: Within 24 hours of arrival shall take a COVID-19 PCR test.\n“If positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf Negative, the Passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day 7 of their quarantine.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/covid-19-fg-to-deny-travellers-entry-from-india-brazil-and-turkey/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "brazil",
            "fg",
            "pcr",
            "nigeria",
            "cases",
            "passenger",
            "shall",
            "countries",
            "federal",
            "travel",
            "travellers",
            "entry",
            "deny",
            "turkey",
            "covid19",
            "passengers",
            "india"
          ]
        },
        {
          "title": "Fayemi to Youth: Stop Agonising, Use Your Numerical Strength to Effect Changes",
          "summary": "We are not there yet but that does not mean we will give up.”Addressing the security situation in the country, the Chairman, of Nigeria Governors Forum (NGF) stressed that everyone was living in fear over the security situation.\nWe need a security system that is localised, knowledgeable about the culture and security situation of a particular community.\n“The mutating security situation in our country requires a concerted effort.\n“Today, the greatest challenges facing the country are the youth explosion and the corresponding unemployment challenge.\nWe should rather teach pluralism and how to remain faithful in the midst of other competing belief systems.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/fayemi-to-youth-stop-agonising-use-your-numerical-strength-to-effect-changes/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "system",
            "youth",
            "numerical",
            "religious",
            "nigeria",
            "insecurity",
            "security",
            "national",
            "agonising",
            "country",
            "strength",
            "need",
            "stop",
            "effect",
            "situation",
            "changes",
            "fayemi"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "islamic",
            "borno",
            "gathered",
            "military",
            "haram",
            "currently",
            "soldiers",
            "killed",
            "insurgents",
            "boko",
            "flee",
            "attacking",
            "area",
            "state",
            "residents",
            "breaking",
            "community"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "islamic",
            "borno",
            "gathered",
            "military",
            "haram",
            "currently",
            "soldiers",
            "killed",
            "insurgents",
            "boko",
            "flee",
            "attacking",
            "area",
            "state",
            "residents",
            "breaking",
            "community"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Mr President, Nigeria must not go down",
          "summary": "President, Nigeria Is Going Down’.\nI recall, and repeat, the opening salvo: “Mr President, I don’t know how you would take this, but there is no nicer way of putting it – Nigeria is going down.\nI will tell you a very short story, Mr President.\nHaving said that, Mr President, I now want to make my point: Nigeria is going down, and very fast.\nI do not for a minute, Mr President, underestimate some of your strides.",
          "link": "https://www.thecable.ng/mr-president-nigeria-must-not-go-down",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "things",
            "boko",
            "nigeria",
            "political",
            "haram",
            "insecurity",
            "mr",
            "president",
            "know",
            "excellency"
          ]
        },
        {
          "title": "Crimson as colour of Remi Tinubu’s wolf and sheep allegory",
          "summary": "That was what she did last week when she introduced the wolf and sheep allegory into the current national discourse on the security situation in Nigeria.\nBenue State governor, Samuel Ortom, stood before seven bodies lying prostrate or face-up, in different postures.\nUpon the wolf having grown, unknown to the shepherd, the wolf returned to the flesh-eating gastronomy of its wolf ancestry.\nAgain, it is apposite to ask whether former Miss Ikusebiala was speaking like a mother when she made that wolf and sheep statement.\nAdvertisementUpper week, Yobe State governor and All Progressives Congress (APC’s) interim national chairman, Mai Mala Buni, walked that same boastfully ruinous path.",
          "link": "https://www.thecable.ng/crimson-as-colour-of-remi-tinubus-wolf-and-sheep-allegory",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "apc",
            "crimson",
            "nigeria",
            "allegory",
            "fulani",
            "tinubus",
            "party",
            "national",
            "governor",
            "colour",
            "ikusebiala",
            "remi",
            "wolf",
            "state",
            "sheep"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "cbn",
            "skye",
            "board",
            "sanusi",
            "bruised",
            "sacking",
            "tradition",
            "banks",
            "governor",
            "emefiele",
            "bank",
            "otudeko",
            "enforces",
            "took"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "expansion",
            "nigeria",
            "expand",
            "size",
            "companies",
            "value",
            "startups",
            "fintech",
            "company",
            "country",
            "market",
            "business",
            "partnerships",
            "aggressive"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "army",
            "defeat",
            "followed",
            "ne",
            "observer",
            "coas",
            "operation",
            "locations",
            "nigerian",
            "counterinsurgency",
            "counterterrorism",
            "renaming",
            "disclosed",
            "renames"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "cattle",
            "web",
            "outlawed",
            "19",
            "register",
            "wish",
            "underaged",
            "immediate",
            "jan",
            "prohibited",
            "nightgrazing",
            "movement",
            "highways"
          ]
        },
        {
          "title": "Fidelity Bank Approves 22 Kobo Dividend Per Share For FY2020",
          "summary": "The shareholders of Fidelity Bank Plc have unanimously endorsed the payment of a cash dividend of 22 kobo per share to all Shareholders whose names appear in the Register of Members at the close of business on April 16, 2021.\nThis translates to a dividend yield of 9.2%, making it the 4th most rewarding Bank to investors in the Nigerian Capital Market.\nMustapha Chike-Obi, Chairman of the Board of Directors of Fidelity Bank, reassured shareholders at the AGM that the board and management of the bank would maintain the high corporate governance standard synonymous with Fidelity Bank and also ensure the bank continued in its growth trajectory in the years ahead.\nTotal savings deposits now account for about 25.0 percent of total deposits, an attestation of the Bank’s increasing market share in the retail market segment.\nOnyeali-Ikpe thanked the shareholders and the members of the Board for their continued confidence in the management team and specially appreciated Fidelity Bank customers for their patronage and loyalty.",
          "link": "https://hallmarknews.com/fidelity-bank-approves-22-kobo-dividend-per-share-for-fy2020/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "billion",
            "shareholders",
            "22",
            "deposits",
            "fy2020",
            "approves",
            "total",
            "bank",
            "growth",
            "fidelity",
            "performance",
            "period",
            "share",
            "dividend",
            "kobo"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "KP2 Print Targets Solutions To Youth Unemployment",
          "summary": "BY HENRY TYOHEMBA |The managing director of Nigeria’s famous print company, KAS Prints, Mr Ademola Kasumu has said the launch of its new programme, KP2 Print, is aimed at addressing the high rate of youth unemployment in Nigeria.\nKasumu who spoke in Abuja yesterday during the launch of the digital printer’s network (KP2)/induction and dinner night, said the programme will provide a lot of benefits to unemployed youths, especially those who will be inducted.\nThe KAS Partnership Program (KP2) is a digital print partnership that provides opportunities for printers and graphic designers to have an undiluted access to global printing standards, designed to improve production and quality speed at an unprecedented 40% discounted rate using a 2400dpi print resolution.\nSpeaking on the theme, “Building Our Future Together In The Printing Industry,” Kasumu said the programme is also targeting over 2000 members around the country before the end of the year.\nHe said, “This is going to be in line with the desire of the government in creating jobs for the young ones.",
          "link": "https://leadership.ng/kp2-print-targets-solutions-to-youth-unemployment/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "unemployment",
            "youth",
            "solutions",
            "members",
            "programme",
            "digital",
            "printers",
            "rate",
            "kp2",
            "given",
            "print",
            "service",
            "targets",
            "printing"
          ]
        },
        {
          "title": "Dangote Cement To Pay N40.39bn In Corporate Tax",
          "summary": "Dangote Cement Plc is expected to pay a total of N40.39 billion in taxation to the Nigeria’s treasury from its operational result in the first quarter of 2021.\nAs part of the company’s corporate social responsibility, in line with the government’s quest to boost infrastructure development in the country, Dangote Cement opted to provide funding for the constructions of major roads in Lagos and Kogi states.\nDangote Cement also increased total volume of cement sold in the first three months of the year from its Nigerian operations to 4.9Mt compared to the 4.0Mt sold in the first quarter of 2020.\nHe stated that the cement company posted a profit after tax N89.7 billion.\nDangote Cement Plc is sub-Saharan Africa’s largest cement producer with an installed capacity of 48.6Mta across 10 African countries and operates a fully integrated “quarry-to-customer” business with activities covering manufacturing, sales and distribution of cement.",
          "link": "https://leadership.ng/dangote-cement-to-pay-n40-39bn-in-corporate-tax/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "financial",
            "volume",
            "quarter",
            "sold",
            "corporate",
            "cement",
            "tax",
            "dangote",
            "period",
            "pay",
            "company",
            "n4039bn",
            "result"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police inspector accidentally shot self, not suicide – PPRO —",
          "summary": "A Police Inspector identified as Ochofie Ijimbile, attached to MOPOL 55 Aba, Abia State, has allegedly shot and killed himself while servicing his rifle in readiness for the day’s job.\nPolice spokesman in the Command, SP Geoffrey Ogbonna, while describing the incident as sad and unfortunate, told reporters that Inspector Ijimbile accidentally shot himself on the chest.\nFollowing the incident, he was immediately rushed to the hospital, where he was confirmed dead.\nWhile stating that the late policeman could be unaware that there was bullet in his rifle chamber, called on policemen in Abia and across the country, especially those handling rifles to always exercise extra carefulness while servicing their arms.\nHis corpse has since been deposited in the morgue while efforts are on to reach the family members",
          "link": "https://dailytimes.ng/police-inspector-accidentally-shot-self-not-suicide-ppro/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "shot",
            "rifle",
            "inspector",
            "unfortunate",
            "incident",
            "servicing",
            "accidentally",
            "abia",
            "self",
            "told",
            "ppro",
            "ijimbile",
            "suicide",
            "unaware"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Public outrage: El-Rufai missing at The Platform",
          "summary": "Kaduna State Governor, Nasir El-Rufai, may have caved in to pressure from some Nigerians who opposed his being listed as a speaker at the 2021 edition of The Platform, an annual conference organised by the Senior Pastor of the Covenant Christian Centre, Lagos, Poju Oyemade.\nThe programme was themed, ‘Is Devolution of Powers The Solution To Nigeria’s Problems’.\nHowever, El-Rufai, who was announced as one of the speakers at the event, was conspicuously absent from the programme on Saturday.\nAlso, the organisers of the programme did not give any reason why El-Rufai was not present at the event.\nSome Twitter users had kicked against the choice of El-Rufai as a speaker on The Platform when the flyer inviting people to the event went viral with the governor as one of the speakers.",
          "link": "https://daylightng.com/public-outrage-el-rufai-missing-at-the-platform/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "platform",
            "speaker",
            "programme",
            "event",
            "elrufai",
            "outrage",
            "line",
            "governor",
            "speakers",
            "went",
            "missing",
            "public",
            "state"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "page",
            "place",
            "bookmaker",
            "popular",
            "mobile",
            "emerges",
            "website",
            "version",
            "launches",
            "convenient",
            "1xbet",
            "account",
            "offers",
            "site"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "system",
            "npa",
            "callup",
            "drivers",
            "roads",
            "worsening",
            "trucks",
            "ecall",
            "truck",
            "gridlock",
            "apapa",
            "amidst",
            "road",
            "electronic"
          ]
        }
      ]
    }
  }
}