{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": []
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "BREAKING: Shekau appoints Muhammad as Boko Haram war commander, kills predecessor, Modu’s son",
          "summary": "Abubakar Shekau, factional head of Boko Haram has appointed Abu Muhammad as the new Amirul Jaysh (Commander of War).\nShekau announced the replacement after killing the former Commander, Abu Fatimah.\nAccording to PRNigeria, Shekau personally shot and killed Abu Fatimah last week for allegedly betraying the sect.\n“Following an internal dispute, Shekau killed Abu Fatima, one other Commander and Amirul Fi’ya, a son to a renowned Bama businessman, Alhaji Modu Katakauma,” the source said.\nEarly this year, the Shura (consultation) Council of the Islamic State West Africa Province (ISWAP) announced the appointment of Abu Dawud as new leader.",
          "link": "https://dailypost.ng/2021/04/29/breaking-shekau-appoints-muhammad-as-boko-haram-war-commander-kills-predecessor-modus-son/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "shekau",
            "week",
            "kills",
            "muhammad",
            "killed",
            "west",
            "amirul",
            "modus",
            "announced",
            "abu",
            "breaking",
            "chakkar",
            "commander",
            "son",
            "haram",
            "predecessor",
            "warshekau",
            "war"
          ]
        },
        {
          "title": "Reps move to change Sabon Gari local govt to Zaria North local govt",
          "summary": "On Thursday, the House of Representatives passed through second reading, a bill to change Sabon Gari local government to Zaria North local government.\nThe Constitution alteration bill is also seeking to add ‘South’ to the existing Zaria local government to now have Zaria North and Zaria South local governments.\nIf passed, the first schedule to the Constitution of the Federal Republic of Nigeria, 1999 will be amended.\nFollowing the passage of the bill, it was referred to the House Committee on constitution amendment.\nChanging of names of local governments and states are constitutional matters that can only be done through the amendment of the constitution.",
          "link": "https://dailypost.ng/2021/04/29/reps-move-to-change-sabon-gari-local-govt-to-zaria-north-local-govt/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "zaria",
            "reps",
            "gari",
            "house",
            "states",
            "sabon",
            "tajudeen",
            "north",
            "bill",
            "local",
            "change",
            "south",
            "passed",
            "constitution",
            "govt"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Lagos govt detects lies in viral amputee hawker’s claims, withholds N25m donation",
          "summary": "Following her harrowing tales, Nigerians started donating money through her bank account made public with about N25m raised.\nAll was going well for the young lady until the state government discovered on Thursday her father was alive.\nIt was gathered Governor Babajide Sanwo-Olu immediately handed her over to officials of the social welfare for investigation following revelations her case was staged.\nCommissioner of Police Hakeem Odumosu told The Nation the young woman was in the custody of officials of the Social Welfare and not the police as earlier reported.\nShe was handed over to the Social Welfare.",
          "link": "http://community.thenationonlineng.net/forum/lagos-govt-detects-lies-in-viral-amputee-hawker-s-claims-withhold",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "father",
            "amputated",
            "handed",
            "hawkers",
            "donation",
            "social",
            "withholds",
            "officials",
            "lagos",
            "detects",
            "discovered",
            "claims",
            "govt",
            "lies",
            "viral",
            "nigerians",
            "state",
            "n25m",
            "welfare",
            "oshodi"
          ]
        },
        {
          "title": "‘How ex-governors, others acquired 800 Dubai assets’",
          "summary": "The eminent persons were said to have spent over $400m to acquire 800 properties in Dubai.\nHe said while a serving governor in the Northwest has eight Dubai properties ($5million), a former PDP national chairman acquired 11 Dubai and two London homes at $18million.\nHe said a former Deputy Senate President secured 14 Dubai properties at $12million and one of his successors bought eight Dubai assets and three UK properties at $15million.\nEstimated Fees paid: £447000+“A prominent career politician from Southern Nigeria sent multiple children to top British boarding schools and universities.\n“We are already working with the FIRS and getting a lot of tax evaders and defaulters into the nation’s tax net.",
          "link": "http://community.thenationonlineng.net/forum/how-ex-governors-others-acquired-800-dubai-assets",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "properties",
            "fees",
            "money",
            "united",
            "acquired",
            "nigeria",
            "dubai",
            "exgovernors",
            "children",
            "universities",
            "assets",
            "tax",
            "politician",
            "800"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Why Nigerian Politicians don’t invest in football –Sen Kalu",
          "summary": "By Monica IheakamThe Chief Whip of the Nigerian Senate, Senator Orji Uzor Kalu has shed lights on why Nigerian politicians shy away from identifying with football in the country.\n“Nigerian football is not profitable because there are no infrastructures and it is not something anybody can run.\n“We don’t have the infrastructure to be able to place football to where it is supposed to be.\n“These are the infrastrures we don’t have, these are investments we need to make to be able to get our football where we want it to be.\nOur people do not have stable income; traders today might not be a trader tomorrow.",
          "link": "https://www.sunnewsonline.com/why-nigerian-politicians-dont-invest-in-football-sen-kalu/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "football",
            "dont",
            "senator",
            "needed",
            "nigerian",
            "income",
            "tomorrow",
            "able",
            "politicians",
            "profitable",
            "invest",
            "stable",
            "sen",
            "aba",
            "kalu"
          ]
        },
        {
          "title": "Kalu hails Adenuga at 68",
          "summary": "Former Abia governor and Senate Chief Whip, Dr. Orji Uzor Kalu, has congratulated the founder and chairman of Globalcom Limited, Michael Adenuga, on his 68th birthday anniversary.\nDescribing the celebrant as an age-long friend, Kalu acknowledged the contributions of Adenuga to the socio- economic development of Nigeria.\nWhile commending his entrepreneurship efforts, Kalu said the business mogul, through hard work, perseverance and consistency, has built a robust business empire.\n“The celebrant is a household name beyond the shores of Africa, in view of his outstanding and robust contributions to sustainable development across Africa.\nThe celebrant deserves to be celebrated today and always as a successful business mogul and philanthropist of repute.”Kalu urged Adenuga to sustain his good works in all endeavours.",
          "link": "https://www.sunnewsonline.com/kalu-hails-adenuga-at-68-2/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "robust",
            "mogul",
            "hails",
            "celebrant",
            "business",
            "development",
            "68",
            "founder",
            "contributions",
            "works",
            "adenuga",
            "kalu"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Airtel Africa Appoints Nigerian, Olusegun Ogunsanya, as CEO",
          "summary": "By Emma OkonjiAirtel Africa Plc, provider of telecommunications and mobile money services, with presence in 14 African countries, Nigeria inclusive, has announced the Managing Director and CEO of Airtel Nigeria, Mr. Olusegun Ogunsanya, as the CEO of Airtel Africa.\nOgunsanya will join the Board of Airtel Africa plc with effect from October 1, 2021.\nOgunsanya joined Airtel Africa in 2012 as Managing Director and CEO Nigeria and has been responsible for the overall management of its operations in Nigeria, which is the largest Airtel market in Africa.\nAirtel Nigeria said it would soon announce the appointment of a new Managing Director and CEO of Airtel Nigeria, who will replace Ogunsanya.\nAnnouncing the appointment of Ogunsanya, the Chairman of of Airtel Africa, Sunil Bharti Mittal, said: “We are delighted to appoint Segun Ogunsanya as the Group’s next Chief Executive Officer.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/29/airtel-africa-appoints-nigerian-olusegun-ogunsanya-as-ceo/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "ceo",
            "officer",
            "appoints",
            "managing",
            "airtel",
            "nigeria",
            "mandava",
            "director",
            "ogunsanya",
            "olusegun",
            "africa",
            "executive",
            "nigerian"
          ]
        },
        {
          "title": "Harsher Times Beckon as NNPC Warns No FAAC Remittance for May",
          "summary": "A copy of the letter, signed by the corporation’s Chief Financial Officer, Mr. Umar Ajiya, and dated April 26, 2021, was obtained by THISDAY yesterday.\nThe implication is that the zero remittance from the NNPC may affect the monthly allocation to states, which may ultimately struggle to meet their statutory obligations, including payment of salaries and pensions.\nIt stated: “Further to our previous correspondences on the above subject, we wish to advise on the projected remittance to the Federation Account for the months of April (May FAAC) to June 2021 (July 2021 FAAC).\nGroup Managing Director of the NNPC, Mallam Mele Kyari, had earlier raised the alarm over the rising landing cost of the product, saying that the NNPC could not continue in that trajectory.\nThat policy was implemented for months until crude oil prices rose again, and the eventual return of subsidies’ payment, which the NNPC has put at about N120 billion monthly.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/29/harsher-times-beckon-as-nnpc-warns-no-faac-remittance-for-may/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "times",
            "faac",
            "account",
            "federation",
            "warns",
            "beckon",
            "corporation",
            "oil",
            "nnpc",
            "petrol",
            "remittance",
            "price",
            "2021",
            "harsher",
            "cost"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Killings: God Has Asked Me To Withdraw Support For Buhari And Prophesy Against Him—Father Mbaka",
          "summary": "Ejike Mbaka, has lambasted President Muhammadu Buhari, saying God is not happy with his government because of the insecurity and killings in the country.\n\"Remember there was a time God asked me to support you people (Buhari regime), now God asked me to withdraw and prophesy against you.\nMbaka also praised the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, for speaking against the marginalisation of the Igbo people in Nigeria.\nSee Also Politics May God Bless Nnamdi Kanu Wherever He is—Father Mbaka Says In Viral VideoMbaka, in a viral video obtained by SaharaReporters, was heard praising the IPOB leader.\nHe said he had not met Nnamdi Kanu before, but may God bless him.",
          "link": "http://saharareporters.com/2021/04/29/killings-god-has-asked-me-withdraw-support-buhari-and-prophesy-against-him—father-mbaka",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "support",
            "prophesy",
            "kanu",
            "fr",
            "viral",
            "withdraw",
            "president",
            "mbaka",
            "himfather",
            "asked",
            "nnamdi",
            "sick",
            "god",
            "buhari",
            "fly",
            "killings",
            "bless"
          ]
        },
        {
          "title": "Killings: God Has Asked Me To Withdraw Support For Buhari And Prophesy Against Him—Father Mbaka",
          "summary": "Ejike Mbaka, has lambasted President Muhammadu Buhari, saying God is not happy with his government because of the insecurity and killings in the country.\n\"Remember there was a time God asked me to support you people (Buhari regime), now God asked me to withdraw and prophesy against you.\nMbaka also praised the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, for speaking against the marginalisation of the Igbo people in Nigeria.\nSee Also Politics May God Bless Nnamdi Kanu Wherever He is—Father Mbaka Says In Viral VideoMbaka, in a viral video obtained by SaharaReporters, was heard praising the IPOB leader.\nHe said he had not met Nnamdi Kanu before, but may God bless him.",
          "link": "http://saharareporters.com/2021/04/29/killings-god-has-asked-me-withdraw-support-buhari-and-prophesy-against-him%E2%80%94father-mbaka",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "support",
            "prophesy",
            "kanu",
            "fr",
            "viral",
            "withdraw",
            "president",
            "mbaka",
            "himfather",
            "asked",
            "nnamdi",
            "sick",
            "god",
            "buhari",
            "fly",
            "killings",
            "bless"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Mbaka to Buhari: God is angry with you -- resign now",
          "summary": "Ejike Mbaka, spiritual director of Adoration Ministry Enugu, Nigeria (AMEN), has asked President Muhammadu Buhari to resign over the worsening insecurity in the country.\nAdvertisementSpeaking on Wednesday, Mbaka said God is angry with the president over his inaction on the widespread killings across the nation.\nIf it is in a civilized country, by now, President Buhari will resign.\nBy now, with what is happening, President Buhari should honourably resign.\nGod’s anger is upon you, you have failed God.”In November, Mbaka asked Buhari to apologise to Nigerians over bad governance.",
          "link": "https://www.thecable.ng/mbaka-to-buhari-god-is-angry-with-you-resign-now",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "country",
            "nigerians",
            "president",
            "mbaka",
            "crying",
            "asked",
            "angry",
            "god",
            "resign",
            "buhari",
            "leaders"
          ]
        },
        {
          "title": "Anxiety over intense security checks at national assembly",
          "summary": "There is currently anxiety at the national assembly over intense checks by the police and other security agencies.\nAdvertisementLawmakers, national assembly workers, legislative aides and visitors were made to undergo thorough checks.\nIdentity cards were checked and vehicles were searched before anyone could gain entry into the national assembly.\nThe security protocol witnessed on Thursday was different from that of Wednesday or Tuesday.\nIt is unclear what intelligence the security agents are working on but the development caused gridlock at the entrance of the national assembly.",
          "link": "https://www.thecable.ng/anxiety-over-intense-security-checks-at-national-assembly",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "witnessed",
            "checks",
            "weeks",
            "intense",
            "way",
            "anxiety",
            "assembly",
            "security",
            "bandits",
            "workers",
            "weekit",
            "national",
            "working"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "EXCLUSIVE: CBN asks First Bank to call in Otudeko’s Honeywell Flour Mills loan facility within 48 hours",
          "summary": "The Central Bank of Nigeria has directed the Oba Otudeko owned Honeywell Flour Mills to repay a loan to First Bank within 48 hours, according to a memo seen by TechCabal.\nOtudeko also served as Chairman of First Bank until 2010 and is also the Chairman of the Honeywell Group.\nBut the CBN is alleging that First Bank gave special treatment to Honeywell Flour Mills in restructuring its loan facility.\nThis order to divest from the apex bank has its roots in yet another bank loan involving Ecobank, Oba Otudeko and some Airtel shares used as a collateral.\nAccording to news reports, Otudeko’s Airtel shares were used as collateral for Honeywell’s Ecobank loan.",
          "link": "https://techcabal.com/2021/04/29/cbn-first-bank-otudeko/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "memo",
            "flour",
            "exclusive",
            "bank",
            "honeywell",
            "mills",
            "airtel",
            "nigeria",
            "otudeko",
            "otudekos",
            "cbn",
            "hours",
            "facility",
            "loan",
            "shares"
          ]
        },
        {
          "title": "Exclusive: Ahead of visits to Nigeria and Egypt, Y Combinator MD reflects on Africa’s tech boom",
          "summary": "Michael Seibel, Group Partner and Managing Director of Early Stage at Y Combinator, plans to visit Africa soon.\nMore than 40 African startups have gone to YC.\nAnd while it will be deployed differently by founders, YC fundamentally wants to help founders achieve product-market fit.\nBuilding in Africa, beyond Nigeria and KenyaMost YC-backed African startups are in Nigeria, East Africa and Egypt.\nOstensibly, YC will be open to them and perhaps we may see another country’s first YC startup in the Summer 21 batch.",
          "link": "https://techcabal.com/2021/04/29/michael-seibel-ycombinator-visit-nigeria-egypt-african-tech/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "money",
            "y",
            "yc",
            "african",
            "nigeria",
            "combinator",
            "egypt",
            "africa",
            "tech",
            "exclusive",
            "founders",
            "startup",
            "boom",
            "seibel",
            "visits",
            "payments",
            "md",
            "startups",
            "reflects"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "BORBDA, Koster Keunen West Africa Others Sign MOU On Bee Products Marketing – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAS a way of boosting honey production in Nigeria and the West African sub region, the Benin Owena River Basin Development Authority (BORBDA) has signed a memorandum of Understanding with off-takers of honey and bee products.\nAt the Conference room of BORBDA on Friday, BORBDA Managing Director Engr.\nAlso a co-signatory in the agreement was Mr innocent Odigie, Managing Director Dino Trust Global Company Ltd, a bee keeping expert who signed on behalf of his company.\nHe therefore urged the stakeholders especially the state governments and traditional rulers to encourage modern bee keeping and honey production given its suitability in our local environment.\nHe urged the bee farmers to take advantage of the market to expand their respective bee colonies for increased yields.",
          "link": "http://nigerianobservernews.com/2021/04/borbda-koster-keunen-west-africa-others-sign-mou-on-bee-products-marketing/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "production",
            "mou",
            "observer",
            "west",
            "bee",
            "managing",
            "products",
            "keeping",
            "nigeria",
            "marketing",
            "state",
            "borbda",
            "sign",
            "koster",
            "honey",
            "keunen",
            "nigerian"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "prohibited",
            "nightgrazing",
            "movement",
            "immediate",
            "wish",
            "underaged",
            "highways",
            "cattle",
            "19",
            "web",
            "register",
            "outlawed",
            "jan"
          ]
        },
        {
          "title": "Airtel Africa appoints Olusegun Ogunsanya new CEO",
          "summary": "OBINNA EZUGWUAirtel Africa plc has announced the appointment of Olusegun “Segun” Ogunsanya as Managing Director and Chief Executive Officer, to succeed Raghunath “Raghu” Mandava.\nOgunsanya will join the Board of Airtel Africa plc with effect from 1 October 2021, a statement from the company said on Thursday.\nFollowing his cessation of employment at Airtel Africa, Mr. Mandava will be available to advise the Chairman, the Airtel Africa Board and the Managing Director and Chief Executive Officer for a 9-month period.\nHaving been at Bharti Airtel for 13 years and at Airtel Africa for 5 years as Chief Executive Officer, I feel now is the right time to take a sabbatical.\nThis is an exciting opportunity to position Airtel Africa for further success in a dynamic continent full of potential.",
          "link": "https://hallmarknews.com/airtel-africa-appoints-olusegun-ogunsanya-new-ceo/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "ceo",
            "officer",
            "appoints",
            "chief",
            "managing",
            "airtel",
            "business",
            "nigeria",
            "director",
            "segun",
            "ogunsanya",
            "olusegun",
            "africa",
            "executive"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": []
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "NANTA flags off Housing scheme for members — Daily Times Nigeria",
          "summary": "By Ebere ChibuzorNational Association of Nigeria Travel Agencies, NANTA, has flagged off its first pilot Housing scheme of 500 units, comprising of two and three bedroom terrace and three bedroom detached categories for its members.\nThe first instance of this strategic and futuristic welfare scheme under NANTA cooperative society, nursed to fruition by the Abuja zone of the association, will be powered by Brains and Hammers, a reputable estate development firm, currently handling the massive five thousand Housing scheme at Kubwa City Estate.\nThere is an open window for mortgage housing loan from Federal Mortgage Bank for those who may wish to draw on the loan options to speed up development of their choice property.\nREAD ALSO: Father Mbaka: May God bless Nnamdi Kanu wherever he isMrs Susan Akporiaye, President, NANTA, disclosed that the initiative is the brainchild of the Abuja Zonal Vice President, Mr. kayode Adeshola, adding that the national body will escalate the narrative to all NANTA members across the country.\n” We shall deploy our years of experience to handle the NANTA housing scheme and we are also open to individuals who maybe interested in any of our property.”",
          "link": "https://dailytimes.ng/nanta-flags-off-housing-scheme-for-members/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "times",
            "scheme",
            "reputable",
            "flags",
            "president",
            "estate",
            "travel",
            "daily",
            "housing",
            "members",
            "development",
            "nigeria",
            "nanta",
            "mortgage"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "US: Nigeria facing extraordinary security challenges",
          "summary": "United States Secretary of State, Antony Blinken, has described the security challenges facing Nigeria as extraordinary.\nBlinken, who was responding to a question on how the US could assist Nigeria to tackle the security challenges posed by Boko Haram, bandits, and IPOB.\nHe said, “It is fair to say that the challenges that Nigeria faces when it comes to security are quite extraordinary – and you referenced them – whether it’s terrorism, whether it’s banditry and criminality, whether it’s piracy.\nIt’s not – the security piece is vitally important, but it’s insufficient, and so economic development, progress, opportunity is hugely important.”Blinken also advised countries battling security challenges to deal with the root causes of insecurity in their region.\nHe said, “So, too, are dealing with some of the other drivers that sometimes produce conflict, violence, and extremism.",
          "link": "https://daylightng.com/us-nigeria-facing-extraordinary-security-challenges/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "facing",
            "challenges",
            "turn",
            "think",
            "president",
            "security",
            "extraordinary",
            "produce",
            "address",
            "nigeria",
            "violence",
            "conflict"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "npa",
            "system",
            "callup",
            "apapa",
            "truck",
            "drivers",
            "road",
            "amidst",
            "trucks",
            "worsening",
            "electronic",
            "roads",
            "ecall",
            "gridlock"
          ]
        },
        {
          "title": "3 Ways Sub-Saharan Africa Can Foster Growth In Her Regions",
          "summary": "Aggregation of DataData equals knowledge which is why countries in sub-Sahara Africa need to take aggregation of data very seriously.\nWith accurate data, sub-Sahara Africa can understand prevalent issues, how to tackle them and compare their progress with other countries of the world.\nPeople InclusivenessIf sub-Saharan Africa wants to solve her problems, she needs to include her people in the process (they know where the shoe pinches).\nGrowth and development is attainable at a rapid pace in sub-Sahara Africa.\nWe might not be advancing at the speed required to achieve the 2030 SGDs but sub-Saharan Africa will not be left behind, let’s take action now!",
          "link": "https://bizwatchnigeria.ng/3-ways-sub-saharan-africa-can-foster-growth-in-her-regions/",
          "published": "04/27/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "subsaharan",
            "subsahara",
            "world",
            "regions",
            "growth",
            "data",
            "achieve",
            "development",
            "problems",
            "ways",
            "countries",
            "africa",
            "need",
            "foster"
          ]
        }
      ]
    }
  }
}