{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "FG says Lekki deep seaport will change Maritime economy",
          "summary": "Kindly Share This Story:The Federal government says the Lekki Deep Seaport will be a significant game-changer in Nigeria’s Maritime economy with corresponding benefits to the West and Central sub-regions of Africa.\nThe Federal government says the Lekki Deep Seaport will be a significant game-changer in Nigeria’s Maritime economy with corresponding benefits to the West and Central sub-regions of Africa.\nAjani made this known when she led a Ministerial Team on a quartely inspection of progress of work on the Lekki Deep Sea Port in Lagos.\nThe inspection comprised of an audio-visual briefing by the management of Lekki Port Enterprises, the contractors (China Harbour Engineering Co. Ltd) and the Project Managers (Louis Berger Intl.)\nOthers include the Managing Director, Nigerian Ports Authority, Hadiza Bala- Usman, Director General, Nigerian Maritime Administration and Safety Agency, Bashir Jamoh and other technical officers from the Ministry and the Agencies.",
          "link": "https://www.vanguardngr.com/2021/05/fg-says-lekki-deep-seaport-will-change-maritime-economy/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "economy",
            "ministry",
            "director",
            "change",
            "nigerian",
            "fg",
            "seaport",
            "deep",
            "port",
            "maritime",
            "inspection",
            "west",
            "secretary",
            "lekki"
          ]
        },
        {
          "title": "Yinka Odumakin and the unfinished work of nation-building",
          "summary": "During nearly 30 years, Yinka was perhaps one of the most familiar faces on television, talking his voice hoax, on his interpretation of idyllic Nigeria.\nAcknowledging him as an “encyclopedia of positive activism” she confessed never knowing Yinka as just a husband, but as “Comrade” till death.\nBut along the way, at every twist and turn, we will remember and ever harvest the seeds which Yinka has planted.\nHopefully, our efforts at building a secured and peaceful Nigeria for all will always remember Yinka in the chronicles, indeed pantheon of our heroes past.\nComrade Odumakin was laid in his final resting place in his ancestral home, Moro on Friday, 23rd April 2021.",
          "link": "https://www.vanguardngr.com/2021/05/yinka-odumakin-and-the-unfinished-work-of-nation-building/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "chief",
            "soon",
            "nationbuilding",
            "wife",
            "country",
            "yinka",
            "work",
            "unfinished",
            "national",
            "odumakin",
            "forum",
            "nigeria",
            "political",
            "various"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "We are under pressure to resume strike",
          "summary": "The Senior Staff Association of Nigeria Universities (SSANU) has claimed it was under pressure to resume its suspended strike after the Federal Government failed to fulfil its promises at expiration of the April 30 deadline.\nSSANU claimed the government had yet to commence payment of the consequential adjustments for the new national minimum wage and the allowances encapsulated in the earned allowance.\nThe union’s President, Mohammed Ibrahim revealed this in an interview with journalists in Abuja over the weekend.\nAccording to Ibrahim, SSANU members are agitated over the delay in implementing the agreement, stressing that the union officials were under pressure to “return to the trench.”“As you are aware, our demands are not new demands.\n“We saw reasons to suspend (our strike) because we felt government was sincere and the timelines given – not us was that by end of April, most of these issues will be sorted.",
          "link": "https://dailypost.ng/2021/05/03/we-are-under-pressure-to-resume-strike-university-workers/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "members",
            "lot",
            "resume",
            "pressure",
            "ibrahim",
            "claimed",
            "demands",
            "strike",
            "things",
            "issues",
            "ssanu"
          ]
        },
        {
          "title": "LGs must source alternative funding",
          "summary": "Nigeria’s minister of foreign affairs, Mr. Geoffrey Onyeama has urged the local government areas to initiate alternative sources of funding in the face of dwindling federal allocation.\nOnyeama spoke, weekend, during the maiden Economic Summit organised by Udi Local Government Council.\nHe said that the Federal Government had provided the enabling environment for local entrepreneurs, including farmers to thrive.\n“So, we must create an enabling environment for our youths.\nThe local government can collaborate with the state government to create the needed enabling environment for our youths,” he further stated.",
          "link": "https://dailypost.ng/2021/05/03/lgs-must-source-alternative-funding-buharis-minister-onyeama/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "area",
            "natural",
            "funding",
            "economic",
            "councils",
            "resources",
            "minister",
            "local",
            "summit",
            "source",
            "environment",
            "enabling",
            "lgs",
            "alternative"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Lawmaker urges youths to shun divisive acts",
          "summary": "A member of Nasarawa State House of Assembly, Danladi Jatau, has urged youths to shun divisive acts for development to thrive.\nJatau, who is the Chairman, House Committee on Public Complaints, Petitions and Security, said shunning divisive tendencies by youths would go a long way in ensuring speedy development in the country.\nHe commended the youths for organising the event in order to foster unity and peaceful co-existence among themselves and called for its sustenance.\nADVERTISEMENT“I urge you to continue to partnering with other youths, embrace peace as well as partner with government for development to thrive,” he said.\nThe lawmaker reassured of sound and quality representation at the state legislature in order to bring the much needed dividends of democracy to his constituents.",
          "link": "https://thenationonlineng.net/lawmaker-urges-youths-to-shun-divisive-acts/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "acts",
            "house",
            "youth",
            "youths",
            "state",
            "urges",
            "divisive",
            "kokona",
            "order",
            "governor",
            "member",
            "lawmaker",
            "development",
            "shun"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Bandit, kidnappers now have monopoly of violence, Alaafin, Ooni tell FG",
          "summary": "By Lukman OlabiyiAlaafin of Oyo, Oba Lamidi Adeyemi, has flayed the Federal Government for allowing bandits and kidnappers have monopoly of violence.\nOba Adeyemi, who disclosed this in Lagos over the weekend during the 51st birthday celebration of Aare onakakanfo of Yoruba Land, Iba Gani Adams, said monopoly of violence which ought to be the prorogative of government has been assumed by bandits and kidnappers.\n“The monopoly of violence must be concentrated in government but regrettably we are not having that now.\n“Aare Gani Adams’ appointment is divine and based on merit.\nHe extolled the virtues of the Aare Onakakanfo, saying the traditional institution would always support him in ensuring that the South West is safe.",
          "link": "https://www.sunnewsonline.com/bandit-kidnappers-now-have-monopoly-of-violence-alaafin-ooni-tell-fg/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "adams",
            "violence",
            "kidnappers",
            "bandit",
            "alaafin",
            "safe",
            "oba",
            "yoruba",
            "onakakanfo",
            "gani",
            "tell",
            "fg",
            "monopoly",
            "west",
            "south",
            "ooni"
          ]
        },
        {
          "title": "Fidelity Bank targets Tier-1 bank status by 2025",
          "summary": "By Chinwendu ObienyiFidelity Bank Plc has revealed plans to attain the Tier-1 bank status in Nigeria and achieve 7.5 per cent of total market share of deposits by 2025.\nThis translates to a dividend yield of 9.2 per cent, making it the fourth most rewarding bank to investors in the Nigerian Capital Market (NCM).\nAddressing shareholders at the bank’s 33rd Annual General Meeting (AGM) in Lagos on Friday, the Chief Executive Officer, Fidelity Bank Plc, Nneka Onyeali-Ikpe, announced her management plans to make the bank one of Nigeria’s Tier 1 banks by 2025.\nOnyeali-Ikpe noted that Fidelity Bank’s local currency deposits grew by 49.6 per cent to N1,400.8 billion and constituted 82.5 percent of total customer deposits while foreign currency deposits grew by 3.3 percent to N298.2 billion accounting for 17.5 percent of total deposits.\nEarlier in his opening remark, the Chairman, Board of Directors, Fidelity Bank Plc, Mustapha Chike-Obi, reassured shareholders at the AGM that the bank would maintain the high corporate governance standard and also ensure the bank continued in its growth trajectory in the years ahead.",
          "link": "https://www.sunnewsonline.com/fidelity-bank-targets-tier-1-bank-status-by-2025/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "targets",
            "share",
            "plc",
            "continue",
            "tier1",
            "management",
            "bank",
            "2025",
            "status",
            "deposits",
            "fidelity",
            "banks",
            "shareholders",
            "market",
            "total"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "With Dwindling Allocations, States Eye IGR Drive, Initiate Cost-cutting Measures",
          "summary": "The Ekiti State government said it had set up a committee to advise it on measures to adopt to survive the dwindling FACC allocations.\nAkwa Ibom and Gombe States are looking at measures to reduce wage bills by using biometrics to eliminate ghost workers.\nAkin Omole, told THISDAY that all the states of the federation would be affected by the inability of the NNPC to remit revenues to the FAAC.\nThe dwindling revenue, it added, has made it difficult for the state to pay its over N1.5 billion monthly wage bill.\nIn Nasarawa State, the state government said it had streamlined all IGR into Treasury Single Account (TSA) to cope with the dwindling allocations.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/with-dwindling-allocations-states-eye-igr-drive-initiate-cost-cutting-measures/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "dwindling",
            "mr",
            "thisday",
            "tax",
            "told",
            "states",
            "costcutting",
            "wage",
            "governor",
            "eye",
            "allocations",
            "revenue",
            "workers",
            "measures",
            "state",
            "drive",
            "initiate",
            "billion",
            "igr"
          ]
        },
        {
          "title": "Rising Oil Price Puts More Pressure on NNPC’s Finances",
          "summary": "India, one of Nigeria’s crude oil buyers, has recently been hit hard by a second wave that has pummelled fuel consumption and stretched the health-care system beyond its limits.\n“The production cost pricing model allows the government to manage the national petrol market in the interest of sustainable economic development.\n“The production cost-pricing method assumes that the petrol prices are based on the cost of domestic crude oil production and refining in the domestic market.\nThis method implies that crude oil is produced and refined in the country.\nAnd in Saudi Arabia, expensive refining cost accounts for 43 per cent of the petrol price,” it stated.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/03/rising-oil-price-puts-more-pressure-on-nnpcs-finances/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "price",
            "nnpcs",
            "pressure",
            "electricity",
            "petrol",
            "labour",
            "puts",
            "oil",
            "market",
            "finances",
            "nigeria",
            "crude",
            "rising",
            "production",
            "cost"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
          "summary": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19.",
          "link": "http://saharareporters.com/2020/05/13/covid-19-vaccine-cbn-fund-nigerian-researchers-science-institutions-0",
          "published": "05/13/2020",
          "scraped_date": "05/03/2021",
          "keywords": [
            "fund",
            "cbn",
            "researchers",
            "covid19",
            "institutions",
            "develop",
            "state",
            "requires",
            "lives",
            "science",
            "nigerian",
            "long",
            "nigeria",
            "support",
            "spread",
            "vaccine"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Alexx Ekubo announces engagement to Fancy Acholonu",
          "summary": "Alexx Ekubo, Nigerian actor and model, has announced his engagement to Fancy Acholonu, his longtime girlfriend.\nAdvertisementThe lovebirds took to their individual social media pages to break the news on Monday.\nThe entrepreneur has inspired several business outfits including ‘The Fancy Kidz’, an establishment which puts together modelling and acting classes for kids.\nEkubo has also established himself in the Nigerian movie landscape since he made his film debut in ‘Sinners in the House’, a 2005 movie by Lancelot Oduwa Imasuen.\n“Learn to live & let live, if a person wants to be gay, let them gay in peace, personally I’m not, have never been, & will never be, lets allow pple to be free & comfortable with their sexual preference, stop the name calling & shaming,” he had said.",
          "link": "https://lifestyle.thecable.ng/alexx-ekubo-announces-engagement-to-fancy-acholonu/#new_tab",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "announces",
            "ekubo",
            "live",
            "life",
            "let",
            "movie",
            "gay",
            "sexual",
            "model",
            "nigerian",
            "love",
            "acholonu",
            "alexx",
            "free",
            "engagement",
            "fancy"
          ]
        },
        {
          "title": "Akin Fadeyi Foundation announces new appointments",
          "summary": "Akin Fadeyi Foundation (AFF), a non-profit organisation, has appointed Oluwatomi Okeowo and Sinmi Akinsanmi as program manager, and vice-president, strategy and growth respectively.\nAdvertisementAFF, conveners of the Corruption Not In My Country Project and the FlagIt Report Corruption App, said the new appointments would sustain growth and aid the organisation’s anti-corruption fight.\nin international relations from Covenant University, Nigeria; an M.A in international development: Development Management from the University of Manchester, United Kingdom and an M.Phil.\nHe has built expertise around project management, product management, operations management, strategy, and business development.\nAdvertisement“We are particularly excited to have Akinsanmi in the team as he has committed to offering his services in social responsibility capacity.",
          "link": "https://www.thecable.ng/akin-fadeyi-foundation-announces-new-appointments",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "announces",
            "university",
            "growth",
            "foundation",
            "team",
            "strategic",
            "appointments",
            "okeowo",
            "management",
            "project",
            "akin",
            "international",
            "fadeyi",
            "strategy",
            "development"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "sacking",
            "tradition",
            "cbn",
            "otudeko",
            "governor",
            "took",
            "bank",
            "bruised",
            "emefiele",
            "board",
            "sanusi",
            "banks",
            "enforces",
            "skye"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "aggressive",
            "startups",
            "country",
            "value",
            "business",
            "companies",
            "fintech",
            "partnerships",
            "expand",
            "nigeria",
            "company",
            "expansion",
            "size",
            "market"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "EdoJobs, Azura Power train youths on solar power installation, cassava cultivation, others – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government Skills Development Agency, EdoJobs in collaboration with Azura Power has trained twenty-one youths in Edo State on solar installation, natural skincare, hair styling, cassava cultivation and ruminant rearing.\nThe Managing Director, EdoJobs, Mrs. Ukinebo Dare, said the beneficiaries participated in a two-month intensive skill acquisition programme, noting that on completion of the training, the beneficiaries were given startup kits to assist them set up their own business.\nDare added that the partnership with Azura-Edo also benefits the company’s host community who will be provided with the training programmes to improve their livelihood.\nAccording to her, the beneficiaries are taken through intensive training on various areas of specialization.\nShe urged the participants to make good use of the startup kits and put to practice what they have learnt to scale their businesses.",
          "link": "http://nigerianobservernews.com/2021/05/edojobs-azura-power-train-youths-on-solar-power-installation-cassava-cultivation-others/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "observer",
            "training",
            "power",
            "youths",
            "edojobs",
            "cassava",
            "state",
            "beneficiaries",
            "kits",
            "nigerian",
            "intensive",
            "edo",
            "cultivation",
            "ventures",
            "train",
            "startup",
            "installation",
            "solar"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "register",
            "immediate",
            "movement",
            "cattle",
            "nightgrazing",
            "jan",
            "prohibited",
            "underaged",
            "highways",
            "web",
            "outlawed",
            "19",
            "wish"
          ]
        },
        {
          "title": "Change at First Bank signals new dawn",
          "summary": "The appointment was disclosed in a statement made by the (now) sacked chairman of the bank, Mrs. Ibukun Awosika.\nHowever, the CBN in a query to First Bank expressed concern that the appointment of Shobo was done without the approval of the apex bank.\nWith these kinds of numbers, no director of the bank has any moral grounds to pontificate.”Meanwhile, First Bank has, in a corporate statement on the new board constitution released on Friday, confirmed that all the changes made by the apex bank have been effected“Dr.\nThese claims notwithstanding, the apex bank’s revelation that FirstBank had been under a regime of forbearance since 2016 and was burdened with problems of recovering insider-related loans was instructive.\nHowever, the CBN has expressed confidence in the Adeduntan’s leadership which gives hope to shareholders of the legacy bank.",
          "link": "https://hallmarknews.com/change-at-first-bank-signals-new-dawn/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "apex",
            "cbn",
            "oba",
            "dawn",
            "director",
            "change",
            "bank",
            "facilities",
            "signals",
            "board",
            "regulatory",
            "nigeria",
            "banks"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Union Expresses Worry Over Increase In Petrol Pump Price, Poverty Rate",
          "summary": "By our Correspondent |The Senior Staff Association of Statutory Corporations and Government Owned Companies (SSASCGOC) has expressed worry over the continuous increase in petrol pump prices, high rates of criminality and poverty in Nigeria.\n“We are particularly worried about the continuous increase in the cost of petroleum products, we are also worried about electricity tariff, and we are very worried about job losses.\nWe are not happy with casualisation of workers I mean workers not getting permanent employment in all sectors of workforce across board, he said.\n“The man who has not seen N2, 000 in three months, if you give him N50, 000 to go and kill people he will do it.\n“We have been saying it that government has to reduce poverty even as the way of fighting insecurity to pave way for youths` engagement positively to make life meaningful to them,” he added.",
          "link": "https://leadership.ng/union-expresses-worry-over-increase-in-petrol-pump-price-poverty-rate/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "pump",
            "price",
            "ssascgoc",
            "poverty",
            "increase",
            "worried",
            "worry",
            "petrol",
            "expresses",
            "youths",
            "reduce",
            "money",
            "way",
            "expectations",
            "yunusa",
            "union",
            "workers",
            "rate"
          ]
        },
        {
          "title": "We Preach Africanism With Our Brand – Ade George",
          "summary": "BY SAMUEL ABULUDE |The love for luxury, originality and a good fashion sense gave rise to leading African leather brand, Corporate Luxury by Ade George, a bespoke leather company that deals in unique briefcases and other leather accessories.\nSpeaking on why he created the company, Ade George disclosed that there was need to always revive the true African cultural element the country has and as such the need to constantly preach Africanism through luxury.\nThe idea is to make customers feel like they are carrying a piece of Africa with every Corporate Luxury product and to encourage them to explore Africa.\nADVERTISEMENTWhen asked on sustainability of the brand knowing that there are other leather brands in Nigeria, George reiterates that Corporate Luxury is not in competition with Nigerian brands.\nAde George equally doubles as the Founder/CEO of Trinitas Foundation and is an Ambassador of the ECOWAS Youth Council.",
          "link": "https://leadership.ng/we-preach-africanism-with-our-brand-ade-george/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "need",
            "brand",
            "corporate",
            "africanism",
            "preach",
            "leather",
            "luxury",
            "terms",
            "ade",
            "african",
            "george",
            "brands",
            "products"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Power firms for sale, consumers to pay higher tariffs from July —",
          "summary": "It listed the five in-service generation plants to be Geregu Generation Company Ltd with gross installed capacity at ISO condition of 506 Megawatts (MW) and Benin (Ihovbor) Generation Company Ltd with 507 MW.\nOthers are Calabar Generation Ltd with 634MW, Omotosho Generation Ltd with 513MW and Olorunsogo Generation Company Ltd with 754MW.\n“Each bidder must be an experienced power generation company that owns and/or operates utility size power plants.\n“In case of a consortium, at least one of the consortium members must be an experienced power generation company (the “Technical Partner”).\nSale Mamman, at the weekend allayed consumers’ fear there will be no significant tariff increase.",
          "link": "https://dailytimes.ng/power-firms-for-sale-consumers-to-pay-higher-tariffs-from-july/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "pay",
            "increase",
            "electricity",
            "power",
            "firms",
            "nerc",
            "consumers",
            "generation",
            "tariff",
            "review",
            "tariffs",
            "proposed",
            "ikedc",
            "higher",
            "company",
            "sale"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "DSS warns: Buhari’s critics planning to disintegrate Nigeria",
          "summary": "The Department of State Services has knocked those calling for the resignation of the President, Major-General Muhammadu Buhari (retd.\nIt described the critics as misguided elements and accused them of threatening the government, sovereignty, and corporate existence of the country.\nEjike Mbaka had called on the National Assembly to impeach the President for incompetency if he failed to resign.\n“It has been established that the main objective for these is to cause a disintegration of the country.\n“Recently, the Service invited and cautioned some persons who deniably recounted their earlier statements or said they were quoted out of context.",
          "link": "https://daylightng.com/dss-warns-buharis-critics-planning-to-disintegrate-nigeria/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "critics",
            "individuals",
            "planning",
            "utterances",
            "statement",
            "buharis",
            "statements",
            "sovereignty",
            "disintegrate",
            "warns",
            "noted",
            "president",
            "nigeria",
            "dss",
            "unsavoury",
            "service",
            "secret"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "ANALYSIS: New Policy Fails To Reverse Gas Flaring, Importation",
          "summary": "May 3, 2021 172To reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent.",
          "link": "https://bizwatchnigeria.ng/analysis-new-policy-fails-to-reverse-gas-flaring-importation/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "policy",
            "country",
            "analysis",
            "importation",
            "flaring",
            "cooking",
            "gas",
            "2020",
            "nigerian",
            "oil",
            "nigeria",
            "fails",
            "petroleum",
            "target",
            "reverse"
          ]
        },
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "site",
            "launches",
            "place",
            "version",
            "mobile",
            "convenient",
            "1xbet",
            "account",
            "website",
            "page",
            "bookmaker",
            "emerges",
            "popular",
            "offers"
          ]
        }
      ]
    }
  }
}