{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Ganduje extends retirement age for teachers, lecturers to 65",
          "summary": "Abdullahi Ganduje of Kano State says, henceforth, teachers and lecturers working with the state-owned institutions of learning will be retiring on attaining 65 years.\nThe governor announced this at the award night marking the 2021 May Day organised by the Kano State Chapter of the Nigerian Labour Congress (NLC) on Saturday in Kano.\n“The Federal Government has since approved this for teachers and lecturers working in its institutions, hence, teachers in Kano State are also not left behind.\n“Therefore, our teachers and lecturers as from now on will start to enjoy such retirement age from 60-65, and years of service from 35-40 as the federal workers are enjoying,” the governor said.\nAccording to Ganduje, the state government has introduced so many policies aimed at improving the welfare of its workers.",
          "link": "https://www.vanguardngr.com/2021/05/ganduje-extends-retirement-age-for-teachers-lecturers-to-65-2/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "economic",
            "state",
            "lecturers",
            "teachers",
            "65",
            "working",
            "nlc",
            "governor",
            "extends",
            "retirement",
            "workers",
            "kano",
            "age",
            "ganduje",
            "introduced",
            "health"
          ]
        },
        {
          "title": "How 9th Senate will achieve restructuring — Senator Folarin",
          "summary": "Kindly Share This Story:Senator Teslim Folarin (APC-Oyo Central) has said that the 9th Senate would achieve restructuring by expunging `Exclusive List’ from the Constitution to allow devolution of powers.\nThe News Agency of Nigeria(NAN) reports that Folarin, a former Senate Leader, is member of the Constitution Amendment Committee at the Red Chamber.\n“There is something in the Constitution that is called Exclusive List, we need to get rid of that.\nOnce we get rid of the exclusive list, we are home and dry.\nFolarin express belief in one united Nigeria, saying there is very beauty in the nation’s diversity.",
          "link": "https://www.vanguardngr.com/2021/05/how-9th-senate-will-achieve-restructuring-senator-folarin/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "saying",
            "develop",
            "senate",
            "exclusive",
            "constitution",
            "senator",
            "9th",
            "nigeria",
            "states",
            "oil",
            "list",
            "folarin",
            "restructuring",
            "achieve"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Biafra, Oduduwa Republics: Nigeria can't break up, I have nowhere to go",
          "summary": "Bola Tinubu, the National Leader of the All Progressives Congress (APC), says he believes that Nigeria will not break up.\nThe former Lagos State governor, who spoke at a special Ramadan prayer on Sunday, warned that Nigeria cannot risk secession and another civil war.\nHe stressed that the country was better as a united entity, adding that Nigeria was yet to recover from the Biafra civil war.\nIf we say Nigeria should separate, people should remember what war caused in Sudan and Iraq.\nWe are yet to recover from the civil war.",
          "link": "https://dailypost.ng/2021/05/02/biafra-oduduwa-republics-nigeria-cant-break-up-i-have-nowhere-to-go-tinubu/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "civil",
            "prayer",
            "oduduwa",
            "republics",
            "cant",
            "nigeria",
            "biafra",
            "recover",
            "tinubu",
            "war",
            "separate",
            "break",
            "leader",
            "secession"
          ]
        },
        {
          "title": "DSS targets 'elements' threatening Nigeria’s peace",
          "summary": "The Department of State Services (DSS) has issued a warning to “elements” threatening Nigeria’s unity and peaceful co-existence.\nPeter Afunanya, DSS spokesman, in a statement on Sunday, said the those trying to throw the country into anarchy will no longer be tolerated.\nDSS said it was working with other security and law enforcement agencies to ensure the maintenance of peace and internal security of the nation.\nAfunanya reaffirmed the service’s unambiguous support to an indivisible, indissoluble and united Nigerian State in accordance with the provisions of the constitution.\nThe proponents are angry about marginalization, insecurity, nepotism, unemployment, resource control by the federal government, among others.",
          "link": "https://dailypost.ng/2021/05/02/breaking-dss-targets-elements-threatening-nigerias-peace/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "unity",
            "state",
            "nigerias",
            "groups",
            "targets",
            "elements",
            "peace",
            "working",
            "threatening",
            "dss",
            "united",
            "warning",
            "security",
            "unemployment",
            "services"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Mazda CX-30: Japanese mastery in craftsmanship",
          "summary": "The Mazda CX-30 demonstrates how Japanese design principles and dedication to improvement connects the driver and CUV.\nWith bold and elegant lines, the essence of Kodo flows through every Mazda CX-30, though the CX-30 2.5 Turbo’s unique additions give this sportier model a distinct character.\nWith the Mazda CX-30, Takumi craftsmanship guides everything from the quality of the materials to the shapes of the controls to the reflection of light on surfaces inside the cabin.\nWhen it comes to the empowering 2021 Mazda CX-30 and new CX-30 2.5 Turbo, the automaker leaves no stone unturned.\nThe Mazda CX-30 embodies Japanese mastery and is an intriguing small premium CUV that will stand the test of time.",
          "link": "https://thenationonlineng.net/mazda-cx-30-japanese-mastery-in-craftsmanship/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "mazda",
            "mastery",
            "premium",
            "japanese",
            "takumi",
            "design",
            "philosophy",
            "cuv",
            "driver",
            "craftsmanship",
            "cx30s",
            "cx30"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Bandit, kidnappers now have monopoly of violence, Alaafin, Ooni tell FG",
          "summary": "By Lukman OlabiyiAlaafin of Oyo, Oba Lamidi Adeyemi, has flayed the Federal Government for allowing bandits and kidnappers have monopoly of violence.\nOba Adeyemi, who disclosed this in Lagos over the weekend during the 51st birthday celebration of Aare onakakanfo of Yoruba Land, Iba Gani Adams, said monopoly of violence which ought to be the prorogative of government has been assumed by bandits and kidnappers.\n“The monopoly of violence must be concentrated in government but regrettably we are not having that now.\n“Aare Gani Adams’ appointment is divine and based on merit.\nHe extolled the virtues of the Aare Onakakanfo, saying the traditional institution would always support him in ensuring that the South West is safe.",
          "link": "https://www.sunnewsonline.com/bandit-kidnappers-now-have-monopoly-of-violence-alaafin-ooni-tell-fg/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "bandit",
            "violence",
            "ooni",
            "gani",
            "kidnappers",
            "alaafin",
            "adams",
            "west",
            "safe",
            "oba",
            "fg",
            "yoruba",
            "onakakanfo",
            "tell",
            "monopoly",
            "south"
          ]
        },
        {
          "title": "Fidelity Bank targets Tier-1 bank status by 2025",
          "summary": "By Chinwendu ObienyiFidelity Bank Plc has revealed plans to attain the Tier-1 bank status in Nigeria and achieve 7.5 per cent of total market share of deposits by 2025.\nThis translates to a dividend yield of 9.2 per cent, making it the fourth most rewarding bank to investors in the Nigerian Capital Market (NCM).\nAddressing shareholders at the bank’s 33rd Annual General Meeting (AGM) in Lagos on Friday, the Chief Executive Officer, Fidelity Bank Plc, Nneka Onyeali-Ikpe, announced her management plans to make the bank one of Nigeria’s Tier 1 banks by 2025.\nOnyeali-Ikpe noted that Fidelity Bank’s local currency deposits grew by 49.6 per cent to N1,400.8 billion and constituted 82.5 percent of total customer deposits while foreign currency deposits grew by 3.3 percent to N298.2 billion accounting for 17.5 percent of total deposits.\nEarlier in his opening remark, the Chairman, Board of Directors, Fidelity Bank Plc, Mustapha Chike-Obi, reassured shareholders at the AGM that the bank would maintain the high corporate governance standard and also ensure the bank continued in its growth trajectory in the years ahead.",
          "link": "https://www.sunnewsonline.com/fidelity-bank-targets-tier-1-bank-status-by-2025/",
          "published": "05/03/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "status",
            "total",
            "management",
            "targets",
            "2025",
            "bank",
            "shareholders",
            "banks",
            "share",
            "fidelity",
            "tier1",
            "continue",
            "deposits",
            "plc",
            "market"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Covid-19: FG to Deny Travellers Entry from India, Brazil and Turkey",
          "summary": "These precautionary measures are a necessary step to minimize the risk of a surge in COVID-19 cases introduced to Nigeria from other countries, while national response activities continue.\nAccording to him, “Any person who has visited Brazil, India or Turkey within fourteen (14) days preceding travel to Nigeria, shall be denied entry into Nigeria.\nThe following condition shall apply to such passengers: Within 24 hours of arrival shall take a COVID-19 PCR test.\n“If positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf Negative, the Passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day 7 of their quarantine.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/covid-19-fg-to-deny-travellers-entry-from-india-brazil-and-turkey/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "passenger",
            "turkey",
            "passengers",
            "cases",
            "deny",
            "fg",
            "travellers",
            "brazil",
            "nigeria",
            "entry",
            "travel",
            "pcr",
            "federal",
            "shall",
            "india",
            "countries",
            "covid19"
          ]
        },
        {
          "title": "Fayemi to Youth: Stop Agonising, Use Your Numerical Strength to Effect Changes",
          "summary": "We are not there yet but that does not mean we will give up.”Addressing the security situation in the country, the Chairman, of Nigeria Governors Forum (NGF) stressed that everyone was living in fear over the security situation.\nWe need a security system that is localised, knowledgeable about the culture and security situation of a particular community.\n“The mutating security situation in our country requires a concerted effort.\n“Today, the greatest challenges facing the country are the youth explosion and the corresponding unemployment challenge.\nWe should rather teach pluralism and how to remain faithful in the midst of other competing belief systems.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/fayemi-to-youth-stop-agonising-use-your-numerical-strength-to-effect-changes/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "agonising",
            "youth",
            "stop",
            "fayemi",
            "effect",
            "changes",
            "situation",
            "strength",
            "nigeria",
            "insecurity",
            "religious",
            "need",
            "national",
            "country",
            "numerical",
            "security",
            "system"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Ballot Boxes, Others Destroyed As Hoodlums Burn Down National Electoral Commission Office In Akwa Ibom",
          "summary": "The Independent National Electoral Commission (INEC) has announced that one of its offices in Akwa Ibom State has been set ablaze by unknown persons.\nThis was announced by Festus Okoye, INEC's National Commissioner and Chairman, Information and Voter Education Committee on Sunday in a statement titled 'INEC Local Government Are Office In Akwa Ibom State Set Ablaze'.\nIt read, The Resident Electoral Commissioner for Akwa Ibom State, Mike Igini, has reported that our office in Essien Udim Local Government Area has been set ablaze.\nItems destroyed include 345 ballot boxes, 135 voting cubicles, mega phones, water tanks and office furniture.\n\"Nevertheless the commission wishes to assure Nigerians that we will leave no stone unturned to recover from the incident in Akwa Ibom State as we continue to prepare for the electoral activities.\"",
          "link": "http://saharareporters.com/2021/05/02/breaking-ballot-boxes-others-destroyed-hoodlums-burn-down-national-electoral-commission",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "boxes",
            "state",
            "office",
            "voting",
            "destroyed",
            "ibom",
            "commission",
            "akwa",
            "local",
            "burn",
            "hoodlums",
            "electoral",
            "udim",
            "set",
            "national",
            "incident",
            "breaking"
          ]
        },
        {
          "title": "BREAKING: Ballot Boxes, Others Destroyed As Hoodlums Burn Down National Electoral Commission Office In Akwa Ibom",
          "summary": "The Independent National Electoral Commission (INEC) has announced that one of its offices in Akwa Ibom State has been set ablaze by unknown persons.\nThis was announced by Festus Okoye, INEC's National Commissioner and Chairman, Information and Voter Education Committee on Sunday in a statement titled 'INEC Local Government Are Office In Akwa Ibom State Set Ablaze'.\nIt read, The Resident Electoral Commissioner for Akwa Ibom State, Mike Igini, has reported that our office in Essien Udim Local Government Area has been set ablaze.\nItems destroyed include 345 ballot boxes, 135 voting cubicles, mega phones, water tanks and office furniture.\n\"Nevertheless the commission wishes to assure Nigerians that we will leave no stone unturned to recover from the incident in Akwa Ibom State as we continue to prepare for the electoral activities.\"",
          "link": "http://saharareporters.com/2021/05/02/breaking-ballot-boxes-others-destroyed-hoodlums-burn-down-national-electoral-commission#disqus_thread",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "boxes",
            "state",
            "office",
            "voting",
            "destroyed",
            "ibom",
            "commission",
            "akwa",
            "local",
            "burn",
            "hoodlums",
            "electoral",
            "udim",
            "set",
            "national",
            "incident",
            "breaking"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "LISTEN: Eedris Abdulkareem hits Keyamo in another diss song",
          "summary": "Eedris Abdulkareem has come through with a follow-up diss song for Festus Keyamo, minister of state for labour and employment.\nAdvertisementThe less than three-minute diss track was released on the back of the minister’s recent Twitter tirade over the singer’s ‘Jaga Jaga Reloaded’.\nOn Sunday, the diss song which dwells on Keyamo surfaced online, with the musician further taking a hit at the minister.\nAdvertisementEdris Abdulkareem has gone to the studio for Festus Keyamo pic.twitter.com/F71W44Youv — Maybeks (@MayUbeku) May 2, 2021In the song, Abdulkareem made a number of allegations including one about his assailant using Stephanie Otobo, a Canada-based singer, to blackmail Apostle Suleman, the clergyman who battled a relationship scandal years ago.\nThat’s why I recorded ‘Obasanjo Write Buhari Letter’ to help you in that process,” he sang.",
          "link": "https://lifestyle.thecable.ng/listen-eedris-abdulkareem-hits-keyamo-in-another-diss-song/#new_tab",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "musician",
            "abdulkareem",
            "eedris",
            "twitter",
            "diss",
            "minister",
            "buhari",
            "listen",
            "hits",
            "song",
            "track",
            "keyamo",
            "thought"
          ]
        },
        {
          "title": "Be alive to the responsibility of safeguarding lives, JNI tells FG",
          "summary": "The Jama’atu Nasril Islam (JNI), the umbrella muslim body in Nigeria, has asked the federal government to be alive to safeguarding lives and properties.\nAdvertisementThe security challenges across the country have been on the rise in the recent months.\nKhalid Abubakar, the secretary-general of JNI, in a statement on Sunday said the government must live up to its primary responsibility of security.\nAdvertisementHe also appealed to wealthy Muslims to assist the needy who are affected by the present economic hardship in the country.\nGovernment should, however, be more alive to the primary responsibility of its existence – i.e.",
          "link": "https://www.thecable.ng/be-alive-to-the-responsibility-of-safeguarding-lives-jni-tells-fg",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "alive",
            "tells",
            "economic",
            "worship",
            "supplications",
            "needy",
            "uncertainties",
            "safeguarding",
            "challenges",
            "security",
            "fg",
            "nigeria",
            "muslims",
            "jni",
            "lives",
            "responsibility"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "took",
            "enforces",
            "sacking",
            "bank",
            "sanusi",
            "emefiele",
            "governor",
            "banks",
            "otudeko",
            "cbn",
            "skye",
            "bruised",
            "tradition",
            "board"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "fintech",
            "startups",
            "country",
            "expansion",
            "nigeria",
            "expand",
            "value",
            "business",
            "partnerships",
            "company",
            "size",
            "aggressive",
            "companies",
            "market"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "EdoJobs, Azura Power train youths on solar power installation, cassava cultivation, others – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government Skills Development Agency, EdoJobs in collaboration with Azura Power has trained twenty-one youths in Edo State on solar installation, natural skincare, hair styling, cassava cultivation and ruminant rearing.\nThe Managing Director, EdoJobs, Mrs. Ukinebo Dare, said the beneficiaries participated in a two-month intensive skill acquisition programme, noting that on completion of the training, the beneficiaries were given startup kits to assist them set up their own business.\nDare added that the partnership with Azura-Edo also benefits the company’s host community who will be provided with the training programmes to improve their livelihood.\nAccording to her, the beneficiaries are taken through intensive training on various areas of specialization.\nShe urged the participants to make good use of the startup kits and put to practice what they have learnt to scale their businesses.",
          "link": "http://nigerianobservernews.com/2021/05/edojobs-azura-power-train-youths-on-solar-power-installation-cassava-cultivation-others/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "installation",
            "state",
            "beneficiaries",
            "startup",
            "cultivation",
            "observer",
            "edo",
            "kits",
            "train",
            "youths",
            "cassava",
            "power",
            "training",
            "intensive",
            "ventures",
            "edojobs",
            "solar",
            "nigerian"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "register",
            "movement",
            "19",
            "immediate",
            "wish",
            "web",
            "prohibited",
            "nightgrazing",
            "highways",
            "outlawed",
            "jan",
            "underaged",
            "cattle"
          ]
        },
        {
          "title": "DSS warns clerics, politicians against utterances aimed at plunging Nigeria into anarchy",
          "summary": "Ejike Mbaka, called on the National Assembly to impeach President Muhammadu Buhari if he fails to resign over rising insecurity in the country.\nThe DSS in a statement by its spokesman, Peter Afunanya said it won’t allow some individuals to break up the country through their unsavoury statements.\n”It has been established that the main objective for these is to cause a disintegration of the country.\n”The Service has also noted their desperation and penchant to collaborate with external forces and influences against Nigeria.\n”In this regard, self-centred individuals and groups are warned to stop engaging in acts inimical to the peace and sovereignty of this nation.",
          "link": "https://hallmarknews.com/dss-warns-clerics-politicians-against-utterances-aimed-at-plunging-nigeria-into-anarchy/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "utterances",
            "state",
            "groups",
            "nigeria",
            "politicians",
            "unsavoury",
            "subversive",
            "plunging",
            "dss",
            "anarchy",
            "service",
            "throw",
            "tolerate",
            "country",
            "individuals",
            "warns",
            "aimed",
            "clerics"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Xi: Burin Juyin Juya Hali Ya Fi Kome Muhimmanci",
          "summary": "",
          "link": "https://hausa.leadership.ng/xi-burin-juyin-juya-hali-ya-fi-kome-muhimmanci/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "fi",
            "kome",
            "hali",
            "muhimmanci",
            "juya",
            "burin",
            "ya",
            "xi",
            "juyin"
          ]
        },
        {
          "title": "Yadda Jirgin Kasa Ya Yi Hadari A Kaduna",
          "summary": "",
          "link": "https://hausa.leadership.ng/yadda-jirgin-kasa-ya-yi-hadari-a-kaduna/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "kaduna",
            "yadda",
            "kasa",
            "ya",
            "yi",
            "hadari",
            "jirgin"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Police intercept 753 GPMG ammunition in Abakaliki — Daily Times Nigeria",
          "summary": "According to Frank Mba, the Force Public Relations Officer (FPRO), who issued a statement on the development, intelligence-driven covert operation led to the interception and recovery of the deadly ammunition.\nHe said comprehensive investigations aimed at bringing to book all persons linked to the crime are ongoing.\nHe said: “Police operatives led by the Commissioner of Police, Ebonyi State Command, on April 29, stormed the criminal hideout of suspects indicted in the investigations, located at Oriuzo village in Ezza North Local Government Area of Ebonyi State.\n“Two Ak47 riffles, five pump action guns, six pistols, 50 Ak47 ammunition, 126, cartridges, Jack knives, cutlasses, and a 40-page notebook containing inventories of ammunition purchased by the gang were recovered.\nABJ 163 NV used for the foiled bank robbery was also recovered by the Police Team.",
          "link": "https://dailytimes.ng/police-intercept-753-gpmg-ammunition-in-abakaliki/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "suspects",
            "times",
            "gpmg",
            "abakaliki",
            "state",
            "intercept",
            "753",
            "led",
            "gang",
            "force",
            "bank",
            "robbery",
            "nigeria",
            "daily",
            "ebonyi",
            "command",
            "ammunition"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "DSS warns: Buhari’s critics planning to disintegrate Nigeria",
          "summary": "The Department of State Services has knocked those calling for the resignation of the President, Major-General Muhammadu Buhari (retd.\nIt described the critics as misguided elements and accused them of threatening the government, sovereignty, and corporate existence of the country.\nEjike Mbaka had called on the National Assembly to impeach the President for incompetency if he failed to resign.\n“It has been established that the main objective for these is to cause a disintegration of the country.\n“Recently, the Service invited and cautioned some persons who deniably recounted their earlier statements or said they were quoted out of context.",
          "link": "https://daylightng.com/dss-warns-buharis-critics-planning-to-disintegrate-nigeria/",
          "published": "05/02/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "utterances",
            "statements",
            "secret",
            "sovereignty",
            "president",
            "nigeria",
            "unsavoury",
            "dss",
            "service",
            "disintegrate",
            "critics",
            "planning",
            "buharis",
            "individuals",
            "warns",
            "statement",
            "noted"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "version",
            "1xbet",
            "launches",
            "convenient",
            "account",
            "offers",
            "website",
            "emerges",
            "bookmaker",
            "place",
            "popular",
            "mobile",
            "site",
            "page"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/03/2021",
          "keywords": [
            "apapa",
            "amidst",
            "electronic",
            "drivers",
            "worsening",
            "npa",
            "gridlock",
            "ecall",
            "truck",
            "trucks",
            "callup",
            "roads",
            "system",
            "road"
          ]
        }
      ]
    }
  }
}