{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Abia: Police to investigate murder of widow as gateman flees",
          "summary": "Kindly Share This Story:By Steve OkoThe Abia State Police Command has declared manhunt for a fleeing gateman in Umuahia after the lifeless body of a widow was discovered in the pool of her blood.\nReports say the fleeing gateman was newly engaged by the victim from her Mbaise maternal community.\nAccording to reports, the older security man was said to have left the woman in hands of the fleeing gateman before going to church on Sunday.\nAccording to the older gateman (names withheld), he returned from church service and knocked on the gate severally, but there was no response.\nDisturbed by the situation, the older security guard alerted neigbours who broke into the compound via the back door and discovered the widow in the pool of her blood.",
          "link": "https://www.vanguardngr.com/2021/04/abia-police-to-investigate-murder-of-widow-as-gateman-flees/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "umuahia",
            "share",
            "flees",
            "murder",
            "church",
            "alozie",
            "victim",
            "security",
            "widow",
            "older",
            "abia",
            "fleeing",
            "investigate",
            "gateman"
          ]
        },
        {
          "title": "Housewives in Makurdi lament high cost of food items, consumables",
          "summary": "Kindly Share This Story:Residents, particularly housewives in Makurdi, the Benue state capital, have lamented the increase in prices of food items.\nA survey conducted by News Agency of Nigeria (NAN) on Tuesday in Makurdi showed that prices of food items have been increasing on a daily basis.\nMany housewives interviewed by NAN said that feeding their families has now become very difficult as the prices of essential food items have multiplied in the past few months.\n“I always shout at the traders over the constant increase in prices of food items, but when you think of it, it is not their fault but the manufacturers.\nOther housewives; Mrs Achetu Ochefu, Mrs T. Olobatoke and Mrs Nkiru Chuka who spoke to NAN blamed the ‘everyday’ increase in prices of food items and other products on the manufacturers.",
          "link": "https://www.vanguardngr.com/2021/04/housewives-in-makurdi-lament-high-cost-of-food-items-consumables/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "housewives",
            "lament",
            "traders",
            "consumables",
            "mrs",
            "high",
            "cost",
            "food",
            "increase",
            "makurdi",
            "lamented",
            "prices",
            "items",
            "bought",
            "week",
            "nan"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Ajimobi's wife Florence",
          "summary": "Florence Ajimobi, wife of late Oyo State Governor Abiola Ajimobi, has declared that life is short.\nFlorence spoke to leaders of Nigeria Union of Journalists (NUJ), Oyo State Council, on Iftar (Breaking of fast) at her Oluyole residence in Ibadan.\nAjimobi’s wife promised she would do anything to immortalise her husband and uphold his legacy.\nOyo State NUJ Chairman, Alhaji Ademola Babalola, thanked her for the love and honour extended to the union.\nBabalola commended Florence for being and urged her to uphold the legacy.",
          "link": "https://dailypost.ng/2021/04/27/life-is-short-ajimobis-wife-florence/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "oyo",
            "state",
            "husband",
            "love",
            "uphold",
            "wife",
            "ajimobis",
            "nuj",
            "journalists",
            "florence",
            "life"
          ]
        },
        {
          "title": "BREAKING: Gunmen attack bank, kill police officer, cart away cash in Ebonyi",
          "summary": "Unknown gunmen on Tuesday killed a police officer whose name is yet to be identified at the time of filing this report at Onueke market in Ezza South Local Government Area of Ebonyi State.\nAn eyewitness, who spoke to journalists on the condition of anonymity, said the unknown gunmen equally set ablaze a car after robbing one of the popular commercial banks located at Onueke market.\nDAILY POST gathered that, no fewer than three civilians were reportedly shot and dispossessed of their valuables by the rampaging gunmen who stormed the busy Onueke town.\nThereafter, they trailed another person to a new generation bank at Onueke and shot him.\nEfforts to reach the Ebonyi State Police command to speak on the matter, as of the time of filing this report failed.",
          "link": "https://dailypost.ng/2021/04/27/breaking-gunmen-attack-bank-kill-police-officer-cart-away-cash-in-ebonyi/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "bank",
            "state",
            "robbers",
            "report",
            "ebonyi",
            "kill",
            "town",
            "officer",
            "cart",
            "onueke",
            "cash",
            "unknown",
            "shot",
            "gunmen",
            "attack",
            "filing",
            "away",
            "breaking"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Global shortage of vaccines will alter vaccination phases, says Fed Govt",
          "summary": "By Moses Emorinken, AbujaGlobal scarcity and delay in vaccine supply to Nigeria may alter remaining phases of vaccination, the Federal Government stated yesterday.\nIn the government’s vaccination campaign strategy, there are four phases, of which the country is still in the first phase of the COVID-19 vaccination, which involves frontline health workers, other frontline workers and strategic leaders.\nADVERTISEMENTFurthermore, it said Nigeria is set to take delivery of 29.8 million doses of Johnson and Johnson COVID-19 vaccines from the African Union, even as it expects additional vaccines from COVAX in June.\n“Notwithstanding the above successes, we are aware of the global scarcity of COVID-19 vaccines due to high demand, especially in countries where the vaccines are being produced.\n“Furthermore, the Federal Government has signed off to receive up to 29.8 million doses of the Johnson & Johnson COVID-19 vaccine through the African Union (AU).",
          "link": "https://thenationonlineng.net/global-shortage-of-vaccines-will-alter-vaccination-phases-says-fed-govt/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "phases",
            "covid19",
            "second",
            "cent",
            "vaccine",
            "dose",
            "fed",
            "vaccination",
            "doses",
            "johnson",
            "astrazeneca",
            "alter",
            "global",
            "vaccines",
            "govt",
            "shortage"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity",
          "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later",
          "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "countrythe",
            "speaker",
            "state",
            "rising",
            "session",
            "summon",
            "reps",
            "chiefs",
            "urged",
            "security",
            "summoned",
            "insecurity",
            "house",
            "service",
            "nsa",
            "breaking",
            "services"
          ]
        },
        {
          "title": "BREAKING: Federal high court Abakaliki on fire",
          "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.",
          "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "located",
            "went",
            "tuesdaythe",
            "state",
            "highway",
            "gutted",
            "abakaliki",
            "hours",
            "high",
            "court",
            "federal",
            "breaking",
            "later",
            "reportdetails"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Insecurity: Seek Help, Saraki Tells Buhari",
          "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "seek",
            "state",
            "need",
            "issue",
            "finding",
            "tells",
            "saraki",
            "national",
            "security",
            "statement",
            "insecurity",
            "solutions",
            "buhari",
            "president",
            "help"
          ]
        },
        {
          "title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges",
          "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.",
          "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "president",
            "nigeria",
            "challenges",
            "meeting",
            "climate",
            "paris",
            "security",
            "tackle",
            "countries",
            "seeks",
            "africa",
            "buhari",
            "states",
            "blinken",
            "united",
            "help"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course",
          "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.",
          "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "university",
            "governor",
            "resources",
            "building",
            "management",
            "school",
            "course",
            "honorary",
            "st",
            "peace",
            "thomasabecket",
            "flaunts",
            "nonexistent",
            "nondegeee",
            "uk",
            "kogi",
            "human",
            "professorship"
          ]
        },
        {
          "title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course",
          "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.",
          "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "university",
            "governor",
            "resources",
            "building",
            "management",
            "school",
            "course",
            "honorary",
            "st",
            "peace",
            "thomasabecket",
            "flaunts",
            "nonexistent",
            "nondegeee",
            "uk",
            "kogi",
            "human",
            "professorship"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "‘We’ll take legal action’ — army condemns sharing of dead soldiers’ photos on social media",
          "summary": "The Nigerian army has condemned the “indiscriminate” sharing of graphic photos of soldiers killed or injured in the line of duty.\nAdvertisementMohammed Yerima, army spokesman, in a statement on Tuesday, said such distribution of soldiers’ photos on social media is insensitive and unpatriotic.\nAdvertisement“The Nigerian Army condemns in the strongest term possible, the indiscriminate sharing on social media of graphic pictures of personnel who paid the supreme price in the cause of defending and protecting the country from its adversaries,” Yerima said.\nOne can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”",
          "link": "https://www.thecable.ng/well-take-legal-action-army-condemns-sharing-of-dead-soldiers-photos-on-social-media",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "soldiers",
            "dead",
            "sharing",
            "nigerian",
            "social",
            "unpatriotic",
            "condemns",
            "media",
            "country",
            "personnel",
            "action",
            "pictures",
            "legal",
            "army",
            "graphic",
            "photos"
          ]
        },
        {
          "title": "IPOB interview: Channels TV has apologised for breaching broadcast code, says NBC",
          "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised for allegedly breaching the country’s broadcast code.\nWhile clarifying the directive, Franca Aiyetan, NBC director of public affairs, said the letter the commission sent to the TV station was an “instrument to check its excesses”.\nIt is possible to breach the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying ‘we apologise, we did wrong’.\nBut this letter that went to Channels TV is our way of regulating the broadcasting industry.\nThe NBC now said because of that, this breach attracts a shutdown or a fine of N5 million.",
          "link": "https://www.thecable.ng/ipob-interview-channels-tv-has-apologised-for-breaching-broadcast-code-says-nbc",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "letter",
            "channels",
            "interview",
            "public",
            "ipob",
            "apologised",
            "tv",
            "broadcast",
            "breaching",
            "commission",
            "programme",
            "breach",
            "nbc",
            "code",
            "broadcasting",
            "station"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria",
          "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.",
          "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "medical",
            "bringing",
            "health",
            "nigeria",
            "clafiya",
            "healthcare",
            "inoyo",
            "access",
            "itoro",
            "plan",
            "rural",
            "communities",
            "nwokoye",
            "hospitaltohome",
            "services",
            "jennie"
          ]
        },
        {
          "title": "Can NIBSS save BVN from bank scams and be a fair umpire?",
          "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.",
          "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "fintechs",
            "save",
            "nibss",
            "access",
            "fair",
            "customers",
            "scams",
            "bvn",
            "data",
            "banks",
            "nigerias",
            "number",
            "bank",
            "umpire"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "soldiers",
            "appealing",
            "force",
            "free",
            "student",
            "kidnapped",
            "yusuf",
            "rescue",
            "appeal",
            "dont",
            "come",
            "video",
            "sent",
            "govt",
            "sale",
            "students"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "arrest",
            "car",
            "abraka",
            "suspects",
            "recover",
            "warri",
            "corpses",
            "recovered",
            "phones",
            "delta",
            "siblings",
            "drug",
            "decomposing",
            "suspected",
            "bodies",
            "led",
            "peddlers"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer",
          "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.",
          "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "governor",
            "state",
            "ortom",
            "nigerian",
            "nigeria",
            "lasting",
            "observer",
            "peace",
            "god",
            "security",
            "fairness",
            "equity",
            "insecurity",
            "country",
            "level",
            "justice"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "prohibited",
            "wish",
            "jan",
            "nightgrazing",
            "outlawed",
            "movement",
            "underaged",
            "cattle",
            "19",
            "register",
            "web",
            "highways",
            "immediate"
          ]
        },
        {
          "title": "Insecurity: Wike imposes curfew on Rivers land borders",
          "summary": "OBINNA EZUGWURivers State governor, Nyesom Wike, has imposed a curfew on the state’s land borders starting from tomorrow, Wednesday, as a means of curtailing attacks on security agencies by unknown gunmen.\nAccording to the governor, the curfew is from 8.00 p.m. to 6.00 a.m. and will start from tomorrow 28th April 2021, until further notice.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow 28th April 2021 until further notice.\n“Security agencies have been posted to monitor and enforce strict compliance with the curfew at all our land borders and or entry and exit points with Abia, Akwa-Ibom, Bayelsa and Imo States.\n“We therefore urge everyone to be vigilant and report every useful intelligence or suspicious movements to the security agencies for immediate actions.”",
          "link": "https://hallmarknews.com/insecurity-wike-imposes-curfew-on-rivers-land-borders/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "governor",
            "state",
            "agencies",
            "land",
            "tomorrow",
            "borders",
            "rivers",
            "imposes",
            "security",
            "2021",
            "insecurity",
            "curfew",
            "wike"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Insecurity: We Can’t Surrender Kaduna To Criminals, el-Rufai Declares",
          "summary": "* Defends stance on Chibok girls abduction, ‘no-ransom, no-negotiation’ policy |BY AZA MSUE, Kaduna |Governor Nasir el-Rufai of Kaduna State, on Tuesday, declared that his government will not surrender the state to criminal elements, saying experience has shown that paying ransom or negotiating with criminals only encourage them.\nel-Rufai also noted that mass abduction was like a novelty in 2014 under former President Goodluck Jonathan administration, but the facts have now changed since then, as negotiations and ransom payments have not stopped the criminals.\nIn a statement issued by the special adviser on media and communication to the governor, Muyiwa Adekeye, he gave context to a video clip where Governor el-Rufai was seen advocating for all options to ensure the release of the abducted Chibok girls in 2014.\nThe statement explained that, President Jonathan-led administration denied or doubted that the Chibok girls abduction happened, adding “That was the context under which civic pressures were brought on the government.’’‘’Nigeria’s journey since the 2014 Chibok tragedy has proven that the solution to violent crimes, including terrorism and banditry, is a robust response from the state and its coercive agencies,” he said.\nADVERTISEMENTHe added that paying of ransoms make criminals “to press ahead for a surrender of the public treasury to them.",
          "link": "https://leadership.ng/insecurity-we-cant-surrender-kaduna-to-criminals-el-rufai-declares/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "criminals",
            "governor",
            "state",
            "cant",
            "girls",
            "surrender",
            "elrufai",
            "kaduna",
            "security",
            "insecurity",
            "ransom",
            "declares",
            "paying",
            "chibok",
            "statement"
          ]
        },
        {
          "title": "Insecurity: 109 Senators To Meet Buhari",
          "summary": "He said: “Today, we are talking about them occupying Niger state in the manner that have been given earlier by the mover of the motion.\n“[And] it seems like the federal government is handling this security situation with kid gloves.\nThat is the home base of our leader here (Senate President) and the Inspector General of Police’s home.\nToday, I cannot travel from here to Kaduna or Niger State where I was born.\n“There’s no arm of government that’s not concerned about the security situation of the country, everyone is concerned.",
          "link": "https://leadership.ng/insecurity-109-senators-to-meet-buhari/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "senate",
            "state",
            "president",
            "meet",
            "niger",
            "national",
            "local",
            "senators",
            "security",
            "insecurity",
            "apc",
            "buhari",
            "situation",
            "areas",
            "109"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Photos: Nollywood icon, Ejike Asiegbu visits DAYLIGHT Dome",
          "summary": "You might also like",
          "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/",
          "published": "04/27/2021",
          "scraped_date": "04/27/2021",
          "keywords": [
            "ejike",
            "asiegbu",
            "daylight",
            "nollywood",
            "dome",
            "icon",
            "visits",
            "photos"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}