{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Forex scarcity, repatriation uncertainties depress investments in Q1 — Analysts",
          "summary": "Kindly Share This Story:By Nkiruka NnoromECONOMYInvestment analysts have blamed foreign exchange (forex) scarcity and concerns around the possibility of ease of repatriating funds out of the country as cause of the dwindling Foreign Portfolio Investment (FPI) in the stock market.\nThey stated that investors are wary of investing in climes where forex prices are managed and not market reflective.\nForeign Portfolio Investment (FPI) in the Nigerian Exchange Limited (NGX) had continued a downward streak, according to the data on Domestic and Foreign Portfolio Participation in Equity Trading for March 2021, falling by 40.4 percent to N150.23 billion in the first quarter (Q1) 2021, from N251.87 billion in Q1 2020.\nHe said: “ FPIs are not going to come in knowing that foreign Exchange (FX) prices are managed and not market reflected.\n“There has been too much focus on managing the foreign exchange price and the effect of that action has been affecting other things including the confidence of investors coming to the market.",
          "link": "https://www.vanguardngr.com/2021/05/forex-scarcity-repatriation-uncertainties-depress-investments-in-q1-analysts/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "forex",
            "scarcity",
            "price",
            "analysts",
            "investments",
            "repatriation",
            "market",
            "q1",
            "portfolio",
            "exchange",
            "depress",
            "focus",
            "investors",
            "fx",
            "fpi",
            "uncertainties",
            "foreign"
          ]
        },
        {
          "title": "Niger State Government relocates IDPs",
          "summary": "Kindly Share This Story:After the recent disturbance of some communities in Niger state by bandits and Boko Haram elements, the Niger State Government on Friday, April 30th, 2021, successfully relocated 3500 internally displaced persons to Gwada Model Primary School.\nGovernor Abubakar S. Bello, who detailed relevant Ministries and MDAs through Niger State Emergency Management Agency(NSEMA) to ensure that the IDPs are accommodated and all their needs met until security improves and they are relocated back to their communities.\nTo ensure harmony, the leaders of the Gbagy and Fulani communities were invited to camp by NSEMA and constituted as part of the camp management officials to assist in running camp activities.\nThe food, non-food items and sanitary material that were procured have been made available to camp officials.\nThe Niger State Government has provided security alongside a clinic manned by officials of the state’s Ministry of Health.",
          "link": "https://www.vanguardngr.com/2021/05/niger-state-government-relocates-idps/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "idps",
            "relocates",
            "camp",
            "officials",
            "share",
            "management",
            "niger",
            "communities",
            "relocated",
            "security",
            "primary"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "BREAKING: Bill, Melinda Gates marriage hit the rocks, part ways after 27 years",
          "summary": "Bill and Melinda Gates have announced they are divorcing after 27 years of marriage.\nThe couple, one of the most famous in the world, built a $127billion fortune.\nOn Monday, Gates, 65, announced their decision in a tweet.\nThe Microsoft founder said after a great deal of thought and a lot of work, “we have made the decision to end our marriage”.\nGates said they continue to share a belief in that mission and will continue to work together at the foundation.",
          "link": "https://dailypost.ng/2021/05/03/breaking-bill-melinda-gates-marriage-hit-the-rocks-part-ways-after-27-years/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "melinda",
            "work",
            "breaking",
            "continue",
            "thought",
            "announced",
            "gates",
            "27",
            "marriage",
            "bill",
            "decision",
            "world",
            "tweetthe",
            "rocks",
            "couple",
            "built",
            "hit",
            "ways"
          ]
        },
        {
          "title": "Lagos govt takes step to prevent COVID-19 third wave",
          "summary": "The Lagos State Government has said all its facilities have been placed on high alert, to ensure a third wave of COVID-19 does not happen in the state.\nAccording to Abayomi, it was important to be proactive, after they flattened the curve of the second wave.\nHe warned that a trigger for a third wave was likely to be importation of new COVID-19 strains from inbound travelers.\n“Currently, countries like India, Brazil, Argentina, Iraq, Qatar, Peru and Uruguay are being ravaged by a vicious third or fourth wave following a less active and insignificant second or third wave.\n“Whilst we commiserate with countries like these, it is important that we protect our environment and residents against this virus.",
          "link": "https://dailypost.ng/2021/05/03/lagos-govt-takes-step-to-prevent-covid-19-third-wave/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "prevent",
            "lagos",
            "wave",
            "covid19",
            "countries",
            "govt",
            "strains",
            "step",
            "second",
            "india",
            "takes",
            "abayomi",
            "cent",
            "important",
            "weeks"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Mbaka: I took three expatriate contractors to Buhari",
          "summary": "Father Ejike Mbaka has admitted meeting President Muhammadu Buhari with three white men over a contract.\nMbaka, an ardent supporter of Buhari until recently, had told worshippers in Enugu last Wednesday that the President had failed the nation and ought to resign.\nHe said: “When they talked about giving Father Mbaka contracts, I don’t want to talk about that, I was laughing.\nWhoever is saying that is a shame to himself and shame to the people he is representing.\nAnd these are the three men that we brought that will handle insecurity for the country; they had the gadgets.",
          "link": "https://thenationonlineng.net/mbaka-i-took-three-expatriate-contractors-to-buhari/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "men",
            "country",
            "giving",
            "president",
            "shame",
            "white",
            "took",
            "talked",
            "mbaka",
            "contract",
            "contractors",
            "buhari",
            "talk",
            "insecurity",
            "expatriate"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "PDP charges FG to deploy technology to combat insecurity",
          "summary": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP) has admonished the Federal Government to deploy technology in combating insecurity in the country.\nThe PDP, which decried the rising cases of terrorism, banditry and other violent crimes, also called for the establishment of National Borders Protection Force to effectively police the country’s borders.\nPDP National Chairman, Uche Secondus, stated this, yesterday, while speaking during a press conference, at the party’s national secretariat in Abuja.\nThe PDP, as a body, is willing to give a helping hand in this direction,” he said.\nGovernment’s monopoly over legitimate coercive powers has been compromised and torpedoed with criminal gangs let loose across our nation.",
          "link": "https://www.sunnewsonline.com/pdp-charges-fg-to-deploy-technology-to-combat-insecurity/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "technology",
            "deploy",
            "intelligence",
            "president",
            "combat",
            "charges",
            "federal",
            "pdp",
            "governments",
            "security",
            "national",
            "terrorism",
            "failure",
            "insecurity",
            "fg"
          ]
        },
        {
          "title": "Abductors threaten to kill 17 Greenfield varsity students if N100m ransom isn’t paid",
          "summary": "From Rose Ejembi, MakurdiAbductors of students of Greenfield University, Kaduna State, have given parents of the victims deadline to “settle” their N100 million ransom.\nThe kidnappers subsequently killed three of the students, and later another two, while negotiating an N800 million ransom with the parents.\nJalingo said the families of the students had already paid N55 million which he claims was used to feed the abductees.\nHe said five of the students were killed to prove that the state and the federal governments have failed.\nChairman of Gwer West, Mrs. Grace Igbabo, confirmed the report saying the victim’s were killed in two separate attacks.",
          "link": "https://www.sunnewsonline.com/abductors-threaten-to-kill-17-greenfield-varsity-students-if-n100m-ransom-isnt-paid/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "telephone",
            "n100m",
            "abductors",
            "crisis",
            "million",
            "varsity",
            "paid",
            "village",
            "isnt",
            "threaten",
            "students",
            "kill",
            "ransom",
            "victims",
            "suspected",
            "killed",
            "attack",
            "greenfield"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "FG Moves to Curb Small Arms Influx, Establishes Control Centre",
          "summary": "It established the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThere was a committee on small and light weapons that was in place before.\nThe counterterrorism efforts of the government of Nigeria are mainly centred on military action and not guided by the national strategy (National Counter-Terrorism Strategy) released in 2014.\n“I truly don’t see where the establishment of a centre for small and light weapons control comes in within the existing strategy.\nNational Security Council Reconvenes TodayThe National Security Council (NSC) headed by President Muhammadu Buhari will reconvene today in Abuja to proffer lasting solutions to the security challenges facing the country.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/fg-moves-to-curb-small-arms-influx-establishes-control-centre/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "small",
            "borders",
            "establishes",
            "curb",
            "centre",
            "strategy",
            "arms",
            "national",
            "security",
            "control",
            "light",
            "weapons",
            "moves",
            "influx",
            "fg"
          ]
        },
        {
          "title": "Bandits Threaten to Kill Abducted Greenfield University Students Today",
          "summary": "The Kaduna students, numbering about 22, were abducted on April 18 when the hoodlums invaded the school about 8:30 pm.\nJalingo said 17 students, comprising 15 girls and two boys, were in his custody, including the grandson of the late Emir of Zazzau, Alhaji Shehu Idris, whose name was given as Hamza.\nHe stated that the families of the abducted students had already paid N55 million, but they had spent the money to feed the students.\nHe said five of the abducted students were killed to prove that the state and the federal governments had failed.\nA pastor in the area, Mr. Sule Sunday, on behalf of the Christian community, expressed sadness over the persistent attack on the communities.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/04/bandits-threaten-to-kill-abducted-greenfield-university-students-today/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "area",
            "threaten",
            "kill",
            "students",
            "today",
            "university",
            "herdsmen",
            "bandits",
            "ransom",
            "mr",
            "security",
            "attack",
            "abducted",
            "17",
            "greenfield"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "Deeper Life School: Another Parent Said Her Child Was Also Assaulted, Says Mother Of Alleged Victim",
          "summary": "While the alleged molestation and assault on Don Davis Archibong, a Junior Secondary School 1 student of Deeper Life High School, Uyo, Akwa Ibom State has continued to attract public condemnation, Don Davis’ mother, Deborah Okezie, has said another parent disclosed to her that her child was also abused.\nOkezie, however, said the female parent refused to join her to seek justice for their children because of her husband’s position in the church – Deeper Life Christian Ministry, owners of the school.\n“Don Davis is doing well, just that he snaps out of his sleep, saying he wants to wee and he actually does.\n“Deeper Life High School is very sound academically, I have checked my son’s laptop, I have seen the materials sent from Ayobo but when it comes to taking care of the children, they are 0/100.\nIt wrote via its handle – @dclmhq: \"Update: The Education Secretary of the Deeper Life High School will share some updates on the Don Davis case later today.\"",
          "link": "http://saharareporters.com/2020/12/29/deeper-life-school-another-parent-said-her-child-was-also-assaulted-says-mother-alleged",
          "published": "12/29/2020",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "child",
            "okezie",
            "high",
            "assaulted",
            "davis",
            "deeper",
            "life",
            "alleged",
            "parent",
            "mother",
            "school",
            "victim",
            "don"
          ]
        },
        {
          "title": "Deeper Life School: Another Parent Said Her Child Was Also Assaulted, Says Mother Of Alleged Victim",
          "summary": "While the alleged molestation and assault on Don Davis Archibong, a Junior Secondary School 1 student of Deeper Life High School, Uyo, Akwa Ibom State has continued to attract public condemnation, Don Davis’ mother, Deborah Okezie, has said another parent disclosed to her that her child was also abused.\nOkezie, however, said the female parent refused to join her to seek justice for their children because of her husband’s position in the church – Deeper Life Christian Ministry, owners of the school.\n“Don Davis is doing well, just that he snaps out of his sleep, saying he wants to wee and he actually does.\n“Deeper Life High School is very sound academically, I have checked my son’s laptop, I have seen the materials sent from Ayobo but when it comes to taking care of the children, they are 0/100.\nIt wrote via its handle – @dclmhq: \"Update: The Education Secretary of the Deeper Life High School will share some updates on the Don Davis case later today.\"",
          "link": "http://saharareporters.com/2020/12/29/deeper-life-school-another-parent-said-her-child-was-also-assaulted-says-mother-alleged#disqus_thread",
          "published": "12/29/2020",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "child",
            "okezie",
            "high",
            "assaulted",
            "davis",
            "deeper",
            "life",
            "alleged",
            "parent",
            "mother",
            "school",
            "victim",
            "don"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "'Residents killed' as gunmen attack Benue communities",
          "summary": "Unknown gunmen have attackedsome communities in Gwer west LGA of Benue state.\nCatherine Anene, Benue police spokesperson, confirmed the attack on Monday, adding that the command has not received full details of what took place.\nAccording to NAN, Anene said the gunmen invaded Mbamondu and Vengav in Avihijume council ward in Udam, and Tse Amgbem which is around Aondona.\nCommunities in Benue have also been attacked, with residents killed and several others injured.\nFollowing the rising insecurity affecting his state, Samuel Ortom, Benue state governor, had called on the federal government to declare a state of emergency.",
          "link": "https://www.thecable.ng/residents-killed-as-gunmen-attack-benue-communities",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "invaded",
            "benue",
            "gunmen",
            "lga",
            "killed",
            "communities",
            "recent",
            "attack",
            "residents",
            "anene"
          ]
        },
        {
          "title": "Bloomberg delists Bill Gates from billionaire index after divorce",
          "summary": "Bloomberg has delisted Bill Gates, one of the world’s richest men, from its billionaire index, following the announcement of a divorce from Melinda Gates, TheCable can report.\nAdvertisementOn Monday, the co-chairs of the Bill and Melinda Gates Foundation announced their divorce after 27 years together as a married duo.\nAdvertisementIn 1987, an unmarried Gates became the youngest American Billionaire, a record he held until Mark Zuckerberg, the Facebook founder came to the billionaire status in 2007.\nGates got married to Melinda in 1994, after Bill was already named the richest man in America.\nForbes’ real-time billionaire list still has Gates at number four with a wealth of $130 billion.",
          "link": "https://www.thecable.ng/bloomberg-delists-bill-gates-from-billionaire-index-after-divorce",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "billionaire",
            "delists",
            "melinda",
            "richest",
            "married",
            "wealth",
            "gates",
            "bill",
            "list",
            "bloomberg",
            "index",
            "divorce"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Designing and building sustainable commercial spaces in Nigeria",
          "summary": "Their office space vision was brought to life by Yinka Dayo-Adepoju, the lead architect and partner at Innovate Concepts.\nInnovate Concepts LTD is an architectural firm dedicated to designing and building sustainable commercial spaces for mid-sized and large companies.\nLike I said, we had a really really tight deadline.\nElements like traffic signs, zebra crossings and road demarcations and strategic use of vibrant colours are infused around the office space.\nI’m bringing Yinka Dayo-Adepoju to centre stage because he advocates for sustainable commercial and residential buildings in Nigeria.",
          "link": "https://techcabal.com/2021/05/03/designing-and-building-sustainable-commercial-spaces-in-nigeria/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "work",
            "nigeria",
            "centre",
            "design",
            "designing",
            "way",
            "really",
            "sustainable",
            "wanted",
            "company",
            "spaces",
            "kobo360",
            "commercial",
            "building",
            "space",
            "office"
          ]
        },
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "cbn",
            "enforces",
            "sacking",
            "tradition",
            "skye",
            "board",
            "bank",
            "bruised",
            "took",
            "banks",
            "otudeko",
            "emefiele",
            "governor",
            "sanusi"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Obaseki recommits to press freedom, charges journalists on peace, development journalism – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged journalists to use the power of the pen in ensuring peace, unity and development of the country amid various challenges facing the nation.\nAccording to him, “As we mark the World Press Freedom Day, I want to urge media practitioners to uphold the ethics of the journalism profession, leverage on the power of the Freedom of Information (FOI) Act and ensure they provide the public with fact-based, verified and credible information.\n“As a government that thrives on transparency and accountability to the people, we will ensure a safe space for journalists to thrive and live up to their constitutional role in a democracy,” the governor reassured.\nThe UN General Assembly in 1993 proclaimed May 3 as World Press Freedom Day, following a recommendation adopted at the twenty-sixth session of the United Nations Educational, Scientific and Cultural Organization (UNESCO) General Conference in 1991.\nIt is a date to encourage and develop initiatives in favour of press freedom and to assess the state of press freedom worldwide.",
          "link": "http://nigerianobservernews.com/2021/05/obaseki-recommits-to-press-freedom-charges-journalists-on-peace-development-journalism/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "recommits",
            "peace",
            "public",
            "obaseki",
            "day",
            "information",
            "nigerian",
            "media",
            "challenges",
            "press",
            "journalism",
            "freedom",
            "world",
            "journalists",
            "observer",
            "development",
            "governor"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "cattle",
            "jan",
            "immediate",
            "highways",
            "movement",
            "register",
            "nightgrazing",
            "outlawed",
            "wish",
            "web",
            "prohibited",
            "19",
            "underaged"
          ]
        },
        {
          "title": "Buhari appoints A.M. Dikko head of new agency to control small arms, weapons",
          "summary": "President Muhammadu Buhari has approved the appointment of Major General A.M. Dikko (rtd) as the pioneer coordinator of the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nA statement from the presidency on Monday, said Buhari had also approved the establishment of NCCSALW.\nThe agency will be domiciled in the Office of the National Security Adviser and replaces the defunct Presidential Committee on Small Arms and Light Weapons and will serve as the institutional mechanism for policy guidance, research and monitoring of all aspects of small arms and light weapons (SALW) in Nigeria.\nHe was a Course Director at the Kofi Annan International Peacekeeping Centre and Chief Instructor of the Nigerian Army Peacekeeping Centre.\nThe pioneer Coordinator has vast experience working with the ECOWAS and the UN system and is expected to operationalize the objectives of the NCCSALW.",
          "link": "https://hallmarknews.com/buhari-appoints-a-m-dikko-head-of-new-agency-to-control-small-arms-weapons/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "salwthe",
            "small",
            "peacekeeping",
            "nigeria",
            "dikko",
            "centre",
            "head",
            "arms",
            "appoints",
            "agency",
            "national",
            "control",
            "presidency",
            "light",
            "weapons",
            "buhari",
            "salw"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Pay N100m Ransom Or We’ll Kill 17 Greenfield Varsity Students, Bandits Threaten",
          "summary": "ADVERTISEMENTAbductors of some students of Greenfield University in Kaduna State yesterday threatened to kill the victims if their demand for N100 million ransom is not met today.\nThe gunmen, suspected to be bandits, had attacked the school on April 18 this year and abducted some students.\nJalingo said the families of the students had already paidN55 million which he claims was used to feed the abductees.\nHe said five of the students were killed to prove that the state and the federal governments have failed.\n“We heard the utterances of the Kaduna State Governor that he will not pay randoms",
          "link": "https://leadership.ng/pay-n100m-ransom-or-well-kill-17-greenfield-varsity-students-bandits-threaten/",
          "published": "05/04/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "state",
            "n100m",
            "pay",
            "million",
            "varsity",
            "jalingo",
            "threaten",
            "students",
            "kill",
            "ransom",
            "kaduna",
            "victims",
            "bandits",
            "killed",
            "families",
            "17",
            "greenfield"
          ]
        },
        {
          "title": "JUST-IN: Suspected Sponsor Of Imo Deadly Attacks Arrested",
          "summary": "BY OUR CORRESPONDENTA 42-year-old man, identified as Nnamdi Okafor, has been arrested by security operatives for allegedly sponsoring the recent deadly attacks in Imo State.\nIn some of the attacks, policemen, police stations and other government facilities, including the Owerri Correctional Centre, were targeted.\nIt was learnt that security operatives had been watching Okafor for some time before his arrest.\nIt was also gathered that some others had been arrested in connection to the deadly attacks in Imo with one of the ring leaders’ name given as Izuchukwu Ohaeri.\nADVERTISEMENTHe is said to be 31 year-old and from Isiwenke, Amakohia in the Ihitte Uboma local government area of Imo State.",
          "link": "https://leadership.ng/just-in-suspected-sponsor-of-imo-deadly-attacks-arrested/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "governor",
            "identified",
            "imo",
            "arrested",
            "suspected",
            "sponsor",
            "suspect",
            "justin",
            "okafor",
            "security",
            "attacks",
            "stateit",
            "operatives",
            "deadly"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "Buhari appoints Dikko head of new agency to control small arms, weapons",
          "summary": "Nigeria President Muhammadu Buhari has appointed Rtd Major General A.M. Dikko as the pioneer coordinator of the National Centre for the Control of Small Arms and Light Weapons (NCCSALW).\nThe presidency in a statement said Buhari approved the establishment of NCCSALW on Monday.\nThe agency will be domiciled in the Office of the National Security Adviser.\nThe NCCSALW replaces the defunct Presidential Committee on Small Arms and Light Weapons and will serve as the institutional mechanism for policy guidance, research and monitoring of all aspects of small arms and light weapons (SALW) in Nigeria.\nHe was a Course Director at the Kofi Annan International Peacekeeping Centre and Chief Instructor of the Nigerian Army Peacekeeping Centre.",
          "link": "https://dailytimes.ng/buhari-appoints-dikko-head-of-new-agency-to-control-small-arms-weapons/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "salwthe",
            "small",
            "peacekeeping",
            "nigeria",
            "dikko",
            "centre",
            "head",
            "arms",
            "appoints",
            "agency",
            "national",
            "control",
            "presidency",
            "light",
            "weapons",
            "buhari",
            "salw"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Ibori loot: Malami explains delay in retrieving £4.2m from UK",
          "summary": "The Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami, has explained the delay in the final retrieval of the £4.2million Ibori loot from the United Kingdom (UK) was as a result of some logistic challenges currently being addressed.\nThe British High Commissioner to Nigeria, Ms. Catriona Laing, announced on March 9 at a meeting with the AGF that her country has concluded plans to return to Nigeria money recovered from friends and family members of the former governor of Delta State, James Ibori.\nLaing, who said the return of the £4.2m was the first of such from the UK to Nigeria, under a memorandum of understanding signed between both countries in 2016, was however silent on the actual date the money would be released.\nIn a statement on Monday by his Special Assistant on Media, Dr. Umar Jibril Gwandu, Malami said the Federal Government was working tirelessly to ensure the return of looted Nigerian assets kept outside the country’s territorial boundariesMalami assured that any moment from now, Nigeria would receive the Ibori loot, explaining sometimes, when a country transfers funds, it may take a little bit more time than expected due to some documentations.\nNationShare this: TwitterFacebookLike this: Like Loading...",
          "link": "https://daylightng.com/ibori-loot-malami-explains-delay-in-retrieving-4-2m-from-uk/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "explains",
            "country",
            "malami",
            "nigeria",
            "retrieving",
            "return",
            "loot",
            "delay",
            "ibori",
            "agf",
            "uk",
            "42m",
            "money",
            "working"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "Importance Of World Press Freedom Day",
          "summary": "May 3, 2021 188As people across the globe commemorate World Press Freedom Day, it is important that we highlight the significance of this celebration.\nThe World Press Freedom Day is an annual celebration held on May 3, with this year’s occasion themed ‘Information as a public good’.\nHistory of World Press Freedom DayThe World Press Freedom Day was first declared in 1993 by the United Nations following the 26th General Conference session of the United Nations Educational, Scientific and Cultural Organisation (UNESCO).\nCommemorating this event is a reminder to governments across the world on the importance of journalists in individual countries and territories in the dissemination of information to the public.\nOut of 180 countries and territories, Nigeria ranks 115 on the World Press Freedom Index.",
          "link": "https://bizwatchnigeria.ng/importance-of-world-press-freedom-day/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "united",
            "importance",
            "day",
            "nigeria",
            "press",
            "themed",
            "freedom",
            "countries",
            "world",
            "journalists",
            "territories"
          ]
        },
        {
          "title": "ANALYSIS: New Policy Fails To Reverse Gas Flaring, Importation",
          "summary": "May 3, 2021 371To reverse the loss of potential revenue to gas flaring and capital flight due to regular importation of Liquified Natural Gas (LNG) to meet domestic demand, the Nigerian government introduced the Nigerian Gas Flare Commercialization Programme (NGFCP).\nThis is despite the plans and strategies deployed by the Nigerian government to put an end to the wasteful gas flaring in 2020.\nSpeaking at a public hearing on gas flaring at the House of Representatives in Abuja, the minister said the elimination of gas flaring was being taken seriously and would come to an end by 2025.\nHe noted that Nigeria has significantly reduced gas flaring, adding that initiatives had been deployed to ensure the utilisation of gas that is being flared.\n“Today, we have actually reduced gas flaring significantly to a very minimal level of eight per cent.",
          "link": "https://bizwatchnigeria.ng/analysis-new-policy-fails-to-reverse-gas-flaring-importation/",
          "published": "05/03/2021",
          "scraped_date": "05/04/2021",
          "keywords": [
            "country",
            "target",
            "2020",
            "nigeria",
            "cooking",
            "oil",
            "nigerian",
            "policy",
            "petroleum",
            "gas",
            "analysis",
            "reverse",
            "importation",
            "flaring",
            "fails"
          ]
        }
      ]
    }
  }
}