{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "96 DAYS OF SERVICE CHIEFS: 741 killed by suspected terrorists, bandits, herdsmen, others",
          "summary": "It is only four days to 100 days since the current Service Chiefs took office on January 26, 2021, precisely 96 days.\nFebruary 18: Suspected bandits kill students, abduct 42 in Niger State.\nFebruary 19: Suspected bandits kill one, injure two, and abduct 10 in Niger State.\nFebruary 25: 18 killed in Kaduna as suspected bandits attack soft targetsFebruary 25: Kidnappers kill four officers in Calabar.\nApril 26: Suspected bandits kill six in three Katsina communitiesApril 27: Gunmen attack police station, killing five officers.",
          "link": "https://www.vanguardngr.com/2021/05/96-days-of-service-chiefs-741-killed-by-suspected-terrorists-bandits-herdsmen-others/",
          "published": "05/09/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "chiefs",
            "attack",
            "741",
            "gunmen",
            "military",
            "kaduna",
            "bandits",
            "kill",
            "suspected",
            "killed",
            "service",
            "days",
            "96",
            "security",
            "terrorists",
            "herdsmen"
          ]
        },
        {
          "title": "Stop agonising, do something, Fayemi tells youths, cautions clerics against extremism",
          "summary": "Fayemi spoke in Lagos, yesterday, at the 2021 edition of The Platform, an annual event hosted by Pastor Poju Oyemade of the Covenant Christian Centre.\nSummit theme was ‘Towards a Safe & Secure Nigeria’.\nThe governor identified poverty, unemployment and arms proliferation as some of the factors contributing to insecurity and crime in the country.\nHe said insecurity in Nigeria was multi-faceted, adding that the establishment of state police would address the challenge.\nHis words: “There is unemployment, drug, climate change and other factors fueling violence extremism.",
          "link": "https://www.vanguardngr.com/2021/05/stop-agonising-do-something-fayemi-tells-youths-cautions-clerics-against-extremism/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "fayemi",
            "nigeria",
            "secure",
            "tells",
            "security",
            "extremism",
            "clerics",
            "youths",
            "urged",
            "share",
            "state",
            "stop",
            "situation",
            "spoke",
            "cautions",
            "agonising",
            "unemployment"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Police launch search for Yagba West Council Boss, as gunmen kill Kogi Commissioner",
          "summary": "The Kogi State Police Command has commenced search for the whereabouts of the Chairman, Yagba West Local Government Area of the state, Mr Pius Kolawole, who was in the same car with the late Pension Board Commissioner, Mr. Solomon Akeweje.\nDAILY POST gathered that Late Solomon Akeweje was shot dead on Saturday evening by unknown gunmen in his vehicle at Eruku, some few kilometers to Egbe while returning from Ilorin, Kwara State.\nHe added that his remains had been deposited at ECWA hospital, Egbe, while the whereabouts of Kolawole remaimed unknown.\n“The Commissioner Police of Police in the state,Mr Ede Ayuba, has deployed personnel to the area to search for and rescue the chairman from his abductors.\nThe development has thrown the area into mourning with the people describing it as ”Black Saturday.”",
          "link": "https://dailypost.ng/2021/05/02/police-launch-search-for-yagba-west-council-boss-as-gunmen-kill-kogi-commissioner/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "commissioner",
            "council",
            "west",
            "kolawole",
            "gunmen",
            "egbe",
            "yagba",
            "area",
            "whereabouts",
            "state",
            "kill",
            "akeweje",
            "solomon",
            "boss",
            "search",
            "kogi",
            "post",
            "launch"
          ]
        },
        {
          "title": "Zero allocation: We have enough to pay workers' salaries",
          "summary": "The Jigawa State governor Alhaji Muhammed Badaru Abubakar has said the State has enough to pay its workers’ salaries despite NNPC threat ofzero remittance to the Federation Accounts Allocation Committee (FAAC) for the month of April 2021.\nThe Governor gave the assurance while addressing workers at the May day celebration to mark the international workers’ day at the Ahmadu Bello Hall in Dutse, the capital of Jigawa.\nHe assured civil servants in the state of his commitment to continue to pay N30,000 minimum wage salaries and pensions within the next months despite the warning that there may be zero Federal allocation in subsequent months.\n“Workers in Jigawa should remain calm as their salaries would be paid as and when due.\nThe Chairman of the Nigerian Labour Congress, Mr. Sunusi Alhassan commend the Governor for his efforts to ensure payment of the workers’ salaries.",
          "link": "https://dailypost.ng/2021/05/02/zero-allocation-we-have-enough-to-pay-workers-salaries-gov-badaru/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "come",
            "pay",
            "allocation",
            "spending",
            "state",
            "remittance",
            "salaries",
            "workers",
            "governor",
            "day",
            "zero"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "10 women crushed to death as truck rams into Imo market",
          "summary": "By Damian Duruiheoma, OwerriNo fewer than 10 market women were on Saturday afternoon crushed to death as a truck conveying chippings rammed into Nkwommiri Market in Nwangele Local Government Area of Imo State.\nThe truck was said to have lost its brakes while it was descending from Anara Road heading towards Orlu and lost control.\nIt was said to have rammed into the roadside market and crushed the women who were trading on a roadside part of the market.\nVillage sources told our correspondent that some of the victims were crushed into a nearby river.\nAccording to them, the community was battling to rescue those trapped in the truck and the vehicles it hit.",
          "link": "https://thenationonlineng.net/10-women-crushed-to-death-as-truck-rams-into-imo-market/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "lost",
            "roadside",
            "imo",
            "market",
            "correspondent",
            "truck",
            "rammed",
            "crushed",
            "rescue",
            "rams",
            "women",
            "incident",
            "death"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "BREAKING: COVID-19: FG to stop travellers from Brazil, India, Turkey from entering Nigeria",
          "summary": "Brazil records 406,437 fatalities, India 211,853, while Turkey has recorded 4,849,408 cases, it crossed the 40,000 fatalities.\nWithin 24 hours of arrival shall take a COVID-19 PCR testii.\nIf positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf negative, the passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day seven of their quarantine.\nCarry out a COVID-19 PCR test on day 7 at selected laboratory.",
          "link": "https://www.sunnewsonline.com/breaking-covid-19-fg-to-stop-travellers-from-brazil-india-turkey-from-entering-nigeria/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "nigeria",
            "cases",
            "covid19",
            "turkey",
            "entering",
            "travellers",
            "shall",
            "brazil",
            "countries",
            "stop",
            "pcr",
            "fg",
            "risk",
            "passenger",
            "india",
            "test",
            "breaking",
            "day"
          ]
        },
        {
          "title": "BREAKING: Policeman missing, another injured as gunmen attack police station in Ebonyi",
          "summary": "From Chijioke Agwu, AbakalikiA police officer attached to the Abaomege Police station in Onicha local government area of Ebonyi state has been declared missing following attack on the station by gunmen on Saturday.\nSources in the area told our correspondent that the gunmen attacked the station around 8pm.\nOur correspondent gathered that another police officer on duty during the attack was seriously injured and has been hospitalized.\nThe goverment official who pleaded for anonymity said the injured officer had been taken to a hospital in Abakaliki for treatment.\n“The gunmen attacked the Abaomege Police station Saturday evening.",
          "link": "https://www.sunnewsonline.com/breaking-policeman-missing-another-injured-as-gunmen-attack-police-station-in-ebonyi/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "attack",
            "gunmen",
            "policeman",
            "injured",
            "area",
            "ebonyi",
            "correspondent",
            "missing",
            "officer",
            "hospital",
            "attacked",
            "station",
            "breaking"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "Covid-19: FG to Deny Travellers Entry from India, Brazil and Turkey",
          "summary": "These precautionary measures are a necessary step to minimize the risk of a surge in COVID-19 cases introduced to Nigeria from other countries, while national response activities continue.\nAccording to him, “Any person who has visited Brazil, India or Turkey within fourteen (14) days preceding travel to Nigeria, shall be denied entry into Nigeria.\nThe following condition shall apply to such passengers: Within 24 hours of arrival shall take a COVID-19 PCR test.\n“If positive, the passenger shall be admitted within a government-approved treatment centre, in line with National treatment protocols.\nIf Negative, the Passenger shall continue to remain in quarantine and made to undergo a repeat PCR test on day 7 of their quarantine.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/covid-19-fg-to-deny-travellers-entry-from-india-brazil-and-turkey/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "nigeria",
            "cases",
            "covid19",
            "turkey",
            "travel",
            "travellers",
            "shall",
            "brazil",
            "countries",
            "passengers",
            "fg",
            "passenger",
            "entry",
            "india",
            "federal",
            "deny",
            "pcr"
          ]
        },
        {
          "title": "Fayemi to Youth: Stop Agonising, Use Your Numerical Strength to Effect Changes",
          "summary": "We are not there yet but that does not mean we will give up.”Addressing the security situation in the country, the Chairman, of Nigeria Governors Forum (NGF) stressed that everyone was living in fear over the security situation.\nWe need a security system that is localised, knowledgeable about the culture and security situation of a particular community.\n“The mutating security situation in our country requires a concerted effort.\n“Today, the greatest challenges facing the country are the youth explosion and the corresponding unemployment challenge.\nWe should rather teach pluralism and how to remain faithful in the midst of other competing belief systems.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram",
          "link": "https://www.thisdaylive.com/index.php/2021/05/02/fayemi-to-youth-stop-agonising-use-your-numerical-strength-to-effect-changes/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "fayemi",
            "nigeria",
            "insecurity",
            "effect",
            "country",
            "changes",
            "need",
            "youth",
            "system",
            "stop",
            "situation",
            "strength",
            "religious",
            "agonising",
            "security",
            "numerical",
            "national"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "haram",
            "boko",
            "attacking",
            "military",
            "area",
            "islamic",
            "insurgents",
            "gathered",
            "state",
            "killed",
            "soldiers",
            "residents",
            "currently",
            "flee",
            "community",
            "breaking",
            "borno"
          ]
        },
        {
          "title": "BREAKING: Boko Haram Currently Attacking Borno Community, Residents Flee",
          "summary": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Rann, headquarters of Kala Balge Local Government Area of Born State.\nThe latest attack is coming six days after the insurgents attacked a Nigerian Army location at 156 Battalion in Mainok area, Borno State, killing over 30 soldiers.\nMainok is the headquarters of the Kaga Local Government Area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nIn February, about 20 soldiers were also killed in Malari, Borno State, by the insurgents.",
          "link": "http://saharareporters.com/2021/05/01/breaking-boko-haram-currently-attacking-borno-community-residents-flee#disqus_thread",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "haram",
            "boko",
            "attacking",
            "military",
            "area",
            "islamic",
            "insurgents",
            "gathered",
            "state",
            "killed",
            "soldiers",
            "residents",
            "currently",
            "flee",
            "community",
            "breaking",
            "borno"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "Wale Oke: I'm praying God should remove Buhari",
          "summary": "Wale Oke, the national president of Pentecostal Fellowship of Nigeria (PFN), says he is praying God should remove President Muhammadu Buhari for Nigeria to experience peace.\nIn the 1960s when Nigeria fought a civil war, the eastern part of the nation was the theatre of war.\nFor the first time, I have found myself praying that God should remove Buhari.\n“Give us peace by all means even if it means removing an incompetent and a failed President.\nOh God, do it quickly and give us peace by all means.",
          "link": "https://www.thecable.ng/wale-oke-im-praying-god-should-remove-buhari",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "president",
            "im",
            "nigeria",
            "remove",
            "god",
            "country",
            "peace",
            "telling",
            "theatre",
            "war",
            "praying",
            "buhari",
            "failed",
            "oke",
            "means",
            "wale"
          ]
        },
        {
          "title": "FG bans passengers from Brazil, India, Turkey amid surge in global COVID-19 cases",
          "summary": "The SGF added that the federal government has reduced the validity period of pre-boarding COVID-19 PCR test for all Nigeria-bound passengers from 96 to 72 hours.\nThese precautionary measures are a necessary step to minimize the risk of a surge in COVID-19 cases introduced to Nigeria from other countries, while national response activities continue.\n“The Presidential Steering Committee on COVID-19, after due consideration has therefore approved the implementation of the following measures: Reduction of the validity period of pre-boarding COVID-19 PCR test for all Nigeria-bound passengers from 96hrs to 72 hours.\nHenceforth PCR test results older than 72hours before departure shall not be accepted.\nCarry out a COVID-19 PCR test on day 7 at selected laboratory.",
          "link": "https://www.thecable.ng/fg-bans-passengers-from-brazil-india-turkey-amid-surge-in-global-covid-19-cases",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "nigeria",
            "cases",
            "covid19",
            "turkey",
            "bans",
            "travel",
            "global",
            "days",
            "surge",
            "brazil",
            "countries",
            "passengers",
            "fg",
            "visited",
            "india",
            "test",
            "pcr"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "In sacking First Bank’s board, a bruised Emefiele enforces CBN tradition",
          "summary": "Governor Sanusi Lamido Sanusi was the executioner.\nLike Emefiele, Governor Sanusi invited journalists for the momentous dethronement.\nThis Skye is the limitOn July 4, 2016, the CBN fired Skye Bank’s management team and board.\nIn his Thursday address, Emefiele admitted something; banks don’t really have to call the CBN in before choosing their leaders.\nBy his own admission, Emefiele took action because a regulatory line was crossed but also because he was crossed.",
          "link": "https://techcabal.com/2021/04/30/central-bank-first-bank-emefiele-cbn-govern/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "tradition",
            "bruised",
            "enforces",
            "bank",
            "sanusi",
            "skye",
            "banks",
            "otudeko",
            "took",
            "sacking",
            "emefiele",
            "governor",
            "cbn",
            "board"
          ]
        },
        {
          "title": "How fintech startups can expand their market size through partnerships",
          "summary": "Fintech companies, like every other business, aspire to extend their operations beyond their first base.\nThe fintech company has grown from one office in Kenya in 2004 to being present in 33 markets in Africa.\nBamisebi believes that fintech companies must first have a clear reason for wanting to enter into partnerships; a view shared by Nosa Omusi, the Nigeria country manager for Catalyst Fund.\nBecause fintech partnerships tend to require some technology integrations, an audit of the would-be partner’s level of digitisation is foundational as well.\nOne thing to note: there is not a one-size fits all approach to fintech partnerships, as Clara Odero, VP Partnerships and Growth (Middle East and Africa) for NIUM, observes:“Markets are very different.",
          "link": "https://techcabal.com/2021/04/30/how-fintech-startups-can-expand-their-market-size-through-partnerships/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "business",
            "expand",
            "nigeria",
            "country",
            "company",
            "fintech",
            "market",
            "value",
            "startups",
            "aggressive",
            "partnerships",
            "size",
            "companies",
            "expansion"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "Nigerian army renames counter-terrorism operation in N/E – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru, has approved the renaming of the ongoing counter-insurgency operation in the North East from Operation Lafiya Dole (OPLD) to Operation Hadin Kai (OPHK).\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, disclosed this in a statement on Friday in Abuja.\nYerima said the development was premised on the fact that the Nigerian Army (NA) had made a lot of progress over the years and needed to re-align for better efficiency.\nAccording to him, the renaming is in line with the COAS vision of having “A Nigerian Army that is repositioned to professionally defeat all adversaries in a joint environment”.\n“He further gave assurance that the Nigerian Army under his leadership will continue to pursue the path of “jointness” in prosecuting the counterinsurgency war,” he said.",
          "link": "http://nigerianobservernews.com/2021/04/nigerian-army-renames-counter-terrorism-operation-in-n-e/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "army",
            "coas",
            "counterterrorism",
            "disclosed",
            "counterinsurgency",
            "nigerian",
            "renaming",
            "followed",
            "operation",
            "observer",
            "renames",
            "defeat",
            "locations",
            "ne"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "web",
            "underaged",
            "wish",
            "outlawed",
            "movement",
            "highways",
            "cattle",
            "19",
            "nightgrazing",
            "immediate",
            "prohibited",
            "register",
            "jan"
          ]
        },
        {
          "title": "Fidelity Bank Approves 22 Kobo Dividend Per Share For FY2020",
          "summary": "The shareholders of Fidelity Bank Plc have unanimously endorsed the payment of a cash dividend of 22 kobo per share to all Shareholders whose names appear in the Register of Members at the close of business on April 16, 2021.\nThis translates to a dividend yield of 9.2%, making it the 4th most rewarding Bank to investors in the Nigerian Capital Market.\nMustapha Chike-Obi, Chairman of the Board of Directors of Fidelity Bank, reassured shareholders at the AGM that the board and management of the bank would maintain the high corporate governance standard synonymous with Fidelity Bank and also ensure the bank continued in its growth trajectory in the years ahead.\nTotal savings deposits now account for about 25.0 percent of total deposits, an attestation of the Bank’s increasing market share in the retail market segment.\nOnyeali-Ikpe thanked the shareholders and the members of the Board for their continued confidence in the management team and specially appreciated Fidelity Bank customers for their patronage and loyalty.",
          "link": "https://hallmarknews.com/fidelity-bank-approves-22-kobo-dividend-per-share-for-fy2020/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "shareholders",
            "bank",
            "fidelity",
            "fy2020",
            "kobo",
            "total",
            "share",
            "performance",
            "period",
            "22",
            "dividend",
            "approves",
            "deposits",
            "growth",
            "billion"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Mabiyan Addini A Jihar Xinjiang Na Gamsuwa Da Yanayin Rayuwarsu A Cikin Watan Ramadhan",
          "summary": "",
          "link": "https://hausa.leadership.ng/mabiyan-addini-a-jihar-xinjiang-na-gamsuwa-da-yanayin-rayuwarsu-a-cikin-watan-ramadhan/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "mabiyan",
            "jihar",
            "xinjiang",
            "yanayin",
            "watan",
            "gamsuwa",
            "cikin",
            "rayuwarsu",
            "ramadhan",
            "da"
          ]
        },
        {
          "title": "Masanin Nijeriya: JKS Na Da Tarihin Tsawon Shekaru 100",
          "summary": "",
          "link": "https://hausa.leadership.ng/masanin-nijeriya-jks-na-da-tarihin-tsawon-shekaru-100/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "100",
            "nijeriya",
            "jks",
            "masanin",
            "shekaru",
            "da",
            "tsawon",
            "tarihin"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": [
        {
          "title": "ECOWAS launches guidelines to protect women’s rights in peace, security",
          "summary": "By Nneka NwogwugwuThe Department of Political Affairs, Peace and Security (PAPS) of the ECOWAS Commission has launched the Women, Peace and Security (WPS) Guidelines to promote rights of women.\nThe guidelines are billed to facilitate the advancement of women’s rights and their inclusion in conflict prevention and peace building processes.\nThey are also meant to leverage relevant tools and legal frameworks having regards to international best practices in peace and security, Daily Times reports.\nThe Commissioner hoped that with the coming on board of the Guidelines, the inclusion of women would be institutionalized in all ECOWAS peace and security processes.\nThey stressed the need for alignment of the ECOWAS peace and security projects with the continental and global best practices while referencing the huge work to be done in order to prevent the incessant undermining of women’s rights and roles within the context of peace and seciurity.",
          "link": "https://dailytimes.ng/ecowas-launches-guidelines-to-protect-womens-rights-in-peace-security/",
          "published": "05/02/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "commissioner",
            "rights",
            "peace",
            "ecowas",
            "affairs",
            "guidelines",
            "launches",
            "protect",
            "paps",
            "women",
            "security",
            "womens",
            "political"
          ]
        }
      ]
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Public outrage: El-Rufai missing at The Platform",
          "summary": "Kaduna State Governor, Nasir El-Rufai, may have caved in to pressure from some Nigerians who opposed his being listed as a speaker at the 2021 edition of The Platform, an annual conference organised by the Senior Pastor of the Covenant Christian Centre, Lagos, Poju Oyemade.\nThe programme was themed, ‘Is Devolution of Powers The Solution To Nigeria’s Problems’.\nHowever, El-Rufai, who was announced as one of the speakers at the event, was conspicuously absent from the programme on Saturday.\nAlso, the organisers of the programme did not give any reason why El-Rufai was not present at the event.\nSome Twitter users had kicked against the choice of El-Rufai as a speaker on The Platform when the flyer inviting people to the event went viral with the governor as one of the speakers.",
          "link": "https://daylightng.com/public-outrage-el-rufai-missing-at-the-platform/",
          "published": "05/01/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "speaker",
            "speakers",
            "line",
            "outrage",
            "programme",
            "event",
            "elrufai",
            "state",
            "went",
            "missing",
            "public",
            "governor",
            "platform"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "biz_watch": {
      "link": "https://bizwatchnigeria.ng/",
      "articles": [
        {
          "title": "1xbet Emerges Most Popular Bookmaker, Launches Mobile Version",
          "summary": "Modern users usually want to place bets on the go, in any convenient place, and the administration has tried to create a convenient mobile version of the site for them.\nDesign and usability of the 1xbet mobile siteVisually 1xbet mobile is very similar to the full-fledged version of the site – the design is kept incorporate blue and white colours with dotted greens.\nREAD ALSO: Olympic: Sunday Dare Announces Dissolution Of NSF BoardsFeatures of the mobile version 1xbetThe developers of 1xbet mobile initially set themselves the task of making sure that the light version is in no way inferior to the full-fledged version.\nIn addition, the mobile version of the 1xBet website is highly customizable – you can choose your favorite tournaments and teams to find interesting events faster.\nMobile applications 1xbetThe light version of the site offers to immediately download the mobile software for those who find it more convenient.",
          "link": "https://bizwatchnigeria.ng/1xbet-emerges-most-popular-bookmaker-launches-mobile-version/",
          "published": "04/30/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "bookmaker",
            "1xbet",
            "site",
            "version",
            "emerges",
            "offers",
            "convenient",
            "launches",
            "mobile",
            "place",
            "popular",
            "account",
            "page",
            "website"
          ]
        },
        {
          "title": "Worsening Apapa Gridlock Amidst NPA Electronic Call-up System",
          "summary": "The e-call up system, which is being driven by an app known as eto, was designed by NPA to control movement of trucks to and from the port as part of efforts to address the Apapa gridlock.\nUnder the system, all trucks are expected to vacate the roads and wait at designated parks until they are called into the ports when needed.\nHe said, “Why won’t there be gridlock when the NPA electronic call up is just a nomenclature.\nThe e call-up system is a money-making venture for NPA and some people are benefiting from it.\nYou can only come into Apapa through Wharf Road because the other road from Berger to Trinity is impassable.",
          "link": "https://bizwatchnigeria.ng/worsening-apapa-gridlock-amidst-npa-electronic-call-up-system/",
          "published": "04/29/2021",
          "scraped_date": "05/02/2021",
          "keywords": [
            "road",
            "ecall",
            "system",
            "drivers",
            "worsening",
            "electronic",
            "callup",
            "trucks",
            "truck",
            "apapa",
            "npa",
            "roads",
            "gridlock",
            "amidst"
          ]
        }
      ]
    }
  }
}