{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": []
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Sanwo-Olu hands over amputee sachet water hawker to police over untrue stories",
          "summary": "Daniels’ viral story on social media had elicited global sympathy and concern from Nigerians.\nHowever, a government source who preferred anonymity, confirmed the development to Vanguard, saying that Governor Sanwo-Olu gave the directive on Wednesday after it was discovered that Daniels’ story was staged and untrue after all.\nMeanwhile, the Office of Special Adviser on Civic Engagement to Lagos State Governor had been directed by the governor to handle the case and follow it to the latter.\nSubsequently, Daniels was handed over to the traditional leader and other agencies on Wednesday with about N25 million in her private account.\nMeanwhile, efforts are on to contact the state police command for confirmation at press time.",
          "link": "https://www.vanguardngr.com/2021/04/sanwo-olu-hands-over-amputee-sachet-water-hawker-to-police-over-untrue-stories/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "sanwoolu",
            "narrated",
            "water",
            "daniels",
            "calls",
            "directed",
            "share",
            "discovered",
            "hands",
            "sachet",
            "hawker",
            "lagos",
            "governor",
            "state",
            "amputee",
            "untrue"
          ]
        },
        {
          "title": "AfDB bars Nigerian company 3 years for fraudulent practices",
          "summary": "Kindly Share This Story:African Development Bank Group (AfDB) has barred Maxicare Company (Nigeria) Ltd. from conducting business with it for the next three years.\nThe bank said on its website on Wednesday that the debarment, for engaging in “collusive and fraudulent practices” during a business tender, took effect from Feb. 23.\nThe Office of Integrity and Anti-Corruption of the AfDB is responsible for preventing, deterring, and investigating allegations of corruption, fraud and other sanctionable practices in bank group-financed operations.\nAccording to the bank, the prohibition renders the company and its affiliates ineligible to participate in AfDB Group-financed projects during the three-year period.\nOther banks that could bar Maxicare include the Asian Development Bank, the European Bank for Reconstruction and Development, the Inter-American Development Bank, and the World Bank Group.",
          "link": "https://www.vanguardngr.com/2021/04/afdb-bars-nigerian-company-3-years-for-fraudulent-practices/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "maxicare",
            "programme",
            "groupfinanced",
            "afdb",
            "debarment",
            "nigerian",
            "practices",
            "fraudulent",
            "company",
            "bank",
            "development",
            "integrity",
            "bars"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Insecurity: Umahi orders all native doctors to register with govt, police",
          "summary": "Governor David Umahi of Ebonyi State has ordered all native doctors and traditional medicine dealers in the state to register with the state government and the police.\nUmahi directed them to register with the state government within seven days.\nHe gave the order after the weekly state security council meeting in Abakaliki, the state capital on Wednesday, NAN reports.\nThe governor warned that those who flout his directive would be arrested and made to face the wrath of the law.\nUmahi also ordered that all wake-keeps and other social activities in the state must end by 6 p.m.",
          "link": "https://dailypost.ng/2021/04/29/insecurity-umahi-orders-all-native-doctors-to-register-with-govt-police/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "umahi",
            "native",
            "security",
            "fine",
            "register",
            "govt",
            "directive",
            "wakekeeps",
            "state",
            "order",
            "doctors",
            "governor",
            "million",
            "insecurity",
            "ordered",
            "orders"
          ]
        },
        {
          "title": "Defense Minister, Magashi, IGP Usman Alkali Baba may be removed",
          "summary": "Apostle Paul Okikijesu of the Christ Apostolic Miracle Ministry has claimed that God revealed to him that the Inspector General of Police, IGP Usman Alkali Baba and the Minister of Defence, Retired General Bashir Salihi Magashi may be removed from their positions.\n“Thus says the Lord: They may bring charges against the Inspector General of Police and he may be removed from office,” Okikijesu said in a statement to DAILY POST on Thursday.\nHe called on the new Inspector General of Police to resist coercion that can ruin the police force.\n“Baba must not allow people to push him in a manner that will ruin the name of the police force in future.\n“The Minister of Defense should be cautious; so that something that he underestimated will not cause his downfall, and hurt/harm his life.",
          "link": "https://dailypost.ng/2021/04/29/defense-minister-magashi-igp-usman-alkali-baba-may-be-removed-nigerian-prophet-declares/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "inspector",
            "baba",
            "manner",
            "general",
            "alkali",
            "ruin",
            "magashi",
            "okikijesu",
            "usman",
            "post",
            "removed",
            "defense",
            "office",
            "minister",
            "igp"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": [
        {
          "title": "Nigeria can’t afford another civil war, Osinbajo warns",
          "summary": "By Jide Orintunsin, Abuja, Nwanosike Onu, Awka and Damian Duruiheoma, OwerriOoni, Sultan caution against secession callsAbaribe: govt creating room for disintegrationNigeria cannot afford another civil war despite the increasing agitation and security challenges, Vice President Yemi Osinbajo warned on Wednesday.\nWe cannot afford a war in this country, we can`t afford it.”The Vice President maintained that the failure of the elite to act now will expose the country to danger.\nSultan Abubakar said calling for secession at the time Nigeria is seeking to fix its security apparatus.\n“On the situation we are in the country, I am an incurable optimist about a number of things particularly about Nigeria.\nHe said: “In my interactions with Nigerians across all divide and classes, you get the impression that Nigerians do not want to go to war.",
          "link": "https://thenationonlineng.net/nigeria-cant-afford-another-civil-war-osinbajo-warns/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "religious",
            "security",
            "unity",
            "war",
            "president",
            "cant",
            "country",
            "nigerians",
            "civil",
            "warns",
            "afford",
            "continue",
            "vice",
            "nigeria",
            "osinbajo"
          ]
        }
      ]
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Why Nigerian Politicians don’t invest in football –Sen Kalu",
          "summary": "By Monica IheakamThe Chief Whip of the Nigerian Senate, Senator Orji Uzor Kalu has shed lights on why Nigerian politicians shy away from identifying with football in the country.\n“Nigerian football is not profitable because there are no infrastructures and it is not something anybody can run.\n“We don’t have the infrastructure to be able to place football to where it is supposed to be.\n“These are the infrastrures we don’t have, these are investments we need to make to be able to get our football where we want it to be.\nOur people do not have stable income; traders today might not be a trader tomorrow.",
          "link": "https://www.sunnewsonline.com/why-nigerian-politicians-dont-invest-in-football-sen-kalu/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "profitable",
            "invest",
            "sen",
            "income",
            "dont",
            "tomorrow",
            "nigerian",
            "politicians",
            "able",
            "needed",
            "senator",
            "aba",
            "football",
            "stable",
            "kalu"
          ]
        },
        {
          "title": "Kalu hails Adenuga at 68",
          "summary": "Former Abia governor and Senate Chief Whip, Dr. Orji Uzor Kalu, has congratulated the founder and chairman of Globalcom Limited, Michael Adenuga, on his 68th birthday anniversary.\nDescribing the celebrant as an age-long friend, Kalu acknowledged the contributions of Adenuga to the socio- economic development of Nigeria.\nWhile commending his entrepreneurship efforts, Kalu said the business mogul, through hard work, perseverance and consistency, has built a robust business empire.\n“The celebrant is a household name beyond the shores of Africa, in view of his outstanding and robust contributions to sustainable development across Africa.\nThe celebrant deserves to be celebrated today and always as a successful business mogul and philanthropist of repute.”Kalu urged Adenuga to sustain his good works in all endeavours.",
          "link": "https://www.sunnewsonline.com/kalu-hails-adenuga-at-68-2/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "founder",
            "contributions",
            "68",
            "mogul",
            "business",
            "celebrant",
            "hails",
            "robust",
            "development",
            "works",
            "adenuga",
            "kalu"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": []
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "REVEALED: Top 5 Hotbeds Of Crimes, Killings In South-East Nigeria",
          "summary": "OwerriOwerri in Imo State is one of the most ravaged areas of the region that have come under constant attacks.\nOrluOn January 22, Nigerian soldiers invaded Orlu, a town in Imo State, in search of Eastern Security Network (ESN) operatives.\nSimilarly, on February 25, suspected hoodlums burnt down the police divisional headquarters in Aboh Mbaise, Imo State.\nOn March 17, media reports had it that some gunmen attacked the Isiala Mbano Divisional Police Headquarters in Umuelemai, Imo State.\nOn April 20, there was a mass shooting in various areas in Awka, the Anambra State capital, which resulted in the death of three young people.",
          "link": "http://saharareporters.com/2021/04/28/revealed-top-5-hotbeds-crimes-killings-south-east-nigeria",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "gunmen",
            "local",
            "killed",
            "crimes",
            "operatives",
            "revealed",
            "soldiers",
            "killings",
            "anambra",
            "effium",
            "hotbeds",
            "imo",
            "area",
            "state",
            "nigeria",
            "southeast"
          ]
        },
        {
          "title": "REVEALED: Top 5 Hotbeds Of Crimes, Killings In South-East Nigeria",
          "summary": "OwerriOwerri in Imo State is one of the most ravaged areas of the region that have come under constant attacks.\nOrluOn January 22, Nigerian soldiers invaded Orlu, a town in Imo State, in search of Eastern Security Network (ESN) operatives.\nSimilarly, on February 25, suspected hoodlums burnt down the police divisional headquarters in Aboh Mbaise, Imo State.\nOn March 17, media reports had it that some gunmen attacked the Isiala Mbano Divisional Police Headquarters in Umuelemai, Imo State.\nOn April 20, there was a mass shooting in various areas in Awka, the Anambra State capital, which resulted in the death of three young people.",
          "link": "http://saharareporters.com/2021/04/28/revealed-top-5-hotbeds-crimes-killings-south-east-nigeria#disqus_thread",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "gunmen",
            "local",
            "killed",
            "crimes",
            "operatives",
            "revealed",
            "soldiers",
            "killings",
            "anambra",
            "effium",
            "hotbeds",
            "imo",
            "area",
            "state",
            "nigeria",
            "southeast"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": [
        {
          "title": "EXTRA: Lagos shuts down illegal abattoirs, donates confiscated meat to orphanage",
          "summary": "AdvertisementAbiola Olusanya, Lagos commissioner for agriculture who confirmed the development, said three butchers were arrested at one of the abattoirs during an inspection visit on Wednesday.\nOlusanya added that the meat confiscated from the illegal facilities were donated to an orphanage and a correctional home, respectively, after the carcasses were determined for consumption.\n“Today, our Monitoring, Enforcement and Compliance (MEC) Team dislodged an illegal sheep and goat slaughter slab at the New Alade Market, Oregun.\nAlso, 29 live goats, three live sheep, 14 slaughtered goats as well a meat carcass weighing 30 kg were confiscated.\nAdvertisement“Last year, there was an option of a fine on confiscated live animals but this year, it will not be so.",
          "link": "https://www.thecable.ng/extra-lagos-shuts-down-illegal-abattoirs-donates-confiscated-meat-to-orphanage",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "donates",
            "extra",
            "abattoirs",
            "live",
            "illegal",
            "slaughter",
            "market",
            "olusanya",
            "shuts",
            "sheep",
            "lagos",
            "orphanage",
            "confiscated",
            "meat"
          ]
        },
        {
          "title": "Ozekhome on insecurity: Buhari missing in action -- someone should wake him up",
          "summary": "Mike Ozekhome, a senior advocate of Nigeria (SAN), has tackled President Muhammadu Buhari over what the former describes as the government’s failure to adequately Nigeria’s security challenges.\nTheCable had reported how Nigeria recorded more than 10 security incidents on Monday as killings and attacks continued across the country.\nBut, he is glaringly missing in action, cocooned away in Aso Villa from his electors and Nigerian citizens,” he said.\n“There may be no country called Nigeria in the foreseeable future if someone does not wake up President Buhari from his deep slumber and self-denial,” he wrote.\nAdvertisement“He needs to urgently wake up to his call of duty, walk the talk of his electioneering campaign promises and think outside the box.",
          "link": "https://www.thecable.ng/ozekhome-on-insecurity-buhari-missing-in-action-someone-should-wake-him-up",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "states",
            "security",
            "working",
            "missing",
            "wake",
            "president",
            "action",
            "senior",
            "urgently",
            "ozekhome",
            "buhari",
            "south",
            "insecurity",
            "nigeria"
          ]
        }
      ]
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": [
        {
          "title": "Tunecore’s Jade Leaf is putting people first as she creates infrastructure for the African music industry",
          "summary": "“I grew up in a place called Durban in South Africa.”This is how Jade Leaf begins her story.\n“I was like, here’s something that’s half art, half science,” she told me as we talked about her time studying architecture at the University of Cape Town (UCT).\nThese agencies were in Cape Town because a lot of the brands were there – from Adidas to Woolworths.\nJade Leaf and Shekhinah“I think it was the single biggest move of my career.\nOne of the things about Tunecore’s offering that Jade Leaf is most proud of is their commitment to giving independent artists 100% of their revenue without taking any cuts.",
          "link": "https://techcabal.com/2021/04/28/tunecores-jade-leaf-is-creating-infrastructure-for-the-african-music-industry/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "infrastructure",
            "role",
            "tunecores",
            "industry",
            "creates",
            "think",
            "cape",
            "marketing",
            "putting",
            "african",
            "artists",
            "leaf",
            "town",
            "jade",
            "degree",
            "music"
          ]
        },
        {
          "title": "South Africa’s richest black couple float $2million agritech funding programme with Milken Institute",
          "summary": "A funding initiative focused on driving technological innovations and new business models for Africa has been announced today by Milken Institute and Motsepe Foundation.\nMilken Institute is a non-profit think tank based in the United States.\nPatrice Motsepe, as of press time, is worth $3.1bn and Africa’s 9th richest man according to Forbes.\nAt the heart of the Motsepes’ initiative with Milken Institute is spurring innovation that will be in line with the United Nations Sustainable Development Goals.\nMike Milken, chairman of the Milken Institute, describes the South African couple as “good friends” with whom the institute has partnered on other initiatives before now.",
          "link": "https://techcabal.com/2021/04/28/milken-institute-motsepe-foundation-2million-dollars-agritech/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "agritech",
            "black",
            "africa",
            "programme",
            "institute",
            "richest",
            "motsepe",
            "milken",
            "initiative",
            "hopes",
            "couple",
            "solutions",
            "million",
            "funding",
            "south",
            "float",
            "agriculture",
            "innovation"
          ]
        }
      ]
    },
    "tribune": {
      "link": "https://tribuneonlineng.com/",
      "articles": [
        {
          "title": "Don’t use force to free us, kidnapped students appeal to govt",
          "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.",
          "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/",
          "published": "03/13/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "rescue",
            "force",
            "appealing",
            "yusuf",
            "student",
            "video",
            "students",
            "dont",
            "soldiers",
            "come",
            "govt",
            "free",
            "sale",
            "sent",
            "appeal",
            "kidnapped"
          ]
        },
        {
          "title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta",
          "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.",
          "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/",
          "published": "03/13/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "suspected",
            "decomposing",
            "delta",
            "corpses",
            "peddlers",
            "car",
            "bodies",
            "drug",
            "arrest",
            "warri",
            "siblings",
            "suspects",
            "led",
            "abraka",
            "phones",
            "recover",
            "recovered"
          ]
        }
      ]
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": [
        {
          "title": "BORBDA, Koster Keunen West Africa Others Sign MOU On Bee Products Marketing – Nigerian Observer",
          "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestAS a way of boosting honey production in Nigeria and the West African sub region, the Benin Owena River Basin Development Authority (BORBDA) has signed a memorandum of Understanding with off-takers of honey and bee products.\nAt the Conference room of BORBDA on Friday, BORBDA Managing Director Engr.\nAlso a co-signatory in the agreement was Mr innocent Odigie, Managing Director Dino Trust Global Company Ltd, a bee keeping expert who signed on behalf of his company.\nHe therefore urged the stakeholders especially the state governments and traditional rulers to encourage modern bee keeping and honey production given its suitability in our local environment.\nHe urged the bee farmers to take advantage of the market to expand their respective bee colonies for increased yields.",
          "link": "http://nigerianobservernews.com/2021/04/borbda-koster-keunen-west-africa-others-sign-mou-on-bee-products-marketing/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "west",
            "observer",
            "keunen",
            "borbda",
            "production",
            "marketing",
            "nigeria",
            "honey",
            "keeping",
            "nigerian",
            "mou",
            "state",
            "sign",
            "managing",
            "bee",
            "koster",
            "products"
          ]
        }
      ]
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/",
      "articles": []
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": [
        {
          "title": "Web Story 19 Jan",
          "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register",
          "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/",
          "published": "01/19/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "jan",
            "outlawed",
            "underaged",
            "cattle",
            "movement",
            "web",
            "register",
            "19",
            "nightgrazing",
            "immediate",
            "highways",
            "prohibited",
            "wish"
          ]
        },
        {
          "title": "Sanwo-Olu to handover amputee hawker to police over ‘false stories’",
          "summary": "Lagos State Governor, Mr Babajide Sanwo-Olu, has reportedly directed relevant ministries in the state, to hand over Mary Daniels, 26-year-old sachet water hawker who recently received donations from Nigerians due to her situation, following discrepancies discovered her story.\nDaniels had narrated in a viral video, that she lost her leg in a accident, which killed her parents and other family members.\nThe Kogi State born Daniels’ story had elicited sympathy and concern from Nigerians, who consequently donated money for her, about N25m.\nMeanwhile, the Office of Special Adviser on Civic Engagement to Lagos State Governor had been directed by the governor to handle the case and follow it to the latter.\nSubsequently, Daniels was handed over to the traditional leader and other agencies on Wednesday with about N25m in her private account.",
          "link": "https://hallmarknews.com/sanwo-olu-to-handover-amputee-hawker-to-police-over-false-stories/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "sanwoolu",
            "narrated",
            "daniels",
            "parents",
            "water",
            "directed",
            "false",
            "handover",
            "accident",
            "discovered",
            "lagos",
            "hawker",
            "governor",
            "state",
            "amputee"
          ]
        }
      ]
    },
    "leadership": {
      "link": "https://leadership.ng/",
      "articles": [
        {
          "title": "Private Jet Owners Shun FG, Engage In Commercial Charter Operations",
          "summary": "BY YUSUF BABALOLA |Private jet owners have continue to flout federal government’s directive banning privately registered aircraft from involving in commercial charter operation as the business still persist unchecked across the nation’s airports.\nThe Nigerian Civil Aviation Authority (NCAA), had in 2020 banned charter services with privately-registered aircraft thereby threatening to ground such aircraft when used for charter or revoke the operating licence of anyone that disobeyed the directive.\nBut, despite the warning from the apex regulatory agency in the aviation sector, privately registered aircraft still operate commercial charter operation across the country unabated.\nMshelia queried why a private jet will take off from an airport three ro four times in a day if not involved in commercial charter operation.\nMshelia, however, urged the NCAA to engage the Department of State Service (DSS) to fish out private airlines involving in the act because of its implications on the economy.",
          "link": "https://leadership.ng/private-jet-owners-shun-fg-engage-in-commercial-charter-operations/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "private",
            "told",
            "shun",
            "airline",
            "operations",
            "commercial",
            "aviation",
            "ncaa",
            "jet",
            "fish",
            "fg",
            "charge",
            "engage",
            "aircraft",
            "charter",
            "owners"
          ]
        },
        {
          "title": "Reps Ask CBN To Suspend Deadline For MFBs Recapitalisation",
          "summary": "Moving the motion, Abdullahi said, out of 874 licensed MFBs, about 612 may be negatively affected by the recapitalisation exercise.\nHe expressed concerned that the MFBs may not be able to meet up with the recapitalisation requirement of the CBN within the proposed time.\nThe house, however, urged the CBN to suspend the planned recapitalisation programme, until the economy is stabilised and considered safe for a new deadline to be fixed.\nThe house mandated the committee on banking and currency to interface with the CBN to find a workable solution to the challenges associated with recapitalisation of the MFBs in the country.\nEarlier, the Central Bank of Nigeria(CBN) had ignored several calls pleading on the apex bank to extend the recapitalisation deadline for microfinance banks.",
          "link": "https://leadership.ng/reps-ask-cbn-to-suspend-deadline-for-mfbs-recapitalisation/",
          "published": "04/29/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "microfinance",
            "mfbs",
            "banks",
            "capital",
            "reps",
            "ask",
            "recapitalisation",
            "suspend",
            "cbn",
            "million",
            "deadline",
            "meet",
            "members"
          ]
        }
      ]
    },
    "daily_trust": {
      "link": "https://dailytrust.com/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": [
        {
          "title": "Reps order CBN: Suspend microfinance banks recapitalisation",
          "summary": "The House of Representatives has urged the Central Bank of Nigeria to suspend the ongoing recapitalisation exercise for microfinance banks in the country until the economy gets better.\nMoving the motion, Abdullahi recalled that the CBN, in October 2018, reviewed the minimum share capital requirement of the three categories of MFBs as follows: Unit MFBs, from N20m to N200m; State MFBs, from N100m to N1bn; and National MFBs, from N2bn to N5bn.\nHe stressed that in 2020, the CBN considered the impact of the COVID–19 pandemic on the economy and revised the timeline for compliance with the minimum capital requirement for the MFBs by one year, which will be due by the end of April 2021.\nThe lawmaker said, “The House is concerned that the MFBs may not be able to meet up with the recapitalisation requirement of the CBN within the proposed time due to the adverse effects of COVID–19 pandemic and other economic realities.\n“In times like this, economic thinkers advocate for injection of more liquidity into the economy to stimulate economic activities, encourage spending and prevent job losses as well as support indigenous businesses.",
          "link": "https://daylightng.com/reps-order-cbn-suspend-microfinance-banks-recapitalisation/",
          "published": "04/28/2021",
          "scraped_date": "04/29/2021",
          "keywords": [
            "house",
            "mfbs",
            "banks",
            "capital",
            "reps",
            "minimum",
            "recapitalisation",
            "economic",
            "order",
            "suspend",
            "cbn",
            "microfinance",
            "requirement",
            "economy"
          ]
        }
      ]
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    }
  }
}