{"title": "There’s nexus between educational backwardness, overpopulation, poverty, insecurity — Ilori", "summary": "Kindly Share This Story:— Gives out educational materials to 1500 indigent students in OndoDayo Johnson AkureThe special adviser to the Minister on the interior, Hon Bola llori has said that there is a nexus between educational backwardness, overpopulation, poverty, and insecurity.\nIiori said this in Ondo city during the distribution of educational materials to 1500 indigent students in both primary and secondary schools to mark his birthday celebration.\n” A deep reflection on the insecurity narrative in Nigeria will reveal a clear nexus between educational backwardness, overpopulation, poverty, and insecurity.\n“For our school children of indigent background, keeping hope alive is more difficult.\nThe Minister of State, Niger Delta, Chief Tayo Alasoadura told the school children that there was no easy way to the top than to be diligent and forthright.", "link": "https://www.vanguardngr.com/2021/04/theres-nexus-between-educational-backwardness-overpopulation-poverty-insecurity-ilori/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["school", "poverty", "backwardness", "overpopulation", "insecurity", "education", "theres", "community", "ilori", "nexus", "world", "educational", "children", "indigent", "students"]}
{"title": "Wike imposes night curfew at all Rivers’ land borders", "summary": "Kindly Share This Story:By Davies Iheamnachor, Port-HarcourtThe Governor of Rivers State, Chief Nyesom Wike, has imposed night curfew at all entry and exit points into the state, Abia, Akwa Ibom, Bayelsa, and Imo States.\nWike in State broadcast on Tuesday said the curfew which takes effect from Wednesday night, is necessitated by the recent security breaches and deadly attacks on security personnel by yet-to-be-identified gunmen.\nHe said: “The Government of Rivers State has decided to restrict night movements into and out of the State from the land borders of the State.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow (Wednesday) 28 April 2021 until further notice.\n“Neither do we also know the motives of the deranged characters or group behind these senseless assaults on our State and the lives of security operatives working to keep us safe and secure.", "link": "https://www.vanguardngr.com/2021/04/wike-imposes-night-curfew-at-all-rivers-land-borders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["curfew", "imposes", "security", "wike", "view", "state", "rivers", "borders", "land", "night", "agencies", "statethe", "governor"]}
{"title": "Insecurity: Nigerian celebrities cry out to Buhari govt", "summary": "Some Nigerian celebrities have urged President Muhammadu Buhari to proffer immediate solutions to insecurity in the country.\nBanky W in his outrage said ‘unfit for office persons were calling the shots in Nigeria.\nOther celebrities also vented their frustration over the nation’s security situation on Twitter.\n“We don talk, We don taya, We don pray we don taya.\nFrom Anambra State to Kaduna, Yobe, Niger and Lagos States, there were reports of violence and bloodshed.", "link": "https://dailypost.ng/2021/04/27/insecurity-nigerian-celebrities-cry-out-to-buhari-govt/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "unfit", "shots", "cry", "don", "celebrities", "nigeria", "insecurity", "state", "reports", "govt", "violence", "uti", "situation", "nigerian", "buhari"]}
{"title": "Igbo women's group decry high insecurity in Southeast", "summary": "A women’s group, Mothers of Ndigbo has decried the high level of insecurity in the Southeast, calling on the federal government to quickly wade in and stop the incessant killings.\nThe group which consists of Igbo women from the age of 60 and above at a press conference on Tuesday said the insecurity in the zone has gotten to a climax.\nThe group said since 2015, there have been systematic attacks on peace and tranquillity which has existed in the region over the years, with attendant economic hardships on citizens.\nThey said the attacks and other insecurity problem has forced the zone into poverty according to the National Bureau of Statistics’ rating.\n“All killer herdsmen, clandestinely aided and protected by federal security forces who have now permanently settled in farmlands, bushes and forests in our land and our key neighbouring states must be moved out and relocated back to wherever they were brought from.”", "link": "https://dailypost.ng/2021/04/27/igbo-womens-group-decry-high-insecurity-in-southeast/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "southeast", "federal", "womens", "high", "south", "group", "insecurity", "region", "zone", "decry", "watch", "situation", "igbo"]}
{"title": "BREAKING: Pandemonium as gunmen storm Ebonyi community", "summary": "By Ogochukwu Anioke, AbakalikiThere was pandemonium on Tuesday in Onueke, Ezra South local government area of Ebonyi when gunmen stormed the town shooting sporadically and robbing some businesses.\nThe gunmen, numbering about five, it was gathered, had trailed a customer to a bank in the area.\nThey shot sporadically in the air near the bank causing customers and staff to scamper in various directions for safety.\nA source, who was at the bank, said the gunmen shot the man they trailed to the bank.\nHowever, the gunmen were said to have moved from the bank to some businesses in the area which they robbed.", "link": "https://thenationonlineng.net/breaking-pandemonium-as-gunmen-storm-ebonyi-community/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["gunmen", "shot", "ebonyi", "community", "pandemonium", "nearby", "robbing", "source", "bank", "moved", "trailed", "away", "breaking", "storm", "sporadically"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "summon", "urged", "summoned", "reps", "rising", "house", "insecurity", "state", "speaker", "session", "nsa", "countrythe", "chiefs", "service", "services", "breaking"]}
{"title": "BREAKING: Federal high court Abakaliki on fire", "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.", "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["court", "federal", "went", "high", "state", "located", "hours", "highway", "gutted", "abakaliki", "later", "breaking", "reportdetails", "tuesdaythe"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "security", "solutions", "state", "seek", "insecurity", "statement", "national", "issue", "help", "need", "saraki", "tells", "finding", "buhari"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "president", "seeks", "blinken", "challenges", "united", "nigeria", "states", "tackle", "africa", "climate", "countries", "paris", "help", "buhari", "meeting"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["toro", "villages", "exposed", "posted", "internet", "pictures", "saharareporters", "lawmaker", "deep", "group", "lawal", "projects", "apc", "downloaded", "constituency", "wells", "towns"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects#disqus_thread", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["toro", "villages", "exposed", "posted", "internet", "pictures", "saharareporters", "lawmaker", "deep", "group", "lawal", "projects", "apc", "downloaded", "constituency", "wells", "towns"]}
{"title": "Tinubu: Every nation will go through difficult times -- we must unite to succeed", "summary": "Bola Tinubu, national leader of the All Progressives Congress (APC), says Nigeria needs unity to surmount the current security challenges.\nAnd yes, every nation will go through these curves and difficult times.\nThere’s no president or leader that will want his nation fractured by tribalism, religious differences and all that.\nIt calls for serious management and serious evaluation and dialogue once in a while.”Speaking on the rumoured unhealthy relationship between him and the president, Tinubu said he maintains a cordial relationship with Buhari.\nWe’ll continue to work for a better Nigeria and that’s what you need,” Tinubu said.", "link": "https://www.thecable.ng/tinubu-every-nation-will-go-through-difficult-times-we-must-unite-to-succeed", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "unity", "unite", "relationship", "unhealthy", "tinubu", "nation", "succeed", "times", "difficult", "work", "country", "dont", "nigeria"]}
{"title": "Insecurity: Buni asks Yobe residents to expose bad eggs 'even if they are relatives'", "summary": "Mai Mala Buni, governor of Yobe, has asked residents to expose “bad eggs” in their midst amid the growing insecurity in the state.\nAdvertisementSpeaking during a security meeting in Damaturu on Tuesday, the governor said residents must report suspicious movements even when they concern their relatives.\nAdvertisementBumi condemned the attack, saying that Yobe’s security situation needs quick response and reassessment.\n“The sad events in Geidam call for quick response and reassessment of the security situation in our respective communities and the state generally,” he said.\n“It is our responsibility to report suspicious movements in or near our communities.", "link": "https://www.thecable.ng/insecurity-buni-asks-yobe-residents-to-expose-bad-eggs-even-if-they-are-relatives", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "asks", "communities", "state", "situation", "insecurity", "response", "quick", "expose", "residents", "eggs", "buni", "yobe", "relatives", "bad", "suspicious", "report", "movements"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["hospitaltohome", "plan", "healthcare", "medical", "communities", "inoyo", "health", "nwokoye", "bringing", "clafiya", "itoro", "rural", "services", "access", "nigeria", "jennie"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["bvn", "banks", "fair", "data", "customers", "nigerias", "umpire", "fintechs", "bank", "nibss", "access", "scams", "save", "number"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["video", "sale", "come", "soldiers", "force", "govt", "sent", "kidnapped", "appealing", "appeal", "student", "yusuf", "rescue", "dont", "free", "students"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["siblings", "phones", "arrest", "peddlers", "drug", "decomposing", "suspected", "delta", "suspects", "recovered", "led", "corpses", "abraka", "recover", "bodies", "warri", "car"]}
{"title": "Hoodlums set Federal High Court, Abakaliki ablaze – Nigerian Observer", "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Unidentified hoodlums were reportedly set ablazed the premises of the Federal High Court in Abakaliki, Ebonyi State in the early hours of Tuesday.\nThe Police Public Relations Officer, PPRO, of Ebonyi, Mrs Loveth Odah, who confirmed the incident said that no arrest had been made.\n“Hoodlums in the early hours of Tuesday wielding dangerous weapons stormed the Federal High Court premises and burnt part of the building.\n“The Commissioner of Police, Mr Aliyu Garba, has promised to arrest the perpetrators and bring them to justice,” Odah said.\nMeanwhile, a detachment of the Nigerian Mobile Police, MOPOL, has been drafted to the area to secure the court premises.", "link": "https://nigerianobservernews.com/2021/04/hoodlums-set-federal-high-court-abakaliki-ablaze/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["investigation", "court", "ablaze", "federal", "arrest", "odah", "high", "abakaliki", "ebonyi", "observer", "hoodlums", "hours", "premises", "set", "early", "nigerian"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/27/2021", "keywords": ["cattle", "register", "prohibited", "outlawed", "jan", "wish", "nightgrazing", "underaged", "movement", "immediate", "19", "web", "highways"]}
{"title": "Channels TV has apologised for breach of broadcasting code – NBC", "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised over its breach of broadcasting code.\nAccording to her, the letter is asking Channels TV to explain why it gave credence to an organisation that was already proscribed by the Federal Government.\n“It is possible to bridge the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying we apologise, we did wrong.\n“And I will be able to communicate to the media about it but this letter that went to Channels TV is our way of regulating the broadcasting industry.\nShe said that in the exercise of its power as the regulatory body, NBC wrote a letter asking Channels TV to explain why it gave credence to the spokesman of the proscribed organisation.", "link": "https://hallmarknews.com/channels-tv-has-apologised-for-breach-of-broadcasting-code-nbc/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["nbc", "public", "particular", "bridge", "broadcasting", "apologised", "channels", "station", "code", "letter", "say", "breach", "tv"]}
{"title": "Tabarbarewar Tsaro: Majalisar Wakilai Ta Bukaci A Sanya Dokar Ta-baci", "summary": "", "link": "https://hausa.leadership.ng/tabarbarewar-tsaro-majalisar-wakilai-ta-bukaci-a-sanya-dokar-ta-baci/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["tabaci", "dokar", "tsaro", "wakilai", "majalisar", "sanya", "bukaci", "ta", "tabarbarewar"]}
{"title": "Tsaro: Ba Za Mu Dagawa ‘Yan Bindiga Kafa Ba, Inji El-Rufai", "summary": "", "link": "https://hausa.leadership.ng/tsaro-ba-za-mu-dagawa-yan-bindiga-kafa-ba-inji-el-rufai/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ba", "za", "tsaro", "mu", "inji", "yan", "elrufai", "bindiga", "kafa", "dagawa"]}
{"title": "’Yan bindiga sun saki sabon bidiyon daliban Kwalejin Afaka", "summary": "", "link": "https://aminiya.dailytrust.com/yan-bindiga-sun-saki-sabon-bidiyon-daliban-kwalejin-afaka", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["yan", "kwalejin", "daliban", "saki", "bidiyon", "afaka", "bindiga", "sabon"]}
{"title": "‘Kauyukan Neja 42 ne ke karkashin ikon Boko Haram’", "summary": "", "link": "https://aminiya.dailytrust.com/kauyukan-neja-42-ne-ke-karkashin-ikon-boko-haram", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ke", "ne", "boko", "kauyukan", "haram", "neja", "42", "karkashin", "ikon"]}
{"title": "Photos: Nollywood star, Ejike Asiegbu visits DAYLIGHT Dome", "summary": "You might also like", "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["photos", "dome", "daylight", "visits", "star", "nollywood", "ejike", "asiegbu"]}
{"title": "Abia: Police to investigate murder of widow as gateman flees", "summary": "Kindly Share This Story:By Steve OkoThe Abia State Police Command has declared manhunt for a fleeing gateman in Umuahia after the lifeless body of a widow was discovered in the pool of her blood.\nReports say the fleeing gateman was newly engaged by the victim from her Mbaise maternal community.\nAccording to reports, the older security man was said to have left the woman in hands of the fleeing gateman before going to church on Sunday.\nAccording to the older gateman (names withheld), he returned from church service and knocked on the gate severally, but there was no response.\nDisturbed by the situation, the older security guard alerted neigbours who broke into the compound via the back door and discovered the widow in the pool of her blood.", "link": "https://www.vanguardngr.com/2021/04/abia-police-to-investigate-murder-of-widow-as-gateman-flees/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["umuahia", "share", "flees", "murder", "church", "alozie", "victim", "security", "widow", "older", "abia", "fleeing", "investigate", "gateman"]}
{"title": "Housewives in Makurdi lament high cost of food items, consumables", "summary": "Kindly Share This Story:Residents, particularly housewives in Makurdi, the Benue state capital, have lamented the increase in prices of food items.\nA survey conducted by News Agency of Nigeria (NAN) on Tuesday in Makurdi showed that prices of food items have been increasing on a daily basis.\nMany housewives interviewed by NAN said that feeding their families has now become very difficult as the prices of essential food items have multiplied in the past few months.\n“I always shout at the traders over the constant increase in prices of food items, but when you think of it, it is not their fault but the manufacturers.\nOther housewives; Mrs Achetu Ochefu, Mrs T. Olobatoke and Mrs Nkiru Chuka who spoke to NAN blamed the ‘everyday’ increase in prices of food items and other products on the manufacturers.", "link": "https://www.vanguardngr.com/2021/04/housewives-in-makurdi-lament-high-cost-of-food-items-consumables/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["housewives", "lament", "traders", "consumables", "mrs", "high", "cost", "food", "increase", "makurdi", "lamented", "prices", "items", "bought", "week", "nan"]}
{"title": "Ajimobi's wife Florence", "summary": "Florence Ajimobi, wife of late Oyo State Governor Abiola Ajimobi, has declared that life is short.\nFlorence spoke to leaders of Nigeria Union of Journalists (NUJ), Oyo State Council, on Iftar (Breaking of fast) at her Oluyole residence in Ibadan.\nAjimobi’s wife promised she would do anything to immortalise her husband and uphold his legacy.\nOyo State NUJ Chairman, Alhaji Ademola Babalola, thanked her for the love and honour extended to the union.\nBabalola commended Florence for being and urged her to uphold the legacy.", "link": "https://dailypost.ng/2021/04/27/life-is-short-ajimobis-wife-florence/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["oyo", "state", "husband", "love", "uphold", "wife", "ajimobis", "nuj", "journalists", "florence", "life"]}
{"title": "BREAKING: Gunmen attack bank, kill police officer, cart away cash in Ebonyi", "summary": "Unknown gunmen on Tuesday killed a police officer whose name is yet to be identified at the time of filing this report at Onueke market in Ezza South Local Government Area of Ebonyi State.\nAn eyewitness, who spoke to journalists on the condition of anonymity, said the unknown gunmen equally set ablaze a car after robbing one of the popular commercial banks located at Onueke market.\nDAILY POST gathered that, no fewer than three civilians were reportedly shot and dispossessed of their valuables by the rampaging gunmen who stormed the busy Onueke town.\nThereafter, they trailed another person to a new generation bank at Onueke and shot him.\nEfforts to reach the Ebonyi State Police command to speak on the matter, as of the time of filing this report failed.", "link": "https://dailypost.ng/2021/04/27/breaking-gunmen-attack-bank-kill-police-officer-cart-away-cash-in-ebonyi/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["bank", "state", "robbers", "report", "ebonyi", "kill", "town", "officer", "cart", "onueke", "cash", "unknown", "shot", "gunmen", "attack", "filing", "away", "breaking"]}
{"title": "Global shortage of vaccines will alter vaccination phases, says Fed Govt", "summary": "By Moses Emorinken, AbujaGlobal scarcity and delay in vaccine supply to Nigeria may alter remaining phases of vaccination, the Federal Government stated yesterday.\nIn the government’s vaccination campaign strategy, there are four phases, of which the country is still in the first phase of the COVID-19 vaccination, which involves frontline health workers, other frontline workers and strategic leaders.\nADVERTISEMENTFurthermore, it said Nigeria is set to take delivery of 29.8 million doses of Johnson and Johnson COVID-19 vaccines from the African Union, even as it expects additional vaccines from COVAX in June.\n“Notwithstanding the above successes, we are aware of the global scarcity of COVID-19 vaccines due to high demand, especially in countries where the vaccines are being produced.\n“Furthermore, the Federal Government has signed off to receive up to 29.8 million doses of the Johnson & Johnson COVID-19 vaccine through the African Union (AU).", "link": "https://thenationonlineng.net/global-shortage-of-vaccines-will-alter-vaccination-phases-says-fed-govt/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["phases", "covid19", "second", "cent", "vaccine", "dose", "fed", "vaccination", "doses", "johnson", "astrazeneca", "alter", "global", "vaccines", "govt", "shortage"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["countrythe", "speaker", "state", "rising", "session", "summon", "reps", "chiefs", "urged", "security", "summoned", "insecurity", "house", "service", "nsa", "breaking", "services"]}
{"title": "BREAKING: Federal high court Abakaliki on fire", "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.", "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["located", "went", "tuesdaythe", "state", "highway", "gutted", "abakaliki", "hours", "high", "court", "federal", "breaking", "later", "reportdetails"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["seek", "state", "need", "issue", "finding", "tells", "saraki", "national", "security", "statement", "insecurity", "solutions", "buhari", "president", "help"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "nigeria", "challenges", "meeting", "climate", "paris", "security", "tackle", "countries", "seeks", "africa", "buhari", "states", "blinken", "united", "help"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["university", "governor", "resources", "building", "management", "school", "course", "honorary", "st", "peace", "thomasabecket", "flaunts", "nonexistent", "nondegeee", "uk", "kogi", "human", "professorship"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["university", "governor", "resources", "building", "management", "school", "course", "honorary", "st", "peace", "thomasabecket", "flaunts", "nonexistent", "nondegeee", "uk", "kogi", "human", "professorship"]}
{"title": "‘We’ll take legal action’ — army condemns sharing of dead soldiers’ photos on social media", "summary": "The Nigerian army has condemned the “indiscriminate” sharing of graphic photos of soldiers killed or injured in the line of duty.\nAdvertisementMohammed Yerima, army spokesman, in a statement on Tuesday, said such distribution of soldiers’ photos on social media is insensitive and unpatriotic.\nAdvertisement“The Nigerian Army condemns in the strongest term possible, the indiscriminate sharing on social media of graphic pictures of personnel who paid the supreme price in the cause of defending and protecting the country from its adversaries,” Yerima said.\nOne can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "link": "https://www.thecable.ng/well-take-legal-action-army-condemns-sharing-of-dead-soldiers-photos-on-social-media", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["soldiers", "dead", "sharing", "nigerian", "social", "unpatriotic", "condemns", "media", "country", "personnel", "action", "pictures", "legal", "army", "graphic", "photos"]}
{"title": "IPOB interview: Channels TV has apologised for breaching broadcast code, says NBC", "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised for allegedly breaching the country’s broadcast code.\nWhile clarifying the directive, Franca Aiyetan, NBC director of public affairs, said the letter the commission sent to the TV station was an “instrument to check its excesses”.\nIt is possible to breach the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying ‘we apologise, we did wrong’.\nBut this letter that went to Channels TV is our way of regulating the broadcasting industry.\nThe NBC now said because of that, this breach attracts a shutdown or a fine of N5 million.", "link": "https://www.thecable.ng/ipob-interview-channels-tv-has-apologised-for-breaching-broadcast-code-says-nbc", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["letter", "channels", "interview", "public", "ipob", "apologised", "tv", "broadcast", "breaching", "commission", "programme", "breach", "nbc", "code", "broadcasting", "station"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["medical", "bringing", "health", "nigeria", "clafiya", "healthcare", "inoyo", "access", "itoro", "plan", "rural", "communities", "nwokoye", "hospitaltohome", "services", "jennie"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["fintechs", "save", "nibss", "access", "fair", "customers", "scams", "bvn", "data", "banks", "nigerias", "number", "bank", "umpire"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["soldiers", "appealing", "force", "free", "student", "kidnapped", "yusuf", "rescue", "appeal", "dont", "come", "video", "sent", "govt", "sale", "students"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["arrest", "car", "abraka", "suspects", "recover", "warri", "corpses", "recovered", "phones", "delta", "siblings", "drug", "decomposing", "suspected", "bodies", "led", "peddlers"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["governor", "state", "ortom", "nigerian", "nigeria", "lasting", "observer", "peace", "god", "security", "fairness", "equity", "insecurity", "country", "level", "justice"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/27/2021", "keywords": ["prohibited", "wish", "jan", "nightgrazing", "outlawed", "movement", "underaged", "cattle", "19", "register", "web", "highways", "immediate"]}
{"title": "Insecurity: Wike imposes curfew on Rivers land borders", "summary": "OBINNA EZUGWURivers State governor, Nyesom Wike, has imposed a curfew on the state’s land borders starting from tomorrow, Wednesday, as a means of curtailing attacks on security agencies by unknown gunmen.\nAccording to the governor, the curfew is from 8.00 p.m. to 6.00 a.m. and will start from tomorrow 28th April 2021, until further notice.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow 28th April 2021 until further notice.\n“Security agencies have been posted to monitor and enforce strict compliance with the curfew at all our land borders and or entry and exit points with Abia, Akwa-Ibom, Bayelsa and Imo States.\n“We therefore urge everyone to be vigilant and report every useful intelligence or suspicious movements to the security agencies for immediate actions.”", "link": "https://hallmarknews.com/insecurity-wike-imposes-curfew-on-rivers-land-borders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["governor", "state", "agencies", "land", "tomorrow", "borders", "rivers", "imposes", "security", "2021", "insecurity", "curfew", "wike"]}
{"title": "Insecurity: We Can’t Surrender Kaduna To Criminals, el-Rufai Declares", "summary": "* Defends stance on Chibok girls abduction, ‘no-ransom, no-negotiation’ policy |BY AZA MSUE, Kaduna |Governor Nasir el-Rufai of Kaduna State, on Tuesday, declared that his government will not surrender the state to criminal elements, saying experience has shown that paying ransom or negotiating with criminals only encourage them.\nel-Rufai also noted that mass abduction was like a novelty in 2014 under former President Goodluck Jonathan administration, but the facts have now changed since then, as negotiations and ransom payments have not stopped the criminals.\nIn a statement issued by the special adviser on media and communication to the governor, Muyiwa Adekeye, he gave context to a video clip where Governor el-Rufai was seen advocating for all options to ensure the release of the abducted Chibok girls in 2014.\nThe statement explained that, President Jonathan-led administration denied or doubted that the Chibok girls abduction happened, adding “That was the context under which civic pressures were brought on the government.’’‘’Nigeria’s journey since the 2014 Chibok tragedy has proven that the solution to violent crimes, including terrorism and banditry, is a robust response from the state and its coercive agencies,” he said.\nADVERTISEMENTHe added that paying of ransoms make criminals “to press ahead for a surrender of the public treasury to them.", "link": "https://leadership.ng/insecurity-we-cant-surrender-kaduna-to-criminals-el-rufai-declares/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["criminals", "governor", "state", "cant", "girls", "surrender", "elrufai", "kaduna", "security", "insecurity", "ransom", "declares", "paying", "chibok", "statement"]}
{"title": "Insecurity: 109 Senators To Meet Buhari", "summary": "He said: “Today, we are talking about them occupying Niger state in the manner that have been given earlier by the mover of the motion.\n“[And] it seems like the federal government is handling this security situation with kid gloves.\nThat is the home base of our leader here (Senate President) and the Inspector General of Police’s home.\nToday, I cannot travel from here to Kaduna or Niger State where I was born.\n“There’s no arm of government that’s not concerned about the security situation of the country, everyone is concerned.", "link": "https://leadership.ng/insecurity-109-senators-to-meet-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["senate", "state", "president", "meet", "niger", "national", "local", "senators", "security", "insecurity", "apc", "buhari", "situation", "areas", "109"]}
{"title": "Photos: Nollywood icon, Ejike Asiegbu visits DAYLIGHT Dome", "summary": "You might also like", "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ejike", "asiegbu", "daylight", "nollywood", "dome", "icon", "visits", "photos"]}
{"title": "Insecurity: Kano government closes down school over fear of attack", "summary": "Kindly Share This Story:By Abdulmumin MurtalaThe Kano state government has announced the closure of Bagauda Technical College with immediate effect for fear of possible security breach.\nKano State Government has directed for the immediate closure of Bagauda Technical College following what it described as disturbing security reports and the need to protect lives of students and staff of the school.\n“Following disturbing security reports, we hereby announce the immediate closure of Bagauda Technical College to protect the lives of students and staff of the college“We call on parents and guardians to immediately evacuated their children from the school while they await further instructions.\n“I wish to express appreciation to the state government parents and guardians for their unflinching support and cooperation on government’s policies and directives especially on security-related matters” the commissioner stated while addressing newsmen.\nVanguard News NigeriaKindly Share This Story:", "link": "https://www.vanguardngr.com/2021/04/insecurity-kano-government-closes-down-school-over-fear-of-attack/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "fear", "immediate", "share", "state", "security", "students", "school", "attack", "college", "closure", "insecurity", "technical", "bagauda", "kano", "closes"]}
{"title": "Indigenous plagiarism detection software launched in Abuja", "summary": "Kindly Share This Story:By Joseph Erunke – AbujaAn indigenous software developed to detect intellectual property theft has been launched in the country.\nThe plagiarism detection software, named “EagleScan”, is aimed at tackling problems associated with academic research verification, authentication as well as validation.\nSpeaking as the Special Guest at the public presentation and launching of the EagleScan Plagiarism Detection Software, in Abuja, Tuesday,Vice President Yemi Osinbajo described it as an initiative that announces zero tolerance for plagiarism.\nHe explained: “The EagleScan Plagiarism Detection Software integrates global open source and closed source repositories, local Open Education Repositories and it allows users to validate titles abstracts and generate originality report”.\n“Having the software is one aspect of the battle against plagiarism, universities must take concrete steps to institutionalise anti-plagiarism policy that forbids all aspects of the intellectual theft”.", "link": "https://www.vanguardngr.com/2021/04/indigenous-plagiarism-detection-software-launched-in-abuja/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["detection", "plagiarism", "eaglescan", "president", "universities", "higher", "prof", "education", "national", "research", "indigenous", "launched", "software", "abuja"]}
{"title": "Boko Haram: Governor Buni condemns attack in Geidam", "summary": "The governor of Yobe State, Mai Mala Buni has condemned the attack on Gaidam community by the Boko Haram insurgents, where properties worth millions of naira were destroyed and thousands of people displaced.\nThe governor stated this at a special security meeting with government officials, traditional rulers and security personnel at the Government House, Damaturu.\nGovernor Buni said that more troops were to be deployed to Gaidam township to protect peoples lives and property.\nAccording to him, the deployment of more troops to the border community was directed on sunday by the Chief of Defence staff, General Luky Irabo.\nOn the meeting with Chief of Defence staff, Gen. Luky Irabo, he said, he discussed with him, the need to deploy more soldiers to Gaidam.", "link": "https://dailypost.ng/2021/04/27/boko-haram-governor-buni-condemns-attack-in-geidam/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "chief", "haram", "condemns", "governor", "security", "buni", "geidam", "attack", "need", "meeting", "gaidam", "border", "troops", "secure", "boko", "state"]}
{"title": "Banditry: Matawalle directs immediate redeployment of security operatives to affected communities", "summary": "Zamfara State Governor, Hon.\nBello Mohammed Matawalle, has directed that security operatives be redeployed to areas affected by bandit activities.\nMatawalle stated this when he visited the IDPs camp at Unguwar Danbaba in Tsunami area of Gusau Local Government Area of Zamfara State on Tuesday.\nThe Governor said he was saddened and disturbed by the resurgence of banditry activities that resulted in having an IDP Camp in Gusau, the state capital.\nSpeaking earlier, one of the IDPs’ leaders, Mallam Muhammadu Shehu, expressed their happiness over the governor’s visit and requested for redeployment of more security personnel to the affected communities to enable them return to their respective communities.", "link": "https://dailypost.ng/2021/04/27/banditry-matawalle-directs-immediate-redeployment-of-security-operatives-to-affected-communities/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "redeployment", "support", "immediate", "gusau", "state", "security", "governor", "banditry", "area", "alhaji", "directs", "operatives", "zamfara", "affected", "return", "communities", "matawalle"]}
{"title": "BBNaija star Alex admits being caged as a celebrity", "summary": "By Adeniyi AdewoyinFormer housemate of the Big Brother Naija show, Alex Asogwa, has said that her celebrity status makes her feel caged and rebellious.\nThe reality show star said this during a Question and Answer session with her fans on her Instagram stories.\n“Caged, rebellious but strong-willed as I love my freedom and peace and I will protect it by doing me the right way,” she responded when asked how she feels being a celebrity.\nA fan asked if it is right to marry while broke and she said “I believe everyone should strive to stand alone.\nA would-be-husband that’s very rich should check that you put in your best to not be broke and help you stand on your own even before marriage since he is rich.", "link": "https://thenationonlineng.net/bbnaija-star-alex-admits-being-caged-as-a-celebrity/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["admits", "broke", "marriage", "alex", "star", "way", "wouldbehusband", "asked", "right", "stand", "fans", "thats", "rich", "bbnaija", "caged", "celebrity"]}
{"title": "3Lions unveils new single Show Me Love", "summary": "By Chinyere OkoroaforThree lions Records, a new record label in Lagos has unveiled a new single titled Show Me Love.\nThe song features three music acts under the label, Chukwemeka Robert aka Bob Em, Timothy Wariso aka Tim Wason and Frederick Chukwudi aka Kayana.\nAccording to the Chairman of the label, Dr. Chukwemeka Linus, the hit song portrays the acts’ love for creativity, passion for music, proof of originality, skills and eclectic taste for music.\nHe noted that the new record is with reference to the effects of the pandemic on people and the economy.\nLinus said Bob Em, who hails from Anambra State, is a songwriter, music composer, Afrobeat singer and entrepreneur, whose music depicts calmness, openness and confidence.", "link": "https://thenationonlineng.net/3lions-unveils-new-single-show-me-love/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["3lions", "song", "aka", "unveils", "label", "creativity", "record", "chukwemeka", "bob", "em", "love", "music", "single"]}
{"title": "CAN accuses Muslim leaders of fuelling religious crisis", "summary": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has accused some Muslim leaders and preachers of deriving pleasure in statements, preaching and other actions that could trigger religious war in Nigeria.\nCAN was specifically concerned that some of the Islamic preachers and Muslim leaders, particularly in Kwara State, seem to be enjoying the support of the government which has emboldened them to continue in their extremist actions.\nThis was primarily to tempt peace-loving Christians into a religious crisis.\nIt is time we advised some Muslim leaders in the country to stop fishing in troubled waters with a view to provoking Christians whom they share the same neighbourhood with.\nThis should stop.”CAN appealed to Kwara State government to, immediately, order the relocation of the controversial mosque and the Islamic centre, in order to prevent the crisis being deliberately provoked by some Islamic leaders and followers in the country.", "link": "https://www.sunnewsonline.com/can-accuses-muslim-leaders-of-fuelling-religious-crisis/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["mosque", "violence", "islamic", "crisis", "christians", "actions", "religious", "leaders", "fuelling", "accuses", "muslim", "kwara", "state"]}
{"title": "El-Rufa’i, Tambuwal call for collective action against banditry", "summary": "Governor Nasir El-Rufa’i of Kaduna State and Sokoto State Governor Aminu Tambuwal have stressed the need for states to cooperate in tackling the menace of banditry and kidnapping.\nThe two governors took the stand in Sokoto, when El-Rufai visited to condole with Tambuwal over the death of Hajiya Aishatu, daughter of the late premier of Northern Nigeria, Sir Ahmadu Bello.\nEl-Rufa’i, however, expressed concern over the rising cases of kidnapping and banditry in the zone and its effect on the public.\n“The bandits entered from Kuchi axis around 6pm on motorcycles and moved towards Chibani, snatching motorcycles from residents from one village to village.\nBuni made his position known during an emergency security meeting in Damaturu.", "link": "https://www.sunnewsonline.com/el-rufai-tambuwal-call-for-collective-action-against-banditry/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["collective", "bandits", "challenges", "security", "governor", "banditry", "local", "elrufai", "meeting", "village", "came", "tambuwal", "sokoto", "action", "state"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["solutions", "buhari", "seek", "saraki", "tells", "president", "help", "issue", "security", "statement", "need", "national", "finding", "insecurity", "state"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["states", "seeks", "buhari", "tackle", "climate", "paris", "blinken", "help", "challenges", "security", "nigeria", "president", "countries", "meeting", "united", "africa"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["building", "flaunts", "professorship", "peace", "st", "kogi", "governor", "school", "course", "resources", "uk", "nonexistent", "management", "human", "thomasabecket", "university", "honorary", "nondegeee"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["building", "flaunts", "professorship", "peace", "st", "kogi", "governor", "school", "course", "resources", "uk", "nonexistent", "management", "human", "thomasabecket", "university", "honorary", "nondegeee"]}
{"title": "Corps member accuses Ogun school principal of assault", "summary": "A video has surfaced and gone viral wherein a corps member alleged that she was assaulted by the principal of a school she was posted to for her place of primary assignment (PPA) in Ogun state.\nThe corps member claimed that when she met the school principal, he started insulting her during their conversation.\nWhile it remained unclear what led to the face-off between the pair, she alleged that the principal also beat her.\nShe went ahead to accuse other staff of the school of backing the principal during the incident.\nAll the staff in the school are also supporting him.”The principal could, however, be heard in the video dismissing the corps member’s claim.", "link": "https://lifestyle.thecable.ng/corps-member-accuses-ogun-school-principal-of-assault/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "stone", "assault", "thecable", "posted", "school", "post", "beat", "corps", "ogun", "video", "member", "accuses", "principal"]}
{"title": "Beyoncé and I won’t force our kids into showbiz, says Jay-Z", "summary": "Jay-Z, US rapper and record producer, says he and Beyoncé, his wife, will not force their kids into showbusiness.\nAdvertisementThe 51-year-old spoke with The Times about life in quarantine with his wife, Blue Ivy, their 9-year-old daughter, and their twins Rumi and Sir.\nHe said he’s aware of the legacy his children may feel like they have to live up to but added that he and Beyoncé have a plan.\nI have no idea, right?\nBeyond music, Jay-Z has continued to gain influence as an entrepreneur.", "link": "https://lifestyle.thecable.ng/beyonce-and-i-wont-force-our-kids-into-showbiz-says-jay-z/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["showbiz", "im", "wont", "loving", "beyoncé", "wife", "jayz", "really", "ivy", "idea", "kids", "force", "music", "right"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["nigeria", "bringing", "healthcare", "nwokoye", "rural", "itoro", "access", "clafiya", "medical", "inoyo", "jennie", "health", "hospitaltohome", "plan", "services", "communities"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["scams", "umpire", "number", "nigerias", "data", "bank", "access", "banks", "customers", "save", "nibss", "fintechs", "fair", "bvn"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["come", "govt", "rescue", "appealing", "students", "dont", "force", "soldiers", "student", "sent", "sale", "video", "appeal", "yusuf", "free", "kidnapped"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["car", "siblings", "recover", "peddlers", "arrest", "warri", "drug", "bodies", "phones", "suspects", "corpses", "decomposing", "recovered", "suspected", "led", "abraka", "delta"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["observer", "peace", "country", "nigeria", "state", "security", "governor", "lasting", "level", "god", "fairness", "equity", "ortom", "insecurity", "justice", "nigerian"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/28/2021", "keywords": ["cattle", "outlawed", "jan", "immediate", "highways", "wish", "underaged", "nightgrazing", "register", "prohibited", "movement", "19", "web"]}
{"title": "Abiodun seeks collaboration with Ogun indigenes in military, others to tackle insecurity", "summary": "Kunle IdowuThe Ogun State governor, Dapo Abiodun, has expressed the readiness of his administration to collaborate with indigenes of the state who are high ranking officers in the military and paramilitary agencies to find solution to the issues of insecurity.\nThe governor equally said that his administration would be hosting the officers to motivate and celebrate their achievements.\nHe made this known on Monday when he received the new Brigade Commander, 35 Artillery Brigade, Alamala, Abeokuta, Brigadier General Adewale Abiodun Adekoya, in his office at Oke Mosan, Abeokuta.\nAdekoya is an indigene of Ogun state from Ago-Iwoye in the Ijebu North Local Government Area of the state.\nIn his remarks, the former Brigade Commander, Joseph Amadasun appreciated the state governor for his unalloyed support to security agencies in the state, attributing his success to the continuous support of the state governor.", "link": "https://hallmarknews.com/abiodun-seeks-collaboration-with-ogun-indigenes-in-military-others-to-tackle-insecurity/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["seeks", "support", "tackle", "commander", "administration", "brigade", "act", "security", "military", "collaboration", "governor", "necessary", "ogun", "insecurity", "indigenes", "abiodun", "state"]}
{"title": "PIB, New Electoral Law To Be Ready May, June – Lawan", "summary": "BY BODE GBADEBO, AbujaThe Senate President, Senator Ahmad Lawan, has said that the National Assembly would pass the Petroleum Industry Bill (PIB) into law by next month while the Electoral Act Ammendment Bill would be passed into law by June.\n“The National Assembly is working tirelessly to ensure that we pass the PIB which is a very important piece of legislation for our country.\nOur design and desire is that we are able to pass the Bill before the end of May.\nWe are hopeful that we will be able to pass the Bill before the end of June,” Lawan said.\nEarlier in his remarks before the meeting went into a closed session, the visiting UK minister indicated interest in the progress made by the National Assembly on some Bills such as the Electoral Act Amendment Bill and PIB.", "link": "https://leadership.ng/pib-new-electoral-law-to-be-ready-may-june-lawan/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["assembly", "electoral", "support", "law", "bill", "pass", "senate", "national", "believe", "working", "pib", "ready", "lawan", "able"]}
{"title": "Declare State Of Emergency On Security, Reps Tell Buhari", "summary": "By ADEBIYI ADEDAPO, AbujaThe House of Representatives on Tuesday urged President Muhammadu Buhari to declare a state of emergency in the security sector.\n“Considering the security situation, the President should immediately declare a State of Emergency on Security so as to fast track all measures to ensure the restoration of peace in the country,” Gbajabiamila said.\nADVERTISEMENTThey also urged government to provide emergency relief to all communities that have been adversely affected by recent attacks across the country.\n“The President should as a matter of urgency, ensure financial autonomy to Local Government Councils to guarantee their functionality to serve the local populace.\n“The Federal Government should ensure the protection of National Infrastructure assets, particularly the Shiroro and Kainji Dams in Niger State.", "link": "https://leadership.ng/declare-state-of-emergency-on-security-reps-tell-buhari/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["buhari", "reps", "country", "house", "tell", "president", "security", "urged", "emergency", "terrorism", "ensure", "declare", "local", "state"]}
{"title": "Imah, Orika, Others Enjoin Mbala People To Participate Actively In Abia Politics", "summary": "Edozie Richard Imah has called on the people of Mbala Isuochi in the Umunneochi Local Government Area of Abia State to wake up from their slumber and participate actively in the build-up to the 2023 general elections in Nigeria.\nImah spoke at the first Mbala political summit which held recently at his palatial home at Umuobasi Mbala Isuochi, in the Umunneochi Local Government Area of Abia State.\n“The political summit is the first in the series lined up this year.\nIn a keynote address at the occasion, former governorship aspirant in Abia State, Surv.\nOrika noted that the greatest challenge faced by Mbala people in the politics of Umunneochi and indeed, Abia State is the people’s apathy towards politics and insisted that as long as this attitude is sustained, Mbala will continue to lag behind in Umunneochi nay Abia politics.", "link": "https://daylightng.com/imah-orika-others-enjoin-mbala-people-to-participate-actively-in-abia-politics/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["support", "orika", "mbala", "enjoin", "participate", "political", "politics", "umunneochi", "community", "actively", "summit", "isuochi", "abia", "imah", "state"]}
{"title": "Insecurity: Tearful Ortom, Reps, call for emergency", "summary": "Mr. President must rise.\nMr. President must rise to address the nation himself, not his aides.\nThe body language, the action and inaction of Mr. President shows that he is only the President of Fulani people.\nHis body language is what is being played out; Mr President gives orders, another person, a minister comes and counters.\nI am not the Commander-in-Chief of the Armed Forces, Mr President is the Commander-in-Chief of the Armed Forces.", "link": "https://www.vanguardngr.com/2021/04/insecurity-tearful-ortom-reps-call-for-emergency/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "idps", "house", "emergency", "mr", "state", "country", "states", "governor", "insecurity", "president", "reps", "tearful", "situation", "ortom"]}
{"title": "NPA appoints 4 GMs and 8 AGMs", "summary": "Kindly Share This Story:By Providence AdeyinkaTHE Nigerian Ports Authority, NPA, has announced the appointment of four new general managers and eight assistant general managers.\nThe newly appointed general managers are: Olaseni Alakija, who becomes general manager, corporate and strategic communications, Patricia Aboh (Mrs), general manager Servicom; Engr.\nSylvester Nwankwo, general manager, MD’s Office and Engr (Mrs.) Anthonia Ohagwa, general manager, ICT.\nOthers include Benjamin Oluyori; AGM, Enterprise and Risk Management, Ruth Boyo (Mrs), AGM, Investments, Engr.\nWith these appointments, the Authority has a total number of 21 GMs and 60 AGMs.", "link": "https://www.vanguardngr.com/2021/04/npa-appoints-4-gms-and-8-agms/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["npa", "managers", "gms", "agm", "appoints", "strategic", "general", "communications", "manager", "corporate", "authority", "mrs", "agms", "engr"]}
{"title": "Insecurity: Nigerians will storm Abuja, force Buhari out of Aso Rock", "summary": "The situation in Niger State is fast becoming hopeless, as two LGAs, Munya and Shiroro, have practically become bandits’ killing fields.\nRespected Nobel Laureate, Professor Wole Soyinka, shortly after the killing of three of the abducted students of Greenfield University, pointedly told President Buhari to swallow his pride and seek for help!\nThey also claimed that the security situation in the country had improved from what it used to be under the Goodluck Jonathan administration that ended on May 29, 2015.\nHe said: “I am confirming that there are Boko Haram elements in Niger State, around Kaure.\nHe said: “It is obvious that President Muhammadu Buhari and the All Progressives Congress government need help.", "link": "https://dailypost.ng/2021/04/28/insecurity-nigerians-will-storm-abuja-force-buhari-out-of-aso-rock-pastor-giwa/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "haram", "storm", "state", "country", "force", "nigerians", "buhari", "abuja", "insecurity", "president", "boko", "rock", "help", "situation", "aso"]}
{"title": "Pantami is part of Buhari's plan to islamise Nigeria", "summary": "The situation in Niger State is fast becoming hopeless, as two LGAs, Munya and Shiroro, have practically become bandits’ killing fields.\nAccording to Soyinka, Nigeria is at war but the government continues to pretend that “these are mere birth-pangs of a glorious entity”.\nThey also claimed that the security situation in the country had improved from what it used to be under the Goodluck Jonathan administration that ended on May 29, 2015.\nHe said: “I am confirming that there are Boko Haram elements in Niger State, around Kaure.\nHe is the President of the Federal Republic of Nigeria and over the 250 nationalities that are in this country; Mr President is their President, we all voted him.", "link": "https://dailypost.ng/2021/04/28/pantami-is-part-of-buharis-plan-to-islamise-nigeria-massob/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "haram", "pantami", "state", "country", "islamise", "buhari", "nigerians", "president", "boko", "help", "buharis", "situation", "plan", "nigeria"]}
{"title": "‘10m jobs can come from mushroom subsector’", "summary": "The President of the group, Chief Michael Awunor, said mushroom can increase the country’s non-oil earnings.\nAwunor spoke at a briefing on the first National Mushroom Summit/ Exhibition with the theme, ‘Harnessing the nation non-oil commodities through the development of mushroom value chain’ scheduled for Abuja.\nADVERTISEMENTHe said the world production for mushroom in 2018 was 8.99million tons with China producing 46 per cent of global output.\nThe global market for mushroom is quite huge and growing exponentially.\nHe also said the growing market for mushroom is due to the rising awareness for healthy foods which made mushroom highly preferred substitute for meat in protein, vitamin and minerals.", "link": "https://thenationonlineng.net/10m-jobs-can-come-from-mushroom-subsector/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["10m", "value", "growing", "chain", "mushroom", "market", "global", "come", "subsector", "production", "tons", "increase", "nonoil", "jobs"]}
{"title": "Boko Haram may overrun Abuja, Senators warn", "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.", "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["haram", "target", "senate", "overrun", "state", "abuja", "communities", "president", "boko", "senators", "warn", "niger", "terrorists"]}
{"title": "Insecurity: Buhari begs international community for support", "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, urged the United States to reconsider relocating its Africa Command (AFRICOM) from Stuttgart, Germany to Africa, nearer the Theatre of Operation, and implored the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers to other countries.\nA statement by Special Adviser to the President on Media and Publicity, Femi Adesina, quoted Buhari as stating this in a virtual meeting with US Secretary of State, Mr. Anthony Blinken.\nCompounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes.\n“Nigeria attaches great importance to its relations with the United States.\nPresident Buhari noted that Nigeria remains resolute in its commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.", "link": "https://www.sunnewsonline.com/insecurity-buhari-begs-international-community-for-support/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "nigeria", "partners", "support", "nations", "united", "buhari", "begs", "states", "insecurity", "president", "international", "muslim", "africa", "community"]}
{"title": "N’Assembly Laments over Worsening Insecurity as Buhari Seeks US’ Help", "summary": "In the Senate, many senators fumed over the worsening insecurity and mandated its leadership to book an appointment with the president and service chiefs to discuss the issue and proffer solutions.\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes.\nFemi Gbajabiamila, read the resolutions of the lawmakers after a three-hour executive session yesterday to discuss the deteriorating security situation in the country.\nAtiku, Saraki Proffer SolutionsMeanwhile, a former Senate President, Dr. Bukola Saraki, has advised Buhari to seek help to tackle the increasing insecurity in the country.\nHe said: “It is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.", "link": "https://www.thisdaylive.com/index.php/2021/04/28/nassembly-laments-over-worsening-insecurity-as-buhari-seeks-us-help/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "seeks", "senate", "nassembly", "house", "state", "worsening", "buhari", "laments", "insecurity", "president", "service", "help", "africa", "situation", "nigeria"]}
{"title": "Tambuwal, El-Rufai Rally North-west States to Combat Banditry", "summary": "By John ShiklamKaduna State Governor, Mallam Nasir el-Rufai, and his Sokoto State counterpart, Hon.\nAminu Tambuwal, yesterday called for cooperation among the seven states in the North-west in tackling banditry and kidnapping.\nHe stated that governors of the seven states in the North-west have been working closely with President Muhammad Buhari to end banditry and kidnapping in the zone.\nTambuwal said the latest was the murder of a Divisional Police Officer (DPO) and eight policemen in Kebbi on Monday and the recent attack on Dange Local Government of Sokoto State, during which lives were lost.\nThe Kaduna State Government said it had been consistently transparent about its security challenges.", "link": "https://www.thisdaylive.com/index.php/2021/04/28/tambuwal-el-rufai-rally-north-west-states-to-combat-banditry/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "northwest", "rally", "banditry", "state", "statement", "sokoto", "states", "criminals", "kaduna", "combat", "tambuwal", "elrufai", "surrender"]}
{"title": "Corps member accuses Ogun school principal of assault", "summary": "A video has surfaced and gone viral wherein a corps member alleged that she was assaulted by the principal of a school she was posted to for her place of primary assignment (PPA) in Ogun state.\nThe corps member claimed that when she met the school principal, he started insulting her during their conversation.\nWhile it remained unclear what led to the face-off between the pair, she alleged that the principal also beat her.\nShe went ahead to accuse other staff of the school of backing the principal during the incident.\nAll the staff in the school are also supporting him.”The principal could, however, be heard in the video dismissing the corps member’s claim.", "link": "https://lifestyle.thecable.ng/corps-member-accuses-ogun-school-principal-of-assault/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["accuses", "beat", "thecable", "school", "member", "principal", "post", "corps", "video", "stone", "staff", "ogun", "posted", "assault"]}
{"title": "Beyoncé and I won’t force our kids into showbiz, says Jay-Z", "summary": "Jay-Z, US rapper and record producer, says he and Beyoncé, his wife, will not force their kids into showbusiness.\nAdvertisementThe 51-year-old spoke with The Times about life in quarantine with his wife, Blue Ivy, their 9-year-old daughter, and their twins Rumi and Sir.\nHe said he’s aware of the legacy his children may feel like they have to live up to but added that he and Beyoncé have a plan.\nI have no idea, right?\nBeyond music, Jay-Z has continued to gain influence as an entrepreneur.", "link": "https://lifestyle.thecable.ng/beyonce-and-i-wont-force-our-kids-into-showbiz-says-jay-z/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["idea", "right", "ivy", "showbiz", "im", "jayz", "force", "beyoncé", "wife", "really", "loving", "wont", "music", "kids"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["itoro", "bringing", "medical", "clafiya", "communities", "access", "health", "hospitaltohome", "services", "jennie", "rural", "inoyo", "healthcare", "plan", "nwokoye", "nigeria"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["fintechs", "scams", "umpire", "save", "nibss", "bvn", "access", "nigerias", "customers", "bank", "data", "banks", "number", "fair"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["appealing", "appeal", "force", "student", "video", "rescue", "students", "kidnapped", "free", "sale", "come", "sent", "soldiers", "yusuf", "govt", "dont"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["suspects", "warri", "bodies", "decomposing", "recover", "recovered", "suspected", "phones", "abraka", "peddlers", "corpses", "car", "delta", "drug", "arrest", "siblings", "led"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["security", "god", "state", "country", "nigerian", "lasting", "fairness", "insecurity", "governor", "observer", "level", "equity", "peace", "justice", "ortom", "nigeria"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/28/2021", "keywords": ["prohibited", "cattle", "jan", "19", "register", "outlawed", "movement", "wish", "underaged", "highways", "nightgrazing", "web", "immediate"]}
{"title": "Abiodun seeks collaboration with Ogun indigenes in military, others to tackle insecurity", "summary": "Kunle IdowuThe Ogun State governor, Dapo Abiodun, has expressed the readiness of his administration to collaborate with indigenes of the state who are high ranking officers in the military and paramilitary agencies to find solution to the issues of insecurity.\nThe governor equally said that his administration would be hosting the officers to motivate and celebrate their achievements.\nHe made this known on Monday when he received the new Brigade Commander, 35 Artillery Brigade, Alamala, Abeokuta, Brigadier General Adewale Abiodun Adekoya, in his office at Oke Mosan, Abeokuta.\nAdekoya is an indigene of Ogun state from Ago-Iwoye in the Ijebu North Local Government Area of the state.\nIn his remarks, the former Brigade Commander, Joseph Amadasun appreciated the state governor for his unalloyed support to security agencies in the state, attributing his success to the continuous support of the state governor.", "link": "https://hallmarknews.com/abiodun-seeks-collaboration-with-ogun-indigenes-in-military-others-to-tackle-insecurity/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["security", "seeks", "collaboration", "military", "act", "support", "tackle", "state", "brigade", "governor", "insecurity", "ogun", "commander", "indigenes", "abiodun", "necessary", "administration"]}
{"title": "Insecurity: ADC Wants APC, FG to End Spate of Killing", "summary": "The African Democratic Congress (ADC) yesterday called on the All Progressive Congress ( APC ) led Federal goverment to end the spare of killings , banditry and kidnappings in varroius parts of the country.\n“ Today, the security situation in the country has come down to zero, the party in goverment must rise to end it now, we cannot afford to be losing innocent Nigerians , civilians, police officers and soldiers, the time for the governent to act is now.\nHe said” In 22 years of our democracy, PDP and APC have done so much damage to the peace, security and instability of Nigeria.\nIt appears that they now target to destroy the future of our Youths from Chibok school girls to the current Spate of kidnapping, killings and bizarre terrorist activities, it is time for APC and PDP to leave governance and save our country.\nADVERTISEMENT“Our hearts bleed for the youths that have been killed by bandits everywhere across Nigeria and especially, the Green Field University students that have become targets of daily murder and butchering, enough is enough", "link": "https://leadership.ng/insecurity-adc-wants-apc-fg-to-end-spate-of-killing/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["end", "security", "spate", "adc", "country", "party", "save", "goverment", "insecurity", "apc", "killing", "yesterday", "senseless", "fg", "youths", "wants", "killings"]}
{"title": "Declare State Of Emergency On Security, Reps Tell Buhari", "summary": "* Seek immediate recruitment into police, armed forces |By ADEBIYI ADEDAPO, AbujaThe House of Representatives on Tuesday urged President Muhammadu Buhari to declare a state of emergency in the security sector.\n“Considering the security situation, the President should immediately declare a State of Emergency on Security so as to fast track all measures to ensure the restoration of peace in the country,” Gbajabiamila said.\nThey also urged government to provide emergency relief to all communities that have been adversely affected by recent attacks across the country.\n“The President should as a matter of urgency, ensure financial autonomy to Local Government Councils to guarantee their functionality to serve the local populace.\n“The Federal Government should ensure the protection of National Infrastructure assets, particularly the Shiroro and Kainji Dams in Niger State.", "link": "https://leadership.ng/declare-state-of-emergency-on-security-reps-tell-buhari-2/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["security", "house", "emergency", "state", "country", "buhari", "tell", "local", "president", "terrorism", "urged", "reps", "declare", "ensure"]}
{"title": "Imah, Orika, Others Enjoin Mbala People To Participate Actively In Abia Politics", "summary": "Edozie Richard Imah has called on the people of Mbala Isuochi in the Umunneochi Local Government Area of Abia State to wake up from their slumber and participate actively in the build-up to the 2023 general elections in Nigeria.\nImah spoke at the first Mbala political summit which held recently at his palatial home at Umuobasi Mbala Isuochi, in the Umunneochi Local Government Area of Abia State.\n“The political summit is the first in the series lined up this year.\nIn a keynote address at the occasion, former governorship aspirant in Abia State, Surv.\nOrika noted that the greatest challenge faced by Mbala people in the politics of Umunneochi and indeed, Abia State is the people’s apathy towards politics and insisted that as long as this attitude is sustained, Mbala will continue to lag behind in Umunneochi nay Abia politics.", "link": "https://daylightng.com/imah-orika-others-enjoin-mbala-people-to-participate-actively-in-abia-politics/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["isuochi", "support", "actively", "state", "enjoin", "politics", "umunneochi", "abia", "orika", "imah", "summit", "participate", "political", "mbala", "community"]}
{"title": "Water scarcity in Borum: Community digs tube wells to meet water needs", "summary": "READ ALSO:So doing, they were able to restore the water facility of the clinic at least pending the government’s intervention to resolve the community’s water needs.\nIn contrast, in the rural areas, some 38% have access to a basic water service, 26% to limited water service, and an interesting 37% have no water service.\nIn hospitals or health centers around Nigeria, the report shows that 92% have an improved water source, while 8% have no water source.\nUNICEF defines Basic water supply as water from an Improved source within 30 minutes round trip collection time; while Limited water supply is water from an improved source over 30 minutes round trip collection time; Unimproved water supply on the other hand is water from an unimproved source that does not protect against contamination.\n“In 2017, 785 million people still lack a basic water service and among them 144 million people still collected drinking water directly from rivers, lakes and other surface water sources.", "link": "https://www.vanguardngr.com/2021/04/water-scarcity-in-borum-community-digs-tube-wells-to-meet-needs/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["borum", "tube", "wells", "digs", "phc", "health", "supply", "boreholes", "water", "facility", "scarcity", "service", "community", "source", "meet", "needs"]}
{"title": "IYC urged to shun planned protest over NDDC board", "summary": "Any attempt to put the board in place without concluding the ongoing investigations will derail the forensic audit.\n“As a former IYC President, I also want the board to be inaugurated.\nBut I have since observed that having a board has never been the problems of the NDDC.\nIf at the end of the audit, we have a responsible and accountable NDDC, then it is worth the wait.\nI urge all stakeholders and our Ijaw Youths to exercise more patience and allow the conclusion of this audit.", "link": "https://www.vanguardngr.com/2021/04/iyc-urged-to-shun-planned-protest-over-nddc-board/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["audit", "commission", "planned", "ijaw", "iyc", "protest", "board", "shun", "ongoing", "youths", "urged", "akwa", "nddc", "president"]}
{"title": "Insecurity: US AFRICOM will recolonise, turn Africa into Syria, Korea", "summary": "President Muhammadu Buhari has been warned against his recent call for the United States to relocate its US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, close to the Theatre of Operation.\nBuhari admonished the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\nBut Shehu Sani, a former lawmaker from Kaduna central senatorial district, described the plea as ‘unconscionable,’ and an open invitation for recolonization of Africa.\nThe call for the US to relocate its @USAfricaCommand HQ to Africa is unconscionable,” he tweeted.\nAccording to Sani, a lawmaker of the 8th national assembly, “The President’s call for World powers military HQ on African Soil is an open invitation for recolonization of Africa.", "link": "https://dailypost.ng/2021/04/28/insecurity-us-africom-will-recolonise-turn-africa-into-syria-korea-shehu-sani-warns-buhari/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["africom", "tell", "open", "korea", "sani", "recolonise", "relocate", "security", "africa", "hq", "warned", "insecurity", "syria", "turn", "recolonization", "unconscionable"]}
{"title": "BREAKING: Resign, Nigeria boiling", "summary": "Emmanuel Chukwuma, on Wednesday, asked the administration of President Muhammadu Buhari to leave the Government.\nArchbishop Chukwuma, at a press briefing to mark his 31st Episcopal ordination, said Buhari Government should step aside if it cannot pull the country out of the present security quagmire.\nHe said Nigerians had lost total confidence in Buhari’s administration and for that he should consider stepping aside to avoid pushing the country into a coup situation.\n“They should not move this country to coup situation.”He added that, “the Federal Government under Buhari has failed the nation, and we have no confidence any more on them.\n“We have lost confidence in the economy, we have lost confidence in the political system, we have lost confidence in governance, we have lost confidence in security and something must be done.", "link": "https://dailypost.ng/2021/04/28/breaking-resign-nigeria-boiling-archbishop-chukwuma-to-buhari/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["country", "resign", "confidence", "boiling", "aside", "buhari", "present", "nigeria", "coup", "chukwuma", "security", "breaking", "lost", "leave"]}
{"title": "VIDEO: Bandits release new video of abducted Kaduna students", "summary": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator.", "link": "http://community.thenationonlineng.net/forum/video-bandits-release-new-video-of-abducted-kaduna-students", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["kaduna", "nation", "contact", "system", "hello", "bandits", "abducted", "communityplease", "students", "newspaper", "enable", "need", "video", "release", "settings", "javascript"]}
{"title": "Teni: It had to be Davido", "summary": "Singer, songwriter and entertainer Teniola Apata, popularly known as Teni reveals in a live chat why she featured just Davido in her very first album.\nHer debut album ‘WONDALAND’ was crafted for over two years in cities like London, New York, Orlando, Ondo, Lagos and Abuja; and features guest appearances from DMW boss, Davido.\nWhen asked why she featured just one person in her 17-track album, the talented singer who has won quite a number of awards excitedly said: “It had to be Davido.\nDavido is such an amazing guy and you know…Big ups to everybody else, cause everybody else shows me love.\n“But David is special because I’ve known David since Atlanta.", "link": "http://community.thenationonlineng.net/forum/teni-it-had-to-be-davido", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["youre", "david", "known", "words", "everybody", "featured", "album", "singer", "york", "davido", "teni"]}
{"title": "Buhari presides over 43rd virtual cabinet meeting", "summary": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is presiding over the 43rd virtual meeting of the Federal Executive Council (FEC) at the First Lady Conference Room, Presidential Villa, Abuja.\nVice President Yemi Osinbajo, Secretary to the Government of the Federation Boss Mustapha and Chief of Staff to the President Ibrahim Gambari are physically attending the meeting, which started at 10:00 am.\nSeven ministers are physically attending the meeting.\nThey include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed; Justice, Abubakar Malami and Foreign Affairs, Geoffery Onyeama.\nThe Head of Service of the Federation, Dr. Folasade Yemi-Esan and other Ministers are participating in the weekly cabinet meeting from their various offices in Abuja.", "link": "https://www.sunnewsonline.com/buhari-presides-over-43rd-virtual-cabinet-meeting/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["meeting", "43rd", "buhari", "ministers", "physically", "federal", "presides", "attending", "federation", "affairs", "cabinet", "minister", "virtual", "mohammed", "president"]}
{"title": "Boko Haram may overrun Abuja, Senators warn", "summary": "“They have kidnapped many, their wives seized from them and forcefully attached to Boko Haram members.\nAbuja is next if Niger State is not rescued by our security forces.”A former army Colonel and senator from Gombe State, Amos Bulus, said Boko Haram terrorists were already moving into Abuja from border communities and warned of grave consequences if nothing was done to checkmate them.\n“The way these bandits and Boko Haram terrorists are moving from every corner into Abuja, something big will soon happen.\nEnough is enough.”Former deputy senate president, Ike Ekweremadu, in his submission, said the government had lost legitimacy to lead having failed in its primary responsibility of securing lives of citizens.\nAfter a long debate, the Senate resolved that Senate President, Ahmad Lawan, should lead other principal officers of the upper legislative chamber to meet President Buhari on the issue.", "link": "https://www.sunnewsonline.com/boko-haram-may-overrun-abuja-senators-warn/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["senators", "senate", "communities", "niger", "abuja", "president", "target", "warn", "terrorists", "overrun", "haram", "state", "boko"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["school", "uk", "st", "resources", "professorship", "thomasabecket", "honorary", "management", "university", "governor", "flaunts", "peace", "building", "nonexistent", "course", "kogi", "human", "nondegeee"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["school", "uk", "st", "resources", "professorship", "thomasabecket", "honorary", "management", "university", "governor", "flaunts", "peace", "building", "nonexistent", "course", "kogi", "human", "nondegeee"]}
{"title": "Osinbajo: Value4Dairy consortium set to boost domestic milk production", "summary": "Vice-President Yemi Osinbajo says the Value4Dairy consortium, a group of five global players in the dairy industry, will increase domestic milk production capacity.\nAdvertisementThe consortium is made up of FrieslandCampina WAMCO, URUS, Barenbrug and Agrifirm.\nThe CBN, however, exempted companies that have commenced investments in local milk production as part of the bank’s backward integration plan.\nAdvertisementSpeaking at the launch of the consortium on April 20, Osinbajo commended the commitment of the companies to improving local production of milk and other dairy products.\nAdvertisementHe said the consortium brings to the dairy sector specialised milk collection and processing (FrieslandCampina WAMCO), better breeding (URUS), proper roughage production (Barenbrug) and fitting animal feed (Agrifirm).", "link": "https://www.thecable.ng/osinbajo-value4dairy-consortium-set-to-boost-domestic-milk-production", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["consortium", "wamco", "milk", "osinbajo", "frieslandcampina", "industry", "dairy", "companies", "boost", "set", "sector", "domestic", "production", "value4dairy", "local"]}
{"title": "Saraki to Buhari: Seeking help to tackle insecurity not a sign of weakness", "summary": "Bukola Saraki, former senate president, has advised the Buhari administration to seek external help to address Nigeria’s worsening security challenges.\nAdvertisementSaraki said seeking assistance in the present situation is “not a sign of weakness” even if done across party lines.\nThe Peoples Democratic Party (PDP) chieftain was speaking via a statement on Tuesday, in which he lamented nation’s security woes.\nTheCable had reported how Nigeria recorded more than 10 security incidents on Monday as killings and attacks continued across the country.\nSaraki said there is a need for President Muhammadu Buhari to convene a security meeting of all those who could help solve the challenge.", "link": "https://www.thecable.ng/saraki-to-buhari-seeking-help-to-tackle-insecurity-not-a-sign-of-weakness", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["tackle", "saraki", "help", "buhari", "nigeria", "muhammadu", "seeking", "security", "sign", "serving", "party", "weakness", "suggestion", "nations", "include", "insecurity", "president"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["itoro", "bringing", "nwokoye", "communities", "plan", "medical", "inoyo", "nigeria", "clafiya", "health", "access", "services", "rural", "jennie", "healthcare", "hospitaltohome"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["fintechs", "scams", "bank", "data", "customers", "fair", "access", "number", "save", "nibss", "banks", "nigerias", "bvn", "umpire"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["dont", "appealing", "soldiers", "free", "kidnapped", "student", "come", "sent", "students", "yusuf", "rescue", "force", "video", "appeal", "govt", "sale"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["suspects", "peddlers", "recover", "arrest", "siblings", "suspected", "recovered", "led", "bodies", "delta", "car", "warri", "phones", "drug", "abraka", "decomposing", "corpses"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["country", "fairness", "observer", "lasting", "god", "nigeria", "nigerian", "equity", "security", "peace", "justice", "level", "governor", "ortom", "state", "insecurity"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/28/2021", "keywords": ["prohibited", "jan", "outlawed", "underaged", "cattle", "movement", "wish", "immediate", "nightgrazing", "highways", "web", "register", "19"]}
{"title": "Polaris Bank declares N28.9bn profit in 2020 financial year", "summary": "OBINNA EZUGWUPolaris Bank Limited has declared N28.9 billion profit before tax for full year 2020 ended December 31, a 4% growth from the corresponding period of 2019.\nThe performance, the bank’s financial statements said, is driven by the combination of the significant reduction in interest expense due to its pursuit of low interest-bearing deposits as well as lowering impairment charges on loans and other financial assets.\nThe Bank recorded Return on Asset (ROA) and Return on Equity (ROE) of 2.4% and 29.4% respectively which favorably place the Bank as a key player in the industry.\nCommenting on the Bank’s performance, the Managing Director/Chief Executive Officer (MD/CEO) of Polaris Bank Limited, Mr. Innocent C. Ike who took over in the course of the year from Mr. Tokunbo Abiru explained that “Polaris Bank has achieved significant milestones since its inception in September 21, 2018 when we started this journey.\n“We have since grown to earn the confidence of the banking publics, offering quality banking services at the cutting edge of technology”.", "link": "https://hallmarknews.com/polaris-bank-declares-n28-9bn-profit-in-2020-financial-year/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["bank", "declares", "polaris", "loans", "quality", "performance", "return", "2020", "mr", "banks", "n289bn", "significant", "financial", "profit", "deposits"]}
{"title": "How Baba Ijesa Defiled My Foster Daughter – Comedienne, Princess", "summary": "BY BODE GBADEBOPopular comedienne, Oluwadamilola Adekoya, popularly known as Princess, has narrated how fellow practitioner in the Nollywood, Olarenwaju Omiyinka, a.k.a.\nBaba Ijesha, was caught sexually molesting her 14-year-old adopted daughter.\nAccording to her, Baba Ijesha betrayed her trust and years of mentorship by his shameful act.\n“Baba Ijesha had challenges and he needed my help in getting into UNILAG.\n“I decided to call Baba Ijesha but my friend asked us to be wise, that people will want to support Baba Ijesha If we don’t have enough evidence.", "link": "https://leadership.ng/how-baba-ijesa-defiled-my-foster-daughter-comedienne-princess/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["ijesa", "cctv", "come", "baba", "comedienne", "house", "foster", "suspect", "defiled", "children", "set", "daughter", "princess", "ijesha"]}
{"title": "Secession, Restructuring Clamours Won’t Create Better Life For Nigerians – Sowore", "summary": "By Tunde Oguntola, AbujaThe African Action Congress (AAC) has said the clamour for restructuring, power rotation and secession by various groups in the country would not meet the long-term aspirations of Nigerians.\nThe AAC chairman urged the Independent National Electoral Commission (INEC) to stop efforts at sacking the state chairman of the party.\nAccording to him, “Secession is lawful but too expensive, divisive, and doubtful.\nWe have also passed the stage of restructuring the country if restructuring means going back to the 1963 constitution while having the same people in power.\n“Only those who believe we can vote out bad leaders without a fight will simply wait for a power rotation in 2023.", "link": "https://leadership.ng/secession-restructuring-clamours-wont-create-better-life-for-nigerians-sowore/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["country", "better", "lawful", "nigerians", "wont", "secession", "restructuring", "clamours", "various", "aac", "national", "wait", "create", "life", "sowore", "simply", "chairman"]}
{"title": "UFC: Usman, McGregor in war of words", "summary": "There might be a clash in the future between reigning UFC welterweight champion Kamaru Usman and Conor McGregor after both superstars reignited their rivalry on social media on Monday.\nUsman defended his welterweight title for the fourth time with a second round knockout victory over Jorge Masvidal at the UFC 261 at the VyStar Veterans Memorial Arena in Jacksonville, Florida, on Sunday in front of 15,000 screaming fans.\nMcGregor has created a knack for taunting Usman after every win the Nigerian records, claiming he will one day come for the title in the welterweight division.\nThe Irish fighter, in a post on Twitter, accused Usman of copying his moves in knocking out Masvidal, stating that he would destroy the Nigerian when they clash.\nIn his reply, Usman referred to the former UFC featherweight and lightweight champion as a washed out fighter who got beaten easily in his preferred weight class.", "link": "https://daylightng.com/ufc-usman-mcgregor-in-war-of-words/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["shots", "welterweight", "fight", "words", "war", "nigerian", "usman", "fighter", "mcgregor", "title", "ufc", "masvidal"]}
