<<<<<<< HEAD
=======
{"title": "Army to sue those sharing photos of slain soldiers on social media", "text": "The Nigerian Army has threatened to take legal actions against those sharing photos of slain troops on social media, Director Army Public Relations, Brigadier General, Mohammed Yerima, has said.\n\nDetails later…", "summary": "The Nigerian Army has threatened to take legal actions against those sharing photos of slain troops on social media, Director Army Public Relations, Brigadier General, Mohammed Yerima, has said.\nDetails later…", "link": "https://punchng.com/army-to-sue-those-sharing-photos-of-slain-soldiers-on-social-media/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["social", "yerima", "saiddetails", "soldiers", "sue", "army", "relations", "public", "photos", "media", "troops", "sharing", "threatened", "slain"]}
{"title": "Surrendering to criminals not an option, El-Rufai insists", "text": "Again, Kaduna State Governor, Nasir El-Rufai, has insisted that his administration won’t offer ransom to kidnappers, adding that doing that would mean surrendering to criminals.\n\nThis was contained in a statement on Tuesday by the Special Adviser to the governor on Media and Communication, Muyiwa Adekeye.\n\nThe PUNCH had earlier reported that bandits on Monday killed two students of a private institution, Greenfield University, in Kaduna, days after three of such students were killed.\n\nAlso, at least 29 students of the Federal College of Forestry Mechanisation, Afaka, Kaduna, are still in captivity 47 days after their abduction due to the no-ransom policy of the El-Rufai government.\n\nHowever, in a statement titled, ‘Surrender to criminals is not an option- KDSG’ on Tuesday, the governor argued that the payment of ransom has not curbed criminality in the country.\n\n“Several states sought to negotiate their way out of the problems by talking to bandits, paying them money or offering them amnesty. This has not worked and has only encouraged the criminals to press ahead for a surrender of the public treasury to them. That is clearly not in the public interest,” he added.\n\nEl-Rufai, however, regretted the recent “kidnaps and killings of students from tertiary institutions in our state, and we sympathise with their families with whom we share the aim of the safe return of all the students. We mourn the dead students and we offer our condolences to the family and friends of the deceased”.\n\n“The ruthless and heartless resort of the kidnappers to murdering these young persons is part of their effort to further their blackmail and compel us to abandon our ‘no-ransom, no-negotiation’ policy. Are people bothering with the consequences of state surrender to hoodlums, or is the continued politicization of security challenges not going to make all of us ultimately victims of the insurgents?\n\n“The fact that criminals seek to hold us by the jugular does not mean we should surrender and create an incentive for more crime. In today’s Nigeria, it has become fashionable to treat the unlawful demands of bandits as worthy of consideration and to lampoon people who insist that outlaws should be crushed and not mollycoddled or availed the resources they can use to unleash further outrages,” he stated.", "summary": "Again, Kaduna State Governor, Nasir El-Rufai, has insisted that his administration won’t offer ransom to kidnappers, adding that doing that would mean surrendering to criminals.\nHowever, in a statement titled, ‘Surrender to criminals is not an option- KDSG’ on Tuesday, the governor argued that the payment of ransom has not curbed criminality in the country.\nThis has not worked and has only encouraged the criminals to press ahead for a surrender of the public treasury to them.\nAre people bothering with the consequences of state surrender to hoodlums, or is the continued politicization of security challenges not going to make all of us ultimately victims of the insurgents?\n“The fact that criminals seek to hold us by the jugular does not mean we should surrender and create an incentive for more crime.", "link": "https://punchng.com/surrendering-to-criminals-not-an-option-el-rufai-insists/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["option", "criminals", "students", "kaduna", "public", "elrufai", "statement", "bandits", "state", "governor", "surrender", "insists", "surrendering", "ransom"]}
{"title": "Insecurity: No President’ll expose his citizens to banditry, danger — Tinubu", "text": "Kindly Share This Story:\n\n—Charges Nigerians to cooperate with Buhari\n\nBy Johnbosco Agbakwuru, ABUJA\n\nNATIONAL leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu has said that there is no President that will intentionally want his citizens exposed to banditry and danger.\n\nThe APC leader and former governor of Lagos State stated this while fielding questions from journalists after meeting with President Muhammadu Buhari, Monday night at the Presidential Villa, Abuja.\n\nHe appealed to Nigerians to cooperate and show understanding with the government in the midst of the challenges for the unity of the country.\n\nThe APC national leader, who was accompanied by the party’s pioneer interim National Chairman, Chief Bisi Akande, debunked the insinuations in some quarters that he has a frosty relationship with the President.\n\nAsked what the President should do at the moment given the deteriorating security situation in the country, he said there was a need for effective security and effective communication.\n\nAlso read:\n\nHe said, “Cooperation, understanding and determination. Effective security, effective information. There is no president who will want his country in chaos. Have you seen one? Point one to me. There is no one that will want his citizens exposed to banditry and danger.\n\n“There’s no president or leader that will want his nation fractured by tribalism, religious differences and all that. It calls for serious management and serious evaluation and dialogue once in a while. That’s all.”\n\nOn the agenda of his visit, he said, “It is to generally review the perceptions going on outside there and equally focus on the security across the country more. He will have more information than we have, but we are his ears close to the ground and we have to exchange views so that a better Nigeria is grounded. That’s all.”\n\nOn the best way forward, he replied, “The best way is what we are doing; coming together to reduce banditry, to move for unity and be able to bring a better Nigeria to the people. The welfare of our people is extremely important.\n\n“And yes, every nation will go through these curves and difficult times. How we communicate it to the people, what are the areas to help make it easier for people to bear, those are ideas on how to be able to change the leadership of the country.”\n\nFurther asked to comment on the insinuation that he has an unhealthy relationship with the President, the APC helmsman said his relationship with the President remains cordial.\n\nAccording to him,”Nothing like that, nothing like unhealthy (relationship with the President). Who, is our doctor? Is it social media that is measuring the relationship? I don’t have to disturb him (Buhari) openly on camera, is it? No, we have so many ways to look at issues. We have nothing like that.”\n\nHe maintained that his relationship is “Very close and cordial, frank and honest.”\n\nFielding question on the chances of the APC to return to power after the tenure of President Buhari in 2023, Asiwaju Tinubu said though he didn’t want to predict what would happen then, the chances were bright.\n\nHe said, “No, I don’t want to predict that one (chances of the APC retaining power at the centre after President Buhari) right now, I don’t want to do that subject now. The chances are as bright as a midnight star. We will continue to work for a better Nigeria and that is what you need.\n\n“We cannot interject politics and assumption into everything, we have a nation to build, we have a baton to pass. You can depend on Buhari that he will not spend one hour beyond his tenure. He will do that, he will comply with the Constitution. So, how it happens? Read the Nigerian Constitution and find out from the INEC website.”\n\nVanguard News Nigeria\n\nKindly Share This Story:", "summary": "The APC leader and former governor of Lagos State stated this while fielding questions from journalists after meeting with President Muhammadu Buhari, Monday night at the Presidential Villa, Abuja.\nAsked what the President should do at the moment given the deteriorating security situation in the country, he said there was a need for effective security and effective communication.\nEffective security, effective information.\nThere is no one that will want his citizens exposed to banditry and danger.\n“There’s no president or leader that will want his nation fractured by tribalism, religious differences and all that.", "link": "https://www.vanguardngr.com/2021/04/insecurity-no-presidentll-expose-his-citizens-to-banditry-danger-tinubu/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["banditry", "president", "effective", "nation", "insecurity", "presidentll", "citizens", "relationship", "danger", "apc", "tinubu", "nigeria", "expose", "security", "leader", "chances", "buhari"]}
{"title": "Insecurity: People in govt sabotaging security agencies — Borno Elders Forum", "text": "Kindly Share This Story:\n\nBy Olayinka Ajayi\n\nLAGOS — The Dean, Borno Elders Forum, Prof. Khalifa Dikwa, has insisted that some people in government were sabotaging the nation’s security agencies.\n\nSpeaking on a monitored program on Channels Television, ‘Politics Today’ Dikwa said: “When it started in Bornu State, people felt it was just Kanuri issue.\n\nThen, the people of Kaduna welcomed me to the media because it was something that has been waiting in the cooler for long. And the humiliation of our military at that time.\n\nREAD ALSO Enugu govt raises alarm over sabotage of NCC’s Digital Industrial Park project\n\n“If the money meant to purchase weapons were not used, bring them back and get the weapons anywhere else in the world. Don’t go and place the money somewhere for so long and people are dying.\n\nAnd the media is not helping matters, when the money is going to the eastern bloc, they speak up but they keep quiet when the money is in Europe or America as if we are under the purview of the European Union.\n\nKhalifa reiterated the need for technology to win the war against insecurity across that country saying: “Mr. President should be able to know what is happening to our satellite bay. Can our satellite give area imagery to our military? Can our Air Force use our own satellite without any intervention? If we do not have one, then we can go to any country to borrow space in satellite.\n\nTechnology is very important. Our military can still do it if the technology is there. Why is it that there are people within the system who are sabotaging the technology? Technology I mean, for our military, we should have Helicopters that can see at night and so on. They are not being given. They are sabotaging our army, police and so on.\n\nBut our security forces have performed in other places where technology worked.\n\n“… Nigerians are being used today within and outside the country to drag the image of the country down. And every Nigerian must have the data for planning and any opportunity so that nobody would buy different SIM, adopt criminality to throw away the Subscriber Identity Module,(SIM).\n\nTherefore if the communication ministry has not finished, they should be given enough security much more than before to finish the job that when they put Seun or Khalifa, everything about Khalifa is there”\n\nVanguard News Nigeria\n\nKindly Share This Story:", "summary": "Kindly Share This Story:By Olayinka AjayiLAGOS — The Dean, Borno Elders Forum, Prof. Khalifa Dikwa, has insisted that some people in government were sabotaging the nation’s security agencies.\nKhalifa reiterated the need for technology to win the war against insecurity across that country saying: “Mr.\nWhy is it that there are people within the system who are sabotaging the technology?\nTechnology I mean, for our military, we should have Helicopters that can see at night and so on.\n“… Nigerians are being used today within and outside the country to drag the image of the country down.", "link": "https://www.vanguardngr.com/2021/04/insecurity-people-in-govt-sabotaging-security-agencies-borno-elders-forum/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["weapons", "forum", "govt", "khalifa", "used", "insecurity", "country", "elders", "technology", "agencies", "security", "sabotaging", "money", "satellite", "borno", "military"]}
{"title": "Muslim heads in Nigeria inciting religious crisis", "text": "The leadership of the Christian Association of Nigeria (CAN) has accused some Muslim leaders of promoting violence and religious crisis.\n\nThey have also warned that no religion has a monopoly on violence, cautioning various faiths to be mindful of their actions and utterances.\n\nIn a statement on Tuesday, Daramola alerted the public that extremists have been plotting to throw the already nervous country into utter confusion.\n\nThe scribe observed that all over the country, actions are being taken by some Islamic leaders to provoke their Christian counterparts to anger.\n\n“No religion has a monopoly of violence, hence, Christian leaders continue to caution faithful against provocative actions against other religions or citizens wherever they live as Jesus Christ taught us”, Joseph Daramola, CAN General Secretary said.\n\nDaramola said in Kwara State, CAN is still trying to curb the violence occasioned by the Governor’s directive to mission’s schools to allow the wearing of the hijab.\n\nThe apex religious organisation asked if Islamic schools would allow Catholics or Christian women who are their students to dress to school premises in their cassocks.\n\n“Some extremists have built Ummul Khair Central Mosque and Islamic Centre beside Catholic Bishop’s House and the Secretariat primarily to tempt peace-loving Christians into a religious crisis”, CAN companies.\n\nDaramola said the claim by Imam Abubakar Ali-Agan and the General Manager, Kwara Physical Planning Authority, that there was a Memorandum of Understanding between the Catholic Bishop of Ilorin and the owners of the Ummul Khair Central Mosque regarding the buildings, was falsehood.\n\nCAN advised Muslim leaders to stop fishing in troubled waters to provoke Christians with whom they share the same neighbourhood.\n\nDaramola urged security agencies to caution and prevent any group of people whose actions can lead to religious and social crises and violence in Nigeria.", "summary": "The leadership of the Christian Association of Nigeria (CAN) has accused some Muslim leaders of promoting violence and religious crisis.\nThe scribe observed that all over the country, actions are being taken by some Islamic leaders to provoke their Christian counterparts to anger.\nThe apex religious organisation asked if Islamic schools would allow Catholics or Christian women who are their students to dress to school premises in their cassocks.\nCAN advised Muslim leaders to stop fishing in troubled waters to provoke Christians with whom they share the same neighbourhood.\nDaramola urged security agencies to caution and prevent any group of people whose actions can lead to religious and social crises and violence in Nigeria.", "link": "https://dailypost.ng/2021/04/27/muslim-heads-in-nigeria-inciting-religious-crisis-christian-leadership/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["schools", "christian", "heads", "religion", "violence", "islamic", "inciting", "provoke", "leaders", "muslim", "nigeria", "crisis", "ummul", "religious", "actions"]}
{"title": "ESN commander didn't die in gun battle with Army", "text": "The Indigenous People of Biafra, IPOB has clarified that the murdered Commander of its security outfit, Eastern Security Network, ESN was killed while he was sleeping in his father’s compound.\n\nThis was contrary to the previous report by the Nigerian army that the commander was killed during a gun battle.\n\nRecall that Nigerian security forces carried out a joint operation in Imo State on Saturday, April 24 which led to the death of the ESN Commander, Ikoson and several others.\n\nIn a statement on Tuesday by its spokesman, Emma Powerful, IPOB alleged that the Nigerian security forces eliminated the commander over his decision to eradicate herdsmen from the Southeast.\n\n“The bitter truth the Nigerian Government didn’t want people to hear, which IPOB disclosed at the said interview, was that Ikonso was murdered in his father’s house, not in any imaginary ESN camp or battlefield as the liars would hope to have us believe.\n\n“The same Army, Police and DSS in Imo State that never for one day arrested or prosecuted any Fulani terror herdsman ravaging Imo State before the coming of Ikonso; the same Nigerian security agents that have always provided cover for terrorists and bandits, had the guts to ambush and kill the only man that drove Fulani terrorist herdsmen out of Imo State.\n\nThe group which accused the Imo State Governor, Hope Uzodinma of plotting the death of the commander, had in a statement, vowed to launch a reprisal attack.", "summary": "The Indigenous People of Biafra, IPOB has clarified that the murdered Commander of its security outfit, Eastern Security Network, ESN was killed while he was sleeping in his father’s compound.\nThis was contrary to the previous report by the Nigerian army that the commander was killed during a gun battle.\nRecall that Nigerian security forces carried out a joint operation in Imo State on Saturday, April 24 which led to the death of the ESN Commander, Ikoson and several others.\nIn a statement on Tuesday by its spokesman, Emma Powerful, IPOB alleged that the Nigerian security forces eliminated the commander over his decision to eradicate herdsmen from the Southeast.\nThe group which accused the Imo State Governor, Hope Uzodinma of plotting the death of the commander, had in a statement, vowed to launch a reprisal attack.", "link": "https://dailypost.ng/2021/04/27/esn-commander-didnt-die-in-gun-battle-with-army-ipob-clarifies/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["army", "didnt", "gun", "imo", "killed", "statement", "battle", "nigerian", "die", "ipob", "esn", "state", "commander", "security", "murdered"]}
{"title": "Killings: Wike imposes curfew on Rivers’ borders", "text": "By Mike Odiegwu, Port Harcourt\n\nRivers Governor Nyesom Wike has imposed a night curfew at all the borders Rivers shares with Abia, Akwa Ibom, Bayelsa and Imo States following recent attacks and killings of security operatives by gunmen.\n\nWike, in state broadcast on Tuesday, said the curfew would take effect from Wednesday by 8pm.\n\nHe said it was necessitated by the recent security breaches and deadly attacks on security personnel by yet to be identified gunmen.\n\nThe Governor said: “The Government of Rivers State has decided to restrict night movements into and out of the State from the land borders of the State.\n\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow (Wednesday) 28 April 2021 until further notice.\n\n“We wish to advise that those who have any legitimate need or reason to come into or go out of the State must do so before 8.00 pm when the curfew shall come into force daily.”\n\nThe Governor said security agencies had been posted to monitor and enforce strict compliance to the curfew at all borders with Abia, Akwa Ibom, Bayelsa and Imo States.\n\nADVERTISEMENT\n\nHe explained on Saturday some innocent officers of the Customs, Police and Civil Defence services on their duty posts along the Port Harcourt – Owerri Expressway were ambushed and gruesomely murdered in cold blood by armed attackers.\n\nHe said on Sunday, the state witnessed another deadly attack and killing of officers and men of the Nigerian Army right in their duty post at Abua town in Abua Odual Local Government Area of the state.\n\nThe Governor said although the security agencies were investigating the attacks with a view to bringing the perpetrators to justice, nobody knew where and when the next incident would take place.", "summary": "By Mike Odiegwu, Port HarcourtRivers Governor Nyesom Wike has imposed a night curfew at all the borders Rivers shares with Abia, Akwa Ibom, Bayelsa and Imo States following recent attacks and killings of security operatives by gunmen.\nWike, in state broadcast on Tuesday, said the curfew would take effect from Wednesday by 8pm.\nHe said it was necessitated by the recent security breaches and deadly attacks on security personnel by yet to be identified gunmen.\nThe Governor said: “The Government of Rivers State has decided to restrict night movements into and out of the State from the land borders of the State.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow (Wednesday) 28 April 2021 until further notice.", "link": "https://thenationonlineng.net/killings-wike-imposes-curfew-on-rivers-borders/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["port", "imposes", "wike", "rivers", "night", "attacks", "recent", "killings", "state", "borders", "curfew", "security", "governor"]}
{"title": "Police confirm 1 death, burning of station in Sokoto", "text": "Agency Reporter\n\nThe Police in Sokoto State on Tuesday confirmed the death of one person, burning of a divisional police station and two vehicles in Kware Local Government Area of the state.\n\nSpokesman for the police in the state, ASP Abubakar Sanusi, told the News Agency of Nigeria (NAN) that this was after a mob came to the station demanding the release of two suspected kidnappers.\n\nADVERTISEMENT\n\nSanusi said that the suspects were earlier arrested and being investigated for their alleged involvement in kidnapping in the area.\n\nHe explained that the mob, mostly youths, came to the station shouting and insisting that the two suspects should be released.\n\nHe said thay they overpowered the operatives guarding the station and burnt it down along with the DPO’s car and two police vans.\n\nHe added that the mob succeeded in killing one of the suspects and wounded the other.\n\nSanusi, however, said no arrest had been made but investigation was ongoing.(NAN)", "summary": "Agency ReporterThe Police in Sokoto State on Tuesday confirmed the death of one person, burning of a divisional police station and two vehicles in Kware Local Government Area of the state.\nSpokesman for the police in the state, ASP Abubakar Sanusi, told the News Agency of Nigeria (NAN) that this was after a mob came to the station demanding the release of two suspected kidnappers.\nHe explained that the mob, mostly youths, came to the station shouting and insisting that the two suspects should be released.\nHe said thay they overpowered the operatives guarding the station and burnt it down along with the DPO’s car and two police vans.\nHe added that the mob succeeded in killing one of the suspects and wounded the other.", "link": "https://thenationonlineng.net/police-confirm-1-death-burning-of-station-in-sokoto/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["confirm", "agency", "suspects", "mob", "burning", "sokoto", "wounded", "came", "vehicles", "state", "death", "station", "vanshe", "youths"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "text": "From Ndubuisi Orji, Abuja\n\nThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\n\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\n\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\n\nDetails later", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["speaker", "urged", "summon", "insecurity", "breaking", "house", "service", "countrythe", "summoned", "state", "nsa", "reps", "security", "rising", "session", "services", "chiefs"]}
{"title": "Ogun: NANS raises alarm on rising cases of rape, robbery on campuses", "text": "From Laide Raheem, Abeokuta\n\nStudents in Ogun State have expressed concern over rising cases of rape and armed robbery in some tertiary institutions in the state, calling on the state government to stem the tide or risk a shutdown of school campuses.\n\nThe National Association of Nigerian Students (NANS) condemned the abduction and murder of students across the country, expressing fear that the trend might spread to Ogun State.\n\nSpeaking a press conference held in Abeokuta, NANS Ogun Chairman Kehinde Simeon said that the current rate of insecurity indicates that the government is inadequate in providing adequate security for citizens.\n\nHe threatened that students would not hesitate to shut down schools in the state over the spate of rape and armed robbery incidents in some institutions in the state.\n\nSimeon complained that the students of Gateway (ICT) Polytechnic, Sapaade, and the Institute of Technology, Igbesa, now live in fear of abduction and armed robbery.\n\nThe NANS Chairman called on the state government to immediately summon all heads of security and tertiary institutions to a security meeting and proffer ways at preventing criminals from perpetrating evils on campuses.\n\n‘This is high time for government at all levels to prove themselves as a friend of the masses and as friend of the students’ constituency through decisive, strategic and holistic actions.\n\n‘Issue of kidnapping of students on campuses should not be taking for granted, we condemn in its entirety the recent kidnap of students from Greenfield university in Kaduna State.\n\n‘It is very pathetic that five of these students have so far been killed for a crime they know nothing about.\n\n‘The function of every government of the world is to provide adequate security for lives and properties within its jurisdiction,’ he said.\n\nSimeon appealed to Governor Dapo Abiodun to ensure the safety of the student community, stressing that all criminals found within the school premises should be flushed out.\n\n‘All tertiary institutions in Ogun State be adequately protected and policed.\n\n‘The state government should immediately summon all heads of security and tertiary institutions to a security meeting to proffer ways of preventing such occurrences in Ogun State. And a template of proper security be agreed upon at the end of the meeting,’ he added.\n\nHe emphasised that NANS and other student bodies would not hesitate to mobilise their members to ensure that all schools in the state are shut down until they can guarantee the security of lives of students.\n\n‘We hereby issue a 7-day ultimatum to the Ogun State Government to do the needful. We shall be resolute at doing everything possible to safeguard our students and our campuses, irrespective of the circumstance,’ Simeon declared.", "summary": "From Laide Raheem, AbeokutaStudents in Ogun State have expressed concern over rising cases of rape and armed robbery in some tertiary institutions in the state, calling on the state government to stem the tide or risk a shutdown of school campuses.\nThe National Association of Nigerian Students (NANS) condemned the abduction and murder of students across the country, expressing fear that the trend might spread to Ogun State.\n‘All tertiary institutions in Ogun State be adequately protected and policed.\n‘The state government should immediately summon all heads of security and tertiary institutions to a security meeting to proffer ways of preventing such occurrences in Ogun State.\n‘We hereby issue a 7-day ultimatum to the Ogun State Government to do the needful.", "link": "https://www.sunnewsonline.com/ogun-nans-raises-alarm-on-rising-cases-of-rape-robbery-on-campuses/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["nans", "students", "institutions", "armed", "ways", "rape", "meeting", "cases", "tertiary", "campuses", "state", "security", "alarm", "robbery", "ogun", "rising", "raises"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "text": "Says consequences of insecurity will affect all nations\n\nAsks US to relocate AFRICOM headqurters to Africa\n\nBy Deji Elumoye\n\nPresident Muhammadu Buhari has canvassed for the support of the United States in the move by Nigeria and West African sub region to tackle security challenges in order to avoid spillovers.\n\nHe also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\n\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n\nSaid he: “The security challenges in Nigeria remain of great concern to us and impacted more negatively, by existing complex negative pressures in the Sahel, Central and West Africa, as well as the Lake Chad Region.\n\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes. The support of important and strategic partners like United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges”.\n\nFlowing from this, the President stressed that the US Africa Command (AFRICOM) which partners with countries to counter transnational threats, should be relocated to Africa to strengthen ongoing efforts to check the security situation, with likely effect on other nations.\n\n“In this connection, and considering the growing security challenges in West and Central Africa, Gulf of Guinea, Lake Chad region and the Sahel, weighing heavily on Africa, it underscores the need for the United States to consider re-locating AFRICOM Headquarters from Stuttgart, Germany to Africa and near the Theatre of Operation,’’ he said.\n\nAccording to him, Nigeria will enhance collaborations in all forms, with friends and strategic partners, to work together for greater security for all, which remain the most significant condition for overcoming the existential challenges.\n\nPresident Buhari while congratulating Blinken on his appointment by President Joe Biden commended the United States for the decision to repeal the immigration restriction known as the “Muslim ban’’, re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\n\nHis words: “Nigeria attaches great importance to its relations with the United States. Let me in this connection express appreciation to President Joe Biden for his welcome and reaching decision to repeal the Immigration restriction known as the ‘Muslim ban’ on travel and visas for citizens predominantly from Muslim Nations and African Countries, including Nigeria.\n\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change. The leadership of the United States in these two organizations is crucial for international community. This action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.\n\nHe noted that Nigeria remains resolute in her commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.\n\n\n\nAccording to the President, the convening of the Climate Change Summit last week by President Biden was a strong indication of the renewed interest of the United States to the Paris Agreement.\n\n“I would like to extend our goodwill message to President Joe Biden and his Administration. May I also thank you for initiating this meeting, which I am confident, given your background and current position, you will use to promote the existing bilateral relations between our two countries,’’ he said.\n\nOn his part, the US Secretary of State said he was pleased to make Nigeria part of his “first virtual visit to Africa,” noting that Nigeria and the United States of America, share a lot in bilateral issues.\n\nHe added that he would be delighted to build on the foundation laid over 60 years ago between the two countries, disclosing that areas of discussion with Nigeria would include “how to build our economies back after the COVID-19 pandemic, security for vulnerable communities, and climate issues.”\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["united", "president", "countries", "buhari", "challenges", "states", "africa", "meeting", "paris", "climate", "seeks", "nigeria", "security", "tackle", "help", "blinken"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "text": "Says consequences of insecurity will affect all nations\n\nAsks US to relocate AFRICOM headqurters to Africa\n\nBy Deji Elumoye\n\nPresident Muhammadu Buhari has canvassed for the support of the United States in the move by Nigeria and West African sub region to tackle security challenges in order to avoid spillovers.\n\nHe also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\n\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n\nSaid he: “The security challenges in Nigeria remain of great concern to us and impacted more negatively, by existing complex negative pressures in the Sahel, Central and West Africa, as well as the Lake Chad Region.\n\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes. The support of important and strategic partners like United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges”.\n\nFlowing from this, the President stressed that the US Africa Command (AFRICOM) which partners with countries to counter transnational threats, should be relocated to Africa to strengthen ongoing efforts to check the security situation, with likely effect on other nations.\n\n“In this connection, and considering the growing security challenges in West and Central Africa, Gulf of Guinea, Lake Chad region and the Sahel, weighing heavily on Africa, it underscores the need for the United States to consider re-locating AFRICOM Headquarters from Stuttgart, Germany to Africa and near the Theatre of Operation,’’ he said.\n\nAccording to him, Nigeria will enhance collaborations in all forms, with friends and strategic partners, to work together for greater security for all, which remain the most significant condition for overcoming the existential challenges.\n\nPresident Buhari while congratulating Blinken on his appointment by President Joe Biden commended the United States for the decision to repeal the immigration restriction known as the “Muslim ban’’, re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\n\nHis words: “Nigeria attaches great importance to its relations with the United States. Let me in this connection express appreciation to President Joe Biden for his welcome and reaching decision to repeal the Immigration restriction known as the ‘Muslim ban’ on travel and visas for citizens predominantly from Muslim Nations and African Countries, including Nigeria.\n\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change. The leadership of the United States in these two organizations is crucial for international community. This action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.\n\nHe noted that Nigeria remains resolute in her commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.\n\n\n\nAccording to the President, the convening of the Climate Change Summit last week by President Biden was a strong indication of the renewed interest of the United States to the Paris Agreement.\n\n“I would like to extend our goodwill message to President Joe Biden and his Administration. May I also thank you for initiating this meeting, which I am confident, given your background and current position, you will use to promote the existing bilateral relations between our two countries,’’ he said.\n\nOn his part, the US Secretary of State said he was pleased to make Nigeria part of his “first virtual visit to Africa,” noting that Nigeria and the United States of America, share a lot in bilateral issues.\n\nHe added that he would be delighted to build on the foundation laid over 60 years ago between the two countries, disclosing that areas of discussion with Nigeria would include “how to build our economies back after the COVID-19 pandemic, security for vulnerable communities, and climate issues.”\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/#respond", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["united", "president", "countries", "buhari", "challenges", "states", "africa", "meeting", "paris", "climate", "seeks", "nigeria", "security", "tackle", "help", "blinken"]}
{"title": "Soldiers Kill Female Student Near Imo Government House", "text": "There was panic in Owerri, the Imo state capital, as soldiers allegedly shot and killed a student of the Imo State University, Owerri, near the Douglas House, the seat of Government, Daily Trust reports.\n\nThe victim was identified as Divine Nwaneri, a 25-year-old 100 level student of Soil Science and Biotechnology.\n\nShe was allegedly shot dead by the soldiers on guard duty around the Owerri Custodial Centre and the adjacent Imo Government House.\n\nThe incident occurred in the face of the heightened tension as hoodlums continue to overrun the state, especially the state capital.\n\nThe President of the Student Union Government of IMSU, Arinze Oguike, disclosed that the students were saddened by the way the military allegedly killed the undergraduate.\n\nIt was gathered that she was shot dead by the soldiers, while driving in Lexus IS 250 with number plate, Lagos KSF 407 GT, with her friends.\n\nA source said the deceased was being driven in the car around 10 pm when the soldiers opened fire on them and shot her and the male driver.\n\nThey were rushed to the Federal Medical Centre, Owerri, where the IMSU undergraduate was confirmed dead while the driver survived.\n\nThe Student Union Government, in its reaction, has demanded justice for the slain undergraduate.\n\nWhen contacted, the IMSU Public Relations Officer, Ralph Obinjoku, confirmed the incident, saying the university community was saddened by the loss of the undergraduate.\n\nPolice spokesperson in the state, Orlando Ikeokwu, said that he had not been briefed officially.\n\nThe Army Public Relations Officer of 34 artillery brigade, Obinze, Owerri, Capitan Babatunde Zubairu, said that he had not been contacted.", "summary": "There was panic in Owerri, the Imo state capital, as soldiers allegedly shot and killed a student of the Imo State University, Owerri, near the Douglas House, the seat of Government, Daily Trust reports.\nThe victim was identified as Divine Nwaneri, a 25-year-old 100 level student of Soil Science and Biotechnology.\nShe was allegedly shot dead by the soldiers on guard duty around the Owerri Custodial Centre and the adjacent Imo Government House.\nThe incident occurred in the face of the heightened tension as hoodlums continue to overrun the state, especially the state capital.\nIt was gathered that she was shot dead by the soldiers, while driving in Lexus IS 250 with number plate, Lagos KSF 407 GT, with her friends.", "link": "http://saharareporters.com/2021/04/27/soldiers-kill-female-student-near-imo-government-house", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["owerri", "soldiers", "university", "imo", "kill", "house", "near", "shot", "dead", "state", "allegedly", "imsu", "female", "student"]}
{"title": "Soldiers Kill Female Student Near Imo Government House", "text": "There was panic in Owerri, the Imo state capital, as soldiers allegedly shot and killed a student of the Imo State University, Owerri, near the Douglas House, the seat of Government, Daily Trust reports.\n\nThe victim was identified as Divine Nwaneri, a 25-year-old 100 level student of Soil Science and Biotechnology.\n\nShe was allegedly shot dead by the soldiers on guard duty around the Owerri Custodial Centre and the adjacent Imo Government House.\n\nThe incident occurred in the face of the heightened tension as hoodlums continue to overrun the state, especially the state capital.\n\nThe President of the Student Union Government of IMSU, Arinze Oguike, disclosed that the students were saddened by the way the military allegedly killed the undergraduate.\n\nIt was gathered that she was shot dead by the soldiers, while driving in Lexus IS 250 with number plate, Lagos KSF 407 GT, with her friends.\n\nA source said the deceased was being driven in the car around 10 pm when the soldiers opened fire on them and shot her and the male driver.\n\nThey were rushed to the Federal Medical Centre, Owerri, where the IMSU undergraduate was confirmed dead while the driver survived.\n\nThe Student Union Government, in its reaction, has demanded justice for the slain undergraduate.\n\nWhen contacted, the IMSU Public Relations Officer, Ralph Obinjoku, confirmed the incident, saying the university community was saddened by the loss of the undergraduate.\n\nPolice spokesperson in the state, Orlando Ikeokwu, said that he had not been briefed officially.\n\nThe Army Public Relations Officer of 34 artillery brigade, Obinze, Owerri, Capitan Babatunde Zubairu, said that he had not been contacted.", "summary": "There was panic in Owerri, the Imo state capital, as soldiers allegedly shot and killed a student of the Imo State University, Owerri, near the Douglas House, the seat of Government, Daily Trust reports.\nThe victim was identified as Divine Nwaneri, a 25-year-old 100 level student of Soil Science and Biotechnology.\nShe was allegedly shot dead by the soldiers on guard duty around the Owerri Custodial Centre and the adjacent Imo Government House.\nThe incident occurred in the face of the heightened tension as hoodlums continue to overrun the state, especially the state capital.\nIt was gathered that she was shot dead by the soldiers, while driving in Lexus IS 250 with number plate, Lagos KSF 407 GT, with her friends.", "link": "http://saharareporters.com/2021/04/27/soldiers-kill-female-student-near-imo-government-house#disqus_thread", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["owerri", "soldiers", "university", "imo", "kill", "house", "near", "shot", "dead", "state", "allegedly", "imsu", "female", "student"]}
{"title": "Kidnappers release another video of Afaka students", "text": "Bandits have released a second video of students abducted from the Federal College of Forestry Mechanisation, Afaka, Kaduna state.\n\nAdvertisement\n\nIn March, bandits attacked the college located in Igabi LGA and abducted the students, but 172 of them were rescued, leaving 39 in captivity.\n\nOf the 39 in captivity, 10 have regained their freedom.\n\nA video of the abductees had initially been released on March 13.\n\nAdvertisement\n\nIn a recent video which surfaced online on Tuesday, the students appealed to their parents and the government to facilitate their release.\n\nOne of the students, identified as Benson Emmanuel who appeared in the previous video, was also in the recent recording.\n\n“Please, we are begging on our parents to please come and help us out of here. We have stayed here for days, we have not been eating, some us have been sick. Please, we’re begging our parents to come and help us out of here. We’re tired,” Emmanuel said in the video which was released on Tuesday.\n\nAdvertisement\n\nAnother student, who identified himself as Yahaya Paul, said: “Please, we are calling on our parents to help us, to come and take us out of here. They should try their best to [take] us out of here. We are suffering. Some of us are sick. We’ve not been eating well. Please, parents, help us so we can come out of this place.”\n\nThe video also featured a woman said to be the wife of military officer who was abducted from her home in Tirkania-Agwa, Chikun LGA of Kaduna.\n\nShe said her husband is a naval officer working in Warri, Delta state, while urging the federal government to come to their rescue.", "summary": "Bandits have released a second video of students abducted from the Federal College of Forestry Mechanisation, Afaka, Kaduna state.\nAdvertisementIn March, bandits attacked the college located in Igabi LGA and abducted the students, but 172 of them were rescued, leaving 39 in captivity.\nAdvertisementIn a recent video which surfaced online on Tuesday, the students appealed to their parents and the government to facilitate their release.\nOne of the students, identified as Benson Emmanuel who appeared in the previous video, was also in the recent recording.\n“Please, we are begging on our parents to please come and help us out of here.", "link": "https://www.thecable.ng/kidnappers-release-another-video-of-afaka-students", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["release", "students", "sick", "released", "abducted", "recent", "kidnappers", "afaka", "come", "video", "parents", "officer", "help"]}
{"title": "Kano DisCo signs MoU with Konexa to deploy renewable energy solutions", "text": "The Kano Electricity Distribution Company (KEDCO) has signed a memorandum of understanding (MoU) with Konexa, a renewable energy developer, for electricity generation, storage and distribution.\n\nAdvertisement\n\nThe agreement was signed by KEDCO, Konexa and the Nigeria Sovereign Investment Authority (NSIA) at the British High Commission in Abuja.\n\nAccording to the agreement, Konexa will invest $100 million to provide cutting-edge technology in deploying renewable energy solutions.\n\nPradeep Pursnani, chief executive officer of Konexa, said the agreement “is backed by the Nigeria Sovereign Investment Authority (NSIA)” and would produce and distribute 10 megawatts (MW) of electricity to 30,000 consumers in Kano.\n\nAdvertisement\n\n“In this partnership, Konexa will bring investment, provide better service for the customers and help bring the discos to financial health,” Pursani said.\n\nHe explained that in improving generation capacity, Konexa would deploy solar power, hydropower, and biopower technologies, adding that the project will be completed by next year and hopes to replicate same project in other states.\n\n“In Kaduna, we will deliver before the end of the year, the investment is around $90 million.\n\nAdvertisement\n\n“In Kano we are estimating the project cost to be well over $100 million.”\n\nIn her remarks, Aisha Abba-Kyari, associate vice-president at NSIA, said: “We (NSIA) are actually the funds and project managers for the 10 megawatts solar power plants in Kano State.\n\n“It is a presidential initiative which coincided with Konexa and KEDCO’s franchise model that they are developing in the same area.”\n\nShe said the project was designed to benefit both communities and industrial clusters.\n\nAdvertisement\n\nIn October 2020, Konexa partnered with Kaduna Electricity Distribution Company (KAEDCO) to co-develop a private renewable energy generation and distribution sub-franchise project in the state.\n\nIt also signed an agreement in November 2020 with the Ogun state government on an investment plan of a 250MW integrated distribution model to service over 50,000 connections.", "summary": "The Kano Electricity Distribution Company (KEDCO) has signed a memorandum of understanding (MoU) with Konexa, a renewable energy developer, for electricity generation, storage and distribution.\nAdvertisementThe agreement was signed by KEDCO, Konexa and the Nigeria Sovereign Investment Authority (NSIA) at the British High Commission in Abuja.\nAccording to the agreement, Konexa will invest $100 million to provide cutting-edge technology in deploying renewable energy solutions.\nAdvertisement“In this partnership, Konexa will bring investment, provide better service for the customers and help bring the discos to financial health,” Pursani said.\nAdvertisementIn October 2020, Konexa partnered with Kaduna Electricity Distribution Company (KAEDCO) to co-develop a private renewable energy generation and distribution sub-franchise project in the state.", "link": "https://www.thecable.ng/kano-disco-signs-mou-with-konexa-to-deploy-renewable-energy-solutions", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["investment", "signs", "disco", "deploy", "energy", "renewable", "kano", "electricity", "project", "signed", "distribution", "solutions", "konexa", "mou", "nsia", "agreement"]}
{"title": "Insecurity: Buhari begs US to relocate AFRICOM Tribune Online", "text": "President Muhammadu Buhari has urged the United States to reconsider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer to the Theatre of Operation.\n\nHe made the plea on Tuesday in a virtual meeting with the US Secretary of State, Mr Anthony Blinken, where he also called on the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n\nBuhari said AFRICOM, which partners with countries to counter transnational threats, should be relocated to Africa to strengthen ongoing efforts to check the security situation, with likely effect on other nations.\n\nA statement issued by Femi Adesina, Special Adviser to the President (Media & Publicity) quoted him as saying: “The security challenges in Nigeria remain of great concern to us and impacted more negatively, by existing complex negative pressures in the Sahel, Central and West Africa, as well as the Lake Chad Region.\n\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes. The support of important and strategic partners like the United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges.\n\n“In this connection, and considering the growing security challenges in West and Central Africa, Gulf of Guinea, Lake Chad region and the Sahel, weighing heavily on Africa, it underscores the need for the United States to consider re-locating AFRICOM Headquarters from Stuttgart, Germany to Africa and near the Theatre of Operation.”\n\nThe President said Nigeria will enhance collaborations in all forms, with friends and strategic partners, to work together for greater security for all, which remain the most significant condition for overcoming the existential challenges.\n\nHe congratulated Blinken on his appointment by President Joe Biden and commended the United States for the decision to repeal the immigration restriction known as the “Muslim ban,’’ re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\n\nPresident Buhari stated: “Nigeria attaches great importance to its relations with the United States. Let me in this connection express appreciation to President Joe Biden for his welcome and reaching decision to repeal the Immigration restriction known as the ‘Muslim ban’ on travel and visas for citizens predominantly from Muslim Nations and African Countries, including Nigeria.\n\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change. The leadership of the United States in these two organizations is crucial for the international community.\n\n“This action is a demonstration of the United States commitment in championing and supporting international organisations with the aim to build a better world for all.”\n\nBuhari noted that Nigeria remains resolute in her commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.\n\nAccording to the President, the convening of the Climate Change Summit last week by President Biden was a strong indication of the renewed interest of the United States to the Paris Agreement.\n\n“I would like to extend our goodwill message to President Joe Biden and his Administration. May I also thank you for initiating this meeting, which I am confident, given your background and current position, you will use to promote the existing bilateral relations between our two countries,’’ the President said.\n\nOn his part, the Secretary of State said he was pleased to make Nigeria part of his “first virtual visit to Africa,” noting that Nigeria and the United States of America, share a lot in bilateral issues.\n\nHe added that he would be delighted to build on the foundation that was laid between the two countries over 60 years ago, disclosing that areas of discussion with Nigeria would include “how to build our economies back after the COVID-19 pandemic, security for vulnerable communities, and climate issues.”\n\nYOU SHOULD NOT MISS THESE HEADLINES FROM NIGERIAN TRIBUNE\n\nCOVID-19: Nigeria Recorded 624 New Infections Last Week, Lowest In Over Five Months\n\nLast week, Nigeria recorded 624 new COVID-19 infections which is the lowest the country recorded in five months, Tribune Online analysis shows.Insecurity: Buhari begs US to relocate AFRICOM\n\nThe 624 new cases reported between March 28 and April 3 is a reduction from the 849 recorded the previous week…Insecurity: Buhari begs US to relocate AFRICOM\n\nInsecurity: Buhari begs US to relocate AFRICOM", "summary": "President Muhammadu Buhari has urged the United States to reconsider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer to the Theatre of Operation.\nThe support of important and strategic partners like the United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges.\nPresident Buhari stated: “Nigeria attaches great importance to its relations with the United States.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for the international community.", "link": "https://tribuneonlineng.com/insecurity-buhari-begs-us-to-relocate-africom/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["online", "united", "president", "africa", "states", "paris", "insecurity", "climate", "relocate", "nigeria", "begs", "africom", "security", "recorded", "buhari", "tribune"]}
{"title": "One dies, several injured as bus plunges into river in Kwara", "text": "One dies, several injured as bus plunges into river in Kwara\n\nOne person has reportedly died in an auto crash involving an 18-seater bus that plunged into a river at Eyenkorin area along the Ilorin-Ogbomoso expressway, Ilorin.\n\nThe lone accident which reportedly occurred around 3 am, on Tuesday, involved a white Toyota Hiace 18- passengers bus with plate number Niger State KNT452XA coming from Lagos en route Kebbi.\n\nThe Tribune Online gathered that one of the rear tyres of the vehicle bursted before it plunged into the river immediately after Iyemoja village along Eyenkorin expressway.\n\nOne of the passengers was said to have died immediately while several others sustained varying degrees of injuries.\n\nA resident of the area, Abiola Salaudeen, who confirmed the incident, said that “The accident happened around 3.am today (Tuesday). The passenger in the middle seat died immediately and another one with a broken leg. The driver and 15 others who sustained varying degrees of injuries have been taken to the hospital.\n\n“All of them are Hausa people going to Kebbi State and the gravity of the accident from the wreckage of the vehicle was severe. It took the intervention of some people in the area to calm some of the survivors down following the trauma from the incident. It is only a miracle that only one person died during the accident,” he further added.\n\nWhen contacted, the Sector Commander, Federal Road Safety Corps, Kwara State, Mr Jonathan Owoade, said the sector was not aware of the incident, adding that his men were not involved in the rescue operation.\n\nYOU SHOULD NOT MISS THESE HEADLINES FROM NIGERIAN TRIBUNE\n\nWe Have Not Had Water Supply In Months ― Abeokuta Residents\n\nIn spite of the huge investment in the water sector by the government and international organisations, water scarcity has grown to become a perennial nightmare for residents of Abeokuta, the Ogun State capital. This report x-rays the lives and experiences of residents in getting clean, potable and affordable water amidst the surge of COVID-19 cases in the state…\n\nSelfies, video calls and Chinese documentaries: The things you’ll meet onboard Lagos-Ibadan train\n\nThe Lagos-Ibadan railway was inaugurated recently for a full paid operation by the Nigerian Railway Corporation after about a year of free test-run. Our reporter joined the train to and fro Lagos from Ibadan and tells his experience in this report…", "summary": "One dies, several injured as bus plunges into river in KwaraOne person has reportedly died in an auto crash involving an 18-seater bus that plunged into a river at Eyenkorin area along the Ilorin-Ogbomoso expressway, Ilorin.\nThe Tribune Online gathered that one of the rear tyres of the vehicle bursted before it plunged into the river immediately after Iyemoja village along Eyenkorin expressway.\nOne of the passengers was said to have died immediately while several others sustained varying degrees of injuries.\nA resident of the area, Abiola Salaudeen, who confirmed the incident, said that “The accident happened around 3.am today (Tuesday).\nThe passenger in the middle seat died immediately and another one with a broken leg.", "link": "https://tribuneonlineng.com/one-dies-several-injured-as-bus-plunges-into-river-in-kwara/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["bus", "died", "immediately", "sector", "plunges", "kwara", "area", "incident", "water", "dies", "state", "river", "accident", "injured"]}
{"title": "Obaseki pays April salaries, pensions – Nigerian Observer", "text": "Share Facebook\n\nTwitter\n\nStumbleupon\n\nLinkedIn\n\nPinterest\n\nBENIN CITY – Public and civil servants in Edo State are in a jubilant mood as they received their April salaries on Monday, April 26, with many of them expressing admiration for Governor Godwin Obaseki prudent financial management.\n\nA cross-section of the workers, who spoke with journalists, said they are particularly elated because they are getting paid at a time that their colleagues in other states are being owed or paid half salaries.\n\nA pensioner, who identified himself as Mr. Malachy, noted that he has received his pension for April, commending the governor for his commitment to the welfare of workers.\n\nThe state government has kept to a tradition of paying government workers on or before the 26th of every month despite the financial crunch that has beset the country.\n\nA staff at the Ministry of Finance, who pleaded anonymity, said that the state government has been faithful with its obligations to workers and pensioners because of Governor Obaseki’s prudent financial management.\n\nHe said, “We have a governor who has done a lot to clean up the finances of the state. Salaries were paid today because the governor has a good grasp of public finance and is using his expertise to better the life of the state.”\n\nHe noted that the development was quite revealing as the salaries are being paid at a time that other states are grappling to pay their workers.\n\n...", "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Public and civil servants in Edo State are in a jubilant mood as they received their April salaries on Monday, April 26, with many of them expressing admiration for Governor Godwin Obaseki prudent financial management.\nA cross-section of the workers, who spoke with journalists, said they are particularly elated because they are getting paid at a time that their colleagues in other states are being owed or paid half salaries.\nA pensioner, who identified himself as Mr. Malachy, noted that he has received his pension for April, commending the governor for his commitment to the welfare of workers.\nA staff at the Ministry of Finance, who pleaded anonymity, said that the state government has been faithful with its obligations to workers and pensioners because of Governor Obaseki’s prudent financial management.\nHe said, “We have a governor who has done a lot to clean up the finances of the state.", "link": "http://nigerianobservernews.com/2021/04/obaseki-pays-april-salaries-pensions/#comments", "published": "04/26/2021", "run": "04/27/2021", "keywords": ["observer", "paid", "pays", "obaseki", "states", "workers", "financial", "salaries", "public", "prudent", "nigerian", "state", "governor", "received", "pensions"]}
{"title": "Obaseki pays April salaries, pensions – Nigerian Observer", "text": "Share Facebook\n\nTwitter\n\nStumbleupon\n\nLinkedIn\n\nPinterest\n\nBENIN CITY – Public and civil servants in Edo State are in a jubilant mood as they received their April salaries on Monday, April 26, with many of them expressing admiration for Governor Godwin Obaseki prudent financial management.\n\nA cross-section of the workers, who spoke with journalists, said they are particularly elated because they are getting paid at a time that their colleagues in other states are being owed or paid half salaries.\n\nA pensioner, who identified himself as Mr. Malachy, noted that he has received his pension for April, commending the governor for his commitment to the welfare of workers.\n\nThe state government has kept to a tradition of paying government workers on or before the 26th of every month despite the financial crunch that has beset the country.\n\nA staff at the Ministry of Finance, who pleaded anonymity, said that the state government has been faithful with its obligations to workers and pensioners because of Governor Obaseki’s prudent financial management.\n\nHe said, “We have a governor who has done a lot to clean up the finances of the state. Salaries were paid today because the governor has a good grasp of public finance and is using his expertise to better the life of the state.”\n\nHe noted that the development was quite revealing as the salaries are being paid at a time that other states are grappling to pay their workers.\n\n...", "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Public and civil servants in Edo State are in a jubilant mood as they received their April salaries on Monday, April 26, with many of them expressing admiration for Governor Godwin Obaseki prudent financial management.\nA cross-section of the workers, who spoke with journalists, said they are particularly elated because they are getting paid at a time that their colleagues in other states are being owed or paid half salaries.\nA pensioner, who identified himself as Mr. Malachy, noted that he has received his pension for April, commending the governor for his commitment to the welfare of workers.\nA staff at the Ministry of Finance, who pleaded anonymity, said that the state government has been faithful with its obligations to workers and pensioners because of Governor Obaseki’s prudent financial management.\nHe said, “We have a governor who has done a lot to clean up the finances of the state.", "link": "http://nigerianobservernews.com/2021/04/obaseki-pays-april-salaries-pensions/#comment-24904", "published": "04/26/2021", "run": "04/27/2021", "keywords": ["observer", "paid", "pays", "obaseki", "states", "workers", "financial", "salaries", "public", "prudent", "nigerian", "state", "governor", "received", "pensions"]}
{"title": "Nigerian lawmakers debate insecurity as senator says 42 Niger communities occupied by Boko Haram", "text": "Nigerian senators on Tuesday asked the leadership of the National Assembly to have a meeting with President Muhammadu Buhari and brief him on the state of insecurity in Nigeria.\n\nThis was one of the many resolutions adopted by the lawmakers after deliberations on kidnappings and banditry across the nation.\n\nDuring the debate, a Niger State senator told his colleagues that 42 communities in the state were being occupied by Boko Haram.\n\nIn his contribution, Opeyemi Bamidele, a senator from Ekiti State, asked the Senate to “mandate the leadership of the National Assembly to book an appointment with the Commander-In-Chief on behalf of the 109 senators…because I’m not convinced that Mr President is aware of everything that’s happening.”\n\n“…we need to be able to tell our constituents that we met with the commander-in-chief and this is what is being done,” he said.\n\nMr Bamidele was suggesting an addendum to the resolution on insecurity – which was adopted.\n\nThe lawmakers also resolved to invite the Chief of Army Staff, Ibrahim Attahiru, and heads of other security agencies for a meeting with the Senate.\n\nIn the same vein, the Senate Committees on Foreign Affairs and National Security were mandated to meet with the minister of foreign affairs, Geoffrey Onyeama and the Director-General of the Nigerian Intelligence Agency, Ahmed Abubakar, on the implications of the insecurity in Niger State.\n\nThe Debate\n\nThe resolutions were sequel to a motion on the activities of Boko Haram insurgents in Niger State. The motion was sponsored by Sani Musa (APC, Niger East).\n\nThe motion came barely 24 hours after the Niger State governor, Abubakar Bello, confirmed that Boko Haram has hoisted its flags in Kaure and Shiroro local government areas of the state – about 140km to the Federal Capital Territory.\n\nWhile he called for a more coordinated military action to fight the terrorists, Mr Bello warned that Kaure is less than two hours drive from Abuja and “nobody is safe anymore, not even those in Abuja.”\n\nLeading the debate on Tuesday, Mr Musa noted that the Senate has made several resolutions, set up an ad-hoc committee on security, appropriated budget and also advanced numerous steps to support Nigeria’s security agencies.\n\nHe said the negative effects of the atrocities committed by the bandits include the total collapse of the local economies of the affected communities, the total collapse of the educational system, famine, displacement, depopulation, social vices, trauma arising from serial rape cases and inhumane, cruel and deadly subjugation.\n\n“About 42 communities across the two local government areas of Shiroro and Munya Local Government have so far fallen under the Boko Haram control with about 5,000 villagers already displaced in the last three days.\n\n“They have kidnapped many and their wives seized from them and forcefully attached to Boko Haram members. Three military camps in Allawa, Bassa and Zagzaga in the two local government areas have been sacked and some security personnel killed by the insurgents in the last one month of renewed attacks.\n\n“Boko Haram terrorists have mounted their flags in many of the villages they have captured such as Kaure, Alawa and Magami,” he said.\n\nContributions\n\nLawmakers took turns to condemn the killings across the country. Over 15 senators made their contributions to the motion.\n\nADVERTISEMENT\n\nPREMIUM TIMES reported the worsening security situation across the country with over 200 people killed last week and over 44 others kidnapped.\n\nBima Enagi (APC, Niger North) said Nigerians cannot continue to bear the pain of women being raped and forcibly married to Boko Haram terrorists.\n\n“We cannot continue to allow Boko Haram to mount flags in Nigerian territories. What is our army doing? What are all security agencies doing? It has become so shameful that a great country like Nigeria will be in this type of terrible situation.\n\n“It seems the federal government is handling this insecurity situation with kid gloves. People are dying every day and nothing is being done. No serious, concrete situation on the ground to confront these people.”\n\nIke Ekweremadu, an Enugu senator, warned that any government that cannot protect its citizens has lost legitimacy.\n\nHe also said Nigeria should not be ashamed to seek international support.\n\n“Time has come for us to, if possible, shut down this senate and find a lasting solution to this,” he said.\n\nBiodun Olujimi, an Ekiti senator, wondered why Nigeria recently sent out security officials for peacekeeping in another country when we cannot keep our own peace.\n\nThe bloodletting, she said, is out of hand.\n\n“There is lack of political will to handle insecurity. None of us here can say we know the process that this government is taking to handle insecurity.\n\n“There is also lack of leadership. New service chiefs have come. Have we told them what to do and given them a timeline?”\n\nOther resolutions\n\nThe Senate, thereafter, called on the army chief and the Inspector General of Police to immediately deploy troops to defend the unarmed populace and bring back security to the affected communities.\n\nThey lawmakers called for a permanent military and police command base in the area adjoining Shiroro and Rafi local government areas respectively and to redesign the modus operandi of the military operations within the affected areas so as to curtail the escalating insecurity.\n\nThe lawmakers asked the president to order for massive recruitment of police officers and other security personnel.", "summary": "During the debate, a Niger State senator told his colleagues that 42 communities in the state were being occupied by Boko Haram.\nThe DebateThe resolutions were sequel to a motion on the activities of Boko Haram insurgents in Niger State.\n“They have kidnapped many and their wives seized from them and forcefully attached to Boko Haram members.\n“Boko Haram terrorists have mounted their flags in many of the villages they have captured such as Kaure, Alawa and Magami,” he said.\n“We cannot continue to allow Boko Haram to mount flags in Nigerian territories.", "link": "https://www.premiumtimesng.com/news/headlines/457884-nigerian-lawmakers-debate-insecurity-as-senator-says-42-niger-communities-occupied-by-boko-haram.html", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["haram", "niger", "insecurity", "local", "nigerian", "senator", "boko", "areas", "state", "debate", "security", "communities", "occupied", "lawmakers", "senate"]}
{"title": "Police confirm kidnap case in Osun", "text": "ADVERTISEMENT\n\nThe police in Osun on Monday confirmed a case of kidnapping at Osu on the Akure-Ilesa highway.\n\nThe News Agency of Nigeria (NAN) reports that Osu is in Atakumosa West Local Government Area of Osun.\n\nNAN learnt that though several passengers were said to have been kidnapped in the incident which occurred at about 7:30 p.m. on Saturday, the police said only one person was reportedly abducted.\n\nYemisi Opalola, the police spokesperson in Osun, said she could only confirm that one person was kidnapped on the highway.\n\nAccording to Ms Opalola, one Okunade Rebecca reported that her husband, who boarded a vehicle from Akure, called to inform her that he had been abducted by gunmen.\n\n”One Okunade Rebecca of Panada Ikire reported at Osu Divisional Headquarters that on Saturday, April 24, 2021, at about 7:40pm, she received a phone call from her husband, Okunade Yinka, that he boarded a commercial bus from Akure.\n\n”On getting to Osu-Ife express road by Akere junction, unknown gunmen stopped their vehicle and he was kidnapped.\n\n”A combined team of operatives of the police and local hunters have commenced intensive manhunt to rescue the victim unhurt,” Ms Opalola said.(NAN)", "summary": "ADVERTISEMENTThe police in Osun on Monday confirmed a case of kidnapping at Osu on the Akure-Ilesa highway.\nThe News Agency of Nigeria (NAN) reports that Osu is in Atakumosa West Local Government Area of Osun.\nYemisi Opalola, the police spokesperson in Osun, said she could only confirm that one person was kidnapped on the highway.\nAccording to Ms Opalola, one Okunade Rebecca reported that her husband, who boarded a vehicle from Akure, called to inform her that he had been abducted by gunmen.\n”A combined team of operatives of the police and local hunters have commenced intensive manhunt to rescue the victim unhurt,” Ms Opalola said.", "link": "https://www.premiumtimesng.com/regional/ssouth-west/457816-police-confirm-kidnap-case-in-osun.html", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["osu", "confirm", "local", "person", "opalola", "reported", "kidnap", "vehicle", "ms", "case", "okunade", "rebecca", "osun"]}
{"title": "Nigerian Army protests against sharing graphic pictures of soldiers killed in action, threatens legal action", "text": "OBINNA EZUGWU\n\nThe Nigerian Army has condemned in the strongest term possible, what it described as “the indiscriminate sharing on social media of graphic pictures of personnel who paid the supreme price in the cause of defending and protecting the country from its adversaries.”\n\nThe Army which conveyed its protest over the development in a statement by its spokesman, Brig. Gen. Mohammed Yerima on Tuesday, said the act is “not only unpatriotic but very insensitive and utterly reprehensible,” while threatening to take legal action against anyone seen sharing such images.\n\nAccording to the statement, “Officers and soldiers of the Nigerian Army deployed to various theatres of internal security operations are on legitimate duties and are in the harm’s way to defend and protect the country from those who are intent on destroying it.\n\n“In the course of carrying out this constitutional mandate, troops put their lives on the line to ensure that innocent citizens and institutions of the state are protected from violent criminals. In some cases, these gallant officers and soldiers are meted with the worst form of savagery by the heartless adversaries whose intent is to instill fear on of the citizenry.\n\n“While the Nigerian Army and its personnel understand the nature of the noble calling and are ever ready to confront any danger of adversity on the way, what is most unfathomable is the glee with which some people share the gory pictures of officers and soldiers who are either killed-in-action or Wounded-in-action in the media.\n\n“These unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members. In some cases, their loved ones do find out about their unfortunate death in such callous manner before they are even contacted by the military authorities. One can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "summary": "Gen. Mohammed Yerima on Tuesday, said the act is “not only unpatriotic but very insensitive and utterly reprehensible,” while threatening to take legal action against anyone seen sharing such images.\nIn some cases, these gallant officers and soldiers are meted with the worst form of savagery by the heartless adversaries whose intent is to instill fear on of the citizenry.\n“These unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members.\nOne can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "link": "https://hallmarknews.com/nigerian-army-protests-against-sharing-graphic-pictures-of-soldiers-killed-in-action-threatens-legal-action/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["social", "graphic", "soldiers", "army", "officers", "action", "protests", "killed", "personnel", "nigerian", "legal", "troops", "sharing", "way", "unpatriotic", "pictures", "threatens"]}
{"title": "Video: Bandits release video of abducted Kaduna students", "text": "Bandits on Tuesday, released a video of Kaduna students after 47 days in captivity.\n\nThe students were instructed by their abductors to appeal to their parents to pay ransom for their release.", "summary": "Bandits on Tuesday, released a video of Kaduna students after 47 days in captivity.\nThe students were instructed by their abductors to appeal to their parents to pay ransom for their release.", "link": "https://hallmarknews.com/video-bandits-release-video-of-abducted-kaduna-students/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["release", "students", "kaduna", "days", "abducted", "released", "pay", "bandits", "parents", "instructed", "video", "ransom"]}
{"title": "African V’ball Club Championships: Nigeria Customs Thrash AS Douanes,Through To Semifinals", "text": "ADVERTISEMENT\n\nBy Olawale Ayeni, Abuja\n\nNigerian Customs Service (NCS) women volleyball team are through to the semifinal of the ongoing 2021 Women’s African Volleyball Club Championship in Kelibia, Tunisia, after thrashing Burkina Faso’s AS Douanes 3-0 (17-25, 15-25, 11-25) in an exciting encounter, yesterday.\n\nThe victory earned the Nigerian Customs girls second spot finished in Group B with 11 points from four matches behind leaders, Carthage of Tunisia, to reach the semifinal of the championship for the first time in their history.\n\nSpeaking to LEADERSHIP Sports after the team’s victory, Secretary General of Nigeria Customs Service sports unit, Samuel Onikeku, said the girls are in high spirits to deliver the tournament’s title to Nigeria.\n\n“We are in the final stages of the competition, so we are going to fight hard and defend the integrity of the Nigeria Customs Service and make Nigerians proud. We are hopeful that we will return to Nigeria with the trophy,” he said.\n\nThe Nigeria Customs ladies will face ‪CS Sfaxien of Tunisia in their semifinal encounter later today.\n\nMeanwhile, in the men’s category, the Nigeria Customs humbled their Tanzania’s MTC counterpart 1-3 (14-25, 25-17, 17-25, 19-25).", "summary": "ADVERTISEMENTBy Olawale Ayeni, AbujaNigerian Customs Service (NCS) women volleyball team are through to the semifinal of the ongoing 2021 Women’s African Volleyball Club Championship in Kelibia, Tunisia, after thrashing Burkina Faso’s AS Douanes 3-0 (17-25, 15-25, 11-25) in an exciting encounter, yesterday.\nSpeaking to LEADERSHIP Sports after the team’s victory, Secretary General of Nigeria Customs Service sports unit, Samuel Onikeku, said the girls are in high spirits to deliver the tournament’s title to Nigeria.\n“We are in the final stages of the competition, so we are going to fight hard and defend the integrity of the Nigeria Customs Service and make Nigerians proud.\nThe Nigeria Customs ladies will face ‪CS Sfaxien of Tunisia in their semifinal encounter later today.\nMeanwhile, in the men’s category, the Nigeria Customs humbled their Tanzania’s MTC counterpart 1-3 (14-25, 25-17, 17-25, 19-25).", "link": "https://leadership.ng/african-vball-club-championships-nigeria-customs-thrash-as-douanesthrough-to-semifinals/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["african", "victory", "girls", "encounter", "championship", "tunisia", "semifinals", "championships", "thrash", "club", "service", "semifinal", "nigeria", "douanesthrough", "volleyball", "customs", "vball"]}
{"title": "Nigerian Startup Among 5 Finalists In Contest For $500,000 Funding", "text": "BY BODE GBADEBO |\n\nAfter 5,000 startup applications received, a Swiss-based investment firm, Seedstars has narrowed down the participants in the largest startup competition in emerging markets to only five finalists from five regions of the world.\n\nA Nigerian startup, Ladda is among the five finalists joining the grand finale.\n\nLEADERSHIP reports that the Seedstars World Competiton is set to award this year’s global winner with the grand prize of $500,000 USD in equity funding and will be broadcasting the big event online together with The Next Web (TNW) on May 20, 2021 at 2pm CET.\n\nLadda addresses the problem of poor financial literacy and insufficient ease of access to micro-investment opportunities for low to medium-income earners in Nigeria.\n\nThe startup also provides access to investment for retail investors in order to democratise access to investment and provide financial literacy.\n\nThe other finalists are Fulfillment Bridge (Tunisia), Pegasi (Venezuela), IMAN (Uzbekistan), and Finology (Malaysia).\n\nIn a press statement by the organisers, the Seedstars World lead\n\nADVERTISEMENT\n\nof Seedstars, Daria Khlopova, said: “These five startups have proven that no matter how difficult times may get, innovation is still at the\n\nforefront. We can’t wait to see them at the Grand Finale.”\n\nIt will be recalled that In 2013, the Seedstars World Competition was launched to find the most promising early-stage startups and build the largest entrepreneurial community in emerging markets.", "summary": "BY BODE GBADEBO |After 5,000 startup applications received, a Swiss-based investment firm, Seedstars has narrowed down the participants in the largest startup competition in emerging markets to only five finalists from five regions of the world.\nA Nigerian startup, Ladda is among the five finalists joining the grand finale.\nThe startup also provides access to investment for retail investors in order to democratise access to investment and provide financial literacy.\nThe other finalists are Fulfillment Bridge (Tunisia), Pegasi (Venezuela), IMAN (Uzbekistan), and Finology (Malaysia).\nIn a press statement by the organisers, the Seedstars World leadADVERTISEMENTof Seedstars, Daria Khlopova, said: “These five startups have proven that no matter how difficult times may get, innovation is still at theforefront.", "link": "https://leadership.ng/nigerian-startup-among-5-finalists-in-contest-for-500000-funding/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["investment", "largest", "funding", "seedstars", "startup", "500000", "markets", "nigerian", "contest", "access", "finalists", "startups", "world", "grand"]}
{"title": "Insecurity: Buhari begs US, others for help", "text": "President Muhammadu Buhari has appealed to the United States and other international community to help Nigeria in tackling growing security challenges to avoid spillovers.\n\nThe president also urged the United States to reconsider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\n\nBuhari, in a virtual meeting with the US Secretary of State, Mr. Anthony Blinken, said AFRICOM, which partners with countries to counter transnational threats, should be relocated to Africa to strengthen ongoing efforts to check the security situation, with likely effect on other nations.\n\n“The security challenges in Nigeria remain of great concern to us and impacted more negatively, by existing complex negative pressures in the Sahel, Central and West Africa, as well as the Lake Chad Region.\n\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes. The support of important and strategic partners like United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges.\n\n“In this connection, and considering the growing security challenges in West and Central Africa, Gulf of Guinea, Lake Chad region and the Sahel, weighing heavily on Africa, it underscores the need for the United States to consider re-locating AFRICOM Headquarters from Stuttgart, Germany to Africa and near the Theatre of Operation,’’ he said.\n\nThe President said Nigeria would enhance collaborations in all forms, with friends and strategic partners, to work together for greater security for all, which remained the most significant condition for overcoming the existential challenges.\n\nBuhari congratulated Blinken on his appointment by President Joe Biden, and commended the United States for the decision to repeal the immigration restriction known as the “Muslim ban’’, re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\n\n“Nigeria attaches great importance to its relations with the United States. Let me in this connection express appreciation to President Joe Biden for his welcome and reaching decision to repeal the Immigration restriction known as the ‘Muslim ban’ on travel and visas for citizens predominantly from Muslim Nations and African Countries, including Nigeria.\n\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change. The leadership of the United States in these two organizations is crucial for international community.\n\n“This action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all,’’ he added.\n\nBuhari noted that Nigeria remained resolute in her commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which sought to limit global warming and reduce greenhouse gas emissions.\n\nAccording to the President, the convening of the Climate Change Summit last week by President Biden was a strong indication of the renewed interest of the United States to the Paris Agreement.\n\n“I would like to extend our goodwill message to President Joe Biden and his Administration. May I also thank you for initiating this meeting, which I am confident, given your background and current position, you will use to promote the existing bilateral relations between our two countries,’’ the President said.\n\nThe Secretary of State said he was pleased to make Nigeria part of his “first virtual visit to Africa,” noting that Nigeria and the United States of America, share a lot in bilateral issues.\n\nHe added that he would be delighted to build on the foundation that was laid between the two countries over 60 years ago, disclosing that areas of discussion with Nigeria would include “how to build our economies back after the COVID-19 pandemic, security for vulnerable communities, and climate issues.”", "summary": "President Muhammadu Buhari has appealed to the United States and other international community to help Nigeria in tackling growing security challenges to avoid spillovers.\nThe support of important and strategic partners like United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\n“This action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all,’’ he added.", "link": "https://www.pmnewsnigeria.com/2021/04/27/insecurity-buhari-begs-us-others-for-help/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["biden", "united", "president", "countries", "africa", "states", "paris", "insecurity", "climate", "nigeria", "begs", "security", "buhari", "help"]}
{"title": "Army in Gwoza offensive, downplays casualties in Mainok: Reports", "text": "By Abankula\n\nThe Nigerian Army may have downplayed the casualties suffered when fighters of ISWAP attacked its super camp in Mainok, Borno state on Sunday.\n\nWhile the army said seven soldiers, including a commanding officer died, multiple reports said more than 30 soldiers died when the militants overran the army base.\n\nBut chastened by the losses in Mainok, Nigerian troops launched preemptive strikes against ISWAP and Boko Haram in Wulgo and Gwoza axis of Borno on Monday.\n\nIn decisive efforts, Nigeria troops ambushed and conducted clearance operations killing scores of ISWAP/ Boko Haram terrorists, PR Nigeria reported.\n\nThe military in contrast were taken by surprise in Mainok by the militants, who only pulled back in the face of air strikes.\n\nReuters, quoting three soldiers and a resident reported that the attackers were believed to belong to the regional offshoot of Islamic State.\n\nThey hit the base in Mainok town in northeast Borno state on Sunday afternoon, the soldiers and the resident said.\n\nIn a statement issued Monday evening, a military spokesman said that one officer and six soldiers were killed and five were wounded in the attack.\n\nThe statement said troops had killed scores of militants and were now in full control of the area.\n\nBut sources told Reuters that 33 soldiers were killed in Sunday’s attack.\n\nThe militants wore military camouflage and arrived in around 16 gun trucks and six mine-resistant military vehicles, one of the soldiers said.\n\nAfter several hours, they captured the base and soldiers called in airstrikes.\n\nMore soldiers were killed when militants ambushed reinforcements sent to help, the soldier sources said.\n\nA resident said the attackers also set ablaze the town’s police headquarters.\n\n“I saw them while fighting with soldiers,” resident Ba Umar Abba Tuja told Reuters.\n\n“When the fighter jet started hovering in the air, the (militants) fled to the community and hid in the primary school.”\n\nTuja said the militants left around midnight.\n\nOne soldier said air strikes had hit army troops due to their similar dress as the militants.\n\nThe Air Force, in a post on Twitter, said it was investigating the incident.\n\nMainok is roughly 55 km (30 miles) from Maiduguri, the capital of Borno state.\n\nIn the Gwoza and Wulgo axis, Nigerian troops repelled attacks and pre-empted attempted strikes.\n\nA military source said: “At Wulgo near Gamboru, the air taskforce was able to destroy two gun trucks of the terrorists while the ground troops captured three other gun trucks.\n\nBodies of the terrorists littered the areas.\n\nThere was no casualty on the side of the troops.\n\n“The Gwoza operation was successfully executed after credible intelligence indicated that terrorists were advancing towards Lokodissa- Yamtake with a mission to infiltrate military facility in axis.\n\n“The strategic ambush was so successfully carried out in this rocky and hilly town that borders Cameroon.\n\nTroops also cleared Boko Haram settlements and Camps in mountainous Kwatara axis at Mandara Mountain.\n\nDuring fire fight, the troops pursued terrorists beyond Mango plantation.\n\nThe military source said: “With the support of multinational Joint Taskforce in conjunction with the Civilian JTF, the troops pursued the terrorists who fled uphill.\n\nBecause of the rugged terrain, the military deployed mortar, artillery and Multi Barrel Rocket Launcher (MBRL) in shelling the targets during the operation.”\n\nPRNigeria learnt that the acting General Officer Commanding of the Nigerian Army 7 Division, Brig General Abdulwahab Eyitayo visited some of the military formations and commended the troops for taking swift and decisive actions against the terrorists.", "summary": "By AbankulaThe Nigerian Army may have downplayed the casualties suffered when fighters of ISWAP attacked its super camp in Mainok, Borno state on Sunday.\nWhile the army said seven soldiers, including a commanding officer died, multiple reports said more than 30 soldiers died when the militants overran the army base.\nBut chastened by the losses in Mainok, Nigerian troops launched preemptive strikes against ISWAP and Boko Haram in Wulgo and Gwoza axis of Borno on Monday.\n“I saw them while fighting with soldiers,” resident Ba Umar Abba Tuja told Reuters.\nIn the Gwoza and Wulgo axis, Nigerian troops repelled attacks and pre-empted attempted strikes.", "link": "https://www.pmnewsnigeria.com/2021/04/27/army-in-gwoza-offensive-downplays-casualties-in-mainok-reports/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["soldiers", "army", "reports", "air", "offensive", "downplays", "gwoza", "mainok", "casualties", "terrorists", "nigerian", "troops", "resident", "militants", "military"]}
{"title": "Insecurity: No President’ll expose his citizens to banditry, danger — Tinubu", "text": "Kindly Share This Story:\n\n—Charges Nigerians to cooperate with Buhari\n\nBy Johnbosco Agbakwuru, ABUJA\n\nNATIONAL leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu has said that there is no President that will intentionally want his citizens exposed to banditry and danger.\n\nThe APC leader and former governor of Lagos State stated this while fielding questions from journalists after meeting with President Muhammadu Buhari, Monday night at the Presidential Villa, Abuja.\n\nHe appealed to Nigerians to cooperate and show understanding with the government in the midst of the challenges for the unity of the country.\n\nThe APC national leader, who was accompanied by the party’s pioneer interim National Chairman, Chief Bisi Akande, debunked the insinuations in some quarters that he has a frosty relationship with the President.\n\nAsked what the President should do at the moment given the deteriorating security situation in the country, he said there was a need for effective security and effective communication.\n\nAlso read:\n\nHe said, “Cooperation, understanding and determination. Effective security, effective information. There is no president who will want his country in chaos. Have you seen one? Point one to me. There is no one that will want his citizens exposed to banditry and danger.\n\n“There’s no president or leader that will want his nation fractured by tribalism, religious differences and all that. It calls for serious management and serious evaluation and dialogue once in a while. That’s all.”\n\nOn the agenda of his visit, he said, “It is to generally review the perceptions going on outside there and equally focus on the security across the country more. He will have more information than we have, but we are his ears close to the ground and we have to exchange views so that a better Nigeria is grounded. That’s all.”\n\nOn the best way forward, he replied, “The best way is what we are doing; coming together to reduce banditry, to move for unity and be able to bring a better Nigeria to the people. The welfare of our people is extremely important.\n\n“And yes, every nation will go through these curves and difficult times. How we communicate it to the people, what are the areas to help make it easier for people to bear, those are ideas on how to be able to change the leadership of the country.”\n\nFurther asked to comment on the insinuation that he has an unhealthy relationship with the President, the APC helmsman said his relationship with the President remains cordial.\n\nAccording to him, “Nothing like that, nothing like unhealthy (relationship with the President). Who, is our doctor? Is it social media that is measuring the relationship? I don’t have to disturb him (Buhari) openly on camera, is it? No, we have so many ways to look at issues. We have nothing like that.”\n\nHe maintained that his relationship is “Very close and cordial, frank and honest.”\n\nFielding question on the chances of the APC to return to power after the tenure of President Buhari in 2023, Asiwaju Tinubu said though he didn’t want to predict what would happen then, the chances were bright.\n\nHe said, “No, I don’t want to predict that one (chances of the APC retaining power at the centre after President Buhari) right now, I don’t want to do that subject now. The chances are as bright as a midnight star. We will continue to work for a better Nigeria and that is what you need.\n\n“We cannot interject politics and assumption into everything, we have a nation to build, we have a baton to pass. You can depend on Buhari that he will not spend one hour beyond his tenure. He will do that, he will comply with the Constitution. So, how it happens? Read the Nigerian Constitution and find out from the INEC website.”\n\nVanguard News Nigeria\n\nKindly Share This Story:", "summary": "The APC leader and former governor of Lagos State stated this while fielding questions from journalists after meeting with President Muhammadu Buhari, Monday night at the Presidential Villa, Abuja.\nAsked what the President should do at the moment given the deteriorating security situation in the country, he said there was a need for effective security and effective communication.\nEffective security, effective information.\nThere is no one that will want his citizens exposed to banditry and danger.\n“There’s no president or leader that will want his nation fractured by tribalism, religious differences and all that.", "link": "https://www.vanguardngr.com/2021/04/insecurity-no-presidentll-expose-his-citizens-to-banditry-danger-tinubu/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["insecurity", "tinubu", "nation", "danger", "nigeria", "relationship", "leader", "banditry", "effective", "presidentll", "buhari", "chances", "expose", "citizens", "president", "apc", "security"]}
{"title": "Insecurity: People in govt sabotaging security agencies — Borno Elders Forum", "text": "Kindly Share This Story:\n\nBy Olayinka Ajayi\n\nLAGOS — The Dean, Borno Elders Forum, Prof. Khalifa Dikwa, has insisted that some people in government were sabotaging the nation’s security agencies.\n\nSpeaking on a monitored program on Channels Television, ‘Politics Today’ Dikwa said: “When it started in Bornu State, people felt it was just Kanuri issue.\n\nThen, the people of Kaduna welcomed me to the media because it was something that has been waiting in the cooler for long. And the humiliation of our military at that time.\n\nREAD ALSO Enugu govt raises alarm over sabotage of NCC’s Digital Industrial Park project\n\n“If the money meant to purchase weapons were not used, bring them back and get the weapons anywhere else in the world. Don’t go and place the money somewhere for so long and people are dying.\n\nAnd the media is not helping matters, when the money is going to the eastern bloc, they speak up but they keep quiet when the money is in Europe or America as if we are under the purview of the European Union.\n\nKhalifa reiterated the need for technology to win the war against insecurity across that country saying: “Mr. President should be able to know what is happening to our satellite bay. Can our satellite give area imagery to our military? Can our Air Force use our own satellite without any intervention? If we do not have one, then we can go to any country to borrow space in satellite.\n\nTechnology is very important. Our military can still do it if the technology is there. Why is it that there are people within the system who are sabotaging the technology? Technology I mean, for our military, we should have Helicopters that can see at night and so on. They are not being given. They are sabotaging our army, police and so on.\n\nBut our security forces have performed in other places where technology worked.\n\n“… Nigerians are being used today within and outside the country to drag the image of the country down. And every Nigerian must have the data for planning and any opportunity so that nobody would buy different SIM, adopt criminality to throw away the Subscriber Identity Module,(SIM).\n\nTherefore if the communication ministry has not finished, they should be given enough security much more than before to finish the job that when they put Seun or Khalifa, everything about Khalifa is there”\n\nVanguard News Nigeria\n\nKindly Share This Story:", "summary": "Kindly Share This Story:By Olayinka AjayiLAGOS — The Dean, Borno Elders Forum, Prof. Khalifa Dikwa, has insisted that some people in government were sabotaging the nation’s security agencies.\nKhalifa reiterated the need for technology to win the war against insecurity across that country saying: “Mr.\nWhy is it that there are people within the system who are sabotaging the technology?\nTechnology I mean, for our military, we should have Helicopters that can see at night and so on.\n“… Nigerians are being used today within and outside the country to drag the image of the country down.", "link": "https://www.vanguardngr.com/2021/04/insecurity-people-in-govt-sabotaging-security-agencies-borno-elders-forum/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["insecurity", "security", "money", "used", "sabotaging", "khalifa", "military", "satellite", "elders", "country", "weapons", "borno", "forum", "agencies", "govt", "technology"]}
{"title": "Three police officers dismissed for extorting traveller", "text": "The Nigerian Army has condemned the social media posting of photos of troops who died at the war front.\n\nBrigadier General Mohammed Yerima, Director of Public Relations, in a statement on Tuesday, said the act was insensitive and utterly reprehensible.\n\nThe spokesman said officers and soldiers deployed to various theatres of internal security operations are on legitimate duties and are in harm’s way to defend and protect the country from those who are intent on destroying it.\n\nYerima noted that in the course of carrying out this constitutional mandate, troops put their lives on the line to ensure that innocent citizens and institutions of the state are protected from violent criminals.\n\nThe General said in some cases, they are dealt the worst form of savagery by the heartless adversaries whose intent is to instil fear on the citizenry.\n\nHe said the Nigerian Army and its personnel understands the nature of their calling and are ever ready to confront any danger of adversity, noting that the publication and distribution of the gory pictures was offensive.\n\nThe Army said the unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members.\n\n“One can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.”\n\nThe Nigerian Army has now threatened to take legal actions to protect troops who die in action from being ridiculed on social media or any platform.", "summary": "The Nigerian Army has condemned the social media posting of photos of troops who died at the war front.\nBrigadier General Mohammed Yerima, Director of Public Relations, in a statement on Tuesday, said the act was insensitive and utterly reprehensible.\nThe General said in some cases, they are dealt the worst form of savagery by the heartless adversaries whose intent is to instil fear on the citizenry.\nHe said the Nigerian Army and its personnel understands the nature of their calling and are ever ready to confront any danger of adversity, noting that the publication and distribution of the gory pictures was offensive.\nThe Army said the unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members.", "link": "https://dailypost.ng/2021/04/27/three-police-officers-dismissed-for-extorting-traveller/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["media", "pictures", "social", "dismissed", "gory", "traveller", "personnel", "protect", "troops", "nigerian", "intent", "army", "officers", "extorting"]}
{"title": "“Desist from illegal movement out of Nigeria”- FG warns", "text": "The Permanent Secretary, Ministry of Interior, Dr Shuaib Belgore, has warned Nigerians to desist from illegal movement out of the country due to some challenges.\n\nBalgore gave the warning during an interview with newsmen on Tuesday in Abuja, NAN reports.\n\nHe expressed concern over the rate at which some Nigerians were moving out of the country to the extent of renouncing their citizenship even through illegal means.\n\nHe said that such acts could also lead to avoidable deaths and missing of some citizens as noted across the nation.\n\n“Protecting citizens right is part of what we are saddled with; we handle marriages and we handle citizenship issues; people trying to get citizenship into Nigeria, people who want special immigrant status.\n\n“Unfortunately, once in the while some Nigerians want to renounce their citizenship and we don’t want them to do that, except through constitutional rights of such movement.\n\n“We would like to advise Nigerians against taking some drastic actions due to the present circumstances faced by the country as an excuse to move out illegally to avoid getting into life-threatening problems.\n\n“Even if they want to, we advise they do it in a proper manner,” he said.", "summary": "The Permanent Secretary, Ministry of Interior, Dr Shuaib Belgore, has warned Nigerians to desist from illegal movement out of the country due to some challenges.\nHe expressed concern over the rate at which some Nigerians were moving out of the country to the extent of renouncing their citizenship even through illegal means.\nHe said that such acts could also lead to avoidable deaths and missing of some citizens as noted across the nation.\n“Protecting citizens right is part of what we are saddled with; we handle marriages and we handle citizenship issues; people trying to get citizenship into Nigeria, people who want special immigrant status.\n“Unfortunately, once in the while some Nigerians want to renounce their citizenship and we don’t want them to do that, except through constitutional rights of such movement.", "link": "https://dailypost.ng/2021/04/27/desist-from-illegal-movement-out-of-nigeria-fg-warns/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["citizenship", "desist", "nigeria", "country", "warned", "illegal", "nigerians", "trying", "fg", "handle", "warns", "citizens", "advise", "movement", "warning"]}
{"title": "Stop attacking police officers, AIG appeals to Nigerians", "text": "Agency Reporter\n\nOlasupo Ajani, the Assistant Inspector General of Police (AIG) in charge of Zone 11, has appealed to Nigerians to stop attacking the personnel of the force and see them as brothers and sisters.\n\nAjani made the appeal on Tuesday during a stakeholders’ meeting and his farmiliarisation visit to the police command in Oyo State at the command’s headquarters in Eleyele, Ibadan.\n\nAccording to the AIG, Nigerians do not respect the police as they used to before the EndSARS protest, adding that the police and the citizens have been working together peacefully before the EndSARS issues.\n\nHe said the EndSARS protest had created distance and disrespect between the police and the citizens.\n\n“You stakeholders that are here as representatives of the people; please sensitise your people and let us go back to the way we were before the EndSARS protests.\n\n“EndSARS has created a sort of vacuum and we want to reclaim the space again and be closer to the people; any police that want to be successful must have the support of the people.\n\nADVERTISEMENT\n\n“We must cooperate and work together for peace to reign in this country,” Ajani said.\n\nThe AIG warned some members of the Police Community Relations Committee (PCRC) that were conniving with some police officers to extort money from the people to desist from doing so.\n\nREAD ALSO: Police dismiss three officers for alleged extortion\n\nHe said all hands must be on deck to achieve peaceful coexistence in the country and stamp out crimes and criminality in the state.\n\nAjani called on the youth to shun drug abuse and respect the rule of law for the good of all.\n\nThe Eze Nudigbo, Dr Alex Anozie, Seriki Shasha, Alhaji Haruna Malyasin and representatives of the Olubadan of Ibadanland, Oloye Lekan Alabi, promised to talk to their subjects on the needs to be law abiding.\n\nThe traditional rulers said both the indigenes and non-indigenes would work as a family for the sustenance of peace in Oyo State.\n\nEarlier, the Commissioner of Police in the state, Ngozi Onadeko, said the state was relatively peaceful while officers and men were working tirelessly to surpass the present level of security in the state.\n\nOnadeko, however, listed some challenges faced by the command to include inadequate manpower, inadequate arms and ammunitions among others. (NAN)", "summary": "Agency ReporterOlasupo Ajani, the Assistant Inspector General of Police (AIG) in charge of Zone 11, has appealed to Nigerians to stop attacking the personnel of the force and see them as brothers and sisters.\nAccording to the AIG, Nigerians do not respect the police as they used to before the EndSARS protest, adding that the police and the citizens have been working together peacefully before the EndSARS issues.\nHe said the EndSARS protest had created distance and disrespect between the police and the citizens.\nThe AIG warned some members of the Police Community Relations Committee (PCRC) that were conniving with some police officers to extort money from the people to desist from doing so.\nOnadeko, however, listed some challenges faced by the command to include inadequate manpower, inadequate arms and ammunitions among others.", "link": "https://thenationonlineng.net/stop-attacking-police-officers-aig-appeals-to-nigerians/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["representatives", "endsars", "aig", "protest", "working", "appeals", "nigerians", "state", "stakeholders", "attacking", "work", "stop", "officers", "respect"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "text": "From Ndubuisi Orji, Abuja\n\nThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\n\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\n\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\n\nDetails later", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["insecurity", "rising", "chiefs", "session", "summon", "nsa", "countrythe", "speaker", "summoned", "services", "breaking", "house", "state", "reps", "urged", "security", "service"]}
{"title": "BREAKING: Federal high court Abakaliki on fire", "text": "From Chijioke Agwu Abakaliki\n\nA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\n\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\n\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\n\nDetails later.", "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.", "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["court", "federal", "later", "gutted", "went", "abakaliki", "reportdetails", "located", "hours", "breaking", "high", "state", "highway", "tuesdaythe"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "text": "Says consequences of insecurity will affect all nations\n\nAsks US to relocate AFRICOM headqurters to Africa\n\nBy Deji Elumoye\n\nPresident Muhammadu Buhari has canvassed for the support of the United States in the move by Nigeria and West African sub region to tackle security challenges in order to avoid spillovers.\n\nHe also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\n\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n\nSaid he: “The security challenges in Nigeria remain of great concern to us and impacted more negatively, by existing complex negative pressures in the Sahel, Central and West Africa, as well as the Lake Chad Region.\n\n“Compounded as the situation remains, Nigeria and her security forces remain resolutely committed to containing them and addressing their root causes. The support of important and strategic partners like United States cannot be overstated as the consequences of insecurity will affect all nations hence the imperative for concerted cooperation and collaboration of all nations to overcome these challenges”.\n\nFlowing from this, the President stressed that the US Africa Command (AFRICOM) which partners with countries to counter transnational threats, should be relocated to Africa to strengthen ongoing efforts to check the security situation, with likely effect on other nations.\n\n“In this connection, and considering the growing security challenges in West and Central Africa, Gulf of Guinea, Lake Chad region and the Sahel, weighing heavily on Africa, it underscores the need for the United States to consider re-locating AFRICOM Headquarters from Stuttgart, Germany to Africa and near the Theatre of Operation,’’ he said.\n\nAccording to him, Nigeria will enhance collaborations in all forms, with friends and strategic partners, to work together for greater security for all, which remain the most significant condition for overcoming the existential challenges.\n\nPresident Buhari while congratulating Blinken on his appointment by President Joe Biden commended the United States for the decision to repeal the immigration restriction known as the “Muslim ban’’, re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\n\nHis words: “Nigeria attaches great importance to its relations with the United States. Let me in this connection express appreciation to President Joe Biden for his welcome and reaching decision to repeal the Immigration restriction known as the ‘Muslim ban’ on travel and visas for citizens predominantly from Muslim Nations and African Countries, including Nigeria.\n\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change. The leadership of the United States in these two organizations is crucial for international community. This action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.\n\nHe noted that Nigeria remains resolute in her commitment to supporting global efforts as enshrined in the Paris Agreement on Climate Change, which seeks to limit global warming and reduce greenhouse gas emissions.\n\n\n\nAccording to the President, the convening of the Climate Change Summit last week by President Biden was a strong indication of the renewed interest of the United States to the Paris Agreement.\n\n“I would like to extend our goodwill message to President Joe Biden and his Administration. May I also thank you for initiating this meeting, which I am confident, given your background and current position, you will use to promote the existing bilateral relations between our two countries,’’ he said.\n\nOn his part, the US Secretary of State said he was pleased to make Nigeria part of his “first virtual visit to Africa,” noting that Nigeria and the United States of America, share a lot in bilateral issues.\n\nHe added that he would be delighted to build on the foundation laid over 60 years ago between the two countries, disclosing that areas of discussion with Nigeria would include “how to build our economies back after the COVID-19 pandemic, security for vulnerable communities, and climate issues.”\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["security", "meeting", "climate", "countries", "blinken", "united", "states", "nigeria", "africa", "seeks", "paris", "buhari", "president", "tackle", "challenges", "help"]}
{"title": "Osinbajo: Nigeria will Overcome Current Security Challenges", "text": "Says nation’s security architecture being re-organised\n\nBy Deji Elumoye in Abuja\n\nVice-President Yemi Osinbajo has given an assurance that Nigeria will soon overcome the current security challenges it is facing.\n\nHe also disclosed that the nation’s security architecture is being re-organised with a view to achieving optimal result.\n\nThe vice-president, according to a release issued on Tuesday by his spokesman, Laolu Akande, stated this while playing host to His Royal Majesty, Yakanaje Uke in Nasarawa State, Alhaji Ahmed Abdullahi Hassan, with a promise that the present challenges will prepare Nigeria for a greater and prosperous future, urging the traditional institution to support the re-engineering process.\n\nHe said: “I believe strongly that the reason why we are experiencing what we are going through today is because we are being prepared for the future. A future where we will take into account all of the problems because if we haven’t gone through the problems we are going through now, it will be difficult for us to appreciate the importance of fairness and justice, the importance of giving people a voice and a representation. I am very pleased to hear about what you are doing.\n\n“There is no question at all that we are facing security challenges, but we are able to overcome them. The role of the leadership is to sit down to think through the problems.\n\n“This is a big country, so policing is very difficult. There is a need for us to reorganize our security architecture, which is what is going on now.\n\n“One of the reasons why we have some of the divisions and conflicts in the parts of the country is because people do not feel included in the management of affairs in their localities.”\n\nCommending the emir for his leadership style, the vice-president said: “I think you have created an opportunity where the options are available for bringing appeals to a centre of fairness and justice for people from across the country, and its one that is to be emulated.\n\n“And I think that this is the way Nigeria should be. We should be able to say that no matter where you are from, if you have the talent, if you work hard, you will succeed wherever you are. You will not be constrained by your political, ethnic or religious affiliations.\n\n“Every great society that has succeeded in the world is multiethnic and they succeeded because they brought in talents from all over the place.”\n\nThe vice-president urged traditional rulers to leverage the influence they have over communities to effect positive change for the good of the entire society.\n\nCommending the efforts of the emir in promoting unity and peaceful coexistence, the vice-president noted that: “I have heard a lot about the work that is going on and particularly fascinating for me is the fact that you have somehow managed to bring together a representation of Nigeria into the management of the affairs of your kingdom.”\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n", "summary": "Says nation’s security architecture being re-organisedBy Deji Elumoye in AbujaVice-President Yemi Osinbajo has given an assurance that Nigeria will soon overcome the current security challenges it is facing.\nHe also disclosed that the nation’s security architecture is being re-organised with a view to achieving optimal result.\n“There is no question at all that we are facing security challenges, but we are able to overcome them.\nThere is a need for us to reorganize our security architecture, which is what is going on now.\n“And I think that this is the way Nigeria should be.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/osinbajo-nigeria-will-overcome-current-security-challenges/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["architecture", "current", "vicepresident", "nigeria", "overcome", "country", "future", "osinbajo", "going", "work", "challenges", "think", "security"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "text": "During the weekend, a member of the House of Representatives from Toro Federal Constituency of Bauchi state, Umar Muda Lawal on his Twitter page shared pictures of deep wells he said he was constructing in some towns and villages in his constituency.\n\n“This time we are going outside the box to construct 10 deep wells in 10 rural towns and villages of Toro Local Government Area (LGA), because traditional wells are often more reliable and last longer than any modern small-scale water supply system. Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\n\n\n\n\n\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA. Because Traditional Wells are often more reliable and lasts longer than any modern small-scale water supply system. Most Wells today are centuries old and still working. pic.twitter.com/ZhUi7UoIdE — Hon. Umar Muda Lawal (@Hon_UML) April 22, 2021\n\nA check by SaharaReporters using advanced technology however showed that the post which had been retweeted by over 1, 400 users were downloaded from the internet and not ongoing in Toro Federal Constituency as claimed by the All Progressives Congress (APC) lawmaker.\n\n\n\n\n\nHouse Of Representatives Member Constructs â\u0080\u009810 Deep Wellsâ\u0080\u0099 As Constituency Projects | Sahara Reporters\n\nLawal said he embarked on the project based on the popular demand of his people. @Hon_UML @HouseNGR\n\nREAD MORE: https://t.co/Ezgls3Wv8r pic.twitter.com/OgWR98Pi5B — Sahara Reporters (@SaharaReporters) April 26, 2021\n\nThe first picture posted by the lawmaker, according to google reverse image search was downloaded from watertothrive.com\n\nWater to Thrive is a faith-based nonprofit organisation that transforms lives through the gift of clean water.\n\nA check on the second picture by SaharaReporters showed it was downloaded from www.123rf.com.\n\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\n\nThe coordinator of the group, Comrade Mallam Abdulrahman Abdullahi alleged that Lawal was not accessible to his constituents.\n\nHe was also accused of being ineffective and performing poorly in legislative activities at the National Assembly.\n\nThe group asked to know what the lawmaker had been doing there over the years.\n\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["pictures", "constituency", "internet", "towns", "projects", "apc", "exposed", "saharareporters", "wells", "toro", "downloaded", "villages", "lawal", "deep", "posted", "lawmaker", "group"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "text": "During the weekend, a member of the House of Representatives from Toro Federal Constituency of Bauchi state, Umar Muda Lawal on his Twitter page shared pictures of deep wells he said he was constructing in some towns and villages in his constituency.\n\n“This time we are going outside the box to construct 10 deep wells in 10 rural towns and villages of Toro Local Government Area (LGA), because traditional wells are often more reliable and last longer than any modern small-scale water supply system. Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\n\n\n\n\n\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA. Because Traditional Wells are often more reliable and lasts longer than any modern small-scale water supply system. Most Wells today are centuries old and still working. pic.twitter.com/ZhUi7UoIdE — Hon. Umar Muda Lawal (@Hon_UML) April 22, 2021\n\nA check by SaharaReporters using advanced technology however showed that the post which had been retweeted by over 1, 400 users were downloaded from the internet and not ongoing in Toro Federal Constituency as claimed by the All Progressives Congress (APC) lawmaker.\n\n\n\n\n\nHouse Of Representatives Member Constructs â\u0080\u009810 Deep Wellsâ\u0080\u0099 As Constituency Projects | Sahara Reporters\n\nLawal said he embarked on the project based on the popular demand of his people. @Hon_UML @HouseNGR\n\nREAD MORE: https://t.co/Ezgls3Wv8r pic.twitter.com/OgWR98Pi5B — Sahara Reporters (@SaharaReporters) April 26, 2021\n\nThe first picture posted by the lawmaker, according to google reverse image search was downloaded from watertothrive.com\n\nWater to Thrive is a faith-based nonprofit organisation that transforms lives through the gift of clean water.\n\nA check on the second picture by SaharaReporters showed it was downloaded from www.123rf.com.\n\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\n\nThe coordinator of the group, Comrade Mallam Abdulrahman Abdullahi alleged that Lawal was not accessible to his constituents.\n\nHe was also accused of being ineffective and performing poorly in legislative activities at the National Assembly.\n\nThe group asked to know what the lawmaker had been doing there over the years.\n\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects#disqus_thread", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["pictures", "constituency", "internet", "towns", "projects", "apc", "exposed", "saharareporters", "wells", "toro", "downloaded", "villages", "lawal", "deep", "posted", "lawmaker", "group"]}
{"title": "Kidnappers release another video of Afaka students", "text": "Bandits have released a second video of students abducted from the Federal College of Forestry Mechanisation, Afaka, Kaduna state.\n\nAdvertisement\n\nIn March, bandits attacked the college located in Igabi LGA and abducted the students, but 172 of them were rescued, leaving 39 in captivity.\n\nOf the 39 in captivity, 10 have regained their freedom.\n\nA video of the abductees had initially been released on March 13.\n\nAdvertisement\n\nIn a recent video which surfaced online on Tuesday, the students appealed to their parents and the government to facilitate their release.\n\nOne of the students, identified as Benson Emmanuel who appeared in the previous video, was also in the recent recording.\n\n“Please, we are begging on our parents to please come and help us out of here. We have stayed here for days, we have not been eating, some us have been sick. Please, we’re begging our parents to come and help us out of here. We’re tired,” Emmanuel said in the video which was released on Tuesday.\n\nAdvertisement\n\nAnother student, who identified himself as Yahaya Paul, said: “Please, we are calling on our parents to help us, to come and take us out of here. They should try their best to [take] us out of here. We are suffering. Some of us are sick. We’ve not been eating well. Please, parents, help us so we can come out of this place.”\n\nThe video also featured a woman said to be the wife of military officer who was abducted from her home in Tirkania-Agwa, Chikun LGA of Kaduna.\n\nShe said her husband is a naval officer working in Warri, Delta state, while urging the federal government to come to their rescue.", "summary": "Bandits have released a second video of students abducted from the Federal College of Forestry Mechanisation, Afaka, Kaduna state.\nAdvertisementIn March, bandits attacked the college located in Igabi LGA and abducted the students, but 172 of them were rescued, leaving 39 in captivity.\nAdvertisementIn a recent video which surfaced online on Tuesday, the students appealed to their parents and the government to facilitate their release.\nOne of the students, identified as Benson Emmanuel who appeared in the previous video, was also in the recent recording.\n“Please, we are begging on our parents to please come and help us out of here.", "link": "https://www.thecable.ng/kidnappers-release-another-video-of-afaka-students", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["abducted", "recent", "afaka", "parents", "students", "come", "released", "kidnappers", "release", "officer", "video", "sick", "help"]}
{"title": "Kano DisCo signs MoU with Konexa to deploy renewable energy solutions", "text": "The Kano Electricity Distribution Company (KEDCO) has signed a memorandum of understanding (MoU) with Konexa, a renewable energy developer, for electricity generation, storage and distribution.\n\nAdvertisement\n\nThe agreement was signed by KEDCO, Konexa and the Nigeria Sovereign Investment Authority (NSIA) at the British High Commission in Abuja.\n\nAccording to the agreement, Konexa will invest $100 million to provide cutting-edge technology in deploying renewable energy solutions.\n\nPradeep Pursnani, chief executive officer of Konexa, said the agreement “is backed by the Nigeria Sovereign Investment Authority (NSIA)” and would produce and distribute 10 megawatts (MW) of electricity to 30,000 consumers in Kano.\n\nAdvertisement\n\n“In this partnership, Konexa will bring investment, provide better service for the customers and help bring the discos to financial health,” Pursani said.\n\nHe explained that in improving generation capacity, Konexa would deploy solar power, hydropower, and biopower technologies, adding that the project will be completed by next year and hopes to replicate same project in other states.\n\n“In Kaduna, we will deliver before the end of the year, the investment is around $90 million.\n\nAdvertisement\n\n“In Kano we are estimating the project cost to be well over $100 million.”\n\nIn her remarks, Aisha Abba-Kyari, associate vice-president at NSIA, said: “We (NSIA) are actually the funds and project managers for the 10 megawatts solar power plants in Kano State.\n\n“It is a presidential initiative which coincided with Konexa and KEDCO’s franchise model that they are developing in the same area.”\n\nShe said the project was designed to benefit both communities and industrial clusters.\n\nAdvertisement\n\nIn October 2020, Konexa partnered with Kaduna Electricity Distribution Company (KAEDCO) to co-develop a private renewable energy generation and distribution sub-franchise project in the state.\n\nIt also signed an agreement in November 2020 with the Ogun state government on an investment plan of a 250MW integrated distribution model to service over 50,000 connections.", "summary": "The Kano Electricity Distribution Company (KEDCO) has signed a memorandum of understanding (MoU) with Konexa, a renewable energy developer, for electricity generation, storage and distribution.\nAdvertisementThe agreement was signed by KEDCO, Konexa and the Nigeria Sovereign Investment Authority (NSIA) at the British High Commission in Abuja.\nAccording to the agreement, Konexa will invest $100 million to provide cutting-edge technology in deploying renewable energy solutions.\nAdvertisement“In this partnership, Konexa will bring investment, provide better service for the customers and help bring the discos to financial health,” Pursani said.\nAdvertisementIn October 2020, Konexa partnered with Kaduna Electricity Distribution Company (KAEDCO) to co-develop a private renewable energy generation and distribution sub-franchise project in the state.", "link": "https://www.thecable.ng/kano-disco-signs-mou-with-konexa-to-deploy-renewable-energy-solutions", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["renewable", "agreement", "deploy", "nsia", "electricity", "signed", "mou", "investment", "distribution", "energy", "project", "signs", "kano", "disco", "konexa", "solutions"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "text": "“No matter your race, gender or socioeconomic status, health is a fundamental human right and no one should be left out”\n\nThis was said by Itoro Inoyo, co-founder of Clafiya, in one of Clafiya’s explainer videos on YouTube.\n\nIn more developed nations, Itoro’s words would be accepted as an unarguable truth, but in a developing country like Nigeria with a laggard healthcare sector, her words only apply to a small crop of individuals who can afford healthcare.\n\nThe situation surrounding the Nigerian healthcare system has deteriorated such that the president and other politicians can’t risk receiving medical care in the country.\n\nIn 2017, Nigeria’s president, Muhammadu Buhari, spent more than three months abroad for a medical trip. His most recent trip happened a few weeks ago. A crucial question here is this: if Nigeria’s president – the most powerful man in the country – can’t access proper medical care in the country, how can the average citizen access quality healthcare? Nigerians worry that Buhari’s frequent medical trips abroad are an indication that the country’s healthcare system is far from getting fixed.\n\nTrying to bridge the healthcare gap in Nigeria, Jennie conceived Clafiya\n\nJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger. She wasn’t able to put a proper framework around her idea until she began studying for her master’s degree in system engineering and management at Georgetown University.\n\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old. Growing up in an affluent family meant that her parents tried to shield her from the various issues that plagued Nigeria. But Jennie was an inquisitive teenager who was sensitive enough to know that access to healthcare in the country was and is still impossible for the larger populace.\n\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\n\n“So that was a profound experience that had stayed with me all this time and has become something I want to solve.” She wanted to build a system outside of a hospital setting because, according to her, “there are ways to adjust this problem and you don’t necessarily have to be a doctor to do that.” Her hunger to figure out how to address the healthcare problem in Nigeria, is what gave birth to Clafiya.\n\nMeeting Itoro and leveraging partnership\n\nJennie met Itoro at a concert in 2016. They had lengthy conversations about the Nigerian labour market and access to healthcare services in the country. Itoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.\n\nItoro Inoyo has worked in the healthcare sector for several years. She studied at the University of Massachusetts Lowell where she got a bachelor’s degree in biological science. She also obtained a master’s degree in public health from Drexel University Dornsife School of Public Health.\n\nAlthough she wasn’t officially a co-founder yet, Itoro’s candid advice to Jennie at the initial stage came from her wealth of experience as she has travelled through sub-rural communities in Nigeria following her work as a gender and PED analyst.\n\nA turning point in their working relationship came in 2020 when Itoro discovered a pitch competition led by Women in Global Health.\n\n“We applied for that, and people assumed we were co-founders. We had a great working relationship and so we decided to do it.”\n\nClafiya ended up winning the grant.\n\nThe winner of the #BuildBackBetterChallenge for their digital innovation is…@Clafiya1!!!\n\n\n\nWe are so excited to present Clafiya with a prize of $20K to implement and market their innovation. Can't wait to see the impact of your digital health solution#COVID5050 @NovartisFDN pic.twitter.com/gS2wQraYkP — Women In Global Health (@womeninGH) November 19, 2020\n\nHow Clafiya works\n\nClafiya is a digital platform that connects patients in semi-urban and rural areas to Community Health Workers (CHWs). It provides primary care services to people from the comfort of their homes.\n\n“With our short USSD code, Nigerians with limited access to primary care services can register, pay, and request for the nearest registered CHW to administer home-based services,” says Jennie.\n\nClafiya leverages AI to apply predictive analytics to geotagged USSD messages for disease surveillance of emerging disease outbreaks in rural and remote regions.\n\nThis also enables government agencies and policy-makers to make data-driven decisions on resource allocation in impacted regions.\n\nThere are two processes to gain access to the platform, the registration process and the appointment scheduling process.\n\nUsing USSD, a potential customer will dial the codes *347*58# and then proceed to answer a few personal questions. Once you have successfully registered on the platform, you’ll receive a text message, and will be led to buy a plan.\n\nClafiya has four different plans: Basic (Pay As You Go), Single Plan, Maternity Care, and Family. After a prospective Clafiya user picks and pays for a plan, they are registered on the platform and enabled to schedule appointments.\n\nThe Basic, otherwise known as pay as you go (PAYG) plan costs ₦2000 ($4.9). Jennie says the PAYG plan was designed to enable people to pay out of their pockets.\n\n“We’re hoping that as we penetrate these communities, people would subscribe to what I would call the quasi insurance plan, where the prices start at ₦3000 ($7.3) for a single plan but that covers all of the primary care services that we are providing except the maternity care plan.”\n\nThe maternity package costs ₦3500 ($8.5). The most expensive medical package is the family plan at ₦5000 ($12.2).\n\nTesting stage and gaining access\n\nJennie said in our chat that Clafiya was built to meet customers wherever they are.\n\nIn their field analyses and initial testing stage, Itoro revealed that a lot of Nigerians, especially women, were afraid to go to healthcare facilities. This, she said, was due to the outbreak of the COVID-19 pandemic.\n\n“We wanted to build a solution that can potentially work for the everyday Nigerian, even if you’re in a higher socioeconomic status.”\n\nIn Nigeria, a large percentage of the population is still not connected to the internet so as much as the internet business is scaling, a huge number of people are being left behind.\n\nItoro said “Clafiya wanted to meet the needs of populations that the majority of systems have forgotten. That’s why we decided to do home-based services to bring those services to people’s doorsteps.”\n\n“Everyone is building apps, right? And the average Nigerian, although they have a phone, may not have a smartphone, if you have a smartphone, you may not have data, if you have data, you may have network issues that limits access to the service. USSD is the closest way to read the minority population.”\n\nThe Clafiya team has done their research, tested their tools, and according to them, one of the things people really seem to like about the USSD service is that it allows them to be in the driver’s seat of their health. They get to call the healthcare workers who come to the services and totally be in control of who attends to them and at what time.\n\nBuilding Clafiya as women\n\nClafiya is currently running in Enugu, a state in the southeastern part of Nigeria and while they are planning to expand into other parts of the country, it took quite an effort to get the proper data needed to access potential customers. Jennie loves to put it that they were “shamelessly” going to government offices and waiting for long hours in order to get the data they needed.\n\nBuilding confidence as a woman is one way to scale through some huddles when dealing with people.\n\n“Some people won’t take me seriously just because I’m a woman. They look at me as a small girl. But I think once you’re able to present the facts and you’re serious about it, they tend to take you a little bit more seriously,” Jennie told me.\n\nItoro also said leveraging on existing relationships she has with healthcare workers has made their journey a lot easier.\n\nWhy Clafiya is different\n\nThey are not in Lagos.\n\nIn Nigeria, every major tech startup will likely have its audience base in Lagos. With home-grown startups like Flutterwave and Paystack, Lagos is arguably Africa’s most attractive tech hub for talent, opportunities and investors.\n\nWhile Lagos has the largest market size for any kind of business in Nigeria, other communities are often left out when new initiatives and technologies come to Nigeria.\n\nThe decision to start off in Enugu is so that the broader Nigerian population can have access to the service and not be left out. However, moving forward, Clafiya plans to expand to other communities in Nigeria.\n\nJennie and Itoro say the major objective of building the product is so they can prove that access to quality health is a fundamental right for everyone, no matter your race, gender, or socioeconomic status.", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["healthcare", "nwokoye", "inoyo", "bringing", "medical", "nigeria", "access", "plan", "services", "jennie", "hospitaltohome", "rural", "communities", "health", "itoro", "clafiya"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "text": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system. But there are concerns about fair competition.\n\nOn the 29th of March this year, the Nigeria Interbank Settlement Scheme (NIBSS) published an important document.\n\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual. It explains how banks should enrol and verify customers for BVNs, and how institutions can access the BVN system.\n\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\n\nThe ambition was noteworthy: to create a biometric-based standard for verifying client identity and enabling safe, seamless electronic payments. That standard was actually supposed to be the National Identification Number (NIN) but banks floated BVNs following several government delays on the NIN project.\n\nCombating fraud in the system\n\nBVN has become a core pillar of Nigeria’s anti-money laundering and combating of financial terrorism (AML/CFT) framework. It has driven the rise of Nigerian fintech; payments, savings, lending and even cryptocurrency startups have relied on it.\n\nAmong its other powers, NIBSS determines who can and cannot have access to BVNs. Some weeks ago, they showed this power by cutting some fintechs off the BVN system.\n\nReactions swirled that it was a move by deposit money banks (who co-own NIBSS) to protect themselves against competition from fintechs. But according to a highly placed source at a bank, the move was a necessary response to “alarming proportions” of fraud that have been traced to December 2020.\n\nThe short version of the fraud story is that when an individual at virtually any commercial bank in Nigeria opened an account, a fraudster who has got access to their BVN and account number would call them on the phone.\n\nIt is not clear how fraudsters get remote access to customer information but the problem only affected customers who opened or reactivated bank accounts from around the middle of December.\n\nThe fraudster would have downloaded the customer’s bank app. To take control of the account, they would ask the customer to hand over a one-time password sent by the bank.\n\nThe scam was being attempted on anyone including some bank staff, the source said. But banks were alarmed because a major target group was serving members of Nigeria’s National Youth Service Corps (NYSC).\n\nNYSC mobilises about 250,000 Nigerian graduates each year and is a source of new accounts for banks.\n\nIn that framing, NIBSS’s new 49-page document clarifies and tightens the BVN system for the safety of Nigeria’s financial system.\n\nAccess to the BVN database\n\nBanks and fintechs access the BVN database through Application Programming Interface (API) calls. The CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.\n\nThere are two tiers of access: tier 1 and tier 2. Both are differentiated by the need for CBN approval and the number of data fields they can access.\n\nEsigie Aguele, CEO of VerifyME, explains that NIBSS gives different levels of access to cater to different use cases. Banks have access to more demographic data because their operating license imposes strict KYC and AML requirements.\n\nApart from banks, any organisation that wants to access customers’ information must first get customers’ consent.\n\nThis consent is split into two; one for demographic data and another for details like account number and names in different banks. When an organisation needs any of these details, NIBSS will notify customers, indicating what their consent is being asked for.\n\nFintechs cannot store BVN data on their database for later use. So if there is downtime at NIBSS, there will be no alternative way to do verifications with vendors until the service is back up.\n\nAguele says this is a reasonable requirement for data security in line with Nigeria’s Data Protection Regulation. But he thinks there should be more clarity from NIBSS on how fair the playing field will be under the guidelines.\n\n“The fact of the matter is that NIBSS is a private institution and should not be regulating data access to companies that could potentially be their competitor.”\n\n“Many of these fintechs are releasing products that will compete with what NIBSS offers to banks; CBN still needs to update the framework to cater to this reality.”\n\nVerifyMe offers a facial recognition service that is in competition with NIBSS’s product. With NIBSS in control of some of the data useful for that purpose, Aguele believes an antitrust issue arises which should be clarified by the CBN.\n\n“Ideally, NIBSS should not be treated as an agency. There needs to be an independent committee that handles these responsibilities.”\n\nWhat are the alternatives?\n\nOn a phone call, a spokesperson for NIBSS said fintechs will find all answers they need for compliance to the BVN system within the new guidelines.\n\nFintech startups like Carbon, Fairmoney and Branch that have licenses that allow them to take user deposits continue to enjoy BVN matching access.\n\nBut the new guidelines might push some fintechs to begin using NIN as a substitute for BVN for their verification purposes. QuickCheck, a digital lending app, now requests NIN from users who want to sign up.\n\nAguele says VerifyMe can be a channel for fintechs without direct access, though the identity technology startup will first have to secure a license from the CBN to provide that service.", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["bank", "save", "scams", "bvn", "access", "fair", "nibss", "umpire", "fintechs", "customers", "number", "nigerias", "data", "banks"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "text": "The 39 students of the Federal College of Forestry Mechanisation, Afaka, Igabi Local Government Area of Kaduna State, have appealed to the government not to use force to free them, just as their kidnappers have threatened to kill all of them if soldiers are sent to rescue them.\n\nIn two videos released by the kidnappers on Saturday, the first video showed one of the student, Benson Emmanuel, who was sitting down without shirt with AK-47 rifle pointed at him, said he is appealing to the government to come to their rescue.\n\n“I am appealing to the the government to come and rescue us by giving them what they want. Most of us are badly injured. Most of us are having health issues.\n\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen. They said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\n\n“So we are appealing to government to rescue us by giving them what they want.\n\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us. We are in trouble. Our Iives are in danger. They tell us that they heard soldiers will be sent to rescue us. They told us if they see any soldiers around, we are all going to die.”\n\nMeanwhile, a student of the school, Miracle Jacob, identified 11 of the abducted students from the video and gave their names as Rose Okoye, Kauna Daniel, Blessing Babale, Regina John, Rachel Adejimo, Benson Emmanuel, Susan Jatau, Amina Yusuf Sale, Jamila Yusuf Sale, Sarah and Maman Ahmed.", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "run": "04/27/2021", "keywords": ["dont", "appeal", "sent", "appealing", "sale", "student", "video", "kidnapped", "students", "come", "yusuf", "free", "force", "soldiers", "govt", "rescue"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "text": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta\n\nDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\n\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No. AG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\n\nThe Divisional Police Officer (DPO), Abraka Police Station, CSP Aliyu Shaba, reportedly led his men to evacuate the corpses identified as those of Kelvin Izakpa (10yrs) and seven-year-old Fega Izakpa, both children of late Meshach Izakpa.\n\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\n\nALSO READ: Auchi Poly bans students from driving private cars on campus\n\nThe decomposing corpses have been handed over to the family for burial while the suspect, Eniku Aghogho Tayo, has been arrested, and his vehicle impounded, amid further investigation.\n\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.\n\nThe suspects were identified as Monday Ofomukoro, Prince Akpojaro and Godday Doutimiareye and were caught in possession of about 50 wraps and two other unwrapped stones of illicit drugs suspected to be cocaine.\n\nOne of the suspects, Ofomukoro, allegedly confessed to have been in the illicit business for some years.\n\nSimilarly, the police patrol team from ‘A’ Division, Warri in the early hours of Saturday, after raiding another black spot at Panapina by NPA in Warri, nabbed a suspected cultist, Ebi Anda with some quantity of substance suspected to be Indian hemp in about three medium size nylon bag compartments, and about 50 pieces of razler wrap, one battle axe and two daggers.\n\nFurther raids, as gathered, led to the apprehension of Gbobobo Obaro, who was allegedly caught red-handed while attempting to snatch mobile phones belonging to two supposed passengers around Morogun axis of the oil city.\n\nThe suspect, after a hot chase, was nabbed at Effurun roundabout and two android phones recovered from him, while his confession led to the arrest of the receiver of the stolen phones, one Sani Amadu who lives at Igbudu Market.\n\nMeanwhile, Acting Police Public Relations Officer (PPRO), Delta Police Command, Bright Edafe, a Deputy Superintendent of Police (DSP), who confirmed the arrests and recoveries, said further interrogations were ongoing to ensure there was no miscarriage of justice.\n\nNIGERIAN TRIBUNE", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "run": "04/27/2021", "keywords": ["drug", "suspects", "suspected", "phones", "abraka", "led", "warri", "bodies", "corpses", "recovered", "siblings", "delta", "decomposing", "recover", "car", "arrest", "peddlers"]}
{"title": "Registration: JAMB introduces USSD code – Nigerian Observer", "text": "Share Facebook\n\nTwitter\n\nStumbleupon\n\nLinkedIn\n\nPinterest\n\nBWARI (ABUJA) – The Joint Admissions and Matriculations Board (JAMB) says the board will introduce the use of USSD code as an option to the SMS process of generating a profile code for registration.\n\nThis, it said, was part of measures it had put in place to address some challenges experienced by candidates of its Unified Tertiary Matriculation Examination (UTME).\n\nThe Registrar of the board, Prof. Is-haq Oloyede, disclosed this during a news briefing at the board’s headquarters in Bwari, Abuja, on Monday.\n\nOloyede said the use of the USSD code would commence from Friday, April 30.\n\nHe said the board had received complaints especially by parents of candidates who had tried to register their children and wards but had been unsuccessful.\n\nHe said that service providers had, however, continued to extort candidates by deducting N50 SMS charges at each trial to generate a profile without a positive response.\n\n” Parents are being extorted when sending requests unsuccessfully and at the end, nothing comes or is delayed by network and yet, N50 is being charged and deducted.\n\n” You must note that this charges do not come to JAMB but to the service providers.\n\n” Therefore, we have asked all those concerned to go back and ensure that where a service is not fully rendered and charges were deducted, such monies should be refunded to the candidates.\n\n” JAMB do not have the capacity to enforce this refund or monitor compliance but we are expanding our stakeholders to include Federal Competition and Consumer Protection Commission to do it.\n\n” They will join our task force to check on any act of extortion, while we also invite Nigerian Communications Commission (NCC) to monitor and check on these service providers.\n\n” Another option we are creating asides sending an SMS to 55019 to generate a profile code will include dialing *55019*1*NIN#.\n\n” This will, however, take effect from Friday, April 30,” he said.\n\nThe registrar, who frowned at candidates’ inability to follow the right procedure for the exercise, also said that the board, alongside its major stakeholders, had agreed to accommodate common errors made during the registration process.\n\nSome of the errors, he noted, were candidates mistakenly sending ‘NIN’ with no space before typing the actual number.\n\n” Some type without spacing, some include comas and even hyphen.\n\n” We have tried to enlighten the public on how to send and receive a successful profile code but candidates seem to get it wrong. We will work out modalities to accommodate all these common errors.\n\n” That is to say that, whether one puts space or not, hyphen or commas, the message should be able to deliver.\n\n” We have asked the service providers to go back and adjust their systems so that such errors are accommodated and we will also go back to the drawing board and incorporate these errors into our systems.\n\n” This should take five days starting from today. We believe that after Friday, April 30, those who make such common errors should be able to generate a profile code,” he said.\n\nOloyede also said that candidates who had registered for UTME in the previous year could also generate a code with the same telephone number, following the 2021 process of generating a profile code.\n\nHe explained that the only difference between the previous registration process and that of this year was the inclusion of NIN.\n\nThe same code, he stated, might be sent to the candidate but would have undergone an upgrade from the board’s system.\n\nHe also noted that the board was connecting effectively with the National Identity Management Commission (NIMC) on the registration process and have had not much to worry about.\n\n...", "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestBWARI (ABUJA) – The Joint Admissions and Matriculations Board (JAMB) says the board will introduce the use of USSD code as an option to the SMS process of generating a profile code for registration.\n” You must note that this charges do not come to JAMB but to the service providers.\n” They will join our task force to check on any act of extortion, while we also invite Nigerian Communications Commission (NCC) to monitor and check on these service providers.\n” Another option we are creating asides sending an SMS to 55019 to generate a profile code will include dialing *55019*1*NIN#.\n” We have tried to enlighten the public on how to send and receive a successful profile code but candidates seem to get it wrong.", "link": "http://nigerianobservernews.com/2021/04/registration-jamb-introduces-ussd-code/", "published": "04/26/2021", "run": "04/27/2021", "keywords": ["service", "providers", "code", "ussd", "observer", "errors", "generate", "candidates", "process", "jamb", "sms", "nigerian", "registration", "profile", "introduces", "board"]}
{"title": "Web Story 19 Jan", "text": "Night-grazing is banned with immediate effect. Movement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed. those who wish to carry on with their cattle-rearing business to register", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "run": "04/27/2021", "keywords": ["register", "cattle", "outlawed", "highways", "prohibited", "nightgrazing", "web", "wish", "immediate", "jan", "underaged", "movement", "19"]}
{"title": "Nigerian Army protests against sharing graphic pictures of soldiers killed in action, threatens legal action", "text": "OBINNA EZUGWU\n\nThe Nigerian Army has condemned in the strongest term possible, what it described as “the indiscriminate sharing on social media of graphic pictures of personnel who paid the supreme price in the cause of defending and protecting the country from its adversaries.”\n\nThe Army which conveyed its protest over the development in a statement by its spokesman, Brig. Gen. Mohammed Yerima on Tuesday, said the act is “not only unpatriotic but very insensitive and utterly reprehensible,” while threatening to take legal action against anyone seen sharing such images.\n\nAccording to the statement, “Officers and soldiers of the Nigerian Army deployed to various theatres of internal security operations are on legitimate duties and are in the harm’s way to defend and protect the country from those who are intent on destroying it.\n\n“In the course of carrying out this constitutional mandate, troops put their lives on the line to ensure that innocent citizens and institutions of the state are protected from violent criminals. In some cases, these gallant officers and soldiers are meted with the worst form of savagery by the heartless adversaries whose intent is to instill fear on of the citizenry.\n\n“While the Nigerian Army and its personnel understand the nature of the noble calling and are ever ready to confront any danger of adversity on the way, what is most unfathomable is the glee with which some people share the gory pictures of officers and soldiers who are either killed-in-action or Wounded-in-action in the media.\n\n“These unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members. In some cases, their loved ones do find out about their unfortunate death in such callous manner before they are even contacted by the military authorities. One can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "summary": "Gen. Mohammed Yerima on Tuesday, said the act is “not only unpatriotic but very insensitive and utterly reprehensible,” while threatening to take legal action against anyone seen sharing such images.\nIn some cases, these gallant officers and soldiers are meted with the worst form of savagery by the heartless adversaries whose intent is to instill fear on of the citizenry.\n“These unpatriotic acts are often done without any modicum of consideration for the memories of the departed personnel or their family members.\nOne can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "link": "https://hallmarknews.com/nigerian-army-protests-against-sharing-graphic-pictures-of-soldiers-killed-in-action-threatens-legal-action/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["threatens", "unpatriotic", "way", "sharing", "killed", "pictures", "graphic", "social", "officers", "action", "personnel", "legal", "nigerian", "troops", "protests", "army", "soldiers"]}
{"title": "African V’ball Club Championships: Nigeria Customs Thrash AS Douanes,Through To Semifinals", "text": "ADVERTISEMENT\n\nBy Olawale Ayeni, Abuja\n\nNigerian Customs Service (NCS) women volleyball team are through to the semifinal of the ongoing 2021 Women’s African Volleyball Club Championship in Kelibia, Tunisia, after thrashing Burkina Faso’s AS Douanes 3-0 (17-25, 15-25, 11-25) in an exciting encounter, yesterday.\n\nThe victory earned the Nigerian Customs girls second spot finished in Group B with 11 points from four matches behind leaders, Carthage of Tunisia, to reach the semifinal of the championship for the first time in their history.\n\nSpeaking to LEADERSHIP Sports after the team’s victory, Secretary General of Nigeria Customs Service sports unit, Samuel Onikeku, said the girls are in high spirits to deliver the tournament’s title to Nigeria.\n\n“We are in the final stages of the competition, so we are going to fight hard and defend the integrity of the Nigeria Customs Service and make Nigerians proud. We are hopeful that we will return to Nigeria with the trophy,” he said.\n\nThe Nigeria Customs ladies will face ‪CS Sfaxien of Tunisia in their semifinal encounter later today.\n\nMeanwhile, in the men’s category, the Nigeria Customs humbled their Tanzania’s MTC counterpart 1-3 (14-25, 25-17, 17-25, 19-25).", "summary": "ADVERTISEMENTBy Olawale Ayeni, AbujaNigerian Customs Service (NCS) women volleyball team are through to the semifinal of the ongoing 2021 Women’s African Volleyball Club Championship in Kelibia, Tunisia, after thrashing Burkina Faso’s AS Douanes 3-0 (17-25, 15-25, 11-25) in an exciting encounter, yesterday.\nSpeaking to LEADERSHIP Sports after the team’s victory, Secretary General of Nigeria Customs Service sports unit, Samuel Onikeku, said the girls are in high spirits to deliver the tournament’s title to Nigeria.\n“We are in the final stages of the competition, so we are going to fight hard and defend the integrity of the Nigeria Customs Service and make Nigerians proud.\nThe Nigeria Customs ladies will face ‪CS Sfaxien of Tunisia in their semifinal encounter later today.\nMeanwhile, in the men’s category, the Nigeria Customs humbled their Tanzania’s MTC counterpart 1-3 (14-25, 25-17, 17-25, 19-25).", "link": "https://leadership.ng/african-vball-club-championships-nigeria-customs-thrash-as-douanesthrough-to-semifinals/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["club", "victory", "nigeria", "douanesthrough", "vball", "championships", "semifinal", "customs", "encounter", "championship", "african", "thrash", "volleyball", "semifinals", "tunisia", "girls", "service"]}
{"title": "Nigerian Startup Among 5 Finalists In Contest For $500,000 Funding", "text": "BY BODE GBADEBO |\n\nAfter 5,000 startup applications received, a Swiss-based investment firm, Seedstars has narrowed down the participants in the largest startup competition in emerging markets to only five finalists from five regions of the world.\n\nA Nigerian startup, Ladda is among the five finalists joining the grand finale.\n\nLEADERSHIP reports that the Seedstars World Competiton is set to award this year’s global winner with the grand prize of $500,000 USD in equity funding and will be broadcasting the big event online together with The Next Web (TNW) on May 20, 2021 at 2pm CET.\n\nLadda addresses the problem of poor financial literacy and insufficient ease of access to micro-investment opportunities for low to medium-income earners in Nigeria.\n\nThe startup also provides access to investment for retail investors in order to democratise access to investment and provide financial literacy.\n\nThe other finalists are Fulfillment Bridge (Tunisia), Pegasi (Venezuela), IMAN (Uzbekistan), and Finology (Malaysia).\n\nIn a press statement by the organisers, the Seedstars World lead\n\nADVERTISEMENT\n\nof Seedstars, Daria Khlopova, said: “These five startups have proven that no matter how difficult times may get, innovation is still at the\n\nforefront. We can’t wait to see them at the Grand Finale.”\n\nIt will be recalled that In 2013, the Seedstars World Competition was launched to find the most promising early-stage startups and build the largest entrepreneurial community in emerging markets.", "summary": "BY BODE GBADEBO |After 5,000 startup applications received, a Swiss-based investment firm, Seedstars has narrowed down the participants in the largest startup competition in emerging markets to only five finalists from five regions of the world.\nA Nigerian startup, Ladda is among the five finalists joining the grand finale.\nThe startup also provides access to investment for retail investors in order to democratise access to investment and provide financial literacy.\nThe other finalists are Fulfillment Bridge (Tunisia), Pegasi (Venezuela), IMAN (Uzbekistan), and Finology (Malaysia).\nIn a press statement by the organisers, the Seedstars World leadADVERTISEMENTof Seedstars, Daria Khlopova, said: “These five startups have proven that no matter how difficult times may get, innovation is still at theforefront.", "link": "https://leadership.ng/nigerian-startup-among-5-finalists-in-contest-for-500000-funding/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["seedstars", "startups", "largest", "grand", "finalists", "startup", "funding", "investment", "access", "markets", "nigerian", "500000", "world", "contest"]}
{"title": "Photos: Nollywood star, Ejike Asiegbu visits DAYLIGHT Dome", "text": "You might also like", "summary": "You might also like", "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/", "published": "04/27/2021", "run": "04/27/2021", "keywords": ["nollywood", "asiegbu", "ejike", "star", "dome", "visits", "photos", "daylight"]}
>>>>>>> 20c48211f4c07e89082a5ae69ba03ff88a8113a1
{"title": "There’s nexus between educational backwardness, overpopulation, poverty, insecurity — Ilori", "summary": "Kindly Share This Story:— Gives out educational materials to 1500 indigent students in OndoDayo Johnson AkureThe special adviser to the Minister on the interior, Hon Bola llori has said that there is a nexus between educational backwardness, overpopulation, poverty, and insecurity.\nIiori said this in Ondo city during the distribution of educational materials to 1500 indigent students in both primary and secondary schools to mark his birthday celebration.\n” A deep reflection on the insecurity narrative in Nigeria will reveal a clear nexus between educational backwardness, overpopulation, poverty, and insecurity.\n“For our school children of indigent background, keeping hope alive is more difficult.\nThe Minister of State, Niger Delta, Chief Tayo Alasoadura told the school children that there was no easy way to the top than to be diligent and forthright.", "link": "https://www.vanguardngr.com/2021/04/theres-nexus-between-educational-backwardness-overpopulation-poverty-insecurity-ilori/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["school", "poverty", "backwardness", "overpopulation", "insecurity", "education", "theres", "community", "ilori", "nexus", "world", "educational", "children", "indigent", "students"]}
{"title": "Wike imposes night curfew at all Rivers’ land borders", "summary": "Kindly Share This Story:By Davies Iheamnachor, Port-HarcourtThe Governor of Rivers State, Chief Nyesom Wike, has imposed night curfew at all entry and exit points into the state, Abia, Akwa Ibom, Bayelsa, and Imo States.\nWike in State broadcast on Tuesday said the curfew which takes effect from Wednesday night, is necessitated by the recent security breaches and deadly attacks on security personnel by yet-to-be-identified gunmen.\nHe said: “The Government of Rivers State has decided to restrict night movements into and out of the State from the land borders of the State.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow (Wednesday) 28 April 2021 until further notice.\n“Neither do we also know the motives of the deranged characters or group behind these senseless assaults on our State and the lives of security operatives working to keep us safe and secure.", "link": "https://www.vanguardngr.com/2021/04/wike-imposes-night-curfew-at-all-rivers-land-borders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["curfew", "imposes", "security", "wike", "view", "state", "rivers", "borders", "land", "night", "agencies", "statethe", "governor"]}
{"title": "Insecurity: Nigerian celebrities cry out to Buhari govt", "summary": "Some Nigerian celebrities have urged President Muhammadu Buhari to proffer immediate solutions to insecurity in the country.\nBanky W in his outrage said ‘unfit for office persons were calling the shots in Nigeria.\nOther celebrities also vented their frustration over the nation’s security situation on Twitter.\n“We don talk, We don taya, We don pray we don taya.\nFrom Anambra State to Kaduna, Yobe, Niger and Lagos States, there were reports of violence and bloodshed.", "link": "https://dailypost.ng/2021/04/27/insecurity-nigerian-celebrities-cry-out-to-buhari-govt/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "unfit", "shots", "cry", "don", "celebrities", "nigeria", "insecurity", "state", "reports", "govt", "violence", "uti", "situation", "nigerian", "buhari"]}
{"title": "Igbo women's group decry high insecurity in Southeast", "summary": "A women’s group, Mothers of Ndigbo has decried the high level of insecurity in the Southeast, calling on the federal government to quickly wade in and stop the incessant killings.\nThe group which consists of Igbo women from the age of 60 and above at a press conference on Tuesday said the insecurity in the zone has gotten to a climax.\nThe group said since 2015, there have been systematic attacks on peace and tranquillity which has existed in the region over the years, with attendant economic hardships on citizens.\nThey said the attacks and other insecurity problem has forced the zone into poverty according to the National Bureau of Statistics’ rating.\n“All killer herdsmen, clandestinely aided and protected by federal security forces who have now permanently settled in farmlands, bushes and forests in our land and our key neighbouring states must be moved out and relocated back to wherever they were brought from.”", "link": "https://dailypost.ng/2021/04/27/igbo-womens-group-decry-high-insecurity-in-southeast/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "southeast", "federal", "womens", "high", "south", "group", "insecurity", "region", "zone", "decry", "watch", "situation", "igbo"]}
{"title": "BREAKING: Pandemonium as gunmen storm Ebonyi community", "summary": "By Ogochukwu Anioke, AbakalikiThere was pandemonium on Tuesday in Onueke, Ezra South local government area of Ebonyi when gunmen stormed the town shooting sporadically and robbing some businesses.\nThe gunmen, numbering about five, it was gathered, had trailed a customer to a bank in the area.\nThey shot sporadically in the air near the bank causing customers and staff to scamper in various directions for safety.\nA source, who was at the bank, said the gunmen shot the man they trailed to the bank.\nHowever, the gunmen were said to have moved from the bank to some businesses in the area which they robbed.", "link": "https://thenationonlineng.net/breaking-pandemonium-as-gunmen-storm-ebonyi-community/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["gunmen", "shot", "ebonyi", "community", "pandemonium", "nearby", "robbing", "source", "bank", "moved", "trailed", "away", "breaking", "storm", "sporadically"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "summon", "urged", "summoned", "reps", "rising", "house", "insecurity", "state", "speaker", "session", "nsa", "countrythe", "chiefs", "service", "services", "breaking"]}
{"title": "BREAKING: Federal high court Abakaliki on fire", "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.", "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["court", "federal", "went", "high", "state", "located", "hours", "highway", "gutted", "abakaliki", "later", "breaking", "reportdetails", "tuesdaythe"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "security", "solutions", "state", "seek", "insecurity", "statement", "national", "issue", "help", "need", "saraki", "tells", "finding", "buhari"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "president", "seeks", "blinken", "challenges", "united", "nigeria", "states", "tackle", "africa", "climate", "countries", "paris", "help", "buhari", "meeting"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["toro", "villages", "exposed", "posted", "internet", "pictures", "saharareporters", "lawmaker", "deep", "group", "lawal", "projects", "apc", "downloaded", "constituency", "wells", "towns"]}
{"title": "EXPOSED: APC Lawmaker Posted Pictures Downloaded From Internet As Constituency Projects", "summary": "Most wells today are centuries old and still working,” Lawal captioned the pictures in a post on Twitter.\nThis time we are going outside the box to construct 10 Deep Wells in 10 rural towns and villages of Toro LGA.\nIn 2020, a group, Concerned Toro Youths passed a vote of no confidence on the lawmaker for poor representation since voted into office.\nThe group asked to know what the lawmaker had been doing there over the years.\nThey also blamed the lawmaker for not visiting his constituency since voted into office.", "link": "http://saharareporters.com/2021/04/27/exposed-apc-lawmaker-posted-pictures-downloaded-internet-constituency-projects#disqus_thread", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["toro", "villages", "exposed", "posted", "internet", "pictures", "saharareporters", "lawmaker", "deep", "group", "lawal", "projects", "apc", "downloaded", "constituency", "wells", "towns"]}
{"title": "Tinubu: Every nation will go through difficult times -- we must unite to succeed", "summary": "Bola Tinubu, national leader of the All Progressives Congress (APC), says Nigeria needs unity to surmount the current security challenges.\nAnd yes, every nation will go through these curves and difficult times.\nThere’s no president or leader that will want his nation fractured by tribalism, religious differences and all that.\nIt calls for serious management and serious evaluation and dialogue once in a while.”Speaking on the rumoured unhealthy relationship between him and the president, Tinubu said he maintains a cordial relationship with Buhari.\nWe’ll continue to work for a better Nigeria and that’s what you need,” Tinubu said.", "link": "https://www.thecable.ng/tinubu-every-nation-will-go-through-difficult-times-we-must-unite-to-succeed", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "unity", "unite", "relationship", "unhealthy", "tinubu", "nation", "succeed", "times", "difficult", "work", "country", "dont", "nigeria"]}
{"title": "Insecurity: Buni asks Yobe residents to expose bad eggs 'even if they are relatives'", "summary": "Mai Mala Buni, governor of Yobe, has asked residents to expose “bad eggs” in their midst amid the growing insecurity in the state.\nAdvertisementSpeaking during a security meeting in Damaturu on Tuesday, the governor said residents must report suspicious movements even when they concern their relatives.\nAdvertisementBumi condemned the attack, saying that Yobe’s security situation needs quick response and reassessment.\n“The sad events in Geidam call for quick response and reassessment of the security situation in our respective communities and the state generally,” he said.\n“It is our responsibility to report suspicious movements in or near our communities.", "link": "https://www.thecable.ng/insecurity-buni-asks-yobe-residents-to-expose-bad-eggs-even-if-they-are-relatives", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["security", "asks", "communities", "state", "situation", "insecurity", "response", "quick", "expose", "residents", "eggs", "buni", "yobe", "relatives", "bad", "suspicious", "report", "movements"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["hospitaltohome", "plan", "healthcare", "medical", "communities", "inoyo", "health", "nwokoye", "bringing", "clafiya", "itoro", "rural", "services", "access", "nigeria", "jennie"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["bvn", "banks", "fair", "data", "customers", "nigerias", "umpire", "fintechs", "bank", "nibss", "access", "scams", "save", "number"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["video", "sale", "come", "soldiers", "force", "govt", "sent", "kidnapped", "appealing", "appeal", "student", "yusuf", "rescue", "dont", "free", "students"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["siblings", "phones", "arrest", "peddlers", "drug", "decomposing", "suspected", "delta", "suspects", "recovered", "led", "corpses", "abraka", "recover", "bodies", "warri", "car"]}
{"title": "Hoodlums set Federal High Court, Abakaliki ablaze – Nigerian Observer", "summary": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Unidentified hoodlums were reportedly set ablazed the premises of the Federal High Court in Abakaliki, Ebonyi State in the early hours of Tuesday.\nThe Police Public Relations Officer, PPRO, of Ebonyi, Mrs Loveth Odah, who confirmed the incident said that no arrest had been made.\n“Hoodlums in the early hours of Tuesday wielding dangerous weapons stormed the Federal High Court premises and burnt part of the building.\n“The Commissioner of Police, Mr Aliyu Garba, has promised to arrest the perpetrators and bring them to justice,” Odah said.\nMeanwhile, a detachment of the Nigerian Mobile Police, MOPOL, has been drafted to the area to secure the court premises.", "link": "https://nigerianobservernews.com/2021/04/hoodlums-set-federal-high-court-abakaliki-ablaze/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["investigation", "court", "ablaze", "federal", "arrest", "odah", "high", "abakaliki", "ebonyi", "observer", "hoodlums", "hours", "premises", "set", "early", "nigerian"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/27/2021", "keywords": ["cattle", "register", "prohibited", "outlawed", "jan", "wish", "nightgrazing", "underaged", "movement", "immediate", "19", "web", "highways"]}
{"title": "Channels TV has apologised for breach of broadcasting code – NBC", "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised over its breach of broadcasting code.\nAccording to her, the letter is asking Channels TV to explain why it gave credence to an organisation that was already proscribed by the Federal Government.\n“It is possible to bridge the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying we apologise, we did wrong.\n“And I will be able to communicate to the media about it but this letter that went to Channels TV is our way of regulating the broadcasting industry.\nShe said that in the exercise of its power as the regulatory body, NBC wrote a letter asking Channels TV to explain why it gave credence to the spokesman of the proscribed organisation.", "link": "https://hallmarknews.com/channels-tv-has-apologised-for-breach-of-broadcasting-code-nbc/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["nbc", "public", "particular", "bridge", "broadcasting", "apologised", "channels", "station", "code", "letter", "say", "breach", "tv"]}
{"title": "Tabarbarewar Tsaro: Majalisar Wakilai Ta Bukaci A Sanya Dokar Ta-baci", "summary": "", "link": "https://hausa.leadership.ng/tabarbarewar-tsaro-majalisar-wakilai-ta-bukaci-a-sanya-dokar-ta-baci/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["tabaci", "dokar", "tsaro", "wakilai", "majalisar", "sanya", "bukaci", "ta", "tabarbarewar"]}
{"title": "Tsaro: Ba Za Mu Dagawa ‘Yan Bindiga Kafa Ba, Inji El-Rufai", "summary": "", "link": "https://hausa.leadership.ng/tsaro-ba-za-mu-dagawa-yan-bindiga-kafa-ba-inji-el-rufai/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ba", "za", "tsaro", "mu", "inji", "yan", "elrufai", "bindiga", "kafa", "dagawa"]}
{"title": "’Yan bindiga sun saki sabon bidiyon daliban Kwalejin Afaka", "summary": "", "link": "https://aminiya.dailytrust.com/yan-bindiga-sun-saki-sabon-bidiyon-daliban-kwalejin-afaka", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["yan", "kwalejin", "daliban", "saki", "bidiyon", "afaka", "bindiga", "sabon"]}
{"title": "‘Kauyukan Neja 42 ne ke karkashin ikon Boko Haram’", "summary": "", "link": "https://aminiya.dailytrust.com/kauyukan-neja-42-ne-ke-karkashin-ikon-boko-haram", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ke", "ne", "boko", "kauyukan", "haram", "neja", "42", "karkashin", "ikon"]}
{"title": "Photos: Nollywood star, Ejike Asiegbu visits DAYLIGHT Dome", "summary": "You might also like", "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["photos", "dome", "daylight", "visits", "star", "nollywood", "ejike", "asiegbu"]}
{"title": "Abia: Police to investigate murder of widow as gateman flees", "summary": "Kindly Share This Story:By Steve OkoThe Abia State Police Command has declared manhunt for a fleeing gateman in Umuahia after the lifeless body of a widow was discovered in the pool of her blood.\nReports say the fleeing gateman was newly engaged by the victim from her Mbaise maternal community.\nAccording to reports, the older security man was said to have left the woman in hands of the fleeing gateman before going to church on Sunday.\nAccording to the older gateman (names withheld), he returned from church service and knocked on the gate severally, but there was no response.\nDisturbed by the situation, the older security guard alerted neigbours who broke into the compound via the back door and discovered the widow in the pool of her blood.", "link": "https://www.vanguardngr.com/2021/04/abia-police-to-investigate-murder-of-widow-as-gateman-flees/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["umuahia", "share", "flees", "murder", "church", "alozie", "victim", "security", "widow", "older", "abia", "fleeing", "investigate", "gateman"]}
{"title": "Housewives in Makurdi lament high cost of food items, consumables", "summary": "Kindly Share This Story:Residents, particularly housewives in Makurdi, the Benue state capital, have lamented the increase in prices of food items.\nA survey conducted by News Agency of Nigeria (NAN) on Tuesday in Makurdi showed that prices of food items have been increasing on a daily basis.\nMany housewives interviewed by NAN said that feeding their families has now become very difficult as the prices of essential food items have multiplied in the past few months.\n“I always shout at the traders over the constant increase in prices of food items, but when you think of it, it is not their fault but the manufacturers.\nOther housewives; Mrs Achetu Ochefu, Mrs T. Olobatoke and Mrs Nkiru Chuka who spoke to NAN blamed the ‘everyday’ increase in prices of food items and other products on the manufacturers.", "link": "https://www.vanguardngr.com/2021/04/housewives-in-makurdi-lament-high-cost-of-food-items-consumables/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["housewives", "lament", "traders", "consumables", "mrs", "high", "cost", "food", "increase", "makurdi", "lamented", "prices", "items", "bought", "week", "nan"]}
{"title": "Ajimobi's wife Florence", "summary": "Florence Ajimobi, wife of late Oyo State Governor Abiola Ajimobi, has declared that life is short.\nFlorence spoke to leaders of Nigeria Union of Journalists (NUJ), Oyo State Council, on Iftar (Breaking of fast) at her Oluyole residence in Ibadan.\nAjimobi’s wife promised she would do anything to immortalise her husband and uphold his legacy.\nOyo State NUJ Chairman, Alhaji Ademola Babalola, thanked her for the love and honour extended to the union.\nBabalola commended Florence for being and urged her to uphold the legacy.", "link": "https://dailypost.ng/2021/04/27/life-is-short-ajimobis-wife-florence/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["oyo", "state", "husband", "love", "uphold", "wife", "ajimobis", "nuj", "journalists", "florence", "life"]}
{"title": "BREAKING: Gunmen attack bank, kill police officer, cart away cash in Ebonyi", "summary": "Unknown gunmen on Tuesday killed a police officer whose name is yet to be identified at the time of filing this report at Onueke market in Ezza South Local Government Area of Ebonyi State.\nAn eyewitness, who spoke to journalists on the condition of anonymity, said the unknown gunmen equally set ablaze a car after robbing one of the popular commercial banks located at Onueke market.\nDAILY POST gathered that, no fewer than three civilians were reportedly shot and dispossessed of their valuables by the rampaging gunmen who stormed the busy Onueke town.\nThereafter, they trailed another person to a new generation bank at Onueke and shot him.\nEfforts to reach the Ebonyi State Police command to speak on the matter, as of the time of filing this report failed.", "link": "https://dailypost.ng/2021/04/27/breaking-gunmen-attack-bank-kill-police-officer-cart-away-cash-in-ebonyi/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["bank", "state", "robbers", "report", "ebonyi", "kill", "town", "officer", "cart", "onueke", "cash", "unknown", "shot", "gunmen", "attack", "filing", "away", "breaking"]}
{"title": "Global shortage of vaccines will alter vaccination phases, says Fed Govt", "summary": "By Moses Emorinken, AbujaGlobal scarcity and delay in vaccine supply to Nigeria may alter remaining phases of vaccination, the Federal Government stated yesterday.\nIn the government’s vaccination campaign strategy, there are four phases, of which the country is still in the first phase of the COVID-19 vaccination, which involves frontline health workers, other frontline workers and strategic leaders.\nADVERTISEMENTFurthermore, it said Nigeria is set to take delivery of 29.8 million doses of Johnson and Johnson COVID-19 vaccines from the African Union, even as it expects additional vaccines from COVAX in June.\n“Notwithstanding the above successes, we are aware of the global scarcity of COVID-19 vaccines due to high demand, especially in countries where the vaccines are being produced.\n“Furthermore, the Federal Government has signed off to receive up to 29.8 million doses of the Johnson & Johnson COVID-19 vaccine through the African Union (AU).", "link": "https://thenationonlineng.net/global-shortage-of-vaccines-will-alter-vaccination-phases-says-fed-govt/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["phases", "covid19", "second", "cent", "vaccine", "dose", "fed", "vaccination", "doses", "johnson", "astrazeneca", "alter", "global", "vaccines", "govt", "shortage"]}
{"title": "BREAKING: Reps summon NSA, service chiefs over rising insecurity", "summary": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, summoned the National Security Adviser, Babagana Monguno and all the services chiefs to brief it on the rising insecurity in the country.\nThe House, while expressing concern over the security challenges, urged President Muhammadu Buhari to immediately declare a state of emergency on security, in the country.\nThe speaker, Femi Gbajabiamila, disclosed this, after an executive session, which lasted for about four House.\nDetails later", "link": "https://www.sunnewsonline.com/breaking-reps-summon-nsa-service-chiefs-over-rising-insecurity/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["countrythe", "speaker", "state", "rising", "session", "summon", "reps", "chiefs", "urged", "security", "summoned", "insecurity", "house", "service", "nsa", "breaking", "services"]}
{"title": "BREAKING: Federal high court Abakaliki on fire", "summary": "From Chijioke Agwu AbakalikiA section of the Federal High Court Abakaliki Ebonyi state has been gutted by fire.\nThe complex which is located along Abakaliki-Enugu Highway went up in flames in the early hours of Tuesday.\nThe cause of the fire was yet to be ascertained as at the time of filling this report.\nDetails later.", "link": "https://www.sunnewsonline.com/breaking-federal-high-court-abakaliki-on-fire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["located", "went", "tuesdaythe", "state", "highway", "gutted", "abakaliki", "hours", "high", "court", "federal", "breaking", "later", "reportdetails"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["seek", "state", "need", "issue", "finding", "tells", "saraki", "national", "security", "statement", "insecurity", "solutions", "buhari", "president", "help"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["president", "nigeria", "challenges", "meeting", "climate", "paris", "security", "tackle", "countries", "seeks", "africa", "buhari", "states", "blinken", "united", "help"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["university", "governor", "resources", "building", "management", "school", "course", "honorary", "st", "peace", "thomasabecket", "flaunts", "nonexistent", "nondegeee", "uk", "kogi", "human", "professorship"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["university", "governor", "resources", "building", "management", "school", "course", "honorary", "st", "peace", "thomasabecket", "flaunts", "nonexistent", "nondegeee", "uk", "kogi", "human", "professorship"]}
{"title": "‘We’ll take legal action’ — army condemns sharing of dead soldiers’ photos on social media", "summary": "The Nigerian army has condemned the “indiscriminate” sharing of graphic photos of soldiers killed or injured in the line of duty.\nAdvertisementMohammed Yerima, army spokesman, in a statement on Tuesday, said such distribution of soldiers’ photos on social media is insensitive and unpatriotic.\nAdvertisement“The Nigerian Army condemns in the strongest term possible, the indiscriminate sharing on social media of graphic pictures of personnel who paid the supreme price in the cause of defending and protecting the country from its adversaries,” Yerima said.\nOne can only imagine the trauma and pain such families go through waking up to see the gory pictures of their loved ones splashed on the social media.\n“The Nigerian Army consider this despicable and unpatriotic act totally unacceptable and will henceforth take legal actions to protect troops who die in action from being ridiculed on social media or any platform.”", "link": "https://www.thecable.ng/well-take-legal-action-army-condemns-sharing-of-dead-soldiers-photos-on-social-media", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["soldiers", "dead", "sharing", "nigerian", "social", "unpatriotic", "condemns", "media", "country", "personnel", "action", "pictures", "legal", "army", "graphic", "photos"]}
{"title": "IPOB interview: Channels TV has apologised for breaching broadcast code, says NBC", "summary": "The National Broadcasting Commission (NBC) says Channels Television has apologised for allegedly breaching the country’s broadcast code.\nWhile clarifying the directive, Franca Aiyetan, NBC director of public affairs, said the letter the commission sent to the TV station was an “instrument to check its excesses”.\nIt is possible to breach the public peace and that was what the letter conveyed to Channels TV, to which the TV station has responded, saying ‘we apologise, we did wrong’.\nBut this letter that went to Channels TV is our way of regulating the broadcasting industry.\nThe NBC now said because of that, this breach attracts a shutdown or a fine of N5 million.", "link": "https://www.thecable.ng/ipob-interview-channels-tv-has-apologised-for-breaching-broadcast-code-says-nbc", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["letter", "channels", "interview", "public", "ipob", "apologised", "tv", "broadcast", "breaching", "commission", "programme", "breach", "nbc", "code", "broadcasting", "station"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["medical", "bringing", "health", "nigeria", "clafiya", "healthcare", "inoyo", "access", "itoro", "plan", "rural", "communities", "nwokoye", "hospitaltohome", "services", "jennie"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["fintechs", "save", "nibss", "access", "fair", "customers", "scams", "bvn", "data", "banks", "nigerias", "number", "bank", "umpire"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["soldiers", "appealing", "force", "free", "student", "kidnapped", "yusuf", "rescue", "appeal", "dont", "come", "video", "sent", "govt", "sale", "students"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/27/2021", "keywords": ["arrest", "car", "abraka", "suspects", "recover", "warri", "corpses", "recovered", "phones", "delta", "siblings", "drug", "decomposing", "suspected", "bodies", "led", "peddlers"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["governor", "state", "ortom", "nigerian", "nigeria", "lasting", "observer", "peace", "god", "security", "fairness", "equity", "insecurity", "country", "level", "justice"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/27/2021", "keywords": ["prohibited", "wish", "jan", "nightgrazing", "outlawed", "movement", "underaged", "cattle", "19", "register", "web", "highways", "immediate"]}
{"title": "Insecurity: Wike imposes curfew on Rivers land borders", "summary": "OBINNA EZUGWURivers State governor, Nyesom Wike, has imposed a curfew on the state’s land borders starting from tomorrow, Wednesday, as a means of curtailing attacks on security agencies by unknown gunmen.\nAccording to the governor, the curfew is from 8.00 p.m. to 6.00 a.m. and will start from tomorrow 28th April 2021, until further notice.\n“Consequently, a night curfew is hereby imposed and no person or vehicle is allowed into and out of Rivers State from 8.00 p.m. to 6.00 a.m. from tomorrow 28th April 2021 until further notice.\n“Security agencies have been posted to monitor and enforce strict compliance with the curfew at all our land borders and or entry and exit points with Abia, Akwa-Ibom, Bayelsa and Imo States.\n“We therefore urge everyone to be vigilant and report every useful intelligence or suspicious movements to the security agencies for immediate actions.”", "link": "https://hallmarknews.com/insecurity-wike-imposes-curfew-on-rivers-land-borders/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["governor", "state", "agencies", "land", "tomorrow", "borders", "rivers", "imposes", "security", "2021", "insecurity", "curfew", "wike"]}
{"title": "Insecurity: We Can’t Surrender Kaduna To Criminals, el-Rufai Declares", "summary": "* Defends stance on Chibok girls abduction, ‘no-ransom, no-negotiation’ policy |BY AZA MSUE, Kaduna |Governor Nasir el-Rufai of Kaduna State, on Tuesday, declared that his government will not surrender the state to criminal elements, saying experience has shown that paying ransom or negotiating with criminals only encourage them.\nel-Rufai also noted that mass abduction was like a novelty in 2014 under former President Goodluck Jonathan administration, but the facts have now changed since then, as negotiations and ransom payments have not stopped the criminals.\nIn a statement issued by the special adviser on media and communication to the governor, Muyiwa Adekeye, he gave context to a video clip where Governor el-Rufai was seen advocating for all options to ensure the release of the abducted Chibok girls in 2014.\nThe statement explained that, President Jonathan-led administration denied or doubted that the Chibok girls abduction happened, adding “That was the context under which civic pressures were brought on the government.’’‘’Nigeria’s journey since the 2014 Chibok tragedy has proven that the solution to violent crimes, including terrorism and banditry, is a robust response from the state and its coercive agencies,” he said.\nADVERTISEMENTHe added that paying of ransoms make criminals “to press ahead for a surrender of the public treasury to them.", "link": "https://leadership.ng/insecurity-we-cant-surrender-kaduna-to-criminals-el-rufai-declares/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["criminals", "governor", "state", "cant", "girls", "surrender", "elrufai", "kaduna", "security", "insecurity", "ransom", "declares", "paying", "chibok", "statement"]}
{"title": "Insecurity: 109 Senators To Meet Buhari", "summary": "He said: “Today, we are talking about them occupying Niger state in the manner that have been given earlier by the mover of the motion.\n“[And] it seems like the federal government is handling this security situation with kid gloves.\nThat is the home base of our leader here (Senate President) and the Inspector General of Police’s home.\nToday, I cannot travel from here to Kaduna or Niger State where I was born.\n“There’s no arm of government that’s not concerned about the security situation of the country, everyone is concerned.", "link": "https://leadership.ng/insecurity-109-senators-to-meet-buhari/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["senate", "state", "president", "meet", "niger", "national", "local", "senators", "security", "insecurity", "apc", "buhari", "situation", "areas", "109"]}
{"title": "Photos: Nollywood icon, Ejike Asiegbu visits DAYLIGHT Dome", "summary": "You might also like", "link": "https://daylightng.com/photos-nollywood-star-ejike-asiegbu-visits-daylight-dome/", "published": "04/27/2021", "scraped_date": "04/27/2021", "keywords": ["ejike", "asiegbu", "daylight", "nollywood", "dome", "icon", "visits", "photos"]}
{"title": "Insecurity: Kano government closes down school over fear of attack", "summary": "Kindly Share This Story:By Abdulmumin MurtalaThe Kano state government has announced the closure of Bagauda Technical College with immediate effect for fear of possible security breach.\nKano State Government has directed for the immediate closure of Bagauda Technical College following what it described as disturbing security reports and the need to protect lives of students and staff of the school.\n“Following disturbing security reports, we hereby announce the immediate closure of Bagauda Technical College to protect the lives of students and staff of the college“We call on parents and guardians to immediately evacuated their children from the school while they await further instructions.\n“I wish to express appreciation to the state government parents and guardians for their unflinching support and cooperation on government’s policies and directives especially on security-related matters” the commissioner stated while addressing newsmen.\nVanguard News NigeriaKindly Share This Story:", "link": "https://www.vanguardngr.com/2021/04/insecurity-kano-government-closes-down-school-over-fear-of-attack/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "fear", "immediate", "share", "state", "security", "students", "school", "attack", "college", "closure", "insecurity", "technical", "bagauda", "kano", "closes"]}
{"title": "Indigenous plagiarism detection software launched in Abuja", "summary": "Kindly Share This Story:By Joseph Erunke – AbujaAn indigenous software developed to detect intellectual property theft has been launched in the country.\nThe plagiarism detection software, named “EagleScan”, is aimed at tackling problems associated with academic research verification, authentication as well as validation.\nSpeaking as the Special Guest at the public presentation and launching of the EagleScan Plagiarism Detection Software, in Abuja, Tuesday,Vice President Yemi Osinbajo described it as an initiative that announces zero tolerance for plagiarism.\nHe explained: “The EagleScan Plagiarism Detection Software integrates global open source and closed source repositories, local Open Education Repositories and it allows users to validate titles abstracts and generate originality report”.\n“Having the software is one aspect of the battle against plagiarism, universities must take concrete steps to institutionalise anti-plagiarism policy that forbids all aspects of the intellectual theft”.", "link": "https://www.vanguardngr.com/2021/04/indigenous-plagiarism-detection-software-launched-in-abuja/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["detection", "plagiarism", "eaglescan", "president", "universities", "higher", "prof", "education", "national", "research", "indigenous", "launched", "software", "abuja"]}
{"title": "Boko Haram: Governor Buni condemns attack in Geidam", "summary": "The governor of Yobe State, Mai Mala Buni has condemned the attack on Gaidam community by the Boko Haram insurgents, where properties worth millions of naira were destroyed and thousands of people displaced.\nThe governor stated this at a special security meeting with government officials, traditional rulers and security personnel at the Government House, Damaturu.\nGovernor Buni said that more troops were to be deployed to Gaidam township to protect peoples lives and property.\nAccording to him, the deployment of more troops to the border community was directed on sunday by the Chief of Defence staff, General Luky Irabo.\nOn the meeting with Chief of Defence staff, Gen. Luky Irabo, he said, he discussed with him, the need to deploy more soldiers to Gaidam.", "link": "https://dailypost.ng/2021/04/27/boko-haram-governor-buni-condemns-attack-in-geidam/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "chief", "haram", "condemns", "governor", "security", "buni", "geidam", "attack", "need", "meeting", "gaidam", "border", "troops", "secure", "boko", "state"]}
{"title": "Banditry: Matawalle directs immediate redeployment of security operatives to affected communities", "summary": "Zamfara State Governor, Hon.\nBello Mohammed Matawalle, has directed that security operatives be redeployed to areas affected by bandit activities.\nMatawalle stated this when he visited the IDPs camp at Unguwar Danbaba in Tsunami area of Gusau Local Government Area of Zamfara State on Tuesday.\nThe Governor said he was saddened and disturbed by the resurgence of banditry activities that resulted in having an IDP Camp in Gusau, the state capital.\nSpeaking earlier, one of the IDPs’ leaders, Mallam Muhammadu Shehu, expressed their happiness over the governor’s visit and requested for redeployment of more security personnel to the affected communities to enable them return to their respective communities.", "link": "https://dailypost.ng/2021/04/27/banditry-matawalle-directs-immediate-redeployment-of-security-operatives-to-affected-communities/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "redeployment", "support", "immediate", "gusau", "state", "security", "governor", "banditry", "area", "alhaji", "directs", "operatives", "zamfara", "affected", "return", "communities", "matawalle"]}
{"title": "BBNaija star Alex admits being caged as a celebrity", "summary": "By Adeniyi AdewoyinFormer housemate of the Big Brother Naija show, Alex Asogwa, has said that her celebrity status makes her feel caged and rebellious.\nThe reality show star said this during a Question and Answer session with her fans on her Instagram stories.\n“Caged, rebellious but strong-willed as I love my freedom and peace and I will protect it by doing me the right way,” she responded when asked how she feels being a celebrity.\nA fan asked if it is right to marry while broke and she said “I believe everyone should strive to stand alone.\nA would-be-husband that’s very rich should check that you put in your best to not be broke and help you stand on your own even before marriage since he is rich.", "link": "https://thenationonlineng.net/bbnaija-star-alex-admits-being-caged-as-a-celebrity/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["admits", "broke", "marriage", "alex", "star", "way", "wouldbehusband", "asked", "right", "stand", "fans", "thats", "rich", "bbnaija", "caged", "celebrity"]}
{"title": "3Lions unveils new single Show Me Love", "summary": "By Chinyere OkoroaforThree lions Records, a new record label in Lagos has unveiled a new single titled Show Me Love.\nThe song features three music acts under the label, Chukwemeka Robert aka Bob Em, Timothy Wariso aka Tim Wason and Frederick Chukwudi aka Kayana.\nAccording to the Chairman of the label, Dr. Chukwemeka Linus, the hit song portrays the acts’ love for creativity, passion for music, proof of originality, skills and eclectic taste for music.\nHe noted that the new record is with reference to the effects of the pandemic on people and the economy.\nLinus said Bob Em, who hails from Anambra State, is a songwriter, music composer, Afrobeat singer and entrepreneur, whose music depicts calmness, openness and confidence.", "link": "https://thenationonlineng.net/3lions-unveils-new-single-show-me-love/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["3lions", "song", "aka", "unveils", "label", "creativity", "record", "chukwemeka", "bob", "em", "love", "music", "single"]}
{"title": "CAN accuses Muslim leaders of fuelling religious crisis", "summary": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has accused some Muslim leaders and preachers of deriving pleasure in statements, preaching and other actions that could trigger religious war in Nigeria.\nCAN was specifically concerned that some of the Islamic preachers and Muslim leaders, particularly in Kwara State, seem to be enjoying the support of the government which has emboldened them to continue in their extremist actions.\nThis was primarily to tempt peace-loving Christians into a religious crisis.\nIt is time we advised some Muslim leaders in the country to stop fishing in troubled waters with a view to provoking Christians whom they share the same neighbourhood with.\nThis should stop.”CAN appealed to Kwara State government to, immediately, order the relocation of the controversial mosque and the Islamic centre, in order to prevent the crisis being deliberately provoked by some Islamic leaders and followers in the country.", "link": "https://www.sunnewsonline.com/can-accuses-muslim-leaders-of-fuelling-religious-crisis/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["mosque", "violence", "islamic", "crisis", "christians", "actions", "religious", "leaders", "fuelling", "accuses", "muslim", "kwara", "state"]}
{"title": "El-Rufa’i, Tambuwal call for collective action against banditry", "summary": "Governor Nasir El-Rufa’i of Kaduna State and Sokoto State Governor Aminu Tambuwal have stressed the need for states to cooperate in tackling the menace of banditry and kidnapping.\nThe two governors took the stand in Sokoto, when El-Rufai visited to condole with Tambuwal over the death of Hajiya Aishatu, daughter of the late premier of Northern Nigeria, Sir Ahmadu Bello.\nEl-Rufa’i, however, expressed concern over the rising cases of kidnapping and banditry in the zone and its effect on the public.\n“The bandits entered from Kuchi axis around 6pm on motorcycles and moved towards Chibani, snatching motorcycles from residents from one village to village.\nBuni made his position known during an emergency security meeting in Damaturu.", "link": "https://www.sunnewsonline.com/el-rufai-tambuwal-call-for-collective-action-against-banditry/", "published": "04/28/2021", "scraped_date": "04/28/2021", "keywords": ["collective", "bandits", "challenges", "security", "governor", "banditry", "local", "elrufai", "meeting", "village", "came", "tambuwal", "sokoto", "action", "state"]}
{"title": "Insecurity: Seek Help, Saraki Tells Buhari", "summary": "In a statement on Tuesday, Saraki told Buhari that seeking help was not a sign of weakness.\n“However, it is obvious that President Muhammadu Buhari and the All Progressives Congress (APC) government need help.\nIn this regard, I strongly call on my colleagues in the National Assembly to be more assertive in finding solutions to this issue of insecurity.\nHe said, “They must do all that is necessary to help the administration to get solutions to this national crisis.\nThus, we are willing to cooperate with the government in finding solutions to this problem.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/insecurity-seek-help-saraki-tells-buhari/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["solutions", "buhari", "seek", "saraki", "tells", "president", "help", "issue", "security", "statement", "need", "national", "finding", "insecurity", "state"]}
{"title": "In Meeting With Blinken, Buhari Seeks US Help to Tackle Security Challenges", "summary": "He also urged the United States to consider relocating US Africa Command (AFRICOM) from Stuttgart, Germany, to Africa, nearer the Theatre of Operation.\nPresident Buhari, in a virtual meeting Tuesday with US Secretary of State, Mr Anthony Bilken, charged the international community to support Nigeria and the sub-region in tackling growing security challenges to avoid spillovers.\n“I also wish to congratulate the United States for re-joining the World Health Organization (WHO) and Paris Agreement on Climate Change.\nThe leadership of the United States in these two organizations is crucial for international community.\nThis action is a demonstration of the United States commitment in championing and supporting international organizations with the aim to build a better world for all”.", "link": "https://www.thisdaylive.com/index.php/2021/04/27/in-meeting-with-blinken-buhari-seeks-us-help-to-tackle-security-challenges/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["states", "seeks", "buhari", "tackle", "climate", "paris", "blinken", "help", "challenges", "security", "nigeria", "president", "countries", "meeting", "united", "africa"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["building", "flaunts", "professorship", "peace", "st", "kogi", "governor", "school", "course", "resources", "uk", "nonexistent", "management", "human", "thomasabecket", "university", "honorary", "nondegeee"]}
{"title": "Kogi Governor, Bello Flaunts Honorary Professorship From Non-degeee Awarding UK School, In Non-existent Course", "summary": "The Kogi State Government has announced that a school, St Thomas-A-Becket University, London, United Kingdom, awarded an honorary professorship to the governor, Yahaya Bello, as checks conducted by SaharaReporters show the award is questionable.\nSaharaReporters observed that the school – St Thomas-A-Becket University – did not list Human Resources Management and Peace Building (the field in which Governor Bello was awarded – as one of the courses it offers in the institution.\nAlso, according to an educational service verification site in the UK, the said school does not offer recognised UK degrees at the moment.\nBasically, the school is a non-degree awarding 'university' and not registered in the UK as a university.\n“Professor (Honoris Causa) in Humanitarian services, Human Resources Management, Peace Building by the prestigious ST Thomas-A-Becket University, London and fellow of Wesley Synod Canterbury, Kent, United Kingdom.", "link": "http://saharareporters.com/2021/04/27/kogi-governor-bello-flaunts-honorary-professorship-non-degeee-awarding-uk-school-non#disqus_thread", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["building", "flaunts", "professorship", "peace", "st", "kogi", "governor", "school", "course", "resources", "uk", "nonexistent", "management", "human", "thomasabecket", "university", "honorary", "nondegeee"]}
{"title": "Corps member accuses Ogun school principal of assault", "summary": "A video has surfaced and gone viral wherein a corps member alleged that she was assaulted by the principal of a school she was posted to for her place of primary assignment (PPA) in Ogun state.\nThe corps member claimed that when she met the school principal, he started insulting her during their conversation.\nWhile it remained unclear what led to the face-off between the pair, she alleged that the principal also beat her.\nShe went ahead to accuse other staff of the school of backing the principal during the incident.\nAll the staff in the school are also supporting him.”The principal could, however, be heard in the video dismissing the corps member’s claim.", "link": "https://lifestyle.thecable.ng/corps-member-accuses-ogun-school-principal-of-assault/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["staff", "stone", "assault", "thecable", "posted", "school", "post", "beat", "corps", "ogun", "video", "member", "accuses", "principal"]}
{"title": "Beyoncé and I won’t force our kids into showbiz, says Jay-Z", "summary": "Jay-Z, US rapper and record producer, says he and Beyoncé, his wife, will not force their kids into showbusiness.\nAdvertisementThe 51-year-old spoke with The Times about life in quarantine with his wife, Blue Ivy, their 9-year-old daughter, and their twins Rumi and Sir.\nHe said he’s aware of the legacy his children may feel like they have to live up to but added that he and Beyoncé have a plan.\nI have no idea, right?\nBeyond music, Jay-Z has continued to gain influence as an entrepreneur.", "link": "https://lifestyle.thecable.ng/beyonce-and-i-wont-force-our-kids-into-showbiz-says-jay-z/#new_tab", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["showbiz", "im", "wont", "loving", "beyoncé", "wife", "jayz", "really", "ivy", "idea", "kids", "force", "music", "right"]}
{"title": "Jennie Nwokoye and Itoro Inoyo are bringing hospital-to-home services to rural communities in Nigeria", "summary": "Trying to bridge the healthcare gap in Nigeria, Jennie conceived ClafiyaJennie Nwokoye nurtured an idea to build a medical system to cater to the Nigerian population when she was younger.\nThough her American accent might suggest otherwise, Jennie lived in Nigeria from when she was 8 and left when she was 14 years old.\n“Imagine having family members or friends who have either died or had close calls because they weren’t able to get access to healthcare,” Jennie tells me during our chat.\nThey had lengthy conversations about the Nigerian labour market and access to healthcare services in the country.\nItoro told me that Clafiya was initially called “Healthcare Mobile” in 2019 and that she was Jennie’s go-to person for information concerning delivery and medical services in Nigeria.", "link": "https://techcabal.com/2021/04/27/jennie-and-itoro-nigerian-mobile-healthcare-service-founders/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["nigeria", "bringing", "healthcare", "nwokoye", "rural", "itoro", "access", "clafiya", "medical", "inoyo", "jennie", "health", "hospitaltohome", "plan", "services", "communities"]}
{"title": "Can NIBSS save BVN from bank scams and be a fair umpire?", "summary": "NIBSS wants to tighten security around Nigeria’s Bank Verification Number (BVN) system.\nThe “Approved Standard Operating Guidelines for BVN Matching System Version 2.0” document is Nigeria’s BVN operations manual.\nBVNs – unique identification numbers for bank customers – were launched in 2014 by the Central Bank of Nigeria (CBN) and the Bankers’ Committee as a “Know Your Customer” (KYC) infrastructure for the financial sector.\nAccess to the BVN databaseBanks and fintechs access the BVN database through Application Programming Interface (API) calls.\nThe CBN approves groups who can access BVN information, while NIBSS manages the security of the APIs.", "link": "https://techcabal.com/2021/04/27/can-nibss-save-bvn-from-bank-scams-and-be-a-fair-umpire/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["scams", "umpire", "number", "nigerias", "data", "bank", "access", "banks", "customers", "save", "nibss", "fintechs", "fair", "bvn"]}
{"title": "Don’t use force to free us, kidnapped students appeal to govt", "summary": "“I am appealing to the the government to come and rescue us by giving them what they want.\n“Using force to rescue us is almost impossible because we are surrounded by the gunmen.\nThey said they will not hesitate to kill every one if they sight any security personnel who might come to rescue us.\nAlso, a female student wearing hijab who spoke in Hausa said: “I am appealing to the government to rescue us.\nThey tell us that they heard soldiers will be sent to rescue us.", "link": "https://tribuneonlineng.com/dont-use-force-to-free-us-kidnapped-students-appeal-to-govt/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["come", "govt", "rescue", "appealing", "students", "dont", "force", "soldiers", "student", "sent", "sale", "video", "appeal", "yusuf", "free", "kidnapped"]}
{"title": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in Delta", "summary": "Police recover decomposing bodies of 2 siblings in car, arrest 3 drug peddlers, others in DeltaDecomposing bodies of two missing teenage siblings were, on Friday, recovered from a private car in the university town of Abraka, Ethiope East Local Government Area of Delta State.\nPolice operatives from Abraka Police Station, acting on a tip-off, reportedly recovered the corpses at about 2:50p.m from a Honda Rover car with Reg No.\nAG 815 BKW parked in the house of one 35-year-old Eniku Aghogho Tayo said to be resident in Warri and owner of the car.\nAmid sketchy details, it was gathered that the siblings were living with their mother before their sudden disappearance.\nIn a related development, police operatives from Warri Division same Friday, after raiding some black spots at popular Macaver Street in Warri, Warri South Local Government Area, arrested three suspects with substances believed to be hard drugs.", "link": "https://tribuneonlineng.com/police-recover-decomposing-bodies-of-2-siblings-in-car-arrest-3-drug-peddlers-others-in-delta/", "published": "03/13/2021", "scraped_date": "04/28/2021", "keywords": ["car", "siblings", "recover", "peddlers", "arrest", "warri", "drug", "bodies", "phones", "suspects", "corpses", "decomposing", "recovered", "suspected", "led", "abraka", "delta"]}
{"title": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across Nigeria – Nigerian Observer", "summary": "Insecurity: Ortom calls for Justice, Fairness And Equity For Lasting Peace And Security Across NigeriaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – Gov.\nSamuel Ortom of Benue has advocated for Justice, fairness and equity so as to stem the various agitation across the country.\nHe said , that, the the level injustice, lack of fairness and equity in the country was probably responsible for the various agitation emanating from the geo-political zones.\n“As leaders in this country especially the PDP, we are prepared to give Nigerians a democracy that is anchored on equity, fairness and justice.\nThey have continued to partner with the government of this state toachieve peace and we have continued to remain focus on our dreams” he said.", "link": "http://nigerianobservernews.com/2021/04/insecurity-ortom-calls-for-justice-fairness-and-equity-for-lasting-peace-and-security-across-nigeria/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["observer", "peace", "country", "nigeria", "state", "security", "governor", "lasting", "level", "god", "fairness", "equity", "ortom", "insecurity", "justice", "nigerian"]}
{"title": "Web Story 19 Jan", "summary": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register", "link": "https://hallmarknews.com/web-stories/banditry%3a-akeredolu-orders-herdsmen-to-vacate-ondo-forests/", "published": "01/19/2021", "scraped_date": "04/28/2021", "keywords": ["cattle", "outlawed", "jan", "immediate", "highways", "wish", "underaged", "nightgrazing", "register", "prohibited", "movement", "19", "web"]}
{"title": "Abiodun seeks collaboration with Ogun indigenes in military, others to tackle insecurity", "summary": "Kunle IdowuThe Ogun State governor, Dapo Abiodun, has expressed the readiness of his administration to collaborate with indigenes of the state who are high ranking officers in the military and paramilitary agencies to find solution to the issues of insecurity.\nThe governor equally said that his administration would be hosting the officers to motivate and celebrate their achievements.\nHe made this known on Monday when he received the new Brigade Commander, 35 Artillery Brigade, Alamala, Abeokuta, Brigadier General Adewale Abiodun Adekoya, in his office at Oke Mosan, Abeokuta.\nAdekoya is an indigene of Ogun state from Ago-Iwoye in the Ijebu North Local Government Area of the state.\nIn his remarks, the former Brigade Commander, Joseph Amadasun appreciated the state governor for his unalloyed support to security agencies in the state, attributing his success to the continuous support of the state governor.", "link": "https://hallmarknews.com/abiodun-seeks-collaboration-with-ogun-indigenes-in-military-others-to-tackle-insecurity/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["seeks", "support", "tackle", "commander", "administration", "brigade", "act", "security", "military", "collaboration", "governor", "necessary", "ogun", "insecurity", "indigenes", "abiodun", "state"]}
{"title": "PIB, New Electoral Law To Be Ready May, June – Lawan", "summary": "BY BODE GBADEBO, AbujaThe Senate President, Senator Ahmad Lawan, has said that the National Assembly would pass the Petroleum Industry Bill (PIB) into law by next month while the Electoral Act Ammendment Bill would be passed into law by June.\n“The National Assembly is working tirelessly to ensure that we pass the PIB which is a very important piece of legislation for our country.\nOur design and desire is that we are able to pass the Bill before the end of May.\nWe are hopeful that we will be able to pass the Bill before the end of June,” Lawan said.\nEarlier in his remarks before the meeting went into a closed session, the visiting UK minister indicated interest in the progress made by the National Assembly on some Bills such as the Electoral Act Amendment Bill and PIB.", "link": "https://leadership.ng/pib-new-electoral-law-to-be-ready-may-june-lawan/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["assembly", "electoral", "support", "law", "bill", "pass", "senate", "national", "believe", "working", "pib", "ready", "lawan", "able"]}
{"title": "Declare State Of Emergency On Security, Reps Tell Buhari", "summary": "By ADEBIYI ADEDAPO, AbujaThe House of Representatives on Tuesday urged President Muhammadu Buhari to declare a state of emergency in the security sector.\n“Considering the security situation, the President should immediately declare a State of Emergency on Security so as to fast track all measures to ensure the restoration of peace in the country,” Gbajabiamila said.\nADVERTISEMENTThey also urged government to provide emergency relief to all communities that have been adversely affected by recent attacks across the country.\n“The President should as a matter of urgency, ensure financial autonomy to Local Government Councils to guarantee their functionality to serve the local populace.\n“The Federal Government should ensure the protection of National Infrastructure assets, particularly the Shiroro and Kainji Dams in Niger State.", "link": "https://leadership.ng/declare-state-of-emergency-on-security-reps-tell-buhari/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["buhari", "reps", "country", "house", "tell", "president", "security", "urged", "emergency", "terrorism", "ensure", "declare", "local", "state"]}
{"title": "Imah, Orika, Others Enjoin Mbala People To Participate Actively In Abia Politics", "summary": "Edozie Richard Imah has called on the people of Mbala Isuochi in the Umunneochi Local Government Area of Abia State to wake up from their slumber and participate actively in the build-up to the 2023 general elections in Nigeria.\nImah spoke at the first Mbala political summit which held recently at his palatial home at Umuobasi Mbala Isuochi, in the Umunneochi Local Government Area of Abia State.\n“The political summit is the first in the series lined up this year.\nIn a keynote address at the occasion, former governorship aspirant in Abia State, Surv.\nOrika noted that the greatest challenge faced by Mbala people in the politics of Umunneochi and indeed, Abia State is the people’s apathy towards politics and insisted that as long as this attitude is sustained, Mbala will continue to lag behind in Umunneochi nay Abia politics.", "link": "https://daylightng.com/imah-orika-others-enjoin-mbala-people-to-participate-actively-in-abia-politics/", "published": "04/27/2021", "scraped_date": "04/28/2021", "keywords": ["support", "orika", "mbala", "enjoin", "participate", "political", "politics", "umunneochi", "community", "actively", "summit", "isuochi", "abia", "imah", "state"]}
