{
  "newspapers": {
    "punch": {
      "link": "https://punchng.com/topics/news/",
      "articles": [
        {
          "title": "Mixed reactions as Ayade defects to APC",
          "text": "The defection of the Governor of Cross River State, Ben Ayade from the Peoples Democratic Party to the All Progressives Congress has evoked mixed reactions from Nigerians on social media.\n\nThe Governor on Thursday announced his decision after a closed-door meeting with six APC governors that lasted over an hour at the executive chamber of the Governor’s office in Calabar.\n\nHis decision erupted various reactions from Nigerian tweeps; while few lauded him, some slammed him while others were indifferent.\n\nA tweep, @Omojuwa, wrote, “I guess Ben Ayade and Nyesom Wike couldn’t mend their differences. Ben Ayade has now transferred himself to the APC.”\n\nAnother tweep, @GodwinEguono described the decision as a shameful one, as he tweeted, “They run to APC for safety when their tenure is coming to an end, to avoid being probed by EFCC (Economic and Financial Crimes Commission).”\n\n“What blessing will your decamping bring to the state? What development has Buhari brought to Nigeria that you want to join hands with him? What blessings has APC as a party brought to Nigeria?”, @TimothyFadayomi questioned.\n\nA user with the handle @Favoured_g tweeted, “Honestly, I’m not surprised. I’ve never seen him as a PDP person.His only aim and objective there is to use them to win the election.”\n\n@Valntynno tweeted, “2023 permutation I guess. Nigerians don’t care the party you belong to, good governance is all they want.”\n\n@kingdavide1 described both APC and PDP as the same thing.\n\n@geehussy1 tweeted, “This is the beginning of his political downfall.”\n\n@Johannxs, however, tweeted, “An interesting entrant to the APC. Welcome Governor Ben Ayade.”",
          "summary": "The defection of the Governor of Cross River State, Ben Ayade from the Peoples Democratic Party to the All Progressives Congress has evoked mixed reactions from Nigerians on social media.\nHis decision erupted various reactions from Nigerian tweeps; while few lauded him, some slammed him while others were indifferent.\nA tweep, @Omojuwa, wrote, “I guess Ben Ayade and Nyesom Wike couldn’t mend their differences.\n@geehussy1 tweeted, “This is the beginning of his political downfall.”@Johannxs, however, tweeted, “An interesting entrant to the APC.\nWelcome Governor Ben Ayade.”",
          "link": "https://punchng.com/mixed-reactions-as-ayade-defects-to-apc/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "governor",
            "tweeted",
            "state",
            "apc",
            "mixed",
            "ben",
            "party",
            "defects",
            "ayade",
            "tweep",
            "reactions",
            "decision"
          ]
        },
        {
          "title": "PDP stood by me, I was loyal to party, says Ayade",
          "text": "Governor of Cross River State, Ben Ayade, has stated that the Peoples Democratic Party, which he dumped for the All Progressives Congress on Thursday, stood by him during his political travails.\n\nAyade recalled how he rose politically on the platform of the opposition party to become a governor.\n\nThe governor, who featured on Politics Today, a current affairs programme on Channels Television, on Thursday attributed his defection to the leadership attributes of the President, Major General Muhammadu Buhari (retd.), and his relationship with Cross River.\n\nAyade also said more governors in the opposition PDP would soon join the ruling APC. He, however, failed to name them.\n\nHe said in part, “My decision to move has nothing to do with my relationship with the PDP, it has everything to do with my understanding of the challenges of this nation at this time. My respect for the integrity, character and quality of leadership that President Muhammadu Buhari has brought. I feel depressed when the nation is challenged with security issues. Instead of us rising as an orgasmic whole to see how we can support the President to deal with these foreign herders that are colonising our various roads and farms, we rather sit back; we tend to create an impression as if the government is not doing well.\n\n“So, it is therefore not driven by a mere political ideology but the philosophical point that this nation is tending toward the brink of collapse and we must support the President. The reality is that there is a reason for which I have moved is what I have analysed for you…because of my personal relationship with Mr President. The relationship is so strong that, don’t forget, the President’s first working visit was to Cross River State. I am not from the North. I am not a Muslim. I was not in APC. But the President chose my state to visit. I owe him that sense of duty, relationship, that fatherly respect. I have related closely with him and I can see his heart and soul. He is a good man in all total sense.\n\n“Essentially speaking, I am one of those whose political slogan is very clear…Politics with Ethics. I am from Cross River State and Governor of Cross River State. Cross River has been reduced to worse in body, in spirit and in the soul; a state that has lost her territory and oil wells; a state that is among the lowest, 35th out of 36 states, in terms of federal allocation. The only state in the South-South that is completely dislocated from the comity of the oil-producing states. A state that does not get 13 per cent derivation. A state that its monthly income is far less than its cumulative monthly salary. I was hit elected to practise politics but to bring value to my society; to the people who elected me.”\n\nAyade added, “I don’t believe that by this decision, it is disloyal to the party (PDP). Even all through the time I spoke about my defection, I never spoke about PDP. So, for me, APC is the party to go to at this point in time because if this nation does not have a smooth transition in 2023, what we talk about Somalia will be like a child’s play.\n\n“The choice to join APC at this point is based on a nationalistic approach and my commitment to my state; nothing to do with morality or the issue of whether I’m loyal or not to the PDP. Besides, as many people as you see in the PDP, have defected at one time or the other. And many people that you are talking to in APC, who are so committed to this nation, were at some time in PDP.\n\n“As to whether there are issues in the PDP, no. The party stood by me all through the way. In any other legal issue that I have had, PDP had stood with me. PDP gave me the opportunity to be a senator; PDP gave me the opportunity to be governor. I would never have any time to pull down PDP. I have integrity, character and honour. My politics have ethics. My decision to join APC is to join the President to reduce the tension in the country.”",
          "summary": "Governor of Cross River State, Ben Ayade, has stated that the Peoples Democratic Party, which he dumped for the All Progressives Congress on Thursday, stood by him during his political travails.\nAyade also said more governors in the opposition PDP would soon join the ruling APC.\nThe relationship is so strong that, don’t forget, the President’s first working visit was to Cross River State.\nI am from Cross River State and Governor of Cross River State.\nMy decision to join APC is to join the President to reduce the tension in the country.”",
          "link": "https://punchng.com/pdp-stood-by-me-i-was-loyal-to-party-says-ayade/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "president",
            "nation",
            "state",
            "apc",
            "relationship",
            "pdp",
            "loyal",
            "river",
            "ayade",
            "cross",
            "party",
            "join",
            "stood"
          ]
        },
        {
          "title": "NUJ presents role model award to Yahaya Bello",
          "text": "The Nigeria Union of Journalists has honoured the Governor of Kogi State, Yahaya Bello, with a distinguished Role Model Award in education, for what it described as his outstanding achievements in education in his state in the last five years.\n\nThe National President, NUJ, Chris Isiguzo, said the governor was given the award Committee after a painstaking assessment of each state in the education sector.\n\nAccording to him, the Role Model in Education Award is a special category award, given to Bello for bringing revolution to education in Kogi State.\n\nIsiguzo stated, “The award we are presenting to him (Bello) today is a special category award in education. Apart from recognising political actors that have done well in press freedom, we also take time out to single out political leaders that have by their own actions made enormous contributions across sectors.\n\n“For Governor Yahaya Bello, today, we singled him out because of the massive transformation he has brought to the education sector and we are giving him the role model award in education. Governor Yahaya Bello started a university from scratch, and today, that university is set to kick off. He has transformed the state polytechnic and other institutions.”\n\nHe said these were among many other achievements of the governor, which the award committee took into consideration, including the fact that the teaching staff in Kogi State stood out clearly among their colleagues in other states.\n\nThe NUJ President added, “If you look at the teaching staff in Kogi State and compare them with their contemporaries in other states, the difference is clear. Oftentimes, political actors tend to confuse the role of the media. They see us from the point of view of antagonists.\n\n“We are institutional partners. Where a government has done well, it is our responsibility to acknowledge such achievement; where the government has also not done very well, it is also our responsibility to challenge the same government and say, in this same area, you have not done well.”\n\nResponding, Bello said his administration identified the development of the education sector as the key to capital development needed for the emancipation of the people of the state.\n\nHe said, “I did not know that in carrying out my constitutional responsibilities to the best of my ability and within the limited resources available, I was making a serious impact in the educational sector and paving the way for awards.\n\n“The transformed education system is the reason our youth are no longer taking to crime.”",
          "summary": "The Nigeria Union of Journalists has honoured the Governor of Kogi State, Yahaya Bello, with a distinguished Role Model Award in education, for what it described as his outstanding achievements in education in his state in the last five years.\nAccording to him, the Role Model in Education Award is a special category award, given to Bello for bringing revolution to education in Kogi State.\nIsiguzo stated, “The award we are presenting to him (Bello) today is a special category award in education.\n“For Governor Yahaya Bello, today, we singled him out because of the massive transformation he has brought to the education sector and we are giving him the role model award in education.\nGovernor Yahaya Bello started a university from scratch, and today, that university is set to kick off.",
          "link": "https://punchng.com/nuj-presents-role-model-award-to-yahaya-bello/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "role",
            "bello",
            "state",
            "governor",
            "yahaya",
            "today",
            "sector",
            "model",
            "nuj",
            "education",
            "kogi",
            "award",
            "presents"
          ]
        },
        {
          "title": "Miyetti Allah backs Southern govs on open grazing ban",
          "text": "The Miyetti Allah Cattle Breeders Association of Nigeria has supported the ban on open grazing in the Southern part of the country which was issued by governors of the region.\n\nMACBAN’s position was declared by the National Patron, Senator Walid Jibrin, during a press conference in Kaduna on Thursday.\n\nJibrin said the ban is capable of providing solutions to the farmers-herders crisis across the country.\n\nHe said cattle rearing has been in Africa for over 100 years without any consideration to the free movement of cattle (Open Grazing) or any Grazing Reserve.\n\nHe, however, said such was allowed because there were few herders then, as he pointed out that the practice today is getting outdated internationally.\n\nGovernors of the Southern part of Nigeria had issued the ban on open grazing after a meeting in Asaba, the Delta State capital so as to curb the insecurity in the region.",
          "summary": "The Miyetti Allah Cattle Breeders Association of Nigeria has supported the ban on open grazing in the Southern part of the country which was issued by governors of the region.\nMACBAN’s position was declared by the National Patron, Senator Walid Jibrin, during a press conference in Kaduna on Thursday.\nJibrin said the ban is capable of providing solutions to the farmers-herders crisis across the country.\nHe said cattle rearing has been in Africa for over 100 years without any consideration to the free movement of cattle (Open Grazing) or any Grazing Reserve.\nGovernors of the Southern part of Nigeria had issued the ban on open grazing after a meeting in Asaba, the Delta State capital so as to curb the insecurity in the region.",
          "link": "https://punchng.com/miyetti-allah-backs-southern-govs-on-open-grazing-ban/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "ban",
            "issued",
            "govs",
            "backs",
            "today",
            "nigeria",
            "grazing",
            "allah",
            "open",
            "thursdayjibrin",
            "cattle",
            "walid",
            "southern",
            "miyetti"
          ]
        },
        {
          "title": "We built N30m mosque for displaced herders –Agric ministry",
          "text": "The Federal Ministry of Agriculture and Rural Development on Thursday confirmed the leaked memo as being authentic and stressed that it built the mosque for livestock farmers.\n\nIt disclosed this in a statement issued by the Director Information, FMARD, Theodore Ogaziechi, adding that the livestock farmers were sacked from their settlements by Boko Haram insurgents in Borno.\n\nIt said, “To put the facts straight, the memo is authentic and appropriate in all ramifications.\n\n“It is original and was issued by the ministry for the construction of a worship centre for a community of livestock farmers who were sacked and displaced in Borno State by Boko Haram insurgents and are being resettled in Ngarannam/Mafa Local Government, Borno State.”\n\nThe ministry went ahead to state that apart from the mosque, other common facilities provided for the livestock farmers in the community include solar-powered boreholes with overhead tanks and drinking troughs for their cattle and small ruminants.\n\nRead Also\n\nOthers include water harvesting structures, milk collection centre, resettlement abode, as well as other infrastructure to properly settle and rehabilitate the displaced livestock farmers.\n\n“The construction of the mosque was a special request from the community through the Borno State Government to avoid moving too far from the settlement areas for prayers and also to ensure their safety and contact with the insurgents,” the FMARD stated.\n\nIt added, “The memo is an official document and it is available for public scrutiny and review. It is therefore unfortunate for anyone to presume that the memo leaked.\n\n“The ministry is in no way perturbed about the matter because it received appropriate approval, carried out due needs assessment, and ensured due process in the execution of the project.”\n\nThe ministry advised that in the future, due diligence and restraint should be observed before publications of this nature, as it argued that it was meant for public good and security.",
          "summary": "The Federal Ministry of Agriculture and Rural Development on Thursday confirmed the leaked memo as being authentic and stressed that it built the mosque for livestock farmers.\nIt disclosed this in a statement issued by the Director Information, FMARD, Theodore Ogaziechi, adding that the livestock farmers were sacked from their settlements by Boko Haram insurgents in Borno.\nIt said, “To put the facts straight, the memo is authentic and appropriate in all ramifications.\nRead AlsoOthers include water harvesting structures, milk collection centre, resettlement abode, as well as other infrastructure to properly settle and rehabilitate the displaced livestock farmers.\nIt added, “The memo is an official document and it is available for public scrutiny and review.",
          "link": "https://punchng.com/we-built-n30m-mosque-for-displaced-herders-agric-ministry/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "livestock",
            "memo",
            "mosque",
            "state",
            "community",
            "borno",
            "agric",
            "herders",
            "built",
            "farmers",
            "n30m",
            "sacked",
            "insurgents",
            "displaced",
            "ministry"
          ]
        }
      ]
    },
    "vanguard": {
      "link": "https://www.vanguardngr.com/category/national-news/",
      "articles": [
        {
          "title": "Restructuring Call: Ned Nwoko writes Buhari, wants President to grant full autonomy to LGA, State Assemblies, Judiciary",
          "text": "Kindly Share This Story:\n\n.asks Ohanaeze, Afenefere, Arewa, PANDEF, Other groups to give total support\n\n…calls on NASS to give legal backing to Southern Govs’ resolutions\n\nBy Levinus Nwabughiogu-Abuja\n\nBillionaire Lawyer and former member of the House of Representatives, Hon. Ned Nwoko has asked President Muhammadu Buhari to grant full autonomy to the local government councils to facilitate their revenue allocation directly from the federation accounts.\n\nHe also asked that the same treatment be given to state houses of assembly and the judiciary just as he called on the national assembly to enact laws to legal backing to the recent resolutions of the southern governors.\n\nNwoko in an open letter to Buhari, a copy of which he made available to Vanguard in Abuja on Thursday said giving heed to the issue was the only to bring peace, unity, progress, security, and sustainable development to the country.\n\nHe also called on the socio-political regional bodies such as Ohanaeze Ndigbo, Afenefere, Arewa, PANDEF to give their total support to the call.\n\nAccording to him, the autonomy would signal the commencement of the restructuring Nigerians were hearing for.\n\nNwoko lauded Buhari for his many populist and people-oriented programmes and policies, declaring support for the President.\n\nHe said that a situation where state Governors muzzle the local government and the Houses of the assembly was highly defective to the ideals of democracy.\n\nThe letter read in parts: “Today, Nigeria as a developing nation is faced with a myriad of social, economic and political challenges which have been endemic and long drawn transcending successive governments. But even with the hydra headed constraints, you have continued to stand firm in your faith and hope in the survival and growth of the nation, especially with your anti-graft crusade and selfless leadership style.\n\n“I share your good vision that Nigeria must overcome her problems, rise above her inhibitions and move forward for the well-being of her over 200 million people.\n\n“In recent times there have been growing interest and anxiety in the affairs of Nigeria against the backdrop of corruption, socio-economic difficulties and insecurity by bandits across the country.\n\n“I particularly share your concerns for the necessity of one Nigeria,that would guarantee peaceful coexistence, equity and social justice among the diverse inhabitants.\n\n“Mr. President, I am elated that you have championed this move with your policy thrust of granting autonomy to local governments as well as ensuring independence of State Assemblies and the judiciary.Your quest remains a bold patriotic template that would strengthen separation of powers among the executive, judiciary and legislature,for the benefit of all Nigerians.\n\n“Your Excellency , I join you and other well meaning Nigerians, as an impassioned citizen and concerned stakeholder in the Nigerian project to make a clarion call for the sustenance of these institutions .I specifically call for full autonomy for the local government administration in Nigeria as the bedrock of restructuring,true federalism and genuine democracy.\n\n“I make bold to assert that lack of independence in local government leadership has over the years produced a weak structure that could not safe guard lives and inspire good governance at the grassroots.\n\n“My firm belief is that local government autonomy and direct funding from the Federation allocation account would embolden elected chairmen and councilors to work effectively with divisional police officers and traditional rulers to manage security as every crime is local.\n\n“The prevailing situation where most state governors control local government funds through the federation allocation account, leaving the councils as appendages of the states, is grossly defective. Local governments deserve independence to attract experienced technocrats and successful business men who have the latitude and wealth of experience to perform as chairmen.\n\n“I am convinced such arrangement would herald real democracy as elections would be fought locally and popular candidates would emerge regardless of political parties and godfather phenomenon.”\n\nGo beyond rhetorics on restructuring call by Southern Govs\n\n“The recent resolution by Southern governors for restructuring should go beyond rhetorics and be matched with action. What is required urgently is for the National Assembly to ensure implementation of administrative and financial autonomy in favour of democratic institutions in Nigeria especially the local governments.\n\n“Elections will be free and fair if local governments are independent.This will usher in the much needed election of credible aspirants. Council chairmen will be effective while Councilors will take charge of their wards. Also the kings will be held responsible for their towns and villages.\n\n“It has been generally observed that most Governors don’t know what goes on in local governments areas.They rely on advisers who are most times not resident in the LGAs. Majority of the Governors control elections because they control local government executives. Free these executives and empower them through direct allocations and see what will happen with elections and security.\n\n“Mr. president,the restructuring we need should start from the grassroots because it is the foundation of democracy.Happily you have been in the vanguard of this campaign and I wholeheartedly support your efforts so far.\n\n“I also call on Ohaneze, Afenefere, Arewa, PANDEF and other groups to give total support. I believe that if this is achieved before the next general elections in 2023, everything will change for good, to the delight of all Nigerians.\n\n“We need strong democratic institutions at the various levels in Nigeria for the good of all. We need rule of law and social justice much more than ever before. The strike by judicial workers under JUSUN demands this reasonably. Judges deserve financial and administrative autonomy to function freely. State legislators should not be subservient to state Chief executives. Local governments must stand alone to drive effective governance at the grassroots.\n\n“It is a welcome development that public hearing on the review of the 1999 Constitution is holding simultaneously across the six geo political zones from May 26 to 27, 2021. Local government officials in collaboration with traditional rulers must mobilize their people to participate massively. Political parties, civil society organizations, human rights groups, youths and women bodies and indeed all Nigerians irrespective of tribe, religion and social status must ensure full participation in the constitutional review process.\n\n“The needed and achievable restructuring is autonomy of local governments and independence of state Assemblies and the judiciary.\n\n“My inner conviction is that such proper framework of institutional reforms will lead to the birth of a new Nigeria rooted in a glorious culture of self belonging, justice and fairness, peace and unity, political stability, economic prosperity and general fulfillment. A new Nigeria where democracy would live up to its true meaning as government of the people ,by the people and for the people, propounded by the 16th President of the United States of America, Abraham Lincoln. True democratic independence at the local governments, state assemblies and the judiciary represents the trajectory of our search for a better Nigeria.\n\n“Mr. President, I resolutely trust and have the confidence that you will do your utmost best as a consummate patriot and exemplary leader to bequeath a legacy of viable democracy to the present and future generations of Nigerians.\n\n“Your Excellency,may God continue to guide you in good health and wisdom to lead Nigeria towards the attainment of the positive goals and dreams of the founding fathers.”\n\nKindly Share This Story:",
          "summary": "Ned Nwoko has asked President Muhammadu Buhari to grant full autonomy to the local government councils to facilitate their revenue allocation directly from the federation accounts.\nHe said that a situation where state Governors muzzle the local government and the Houses of the assembly was highly defective to the ideals of democracy.\n“Elections will be free and fair if local governments are independent.This will usher in the much needed election of credible aspirants.\n“The needed and achievable restructuring is autonomy of local governments and independence of state Assemblies and the judiciary.\nTrue democratic independence at the local governments, state assemblies and the judiciary represents the trajectory of our search for a better Nigeria.",
          "link": "https://www.vanguardngr.com/2021/05/restructuring-call-ned-nwoko-writes-buhari-wants-president-to-grant-full-autonomy-to-lga-state-assemblies-judiciary/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "governments",
            "president",
            "lga",
            "state",
            "local",
            "autonomy",
            "governors",
            "restructuring",
            "ned",
            "good",
            "nigeria",
            "independence",
            "writes",
            "political",
            "grant",
            "judiciary",
            "nwoko",
            "wants"
          ]
        },
        {
          "title": "Lagos drops N428.98bn into FG IGR in 2020-Commissioner -",
          "text": "Kindly Share This Story:\n\nBy Olasunkanmi Akoni\n\nLagos State Government said it contributed N428.98 billion (32.08 percent) of the N1.3 trillion total IGR generated by states and the Federal Capital Territory (FCT) in 2020.\n\nCommissioner for Economic Planning and Budget, Sam Egube, disclosed this on Thursday, during a ministerial press briefing to mark the second anniversary of Governor Bababjide Sanwo-Olu-led administration in the state, held in Alausa, Ikeja.\n\nThis, he said, was according to April 16, 2021, the report by the National Bureau of Statistics (NBS). This makes Lagos the highest contributor to the federal purse.\n\nEgube said: “This report shows that we are on course. It is clear proof that the ‘THEMES AGENDA’ of the Governor Babajide Sanwo-Olu-led administration is an operational tool that is correctly aligned to our long-term development plan, and hooked up into our Medium Sector Strategy.”\n\n“The THEMES AGENDA remains strong, and all its elements remain relevant. Even in the heart of the pandemic, the pillars held through. It was like Mr. Governor saw the future, despite the headwinds that came against the pillars, such as the health pandemic and the economic downturn, which lead to a revised budget and other tactical maneuvers against the COVID-19 pandemic.”\n\nThe commissioner added that the Lagos State Development Plan (LSDP), which encompasses the State Economic Development Policy and guided by the State Development Plan (2012-2025), has been improved on and expanded to a 30-year Development Plan (2021-2051).\n\n“This new perspective plan is necessary to ‘encourage citizens participation (Build Team Lagos); develop our people to drive productivity and protect the vulnerable (Building our Future); drive Lagos readiness and openness for Business (Building our Economy); optimising relevant infrastructure to support our growth (Building our 21st Century Mega-City) and engaging intergovernmental partnership; all these are aimed at improving the quality of lives of Lagosians.\n\n“The LSDP sits at the apex of the planning and budgetary system of the state. The document provides an overall direction for the growth and development of Lagos State. It also provides a framework through which all sectors of the economy can direct their energies and contribute to the improvement of the quality of life of people,” Ebube stated.\n\nKindly Share This Story:",
          "summary": "Kindly Share This Story:By Olasunkanmi AkoniLagos State Government said it contributed N428.98 billion (32.08 percent) of the N1.3 trillion total IGR generated by states and the Federal Capital Territory (FCT) in 2020.\nThis, he said, was according to April 16, 2021, the report by the National Bureau of Statistics (NBS).\nThis makes Lagos the highest contributor to the federal purse.\n“The LSDP sits at the apex of the planning and budgetary system of the state.\nThe document provides an overall direction for the growth and development of Lagos State.",
          "link": "https://www.vanguardngr.com/2021/05/lagos-drops-n428-98bn-into-fg-igr-in-2020-commissioner/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "2020commissioner",
            "state",
            "governor",
            "igr",
            "sanwooluled",
            "building",
            "development",
            "fg",
            "n42898bn",
            "plan",
            "themes",
            "lagos",
            "share",
            "economic",
            "drops"
          ]
        },
        {
          "title": "FG brokers truce between Kaduna Government, NLC",
          "text": "Kindly Share This Story:\n\n\n\n–Set up 10-member c’ttee\n\nBy Johnbosco Agbakwuru\n\nABUJA–THE Federal Government yesterday brokered a truce between the Kaduna State Government and the Nigerian Labour Congress, NLC, in the ongoing face-off between the two parties.\n\nRecall that the Federal Government through the Minister of Labour and Employment, Senator Chris Ngige had on Wednesday sent an invitation letter to the two parties for a meeting to resolve the unrest between the two.\n\nAt the conciliation meeting which lasted for about five hours, at the Minister’s office in Abuja, the two parties reached an agreement.\n\nA Memorandum of Understanding (MoU) was signed by the two disputing parties and top officials of the Federal Ministry of Labour and Employment.\n\nBriefing journalists after the meeting, Senator Ngige said they exhaustively and extensively deliberated on all the issues in dispute, bordering on the retrenchment of workers by the Kaduna State Government.\n\nHe said they agreed that all the listed issues fall within the ambit of redundancy and it was resolved that the principle of redundancy as stated in Section 20 of Labour Act, Cap L1 Laws of the Federation of Nigeria should apply.\n\nAccording to the Minister, the contentious issues that were looked into included the compulsory retirement of workers on Grade Level 14 and above and those who have attained the age of 50 years irrespective of Grade Levels, the reduction of staff strength of Local Government to 50 in each of the 23 local government areas and casualisation of workers on Grade Level 1-6.\n\nThe Minister said the meeting also recognized that the current impasse was caused by a communication gap between the State Government and NLC occasioned by both the local chapter and even the Kaduna State Government officials.\n\nHe said in view of the foregoing, the meeting resolved to constitute a ten-man Bi-partite Committee, comprising six representatives of the Kaduna State Government and three officials of NLC to engage further with the objective of reverting back with a work plan on how to resolve the impasse between the State Government and the NLC.\n\nHe said, “The meeting resolved that the Committee should have as Chairman, the Head of Service of Kaduna State Government and assisted by a Deputy National President of the NLC. The Committee is expected to revert with the work plan for peaceful resolution of all issues in contention to the Honourable Minister of Labour and Employment by Tuesday, 25th May, 2021.\n\n“The work plan is to itemize the structure and sub-structure in the state Local Government of their activities, time of commencement as envisaged, final tenure of the Committee or make recommendations if in its wisdom it thinks that the committee should be a Permanent Standing Committee.”\n\n“In conclusion, it was agreed that there should be no further industrial action on these issues and no worker shall be victimized on account of his or her participation in the industrial action.”\n\nThe signatories to the MoU were the Head of Service, Kaduna State Government, Bariatu Yusuf Mohammed, and Commissioner for Local Government, Ja’afaru Ibrahim Sani, NLC President, Ayuba Wabba and Deputy President, Najeem Usman.\n\nOthers are the Director, Trade Union Services, Federal Ministry of Labour and Employment, Mrs. Omoabie Akpan, and Director of Finance and Accounts, Aloy Muoneke who represented the Permanent Secretary of the Ministry.\n\nVanguard News Nigeria\n\nKindly Share This Story:",
          "summary": "Kindly Share This Story:–Set up 10-member c’tteeBy Johnbosco AgbakwuruABUJA–THE Federal Government yesterday brokered a truce between the Kaduna State Government and the Nigerian Labour Congress, NLC, in the ongoing face-off between the two parties.\nA Memorandum of Understanding (MoU) was signed by the two disputing parties and top officials of the Federal Ministry of Labour and Employment.\nBriefing journalists after the meeting, Senator Ngige said they exhaustively and extensively deliberated on all the issues in dispute, bordering on the retrenchment of workers by the Kaduna State Government.\nThe Minister said the meeting also recognized that the current impasse was caused by a communication gap between the State Government and NLC occasioned by both the local chapter and even the Kaduna State Government officials.\nHe said, “The meeting resolved that the Committee should have as Chairman, the Head of Service of Kaduna State Government and assisted by a Deputy National President of the NLC.",
          "link": "https://www.vanguardngr.com/2021/05/fg-brokers-truce-between-kaduna-government-nlc/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "nlc",
            "issues",
            "kaduna",
            "state",
            "labour",
            "local",
            "federal",
            "truce",
            "fg",
            "meeting",
            "committee",
            "brokers",
            "minister"
          ]
        }
      ]
    },
    "dailypost": {
      "link": "https://dailypost.ng/",
      "articles": [
        {
          "title": "Bandits kill son of Emir of Kontagora, many others in Niger State",
          "text": "Armed bandits have reportedly shot the son of the Emir of Kotangora, Alhaji Bashar Saidu Namaska to death on his father’s farm in Kontagora headquarters of Kontagora local government area of Niger State.\n\nThe incident which occurred yesterday, threw the people of the ancient city into panic and confusion.\n\nIt was gathered that the bandits killed the late son of the traditional ruler while working on his father’s farm on Masugu not far from Kontagora village along Zuru road.\n\nDAILY POST learnt that he was gunned down alongside some other people in the farm. The bandits also rustled unspecified number of cows in the farm.\n\nThe bandits, it was learnt, further stopped both commercial and private vehicles plying the road, and collected phones, money as well as other valuables from commuters.\n\nEyewitness account stated that those without cash in their possession were beaten mercilessly, and many others kidnapped to an unknown location.\n\nConfirming the incident, a top government official in the state who does not want his name in print said the bandits stormed the ancient town of Kontagora and shot the Emir’s son, Alh. Baashar and many others to death.\n\nAccording to the official, Alh. Baashar was rushed to the hospital immediately, but was confirmed dead and has been buried.",
          "summary": "Armed bandits have reportedly shot the son of the Emir of Kotangora, Alhaji Bashar Saidu Namaska to death on his father’s farm in Kontagora headquarters of Kontagora local government area of Niger State.\nThe incident which occurred yesterday, threw the people of the ancient city into panic and confusion.\nIt was gathered that the bandits killed the late son of the traditional ruler while working on his father’s farm on Masugu not far from Kontagora village along Zuru road.\nThe bandits, it was learnt, further stopped both commercial and private vehicles plying the road, and collected phones, money as well as other valuables from commuters.\nConfirming the incident, a top government official in the state who does not want his name in print said the bandits stormed the ancient town of Kontagora and shot the Emir’s son, Alh.",
          "link": "https://dailypost.ng/2021/05/20/bandits-kill-son-of-emir-of-kontagora-many-others-in-niger-state/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "incident",
            "official",
            "fathers",
            "kontagora",
            "state",
            "farm",
            "kill",
            "learnt",
            "shot",
            "niger",
            "baashar",
            "bandits",
            "son",
            "emir"
          ]
        },
        {
          "title": "Buhari's agrarian revolution brought Ayade into APC",
          "text": "The Director-General of Voice of Nigeria (VON), Osita Okechukwu, has disclosed the rationale behind the defection of the Governor of Cross Rivers State from the Peoples Democratic Party to the governing APC.\n\nDAILY POST reports that Governor Ben Ayade formally declared for the ruling party at the Cross River State Executive Council Chamber, Governor’s Office in Calabar after a two-hour meeting with seven APC governors led by the party’s interim chairman and governor of Yobe State, Mai Mala Buni.\n\nBut, speaking in a telephone interview with DAILY POST, on Thursday, Okechukwu, a chieftain of the All Progressive Congress, pointed out that Ayade’s defection was necessitated by the agrarian revolution of President Muhammadu Buhari-led Federal government going on nationwide.\n\nHe added that cross river had benefited handsomely from the revolution and further posited that Ayade’s entry into the All Progressive Congress would give the latter the mileage in attracting more infrastructural amenities from the center.\n\nThe VON DG commended Ayade for his wisdom in pitching tent with the progressive party, urging the Cross River State Chief Executive to study the APC manifesto carefully, as he stated that the governing party believes in Infrastructure and projects.\n\nHis words, “Governor Ayade is welcomed onboard. I think, is of the interest of his state that he wants to join the majority party. I think it is a wisdom, because, he is one of the foremost beneficiaries of President Muhammadu Buhari agrarian revolution.\n\n“He has benefited handsomely, and he knows. Now he is in APC, he has great mileage in attracting more amenities from the center. I think, the governor is in order.\n\n“Let him carefully go through our manifesto so that he would understand where we are coming from. That APC socially believe in infrastructure and projects. Like the PDP that share the money, so, he has alot to learn as pertaining to infrastructure.”\n\nMeanwhile, speaking on why he was joining the APC, Governor Ben Ayade highlighted the character attributes of President Muhammadu Buhari and the realisation that Cross River, which has been emasculated economically following the ceding of its oil wells, needed to be in sync with the party at the center, as the main reasons for moving.\n\nAccording to the governor, “having seen and known the President of the Federal Republic of Nigeria and his commitment to this country, his nationalistic disposition and all the efforts he has made to bring Nigeria to where we are today, it is obvious that at this point, we needed to join hands with him to build a Nigeria that we can be proud of.”",
          "summary": "He added that cross river had benefited handsomely from the revolution and further posited that Ayade’s entry into the All Progressive Congress would give the latter the mileage in attracting more infrastructural amenities from the center.\nThe VON DG commended Ayade for his wisdom in pitching tent with the progressive party, urging the Cross River State Chief Executive to study the APC manifesto carefully, as he stated that the governing party believes in Infrastructure and projects.\nHis words, “Governor Ayade is welcomed onboard.\nI think it is a wisdom, because, he is one of the foremost beneficiaries of President Muhammadu Buhari agrarian revolution.\nNow he is in APC, he has great mileage in attracting more amenities from the center.",
          "link": "https://dailypost.ng/2021/05/20/buharis-agrarian-revolution-brought-ayade-into-apc-von-dg-osita-okechukwu/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "president",
            "governor",
            "state",
            "apc",
            "agrarian",
            "nigeria",
            "party",
            "brought",
            "river",
            "ayade",
            "cross",
            "think",
            "buharis",
            "revolution"
          ]
        },
        {
          "title": "Malami's statement on open grazing has questioned Nigeria's unity",
          "text": "Senator Enyinnaya Abaribe, Senate minority leader, has accused the Attorney General and Minister of Justice, Abubakar Malami, SAN, of threatening Nigeria’s unity with his reaction to the call for the ban on open grazing by Southern Nigerian Governors.\n\nDAILY POST had earlier reported that the Southern Nigerian Governors recently banned open grazing in the region to control the incessant crisis between farmers and Fulani herders.\n\nBut Malami, while speaking on Channels Television on Wednesday, faulted the decision of the governors, saying it does not align with the provisions of Nigeria’s constitution.\n\nReacting, Abaribe, in a statement by his media aide, Uche Awon, described Malami’s statement as a dangerous mindset.\n\nThe statement read in part, “While the local “bureau de change” business mostly done by the Fulanis are operating in all parts of Nigeria, why have they not elicited any resentment of other Nigerians?\n\n“It’s simply because they live and do their business peacefully without any problem. It’s the murderous activities of Fulani herders that have given rise to the current demand for laws that will bring about peaceful coexistence of all Nigerians.\n\n“Such a divisive statement from a top federal government official, in fact, the chief legal adviser to the Federal Government at that, exposes a very dangerous mindset.\n\n“This disposition has no doubt raised the tension in Nigeria to a frightening level.\n\n“Why should an Attorney General of the Federation be so fixated in evoking ethnic/regional fault lines when duty calls for him to be a statesman?\n\n“It’s disheartening that Mr Abubakar Malami has chosen to debase our country. He has indeed questioned Nigeria’s unity. Very unfortunate.”",
          "summary": "Senator Enyinnaya Abaribe, Senate minority leader, has accused the Attorney General and Minister of Justice, Abubakar Malami, SAN, of threatening Nigeria’s unity with his reaction to the call for the ban on open grazing by Southern Nigerian Governors.\nDAILY POST had earlier reported that the Southern Nigerian Governors recently banned open grazing in the region to control the incessant crisis between farmers and Fulani herders.\nBut Malami, while speaking on Channels Television on Wednesday, faulted the decision of the governors, saying it does not align with the provisions of Nigeria’s constitution.\nReacting, Abaribe, in a statement by his media aide, Uche Awon, described Malami’s statement as a dangerous mindset.\nHe has indeed questioned Nigeria’s unity.",
          "link": "https://dailypost.ng/2021/05/20/malamis-statement-on-open-grazing-has-questioned-nigerias-unity-abaribe/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "unity",
            "governors",
            "nigerias",
            "nigerian",
            "nigeria",
            "questioned",
            "grazing",
            "statement",
            "open",
            "malami",
            "malamis",
            "southern"
          ]
        }
      ]
    },
    "thenation": {
      "link": "https://thenationonlineng.net/",
      "articles": []
    },
    "sun_news": {
      "link": "https://www.sunnewsonline.com/",
      "articles": [
        {
          "title": "Ohanaeze to Malami: It’s senseless comparing Fulani herdsmen to spare parts dealers",
          "text": "From Magnus Eze, Enugu\n\nOhanaeze Ndigbo has descended on Attorney General of the Federation and Minister of Justice, Abubakar Malami for saying that the Southern governors decision to ban open grazing in the South was unconstitutional and “is like a ban on the sale of motor spare parts in the North”.\n\nIt described such a remark by a chief law officer of a federation as thoughtless, insidious and prejudicial.\n\nA statement by spokesman of Ohanaeze, Alex Ogbonnia on behalf of its President General, George Obiozor, condemned the remark by Malami as malevolent, ominous and incendiary.\n\nIt wondered why the AGF was comparing people who were doing the business legitimately without causing any harm to their host communities to murderous and destructive herders.\n\nOhanaeze added that the Southern governors had by their banning of open grazing shown that they are the true lovers of the corporate existence of Nigeria.\n\nThe apex Igbo socio-cultural organisation the AGF was a chief law officer with penchant for twisting the law at will.\n\nOhanaeze recalled that Malami had in the past stated that “the rule of law is subservient to national security”, and also condemned the Amotekun security outfit by the South West and so on.\n\nThe group noted that the Fulani herders operated freely in the Southern Nigeria for ages until recently when they began to kill, main and destroy people farmlands.\n\nIt therefore, urged the Southern Governors to ignore Malami and go ahead and put machinery in motion for the appropriate legal instruments in their respective states so that the open grazing law will become enforceable.",
          "summary": "It described such a remark by a chief law officer of a federation as thoughtless, insidious and prejudicial.\nA statement by spokesman of Ohanaeze, Alex Ogbonnia on behalf of its President General, George Obiozor, condemned the remark by Malami as malevolent, ominous and incendiary.\nOhanaeze added that the Southern governors had by their banning of open grazing shown that they are the true lovers of the corporate existence of Nigeria.\nThe apex Igbo socio-cultural organisation the AGF was a chief law officer with penchant for twisting the law at will.\nIt therefore, urged the Southern Governors to ignore Malami and go ahead and put machinery in motion for the appropriate legal instruments in their respective states so that the open grazing law will become enforceable.",
          "link": "https://www.sunnewsonline.com/ohanaeze-to-malami-its-senseless-comparing-fulani-herdsmen-to-spare-parts-dealers/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "south",
            "senseless",
            "herdsmen",
            "governors",
            "ohanaeze",
            "remark",
            "fulani",
            "comparing",
            "spare",
            "grazing",
            "security",
            "dealers",
            "open",
            "malami",
            "parts",
            "law",
            "southern",
            "officer"
          ]
        },
        {
          "title": "Ohanaeze to Malami: It’s senseless comparing Fulani herdsmen to spare parts dealers",
          "text": "From Magnus Eze, Enugu\n\nOhanaeze Ndigbo has descended on Attorney General of the Federation and Minister of Justice, Abubakar Malami for saying that the Southern governors decision to ban open grazing in the South was unconstitutional and “is like a ban on the sale of motor spare parts in the North”.\n\nIt described such a remark by a chief law officer of a federation as thoughtless, insidious and prejudicial.\n\nA statement by spokesman of Ohanaeze, Alex Ogbonnia on behalf of its President General, George Obiozor, condemned the remark by Malami as malevolent, ominous and incendiary.\n\nIt wondered why the AGF was comparing people who were doing the business legitimately without causing any harm to their host communities to murderous and destructive herders.\n\nOhanaeze added that the Southern governors had by their banning of open grazing shown that they are the true lovers of the corporate existence of Nigeria.\n\nThe apex Igbo socio-cultural organisation the AGF was a chief law officer with penchant for twisting the law at will.\n\nOhanaeze recalled that Malami had in the past stated that “the rule of law is subservient to national security”, and also condemned the Amotekun security outfit by the South West and so on.\n\nThe group noted that the Fulani herders operated freely in the Southern Nigeria for ages until recently when they began to kill, main and destroy people farmlands.\n\nIt therefore, urged the Southern Governors to ignore Malami and go ahead and put machinery in motion for the appropriate legal instruments in their respective states so that the open grazing law will become enforceable.",
          "summary": "It described such a remark by a chief law officer of a federation as thoughtless, insidious and prejudicial.\nA statement by spokesman of Ohanaeze, Alex Ogbonnia on behalf of its President General, George Obiozor, condemned the remark by Malami as malevolent, ominous and incendiary.\nOhanaeze added that the Southern governors had by their banning of open grazing shown that they are the true lovers of the corporate existence of Nigeria.\nThe apex Igbo socio-cultural organisation the AGF was a chief law officer with penchant for twisting the law at will.\nIt therefore, urged the Southern Governors to ignore Malami and go ahead and put machinery in motion for the appropriate legal instruments in their respective states so that the open grazing law will become enforceable.",
          "link": "https://www.sunnewsonline.com/ohanaeze-to-malami-its-senseless-comparing-fulani-herdsmen-to-spare-parts-dealers/#comments",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "south",
            "senseless",
            "herdsmen",
            "governors",
            "ohanaeze",
            "remark",
            "fulani",
            "comparing",
            "spare",
            "grazing",
            "security",
            "dealers",
            "open",
            "malami",
            "parts",
            "law",
            "southern",
            "officer"
          ]
        },
        {
          "title": "NUJ presents ‘role model in education’ award to Governor Bello",
          "text": "By Chinelo Obogo\n\nNigeria Union of Journalists (NUJ) has bestowed a ‘role model in education’ award on Governor Yahaya Bello of Kogi State for his ‘outstanding achievements in education’ in the last four years.\n\nDuring the presentation of the award in Abuja on Wednesday, May 19, the National President of NUJ, Chris Isiguzo, said Governor Bello was singled out by the award’s committee out of the 36 state governors after a painstaking assessment of the education sector in each state. According to him, the award is a special category award given to Bello for bringing revolution to education in Kogi State.\n\nIsiguzo said this is among many other achievements of the governor, which the award Committee took into consideration, including the fact that the teaching staff in Kogi State stood out clearly among their colleagues in other states.\n\n“The award we are presenting to Governor Bello today is a special category award in education. Apart from recognising political actors that have done well for press freedom, we also take time out to single out political leaders that have by their own actions made enormous contributions across sectors.\n\n“For Governor Yahaya Bello, we singled him out because of the massive transformation he has brought to the education sector and we are giving him the role model award in education. He started a university from the scratch, and today, that university is set to kick off. He has transformed the state polytechnic and other institutions.\n\n“If you look at the teaching staff in Kogi State and compare them with their contemporaries in other states, the difference is clear. Oftentimes, political actors tend to confuse the role of the media. They see us from the point of view of antagonists.\n\n“We are institutional partners. Where a government has done well, it is our responsibility to acknowledge such achievement; where the government has also not done very well, it is also our responsibility to challenge the same government and say, in this same area, you have not done well,” Isiguzo said.\n\nThe NUJ President added, “So many people may not understand what we are doing today, but it is something that we must have to do because we must encourage the shining examples we have in the present democratic experiment. This is why we have gathered here together with my colleagues, and with the endorsement of the national leadership of the union, we have come to present this special recognition to Governor Bello.\n\n“I must also point out that in arriving at this conclusion, it was not something that one or two persons sat down to do. The Managing Director, Enentis Communications, Dr. Peter Ademu, led the team of people that went through and screened the nominations. At the end of the day, they informed me that they had selected Governor Bello after thorough screening, that he stands out of the governors of the 36 states.”\n\nResponding, Bello said his administration identified the development of education sector as the key to high level human capital development needed for the emancipation of the people of the state.\n\nHe said, “I did not know that in carrying out my constitutional responsibilities to the best of my ability and within the limited resources available, I was making serious impact in the educational sector and paving the way for awards. The transformed education system is the reason our youth are no longer taking to crime.”",
          "summary": "By Chinelo ObogoNigeria Union of Journalists (NUJ) has bestowed a ‘role model in education’ award on Governor Yahaya Bello of Kogi State for his ‘outstanding achievements in education’ in the last four years.\nAccording to him, the award is a special category award given to Bello for bringing revolution to education in Kogi State.\n“The award we are presenting to Governor Bello today is a special category award in education.\n“For Governor Yahaya Bello, we singled him out because of the massive transformation he has brought to the education sector and we are giving him the role model award in education.\n“If you look at the teaching staff in Kogi State and compare them with their contemporaries in other states, the difference is clear.",
          "link": "https://www.sunnewsonline.com/nuj-presents-role-model-in-education-award-to-governor-bello/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "role",
            "bello",
            "governor",
            "state",
            "today",
            "sector",
            "model",
            "nuj",
            "education",
            "kogi",
            "award",
            "special",
            "presents"
          ]
        },
        {
          "title": "500 Nigerians languishing in Togolese prisons – GSAC",
          "text": "From Geoffrey Anyanwu, Enugu\n\nThe Global Society for Anti-Corruption (GSAC) yesterday alerted that no fewer than 500 Nigerian citizens were languishing in various prisons in Togo.\n\nConsequently, it has called on the federal government to intervene on behalf her citizens and ensure that they get justice.\n\nGSAC’s President, Mr Frankline Ezeona who briefed newsmen in Enugu on a recent fact-finding visit his organisation made to Togolese prisons, disclosed that a good number of the Nigerians in the said Togo prisons had spent more than 10 years awaiting trial.\n\nEzeona who decried the inhuman treatment being meted to the Nigerians by officials of the Togolese prisons, stressed that their situation had been compounded by the fact that they no longer have access to certain relief materials due to the ravaging COVID-19.\n\nFederal government intervention he said was needed because most of the Nigerians found themselves in prison out of ignorance, while others were victims of cyber crimes.\n\nHe said, “What we discovered is that many of them got into businesses like network marketing and didn’t know they were banned in that country. Some of them are genuine businessmen and women, who got into trouble with indigenous and what have you. None was discovered to have committed any capital offence. But they got them and threw them into the prison and for years, they don’t have dates in courts.\n\n“So we think that the federal government should intervene in their matter. Let some of them be released or extradited to face their prison terms in Nigeria. We are asking the Nigerian government to see how some of them can be released and granted amnesty based on stipulated law – on age, pregnancy, health and what have you.\n\n“For some released, we are asking that they be provided with relief materials or compensation because, it was discovered that, many of them are not guilty from the offences they were charged.”\n\nHe commended the newly posted Nigerian Ambassador to Togo, Adebowale Adesina for the interest he had shown on the plight of the Nigerians in Togolese prisons.\n\nThe GSAC’s legal team on the fact-finding tour led by Chidinma Udegbunam, disclosed that the organisation intervened following several distress messages it received from Nigerian prisoners in Togo.\n\nAccording to her, of the 13 prisons in Togo, the one in Lome alone was housing 300 Nigerian prisoners, noting that their situation was pitiable as they were lumped in already congested facilities.\n\nShe said, “There are ones that have spent nine years in prison for misdemeanor. We wanted to look at their flies but were not allowed to do so. The legal system operation in Togo is different from that of Nigeria. There, when one is accused of crime, he is being taken as guilty until proven otherwise. Anyone arrested is treated as convict. It is there system and their people know it is working for them. The administrative system is centralized.”\n\nNarrating the ordeal of one Jerry Odiesa, a Nigerian from Delta state, whom she said had served 11 of his 20 years conviction over cyber related crime, Udegbunam stated that what took him to prison was ignorance.\n\nShe further said, “We think the Togolese government should speedy up trial of these Nigerians and not allow one who is a suspect stay more years than they could have spent, because justice delayed is justice denied.",
          "summary": "From Geoffrey Anyanwu, EnuguThe Global Society for Anti-Corruption (GSAC) yesterday alerted that no fewer than 500 Nigerian citizens were languishing in various prisons in Togo.\nConsequently, it has called on the federal government to intervene on behalf her citizens and ensure that they get justice.\nGSAC’s President, Mr Frankline Ezeona who briefed newsmen in Enugu on a recent fact-finding visit his organisation made to Togolese prisons, disclosed that a good number of the Nigerians in the said Togo prisons had spent more than 10 years awaiting trial.\nEzeona who decried the inhuman treatment being meted to the Nigerians by officials of the Togolese prisons, stressed that their situation had been compounded by the fact that they no longer have access to certain relief materials due to the ravaging COVID-19.\nFederal government intervention he said was needed because most of the Nigerians found themselves in prison out of ignorance, while others were victims of cyber crimes.",
          "link": "https://www.sunnewsonline.com/500-nigerians-languishing-in-togolese-prisons-gsac/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "prison",
            "discovered",
            "togo",
            "system",
            "gsac",
            "nigerian",
            "nigerians",
            "togolese",
            "prisons",
            "500",
            "released",
            "languishing",
            "spent"
          ]
        },
        {
          "title": "Attack on govt official: Lagos blows hot, vows to prosecute culprits",
          "text": "By Lukman Olabiyi\n\nLagos State Government has declared attack on any of its personnel on official duty would no longer be tolerated.\n\nThe State government decried the rate at which its personnel were being attacked, vowed to arrest and prosecute any citizens cut in the act no matter the person status or connection.\n\nGovernor Babajide Sanwo-Olu’s Special Adviser on Central Business Districts (CBDs), Olugbenga Oyerinde made the vows yesterday at a press briefing to commemorate second year in office of the governor.\n\nOyerinde stated that the state government is committed to making the environment conducive for businesses to thrive and improving the life of Lagosians, especially within the Central Business Districts (CBDs).\n\nHe explained that activities of the CBDs are focused on improving the life of Lagosians within the CBDs in line with the THEMES agenda of this administration, especially in traffic management, removal of impediments and obstructions, improved environmental sanitation, reduction in activities of illegal street traders, non-stop renovation and rebranding, beautification and reconstruction, as well as impactful consultation with stakeholders.\n\nAccording to Oyerinde, the Office of CBDs was not created as a revenue generating agency, but it started charging offenders to deter others.\n\nHe said: “Office of the CBDs was not established to generate revenue, but because we need to maintain and rehabilitate infrastructure, we started charging offenders to deter others. However, what we charge is minimal compared to what the mainstream agencies charge.”\n\nOyerinde sought the cooperation of stakeholders operating within the Lagos Island business district to curb environmental and traffic issues, noting that CBD is very germane and critical in achieving the T.H.E.M.E.S. development agenda of the government in traffic, clean and sustainable environment, and providing intelligence to combat crime in the business districts.\n\nHe added: “The government has spent enormous resources and wherewithal on beautification, painting, rebranding, reconstruction and general uplifting of the Lagos Island CBD axis to ensure that a serene and conducive environment is in place for businesses to thrive. We, therefore, call on stakeholders to cooperate with the state and see CBD as partners in progress.”\n\nOyerinde, who underscored the veritable business and investment potentials inherent in the CBDs and the need to address the challenges of since creation, added: “Since the creation of CBD, travel time within the Lagos Island Business District has reduced through the removal of unnecessary impediments to free human and vehicular movement; security has been tightened as activities of hoodlums and miscreants have been reasonably curtailed. The aesthetic value of the environment has also greatly improved.”\n\nAccording to him, the office also embarked on the beautification the beautification and reconstruction of water fountains in some major junctions within the Lagos Island Business District, as well as the reconstruction and rebranding of Ago Tower in Idumota, to reiterate the administration’s aim to regenerate and redevelop the city to a greater Lagos and achieve the ‘Greater Lagos’ agenda.\n\nOyerinde urged visitors, residents and business owners operating within the business districts to obey rules and regulations to ensure the set goals and objectives of the government are achieved.",
          "summary": "By Lukman OlabiyiLagos State Government has declared attack on any of its personnel on official duty would no longer be tolerated.\nThe State government decried the rate at which its personnel were being attacked, vowed to arrest and prosecute any citizens cut in the act no matter the person status or connection.\nGovernor Babajide Sanwo-Olu’s Special Adviser on Central Business Districts (CBDs), Olugbenga Oyerinde made the vows yesterday at a press briefing to commemorate second year in office of the governor.\nAccording to Oyerinde, the Office of CBDs was not created as a revenue generating agency, but it started charging offenders to deter others.\ndevelopment agenda of the government in traffic, clean and sustainable environment, and providing intelligence to combat crime in the business districts.",
          "link": "https://www.sunnewsonline.com/attack-on-govt-official-lagos-blows-hot-vows-to-prosecute-culprits/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "cbd",
            "official",
            "environment",
            "hot",
            "vows",
            "state",
            "beautification",
            "business",
            "prosecute",
            "reconstruction",
            "govt",
            "island",
            "blows",
            "lagos",
            "culprits",
            "cbds",
            "attack",
            "office"
          ]
        }
      ]
    },
    "thisday": {
      "link": "https://www.thisdaylive.com/",
      "articles": [
        {
          "title": "PDP Govs Meet in Ibadan Today over Insecurity",
          "text": "Chuks Okocha in Ibadan\n\nThe governors elected on the platform of the Peoples Democratic Party (PDP) will today meet in Ibadan, Oyo State capital to further discuss the worsening state of insecurity in Nigeria.\n\nTHISDAY also gathered that the PDP governors will further discuss and revalidate the communique of the 17 southern governors that met last week in Asaba, Delta State where they banned open grazing and called for the restructuring of the country.\n\nApart from the sliding security in the country, the PDP governors will also discuss the forthcoming national convention of the party slated for November or December this year.\n\nAccording to a party source, who spoke to THISDAY, the meeting of the governors of the PDP will further reinforce the communique of the 17 southern governors.\n\n“The meeting of the 17 southern states governors, which was bi-partisan will be reviewed and adopted by the PDP governors.\n\n“It is not only in the southern part of Nigeria that there is worsening state of insecurity. There are several issues of insecurity as it affect some PDP states like Sokoto, Zamfara, Benue , Taraba, Adamawa and other states.\n\n“The meeting will deliberate on these issues of insecurity and affirm and revalidate the communique of the 17 southern governors,” the source stated.\n\nThe source added that the governors were worried that “the ravaging issues of insecurity in Benue State is gradually getting out of hand.”\n\nThe PDP governors, it was learnt, will also reaffirm that the party “remains committed to the unity of Nigeria on the basis of justice, fairness, equity and oneness and peaceful co-existence between and among its peoples with a focus on the attainment of shared goals for economic development and prosperity.”\n\nAccording to the source, the PDP governors will reaffirm that they are against incursion of armed herders, criminals, and bandits into Nigeria and stress that it has presented a severe security challenge such that citizens are no longer able to live their normal lives.\n\nTHISDAY gathered that apart from the issue of insecurity as it affects Nigeria, the PDP governors will discuss how to stabilise the party as the national convention draws nearer.\n\nAccording to the source, “the wards, local governments, zonal and states’ congresses have been concluded, except in the North-west zone. The governors will look at issues that stalled election of the north-west zonal congress in Kaduna”.\n\n“With the completion of these wards to states and zonal congresses, we will look at the way forward. We don’t sit down and wait till the national convention is at hand before discussing it. Now is the time,” the source added.\n\nThe Director General of the PDP Governors Forum, Hon. Cyril Maduabum also confirmed the meeting in a statement.\n\n“The meeting will be presided over by the Forum Chairman, Hon Aminu Waziri Tambuwal and attended by all 15 governors elected on the platform of the PDP.\n\n“The meeting will further review the current State of the nation especially issues of national security and the economy, and also fine-tune strategies to support PDP as a viable and necessary alternative to the disastrous APC administration,” the statement explained.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "Chuks Okocha in IbadanThe governors elected on the platform of the Peoples Democratic Party (PDP) will today meet in Ibadan, Oyo State capital to further discuss the worsening state of insecurity in Nigeria.\nAccording to a party source, who spoke to THISDAY, the meeting of the governors of the PDP will further reinforce the communique of the 17 southern governors.\n“The meeting of the 17 southern states governors, which was bi-partisan will be reviewed and adopted by the PDP governors.\nThere are several issues of insecurity as it affect some PDP states like Sokoto, Zamfara, Benue , Taraba, Adamawa and other states.\nThe Director General of the PDP Governors Forum, Hon.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/17/pdp-govs-meet-in-ibadan-today-over-insecurity/",
          "published": "05/17/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "insecurity",
            "govs",
            "state",
            "issues",
            "governors",
            "today",
            "pdp",
            "meeting",
            "ibadan",
            "states",
            "party",
            "southern",
            "meet",
            "source"
          ]
        },
        {
          "title": "PDP Govs Meet in Ibadan Today over Insecurity",
          "text": "Chuks Okocha in Ibadan\n\nThe governors elected on the platform of the Peoples Democratic Party (PDP) will today meet in Ibadan, Oyo State capital to further discuss the worsening state of insecurity in Nigeria.\n\nTHISDAY also gathered that the PDP governors will further discuss and revalidate the communique of the 17 southern governors that met last week in Asaba, Delta State where they banned open grazing and called for the restructuring of the country.\n\nApart from the sliding security in the country, the PDP governors will also discuss the forthcoming national convention of the party slated for November or December this year.\n\nAccording to a party source, who spoke to THISDAY, the meeting of the governors of the PDP will further reinforce the communique of the 17 southern governors.\n\n“The meeting of the 17 southern states governors, which was bi-partisan will be reviewed and adopted by the PDP governors.\n\n“It is not only in the southern part of Nigeria that there is worsening state of insecurity. There are several issues of insecurity as it affect some PDP states like Sokoto, Zamfara, Benue , Taraba, Adamawa and other states.\n\n“The meeting will deliberate on these issues of insecurity and affirm and revalidate the communique of the 17 southern governors,” the source stated.\n\nThe source added that the governors were worried that “the ravaging issues of insecurity in Benue State is gradually getting out of hand.”\n\nThe PDP governors, it was learnt, will also reaffirm that the party “remains committed to the unity of Nigeria on the basis of justice, fairness, equity and oneness and peaceful co-existence between and among its peoples with a focus on the attainment of shared goals for economic development and prosperity.”\n\nAccording to the source, the PDP governors will reaffirm that they are against incursion of armed herders, criminals, and bandits into Nigeria and stress that it has presented a severe security challenge such that citizens are no longer able to live their normal lives.\n\nTHISDAY gathered that apart from the issue of insecurity as it affects Nigeria, the PDP governors will discuss how to stabilise the party as the national convention draws nearer.\n\nAccording to the source, “the wards, local governments, zonal and states’ congresses have been concluded, except in the North-west zone. The governors will look at issues that stalled election of the north-west zonal congress in Kaduna”.\n\n“With the completion of these wards to states and zonal congresses, we will look at the way forward. We don’t sit down and wait till the national convention is at hand before discussing it. Now is the time,” the source added.\n\nThe Director General of the PDP Governors Forum, Hon. Cyril Maduabum also confirmed the meeting in a statement.\n\n“The meeting will be presided over by the Forum Chairman, Hon Aminu Waziri Tambuwal and attended by all 15 governors elected on the platform of the PDP.\n\n“The meeting will further review the current State of the nation especially issues of national security and the economy, and also fine-tune strategies to support PDP as a viable and necessary alternative to the disastrous APC administration,” the statement explained.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "Chuks Okocha in IbadanThe governors elected on the platform of the Peoples Democratic Party (PDP) will today meet in Ibadan, Oyo State capital to further discuss the worsening state of insecurity in Nigeria.\nAccording to a party source, who spoke to THISDAY, the meeting of the governors of the PDP will further reinforce the communique of the 17 southern governors.\n“The meeting of the 17 southern states governors, which was bi-partisan will be reviewed and adopted by the PDP governors.\nThere are several issues of insecurity as it affect some PDP states like Sokoto, Zamfara, Benue , Taraba, Adamawa and other states.\nThe Director General of the PDP Governors Forum, Hon.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/17/pdp-govs-meet-in-ibadan-today-over-insecurity/#respond",
          "published": "05/17/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "insecurity",
            "govs",
            "state",
            "issues",
            "governors",
            "today",
            "pdp",
            "meeting",
            "ibadan",
            "states",
            "party",
            "southern",
            "meet",
            "source"
          ]
        },
        {
          "title": "FBN CRISIS AND THE FINANCIAL SECTOR",
          "text": "CBN should be vigilant and take prompt actions to prevent financial risks\n\nThe recent boardroom crisis in the 127-year-old First Bank of Nigeria Ltd (FBN) which culminated in the intervention of the Central Bank of Nigeria (CBN) has again raised corporate governance concerns in the financial sector. The country is replete with relics of failed institutions both in the public and private sectors, occasioned by sundry ills, such as poor corporate governance, mind-boggling corruption, gross negligence, incompetence and insider abuses, among others. It is not a road we should travel again.\n\nTrouble started when the CBN dissolved and reconstituted the boards of FBN and those of its parent company, FBN Holdings Plc. The FBN Managing Director earlier removed by the former board was reinstated by the apex bank. With what has played out in the last few weeks, the issues at stake are clearly in the public domain and need not be over-flogged. The place of the FBN in the financial sector cannot be overstressed. CBN Governor, Godwin Emefiele put it rather succinctly: “By our last assessment, First Bank has over 31 million customers, with a deposit base of N4.2 trillion, shareholders’ funds of N618 billion and NIBSS instant payment (NIP) processing capacity of 22 per cent of the industry.”\n\nAvailable records indicate that the FBN maintained healthy operations until the 2016 financial year when the CBN’s target examination revealed that the bank was in grave financial condition with its capital adequacy ratio (CAR) and non-performing loans ratio (NPLs) substantially breaching acceptable prudential standards. The problems at the bank were attributed to bad credit decisions, significant and non-performing insider loans and poor corporate governance practices. The bank would probably have been in serious trouble were it not for CBN regulatory forbearance, a financial term for softening some of the strict rules that banks must comply with if they are to avoid being taken over by the regulator.\n\nIncidentally, the financial sector has had more than its fair share of this malaise. Between 1989 and December 2019, the Nigeria Deposit Insurance Corporation NDIC) had liquidated 425 financial institutions, including 51 Deposit Money Banks (DMBs), 325 Micro Finance Banks (MFBs), and 51 Primary Mortgage Banks (PMBs) largely due to the above ills. Bank failures come with a lot of ripple effects on the economy, including job losses and loss of depositors’ funds, among others. Which is why efforts by the CBN to ensure that FBN does not only recover from the rather unsavoury corporate governance misdemeanours and insider abuses that characterised its operations in the last couple of years, are commendable.\n\nWith the level of CAR at the FBN, recapitalisation has become the only option to return the banking giant on a sound footing. Everything should be done to secure investor confidence as the bank now needs to raise fresh capital and also decide, quite urgently, where to raise it from. Fortunately, the recent boardroom crisis and the ensuing disclosures have not triggered a run on the bank. But beyond the fate of one bank, pertinent questions that arise include: At what point did the CBN uncover FBN investments in Honeywell and Bharti Airtel? What measures are being considered to ensure that the level of alleged insider abuses in FBN are stamped out in the financial sector? Has the CBN consistently adhered to its circular which requires that insider-related facilities must not exceed 10 per cent of paid-up share capital?\n\nWe urge the CBN to take cognisance of the International Monetary Fund (IMF) recommendations of December 2020. The Fund had urged vigilance and corrective actions to prevent an increase in financial stability risks arising from increasing NPLs. In this connection, it noted that debt relief measures should remain time-bound and limited to clients with good pre-crisis fundamentals, in line with existing regulations.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "CBN should be vigilant and take prompt actions to prevent financial risksThe recent boardroom crisis in the 127-year-old First Bank of Nigeria Ltd (FBN) which culminated in the intervention of the Central Bank of Nigeria (CBN) has again raised corporate governance concerns in the financial sector.\nTrouble started when the CBN dissolved and reconstituted the boards of FBN and those of its parent company, FBN Holdings Plc.\nThe place of the FBN in the financial sector cannot be overstressed.\nIncidentally, the financial sector has had more than its fair share of this malaise.\nWhat measures are being considered to ensure that the level of alleged insider abuses in FBN are stamped out in the financial sector?",
          "link": "https://www.thisdaylive.com/index.php/2021/05/17/fbn-crisis-and-the-financial-sector/",
          "published": "05/17/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "crisis",
            "bank",
            "corporate",
            "governance",
            "fbn",
            "insider",
            "nigeria",
            "sector",
            "cbn",
            "banks",
            "financial"
          ]
        },
        {
          "title": "First Bank MD Sola Adeduntan’s Nine Lives",
          "text": "The First Bank drama has turned out to be much more exciting than expected. After the tango with the Central Bank of Nigeria, one could argue that only one individual emerged victorious without suffering any setback. Who would this be if not Sola Adeduntan?\n\nHistorians talk about footballers who can change the momentum of a game, excite an entire stadium of committed and neutral spectators, and even snatch the adulation meant for all eleven players of his team. In a way, this is what has happened with Sola Adeduntan and the First Bank Board of Executive Directors. For those who are still behind on recent happenings, the entire executive board of First Bank was sacked by the CBN after the board—for lack of a better phrase—retired Adeduntan from his position as Group MD/CEO. Adeduntan was chased out on April 28 but was reinstated by the CBN on April 29, less than 24 hours later.\n\nFolks have attempted to analyse the entire drama from different perspectives. One narrative supposed to have originated from the CBN is that First Bank had given out several loans to its customers, loans that have not been paid back. Another narrative is that Adeduntan was sacked without regard for the due process. The latter narrative is the more popular. Initially, the former executive directors reported that Adeduntan had completed his four-year tenure since he assumed the MD/CEO position in 2016. Thus, they ushered him out and announced that his deputy, Gbenga Shobo, will replace him. And then CBN arrived on the scene.\n\nIn the eyes of the apex bank, Adeduntan’s sack was reminiscent of a coup that might have set a bad precedent for other banking institutions in the country. Thus, to salvage the situation, Adeduntan was reinstated. However, whether he will continue for another four years is yet to be known. In short, the man is the luckiest fellow out there in the Nigerian corporate yard.\n\nIt could even be said that he has nine lives, and the old executive directors could not extinguish even one.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "After the tango with the Central Bank of Nigeria, one could argue that only one individual emerged victorious without suffering any setback.\nWho would this be if not Sola Adeduntan?\nIn a way, this is what has happened with Sola Adeduntan and the First Bank Board of Executive Directors.\nInitially, the former executive directors reported that Adeduntan had completed his four-year tenure since he assumed the MD/CEO position in 2016.\nIt could even be said that he has nine lives, and the old executive directors could not extinguish even one.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/16/first-bank-md-sola-adeduntans-nine-lives/",
          "published": "05/16/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "bank",
            "md",
            "sola",
            "adeduntan",
            "narrative",
            "entire",
            "directors",
            "sacked",
            "lives",
            "cbn",
            "executive",
            "reinstated",
            "adeduntans"
          ]
        },
        {
          "title": "A Peek into Taiwo Afolabi’s World as He is Set to Open Marriott Ikeja Hotel",
          "text": "Nigerians are making history within the country and beyond, no doubts about this. This generation, it seems, will be remembered for breaking the many limitations that stagnated their forebears. Taiwo Afolabi, the super businessman, founder and Chairman of SIFAX Group and SAHCOL, is at the frontline in this endeavour. With his Marriott Hotel at grand completion, the man has shot ahead of his peers in Nigeria and the rest of Africa.\n\nThe magnificence of Afolabi’s Marriott Hotel is a cause for celebration in the grand scheme of things, but this has left other business people and corporate leaders with similar statuses to Afolabi tearing out what little hair they have left. In a short time, Afolabi managed to break the mould in West Africa with a multi-billion-Naira 5-star monster hotel, the first of its kind in the region.\n\nMarriott Hotel has demonstrated that the SIFAX conglomerate is not the height of Taiwo Afolabi’s abilities. Then again, this is not altogether surprising about a man who started SIFAX (a massive multinational with active interests in all things maritime and nautical, oil and gas, aviation, finance, and hospitality) before he clocked 27.\n\nEven with an LLB from a more prestigious institution, how many have reached this height? But in Afolabi’s case, it was only a matter of time. That’s an eonic genius for you.\n\nBorn in Ogun and educated in Ondo, Oyo, and Lagos, Taiwo Afolabi essentially walked the lengths of the South-West in his youth. Perhaps it is on account of this that he has climbed outside of the traditional boundaries of success and paved a new path for others to follow.\n\nIn the years to come, history will be kind to Afolabi for spending more than 10 billion to put Nigeria on the map of Africa’s best and most luxurious hotels and accommodations. May 19, 2021 — the day Marriott Hotel will be opened to all and sundry, and Taiwo Afolabi establishes himself as a super corporate leader in West Africa. This is the true corporate spirit: onward and forward.\n\nShare this: Facebook\n\nReddit\n\nTwitter\n\nPrint\n\nPinterest\n\nEmail\n\nWhatsApp\n\nSkype\n\nLinkedIn\n\nTumblr\n\nPocket\n\nTelegram\n\n",
          "summary": "Taiwo Afolabi, the super businessman, founder and Chairman of SIFAX Group and SAHCOL, is at the frontline in this endeavour.\nWith his Marriott Hotel at grand completion, the man has shot ahead of his peers in Nigeria and the rest of Africa.\nMarriott Hotel has demonstrated that the SIFAX conglomerate is not the height of Taiwo Afolabi’s abilities.\nBorn in Ogun and educated in Ondo, Oyo, and Lagos, Taiwo Afolabi essentially walked the lengths of the South-West in his youth.\nMay 19, 2021 — the day Marriott Hotel will be opened to all and sundry, and Taiwo Afolabi establishes himself as a super corporate leader in West Africa.",
          "link": "https://www.thisdaylive.com/index.php/2021/05/16/a-peek-into-taiwo-afolabis-world-as-he-is-set-to-open-marriott-ikeja-hotel/",
          "published": "05/16/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "taiwo",
            "corporate",
            "things",
            "sifax",
            "super",
            "set",
            "afolabi",
            "west",
            "peek",
            "marriott",
            "world",
            "hotel",
            "open",
            "ikeja",
            "afolabis"
          ]
        }
      ]
    },
    "saharareporters": {
      "link": "http://saharareporters.com/",
      "articles": [
        {
          "title": "BREAKING: Drama As Kaduna Government Signs Agreement To End Face-off With Labour After Initial Delay",
          "text": "A mild drama played out at the meeting between officials of the Kaduna State Government and the Nigeria Labour Congress (NLC) as the delegation from Kaduna initially refused to sign the Memorandum of Understanding (MoU) reached between the two parties.\n\nHowever, they later signed after consultation with government officials in Kaduna, AIT reports.\n\nThe MoU read by the Minister of Labour and Employment, Dr Chris Ngige agreed to set up a 10-member committee to fashion out a work plan to resolve the impasse between the Kaduna State Government and NLC following disagreements over the sacking of thousands of civil servants by the Nasir El-Rufai government.\n\nThe Head of Civil Service in the state, Bariatu Mohammed will chair the committee while the NLC Deputy President, Najeem Yasin will serve as its vice-chairperson.\n\nThe committee is mandated to revert to the Minister of Labour and Employment on or before next Tuesday, May 25, to enable the completion of the process of resolution.\n\nEl-Rufai had declared the NLC President, Ayuba Wabba and some other Labour leaders wanted for \"economic sabotage\" and likened them to bandits.\n\nThe labour leaders had kicked against against El-Rufai's move to sack thoisands of workers in the state and subsequently declared a five-day warning strike.\n\nThe strike was suspended on Wednesday following the intervention of the Minister of Labour and Employment.",
          "summary": "A mild drama played out at the meeting between officials of the Kaduna State Government and the Nigeria Labour Congress (NLC) as the delegation from Kaduna initially refused to sign the Memorandum of Understanding (MoU) reached between the two parties.\nHowever, they later signed after consultation with government officials in Kaduna, AIT reports.\nThe committee is mandated to revert to the Minister of Labour and Employment on or before next Tuesday, May 25, to enable the completion of the process of resolution.\nEl-Rufai had declared the NLC President, Ayuba Wabba and some other Labour leaders wanted for \"economic sabotage\" and likened them to bandits.\nThe strike was suspended on Wednesday following the intervention of the Minister of Labour and Employment.",
          "link": "http://saharareporters.com/2021/05/20/breaking-drama-kaduna-government-signs-agreement-end-face-labour-after-initial-delay",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "president",
            "agreement",
            "end",
            "nlc",
            "kaduna",
            "labour",
            "signs",
            "state",
            "employment",
            "faceoff",
            "initial",
            "committee",
            "minister",
            "mou",
            "officials",
            "breaking",
            "drama",
            "delay"
          ]
        },
        {
          "title": "BREAKING: Drama As Kaduna Government Signs Agreement To End Face-off With Labour After Initial Delay",
          "text": "A mild drama played out at the meeting between officials of the Kaduna State Government and the Nigeria Labour Congress (NLC) as the delegation from Kaduna initially refused to sign the Memorandum of Understanding (MoU) reached between the two parties.\n\nHowever, they later signed after consultation with government officials in Kaduna, AIT reports.\n\nThe MoU read by the Minister of Labour and Employment, Dr Chris Ngige agreed to set up a 10-member committee to fashion out a work plan to resolve the impasse between the Kaduna State Government and NLC following disagreements over the sacking of thousands of civil servants by the Nasir El-Rufai government.\n\nThe Head of Civil Service in the state, Bariatu Mohammed will chair the committee while the NLC Deputy President, Najeem Yasin will serve as its vice-chairperson.\n\nThe committee is mandated to revert to the Minister of Labour and Employment on or before next Tuesday, May 25, to enable the completion of the process of resolution.\n\nEl-Rufai had declared the NLC President, Ayuba Wabba and some other Labour leaders wanted for \"economic sabotage\" and likened them to bandits.\n\nThe labour leaders had kicked against against El-Rufai's move to sack thoisands of workers in the state and subsequently declared a five-day warning strike.\n\nThe strike was suspended on Wednesday following the intervention of the Minister of Labour and Employment.",
          "summary": "A mild drama played out at the meeting between officials of the Kaduna State Government and the Nigeria Labour Congress (NLC) as the delegation from Kaduna initially refused to sign the Memorandum of Understanding (MoU) reached between the two parties.\nHowever, they later signed after consultation with government officials in Kaduna, AIT reports.\nThe committee is mandated to revert to the Minister of Labour and Employment on or before next Tuesday, May 25, to enable the completion of the process of resolution.\nEl-Rufai had declared the NLC President, Ayuba Wabba and some other Labour leaders wanted for \"economic sabotage\" and likened them to bandits.\nThe strike was suspended on Wednesday following the intervention of the Minister of Labour and Employment.",
          "link": "http://saharareporters.com/2021/05/20/breaking-drama-kaduna-government-signs-agreement-end-face-labour-after-initial-delay#disqus_thread",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "president",
            "agreement",
            "end",
            "nlc",
            "kaduna",
            "labour",
            "signs",
            "state",
            "employment",
            "faceoff",
            "initial",
            "committee",
            "minister",
            "mou",
            "officials",
            "breaking",
            "drama",
            "delay"
          ]
        },
        {
          "title": "Nigerian Community In South Africa Assist Poor Family Of Five With New House",
          "text": "The Nigerian community in South Africa has provided succour to a poor South African family living in a Dilapidated tin shack with a brand new five-room apartment.\n\nThe President of the Nigerian Union South Africa (NUSA), Adetola Olubajo, said the house was presented on May 15 to a woman, Muyadziwa Musundwa and her five children, who lived at Maelula village, Tshifhire, South Africa.\n\nHe said one of the association's Board of Trustees was moved by the plight of the family as reported by a local journalist, which necessitated the desire to give the family better living conditions.\n\n\"It is our obligation to make sure that even the Musundwa family live comfortably, like other community members.\n\n\"It is our joint responsibility to eliminate poverty, hunger and underdevelopment within our communities,\" Olubajo said, adding that Africans are one people irrespective of geographic location.\n\nMr Femi Adeleke, who presented the house to the Musundwas, said he was proud to be a part of the \"good deeds\" aimed at uplifting communities.\n\nHe said, \"We got in touch with Musundwa with the help of a local journalist. Most of the families we have helped consisted of unemployed people and they needed assistance from our community.\n\n\"They did not choose to be poor therefore they need to be uplifted by those who can do something for them. The donations were based on love and brotherhood.\"\n\nThe unemployed Musundwa and her children shed tears of joy when the keys to their new home were handed over to them by the representative of the donors, Mr. Adeleke, who opened the door, marking the official opening of the house.\n\nStruggling to contain her emotions, she said the donation from the Nigerian community came at the right time, as they had no shelter.\n\n\"We initially thought that people in rural areas are neglected, but we know now that there are people out there who care and we are very thankful,\" she said.\n\n\"God is great. I never thought in my wildest dreams that I would one day have a beautiful house like this one. Life was tough for me and my children.\n\n\"When it rained, we had to sit up the whole night, as there was water all over. Sometimes thieves would just break in and steal whatever was in the house.\"\n\nMr Nehemia Madzhiga of the Makhado Municipality, thanked Adeleke and the Nigerian community for their \"good work\" within the communities.\n\n\"We are very happy to have Africans, who understand our language that as a government alone we cannot do things for all our people, but if other people also identify people in need and assist them, we can do more for our people together,\" he said.\n\nMs Thelma Ramabulana, representative of Maelula Royal Council, said that although more challenges lay ahead, the community was proud of Adeleke and the Nigerian Union South Africa for joining the fight against poverty and underdevelopment.",
          "summary": "The Nigerian community in South Africa has provided succour to a poor South African family living in a Dilapidated tin shack with a brand new five-room apartment.\nThe President of the Nigerian Union South Africa (NUSA), Adetola Olubajo, said the house was presented on May 15 to a woman, Muyadziwa Musundwa and her five children, who lived at Maelula village, Tshifhire, South Africa.\n\"It is our obligation to make sure that even the Musundwa family live comfortably, like other community members.\nStruggling to contain her emotions, she said the donation from the Nigerian community came at the right time, as they had no shelter.\nMr Nehemia Madzhiga of the Makhado Municipality, thanked Adeleke and the Nigerian community for their \"good work\" within the communities.",
          "link": "http://saharareporters.com/2021/05/20/nigerian-community-south-africa-assist-poor-family-five-new-house",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "south",
            "house",
            "union",
            "unemployed",
            "community",
            "poor",
            "nigerian",
            "africa",
            "family",
            "musundwa",
            "adeleke",
            "assist"
          ]
        },
        {
          "title": "Nigerian Community In South Africa Assist Poor Family Of Five With New House",
          "text": "The Nigerian community in South Africa has provided succour to a poor South African family living in a Dilapidated tin shack with a brand new five-room apartment.\n\nThe President of the Nigerian Union South Africa (NUSA), Adetola Olubajo, said the house was presented on May 15 to a woman, Muyadziwa Musundwa and her five children, who lived at Maelula village, Tshifhire, South Africa.\n\nHe said one of the association's Board of Trustees was moved by the plight of the family as reported by a local journalist, which necessitated the desire to give the family better living conditions.\n\n\"It is our obligation to make sure that even the Musundwa family live comfortably, like other community members.\n\n\"It is our joint responsibility to eliminate poverty, hunger and underdevelopment within our communities,\" Olubajo said, adding that Africans are one people irrespective of geographic location.\n\nMr Femi Adeleke, who presented the house to the Musundwas, said he was proud to be a part of the \"good deeds\" aimed at uplifting communities.\n\nHe said, \"We got in touch with Musundwa with the help of a local journalist. Most of the families we have helped consisted of unemployed people and they needed assistance from our community.\n\n\"They did not choose to be poor therefore they need to be uplifted by those who can do something for them. The donations were based on love and brotherhood.\"\n\nThe unemployed Musundwa and her children shed tears of joy when the keys to their new home were handed over to them by the representative of the donors, Mr. Adeleke, who opened the door, marking the official opening of the house.\n\nStruggling to contain her emotions, she said the donation from the Nigerian community came at the right time, as they had no shelter.\n\n\"We initially thought that people in rural areas are neglected, but we know now that there are people out there who care and we are very thankful,\" she said.\n\n\"God is great. I never thought in my wildest dreams that I would one day have a beautiful house like this one. Life was tough for me and my children.\n\n\"When it rained, we had to sit up the whole night, as there was water all over. Sometimes thieves would just break in and steal whatever was in the house.\"\n\nMr Nehemia Madzhiga of the Makhado Municipality, thanked Adeleke and the Nigerian community for their \"good work\" within the communities.\n\n\"We are very happy to have Africans, who understand our language that as a government alone we cannot do things for all our people, but if other people also identify people in need and assist them, we can do more for our people together,\" he said.\n\nMs Thelma Ramabulana, representative of Maelula Royal Council, said that although more challenges lay ahead, the community was proud of Adeleke and the Nigerian Union South Africa for joining the fight against poverty and underdevelopment.",
          "summary": "The Nigerian community in South Africa has provided succour to a poor South African family living in a Dilapidated tin shack with a brand new five-room apartment.\nThe President of the Nigerian Union South Africa (NUSA), Adetola Olubajo, said the house was presented on May 15 to a woman, Muyadziwa Musundwa and her five children, who lived at Maelula village, Tshifhire, South Africa.\n\"It is our obligation to make sure that even the Musundwa family live comfortably, like other community members.\nStruggling to contain her emotions, she said the donation from the Nigerian community came at the right time, as they had no shelter.\nMr Nehemia Madzhiga of the Makhado Municipality, thanked Adeleke and the Nigerian community for their \"good work\" within the communities.",
          "link": "http://saharareporters.com/2021/05/20/nigerian-community-south-africa-assist-poor-family-five-new-house#disqus_thread",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "south",
            "house",
            "union",
            "unemployed",
            "community",
            "poor",
            "nigerian",
            "africa",
            "family",
            "musundwa",
            "adeleke",
            "assist"
          ]
        }
      ]
    },
    "thecable": {
      "link": "https://www.thecable.ng/",
      "articles": []
    },
    "tech_cabal": {
      "link": "https://techcabal.com/",
      "articles": []
    },
    "tech_point": {
      "link": "https://techpoint.africa/",
      "articles": []
    },
    "bizday": {
      "link": "https://businessday.ng/",
      "articles": []
    },
    "observer": {
      "link": "https://nigerianobservernews.com/",
      "articles": []
    },
    "premium_times": {
      "link": "https://www.premiumtimesng.com/category/news",
      "articles": [
        {
          "title": "Police launch investigation into Ogun gas explosions",
          "text": "ADVERTISEMENT\n\nThe police in Ogun on Thursday said they had commenced investigation into the four incidents of gas explosions in the state within a week.\n\nThe state Commissioner of Police, Edward Ajogun, told journalists in Abeokuta that the command was looking into the cause of the recent gas explosions.\n\nTwo gas explosions occured at Igbore and Mercy Road areas of Abeokuta on May 12 and May 13, respectively, involving loss of lives and injuries.\n\nAnother gas explosion occurred on May 18 at the Conference Hotel on Boulvered Road, Abeokuta, owned by Gbenga Daniel, a former governor of the state.\n\nOn Thursday, a gas explosion rocked the Olusegun Obasanjo Presidential Library also in Abeokuta.\n\nMr Ajogun said the state government had expressed concern over the development.\n\nNAN reports that Governor Dapo Abiodun had also ordered investigation into the incidents.\n\nThe commissioner said a technical team comprising; the Police, Department of State Security (DSS), the Standard Organisation of Nigeria (SON), the Department of Petroleum Resources (DPR) and the Federal Fire Service (FFS) have been assembled.\n\n“We want to really find out the cause of the explosions.\n\n“We will know if it is as a result of human error, adulteration, expired cylinders or other technical issues,” he said.\n\nThe CP, however, dismissed insinuation of bomb explosions.\n\n“It is unfortunate that rumour mongers will be peddling rumours that the incidents are bomb explosions, but they are not, they are gas explosions,” he said.\n\n”There is nothing to be scared of,” Mr Ajogun said.\n\nHe assured that the investigations would soon be concluded and the findings made public.\n\nMeanwhile, Rebecca Muibi, the commanding officer of the Federal Fire Service (FFS) in Ogun, also confirmed that the incident at the Olusegun Obasanjo Presidential Library (OOPL) was a gas explosion.\n\nMrs Muibi said the FFS maintains an office inside the OOPL.\n\n(NAN)",
          "summary": "ADVERTISEMENTThe police in Ogun on Thursday said they had commenced investigation into the four incidents of gas explosions in the state within a week.\nThe state Commissioner of Police, Edward Ajogun, told journalists in Abeokuta that the command was looking into the cause of the recent gas explosions.\nTwo gas explosions occured at Igbore and Mercy Road areas of Abeokuta on May 12 and May 13, respectively, involving loss of lives and injuries.\n“It is unfortunate that rumour mongers will be peddling rumours that the incidents are bomb explosions, but they are not, they are gas explosions,” he said.\nMeanwhile, Rebecca Muibi, the commanding officer of the Federal Fire Service (FFS) in Ogun, also confirmed that the incident at the Olusegun Obasanjo Presidential Library (OOPL) was a gas explosion.",
          "link": "https://www.premiumtimesng.com/regional/ssouth-west/462843-police-launch-investigation-into-ogun-gas-explosions.html",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "road",
            "abeokuta",
            "gas",
            "launch",
            "state",
            "ffs",
            "presidential",
            "service",
            "ajogun",
            "technical",
            "investigation",
            "explosions",
            "ogun"
          ]
        }
      ]
    },
    "hallmark": {
      "link": "https://hallmarknews.com/",
      "articles": []
    },
    "leadership": {
      "link": "https://leadership.ng/category/nigeria-news/",
      "articles": [
        {
          "title": "500,000 Women To Benefit From UK Group, Fintec Empowerment Program",
          "text": "No fewer than 500,000 women across Nigeria are to benefit from empowerment program powered by Jose Foundation United Kingdom in conjunction with financial technology firm, Agency Alliance Ltd.\n\nThis was disclosed in a press statement signed by the president, Jose Foundation UK, Dr Martins Abhulimhen and made available to journalists in Abuja yesterday.\n\nHe said the empowerment program is to promote financial inclusion among women in Nigeria.\n\nAccording to him, the COVID-19 pandemic has impacted negatively on the activities of women across all sectors of the economy leading to the need to deplore technology in addressing some of the challenges.\n\nHe said: “It is a known fact that in the face of lockdowns, closed branches and social distancing, consumers are turning to digital finance.\n\nAlso read:FinTech Expert Lauds FG Over Digital Economy Drive\n\n“Women’s preparedness for financial inclusion has just received a boost with the entrance of Jose foundation into fintec powered by Agency Alliance Ltd. in Nigeria\n\nADVERTISEMENT\n\n“With the introduction of a new fintec innovative product called BANK – IN – BOX Initiative\n\n“The product will help drive financial inclusion among women in Africa”.\n\nSome of the features of the program include provision of Point of Sales terminal (POS), access to working capital (Micro Credit Initiatives), capacity building, competitive commissions and extra income for the family.\n\nHe stated that women will also have access to working capital, earn attractive commission and enjoy extra income.\n\nHe noted that some of the advantages of the technology are that it will increase women participation in the economy and income from economic activities will enhance a shift in gender norms.\n\n“As we make this digital tool available to the women community, financial inclusion drive is enhanced and expected to cover the entire country.\n\nThe program is said to commence in Lagos and Kano States before extending to other states of the federation.",
          "summary": "No fewer than 500,000 women across Nigeria are to benefit from empowerment program powered by Jose Foundation United Kingdom in conjunction with financial technology firm, Agency Alliance Ltd.\nThis was disclosed in a press statement signed by the president, Jose Foundation UK, Dr Martins Abhulimhen and made available to journalists in Abuja yesterday.\nHe said the empowerment program is to promote financial inclusion among women in Nigeria.\n“As we make this digital tool available to the women community, financial inclusion drive is enhanced and expected to cover the entire country.\nThe program is said to commence in Lagos and Kano States before extending to other states of the federation.",
          "link": "https://leadership.ng/500000-women-to-benefit-from-uk-group-fintec-empowerment-program/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "women",
            "group",
            "economy",
            "digital",
            "program",
            "uk",
            "technology",
            "empowerment",
            "inclusion",
            "benefit",
            "500000",
            "fintec",
            "jose",
            "foundation",
            "financial",
            "working"
          ]
        }
      ]
    },
    "daily_times": {
      "link": "https://dailytimes.ng/",
      "articles": []
    },
    "daylight": {
      "link": "https://daylightng.com/",
      "articles": []
    },
    "pm_news": {
      "link": "https://www.pmnewsnigeria.com/",
      "articles": []
    },
    "news_direct": {
      "link": "https://newsdirect.ng/",
      "articles": []
    },
    "blueprint": {
      "link": "https://www.blueprint.ng/",
      "articles": [
        {
          "title": "WASU lauds Dangote on employment generation",
          "text": "West African Student’s Union (WASU) has commended the aggressive employment generation drive of the Aliko Dangote led companies, urging other wealthy West African leaders to invest in industries that will rid the region of high unemployment rate.\n\nPresident of WASU, Comrade Romans Pillah in a press briefing, held in Abuja on Thursday, described Aliko Dangote as God-sent, to the African continent and lauded him for employing more than 200,000 Youths in his companies.\n\n“As students, we are mostly scared of our future because of the high unemployment rate in our region, but with a man like Aliko Dangote, we are optimistic and only prayed for more Africans like him so as to totally eliminate the high scourge of unemployment in our continent as a whole”\n\nWhile urging Dangote to prevail on cement distributors across Nigeria to sell a little above the ex-factory price of N2,450, he said the attitude of the distributors and other middlemen, who are instrumental to the rise in the price of cement should be sanctioned.\n\nHe further commended the doggedness and commitment of the Dangote group to the industrialization of the West African sub-region. According to him: “WASU wishes to appreciate the Dangote Group on their corporate social responsibility via scholarship, youth empowerment and building of enduring infrastructure…”\n\nEarlier in Lagos, WASU President, with his executive members had presented an award to Dangote group as the “Most Outstanding Company in Africa”, noting that there is no other company in the continent that is rapidly expanding across all African countries and employing thousands of youths in their respective locations, as much as the Group.\n\nDangote’s Group Executive Director, Strategy, Capital Projects & Portfolio Development, Devakumar Edwin, who was also given an award by the students’ body as an “Icon of Outstanding Visionary Leadership in Africa”, assured them of the group’s determination to create millions of employment across the continent.\n\nShare this:\n\nTweet\n\nPrint\n\nTelegram\n\nWhatsApp\n\n",
          "summary": "West African Student’s Union (WASU) has commended the aggressive employment generation drive of the Aliko Dangote led companies, urging other wealthy West African leaders to invest in industries that will rid the region of high unemployment rate.\nPresident of WASU, Comrade Romans Pillah in a press briefing, held in Abuja on Thursday, described Aliko Dangote as God-sent, to the African continent and lauded him for employing more than 200,000 Youths in his companies.\nHe further commended the doggedness and commitment of the Dangote group to the industrialization of the West African sub-region.\nDangote’s Group Executive Director, Strategy, Capital Projects & Portfolio Development, Devakumar Edwin, who was also given an award by the students’ body as an “Icon of Outstanding Visionary Leadership in Africa”, assured them of the group’s determination to create millions of employment across the continent.\nShare this:TweetPrintTelegramWhatsApp",
          "link": "https://www.blueprint.ng/wasu-lauds-dangote-on-employment-generation/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "continent",
            "unemployment",
            "generation",
            "african",
            "employment",
            "group",
            "west",
            "aliko",
            "students",
            "dangote",
            "high",
            "lauds",
            "wasu"
          ]
        },
        {
          "title": "FG nabs black market airline operator, vows clampdown",
          "text": "Following recent complaints on activities of illegal operations by private jet owners in Nigeria, federal authority has disclosed that culprits have been nabbed just as it is also scaling up its oversight functions in order to eradicate such nefarious businesses that cost the country billions of naira in revenue.\n\nDescribing the act whereby private jet owners use their aircraft for commercial purposes black market operations, Director General of the Nigeria Civil Aviation Authority (NCAA) Capt Musa Nuhu said the agency is prepared to arrest the situation by frequently carrying out ramp checks of hangers where aircraft are parked.\n\nCapt. Musa Nuhu spoke at an online question and answer session with the Chairman, Africa Business Aviation Association, AfBAA, Mr. Nike Fadugba, said where he revealed that the NCAA has a culprit currently being investigated having been nabbed by its inspectors.\n\nAccording to the CAA helmsman, a number of measures have been put in place that will ensure such erring operators are identified and made to bear the full weight of the law.\n\nCapt Nuhu affirmed that the hitherto melt out sanction on charter operations run foul of its regulations in the form of fines and certificate sanctions as well as the permit for non-commercial flights, PNCF, a condition private operators are required to abide by.\n\nShare this:\n\nTweet\n\nPrint\n\nTelegram\n\nWhatsApp\n\n",
          "summary": "Following recent complaints on activities of illegal operations by private jet owners in Nigeria, federal authority has disclosed that culprits have been nabbed just as it is also scaling up its oversight functions in order to eradicate such nefarious businesses that cost the country billions of naira in revenue.\nDescribing the act whereby private jet owners use their aircraft for commercial purposes black market operations, Director General of the Nigeria Civil Aviation Authority (NCAA) Capt Musa Nuhu said the agency is prepared to arrest the situation by frequently carrying out ramp checks of hangers where aircraft are parked.\nMusa Nuhu spoke at an online question and answer session with the Chairman, Africa Business Aviation Association, AfBAA, Mr. Nike Fadugba, said where he revealed that the NCAA has a culprit currently being investigated having been nabbed by its inspectors.\nAccording to the CAA helmsman, a number of measures have been put in place that will ensure such erring operators are identified and made to bear the full weight of the law.\nCapt Nuhu affirmed that the hitherto melt out sanction on charter operations run foul of its regulations in the form of fines and certificate sanctions as well as the permit for non-commercial flights, PNCF, a condition private operators are required to abide by.",
          "link": "https://www.blueprint.ng/fg-nabs-black-market-airline-operator-vows-clampdown/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "operators",
            "nabbed",
            "vows",
            "ncaa",
            "musa",
            "nuhu",
            "fg",
            "black",
            "nigeria",
            "operations",
            "operator",
            "clampdown",
            "market",
            "nabs",
            "airline",
            "jet",
            "owners",
            "private"
          ]
        },
        {
          "title": "Emir of Gwandu to ASUP: Call off strike in national interest",
          "text": "The Emir of Gwandu and Chairman Kebbi state Council of Chiefs, Alhaji Illiyasu Bashar, has called on the Academic Staff Union of Polytechnics (ASUP) to call off their strike action. He said strike would not be the answer.\n\nHe stated this Thursday when the president of ASUP paid him a “save our soul” visit at the Abdullahin Gwandu palace, Birnin Kebbi.\n\nHe said it is unfortunate that Nigerians termed strike action as the only way to channel their grievances to authorities. He described it as gross indiscipline and action capable of causing disruption of peaceful coexistence of citizens.\n\nHe said: “As human beings, we must have problems and we must solve the problems ourselves. We don’t expect somebody from heaven to come down and correct our mistakes”\n\nThe emir further advice the union members to sue for peace and tranquility for the sake of the children entrusted to them. He urged them to think of withdrawing the industrial action and return to work.\n\n“Go and sit down with authorities concerned to understand yourselves so that the students would go back to classes. Frankly speaking, the money is not there like before,” he said.\n\nEarlier, the president, Academic Staff Union of Polytechnics (ASUP), Mr Anderson U.Uzeibe, said they were in the place to seek the emirs intervention for the federal government to pay backlog of salaries and other entitlements.\n\nShare this:\n\nTweet\n\nPrint\n\nTelegram\n\nWhatsApp\n\n",
          "summary": "The Emir of Gwandu and Chairman Kebbi state Council of Chiefs, Alhaji Illiyasu Bashar, has called on the Academic Staff Union of Polytechnics (ASUP) to call off their strike action.\nHe stated this Thursday when the president of ASUP paid him a “save our soul” visit at the Abdullahin Gwandu palace, Birnin Kebbi.\nHe said it is unfortunate that Nigerians termed strike action as the only way to channel their grievances to authorities.\nHe said: “As human beings, we must have problems and we must solve the problems ourselves.\nEarlier, the president, Academic Staff Union of Polytechnics (ASUP), Mr Anderson U.Uzeibe, said they were in the place to seek the emirs intervention for the federal government to pay backlog of salaries and other entitlements.",
          "link": "https://www.blueprint.ng/emir-of-gwandu-to-asup-call-off-strike-in-national-interest/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "president",
            "strike",
            "union",
            "national",
            "problems",
            "polytechnics",
            "asup",
            "action",
            "interest",
            "staff",
            "gwandu",
            "emir"
          ]
        },
        {
          "title": "Middle Belt youth worried over rising insecurity",
          "text": "A group under the aegis of Middle Belt Youth Organisations Forum (MBYOF) Thursday expressed worry over the various security challenges in the Middle Belt region, especially Benue, Kaduna south and Plateau state.\n\nPresident of the MBYOF,Terrence Kuanum, who led a delegation of the youth leaders to pay a courtesy call on Governor Samuel Orton at Government House, Makurdi, said it was more worrisome that some persons within the zone, because of selfish interest, were aligning with the killers to twist the narrative about the killings.\n\nKuanum who is also president of Benue Youth Forum said the Middle Belt Youth have also instituted various court cases to seek for justice over the killings in the zone.\n\n\n\nHe said the Youth were in the state to hold a meeting and deliberate on issues like the need for the establishment of the North Central Development Commission, the need for creation of state police, and above all, the urgency for the federal government to evolve a national policy on ranching which will permanently end open grazing of cattle which is basically the cause of clashes between herdsmen and farmers.\n\n\n\nHe said youth in their various states, have also embarked on robust campaigns against the leadership of Miyetti Allah Kautal Hore and the MACBAN who have variously taken responsibility of the killing of the people.\n\n‘’Your Excellency, you have been calling on the federal government to consider these and other important issues and we find it necessary to support your patriotic call,’’ he said.\n\nShare this:\n\nTweet\n\nPrint\n\nTelegram\n\nWhatsApp\n\n",
          "summary": "A group under the aegis of Middle Belt Youth Organisations Forum (MBYOF) Thursday expressed worry over the various security challenges in the Middle Belt region, especially Benue, Kaduna south and Plateau state.\nKuanum who is also president of Benue Youth Forum said the Middle Belt Youth have also instituted various court cases to seek for justice over the killings in the zone.\nHe said youth in their various states, have also embarked on robust campaigns against the leadership of Miyetti Allah Kautal Hore and the MACBAN who have variously taken responsibility of the killing of the people.\n‘’Your Excellency, you have been calling on the federal government to consider these and other important issues and we find it necessary to support your patriotic call,’’ he said.\nShare this:TweetPrintTelegramWhatsApp",
          "link": "https://www.blueprint.ng/middle-belt-youth-worried-over-rising-insecurity/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "insecurity",
            "youth",
            "state",
            "issues",
            "belt",
            "federal",
            "various",
            "forum",
            "rising",
            "worried",
            "need",
            "benue",
            "middle"
          ]
        },
        {
          "title": "Kaduna strike: El-Rufai’s action case of governance failure – Group",
          "text": "The Peoples Alternative Political Movement (TPAP-M) has condemned the action of embattled Kaduna state governor, Nasir El-Rufai, describing it as disgraceful.\n\nIn a statement signed Wednesday in Abuja, Comrades Toye Olorode and Jaye Gaskia for TPAP-Movement Secretariat said the action is a “tragic manifestation of the governance failure foisted on our nation.”\n\nThe group wondered why the Kaduan state government, whose policies, actions and inactions “is responsible for the impoverisation and deprivations faced by the youth, turn round to mobilise and pay them pittance to send them on deadly missions as thugs to attack legitimate gatherings of working peoples.\n\n“This is proof positive that for this ruling class, workers are mere cogs in the wheel of their rapacious greed, and that young persons are only good to be used as thugs.’’\n\nTPAP-M is a political coalition of citizens’ organisations and social movements committed to the emergence of a mass workers party and the socialist transformation of Nigeria.\n\nTPAP-M added that , “Any government that sees workers as nuisances, and civil and public servants as dispensable, clearly lacks even the smallest understanding of governance. No wonder the ruling class in general has made a mess of governance and brought our nation to the brink of precipitous collapse, with rampaging insecurity, unleashed mass misery, deepening poverty, and unprecedented levels of rising unemployment.\n\n“We are alarmed by the unprecedented recklessness of the Kaduna state government in its response to the legitimate and justified strike of workers in Kaduna state against the mass sack of workers and massive attacks on the conditions of work and of living of the workers and popular masses.\n\n“We condemn in unequivocal terms the disgraceful actions of the El-Rufai led government of Kaduna state, against the workers and working peoples of the state and we reject and condemn the purported illegal declaration of the person of the national president of the NLC as a wanted person. Just as we are condemning the mobilisation of alienated, disillusioned, and hungry youth as thugs to attack workers’ peaceful processions in the state.\n\n“It is clear from these incidences that attacks against the oppressed don’t discriminate among regions, tribes or religion of the oppressed.’’\n\n“The lesson for the working people and labouring masses of our country is that the problems we confront are rooted in the ruthless exploitation of the working people and labouring masses by this unconscionable ruling class, and not as a result of our different ethnic, religious or regional backgrounds.’’\n\nShare this:\n\nTweet\n\nPrint\n\nTelegram\n\nWhatsApp\n\n",
          "summary": "The Peoples Alternative Political Movement (TPAP-M) has condemned the action of embattled Kaduna state governor, Nasir El-Rufai, describing it as disgraceful.\nTPAP-M added that , “Any government that sees workers as nuisances, and civil and public servants as dispensable, clearly lacks even the smallest understanding of governance.\nNo wonder the ruling class in general has made a mess of governance and brought our nation to the brink of precipitous collapse, with rampaging insecurity, unleashed mass misery, deepening poverty, and unprecedented levels of rising unemployment.\n“We are alarmed by the unprecedented recklessness of the Kaduna state government in its response to the legitimate and justified strike of workers in Kaduna state against the mass sack of workers and massive attacks on the conditions of work and of living of the workers and popular masses.\nJust as we are condemning the mobilisation of alienated, disillusioned, and hungry youth as thugs to attack workers’ peaceful processions in the state.",
          "link": "https://www.blueprint.ng/kaduna-strike-el-rufais-action-case-of-governance-failure-group/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "failure",
            "case",
            "strike",
            "mass",
            "governance",
            "workers",
            "kaduna",
            "state",
            "group",
            "class",
            "youth",
            "elrufais",
            "action",
            "ruling",
            "unprecedented",
            "working"
          ]
        }
      ]
    },
    "nigpilot": {
      "link": "https://nigerianpilot.news/",
      "articles": []
    },
    "channelstv": {
      "link": "https://www.channelstv.com/",
      "articles": [
        {
          "title": "FG Meets With Kaduna Govt, NLC To Resolve Labour Dispute",
          "text": "The Federal Government on Thursday convened a conciliatory meeting with the Kaduna State government and the Nigeria Labour Congress (NLC) to resolve the impasse that has grounded labour activities in the state.\n\nMr Chris Ngige, who is the Minister of Labour and Employment, presided over the meeting while NLC National President, Ayuba Wabba, led other labour leaders to the discussion.\n\nBut the Commissioner of Local Government Affairs in Kaduna, Jaafaru Sabi, represented Governor Nasir El-Rufai and the state government.\n\nOn the deliberations at the end of the meeting, Ngige told reporters that the state government delegation disagrees with the labour leaders.\n\nHe noted that the meeting, thereafter, resolved to constitute a 10-man committee comprising six state government officials and three NLC representatives to discuss and resolve the impasse.\n\nThe minister stated that the committee chaired by the Head of Service in Kaduna State was given a mandate of up to Tuesday next week to report to him.\n\nAccording to him, the meeting agreed that no person shall be victimised for participating in the industrial action in Kaduna after which both parties appended their signature to the documents.\n\nAttempt To Shut Down Kaduna\n\nGiving his opening remarks shortly after the meeting began, Ngige had said that the Federal Government was very concerned about developments in Kaduna due to insecurity.\n\nHe decried that the situation was further compounded by the strike, which was already crippling economic activities in the state, noting that this informed the intervention of the Federal Government.\n\nThe minister believes the labour issues could have been avoided and all parties to the negotiation are products of the Nigerian Constitution, hence the need to work together for the well-being of the people.\n\nHe stressed the importance of dialogue and the need for restraint in trying to enforce one’s rights, after which he laid the ground rules for the discussions and appealed to the parties to give peace a chance while negotiations continued.\n\nNgige had, however, warned that he would not hesitate to invoke relevant sections of the Trade Dispute Act and escalate the situation to the National Industrial Court if the intervention efforts fail.\n\nIn his remarks, Jaafaru stated that the state government was very displeased and condemned the actions of the NLC in its attempt to shut down the state.\n\nHe outlined some of the efforts of the state government to promote the welfare of civil servants, including the implementation of the N30,000 minimum wage.\n\nThe Last Resort\n\nThe commissioner disclosed that the state government had employed 25,000 primary school teachers and 1,700 science teachers in secondary schools, besides other employment processes that were already in the advanced stage.\n\nAccording to him, the public service consumes four out of every five naira the state has while salaries and allowances take a huge chunk of revenue allocations to the local governments.\n\nWabba, on his part, thanked the Federal Government for its intervention, saying the issue that brought the parties to the meeting was because of the state government’s policy to downsize its workforce.\n\nHe explained that the crux of the issue was the payment of emoluments to affected staff during redundancy, stressing that this was never done.\n\nThe NLC president stressed that the state government never engaged with the workers before disengaging them, insisting that the right thing was never done.\n\nHe accused the state government of ignoring the series of letters sent to it requesting that the workers should be engaged before being disengaged from service.\n\nThe decision to protest and to go on strike, according to him, is the last resort and labour never went to any office to disrupt any service during the protest in Kaduna.\n\nWabba informed the meeting that all that the labour wanted was transparency in the process of disengaging the workers.",
          "summary": "The Federal Government on Thursday convened a conciliatory meeting with the Kaduna State government and the Nigeria Labour Congress (NLC) to resolve the impasse that has grounded labour activities in the state.\nMr Chris Ngige, who is the Minister of Labour and Employment, presided over the meeting while NLC National President, Ayuba Wabba, led other labour leaders to the discussion.\nBut the Commissioner of Local Government Affairs in Kaduna, Jaafaru Sabi, represented Governor Nasir El-Rufai and the state government.\nOn the deliberations at the end of the meeting, Ngige told reporters that the state government delegation disagrees with the labour leaders.\nThe minister stated that the committee chaired by the Head of Service in Kaduna State was given a mandate of up to Tuesday next week to report to him.",
          "link": "https://www.channelstv.com/2021/05/20/fg-meets-with-kaduna-govt-nlc-to-resolve-labour-dispute/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "nlc",
            "workers",
            "kaduna",
            "labour",
            "dispute",
            "state",
            "federal",
            "ngige",
            "parties",
            "fg",
            "resolve",
            "govt",
            "meeting",
            "meets",
            "service"
          ]
        },
        {
          "title": "Ronaldo, Fernandes Others Headline Portugal’s Squad For Euro 2020",
          "text": "Sporting Lisbon youngster Pedro Goncalves was handed a maiden Portugal call-up as coach Fernando Santos named his 26-man squad for Euro 2020 on Thursday.\n\nThe reigning champions will be led by Cristiano Ronaldo, who is just six goals short of Iranian Ali Daei’s all-time international record of 103 goals and level with Michel Platini’s record mark of nine European Championship strikes.\n\nThe 22-year-old Goncalves has been rewarded for his impressive club form this season.\n\nHe scored a league-leading 23 Primeira Liga goals to help Sporting win their first Portuguese title since 2002.\n\nREAD ALSO: Iheanacho Scores But Chelsea Beat Leicester To Gain Top-Four Advantage\n\nGoncalves will face a tough task to get into the starting XI, though, with Ronaldo, Manchester United star Bruno Fernandes, Bernardo Silva, Joao Felix and Liverpool forward Diogo Jota, despite currently being sidelined with an injury, all making the cut.\n\nVeteran Porto centre-back Pepe, 38, is also in the squad despite not having played for his country since October last year.\n\nPortugal open their title defence against Hungary in Budapest on June 15, before facing Germany in Munich four days later.\n\nThey round off their Group F campaign against France at the Puskas Arena, in a repeat of the Euro 2016 final.\n\nSantos has kept faith with Wolves midfielders Joao Moutinho and Ruben Neves, with Renato Sanches, whose Lille side could win the Ligue 1 title on Sunday, likely to line up alongside them.\n\nPortugal Euro 2020 squad:\n\nGoalkeepers (3): Rui Patricio (Wolves/ENG), Anthony Lopes (Lyon/FRA), Rui Silva (Grenada/ESP)\n\nDefenders (7): Joao Cancelo (Manchester City/ENG), Nelson Semedo (Wolves/ENG), Jose Fonte (Lille/FRA), Ruben Dias (Manchester City/ENG), Pepe (FC Porto), Nuno Mendes (Sporting Lisbon), Raphael Guerreiro (Borussia Dortmund/GER)\n\nMidfielders (9): Danilo Pereira (Paris SG/FRA), Joao Palhinha (Sporting Lisbon), Ruben Neves (Wolves/ENG), Joao Moutinho (Wolves/ENG), Renato Sanches (Lille/FRA), Bruno Fernandes (Manchester United/ENG), Sergio Oliveira (FC Porto), William Carvalho (Real Betis/ESP), Bernardo Silva (Manchester City/ENG)\n\nForwards (7): Cristiano Ronaldo (Juventus/ITA), Diogo Jota (Liverpool/ENG), Rafa Silva (Benfica), Andre Silva (Eintracht Frankfurt/GER), Joao Felix (Atletico Madrid/ESP), Gonçalo Guedes (Valencia/ESP), Pedro Goncalves (Sporting Lisbon)\n\nAFP",
          "summary": "Sporting Lisbon youngster Pedro Goncalves was handed a maiden Portugal call-up as coach Fernando Santos named his 26-man squad for Euro 2020 on Thursday.\nHe scored a league-leading 23 Primeira Liga goals to help Sporting win their first Portuguese title since 2002.\nVeteran Porto centre-back Pepe, 38, is also in the squad despite not having played for his country since October last year.\nPortugal open their title defence against Hungary in Budapest on June 15, before facing Germany in Munich four days later.\nThey round off their Group F campaign against France at the Puskas Arena, in a repeat of the Euro 2016 final.",
          "link": "https://www.channelstv.com/2021/05/20/ronaldo-fernandes-others-headline-portugals-squad-for-euro-2020/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "lisbon",
            "portugals",
            "2020",
            "euro",
            "fernandes",
            "joao",
            "silva",
            "squad",
            "ronaldo",
            "sporting",
            "wolveseng",
            "title",
            "manchester",
            "porto",
            "headline",
            "ruben"
          ]
        },
        {
          "title": "Biden Signs Hate Crimes Law Protecting Asian Americans",
          "text": "President Joe Biden signed a hate crimes law Thursday aimed at protecting Asian Americans who have suffered a surge in attacks during the Covid-19 pandemic.\n\nRacism, Biden told Asian American politicians and senior members of Congress in a packed room at the White House, is “an ugly poison that has long plagued our nation.”\n\nReeling off a list of violent incidents, which took place against a backdrop of anti-Chinese sentiment linked to the pandemic, Biden said the Asian American community had been made a “scapegoat.”\n\n“Too many Asian Americans have been waking up this past year genuinely fearing for their safety, just opening their door and walking down the street,” he said.\n\nREAD ALSO: Sweden Tops EU COVID-19 Case Rates\n\nStop AAPI Hate, an activist group, says there were 6,603 hate incidents — mostly verbal insults — in the year from March 2020, but many more were likely not reported to police.\n\nGoing unmentioned by Biden was that his predecessor Donald Trump would frequently refer to the coronavirus as “the China virus” and “kung flu” — racist-tinged phrases that quickly became part of the right-wing lexicon.\n\nThe bill signed by Biden, after rare, overwhelming bipartisan support in Congress, improves access for reporting such crimes and seeks to smoothen procedures for the authorities to respond.\n\n“I mean this from the bottom of my heart: hate can be given no safe harbor in America,” Biden said. “Silence is complicity. We cannot be complicit.”\n\nAFP",
          "summary": "President Joe Biden signed a hate crimes law Thursday aimed at protecting Asian Americans who have suffered a surge in attacks during the Covid-19 pandemic.\nREAD ALSO: Sweden Tops EU COVID-19 Case RatesStop AAPI Hate, an activist group, says there were 6,603 hate incidents — mostly verbal insults — in the year from March 2020, but many more were likely not reported to police.\nGoing unmentioned by Biden was that his predecessor Donald Trump would frequently refer to the coronavirus as “the China virus” and “kung flu” — racist-tinged phrases that quickly became part of the right-wing lexicon.\nThe bill signed by Biden, after rare, overwhelming bipartisan support in Congress, improves access for reporting such crimes and seeks to smoothen procedures for the authorities to respond.\n“I mean this from the bottom of my heart: hate can be given no safe harbor in America,” Biden said.",
          "link": "https://www.channelstv.com/2021/05/20/biden-signs-hate-crimes-law-protecting-asian-americans/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "biden",
            "american",
            "protecting",
            "signs",
            "covid19",
            "americans",
            "signed",
            "congress",
            "incidents",
            "asian",
            "hate",
            "law",
            "crimes"
          ]
        },
        {
          "title": "Senate Criminalises Ransom Payment With 15 Years Jail Term",
          "text": "The Senate is amending the Terrorism Prevention Bill, to prohibit the payment and receipt of ransom to release kidnapped persons.\n\nThe Bill which scaled the second reading during the plenary on Wednesday wass sponsored by Senator Ezenwa Onyewuchi.\n\nLeading the debate on the bill, Senator Onyewuchi says Kidnapping has become a fast and lucrative business, adding that according to the USA Global Risk Consultancy, Nigeria has the highest rate of kidnaps for a ransom of both locals and foreigners in all of Africa.\n\nHe warned that the continuous payment of ransom must not be encouraged and government should provide adequate security to end the menace of kidnapping in the country.",
          "summary": "The Senate is amending the Terrorism Prevention Bill, to prohibit the payment and receipt of ransom to release kidnapped persons.\nThe Bill which scaled the second reading during the plenary on Wednesday wass sponsored by Senator Ezenwa Onyewuchi.\nLeading the debate on the bill, Senator Onyewuchi says Kidnapping has become a fast and lucrative business, adding that according to the USA Global Risk Consultancy, Nigeria has the highest rate of kidnaps for a ransom of both locals and foreigners in all of Africa.\nHe warned that the continuous payment of ransom must not be encouraged and government should provide adequate security to end the menace of kidnapping in the country.",
          "link": "https://www.channelstv.com/2021/05/20/senate-criminalises-ransom-payment-with-15-years-jail-term/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "kidnapping",
            "jail",
            "bill",
            "payment",
            "sponsored",
            "15",
            "term",
            "senator",
            "warned",
            "usa",
            "wass",
            "criminalises",
            "senate",
            "ransom",
            "terrorism"
          ]
        }
      ]
    },
    "tvcnews": {
      "link": "https://www.tvcnews.tv/",
      "articles": []
    },
    "arisetv": {
      "link": "https://www.arise.tv/",
      "articles": [
        {
          "title": "Israeli Cabinet Approves Ceasefire in Gaza",
          "text": "Israeli media say Prime Minister Benjamin Netanyahu’s Security Cabinet has approved a unilateral cease-fire to halt an 11-day military operation in the Gaza Strip.\n\nThe decision came after heavy U.S. pressure to halt the offensive.\n\nIt was not immediately clear when the truce was to take effect. The public broadcaster Kan said the fighting was to halt immediately, while other TV channels said it would go into effect at 2 a.m.\n\nThere was no immediate reaction from Hamas.\n\nIsrael unleashed a new wave of airstrikes across the Gaza Strip on Thursday and Hamas fired more rockets into Israel, despite growing signs that the sides were close to a cease-fire that would end 11 days of heavy fighting.\n\n…",
          "summary": "Israeli media say Prime Minister Benjamin Netanyahu’s Security Cabinet has approved a unilateral cease-fire to halt an 11-day military operation in the Gaza Strip.\nThe decision came after heavy U.S. pressure to halt the offensive.\nIt was not immediately clear when the truce was to take effect.\nThe public broadcaster Kan said the fighting was to halt immediately, while other TV channels said it would go into effect at 2 a.m.\nIsrael unleashed a new wave of airstrikes across the Gaza Strip on Thursday and Hamas fired more rockets into Israel, despite growing signs that the sides were close to a cease-fire that would end 11 days of heavy fighting.",
          "link": "https://www.arise.tv/israeli-cabinet-approves-ceasefire-in-gaza/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "gaza",
            "halt",
            "heavy",
            "unleashed",
            "fighting",
            "ceasefire",
            "approves",
            "immediately",
            "israeli",
            "effect",
            "unilateral",
            "cabinet",
            "wave"
          ]
        },
        {
          "title": "Aid Workers in South Sudan ‘Under Threat’",
          "text": "International observers, who are in South Sudan to monitor the implementation of the peace deal, have expressed concerns that widespread violence in the country threatens the “safety and security” of aid workers.\n\nLast week, a Ugandan aid worker was killed when unknown gunmen fired at a clearly marked humanitarian vehicle. It was part of a convoy travelling to a health facility in Eastern Equatoria.\n\nMore than 120 aid workers have been killed in the country since the civil war broke out in December 2013.\n\nThe growing incidences of insecurity continue to impede the delivery of aid to those who are in dire need, the Reconstituted Joint Monitoring and Evaluation Commission (RJMEC) says.\n\nThere had been incidents of violence reported in different parts of the country, it said.\n\n“Taken together, all these amount to a worrying composite picture for the safety and security of humanitarian workers,” said Charles Tai Gituai, a retired Kenyan army general, who leads the monitoring group.\n\nHe urged the unity government to provide a secure and enabling environment for humanitarian workers.",
          "summary": "International observers, who are in South Sudan to monitor the implementation of the peace deal, have expressed concerns that widespread violence in the country threatens the “safety and security” of aid workers.\nLast week, a Ugandan aid worker was killed when unknown gunmen fired at a clearly marked humanitarian vehicle.\nMore than 120 aid workers have been killed in the country since the civil war broke out in December 2013.\n“Taken together, all these amount to a worrying composite picture for the safety and security of humanitarian workers,” said Charles Tai Gituai, a retired Kenyan army general, who leads the monitoring group.\nHe urged the unity government to provide a secure and enabling environment for humanitarian workers.",
          "link": "https://www.arise.tv/aid-workers-in-south-sudan-under-threat/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "safety",
            "south",
            "violence",
            "workers",
            "country",
            "monitoring",
            "worrying",
            "threat",
            "humanitarian",
            "security",
            "sudan",
            "aid",
            "killed"
          ]
        },
        {
          "title": "Nigeria: One Dead as Explosion Rocks Obasanjo Presidential Library",
          "text": "A gas explosion at the Olusegun Obasanjo Presidential Library in Abeokuta, the Ogun State capital has killed one person.\n\nAn aide to the former Nigerian President, Atom Lim confirmed the explosion and noted that there was a fatality in the incident while one other victim was rushed to the hospital in a critical condition.\n\nMr Lim in a statement posted on Facebook said the incident occurred around 11:00 am on Thursday.\n\n“Early reports indicate that the explosion was caused by gas used in maintenance of ACs at the unit. An investigation has been launched for further details and action,” the statement read.\n\nThe Managing Director of the library, Vitalis Ortese, said the explosion occurred when a pair of technical vendors were conducting routine servicing of the air conditioning units.\n\n“The explosion, which occurred at about 11.04 am, unfortunately, led to the death of a technical vendor and serious injury of the second vendor,” Ortese said in a statement that corroborated Lim’s position.\n\n“The emergency team of the Library immediately took action to prevent further damages and subsequently moved the injured to the hospital. Visitors into the complex were temporarily limited to contain any fallouts from the explosion. This has, however, been restored after clearance by the fire services authorities.”\n\nBy Abel Ejikeme",
          "summary": "A gas explosion at the Olusegun Obasanjo Presidential Library in Abeokuta, the Ogun State capital has killed one person.\nMr Lim in a statement posted on Facebook said the incident occurred around 11:00 am on Thursday.\nThe Managing Director of the library, Vitalis Ortese, said the explosion occurred when a pair of technical vendors were conducting routine servicing of the air conditioning units.\n“The explosion, which occurred at about 11.04 am, unfortunately, led to the death of a technical vendor and serious injury of the second vendor,” Ortese said in a statement that corroborated Lim’s position.\n“The emergency team of the Library immediately took action to prevent further damages and subsequently moved the injured to the hospital.",
          "link": "https://www.arise.tv/nigeria-one-dead-as-explosion-rocks-obasanjo-presidential-library/",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "incident",
            "library",
            "ortese",
            "vendor",
            "presidential",
            "obasanjo",
            "dead",
            "occurred",
            "nigeria",
            "lim",
            "rocks",
            "explosion",
            "technical",
            "statement",
            "hospital"
          ]
        },
        {
          "title": "Israeli Cabinet Approves Ceasefire in Gaza",
          "text": "Israeli media say Prime Minister Benjamin Netanyahu’s Security Cabinet has approved a unilateral cease-fire to halt an 11-day military operation in the Gaza Strip.\n\nThe decision came after heavy U.S. pressure to halt the offensive.\n\nIt was not immediately clear when the truce was to take effect. The public broadcaster Kan said the fighting was to halt immediately, while other TV channels said it would go into effect at 2 a.m.\n\nThere was no immediate reaction from Hamas.\n\nIsrael unleashed a new wave of airstrikes across the Gaza Strip on Thursday and Hamas fired more rockets into Israel, despite growing signs that the sides were close to a cease-fire that would end 11 days of heavy fighting.\n\n…",
          "summary": "Israeli media say Prime Minister Benjamin Netanyahu’s Security Cabinet has approved a unilateral cease-fire to halt an 11-day military operation in the Gaza Strip.\nThe decision came after heavy U.S. pressure to halt the offensive.\nIt was not immediately clear when the truce was to take effect.\nThe public broadcaster Kan said the fighting was to halt immediately, while other TV channels said it would go into effect at 2 a.m.\nIsrael unleashed a new wave of airstrikes across the Gaza Strip on Thursday and Hamas fired more rockets into Israel, despite growing signs that the sides were close to a cease-fire that would end 11 days of heavy fighting.",
          "link": "https://www.arise.tv/israeli-cabinet-approves-ceasefire-in-gaza/#comments",
          "published": "05/20/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "gaza",
            "halt",
            "heavy",
            "unleashed",
            "fighting",
            "ceasefire",
            "approves",
            "immediately",
            "israeli",
            "effect",
            "unilateral",
            "cabinet",
            "wave"
          ]
        },
        {
          "title": "Israel Bombs Hamas Gaza Chief’s Home as Fighting Enters Seventh Day",
          "text": "Israel bombed the home of Hamas’s chief in Gaza early on Sunday and the Islamist group fired rocket barrages at Tel Aviv as hostilities stretched into a seventh day with no sign of abating.\n\nAt least four Palestinians were killed in Israeli air strikes across the coastal enclave, health officials said, and many were injured as the sounds of heavy bombardment roared through the night.\n\nIsraelis dashed for bomb shelters as sirens warning of incoming rocket fire blared in Tel Aviv and the southern city of Beersheba. Around 10 people were injured while running for shelters, medics said.\n\nAt least 149 have been killed in Gaza since the violence began on Monday, including 41 children, health officials said. Israel has reported 10 dead, including two children.\n\nEnvoys from the United States, United Nations and Egypt were working to restore calm but have yet to show any signs of progress. The U.N. Security Council was due to meet later on Sunday to discuss the worst outbreak of Israeli-Palestinian violence in years.\n\nBoth Israel and Hamas have insisted they would continue their cross-border fire, a day after Israel destroyed a 12-storey building in Gaza City that had housed the U.S. Associated Press and Qatar-based Al Jazeera media operations.\n\nThe Israel military said the al-Jala building was a legitimate military target, containing Hamas military offices, and that it had given warnings to civilians to get out of the building before the attack.\n\nThe AP condemned the attack, and asked Israel to put forward evidence. “We have had no indication Hamas was in the building or active in the building,” the news organisation said in a statement.\n\nIn what it called a reprisal for Israel’s destruction of the al-Jala building, Hamas fired rockets at Tel Aviv and towns in southern Israel early on Sunday.\n\nPrime Minister Benjamin Netanyahu said late on Saturday that Israel was “still in the midst of this operation, it is still not over and this operation will continue as long as necessary.”\n\nIn a burst of air strikes early on Sunday, Israel targeted the home of Yehya Al-Sinwar, who since 2017 has headed the political and military wings of Hamas in Gaza, the group’s TV station said.\n\nAnother air strike killed a Gaza neurologist and wounded his wife and daughter, Palestinian medics and relatives said.\n\nHamas began its rocket assault on Monday after weeks of tensions over a court case to evict several Palestinian families in East Jerusalem, and in retaliation for Israeli police clashes with Palestinians near the city’s Al-Aqsa Mosque, Islam’s third holiest site, during the Muslim holy month of Ramadan.\n\nSpeaking to crowds of protesters in the Qatari capital of Doha, Hamas chief Ismail Haniyeh said late on Saturday that the underlying cause of the hostilities was Jerusalem.\n\n“The Zionists thought … they could demolish Al-Aqsa mosque. They thought they could displace our people in Sheikh Jarrah,” said Haniyeh.\n\n“I say to Netanyahu: do not play with fire,” he continued, amid cheers from the crowd. “The title of this battle today, the title of the war, and the title of the intifada, is Jerusalem, Jerusalem, Jerusalem,” using the Arabic word for ‘uprising’.\n\nHamas, Islamic Jihad and other militant groups have fired around 2,300 rockets from Gaza since Monday, the Israeli military said on Saturday. It said about 1,000 were intercepted by missile defences and 380 fell into the Gaza Strip.\n\nIsrael has launched more than 1,000 air and artillery strikes into the densely populated coastal strip, saying they were aimed at Hamas and other militant targets.\n\nEarlier this week, the International Criminal Court’s chief prosecutor, Fatou Bensouda, told Reuters the court was “monitoring very closely” the latest escalation of hostilities, amid an investigation now under way into alleged war crimes in earlier bouts of the conflict.\n\nNetanyahu accused Hamas of “committing a double war crime” by targeting civilians, and using Palestinian civilians as “human shields.”\n\nUN Secretary-General Antonio Guterres reminded “all sides that any indiscriminate targeting of civilian and media structures violates international law and must be avoided at all costs,” UN spokesman Stephane Dujarric said in a statement on Saturday.\n\nThere has been a flurry of US diplomacy in recent days to try to quell the violence.\n\nPresident Joe Biden’s envoy, Hady Amr, arrived in Israel on Friday for talks. Biden spoke with both Netanyahu and Palestinian President Mahmoud Abbas late on Saturday, and updated them on US diplomatic efforts, the White House said.\n\nBut any mediation is complicated by the fact that the United States and most western powers do not talk to Hamas, which they regard as a terrorist organisation. And Abbas, whose power base is in the occupied West Bank, exerts little influence over Hamas in Gaza.\n\nIn Israel, the conflict has been accompanied by violence amongst the country’s mixed communities of Jews and Arabs, with synagogues attacked and Arab-owned shops vandalised.\n\nThere has also been an upsurge in deadly clashes in the occupied West Bank. At least 12 Palestinians have been killed by Israeli troops in the occupied West Bank since Friday, most of them during clashes.",
          "summary": "At least 149 have been killed in Gaza since the violence began on Monday, including 41 children, health officials said.\nThe Israel military said the al-Jala building was a legitimate military target, containing Hamas military offices, and that it had given warnings to civilians to get out of the building before the attack.\n“The title of this battle today, the title of the war, and the title of the intifada, is Jerusalem, Jerusalem, Jerusalem,” using the Arabic word for ‘uprising’.\nHamas, Islamic Jihad and other militant groups have fired around 2,300 rockets from Gaza since Monday, the Israeli military said on Saturday.\nAnd Abbas, whose power base is in the occupied West Bank, exerts little influence over Hamas in Gaza.",
          "link": "https://www.arise.tv/israel-bombs-hamas-gaza-chiefs-home-as-fighting-enters-seventh-day/",
          "published": "05/16/2021",
          "scraped_date": "05/20/2021",
          "keywords": [
            "gaza",
            "day",
            "enters",
            "air",
            "bombs",
            "palestinian",
            "building",
            "chiefs",
            "seventh",
            "fighting",
            "israeli",
            "jerusalem",
            "killed",
            "military",
            "israel",
            "hamas"
          ]
        }
      ]
    }
  }
}