[
  {
    "headline": "Don’t take unreasonable risks, IGP tells cops",
    "summarized_story": "The Inspector-General of Police, Baba Alkali, on Friday asked policemen to desist from taking unnecessary risks.\nAlkali who commiserated with the families of cops who lost their lives admitted that policing was full of hazards.\nHe said, “Stop taking unwarranted risks.\nChange your attitudes towards work.\n“We will continue to appreciate your commitment and sacrifices to protect Imo people and the society at large."
  },
  {
    "headline": "Ondo Assembly passes anti-open grazing, judicial autonomy bills into law",
    "summarized_story": "In a bid to regulate the activities of herdsmen and the rearing of livestock in the state, the Ondo State House of Assembly has passed into law the anti-open grazing bill.\nThe House also passed into law the bill on the autonomy of the judiciary and the bill on violence against persons prohibition.\nThe bills were passed after the chairmen of three committees submitted their reports on the bill.\nSpeaking on the bills at the session, the committee chairmen remarked that the bills were in the best interest of all citizens of Ondo State.\nAfter due consideration of the reports and deliberation at the plenary, the bills were unanimously passed into law by the House."
  },
  {
    "headline": "Court orders NSITF to reinstate dismissed staff",
    "summarized_story": "The National Industrial Court, Abuja, on Friday ordered the Nigerian Social Insurance Trust Fund ( NSITF) to reinstate it’s dismissed staff, Ayeni Akinwande with immediate effect.\nThe court further held that the officials who wrote and signed the dismissal letter had no power to do so.\nShe, therefore, declared the summary dismissal of the claimant on Feb. 15 2017, as unlawful, null and void and of no effect.\nIn addition, the court ordered that the claimant be placed in the same position with his colleagues who were Deputy Managers when his employment was unlawfully terminated.\nThe defence equally argued that the claimant’s dismissal was in accordance with the staff regulations and conditions of service."
  },
  {
    "headline": "Nnamdi Kanu: Good governance, the only solution – I Go Dye",
    "summarized_story": "There are already many young men nurturing the mindset of replacing Nnamdi Kanu , good governance is the only solution.”He continues “If the youths are gainfully employed,with three square meals, good healthcare for our aged parents, good roads and sustainable living, Nigerians can go to Sambisa Forest and bring anyone there, dead or alive, who wants to stop this privilege.\nThe Federal Government should free #Nnamdikanu and understand that Kanu is just one individual amongst millions of others, who are aggrieved with this country.\nWe can only win back their trust,if we extend a hand of friendship and forgiveness to all concerned.\nThe poor man in Katsina State is faced with the same problem as the poor man in the South East or any other part of the country.\nHe is known to have written many letters to people in power on issues that affect the polity."
  },
  {
    "headline": "NDDC: People’re agitated, palpable fear, tension in N’Delta — Government Tompolo",
    "summarized_story": "The people of the region are yet to see any tangible move towards the constitution of the NDDC board by the Federal Government.\nThere is palpable fear and tension in the region.\n“As it stands now, the one thing the government must do in this issue is to be courageous enough to constitute the NDDC board.\nGovernment must be sincere in handling developmental issues in the Niger Delta region as the people have suffered enough, being neglected for several decades.\n“Multinational oil companies operating in the Niger delta region are not left out in the troubles of the region."
  },
  {
    "headline": "Nnamdi Kanu: Arrest leaders of herdsmen terrorist, Miyetti Allah unleashing havoc in parts of Nigeria — Benue tribal leaders urge FG",
    "summarized_story": "The IPOB leader was arrested and extradited to Nigeria last Sunday after four years in exile.\nPeasant farmers who had hitherto, contributed to making Benue Food Basket of the Nation can no longer go to their farms for fear of being killed.\n“Incidentally, these people have known links that speak out when some of the attacks are carried out.\n“We wish to state unequivocally that in Benue State, militia herdsmen are 95 percent behind insecurity and hunger.\n“It is our firm belief that in Benue State anytime the Federal Government decides that our people should go back to their farms to continue with their farming activities, decisive steps will be taken."
  },
  {
    "headline": "Two students arrested for threatening to kidnap principal in Zamfara",
    "summarized_story": "The Police Command in Zamfara has arrested two students in connection with issuing threats to kidnap a principal, staff, and students in two separate secondary schools in the state.\n“The letter contained a threat to kidnap the Principal of the school, Rev.\n“Receiving the report of the complaint from the school management, the police detectives swung into action and arrested one Donatus Ejeh, as the principal suspect”.\nRabi’u further said that on Thursday the Principal of FGC Anka, had reported to the Divisional Police Officer that an unknown person called her and demanded three million naira or otherwise kidnap some students of the school..\nRabi’u added that the command also arrested 45 suspects over alleged criminal conspiracy, public disturbance of public peace and riot."
  },
  {
    "headline": "Okorocha task state legislators on laws for anger-free society",
    "summarized_story": "Senator representing Imo West Senatorial District, Rochas Owelle Okorocha has charged state lawmakers in the country to legislate laws that free the society of anger and hate, while expressing optimism that a new Nigeria was possible.\nThe former governor of Imo said it seemed impossible to achieve a nation devoid of hate and insecurity, but that it could be easily done when Nigerians worked towards it.\nOkorocha said this at the Unity House Abuja when he played host to members of the APC State Assembly forum from Cross River State who were in Abuja on a familiarization tour of the party headquarters after decamping alongside Governor Ben Ayade.\n“You are coming at the right time, it is no longer about the party, but creating a new Nigeria devoid of hate; anger and insecurity”, he said.\nThe Imo senator also used the occasion to advice the APC lawmakers to always work in unity with Governor Ben Ayade to move the state and the party forward in the south-south region."
  },
  {
    "headline": "BREAKING: DSS approves Nnamdi Kanu’s meeting with his lawyer",
    "summarized_story": "The Department of State Security Service has agreed to allow the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu to meet with his lawyers.\nThis was disclosed by Nnamdi Kanu’s counsel, Ifeanyi Ejiofor through his Twitter handle on Friday.\n“Update, Thankfully Our effort is yielding the desired result, We have just received a communication approving Our visit to Our Client- Mazi Nnamdi Kanu.\nShall keep the World posted on the outcome, immediately after the meeting, later in the Day.\nThe IPOB leader has been scheduled to appear before the Abuja Federal High Court for the continuation of his trial from the 26-27 July 2021."
  },
  {
    "headline": "Nnamdi Kanu: Nigerian govt reveals fresh charges against IPOB leader",
    "summarized_story": "The federal government has revealed that the detained leader of the proscribed Indigenous People of Biafra, IPOB, Nnamdi Kanu, will be facing fresh charges.\nThe Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami, SAN, disclosed this while speaking to newsmen in Abuja.\nMalami noted that the new charges will incorporate fresh allegations against the IPOB leader.\nOn Tuesday, he was brought before Justice Binta Nyako of an Abuja Federal High Court to continue his trial.\nJustice Nyako had ordered the IPOB leader to be remanded in DSS custody."
  },
  {
    "headline": "FG shuts Lagos Eko Bridge, warns Okada riders",
    "summarized_story": "The Federal Government on Friday said it would shut the Ijora ramp of Eko Bridge from midnight to be able to fix a major expansion joint undergoing rehabilitation.\nThe controller said in order to remove and replace the expansion joint where traffic merged, the Ijora ramp of the bridge must be shut.\n“Vehicles that are coming from Ijora end and the ones coming from Apongbon, the two bridges merge at a point.\n“For us to be able to remove the expansion joint, we have to close the two sides of the bridges, otherwise, we will not be able to remove and replace the expansion joint.\n“We plan to close the Ijora ramp this night,” the controller said."
  },
  {
    "headline": "Kaduna State College of Education suspends academic activities after protest, student’s death",
    "summarized_story": "Management of the Kaduna State College of Education on Friday suspended academic activities in the Institution.\nIn a circular to the school community, signed by the Registrar, Marcus Timothy, the management said the closure was on the advice of the state government.\nHe said all academic activities were suspended, though staff members were expected to continue reporting to their duty posts.\n“Consequent upon the aborted planned students’ demonstration last Monday, 28th June 2021, the state government has advised the Management to close the College till further notice.\nDays after the protest, security operatives arrested and detained some students who participated in the protest."
  },
  {
    "headline": "Court fixes judgment for Sept 10 in Orji Kalu’s suit against retrial",
    "summarized_story": "By Eric Ikhilae, AbujaA Federal High Court in Abuja on Friday scheduled judgment for September 10 in the suit by ex-Abia State Governor, Orji Uzor Kalu against his retrial.\nIn the judgment marked: SC/62C/2019 filed by Udeogu, the Supreme Court ordered a retrial in the case.\nHe argued that there was no disagreement among parties that his client was not a party to the appeal before the Supreme Court and that the order for retrial made by the Supreme Court did not relate to his client.\nIn a counter-argument, lawyer to the EFCC, Rotimi Jacobs (SAN) faulted Kalu’s position and urged the court to dismiss the suit.\nADVERTISEMENTJacobs added that since Kalu took advantage of the Supreme Court judgment, on which basis he was released, he must bear the burden that arose from the same judgment."
  },
  {
    "headline": "Teacher nabbed for ‘raping’ class five pupil",
    "summarized_story": "The Nation gathered that the case at the time of filing the report is being handled by the human rights section of the Aba Area Command.\nOur correspondent gathered from a close family source of the victim, that the teacher started abusing his pupil in January this year.\nADVERTISEMENTThe father of the victim, Mr. Ignatius Onyechekwe when contacted confirmed the illicit activities of the classroom teacher.\nThe Police Public Relations Officer, SP Geoffrey Ogbonna confirmed the arrest and detention of Mr. Nathaniel in their custody.\nHe added that the suspect will be taken to court as soon as investigation into the matter was concluded."
  },
  {
    "headline": "Seven in race for APC national chairman",
    "summarized_story": "Deputy Editor EMMANUEL OLADESU writes on the All Progressives Congress (APC) national chairmanship race and chances of the aspirants at the convention.\nBut, the All Progressives Congress (APC) convention itself has remained elusive.\nHe defected from the APC to PDP, where he was briefly the national chairman.\nWhen he was shoved aside as chairman, Senator Ahmed Makarfi became the PDP caretaker chairman.\nMustapha is a former deputy national chairman of CPC."
  },
  {
    "headline": "Ondo Assembly passes anti-Open Grazing, judicial autonomy Bills",
    "summarized_story": "By Osagie Otabor, AkureLawmakers in the Ondo State House of Assembly have passed the anti-Open Grazing bill into law.\nOther bills passed into law by the lawmakers were for the judicial autonomy and violence against persons.\nViolators of the anti-open grazing bill would be arrested and prosecuted by the Nigeria Police.\nPresenting report on the anti-open grazing bill, Chairman House Committee on Agriculture, Honourable Taofeek Oladele, said the bill would prevent destruction of farm crops in the state.\nOndo Deputy Speaker, Honourable Aderoboye Samuel Ademoye, who presented the judicial autonomy bill, said it would regulate management of funds in the judicial arm of government."
  },
  {
    "headline": "We would cripple Nigeria if Kanu dies – IPOB",
    "summarized_story": "From Stanley Uzoaru, OwerriThe Indigenous People of Biafra (IPOB) has threatened to cripple Nigeria if anything should happen to its leader, Nnamdi Kanu whose being detained by the Department of State Service(DSS).\nAnd his lawyers are being harassed and we pity them and Nigeria if anything happen to our leader Mazi Nnamdi Kanu the Nigeria Government and security agencies must understand the product we are made of and how prepared we are.\nNnamdi Kanu must not die in custody.\n“The Fulani- controlled federal government of Nigeria and DSS should release our leader for international medical check up.\nShould anything untoward happen to our leader while in detention or even after, we will totally cripple Nigeria and its Government."
  },
  {
    "headline": "Senate passes PIB, disagrees with Reps on percentage for host communities",
    "summarized_story": "From Fred Itua, AbujaFourteen years after the first attempt was made, the Senate and House of Representatives, yesterday, passed into law the Petroleum Industry Bill (PIB).\nBut it was not without controversy and drama as senators and House of Reps disagreed on what percentage host communities should get from crude oil drilled in their areas.\nThe senate went ahead to approval a Host Community Trust Fund, which would be anchored by oil and gas companies operating in the host communities for the three per cent.\nThe Authority shall have the power to acquire, hold and dispose of property, sue and be sued in its own name.\n“The Authority shall be responsible for the technical and commercial regulation of midstream and downstream petroleum operations in the petroleum industry."
  },
  {
    "headline": "Kanu: FG reveals 2-year effort to nab IPOB leader",
    "summarized_story": "“We commend the professionalism, diligence, patriotism and painstaking efforts of our security and intelligence agencies.\n“We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators.\n“Finally, there have been speculations on how this re-arrest was pulled off and in which country the hitherto fugitive leader of the proscribed IPOB was nabbed.\nMeanwhile, a day after Kingsley, younger brother of the IPOB leader said the separatist leader was arrested in Kenya, Nairobi has denied the claim.\nThe British High Commission in Nigeria has also said Kanu was not arrested in the United Kingdom where the embattled IPOB leader is a citizen."
  },
  {
    "headline": "Arrest Miyetti Allah, Bandits leaders same way you arrested Kanu, Wike, Ortom urge FG",
    "summarized_story": "“We must not make hullabaloo about the prosecution of Nnamdi Kanu.\n“You cannot say because Nnamdi Kanu is from a particular area, let us prosecute him.\nIf Nnamdi Kanu can be arrested from a foreign land.\n“It is laughable and unfortunate when I heard that Miyetti Allah are calling Nnamdi Kanu a terrorist.\nSomeone who is fighting for the liberation of his people is being called a terrorist by a terrorist organisation called Miyetti Allah and Fulani herdsmen."
  },
  {
    "headline": "Why we raided Sunday Igboho’s home in Ibadan-DSS",
    "summarized_story": "Molly Kilete, AbujaThe Department of State Services(DSS), has explained why it carried raided the home of Sunday Igboho, in Ibadan, Oyo State .\nHe told newsmen in Abuja that on approaching the premises, the security operatives were attacked by men suspected to be working as security guards for the suspect.\n“On approach to the residence, the team came under heavy gun attack by nine (9) men, suspected to be IGBOHO’s guards.\n“In the course of the exchange, two (2) of IGBOHO’s armed men were gunned down while the rest were subdued and arrested.\nHe might have attacked security operatives as his strength carried him."
  },
  {
    "headline": "DSS Raids Igboho’s House, Declares Him Wanted",
    "summarized_story": "He might have attacked security operatives as his strength carried him.\nTwo Yoruba sons have been killed in the house of Chief Sunday Igboho.\nWe do not know of the location where they were taken to,” Igboho’s spokesman, Mr. Olayomi Koiki, said.\nHe added that Igboho’s passport and travel documents were stolen together with his phones, his personal effects, computers and N2 million.\nHe stated that the gunmen killed seven occupants of the building and whisked away Igboho’s wife and others."
  },
  {
    "headline": "National Assembly Passes PIB, Approves 3% for Host Communities",
    "summarized_story": "Also, the Senior Special Assistant to the President on National Assembly (Senate), Senator Babajide Omoworare said the federal lawmakers had broken the jinx.\nThe Senate passed the much-awaited PIB after a clause-by-clause consideration of all the 318 clauses of the bill.\nThe bill was first sent to the National Assembly in 2008 by President Umaru Yar’Adua, now deceased, without translating into an Act.\nThe bill had proposed five per cent of the annual profit share of the oil companies for the host communities.\nFemi Gbajabiamila, on the passage of the PIB by the National Assembly."
  },
  {
    "headline": "FG Projects N11.9tn Budget, N900bn for Subsidy in 2022",
    "summarized_story": "Ndubuisi Francis in AbujaThe federal government is projecting N900 billion for fuel subsidy in an estimated N11.907 trillion budget for 2022.\nThe minister lamented that subsidy is exerting huge cost on the country, adding that in a particular month, N150 billion was spent on subsidising petrol.\nBut if we get rid of subsidy completely, it is not a popular view with labour,” Ahmed said.\nOn the funding of the N5.6 trillion deficit, Ahmed said it would be done through borrowing from both domestic and foreign sources at 50 per cent.\nOn the 2021 budget performance, Ahmed said a total of N973 billion had been released for capital projects as of May."
  },
  {
    "headline": "OPEC Defers Decision on Oil Output Cuts",
    "summarized_story": "Earlier, there were expectations that the cartel could boost production output by another 400,000 barrels beginning in August, an increase seen as likely to be easily absorbed by the market amid expectations for rising demand.\nAt the inconclusive meeting, the OPEC+ ministerial committee had proposed the planned increase to the wider group, but a disagreement between Saudi Arabia and Russia, the biggest producers in the OPEC+ alliance, remained largely unresolved.\nBefore the deferment of the meeting, oil prices reacted with Brent crude trading above $75 a barrel, close to a two-and-a-half-year high as the policy from August to December was being awaited.\nWhile the full house decided to shift a definitive decision on the matter till today, OPEC had earlier finished its meeting just before an OPEC+ ministerial committee met after that, before the inconclusive one by OPEC+ ministers.\nHe, however, stated that OPEC still sees growth in the second half of the year."
  },
  {
    "headline": "DSS Confirms Raid on Igboho’s House, Orders Yoruba Activist to Report to Nearest Security Agency",
    "summarized_story": "He said operatives raided his residence in Soka, Ibadan Thursday and arrested nine of his associates.\nIt said operatives recovered seven AK 47 assault rifles, 30 fully charged AK 47 and 5,000 rounds of 7.62 mm ammunition.\nHe might have attacked security operatives as his strength carried him.\nHis strength will sure fail him and the law will catch up with him.\nHe stated further: “Consequently, Adeyemo/Igboho is advised to turn himself in to the nearest security agency."
  },
  {
    "headline": "Nigerian Army Arrests Youths in Enugu Communities Over Expulsion Of Herdsmen, Cattle",
    "summarized_story": "Soldiers of the Nigerian Army have invaded and arrested youths in two communities in the Nkanu East and Nkanu West local government areas of Enugu State for allegedly attacking and sending away herdsmen and their cows from the areas.\nCommunity sources said the soldiers invaded Ekpoffo on Wednesday and whisked away some youths to unknown destinations.\nA source said, “Soldiers numbering over 100 stormed Ekpoffo community in Nkanu East around 7.30pm on Wednesday.\nAnother community source said the soldiers also invaded Ndiagu- Akpugo community and razed some houses.\nThe Deputy Director, Army Public Relations, 82 Division, Enugu, Col. Abubakar Abdullahi, declined comment when contacted on the incident."
  },
  {
    "headline": "Nigerian Army Arrests Youths in Enugu Communities Over Expulsion Of Herdsmen, Cattle",
    "summarized_story": "Soldiers of the Nigerian Army have invaded and arrested youths in two communities in the Nkanu East and Nkanu West local government areas of Enugu State for allegedly attacking and sending away herdsmen and their cows from the areas.\nCommunity sources said the soldiers invaded Ekpoffo on Wednesday and whisked away some youths to unknown destinations.\nA source said, “Soldiers numbering over 100 stormed Ekpoffo community in Nkanu East around 7.30pm on Wednesday.\nAnother community source said the soldiers also invaded Ndiagu- Akpugo community and razed some houses.\nThe Deputy Director, Army Public Relations, 82 Division, Enugu, Col. Abubakar Abdullahi, declined comment when contacted on the incident."
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Declare Igboho Wanted, Parade His 'Foot Soldiers', Recover Arms, Charms During Raid",
    "summarized_story": "The Department of State Services (DSS) has paraded some supporters of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, who were arrested during a raid on his residence at Soka in Ibadan Oyo State.\nThe spokesperson for the service, Peter Afunnaya, who addressed journalists on Thursday night in Abuja said the service got intelligence that Ighoho had stockpiled arms in his house.\nOthers include 2 pistol holsters, 1 binocular, 18 walkie-talkies, 3 voodoo charm jackets/ traditional body armour.\n\"The arrest and seizures are no doubt confirmation of a grand plan by Igboho and cohorts to wage a violent insurrection against the Nigerian state.\n\"Consequently Adeyemo/Igboho is advised to turn himself in to the nearest security agency.\""
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Declare Igboho Wanted, Parade His 'Foot Soldiers', Recover Arms, Charms During Raid",
    "summarized_story": "The Department of State Services (DSS) has paraded some supporters of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, who were arrested during a raid on his residence at Soka in Ibadan Oyo State.\nThe spokesperson for the service, Peter Afunnaya, who addressed journalists on Thursday night in Abuja said the service got intelligence that Ighoho had stockpiled arms in his house.\nOthers include 2 pistol holsters, 1 binocular, 18 walkie-talkies, 3 voodoo charm jackets/ traditional body armour.\n\"The arrest and seizures are no doubt confirmation of a grand plan by Igboho and cohorts to wage a violent insurrection against the Nigerian state.\n\"Consequently Adeyemo/Igboho is advised to turn himself in to the nearest security agency.\""
  },
  {
    "headline": "Man Suspected To Be Nigerian Defrauds Female Doctor Of N23million In India",
    "summarized_story": "A foreigner suspected to be a Nigerian, James Maria has allegedly duped an Indian female doctor, Shahila Kumar of a sum of Rs 41 lakh (about N23 million) on Wednesday, New Indian Express reports.\nKumar, a herbal doctor from Mehedipatnam, a Hyderabad city approached the police after she was duped by the accused of Rs 41 lakh, who the police suspect is from Nigeria.\nIndian policeThe accused, claiming to have hailed from the United Kingdom, wanted to buy herbal medicine formula from the victim, Kumar, for Rs 5 crore.\nThe person asked Kumar to pay Rs 26 lakh in tax amount, and she did as communicated.\nA couple of days back, she received a call from another person who claimed to be from the Customs and asked to pay Rs 16 lakh."
  },
  {
    "headline": "Buhari: Some people now leaving offices for farms... our agriculture policy paying off",
    "summarized_story": "President Muhammadu Buhari says the agriculture policy of his administration is paying off as crude oil can no longer sustain the country.\nThe president said his administration also stopped the importation of many food products, and as a result of the action, Nigerians now eat what they produce.\nAdvertisement“Today, we eat what we grow, and we have stopped importation of many food products.\nWe have embraced technology, and some people are even leaving the offices to go back to the land.\nThat is the feedback we get.”On his part, the former prime minister commended Buhari for his achievements, especially in the management of COVID-19 and agriculture."
  },
  {
    "headline": "Buhari: Some people now leaving offices for farms... our agriculture policy paying off",
    "summarized_story": "President Muhammadu Buhari says the agriculture policy of his administration is paying off as crude oil can no longer sustain the country.\nThe president said his administration also stopped the importation of many food products, and as a result of the action, Nigerians now eat what they produce.\nAdvertisement“Today, we eat what we grow, and we have stopped importation of many food products.\nWe have embraced technology, and some people are even leaving the offices to go back to the land.\nThat is the feedback we get.”On his part, the former prime minister commended Buhari for his achievements, especially in the management of COVID-19 and agriculture."
  },
  {
    "headline": "'Nigerian government has the answers' — Kenya denies involvement in Nnamdi Kanu's arrest",
    "summarized_story": "Wilfred Machage, Kenyan high commissioner to Nigeria, has denied the claim that Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), was arrested in Kenya.\nHowever, Kingsley Kanu, brother of the separatist leader, alleged that his brother was apprehended in Kenya.\nSpeaking at a media briefing on Friday, the Kenyan high commissioner said the allegation was “concocted” to pitch Nigerians in the south-east against the Kenyan people.\nAdvertisement“I want to address the allegation by denying that Kenya was involved in the alleged arrest in Kenya and extradition to Nigeria of Mr Kanu,” Machage said.\nInstead of facing the Kenyan high commission in Nigeria to ask some of these questions, you should face your government."
  },
  {
    "headline": "'Nigerian government has the answers' — Kenya denies involvement in Nnamdi Kanu's arrest",
    "summarized_story": "Wilfred Machage, Kenyan high commissioner to Nigeria, has denied the claim that Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), was arrested in Kenya.\nHowever, Kingsley Kanu, brother of the separatist leader, alleged that his brother was apprehended in Kenya.\nSpeaking at a media briefing on Friday, the Kenyan high commissioner said the allegation was “concocted” to pitch Nigerians in the south-east against the Kenyan people.\nAdvertisement“I want to address the allegation by denying that Kenya was involved in the alleged arrest in Kenya and extradition to Nigeria of Mr Kanu,” Machage said.\nInstead of facing the Kenyan high commission in Nigeria to ask some of these questions, you should face your government."
  },
  {
    "headline": "MAN IN THE NEWS: Sunday Igboho, the Nnamdi Kanu of south-west?",
    "summarized_story": "AdvertisementCall him the Nnamdi Kanu of the south-west — what the IPOB leader claims to be to the Igbo of the south-east it appears Igboho is, or wants to be, to the Yoruba of the south-west.\nOn Thursday, suspected gunmen attacked Igboho’s house at the Soka area of Ibadan, destroying cars and other valuables in the process.\nThe attack, which came two days to a “Yoruba nation rally” Igboho slated for Lagos, has put him in the spotlight.\nNOW WANTED BY THE DSSThe Department of State Services (DSS) has declared Igboho wanted after he escaped arrest when the secret police raided his residence.\nThe development comes days after Nnamdi Kanu was caught, extradited and remanded in the custody of the DSS."
  },
  {
    "headline": "TeamApt closes undisclosed Series B round to extend its banking services across Africa",
    "summarized_story": "Nigeria-based TeamApt, which offers agent banking services with plans to roll out consumer-focused digital banking features, has raised an undisclosed sum in a Series B round.\nTeamApt’s pivotal business at the moment is Moniepoint, a software solution that powers agent banking in Nigeria.\nBut the agent banking space is thought to include Firstmonie, Paga and OPay, the Opera-backed fintech.\nIn March 2021, TeamApt said it processed over ₦1trillion ($2.4 bn) for the first time.\nWhile Moniepoint will continue to power agent banking, TeamApt plans to build a consumer app side of it for individuals as a digital bank."
  },
  {
    "headline": "Faith Keza is leading Irembo to fully digitise Rwanda",
    "summarized_story": "And steering the Irembo ship is Faith Keza.\nFaith is also on the board of the Rwanda National Bank and the Rwanda Development Board.\nSo no, I don’t have great memories.”After a semester at MIT, Faith realized her maths major wasn’t for her.\nBut a lot of plans were stalled and so Faith decided to return on her own to Rwanda and while there, she joined Irembo as CTO.\nWith Faith Keza, Irembo could be at the front of that movement."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "Eswatini government shuts down internet amid violent pro-democracy protests",
    "summarized_story": "pic.twitter.com/Pk9ao9duio — Swazi News (@SwaziNews) June 29, 2021Eswatini protestors now operating at night burning businesses linked to King Mswati and Government properties.\nESWATINI GOVT orders major network providers to cut internet connection, closes schools, imposes 6pm-5am curfew as protests continue.\nBetween January 2020 and February 2021, internet and social media blackouts were imposed in Uganda, Chad, Tanzania, and Ethiopia.\nKing Mswati III has ruled by decree for more than three decades, with unfettered political power over his 1 million people.\nAmid the protests, reports say the king has fled to neighbouring South Africa although Eswatini’s acting Prime Minister, Themba Masuku, denied the claims on Tuesday."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigerian cleantech startup, OneWattSolar, issues ₦10b bond to deploy solar energy across sub-Saharan Africa",
    "summarized_story": "Announced July 1, 2021, the Green Bond Issuance programme, includes a seven-year Green Sukuk issue of ₦1 billion ($2.4 million).\nThe bond issuance was led by Comercio Partners, Lagos-based investment bank and supported by Nigerian Shari’ah complaint fund manager, Marble Capital Limited.\nInterestingly, this is the first Corporate Green Sukuk in Africa and the first Corporate Green Bond for an off-grid renewable energy project.\nAdeojo says OWS is setting a standard for corporate organisations hoping to get to issue a Green Sukuk Bond.\nThe vision of the renewable energy company is to deploy 14,000 megawatts of off-grid renewable energy across sub-Saharan Africa to decarbonise the region’s energy sector."
  },
  {
    "headline": "There’s no such thing as a bad investment – TEN13’s Stewart Glynn talks startup funding",
    "summarized_story": "However, angel investors and venture capitalists are a similarly courageous group of individuals who are seldom celebrated.\nFor this week’s edition, I talked to Stewart Glynn, a Partner at TEN13, an Australian venture capital firm.\nIn December 2019, after wondering how to institutionalise their investments, Baxter and Glynn decided to start TEN13.\nOn bad investments and common mistakes founders makeFor now, Glynn explains that the goal is to fund ten companies every year.\nKnowing this, I asked Glynn how TEN13 deals with investments that do not go according to plan."
  },
  {
    "headline": "Women’s online safety, MTN Uganda’s 5G partnership, Kenya taxes Internet services",
    "summarized_story": "MTN Uganda partners with TIP to build 5G TechnologyMTN Uganda has partnered with members under the Telecom Infra Project (TIP), an engineering-focused community, to automate its network preparation for 5G technology.\nMTN Uganda will use TIP’s Disaggregated Cell Site Gateway (DCSG) technology to build network capabilities at 2,500 locations across Uganda.\nRemember that, in 2019, MTN Uganda began a new initiative committed to developing 5G technology as part of an ongoing transformation across its operations.\nKenya plans to increase the cost of airtime and dataThe Kenyan Parliamentary Committee has proposed additional taxes that will increase the cost of airtime and Internet data services.\nBy making this change, the tax on phone and Internet data service fees would go up from 15% to 20%."
  },
  {
    "headline": "Nigerian stocks lag African peers, but some superstars exist",
    "summarized_story": "Read also: International Breweries declares N 136.8bn revenueChampion BreweriesThe Champion breweries share price came next with 144 percent gain.\nThe insurer’s share price began the year at N0.26 and has surged to N0.61 in the review period.\nThe manufacturer of foam products saw its share price rise to N15.4 per share compared to N7.8 per share at the beginning of the year.\nThe insurer’s share price opened the year at N0.32, surging to N0.60 as of 30 June 2021.\nThe insurance company began the year with a share price of N0.27 and surged to N0.43 per share as at June 30th 2021."
  },
  {
    "headline": "BusinessDay @ 20: Going strong like the way we started",
    "summarized_story": "As we celebrate 20 years of impact journalism in Nigeria, many things have changed, while many things remain the way they were.\nThe strong presence of indigenous Nigerian banks on the African continent owes its success to the policy implemented in early 2000’s which was the focus of the maiden edition of this newspaper.\n“Is Coke losing flavour?” was another important story that featured in BusinessDay’s maiden publication.\nThe maiden publication also featured Virgin Atlantic’s maiden flight into Nigeria.\nBusinessDay also reported that “NNPC reviews cash call payment” in the maiden edition."
  },
  {
    "headline": "Nigeria struggles with poverty that private sector can fix",
    "summarized_story": "With 87 million Nigerians living in poverty, Nigeria is home to the highest number of poor people globally.\nIf anything, the Nigerian government is seemingly tightening its grip on the economy when it should be giving the private sector a bigger role to play.\nThe government is also crowding out the private sector with its sheer size of borrowings.\nThe private sector creates the bulk of jobs in Nigeria but data from the World Bank which shows that the ease of doing business in Nigeria ranks among the lowest globally (despite recent gains) means the private sector is constrained.\n“I would like to see the government focus on improving the ease of doing business to reduce poverty,” a bank CEO told Business Day."
  },
  {
    "headline": "Edo Inland Dry Port: Promoter meets stakeholders, prospective port users, seeks improved collaboration – Nigerian Observer",
    "summarized_story": "The Managing Director of AMES-Edo Inland Container Dry Port, Engr.\nStakeholders at the meeting include Okomu Plc, Manufacturers Association of Nigeria (MAN), Rongtai Industry, ESIPO and Zanithcarex Int’l Limited, among others.\n“It will be a customs port, and a lot of activities at the Lagos Port will be done here at Edo State, yielding huge resources for the state and the federal government.\nBut with the Dry Port, no need to go through the Lagos Port but the Edo Dry Port.\n“The Edo State Government is facilitating the Ossiomo-Power to be connected to the Dry Port for 24/7 electricity supply to reduce cost and ensure that end-users and other stakeholders benefit.”..."
  },
  {
    "headline": "Senate Passes The Petroleum Industry Bill, Approves 3% Allocation to Host Communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The 9th Senate, Thursday, passed the much awaited Petroleum Industry Bill (PIB) with the approval of 3% allocation to host communities.\nThe petroleum industry bill that had become the albatross of successive dispensation has now been passed as a bill.\nDuring a clauce by clause consideration of the Bill, there was still unease over the contentious clause regarding profit sharing for the host communities.\nLawmakers from the South-South, agreed that the fund for host communities should be raised from 2.5 percent to 5 per cent, A request that was immediately turned down by other lawmakers forcing the Senate President to follow the majority vote of 3% allocation to host communities.\nHe also thanked all Nigerians for their patience and support to ensuring the smooth passage of the Bill."
  },
  {
    "headline": "First black female Irish mayor feat worthy of emulation ― NBM – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The NBM of Africa, a Non-Governmental Organisation, commited to the principles of democracy, equity and social justice has felicitated with Ms. Uruemu Adejinmi over her recent election as the first migrant, first African and first black female to become Mayor in the Republic of Ireland.\nThe group said this in a press statement issued on Wednesday by the Public Relations Officer (PRO) NBM of Africa, Mr Oluwatosin Dixon.\nHe said they salute the courage, doggedness and relentlessness in her and other people of African descent across the world.\n“We congratulate Ms. Adejinmi, members of her family and the African diaspora of Ireland.\n“We wish her the best in office and expect her to leave an everlasting legacy as a forerunner and role model,” the statement added."
  },
  {
    "headline": "Edo mobile court convicts 11 traders for selling on walkways, other unauthorized places – Nigerian Observer",
    "summarized_story": "Okunrobo, on Thursday, convicted 11 traders for disobeying the directive of the Edo State Government on selling on walkways and other unauthorized places.\nThe traders include Mr. Igwue Edwin, Mr. Andy Daniel, Mr. Ikechukwu Nkpuma, Miss Susan Mark, Mr. Daniel Erabhaghen and Mrs. Felicia Ade.\nOthers are Miss Inegbedion Philo, Miss Promise Obodoagwu, Miss Success Blessing, Ms. John Natabor and Ms. Usman Eva.\nEarlier, the State Counsel, Aigbokhaode Ayo Esq., told the court that the traders were seen either hawking or selling in unauthorized locations.\nEfosa said that the traders exposed themselves to danger, adding that they were served court notices to vacate the place and they refused."
  },
  {
    "headline": "Election Fraud: Court to rule on whether jailed professor deserves bail",
    "summarized_story": "Mr Agabi submitted a 16-page affidavit with three documents as exhibits to support the bail application on health grounds and pending appeal.\nHe stated that according to order 17 rule 13 of the Appeal Court, the court can grant bail to a convict relying on its discretion and the inherent powers vested on it.\nBut the INEC lawyer, Mr Onwuenwunor told the court that the professor, having been convicted, had lost his constitutional rights to bail.\nMr Ogban’s lawyer, Mr Agabi, was a lawyer in 2019 to Chris Ekpenyong, the man who defeated Mr Akpabio in the election.\nMr Agabi did not respond to calls and a text message seeking his comment for the report."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anti-corruption: NGO Sensitises Kaduna Schools, Markets, Communities",
    "summarized_story": "A non-governmental organisation (NGO), Legal Awareness for Nigerian Women (LANW) with support from MacAuthur Foundation under her Strengthening Accountability and Transparency in Nigeria Education Sector (STATNES) project, has taken campaign against all forms of corruption in the system to various schools, markets and communities in Chikun, Soba and Kaura local government areas of Kaduna State.\nThe executive director of LANW, Barrister Rebecca Sako-John, alongside her team, who embarked on the outreach, said the campaign against corruption in the society is needed now more than ever before considering the high rate of corruption in various segments of the society.\n“Some of the common causes of corruption in Nigeria are greed, poverty, economic Insecurity, lack of moral values, un-patriotism and storage wish to acquire material wealth.\nCorruption in Nigeria can be political, economical, Bureaucratic, Judicial, moral and electoral,” she said.\nShe called on government to tighten its grip on fiscal policy, monitor monetary policy, cut wasteful spending, restore public institutions to their past glories, repairs and build new infrastructures, strengthen law enforcement and anti-corruption agencies and ensure accountability in it’s tax management."
  },
  {
    "headline": "Anti-corruption: NGO Sensitises Kaduna Schools, Markets, Communities",
    "summarized_story": "A non-governmental organisation (NGO), Legal Awareness for Nigerian Women (LANW) with support from MacAuthur Foundation under her Strengthening Accountability and Transparency in Nigeria Education Sector (STATNES) project, has taken campaign against all forms of corruption in the system to various schools, markets and communities in Chikun, Soba and Kaura local government areas of Kaduna State.\nThe executive director of LANW, Barrister Rebecca Sako-John, alongside her team, who embarked on the outreach, said the campaign against corruption in the society is needed now more than ever before considering the high rate of corruption in various segments of the society.\n“Some of the common causes of corruption in Nigeria are greed, poverty, economic Insecurity, lack of moral values, un-patriotism and storage wish to acquire material wealth.\nCorruption in Nigeria can be political, economical, Bureaucratic, Judicial, moral and electoral,” she said.\nShe called on government to tighten its grip on fiscal policy, monitor monetary policy, cut wasteful spending, restore public institutions to their past glories, repairs and build new infrastructures, strengthen law enforcement and anti-corruption agencies and ensure accountability in it’s tax management."
  },
  {
    "headline": "2023: Ex-Borno Gov, Shettima, Advocates Power Shift To South",
    "summarized_story": "A former Borno State governor, Senator Kashim Shettima, has called for a power shift to Southern Nigeria in the 2023 general elections.\nShettima made the call in Abuja on Friday, during the public presentation of a book titled, ‘Standing For The Truth With Courage’, written by Prof.\nGadzama is the chairman of TETFund Research and Development Standing Committee.\nAfter power has resided in the North for eight years, there is need for a power shift to the South,” Shettima said.\nThe intelligent people of Nigeria have great potential together to develop this country,” he said."
  },
  {
    "headline": "2023: Ex-Borno Gov, Shettima, Advocates Power Shift To South",
    "summarized_story": "A former Borno State governor, Senator Kashim Shettima, has called for a power shift to Southern Nigeria in the 2023 general elections.\nShettima made the call in Abuja on Friday, during the public presentation of a book titled, ‘Standing For The Truth With Courage’, written by Prof.\nGadzama is the chairman of TETFund Research and Development Standing Committee.\nAfter power has resided in the North for eight years, there is need for a power shift to the South,” Shettima said.\nThe intelligent people of Nigeria have great potential together to develop this country,” he said."
  },
  {
    "headline": "NEMA Raises Alarm Over 2021 Flooding, Unveils Guidelines For Disaster Management",
    "summarized_story": "Director General of National Emergency Management Agency (NEMA) Mustapha Habib Ahmed, raised the alarm during the presentation of the Disaster Risk Management Implications of the 2021 Seasonal Climate Prediction and Annual Flood Outlook in Abuja yesterday.\nThe NEMA boss advised the state government and other stakeholders to immediately commence the education and enlightenment of residents on the impending flood which he said had greatest damage potential of all disasters.\nAt the same time, some southern states of Nigeria including Lagos and Ogun are expected to experience later than normal onset dates”.\nEmergency responders are always local and we must give them the right information to enable effective disaster risk communication.\nHe appreciated NEMA for supporting the installation of weather stations in Gombe, Keffi and Ado Ekiti noting that the equipment would further enhance seasonal forecast services in the country."
  },
  {
    "headline": "Nnamdi Kanu: Kenya unaware of IPOB leader’s arrest, says official",
    "summarized_story": "Also, an Official in the Kenya Ministry of Interior said that the ministry is not aware of the “extradition” of Nnamdi Kanu to Nigeria.\nThe PUNCH had reported that the circumstances of Kanu’s arrest have been a subject of media speculation in Nigeria.\nWhile some reports have named the United Kingdom, the Czech Republic, and Israel as countries where Kanu may have been in recent times, the IPOB leader’s family claimed that he was re-arrested in Kenya.\nAlso, Muteshi while dismissing the family’s claim told Kenya’s Nation that it was not possible to tell whether Mr Kanu had entered Kenyan territory.\n“We will continue to respect and honour the obligations,’’ he saidMohammed noted that the forensic investigation carried out so far had revealed a treasure trove of information on the proscribed IPOB leader and his collaborators."
  },
  {
    "headline": "Nnamdi Kanu: Kenya unaware of IPOB leader’s arrest, says official",
    "summarized_story": "Also, an Official in the Kenya Ministry of Interior said that the ministry is not aware of the “extradition” of Nnamdi Kanu to Nigeria.\nThe PUNCH had reported that the circumstances of Kanu’s arrest have been a subject of media speculation in Nigeria.\nWhile some reports have named the United Kingdom, the Czech Republic, and Israel as countries where Kanu may have been in recent times, the IPOB leader’s family claimed that he was re-arrested in Kenya.\nAlso, Muteshi while dismissing the family’s claim told Kenya’s Nation that it was not possible to tell whether Mr Kanu had entered Kenyan territory.\n“We will continue to respect and honour the obligations,’’ he saidMohammed noted that the forensic investigation carried out so far had revealed a treasure trove of information on the proscribed IPOB leader and his collaborators."
  },
  {
    "headline": "EFCC Arraigns Two In Rivers For Alleged N10.7m Oil Fraud",
    "summarized_story": "By JUMOKE SANNIThe Port Harcourt Zonal Office of the Economic and Financial Crimes Commission, EFCC, on Thursday, July 1, 2021 arraigned Chukwuma Samuel Kaniku and Muhammad Abdullahi before Justice S. I.\nIn view of their pleas, prosecution counsel, N. A. Dodo prayed the court to fix a date for commencement of trial.\nHowever, counsel to the 1st defendant, S. U. Amakiri made an oral application for the bail of the 1st defendant and it was declined by the court.\nAlso, counsel to the 2nd defendant, M. M. Suleiman, prayed the court for a short adjournment to enable him file an application for the bail of his client.\nJustice Mark ordered that the defendants be remanded in Port Harcourt’s Correctional Centre and adjourned the matter till July 14, 2021 for hearing of bail applications."
  },
  {
    "headline": "EFCC Arraigns Two In Rivers For Alleged N10.7m Oil Fraud",
    "summarized_story": "By JUMOKE SANNIThe Port Harcourt Zonal Office of the Economic and Financial Crimes Commission, EFCC, on Thursday, July 1, 2021 arraigned Chukwuma Samuel Kaniku and Muhammad Abdullahi before Justice S. I.\nIn view of their pleas, prosecution counsel, N. A. Dodo prayed the court to fix a date for commencement of trial.\nHowever, counsel to the 1st defendant, S. U. Amakiri made an oral application for the bail of the 1st defendant and it was declined by the court.\nAlso, counsel to the 2nd defendant, M. M. Suleiman, prayed the court for a short adjournment to enable him file an application for the bail of his client.\nJustice Mark ordered that the defendants be remanded in Port Harcourt’s Correctional Centre and adjourned the matter till July 14, 2021 for hearing of bail applications."
  },
  {
    "headline": "Kenyatta, Kenya not involved in Nnamdi Kanu’s arrest: High Commissioner",
    "summarized_story": "Kenya High Commissioner to Nigeria, Wilfred Machage on Friday denied his country’s involvement in the arrest of IPOB leader, Nnamdi Kanu.\n“I want to address this allegation by denying that Kenya was involved in the alleged arrest in extradition to Nigeria of Mr. Kanu.\n“I want to challenge anyone with facts relating to this alleged arrest in Kenya to present those facts.\nThis includes when, where, how and who was particularly involved in the alleged arrest.\n“We are also disturbed, dismayed and astonished by the unfortunate statement on the alleged arrest in Kenya which was carried in the dailies."
  },
  {
    "headline": "American sprinter Richardson slammed with one month ban",
    "summarized_story": "American sprinter Sha’Carri Richardson has accepted a one-month suspension after testing positive for cannabis, the United States Anti-Doping Agency said on Friday.\nThe positive test came at the U.S. Olympic trials last month where Richardson established herself as a gold medal contender by winning the 100m in 10.86 seconds.\nThe women’s 100m event in Tokyo starts on July 30, two days after Richardson’s minimum ban ends.\n“But when it comes to Sha’Carri Richardson there will never be a steroid attached to the name Sha’Carri Richardson.\nIf an athlete is willing to undertake an approved treatment programme in collaboration with their national anti-doping body, then the ban can be reduced to one month."
  },
  {
    "headline": "El-Rufai: Boko Haram, bandits should not get Nnamdi Kanu’s treatment",
    "summarized_story": "By Muhaimin OlowoporokuKaduna State Governor, Nasir El-Rufai has said that Boko Haram terrorists, Bandits should not be treated with the same swiftness applied to leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nHe said this while explaining that the way bandits and Boko Haram terrorists operate is different from the way Nnamdi Kanu’s led IPOB operates.\nHe also said bandits don’t have a centralized leadership like the IPOB which is under the command of Nnamdi Kanu.\nAsked if Boko Haram and bandits should be treated with the same swiftness that led to Kanu’s arrest, El-Rufai said, “No!\n“Let’s take Boko Haram for instance."
  },
  {
    "headline": "Kenyan Government Denies Being Involved In Kanu’s Arrest",
    "summarized_story": "The Kenyan government has denied involvement in the arrest and extradition to Nigeria of Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nKenyan authorities have stated that they are unable to confirm whether Nnamdi Kanu was arrested in the East African country.\nRecall that Nigerian authorities hinted that Nnamdi Kanu was apprehended in London, United Kingdom, before being extradited to Nigeria.\n“I can’t know that,” Mr Muteshi told Kenyan Newspaper, Nation, when asked whether the claims made by the family were true.\nAccording to the newspaper, Kenyan Government Spokesperson Cyrus Oguna refused to comment on the situation."
  },
  {
    "headline": "Igboho Should Be Thankful Buhari’s Government Only Planted Guns, Not Bombs In His House — Deji Adeyanju",
    "summarized_story": "Deji Adeyanju, a human rights activist, claims that the Nigerian government planted firearms at the home of Yoruba independence hero Sunday Adeyemi, also known as Sunday Igboho.\nDeji revealed this in a tweet condemning the government’s security operatives’ killing of two individuals in Igboho’s home.\nHe further stated that Igboho should be grateful that government operatives had planted guns in his home rather than bombs.\n“Igboho should be thanking God that it is only guns they planted in his house and not bombs.\n“This hopeless government killed 2 people in Igboho’s house and they are acting like they didn’t committed any crime today,” he said."
  },
  {
    "headline": "Sunday Igboho: Yoruba Nation Lagos Rally Will Hold – Co-organisers Dare Police",
    "summarized_story": "Ilana Omo Oodua (IOO), a co-organizer of the Yoruba Nation demonstration, has promised to go ahead with or without Sunday Igboho.\nAfter Nigerian forces invaded his residence in the Soka neighborhood of Ibadan on Thursday, Igboho called off the march.\nA source in the IOO, a body of self-determination Yoruba groups, told DAILY POST that the rally will go on as planned.\nI am telling you now that the Yoruba Nation rally will hold.\n“The Ilana Omo Oodua under the leadership of Professor Akintoye already made it clear that we will come out,” he said."
  },
  {
    "headline": "REVEALED: Identity Of One Of Sunday Igboho’s Aides Killed By DSS During Raid On His House",
    "summarized_story": "Two men were killed but the identity of the other has yet to be ascertained at the time of filing this report.\nAlso, Koiki alleged that only one of the men was shot at while the other was butchered to death by the DSS.\nHe wrote, “May your soul rest in peace, killed by DSS working for Nigeria government during the attack on Chief Sunday Igboho house on the 1st of July 2021.\nThey killed him in cold blood.”Meanwhile, the DSS confirmed the attack on Igboho’s house stating that they killed two allies of the Yoruba rights activist, during the invasion of his residence in Ibadan, Oyo state.\nHe also declared Igboho wanted, urging him to report to the nearest police station."
  },
  {
    "headline": "Local Covid-19 vaccines: AfDB’s initiative Nigerians’ applause",
    "summarized_story": "BENJAMIN SAMSON in this report examines the move by the African Development Bank (AfDB) to support local production of Covid-19 vaccines in Nigeria and other African countries.\nWhile we are working to develop our own vaccines, Nigeria is exploring options for licensed production, in collaboration with recognised institutions.\nWe are also exploring the option of local production of the vaccines in the country,” he said.\nThe last time any human vaccine was produced at the Federal Vaccine Production Laboratory was in 1991.\nThe only laboratory for human vaccine production is at Yaba, Lagos, but it has not been functional for many years now."
  },
  {
    "headline": "Breaking: Activist, Sunday Igboho, makes u-turn on Yoruba nation rally in Lagos",
    "summarized_story": "Despite the Department of State Security (DSS) raid on residence of Yoruba Nation Agitator, Chief Sunday Adeyemo popularly known as Sunday Igboho, the Yoruba Nation rally in Lagos will go on as planned.\nBut Lagos Commissioner of Police, CP Hakeem Odumosu warned Igboho and other agitators not to stage any rally in Lagos.\nHe stated that anyone caught participating or facilitating the rally would be dealt with within according to the law.\nHe said: “I can still confirm officially that the Lagos rally in as much as whatever news or rumours you’ve been listening to from different outlets, will go as planned“The 3rd of July Mega rally will go as planned.\n“The rally in Lagos is going to be a peaceful rally, it is going to be a mega rally, do not be disturbed about what happened."
  },
  {
    "headline": "Kanu will get fair deal he denied others, FG assures",
    "summarized_story": "The Nigerian government Thursday assured Nigerians and the international community that the rearrested leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, will be given fair trial.\nAssurance on fair trialAddressing journalists in Abuja, Minister of Information and Culture Lai Mohammed assured the IPOB leader would be given fair trial while the case lasts.\n“We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators.\nDecapitate them,” the letter further quoted Kanu’s alleged instructions to IPOB members.\nBelow is a list of IPOB attacks in the South East/South South Zones as contained in the letter:1."
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Igboho’s Men Engaged Us In Gun Battle, Says DSS",
    "summarized_story": "The Department of State Services (DSS) claims men suspected to be guards of Sunday Igboho engaged operatives of the agency in a gun battle during a raid on the home of the Yoruba Nation agitator in Ibadan on Thursday morning.\nThis is according to the DSS spokesman, Peter Afunanya, who stated this during a press conference on Thursday following the arrest of 13 of Igboho’s armed men by a team of joint security operatives.\n“On approach to his residence, the team came under heavy gun attack by nine men suspected to be Igboho’s guards.\n“In the course of the exchange, two of the armed men were gunned down, while the rest were subdued and arrested.\nSunday Adeyemo, aka Sunday Igboho, is now on the run.”While noting that two of Igboho’s men were killed, the secret service said DSS operative sustained injuries."
  },
  {
    "headline": "We Will Hold ‘Yoruba Nation’ Rally In Lagos On Saturday – Ilana Omo Oodua",
    "summarized_story": "The umbrella body of Yoruba Self-Determination Groups, Ilana Omo Oodua (IOO), has confirmed that the pro-Yoruba nation’s rally scheduled to hold in Lagos State on Saturday, July 3, will still take place.\n“Our rally scheduled to hold on Saturday will still hold without any fear or intimidation and we promise to be peaceful like we have always been,” Adeleye said.\nMeanwhile, the IOO, in another letter to the Lagos State Commissioner of Police, Mr. Hakeem Odumosu, and copied to the Governor of Lagos State, Mr. Babatunde Sanwoolu by its General Secretary and Legal Adviser, Arc.\nOlasupo Ojo respectively, urged the state Police Command to ensure that the rally is peaceful, orderly and not hijacked by hoodlums as earlier insinuated by the police.\nOn our own part, we promise to cooperate with the police towards ensuring that the rally is peaceful and orderly,” the statement added."
  },
  {
    "headline": "PHOTOS: DSS Confirms Raid On Igboho’s House, Parades 13 Suspected Armed Yoruba Nation Agitators",
    "summarized_story": "The Department of State Services (DSS) on Thursday said a team of joint security operatives raided the home of Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho in Ibadan, arresting 13 of his armed men.\nHe said the raid was based on intelligence that Igboho was stockpiling arms to cause chaos within the region.\nAfunanya said when the security operatives approached the house, they were attacked by nine of Igboho’s boys who engaged them in a gun duel but were subsequently overpowered.\nBelow are photos of items recovered from Igboho’s house.\nREAD ALSO: Gunmen ‘Invade’ Sunday Igboho’s House, Again – AideREAD ALSO: Attack On Sunday Igboho A Sad Reminder Of What Nigerians Went Through Under Abacha – AfenifereA full communique regarding the joint operation at Igboho’s house appears below."
  },
  {
    "headline": "Nigeria-UK Discuss Electoral Act Amendment, PIB And Twitter Ban",
    "summarized_story": "The meeting which lasted for almost an hour served as a platform for discussing bilateral issues relating to Asset Recovery, Anti-corruption crusade, amendment of the Electoral Act, the Audit Bill, Petroleum Industry Bill, Twitter ban, and counter-terrorism approaches.\nHe said to strengthen the fight against corruption the government came up with the Proceeds of Crime Bill and Audit Bill among others.\nHe maintained that the interest of Nigerian interest matters most for any company that wants to do business in the country.\n“If you want to operate as a business entity in Nigeria, you must do so within the context of Nigerian laws.\nNothing offensive and nothing that breaches the Nigerian laws should be entertained”."
  },
  {
    "headline": "Ondo Assembly Passes Anti-Grazing Bill, Two Others",
    "summarized_story": "The Ondo State House of Assembly on Friday passed a bill to regulate security, rearing and grazing of livestock and establishment of ranches.\nThe Chairman House Committee on Agriculture, Honourable Taofeek Oladele observed that the bill when passed into law will prevent the destruction of farm crops in the state.\nAfter a thorough debate on the bill, it was considered necessary for approval and the Speaker, Rt.\nHonourable Bamidele Oleyeloogun ruled in favour of the bill after a voice vote.\nThe lawmakers also passed two other bills into law: the judicial autonomy bill as well as the Violence Against Persons Prohibition (VAPP) bill."
  },
  {
    "headline": "Police rescue 9 kidnap victims in Katsina State",
    "summarized_story": "Katsina state police command has rescued nine people kidnapped by bandits at mahuta ward of Dandume local government on Thursday 7th of July.\nThe bandits riding on motorbikes invaded kirijam village in the late hours of Thursday and catered away with valuables and held nine people hostage.\nOn receipt of the report, the Divisional police led a team of operatives to ambush the criminal’s on their way back to the forest and engaged them into a fierce gun duel and successfully repelled them.\nAccording to a press release issued by the public relations officer of the command Gambo Isa; the doggedness, and courage of the police team made the bandits abandon the victims and items stolen and flee into the forest with varying degrees of bullet wounds.\nAdvertisementThe victims were not harmed and have since been reunited with their families."
  },
  {
    "headline": "Notorious criminals killed in gun battle with security agents in Kogi State",
    "summarized_story": "Vigilantes and hunters have killed two suspected kidnappers early on Friday at Olamaboro Local Government area of Kogi through their combined efforts.\nThe operation is part of the renewed onslaught by security agents on criminal activities in Kogi State.\nThe operation which was coordinated by the chairman of Olamaboro Local government council Honourable Adejoh Friday Nicodemus witnessed an end to the group of criminals terrorizing the people of Olamaboro Local government area.\nAccording to reports, one of the suspect identified as Lawal Isa aka Osama from ofugo okpo in the said locality was killed during a gun battle with the operatives while others were nabbed and handed over to respective authorities.\nThe CPS noted that Government at all levels would continue to make efforts towards sustaining the drive for a peaceful Kogi state by making every nooks and crannies of the state unsafe for criminal elements and their sponsors."
  },
  {
    "headline": "BREAKING: Kenyan Govt denies involvement in arrest, extradition of Nnamdi Kanu",
    "summarized_story": "Kenyan government has denied involvement in arrest and extradition of the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu.\nAt a press briefing, the Kenyan High Commission in Nigeria, Wilfred Machage, said it is to fuel antagonistic attacks between Nigeria and Kenya."
  },
  {
    "headline": "Yoruba Nation Activist Sunday Igboho Has Been Declared Wanted – Trending with Ojy Okpe",
    "summarized_story": "Nigerians have reacted to the raid of the residence belonging to Yoruba Activist , Sunday Adeyemo , Popularly Known as Sunday Igboho, in Oyo State by the Department Of State ServicesThe house of representatives on Thursday was thrown into a rowdy session after members rejected a motion to lift the “indefinite” suspension ..of the operations of Twitter in Nigeria.\nIn another development, Russian, President Vladimir Putin on Thursday signed a new law that mandates foreign tech companies, including social media giants, Facebook and Twitter to open physical offices in the country.\nThe sharia law enforcement outfit, Hisbah Police on Wednesday , announced a ban on the use of mannequins to display clothes by tailors, in supermarkets and boutiques in Kano state, Northwest Of Nigeria."
  },
  {
    "headline": "Favourites Clash as Belgium Battle Italy for Euro Semi-final Spot in Munich",
    "summarized_story": "Belgium and Italy will go head-to-head for a spot in the Euro 2020 semi-finals when they meet in Munich for their quarter-final tie on Friday.\nTwo teams that have each won a record 14 games in a row in the European Championship,” Martinez added.\nBut the prospect of facing Belgium, who have also won four out of four games at Euro 2020, does not mean Mancini will adopt more conservative tactics.\nItaly have reached the quarter-final of the European Championship for a fourth consecutive tournament.\nIndeed, that accounts for three of Italy’s five European Championship penalty shootouts – more than any other nation prior to the 2020 edition."
  },
  {
    "headline": "Covid: Australia to Halve Arrivals and Trial Home Quarantine",
    "summarized_story": "Australia will halve the number of international arrivals it accepts after Covid outbreaks put half the population in lockdown this week.\nVirus leaks from hotel quarantine – which is mandatory for all arrivals – have been the source of numerous outbreaks across the country.\n“We have seen breaches occur, predominantly as a result of infection control procedures and human error… those issues need to continue to be strengthened,” Mr Morrison said.\nThe Delta outbreaks prompted emergency talks between the prime minister and state and territory governments.\nMr Morrison reiterated on Friday that all Australians would be able to receive their first dose by the end of 2021."
  },
  {
    "headline": "OPEC Defers Decision on Oil Output Cuts",
    "summarized_story": "Earlier, there were expectations that the cartel could boost production output by another 400,000 barrels beginning in August, an increase seen as likely to be easily absorbed by the market amid expectations for rising demand.\nAt the inconclusive meeting, the OPEC+ ministerial committee had proposed the planned increase to the wider group, but a disagreement between Saudi Arabia and Russia, the biggest producers in the OPEC+ alliance, remained largely unresolved.\nBefore the deferment of the meeting, oil prices reacted with Brent crude trading above $75 a barrel, close to a two-and-a-half-year high as the policy from August to December was being awaited.\nWhile the full house decided to shift a definitive decision on the matter till today, OPEC had earlier finished its meeting just before an OPEC+ ministerial committee met after that, before the inconclusive one by OPEC+ ministers.\nHe, however, stated that OPEC still sees growth in the second half of the year."
  },
  {
    "headline": "Twitter’s Suspension In Nigeria’s National Interest, Attorney-General Malami Insists",
    "summarized_story": "The Attorney-General of the Federation (AGF) and Minister of Justice, Mr. Abubakar Malami on Thursday insisted that the suspension of Twitter’s operations in Nigeria was informed by the need to protect the national interest.\nMalami stated that the interest of Nigeria is paramount in all considerations and must be respected by any company that wants to do business in the country.\nOn PIB, the minister said steps had been taken to ensure pending bills were transmitted to President Muhammadu Buhari for assent.\nHe said to strengthen the fight against corruption, the government came up with the Proceeds of Crime Bill and Audit Bill, among others.\nLaing thanked the minister for the “clarification” of the issues, saying that the steps taken in the fight against corruption and electoral reforms are “really encouraging.”THISDAY"
  }
]