[
  {
    "headline": "Ebute Metta: Buhari laments frequent building collapse, condoles with victims’ families",
    "summarized_story": "), on Monday, commiserated with families of those who died, sustained injuries, and were affected in the building collapse at Ebute Metta area of Lagos State, with search and rescue still ongoing at the site.\nHe also lamented the “embarrassing” frequency of building collapse in the country.\nThis comes after a three-storey building collapsed on Sunday night at 32, Ibadan Street, Ebute Metta, Lagos.\nBuhari’s condolence message is contained in a statement signed on Monday by his Special Adviser on Media and Publicity, Femi Adesina.\nThe statement is titled ‘President Buhari condoles with victims of Lagos building collapse’."
  },
  {
    "headline": "Spanish PM, defence minister phones tapped, presidency says",
    "summarized_story": "Spain said, on Monday, that the mobile phones of Prime Minister Pedro Sanchez and Defence Minister Margarita Robles were tapped using Pegasus spyware in an “illicit and external” intervention.\n“It is not a supposition, they are facts of enormous gravity,” the minister of the presidency, Felix Bolanos, said, confirming the news.\nBolanos said that Sanchez’s phone had been tapped in May 2021 and Robles’ in June of the same year.\n“There is no evidence that there was another tapping after those dates.”Pegasus spyware silently infiltrated mobile phones to extract data or activate a camera or microphone to spy on their owners.\nCatalan separatists had accused Spain’s intelligence services of using spyware to snoop on their mobile phones, reviving tensions with Sanchez’s minority leftist government, which relied on their support to pass legislation."
  },
  {
    "headline": "Eid-el-fitr: Ensure maximum security in Lagos, IPAC tells Sanwo-Olu",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos StateThe Inter- Party Advisory Council (IPAC), Lagos State, has urged Gov.\nBabajide Sanwo-Olu to tighten security around the state on the occasion of the 2022 Eid-el-fitr celebration.\nWishing all Islamic faithful a happy celebration, IPAC in a statement on Monday by its Chairman, Mr Olusegun Mobolaji, said the state government should not loose guard on security.\n“We call on the state government to ensure there is maximum security for life and property.\n“All security agents and forces should be well mobilised and coordinated to maintain safety and peace all round the state,” Mobolaji said."
  },
  {
    "headline": "Eid-el-Fitr: Okowa felicitates with Muslims",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has sent message of felicitations to Muslims in the state, Nigeria and all over the world on the occasion of Eid-el-Fitr celebrations.\n“I felicitate with all Nigerians, especially our Muslim brothers and sisters on the auspicious occasion of this year’s Eid-el-Fitri celebrations.\nI congratulate all of our countrymen and women who have successfully undertaken the purifying Ramadan fasting.\n“On behalf of my family, the government and people of Delta State, I extend our warmest wishes to Muslims in Delta State, Nigeria and across the world celebrating Eid-el-Fitr.\n“As Muslims celebrate in Nigeria, it is important to remind Nigerians of the importance of respecting all faiths and beliefs."
  },
  {
    "headline": "Allow peace to reign in Nigeria- Sultan urges Politicians",
    "summarized_story": "Alhaji Sa’ad Abubakar III, the Sultan of Sokoto and President General, Nigeria Supreme Council for Islamic Affairs (NSCIA), has urged Nigerian Politicians to allow peace to reign in the country.\nAbubakar made the call on Monday in his Eid-el-fitr Sallah message to Nigerians in Sokoto.\nHe said politicians in the country should play the game of politics with faith, love to one another and ensure none of their supporters was involved in breaching the peace and unity of Nigeria.\nThe Sultan also urged the Muslim Ummah to continue to appreciate the Almighty Allah for the gift of life to witness the month of Ramadan.\nHe felicitated with the Muslim Ummah on the Eid-el-fitr celebration, while urging Nigerians to continue to pray for peace and peaceful coexistence across the country."
  },
  {
    "headline": "MayDay: Akwa Ibom workers give condition to support flagbearers in 2023",
    "summarized_story": "Speaking at the event, Chairperson of the Nigeria Labour Congress (NLC) Akwa Ibom State Council, Comrade Sunny James, explained that the organised Labour took the decision during its conference held recently ahead of the 2022 celebration.\n“Those of them that will not come to tell us what they would do for Akwa Ibom workers, we will mobilize against them.\nTherefore, your Excellency that is our major thrust of today’s May Day in Akwa Ibom State.\nSimilarly, Chairman of the Trade Union Congress( TUC) Akwa Ibom State CouncilComrade Dominic Abang expressed concern over unwarranted statements by some political aspirants and their supporters ahead of parties primaries.\nEmmanuel reiterated his administration’s commitment to the workers welfare, notingthat regular and prompt payment of salaries and pensions even when circumstances were very challenging, demonstrated that the interest and welfare of Akwa Ibom workers remained supreme and enduring."
  },
  {
    "headline": "MNJTF kills 22 terrorists in Lake Chad",
    "summarized_story": "By Kingsley OmonobiAbuja—Twenty-two Boko Haram terrorists have been neutralised by troops of the Multi-National Joint Task Force, MNJTF, following mounted offensives on criminals’ hideouts in Lake Chad.\nThe Chief of Military Public Information, HQ MNJTF N’Djamena Chad, Lieutenant Colonel Kamarudeen Adegoke, made this known in a statement.\n“With multiple sorties against the terrorists’ positions, Air Task Force gave effective close air support and attacked the criminals to enable ground forces to access the hitherto well-defended terrorists’ strongholds in the vicinity of Tumbun Rago.\n“Despite strong resistance by the Boko Haram Terrorists (BHTs), the ground troops charged through several obstacles and cleared the mined routes which made them come in contact with elements of the BHTs.\nIt added, “The TF continued to the Kirta Wulgo and Tcholl settlements suspected to have Boko Haram terrorists hibernating there but the terrorists fled before the arrival of our troops."
  },
  {
    "headline": "2023 elections: Sultan of Sokoto sends message to Nigerian politicians",
    "summarized_story": "The Sultan of Sokoto and President-General, Nigeria Supreme Council for Islamic Affairs (NSCIA), Alhaji Sa’ad Abubakar III, on Monday urged Nigerian politicians to allow peace to reign in the country ahead of the 2023 general elections.\nAbubakar made the call in his Eid-el-Fitr Sallah message to Nigerians on Monday in Sokoto.\nHe said politicians in Nigeria should play the game of politics with faith, love each other and make sure none of their supporters was involved in breaching the peace and unity of Nigeria.\nAbubakar said, “We are fully aware that the general elections in Nigeria is fast approaching.\n“This is a great opportunity for all of us to ensure the best living conditions and to live peacefully with one another.”"
  },
  {
    "headline": "AGF, NJC, NASS, RMAFC dragged to court over judges’ poor salaries",
    "summarized_story": "The Attorney-General of the Federation (AGF), National Judicial Council (NJC) and the National Assembly (NASS) have been dragged before a Federal High Court in Abuja over poor wages being paid to judges.\nA Senior Advocate of Nigeria SAN, Chief Sebastiane Hon, who sued them, is praying the court to compel them, alongside the Revenue Mobilisation Allocation and Fiscal Commission (RMAFC), to increase the salaries and allowances of judges in the country.\nThe suit by the senior lawyer is marked: FHC/ABJ/CS/595/2022 and filed in his capacity as a concerned legal practitioner in Nigeria.\nThe court action has the National Assembly, the RMAFC, the AGF and NJC as defendants.\n“The naira has considerably lost its value over time; but judicial officers in Nigeria have been placed on the same salary scale for up to 12 years, namely since 2008,” he said."
  },
  {
    "headline": "Polygamy crime against humanity, not God – Pastor Giwa",
    "summarized_story": "While stressing that polygamy is a crime against humanity, the popular Pastor maintained that engaging in the act will not pit a man against God.\nThe pastor further maintained that all a man needs to gain the kingdom is to serve God wholeheartedly and diligently.\nAny law that is against polygamy in the bible, originated from people not from God.\nSo he produced Methuselah, Methuselah produced Lamech who started polygamy in the bible.\n“Polygamy is a crime against humanity, not against God."
  },
  {
    "headline": "War: Russia suffers another major blow amid battle with Ukraine",
    "summarized_story": "Russia has suffered another major blow amid its ongoing war with Ukraine.\nNew Zealand’s government on Monday announced further sanctions against Russia, targeting members of the political elite as well as the country’s defense sector as a response to Moscow’s war in Ukraine.\nThe new round of sanctions targets 170 members of the Federation Council — the upper house of Russia’s parliament.\nIt also includes six companies and organizations “which have contributed to the assault” in Ukraine, CNN reports.\nRecall that New Zealand had last month announced sanctions on Russian banks and financial institutions as a response to Moscow’s war in Ukraine."
  },
  {
    "headline": "‘Okorocha digging his political grave, destruction, tried joining us’ – IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Monday, said the Imo West Senator, Rochas Okorocha, is digging his political grave.\nEmma Powerful, the group’s spokesman, said Okorocha is digging his grave by attempting to use IPOB for politics.\nPowerful said Okorocha tried severally to be part of IPOB but was denied, hence his recent rant against the group, which would lead to his destruction.\n“Okorocha has tried so many times to be part and parcel of IPOB to decide the way forward in the movement, but IPOB leadership refused to accept him.\nRochas Okorocha and his likes will be there watching IPOB actualise Biafra freedom and independence from the oppressive Nigerian state."
  },
  {
    "headline": "Two more bodies recovered from collapsed building",
    "summarized_story": "Two more bodies have been recovered from the collapsed three-storey building at Ebute Meta bringing the death toll to eight.\nThe deceased, comprising five males and three females, were all recovered Monday morning, hours after the building collapsed.\nThe owner of the building has narrated how he asked all occupants to quit but they refused.\nThe man, who inherited the property from his father, told emergency workers at the scene that he had to vacate the house and rented accommodation nearby when it was discovered to be defective.\nHe said he gave all the tenants quit notice and had not collected rent since then."
  },
  {
    "headline": "BREAKING: FIFA fines Nigeria over MKO World Cup fracas",
    "summarized_story": "World soccer ruling body, FIFA, has imposed a 150,000 Swiss Franc (about 154,128.75 USD) fine on Nigeria following the unruly behaviour of the fans at the end of the second leg Qatar 2022 World Cup play-off between the Super Eagles and Black Stars of Ghana at the Moshood Abiola Stadium on March 29.\nThere was reported break of law and order after the ill-fated 1-1 draw encounter as the Black Stars edged Nigeria out of the Qatar 2022 race on the away goals rule.\nRead Also: FIFA launches streaming football serviceIn a dispatch by FIFA, the body’s Disciplinary Committee decried the poor organisation of the match for lack of order and security at the match, adding there was ‘failure to implement existing safety rules and failure to ensure that law and order are maintained in the stadium, invasion of the field of play and throwing of objects’.\nApart from the 150,000 CHF fine, Nigeria will play its next home match without fans.\nDetails Shortly…"
  },
  {
    "headline": "Obaseki increases minimum wage to N40,000",
    "summarized_story": "Edo State Governor Godwin Obaseki yesterday increased the minimum wage to N40,000.\nOne of the protesting pensioners, Irene Aiguobarueghian, said life had become unbearable for the retirees, urging Obaseki to specially consider their plight.\nWe took interest in payment of outstanding pensions to our pensioners, in spite of the fact that these pensions were owed by the previous administration.\nObasaeki said: “As we all know, the minimum wage of N30,000 can barely sustain a family.\n“The government of Edo State has decided to review the minimum wage for Edo workers from N30,000 to N40,000 a month."
  },
  {
    "headline": "Lagos APC: we don’t recognise Ambode campaign group",
    "summarized_story": "The All Progressives Congress (APC) in Lagos State yesterday described the activities of a faceless organisation, ‘Akinwunmi Ambode Campaign Group,’ as a distraction.\nLagos APC, in a statement by its Acting Publicity Secretary, Yesiro Karamo, wondered why it had taken three years after the ouster of the Ambode administration for such a group to spring up and claim relevance.\n“It is distasteful and unacceptable for a group purportedly committed to our party to take on the role of the opposition.\n“In their absence, the party successfully conducted congresses at the ward, local, state and national levels to fill party offices.\n“The process of reconciliation in Lagos State is also making steady progress."
  },
  {
    "headline": "Six presidential, 63 governorship aspirants pick APC forms",
    "summarized_story": "Also, no fewer than 63 governorship aspirants have picked nomination forms.\nThe ruling party began the sale of nomination forms to presidential, governorship and federal parliamentary aspirants on Tuesday, April 26.\nUnder the APC guidelines, female and Persons with Disability (PWD) aspirants are to purchase the expression of interest forms while nomination forms are free.\nThey include: Lagos State Governor Babajide Sanwo-Olu, , Ogun State Governor Dapo Abiodun, Yobe State Governor Mai Mala Buni, Zamfara State Governor Bello Matawalle of Zamfara and his Nasarawa State counterpart, Abdullahi Sule.\nOthers are Kwara State Governor AbdulRahman AbdulRazaq, Gombe State Governor Muhammad Inuwa Yahaya and Governor Babagana Zulum of Borno state."
  },
  {
    "headline": "UPDATED: 8 bodies recovered, 23 rescued alive as Lagos three-storey building collapses",
    "summarized_story": "By Job OsazuwaEight persons have been confirmed dead as a three-storey building collapsed at 24 Ibadan Street Off Murtala Mohammed Way, in the Ebute Metta area of Lagos State.\nNo fewer than 23 persons including children were said to have been rescued alive, leaving some of them with varying degrees of injuries.\n“However, the building has been re-sealed and occupants evacuated by officers of Lagos State Buildings Control Agency.\nHe said: “On arrival at the incident scene, an old three-storey building comprising rooms and parlour was discovered to have collapsed.\nLASEMA’s Public Relations Officer, PRO, Mr. Nosa Okunbor said out of the 23 rescued alive by the emergency responders, 22 were males."
  },
  {
    "headline": "8 dead in Lagos building collapse",
    "summarized_story": "By Job OsazuwaAt least eight persons have been recovered from the rubble of a three-storey building that collapsed in the late hours of May 1 at 24 Ibadan Street off Bonny Way, Ebute Metta, Lagos.\nConfirming the incident, the director general of Lagos State Emergency Management Agency (LASEMA), Mr. Olufemi Damilola Oke-Osanyintolu said: On arrival at the incident scene, an old three-storey building comprising rooms and parlous was discovered to have collapsed.\nFurther information gathered revealed that the incident occurred at about 10.56pm with as yet undetermined number of people trapped.\nThe eight deaths so far, according to him, are three females and five males, adding that 23 persons have been rescued alive from the ill-fated building.\nHe said more occupants might still be trapped, while rescue operation continues till the responders get to ground zero."
  },
  {
    "headline": "Collapsed building: 23 rescued alive-NEMA",
    "summarized_story": "Twenty Three persons have been rescued from the rubble of a collapse building in the Ebute Metta area of Lagos, the National Emergency Management Agency, NEMA, confirmed in the early hours of Monday.\nNEMA spokesman Ibrahim Farinloye in a WhatsApp message said, of the 23 persons rescued, seven were children and 16 were adults, adding that the rescued persons have been given medical attention and undergoing psycho –social and trauma counseling.\nMany people are said to have been trapped in the rubble of the collapsed building, but NEMA said that its operative have been working all through to ensure help gets to the victims.\nOperatives of NEMA, the Lagos State Fire and Rescue Service, the Lagos State Ambulance Service (LASAMBUS), and the Lagos State Building Control Agency (LASBCA) are currently at the scene of the accident.\nAccording to NEMA, search and rescue is still on going100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "2023 automatic tickets: APC senators’ bid faces setback",
    "summarized_story": "From Fred Itua, AbujaStrong indications have emerged that the All Progressives Congress (APC) National Chairman, Abdullahi Adamu, has sealed the fate of some returning federal lawmakers.\nAlready, over 70 per cent of incumbent senators and members of the House of Representatives elected on APC platform have indicated interest to re-contest.\nHowever, their fate, especially senators who represent outgoing governors, have reportedly been sealed by Adamu-led National Working Committee (NWC).\n“I think APC National Assembly members deserve a special treat as the speaker said.\nHe said in states where APC has serving governors, fates of lawmakers’ return will be determined by them, while former governors in states where APC is not in charge may likely determine who gets the party’s tickets at various levels."
  },
  {
    "headline": "Charles Mba, Ebuka Okafor upbeat about The Sun awards",
    "summarized_story": "Chairman/CEO, CDV Properties & Development Limited, Charles Mba, and chairman, Vixa Pharmaceuticals Limited, Ebuka Okafor, have exuded excitement over The Sun awards they would receive on Saturday, May 7, 2022.\nMba and Okafor would be honoured with The Sun Investor of the Year and The Sun Industrialist of the Year awards respectively at the Expo Convention Centre, Eko Hotels & Suites, Victoria Island, Lagos.\nDescribing his recognition as an honour he would live to remember, Mba commended the Sun for sustaining the high standard of the awards.\nEarlier, The Sun MD said the selection of Mba and Okafor as Investor of the Year and Industrialist of the Year respectively was based on merit.\n“These include CDV Mini Estate, Whiteoak Estate, Southlake Homes Phase 1, 2 and 3, Diank Terraces, and Applewood Estates, among others."
  },
  {
    "headline": "2023: Two Groups Move to Stop PDP Convention over Power Rotation, Zoning",
    "summarized_story": "The kernel of their cases are that the PDP over the years had a tradition of power rotation and zoning.\nThe PDP had fixed May 28, for the conduct of its presidential primary election and to that effect screened the 17 aspirants who obtained the presidential form to run in the 2023 election.\nAs of last week, it was obvious that the PDP was not considering zoning its Presidential ticket to the south as being clamoured by southern governors and other leaders in the zone.\nThe PDP asked the court to strike out the suit for want of jurisdiction and also dismiss it for being “statute-barred”.\nIt is the ruling party that should be concerned with zoning, but not the PDP."
  },
  {
    "headline": "RenCap: With Oil Prices above $100 Per Barrel, Impact on Budget will Be Negligible",
    "summarized_story": "Emmanuel Addeh in AbujaA new report by Renaissance Capital (RenCap), a frontier market investment company, has stated that despite crude oil prices at over $100 per barrel, the impact on Nigeria’s fiscal position would remain negligible due to petrol subsidy payments and falling oil production by the country.\n“This implies that Nigeria has a $3 billion net benefit for every $10 per barrel change to the oil price (Brent),” it stated.\nRenCap said in the report, “An 80 per cent increase in the oil price, from $41/bbl to $72/bbl, reduced the budget deficit by about 1 ppt only.\nWe attribute the widening of the deficit in 2021, despite the high oil price, to the fall in production that countered the price effect.\n“Below this price,” it stated, “the government’s take of oil proceeds is fully remitted and not undermined by petrol subsidy deductions."
  },
  {
    "headline": "Anyim: South-east’s Most Important Demand is Reintegration",
    "summarized_story": "And I replied, the most important single demand of the south-east from Nigeria is reintegration.\n“Once they feel that they have been fully reintegrated into Nigeria, all agitation will naturally be extinguished.\nAnd eventually, when one of them became the president of the country, that agitation died out.\nIn fact, not when he became president, immediately he became vice president of Nigeria, that agitation died out.\nI believe that if a South-easterner becomes the president of Nigeria, that agitation will die,” he said."
  },
  {
    "headline": "Outrage over APC’s Indecision on Zoning of 2023 Presidency",
    "summarized_story": "Rotimi Amaechi, yesterday said he would support President Muhammadu Buhari and APC’s preferred candidate for the 2023 presidential election.\nIn its reaction to APC’s indecision on zoning, PANDEF described Adamu’s claim as careless and ill-considered.\nAs the leader of the country and the leader of the APC, President Buhari must demonstrate strong courage by ensuring that power is moved to South-east after him,” the organisation noted.\nThe organisation, however, warned that anything outside zoning the presidency to the South-east zone would not only boomerang but threaten the nation’s very existence.\nI will Support Whoever is Buhari, APC’s Choice, Says AmaechiIn another development, the Minister of Transportation, Amaechi, yesterday said he would support President Buhari and APC’s chosen candidate for the 2023 presidential election."
  },
  {
    "headline": "Abdullahi Adamu: No Decision Yet on Zoning of APC’s Presidential Ticket",
    "summarized_story": "The PDP likewise screened all its 17 presidential aspirants yesterday and disqualified two aspirants – Dr. Nwachukwu Anakwenze and Cosmas Ndukwe.\nThe APC swapped its national offices between North and South, leading to the emergence of Adamu from the North-central as the National Chairman in March.\nToday, for me, just as an example, to contest the national chairman of our party, I had to pay N20 million.\nFive of the presidential aspirants have so far paid N100 million and picked up their forms.\nWe don’t foresee any opposition in the contest.”PDP Screens Presidential AspirantsThe PDP yesterday screened all its presidential aspirants ahead of its National Convention slated for May 30."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "Soyinka Visits Sunday Igboho In Benin Republic, Holds Closed-door Meeting With Agitator, Professors Akintoye, Adeniran",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, on Sunday visited the Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, in Cotonou, Benin Republic.\nSoyinka also held a closed-door meeting with the Yoruba Nation Leader and the coordinator of the Ilana Omo Oodua group, Prof Banji Akintoye, as well as his deputy, Prof Wale Adeniran, in the city.\nSoyinka said he had always wanted to see Igboho, to \"sympathise with his predicament\".\nPHOTONEWS: Wole Soyinka, Wale Adeniran and Banji Akintoye after a closed-door meeting with Sunday Ighoho On Sunday In Cotonou, Benin Republic.\nHis response was that he was on a visit to the Yoruba Nation activist, Sunday Igboho to \"break the Muslim fast with him.\""
  },
  {
    "headline": "Soyinka Visits Sunday Igboho In Benin Republic, Holds Closed-door Meeting With Agitator, Professors Akintoye, Adeniran",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, on Sunday visited the Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, in Cotonou, Benin Republic.\nSoyinka also held a closed-door meeting with the Yoruba Nation Leader and the coordinator of the Ilana Omo Oodua group, Prof Banji Akintoye, as well as his deputy, Prof Wale Adeniran, in the city.\nSoyinka said he had always wanted to see Igboho, to \"sympathise with his predicament\".\nPHOTONEWS: Wole Soyinka, Wale Adeniran and Banji Akintoye after a closed-door meeting with Sunday Ighoho On Sunday In Cotonou, Benin Republic.\nHis response was that he was on a visit to the Yoruba Nation activist, Sunday Igboho to \"break the Muslim fast with him.\""
  },
  {
    "headline": "Indian National Allegedly Commits Suicide In Lagos",
    "summarized_story": "The Lagos State Police Command has commenced an investigation into the death of an Indian national, Devendra Singh, who allegedly committed suicide in the Ilupeju area of Lagos State.\nAccording to Punch, the 42-year-old man was a field worker at the Agro Nigeria Limited, in the Ikeja area of the state.\nSome of his colleagues, who rushed down to the place, also confirmed seeing the Indian man’s lifeless body dangling from the rope.\nSingh didn’t write any suicide note.”After the police recovered Singh’s corpse on Friday, his remains were deposited in the mortuary at the Mainland Hospital, Yaba, Lagos, for an autopsy.\nHe added, “Investigation has begun to ascertain if it is truly suicide or murder/manslaughter packaged as suicide.”"
  },
  {
    "headline": "Oil prices fall below $105 a barrel amid drop in China's factory activities",
    "summarized_story": "Oil prices dropped to $104 a barrel amid oversupply fears triggered by dwindled industrial activities in China, the world’s top oil importer.\nOn Monday, Brent crude futures fell 2.72 per cent to $104.2 a barrel at 10:38 GMT + 1, while West Texas Intermediate (WTI) crude futures fell 3.04 per cent to $101.5 a barrel.\nAdvertisementIn Nigeria, the financial burden of petrol subsidies has skyrocketed amid geopolitical developments.\nIn the first quarter of 2022, petrol subsidy payments gulped N675.93 billion — 24.79 per cent higher than what the country recorded in six months in the previous year.\nThe president had asked the national assembly to approve N4 trillion to cater for costly petrol subsidy in 2022 — as a result of high global oil prices due to the Russia-Ukraine war."
  },
  {
    "headline": "Oil prices fall below $105 a barrel amid drop in China's factory activities",
    "summarized_story": "Oil prices dropped to $104 a barrel amid oversupply fears triggered by dwindled industrial activities in China, the world’s top oil importer.\nOn Monday, Brent crude futures fell 2.72 per cent to $104.2 a barrel at 10:38 GMT + 1, while West Texas Intermediate (WTI) crude futures fell 3.04 per cent to $101.5 a barrel.\nAdvertisementIn Nigeria, the financial burden of petrol subsidies has skyrocketed amid geopolitical developments.\nIn the first quarter of 2022, petrol subsidy payments gulped N675.93 billion — 24.79 per cent higher than what the country recorded in six months in the previous year.\nThe president had asked the national assembly to approve N4 trillion to cater for costly petrol subsidy in 2022 — as a result of high global oil prices due to the Russia-Ukraine war."
  },
  {
    "headline": "FIFA sanctions Nigeria over Abuja stadium invasion by fans",
    "summarized_story": "The Nigeria Football Federation (NFF) has been sanctioned by FIFA over the stampede that occurred at the Moshood Abiola Stadium in Abuja after the country failed to qualify for the Qatar 2022 World Cup.\nIn late March, TheCable reported how some angry fans invaded that pitch and vandalised some of the stadium’s facilities after the Super Eagles lost the 2022 World Cup ticket to Ghana.\nAdvertisementJoseph Kabungo, the Zambian who was the Confederation of African Football (CAF) doping control officer for the match, was said to have lost his life during the chaos.\nThe NFF would later clarify that the CAF official died from cardiac arrest which it said had nothing to do with the violence that ensued after the match.\nSunday Dare, minister of sports and youth development, also announced the constitution of two separate committees to investigate the incident — with the panels’ findings yet to be made public."
  },
  {
    "headline": "FIFA sanctions Nigeria over Abuja stadium invasion by fans",
    "summarized_story": "The Nigeria Football Federation (NFF) has been sanctioned by FIFA over the stampede that occurred at the Moshood Abiola Stadium in Abuja after the country failed to qualify for the Qatar 2022 World Cup.\nIn late March, TheCable reported how some angry fans invaded that pitch and vandalised some of the stadium’s facilities after the Super Eagles lost the 2022 World Cup ticket to Ghana.\nAdvertisementJoseph Kabungo, the Zambian who was the Confederation of African Football (CAF) doping control officer for the match, was said to have lost his life during the chaos.\nThe NFF would later clarify that the CAF official died from cardiac arrest which it said had nothing to do with the violence that ensued after the match.\nSunday Dare, minister of sports and youth development, also announced the constitution of two separate committees to investigate the incident — with the panels’ findings yet to be made public."
  },
  {
    "headline": "EXPLAINED: How delegates who will pick presidential candidates are selected",
    "summarized_story": "But how will presidential candidates of the parties be picked?\nTYPES OF PRESIDENTIAL PRIMARY ELECTIONAdvertisementThe new electoral act provides that candidates for whatever public office can be selected by indirect primary, direct primary or through consensus method.\nIn the forthcoming elections, the two main parties are going to pick their presidential candidates using the indirect primary method and delegates are the ultimate deciders.\nOn the other hand, the statutory delegates — also known as automatic delegates — are those party members who have held public office before.\nAlso, party members who currently hold the aforementioned positions are eligible to vote to pick candidates at the conventions of the political parties."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Here are the confirmed speakers for the Techpoint Africa Blockchain Summit",
    "summarized_story": "Share this article:On May 21, 2022, the biggest blockchain and Web3 focused event — Techpoint Africa Blockchain Summit (TABS 2022), will be held at Four Points by Sheraton, Victoria Island Lagos.\nSpeaker at Techpoint Africa Blockchain SummitFisayo Fosudo is a visual storyteller, finance and technology video producer with over 250,000 subscribers.\nSpeaker at The Techpoint Africa Blockchain Summit.\nSpeaker at Techpoint Africa Blockhain Summit.\nSpeaker at Techpoint Africa Blockchain SummitSenator Ihenyen is the current President of Stakeholders in Blockchain Technology Association of Nigeria (SiBAN), a self-regulatory body in Nigeria’s emerging blockchain industry."
  },
  {
    "headline": "Microsoft is putting the edgy in Edge",
    "summarized_story": "Techpoint Africa Blockchain SummitTechpoint Africa Blockchain SummitFrom forging a career in blockchain to learning how to make money with NFTs, the Web3 space can be very tricky.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nBesides, keep in mind that as IE’s market share was steadily declining — Google Chrome dominates other browsers with a 69% market share —Microsoft was developing Microsoft Edge to replace Internet Explorer.\nHow to remove personal information from Google SearchOn Wednesday, April 27, 2022, Google announced that it had expanded its policy on Google Search removal requests for some of your personal information.\nAttach a screenshot to your request that shows where your personal information appears on the web page."
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "DeFi is getting Re-DeFined with Logarithmic Finance (LOG), Ripple (XRP) and Fantom (FTM)",
    "summarized_story": "Logarithmic Finance (LOG)Logarithmic Finance (LOG) comes packed with promise.\nLogarithmic Finance (LOG) is also interoperable and open source, with a public-driven and highly spirited drive towards overall development, the coin has a lot of potential.\nWith all of these promises, it is an absolute steal to have Logarithmic Finance (LOG) at a locked presale of $0.10.\nThe potential truth is that at no other time will the Logarithmic Finance (LOG) cryptocurrency be cheaper than it is today.\nEverything is in place, DeFi is going to see a massive shift and Logarithmic Finance (LOG) looks like it could be the centre of it."
  },
  {
    "headline": "Bekonta extends blockchain awareness and user education to Serving Corps Members.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain awareness and user education is a background check that must be done to foster blockchain adoption.\nThe Festival of Culture with the Bekonta presence engaged Youth Corps Members in a unique way.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Nigeria gas attracts as Europe sidesteps Russia",
    "summarized_story": "Nigeria has an opportunity to profit from Europe’s plan to pull the plug on the importation of Russian gas in the wake of Moscow’s war with Ukraine.\nThe International Energy Association (IEA), the Paris-based think tank that draws up energy polices for Western countries, has published a 10-point plan that would help Europe cut its dependence on Russian gas and this could open new markets for Nigeria and other gas producers.\nIn 2021, the European Union (EU) imported 45 percent of gas from Russia and this represents almost 40 percent of its total gas consumption.\nAnother practical measure offered by the IEA is to speed up the replacement of gas boilers with heat pumps.\n“Heat pumps offer a very efficient and cost-effective way to heat homes, replacing boilers that use gas or other fossil fuels."
  },
  {
    "headline": "Nigeria gas attracts as Europe sidesteps Russia",
    "summarized_story": "Nigeria has an opportunity to profit from Europe’s plan to pull the plug on the importation of Russian gas in the wake of Moscow’s war with Ukraine.\nThe International Energy Association (IEA), the Paris-based think tank that draws up energy polices for Western countries, has published a 10-point plan that would help Europe cut its dependence on Russian gas and this could open new markets for Nigeria and other gas producers.\nIn 2021, the European Union (EU) imported 45 percent of gas from Russia and this represents almost 40 percent of its total gas consumption.\nAnother practical measure offered by the IEA is to speed up the replacement of gas boilers with heat pumps.\n“Heat pumps offer a very efficient and cost-effective way to heat homes, replacing boilers that use gas or other fossil fuels."
  },
  {
    "headline": "Case Study: Italy, Algeria agree deal to cut Russian gas dependence",
    "summarized_story": "Italy and Algeria have signed a declaration of intent on bilateral energy cooperation that could see Italy depend less on Russian gas, which currently accounts for 40 percent of its supply.\nMario Draghi, Prime Minister of Italy, at a meeting in Algiers, said: “In addition to this, an agreement has been signed between Eni, an Italian multinational oil and gas company and Sonatrach, a national state-owned oil company of Algeria to increase gas exports to Italy.”The minister added, “Immediately after the invasion of Ukraine, I announced that Italy would move fast to reduce its dependence on Russian gas.\nRead also: Natural gas price rises as Russia cuts supply to Bulgaria, Poland“Today’s agreements are a significant response to this strategic objective, and others will follow.\nThe government is working to defend citizens and businesses against the consequences of the conflict.\n“Today’s meeting will be followed by the fourth Intergovernmental Summit, which, I am pleased to announce, will be held here in Algiers on 18 and 19 July before the Intergovernmental Summit; it will be my great pleasure to meet again with President Tebboune, President of Algeria during his state visit to Italy at the end of May.”"
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoBENIN CITY- The Edo State Police Command said its operatives have killed five suspected kidnappers …"
  },
  {
    "headline": "Eid-el-Fitr: Obaseki felicitates with Muslim faithful, urges love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as they celebrate Eid-El Fitr after the successful completion of the Ramadan fast.\nIn his Eid-El Fitr message, Obaseki charged Muslim faithful to sustain the lessons of sacrifice, selflessness, tolerance, discipline and love learnt during the period of Ramadan, noting that the virtues are necessary in achieving peace, unity and sustainable socio-economic development in the country.\nObaseki said, “I felicitate with our Muslim faithful on the occasion of Eid-el-Fitr after completing the Ramadan fast, a major pillar of Islam.\n“However, I urge you not to forget the lessons learnt during this period.\nWe must continue to imbibe the virtues of love, tolerance, sacrifice and charity, as taught by the Holy Prophet Mohammed (S.A.W), as it is only then can we be certain of achieving peace and unity, and place the country on the path of sustainable development.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Catholic priest joins governorship race in Benue – Nigerian Observer",
    "summarized_story": "Hyacinth Alia, a Catholic Priest and governorship aspirant on the platform of the All Progressives Congress (APC) has sought support as he joined the 2023 governorship race in Benue.\nThe News Agency of Nigeria (NAN) recalls that In 1992, Benue had a civilian governor and Catholic priest, late Rev.\nRolling out his Seven Point agenda for development of Benue, Alia said his mission was to ensure that government continued to priorotise the needs of residents and people of the state.\nHe urged all Benue indigenes to rise up and join him to change the “ugly political narrative in the state.\nEarlier, the Chairman of the Alia Alliance, Mr Peter Ashiekaa appealed to the Benue indigenes in Abuja to throw their weight behind what he called, the ‘Divine Project’."
  },
  {
    "headline": "Workers’ Day: Obaseki increases minimum wage to N40,000 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Approves payment of harmonized pension from May 2022The Edo State Governor, Mr. Godwin Obaseki, has approved #40,000 as the new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nObaseki noted, “As we all know, the minimum of N30,000 can barely sustain a family.\n“The government of Edo has now decided to review the minimum for Edo workers from N30,000 to N40,000 a month.\n“But as a government, we are prepared to make the sacrifices so that the workers can live a better life.\nHe stated, “I am particularly interested in our senior citizens because they are one of the most vulnerable in our society."
  },
  {
    "headline": "Scandals: Gov. Abiodun faces renewed second term hurdles",
    "summarized_story": "Though he admitted being arrested in 1986 in Florida for credit card fraud as alleged, he claimed not being convicted.\nAbiodun said that his probable arrest was not a conviction and hence was not answerable to the laws that applied to criminals.\nThe record further indicated that Abiodun was jailed for committing criminal offences which bordered on credit card fraud, petty theft and check forgery.\nIn Abiodun’s defense, former member of the House of Representatives, Kayode Oladele, reacted to the petition against Governor Abiodun of Ogun State, saying arrest is not a conviction.\nMr. Oladele, who represented Egbado North/ Imeko Afon Federal Constituency in the eighth Assembly, condemned the petition, which alleged that Mr. Abiodun concealed his criminal records in the United States of America."
  },
  {
    "headline": "2023: North dares the South on Presidency",
    "summarized_story": "Mr. Lamido said that the PDP presidential candidate would emerge from the partys national convention slated to hold from May 28 to May 29.\nWe will like to state from the onset that there is nothing called the northern PDP.\nHe said, Some desperate politicians are doing everything possible to scuttle the zoning arrangement of their political parties.\nWe urge political parties in Nigeria to be agents of national unity and progress by shifting their presidential tickets to the South.\nPolitical parties have a key role in giving Nigeria quality leaders that can truly unite this country and move it forward."
  },
  {
    "headline": "Just In: FIFA sanctions Nigeria over Abuja stadium fans invasion",
    "summarized_story": "The Federation of International Football Association (FIFA), has sanctioned Nigeria Football Federation (NFF) over the stampede that occurred at the Moshood Abiola Stadium in Abuja after the country failed to qualify for the Qatar 2022 World Cup.\nAccording to the latest FIFA Disciplinary Report published on its website on Monday morning, Nigeria was found guilty of not “implementing existing safety rules and failure to ensure that law and order are maintained in the stadium, invasion of the field of play and throwing of objects.”The world football governing body also handed Nigeria a fine of CHF 150,000 and a one-match behind closed doors.\nMore later…"
  },
  {
    "headline": "Experts weigh in as FG, World Bank/IMF clash over subsidy, forex",
    "summarized_story": "IMF advised the CBN to unify the exchange rate by abandoning the official exchange rate in favour of a free market.\nDirectors welcomed the removal of the official exchange rate and recommended further measures towards a unified and market-clearing exchange rate to help strengthen Nigeria’s external position, taking advantage of the current favourable conditions.\nThey noted that exchange rate reforms should be accompanied by macroeconomic policies to contain inflation, structural reforms to improve transparency and governance, and clear communications regarding exchange rate policy, the report stated.\nExperts viewsChief Executive Officer, Centre for the Promotion of Private Enterprise, Dr. Muda Yusuf, is among experts who share the view of World Bank.\nHe said, My proposition is that we should adopt a flexible exchange rate policy regime."
  },
  {
    "headline": "Soyinka In Benin Republic To Visit Igboho",
    "summarized_story": "Nobel laureate, Prof. Wole Soyinka, has travelled to Cotonou, Benin Republic to visit Yoruba Nation agitator, Sunday Adeyemo, known as Sunday Igboho.\nLEADERSHIP gathered that the literary icon was seen at the Seme border around noon on Sunday, crossing to Cotonou, the capital city of Benin Republic.\nHis response, according to travelers, was that he was on a visit to Sunday Igboho to break the Muslim fast with him.\nIgboho spent eight months in prison before he was released by the Benin Republic government, but he is not allowed to leave the country.\nHe had been at the forefront of agitation for the Yoruba Nation in Nigeria until his house was invaded by the Department of State Services (DSS) in Ibadan."
  },
  {
    "headline": "Ramadan: Tinubu Distributes Bags Of Rice, Sugar To Over 50,000 Families",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, in the spirit of charitable giving that accompanies the Ramadan season distributed sacks of Rice and Sugar to over 50,000 families across Nigeria.\nThe distribution of these items which began last week, put smiles on the faces of beneficiaries with many expressing thanks through prayers for Asiwaju.\nSpeaking about Ramadan earlier in April, the former Lagos governor emphasised on the need to “contribute to the wellbeing of those around us, give succor to people we find in need and study more how to solve problems instead of creating them,”.\nHe added: “Let us keep in the forefront of our minds that Ramadan also asks of us to show greater compassion, empathy and understanding, and enlightenment in how we treat and relate to one another.”ADVERTISEMENT“Ramadan asks of all of us to embrace acts of kindness, love our neighbors and reach out to the poor, needy and unfortunate among us.”“Our nation is one gifted by Allah with bountiful resources and a good and decent people.”ADVERTISEMENT"
  },
  {
    "headline": "Ramadan: Tinubu Distributes Bags Of Rice, Sugar To Over 50,000 Families",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, in the spirit of charitable giving that accompanies the Ramadan season distributed sacks of Rice and Sugar to over 50,000 families across Nigeria.\nThe distribution of these items which began last week, put smiles on the faces of beneficiaries with many expressing thanks through prayers for Asiwaju.\nSpeaking about Ramadan earlier in April, the former Lagos governor emphasised on the need to “contribute to the wellbeing of those around us, give succor to people we find in need and study more how to solve problems instead of creating them,”.\nHe added: “Let us keep in the forefront of our minds that Ramadan also asks of us to show greater compassion, empathy and understanding, and enlightenment in how we treat and relate to one another.”ADVERTISEMENT“Ramadan asks of all of us to embrace acts of kindness, love our neighbors and reach out to the poor, needy and unfortunate among us.”“Our nation is one gifted by Allah with bountiful resources and a good and decent people.”ADVERTISEMENT"
  },
  {
    "headline": "Nwajiuba Urges ASUU To Call Off Strike",
    "summarized_story": "Minister of State Education and All Progressives Congress (APC) presidential aspirant Hon.\nChukwuemeka Nwajiuba, yesterday appealed to Academic Staff Union of Universities (ASUU) to call off their strike to enable the students to return to their studies.\nNwajiuba, in a statement felicitating with Nigerian workers on May Day, said the government is ready to dialogue with them towards meeting their demands.\nADVERTISEMENT“The resilience of Nigerian workers is to be admired and encouraged.\nI completely identify with your struggle and wish to encourage our labour and union leaders to show great forbearance in this moment of national transformation."
  },
  {
    "headline": "Nwajiuba Urges ASUU To Call Off Strike",
    "summarized_story": "Minister of State Education and All Progressives Congress (APC) presidential aspirant Hon.\nChukwuemeka Nwajiuba, yesterday appealed to Academic Staff Union of Universities (ASUU) to call off their strike to enable the students to return to their studies.\nNwajiuba, in a statement felicitating with Nigerian workers on May Day, said the government is ready to dialogue with them towards meeting their demands.\nADVERTISEMENT“The resilience of Nigerian workers is to be admired and encouraged.\nI completely identify with your struggle and wish to encourage our labour and union leaders to show great forbearance in this moment of national transformation."
  },
  {
    "headline": "Maxwell Odum Nigeria's biggest crook vanishes with N213 billion",
    "summarized_story": "Ponzi scheme operator Maxwell Odum has vanished into the thin air after defrauding over 100,000 Nigerians of an estimated N213 billion or$511,590,216, according to CBN rate.\nHe ceased posting on his Facebook on 19 November 2020, when he ran another disclaimer for another scammer ‘Maxwell Odums’, based in Lagos.\nThe EFCC has asked Nigerians who have information on Maxwell Odum to call all its offices in Benin, Kaduna, Ibadan, Sokoto.\nHowever, some investors are getting anxious and impatient that the crook called Maxwell Odum has not yet been arrested by EFCC.\n“Is like EFCC has colluded with Maxwell Odum to embezzle our money because, since Maxwell Odum was declared wanted, he hasn’t been arrested."
  },
  {
    "headline": "Adolf Hitler not Jewish: Israel demands Russia's apology for false claim",
    "summarized_story": "Israel denounced Russian Foreign Minister Sergei Lavrov on Monday for suggesting that Adolf Hitler had Jewish origins.\n“The use of the Holocaust of the Jewish people for political purposes must stop immediately,” he added.\nLapid said that to claim Hitler was of Jewish descent was like saying Jews had killed themselves, and accusing Jews of being anti-Semites was “the basest level of racism”.\n“For a long time now we’ve been hearing the wise Jewish people say that the biggest anti-Semites are the Jews themselves,” he added.\nOnly the Nazis were Nazis and only they dealt with the systematic destruction of the Jewish people,” said Lapid, whose grandfather died in the Holocaust."
  },
  {
    "headline": "Low-cut trends among women",
    "summarized_story": "For centuries, it has been a belief that a woman’s hair is her crowning glory but now women adorning different low-cut styles have become a common sight.\nFor various reasons, some women have embraced going on low-cut just for their convenience and damning the traditional or religious consequences.\nAccording to a barber, Ezekiel Matthew, women going on low cut has become a trend that has come to stay.\nLow-cut doesn’t take anything away from a woman’s beauty.”Olajire Ajayi, a popular hairstylist in the Ilupeju area of the state, said women go on low-cut because it is convenient and affordable.\nPrice increases tentatively depending on hair texture, volume, and state of hair,” she said."
  },
  {
    "headline": "Nigerian LGBTQ Community for Abuja hold their public protect against FG",
    "summarized_story": "Nigerian LGBTQ Community for Abuja hold their public protect.\nWahalabe like Bicycle!!!\n“We say Queer Lives Matter, And Nigeria is our Home, we refused to be subdued in Nigeria” – Nigerian LGBTQ say as they Stage Massive Protest in Abuja!!!\nWATCH VIDEO:"
  },
  {
    "headline": "BREAKING: Unknown Gunmen Behead Nigerian Army Couple In Imo, Threaten To Kill Family Members",
    "summarized_story": "A couple of Nigerian army personnel were shot dead and then decapitated by gunmen on Saturday.\nAccording to military authorities, A.M Linus, an army sergeant first class, and his lance corporal wife were on their way to Imo State when the incident occurred.\nThe gunmen are claimed to have mocked the couple’s family members after beheading them.\nAfter the shooting, the gunmen put the victims’ heads on their chests, according to a graphic footage seen by SaharaReporters.\nThe lady was also raped before they were beheaded,” a soldier told SaharaReporters."
  },
  {
    "headline": "Ebute-Metta Building Collapse Death Toll Now Eight — NEMA",
    "summarized_story": "The death toll from a building collapse that occurred on Sunday in Ibadan Street, Ebute Metta, Lagos State, has risen to eight people.\nWhen the three-story structure caved in late Sunday, NEMA authorities, along with other emergency response organizations such as the Lagos State Fire and Rescue Service, the Lagos State Emergency Management Agency, and the police, launched a search and rescue effort.\nThe occupants were said to be in their various apartments when the building suddenly collapsed and trapped some of them.\nHe said, “Another three-storey building, on Lagos Street, about 200 metres away from the current scene has shown signs of distress with part throwing pebbles and falling off.\nHowever, the building has re-sealed and occupants evacuated by officers of Lagos State Buildings Control Agency."
  },
  {
    "headline": "2023 Presidency: Power Must Return To South, Ohanaeze Replies Northern Elders",
    "summarized_story": "The Igbo premier socio-cultural organization, Ohanaeze Ndigbo, has maintained that the presidency must return to the country’s southern region ahead of the 2023 presidential election.\nThe Northern Elders Forum, or NEF, is opposed to presidential zoning, according to Ohanaeze, because it was the Southeast’s turn to produce Nigeria’s president.\nThe NEF recently expressed its displeasure with the zoning of the 2023 Presidency.\nObasanjo, in keeping with the rotation principle, handed over to former President Umaru Yar’Adua ( North West) in 2007.\nSome stakeholders have been clamouring that the Southeast should produce Nigeria’s next President in 2023."
  },
  {
    "headline": "Presidency: PDP heads to Appeal Court over plan to stop primary",
    "summarized_story": "Rattled by an order of a Federal High Court Abuja in a suit seeking to scuttle its May 28, 2022 presidential primary, the Peoples Democratic Party (PDP) has approached the Court of Appeal in Abuja.\nAbia state Commissioner of Trade and Investment Cosmos Ndukwe had dragged PDP and Chairman of its Primary Election Planning Committee and National Secretary of the party, Senator Samuel Anyanwu and others before the court praying that the primary election be stopped.\nHis grouse was premised on the alleged refusal of PDP to zone its presidential ticket for the 2023 presidential election to South-East geo-political zone and his disqualification from participating in the presidential primary election.\nIn addition, the aggrieved PDP presidential aspirant, also in the originating summons marked FHC/ABJ/CS/508/2022, filed an ex-parte application for an order to restrain PDP from going ahead with the primary election until his suit was fully determined.\nBut dissatisfied with the High Court’s decision, the Primary Election Planning Committee Chairman, Senator Anyanwu, filed a notice of appeal at the Court of Appeal in Abuja praying that the order of Justice Okorowo be set aside."
  },
  {
    "headline": "Buhari @ Sallah: Victory over terrorists within sight",
    "summarized_story": "He also assured that the intensity of the military operations against terrorists were indications that the nation would soon have total victory over the insurgents and related criminals.\nPresident Buhari stated this Sunday in his Eid-el-Fitr message to mark the end of the Holy month of Ramadan by Muslim faithful in Nigeria and across the world.\nThe battle waged against terrorists who falsely masquerade under the name of Islam is approaching its conclusion.\nThe territories they used to occupy are now seeing the return of those who were forced to flee their barbarity.\nThe seizure of more than 65,000 tons of assorted drugs in this period sets a record for the nation,” he said."
  },
  {
    "headline": "Breaking: Another building collapses in Lagos, many trapped",
    "summarized_story": "A three-storey building has been reduced to rubbles after it collapsed Sunday night around Ebuta Metta Lagos state.\nThis was disclosed by the Lagos state fire and rescue services via its Twitter handle.\nThe message reads, “An alert of a collapsed of a three storey building by 32 Ibadan Street, Ebute Meta was received at 21:48 hours, Sunday with @LagosRescue at the scene.\nSearch and Rescue ongoing with updates to follow, please.”Recently, there have been cases of collapsed buildings in Lagos state.\nShare this: TwitterFacebook"
  },
  {
    "headline": "CBN Director, Dr. Tumala, formally joins Borno Senatorial race",
    "summarized_story": "By Onu OkorieA renowned finance expert and Director of Statistics of the Central Bank of Nigeria (CBN), Dr. Mohammed Musa Tumala, today collected his Nomination Form at the All Progressive Congress (APC) Secretariat in Abuja to formally express his interest in the 2023 Senatorial elections in Borno State.\nMohammed Tumala, is indicating his interest to serve us politically.\nHe was elected before into the House of Representatives and he served us to be best of his ability.\nSo, our joining him to collect his nomination form is to show we are strongly behind him and will cast our votes for him come 2023, insha Allah”, Mustapha assured.\nIt would be recalled that Dr. (Hon) Tumala had earlier been elected into the House of Representatives in 1992 and served until 1994 when the democratic regime was truncated by the military."
  },
  {
    "headline": "Afreximbank’s Awani makes Nigeria Annual’s “100 Leading Women” list",
    "summarized_story": "By Onu OkorieManaging Director of Afreximbank’s Intra-African Trade Initiative Division, Mrs. Kanayo Awani, has been named among the 100 outstanding women leaders in Nigeria, according to the list published in the 2022 edition of Nigeria Women Annual: 100 Leading Women.\nAs Managing Director, Mrs. Awani currently leads the Bank’s efforts in implementing its intra-African trade and industrialisation strategies.\nShe previously led Afreximbank’s Trade Finance and Branches Department from 2009 to 2016, growing it into the Bank’s most profitable department which accounted for over 80 percent of its loan book.\nMrs. Awani is also the Chairperson of the Africa Chapter of Factors Chain International (FCI), a global factoring association.\n“The Nigeria Women Annual: 100 Leading Women” is the premier qualitative profiling of phenomenal women who have contributed to the development of Nigeria and the world."
  },
  {
    "headline": "Firstbank creating sustainable socioeconomic value – Adeduntan",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE chief executive officer of First Bank Nigeria Limited, Dr. Adesola Adeduntan on Friday said the bank, through FirstBank’s Agent banking proposition, is creating sustainable socioeconomic value and empowering rural communities in unique ways.\nHe said, ‘‘First Bank has created over 500,000 direct and indirect jobs to tackle unemployment through the FirstBank’s FirstMonie agent network.\n‘‘Over two million individuals have been economically impacted via the jobs created through the FirstBank’s FirstMonie agent banking proposition.\nOver 35,000 of FirstBank’s FirstMonie agents are women, enabling us to drive gender inclusive growth within rural communities.\nFirstBank recognises the critical role of women (both in rural and urban areas) in driving socio-economic growth."
  },
  {
    "headline": "MCO rated best digital innovation govt Agency",
    "summarized_story": "By Palma IleyeNigeria Mining Cadastre Office, NMCO, has been rated the best “Digital Innovation in the Federal Government” 5th .ng Award category for the year 2022 at an Award Night organized by Nigeria Internet Registration Association, NIRA.\nIn a press release issued yesterday by Head of Press, Mrs Sade Fatoke, the Director General, Mining Cadastre Office, Engr.\nObadiah Simon Nkom who received the award for his Agency stated that the award was a call for Mining Cadastre to always forge ahead and be committed to be able to achieve greater feat like the NIRA Award.\nHe said, “The reward for hard work is always more work, I will say this award is a call for more dedication and committment for MCO to continue until government’s desire for the Agency and the sector is fulfilled”.\nHe further stated “we will remain committed to professionism and we can only improve on this achievement and many more so that MCO can be the gateway to economy diversification as well as boost government’s revenue”."
  },
  {
    "headline": "FBNInsurance pays N16.1bn claims to customers in 2021",
    "summarized_story": "By Kehinde Ibrahim LagosONE of Nigeria’s leading insurance companies and the one adjudged the most profitable life insurance company in Nigeria has revealed that it paid ₦16.1 billion claims to its customers in year end December 31, 2021.\nWhile speaking on the company’s claims profile, the Managing Director/Chief Executive Officer, FBNInsurance Limited, Val Ojumah, disclosed that the company’s commitment to satisfying her clients is non-negotiable.\n“At FBNInsurance Limited, we are in the business of paying genuine claims that are due.\nSpeaking further, Ojumah reiterated that “Customer satisfaction is the fulcrum of insurance business, and this inevitably builds customer loyalty, and we will not fail to ensure this.\nWe believe once FBNInsurance is able to pay customers’ claims as they arise, numerous customers and the general public will have faith to take up more life policies because they are convinced that should a claim/loss arise, FBNInsurance will be able to meet its financial obligations to them”."
  },
  {
    "headline": "Muslims In Nigeria Celebrate Eid-El-Fitr",
    "summarized_story": "Muslims in Nigeria on Monday joined their counterparts around the world to mark the Eid-El-Fitr – signalling the end of the fasting month of Ramadan.\nEid-El-Fitr means “festival of breaking the fast” and celebrations would normally begin, depending on the sighting of the moon.\nBut the Nigerian government declared Monday and Tuesday as public holidays to celebrate Workers’ Day and Eid-El-Fitr.\nHe, however, called on them to imbibe and practice the virtues of kindness, love, tolerance, peace, self-denial, sacrifice, and good neighbourliness, as exemplified by the Holy Prophet Muhammad (Peace be upon Him).\nHe wished all Muslims a happy Eid-el-Fitr celebration and prayed that the peace, blessings, and favours of Allah be with them."
  },
  {
    "headline": "PHOTOS: Muslims In Abuja Flood Praying Ground For Eid-El-Fitr",
    "summarized_story": "Muslims in Nigeria on Monday joined their counterparts around the world to mark the Eid-El-Fitr – signalling the end of the fasting month of Ramadan.\nThe event is quite different this year from those of 2020 and 2021 which were celebrated lowkey amid measures to curb the spread of COVID-19.\nEid-El-Fitr means “festival of breaking the fast” and celebrations would normally begin, depending on the sighting of the moon.\nREAD ALSO: Muslims In Nigeria Celebrate Eid-El-FitrThis year’s celebration coincides with the commemoration of the annual international Workers’ Day, and many would have expected the government to declare three days as public holidays.\nThe photos below capture some of the highlights of the Eid-el-Fitr prayer held at one of the praying grounds in the Federal Capital Territory."
  },
  {
    "headline": "Mother And Child, Six Others Killed In Lagos Building Collapse",
    "summarized_story": "No fewer than eight persons have been confirmed dead after a three-storey building collapsed in the Ebute Metta area of Lagos State.\nA mother and her child were among those recovered dead from the rubble, the National Emergency Management Agency (NEMA) said on Monday.\nWhile recounting Sunday’s tragedy, sources said dozens were trapped in the rubble after the building went down at about 10:56pm.\nEmergency officials, including personnel of the Lagos State Fire and Rescue Service, the Lagos State Ambulance Service (LASAMBUS), and the Lagos State Building Control Agency (LASBCA) were said to have raced to the scene shortly after the incident.\nHe revealed that another three-storey building located on 100 Lagos Street – about 200 metres away from the structure that collapsed on Sunday has shown signs of distress."
  },
  {
    "headline": "FIFA Sanctions Nigeria Over MKO Abiola Stadium Invasion",
    "summarized_story": "FIFA’s Disciplinary Committee on Monday imposed sanctions on Nigeria for the misconduct of its fans during the world cup qualifying tie in Abuja on May 29.\nDispleased football fans had vandalised facilities at the MKO Abiola National Stadium following Super Eagles’ 1-1 draw with the Black Stars of Ghana.\nThe tie had ended Nigeria’s bid to qualify for the global football tournament scheduled to start in November 2022 in Qatar.\nIt also imposed a 150,000 Swiss Franc (N63,996,216.90) fine on Nigeria as a result of the unruly behaviour of its fans, and one match without spectators.\nLast month, the Senate invited the Minister of Youth and Sports Development, Mr Sunday Dare; NFF President, Amaju Pinnick, and other agencies involved in the maintenance of the MKO Abiola Stadium to determine the extent of the damage to facilities at the national arena."
  },
  {
    "headline": "Ukraine To Evacuate More Civilians From Besieged Mariupol",
    "summarized_story": "Ukrainian authorities planned to evacuate more civilians from Mariupol on Monday, after dozens were finally brought to safety following weeks trapped under heavy fire in a steel complex.\nThe sprawling Azovstal plant is the last holdout of Ukrainian forces in the strategic southern port city, which has been besieged by Russian forces since they invaded Ukraine on February 24.\nRussian forces continued their push into eastern Ukraine on Sunday, killing eight civilians in rocket attacks in Donetsk and Kharkiv, the regions’ governors said.\nBut Ukrainian forces have also recaptured some territory in recent days, including the village of Ruska Lozova, which evacuees said had been occupied for two months.\nNothing else, a terrible and relentless fear,” Natalia, a 28-year-old evacuee from Ruska Lozova, told AFP after reaching Kharkiv."
  },
  {
    "headline": "2023 Presidency: MASSOB leader, Uwazurike leads thousands of youths in solidarity march for Yahaya Bello -",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the Youths, Support Yahaya Bello”, “Youths Can Also Lead”, and “Yahaya Bello for the Youths”, among others.\nAccording to them, in this regard, Governor Bello is the right fit for the position of President of the Federal Republic of Nigeria.\n“All Nigerians should rally round the youthful Governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "British Member of Parliament to resign for Watching Porn in Parliament",
    "summarized_story": "A Conservative British Member of Parliament, Neil Parish, has announced that he will resign after admitting twice watching pornography in the House of Commons.\nParish told the BBC the first time he viewed the explicit material was an accident after searching online for farm vehicles.\nThe Government of Prime Minister, Boris Johnson, is engulfed in numerous scandals, just days ahead of crucial local elections.\nThe Prime Minister himself has been fined by police for breaching his own Covid rules during the 2020 lockdown, and faces an investigation into whether he misled Parliament about parties in Downing Street.\nWe support his decision to step down as our Member of Parliament.”"
  },
  {
    "headline": "Peterside asks Wike to release detained Farah Dagogo within 48 hours -",
    "summarized_story": "Wike on how he obtained evidence linking the lawmaker to an alleged disruption of proceedings at the Rivers State Secretariat of the Peoples Democratic Party, PDP.\n“Wike had lied at several times such that these days his claims must be subjected to forensic investigation before believed.\nWhile calling on lovers of democracy and free speech to condemn Wike and his fascist style of governance, Peterside reiterated his 48-hour ultimatum to Gov.\n“Wike has 48 hours to ensure that Honourable Farah is set free and allowed to continue to pursue his political aspiration.\nWike cannot be junketing in pursuit of his presidential ambition using Rivers State resources while wickedly gagging another’s on the altar of ego."
  },
  {
    "headline": "Asiwaju Tinubu Receives APC Presidential Nomination Forms -",
    "summarized_story": "The National Leader of the All Progressives Congress and Frontline Presidential Aspirant, Asiwaju Bola Ahmed Tinubu, has received his Expression of Interest and Nomination Forms to enable him participate in the Presidential Primaries of the Party.\nAsiwaju Tinubu who just returned to the Country after performing the lesser Hajj (Umrah) in Mecca received the forms from Lagos State Governor, Babajide Olusola Sanwoolu.\nHis support groups led by former Secretary to the Government of the Federation, Babchir Lawal, and Senator Dayo Adeyeye purchased the forms for him on Friday afternoon.\nThe Party’s Presidential Primaries will hold between the 30th of May and 1st of June.\nThe Party’s Presidential contest has become increassingly crowded in recent days with the declaration of the Vice President Yemi Osinbajo, Governors Yahaya Bello of Kogi State and Kayode Fayemi of Ekiti State, Senators Ibikunle Amosun and Chris Ngige, Minister of Transportation, Rotimi Amaechi, Minister of Education, Chkwuemeka Nwajiuba and Others."
  },
  {
    "headline": "Civilians Evacuated from Ukraine’s Mariupol as Russia Renews Shelling",
    "summarized_story": "But Russian forces resumed shelling the steel works on Sunday as soon as the buses had left the plant, a city official said.\nAround 100 civilians evacuated from the Azovstal steelworks were due to arrive in the Ukrainian-held city of Zaporizhzhia, 230 km northwest of Mariupol, on Monday.\nMore than 50 civilians arrived at a temporary accommodation centre in Russian-controlled territory on Sunday after escaping from Mariupol, a Reuters photographer said.\nUkraine and the West say Russia launched an unprovoked war of aggression that threatens to spiral into a much wider conflict.\nIn Russia, two explosions took place on Monday in Belgorod, a southern region bordering Ukraine, governor Vyacheslav Gladkov said."
  },
  {
    "headline": "Modele Sarafa-Yusuf: I’m Not Ready To Do Politics as Usual, Which Informed My Declaration Venue",
    "summarized_story": "APC Governorship aspirant in Ogun state, Modele Sarafa-Yusuf speaks about her ambition to depose incumbent governor Dapo Abiodun to become the first female elected governor of Ogun State, even as she accused the government of vandalising her campaign posters and billboards.\nRelatedStories No Content Available"
  },
  {
    "headline": "‘Politicians Should Be Willing To Go Through Workers’ Charter of Demands’ – Ayuba Wabba – Arise News",
    "summarized_story": "President of the Nigeria Labour Congress, Ayuba Wanna speaks about 2022 workers’day celebration and how workers should be ready to hold politicians accountable to fulfil promises made at manifestos."
  },
  {
    "headline": "Nigeria: South-East’s Most Important Demand is Reintegration, Agitations Will End with Igbo Presidency, Says Ex-Senate President Anyim – Arise News",
    "summarized_story": "And I replied, the most important single demand of the south-east from Nigeria is reintegration.\n“Once they feel that they have been fully reintegrated into Nigeria, all agitation will naturally be extinguished.\n“Immediately, President Goodluck Jonathan became president of Nigeria, that agitation died.\nIn fact, not when he became president, immediately he became vice president of Nigeria, that agitation died out.\nI believe that if a South-easterner becomes the president of Nigeria, that agitation will die,” he said."
  },
  {
    "headline": "Nigeria: Despite Oil Prices Rising Above $100 Per Barrel, Impact on Budget will Be Negligible, RenCap Says",
    "summarized_story": "A new report by Renaissance Capital (RenCap), a frontier market investment company, has stated that despite crude oil prices at over $100 per barrel, the impact on Nigeria’s fiscal position would remain negligible due to petrol subsidy payments and falling oil production by the country.\n“This implies that Nigeria has a $3 billion net benefit for every $10 per barrel change to the oil price (Brent),” it stated.\nThe federal government recently increased the 2022 subsidy budget from N443 billion to N4 trillion, after it shifted the planned removal of what it terms under-recovery by 18 months.\nRenCap said in the report, “An 80 per cent increase in the oil price, from $41/bbl to $72/bbl, reduced the budget deficit by about 1 ppt only.\nWe attribute the widening of the deficit in 2021, despite the high oil price, to the fall in production that countered the price effect."
  }
]