[
  {
    "headline": "JSS1 student sues Ekiti Govt, seeks N15m damages",
    "summarized_story": "AJSS1 female student at Mary Immaculate Secondary School , Ado- Ekiti, Miss Gift Agenoisa, has sued the Ekiti Government before a state High Court, seeking N15m in damages for breach of fundamental human rights.\nShe also demanded her immediate reinstatement back to school with unfettered access to all services being rendered therein.\nThe plaintiff claimed that the beating she got that day resulted in bruises, life-threatening scars and bloodstains on her uniform, adding that she fainted and was rushed to the Police clinic in Ado-Ekiti, where she was resuscitated.\nShe claimed further that her letters of protest to the wife of Ekiti State Governor and some relevant government agencies were not responded to, hence, her resort to legal redress.\nThe plaintiff added that she had been denied access to the school premises and her class on the orders of the principal since then."
  },
  {
    "headline": "France suspends military cooperation with Ethiopia",
    "summarized_story": "France has suspended a deal on military cooperation with Ethiopia, two sources close to the issue said on Friday, as concern intensifies over the conflict in the country’s north.\nMacron and Abiy had made an agreement in which France would loan 85 million euros ($100 million) to support landlocked Ethiopia’s ambition to build a navy.\nAbiy was awarded the 2019 Nobel Peace Prize for his role in helping to end the decades-long conflict with neighbouring Eritrea.\nBut international partners have grown increasingly concerned with his leadership as the conflict in the northern Tigray region intensifies.\nAid workers are struggling to reach cut-off populations, with 400,000 facing famine-like conditions in Tigray, according to the UN."
  },
  {
    "headline": "Buhari told to free Sunday Igboho, Nnamdi Kanu, arrest Sheikh Gumi",
    "summarized_story": "The President Muhammadu Buhari-led Federal Government has been called upon to free Sunday Adeyemo, a Yoruba Nation agitator popularly called Sunday Igboho, and Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nDeji Adeyanju, the convener of Concerned Nigerian, said the government should arrest popular Islamic cleric, Sheikh Ahmad Gumi, instead.\nAccording to Adeyanju: “Free Nnamdi Kanu and arrest Gumi and bandits now.\nIgboho, on his part, is being held by security operatives in Benin Republic following his arrest recently.\nThe Yoruba Nation agitator was arrested in Cotonou while trying to board a flight to Germany."
  },
  {
    "headline": "Bill for management of Akwa Ibom Assembly funds passes second reading",
    "summarized_story": "The Bill for a law to make provisions for the Management of Funds of Akwa Ibom State House of Assembly and for other related matters has passed first and second reading during plenary.\nThe impeachment notice is a fallout from the councillors’ earlier attempt to remove Etukakpan from office due to the allegation of false declaration of age levelled against him by the councillors.\nThe Speaker, Rt Hon Aniekan Bassey, referred the impeachment notice to a Special Ad Hoc Committee headed by the member representing Etinan State Constituency, Rt.\nThe Committee is to look into the allegations contained on the impeachment notice and report back to the House within one month.\nThe bills are; bill for a law to establish the Akwa Ibom State Security Trust Fund and for other connected purposes; a bill for a law to establish the Akwa Ibom State Sports Development Fund and for other connected purposes and a bill for a law to establish the Akwa Ibom State College of Nursing Sciences and for other purposes connected therewith."
  },
  {
    "headline": "NARD strike: Ngige accuses doctors of playing God",
    "summarized_story": "Minister of Labour and Employment, Chris Ngige, has accused doctors in Nigeria of playing God.\nThe National Association of Resident Doctors (NARD) commenced an indefinite nationwide strike on August 2.\nAmong others, NARD is complaining of poor working environment in public hospitals, irregular payment of doctor’s salaries, N5,000 hazard allowances last reviewed in 1991.\nBut Ngige, a medical doctor who graduated from the University of Nigeria, Nsukka, (UNN) in 1979, said the doctors were competing with God.\nYou say they dislike doctors, what did you do for them to dislike you?”, he quipped."
  },
  {
    "headline": "Shagari’s late wife was woman of peace – Gov Ortom mourns",
    "summarized_story": "Governor Samuel Ortom of Benue State has said that the death of Hajiya Hadiza Shehu Shagari, wife of former Nigerian President, Shehu Shagari, is a painful loss to Nigeria.\nRecall that Mrs Hadiza Shagari died of COVID-19 complications on Thursday.\nReacting, Ortom in a statement by his Chief Press Secretary, Terver Akase, described the deceased as a woman of peace who added immense value to her husband’s administration and continued to play a motherly role to the nation till her demise.\nHe sympathized with the government and people of Sokoto State as well as other Nigerians over the loss of the former President’s wife.\nOrtom prayed that God will grant the soul of Hajiya Hadiza eternal rest and the entire Shehu Shagari family the strength to bear the loss."
  },
  {
    "headline": "Television studio burnt to ashes in Ogun [VIDEO]",
    "summarized_story": "Hi-Impact TV, Nigeria’s first full high-definition television studio, has been consumed by fire in Ogun State.\nDAILY POST reports that the television studio, located in the premises of Hi-Impact Planet Amusements Park & Resort at KM 12 Lagos-Ibadan Expressway, Ibafo in Obafemi Owode Local Government Area of Ogun, caught fire on Thursday.\nThe Ogun State Fire Service confirmed the incident in a statement on Friday.\nKuti said that the fire was traced to a power surge, saying it was quickly curtailed and extinguished by the firefighters.\nWhile stressing that no life was lost in the unfortunate incident, our correspondent observed that valuables in the studio were burnt to ashes."
  },
  {
    "headline": "How a comment on Teni’s record label boss’ post got me a recording deal, Richard J",
    "summarized_story": "By Ibrahim AdamFast-rising Afro-fusion artiste, Richard Idehen aka Richard J, has revealed how a comment on an Instagram post by Teni Makanaki’s label boss, Dr Dolor, got him a recording deal.\nThe 26-year-old artiste narrated how an encounter with Dr Dolor on Instagram gave him his first big break..\nAs thousands of people congratulated the deft move by the record label owner, Richard J saw another side to the optics.\n‘Aye’ is a retrospective track by Richard J that spotlights the hustle culture and the need to keep moving forward regardless of the mounting challenges that life brings, was one of the songs that Richard J presented.\n“NMG records took me under their wings, showed me the ropes and we started making great music together”, he said with enthusiasm."
  },
  {
    "headline": "Court bars Chevron’s Chief Medical Director from evicting wife",
    "summarized_story": "By Robert EgbeA Lagos High Court has restrained Chevron Nigeria Limited Chief Medical Director (CMD), Dr.Rotimi Babalola, from evicting his wife, Mrs. Adediwura Adebukola Babalola, from their matrimonial home.\nJustice Olukayode Ogunjobi specifically barred Babalola, his servants, privies, or workmen from entering, trespassing, or otherwise disturbing the possession of the building at N0.\n8, Service Crescent, Cooperative Villa, Badore, Ajah, Lagos pending the hearing and determination of the Motion on Notice filed in the divorce petition filed by his wife.\nThe motion on notice was adjourned to September 20 when the Lagos State High Court will resume from its annual vacation.\nThe suit is numbered LD/9231WD/2021."
  },
  {
    "headline": "Fintech firm, Rocket revolutionises African market with new products",
    "summarized_story": "He said Rocket will be unveiling a series of products and platforms over the next 6 months including Rocket Global – a Spot, Futures and NFT Marketplace for ta global audience, Rocket Pay – a crypto Merchant Payment Gateway and the ecosystem Native Token, Rocket Global Coin (RCKC).\n“We have built a seamless Merchant Payment Gateway that will enable users to make payments for goods and services using Cryptocurrency, at marginal or little to no charges.\n“With Rocket Pay, merchants can make transactions seamlessly with multiple payment options,” he explained.\nRocket Global Coin (RCKC) is the native Token of the entire Rocket Ecosystem which consists of Rocket by Chiji14xchange ( Instant Swap & P2P Exchange in Nigeria), Rocket Global (Futures & Spot Exchange( Rocket Pay (Crypto Payment Gateway), and Rocket NFT Marketplace.\nRocket Global is set to be launched in November, 2021."
  },
  {
    "headline": "Jay The King set to release debut EP",
    "summarized_story": "By Sampson UnamkaUS-based Nigerian musician, James Olikpe professionally known as Jay The King, has announced the release of his much-anticipated debut Extended Play(EP) titled ‘Thinking out loud’(TOL).\nThe versatile act said his debut EP is a compilation of danceable songs with catchy lyrics that talk about everyday life people experience that’s a little fun and a little naughty.\nTOL is a six- track EP that consists of two of his previously released singles ‘Fi e shaya’ and ‘Lono’.\nI love being able to take my time perfecting my craft”, said Jay The King.\nThat’s one of my dreams, to one day help those people with a platform to achieve their dreams”."
  },
  {
    "headline": "Spanish Navy seeks collaboration with Nigerian Navy",
    "summarized_story": "BY PHILIP NWOSUThe Nigerian Navy on Wednesday said that a secured maritime environment remains a contributing factor to the economic prosperity of any nation.\n“If the Spanish Navy can oblige us such opportunity, it will be to a great advantage for the Nigerian Navy.\nHe said that NAVTRAC’s task was to continue to train and retrain officers and ratings for an efficient Nigerian Navy.\nHe reiterated the need for the Nigerian Navy and Spanish Navy to collaborate in the area of training especially technical trainings for officers and ratings.\n“Spanish Navy vessels have quite an experience in the fight against piracy even now, we have command of the Western Navy vessels at Operation Atlanta in the Indian Sea."
  },
  {
    "headline": "PDP ask court to sack Gov. Buni, deputy",
    "summarized_story": "From Godwin Tsa, AbujaThe Peoples Democratic Party (PDP) has asked a Federal High Court to sack the Governor of Yobe State, Mai Mala Buni and his deputy, Idi Barde Gubana from office and install Ambassador Umar Iliya of the PDP as state governor.\nIn a split decision of four to three, the Supreme Court affirmed the election of Mr Rotimi Akeredolu (SAN) as Governor of Ondo State.\nHowever, a minority judgment of three justices of the apex court questioned the validity of the Buni-led Caretaker Extraordinary Convention Planning Committee and declared it illegal.\nListed as defendants in the suit are Governor Mai Mala Buni, Idi Barde Gubana and All Progressive Congress (APC).\n“We have not received any court notification to that regard and we believe that nothing like such suit exists."
  },
  {
    "headline": "8 FAAN, NCAA directors still in office, receiving salaries 5 months after tenure expiration",
    "summarized_story": "This was even as there are no official policy of tenure elongation for the affected directors.\nHowever, he recently reached the retirement age of 60 on August 5 and has not been replaced.\nIn effect, the Director General of NCAA and the Managing Director of FAAN cannot be held responsible for the failure to appoint new directors as such decisions are only made by the supervising minister.\nMinister yet to inaugurate aviation boardsThe failure to appoint new directors is not the first time the minister of aviation would be flouting civil service rules and setting aside due process.\nThe Act setting up the Accident Investigation Bureau (AIB) does not provide for a board of directors."
  },
  {
    "headline": "Bankers’ Committee threatens tough sanctions for saboteurs of new forex policy",
    "summarized_story": "By Omodele Adigun and Chinwendu ObienyiTo ensure fair distribution of the nation’s scarce foreign exchange (forex) to genuine end-users, the Central of Nigeria-led Bankers Committee yesterday, threatened severe sanctions for saboteurs of the new foreign exchange policy of the apex bank.\nFor fraudulent individuals, “the likely punishment is that your account will be PNDed.\nAs the first phase, most of the things that you do, you go to the branches today to do most things.\nThey are for people with genuine needs.So, fraudulent transactions or fraudulent individuals will be reported to the CBN in the portal.\n“The CBN will not be lenient with any bank caught encouraging fraudulent transactions as the said bank will get strong sanctions."
  },
  {
    "headline": "Cholera kills 816, infects 31,000 in 22 states –FG",
    "summarized_story": "Speaking yesterday, in Abuja, during the 18th ministerial briefing organised by Presidential Communication Team, he said the epidemic has spread to 22 states, warning that over 31,000 people have been infected.\nWhile acknowledging the danger the COVID-19 Delta variant has brought to the country, Ehanire, however, ruled out another lockdown of the country.\nAnd of course when we were compelled to have lockdown at the beginning, we learnt a lot of lessons.\nHe said majority of the demands raised by the doctors were under the jurisdiction of state governments.\nHe said 176,000 doses of Johnson and Johnson vaccines that arrived the country with roll out schedule for Monday, was part of 29 million doses the government procured that is being expected."
  },
  {
    "headline": "Buhari Returns from UK Today",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari is expected back in Abuja, the Nigerian capital on Friday (today).\nIt stated: “Mr President will be arriving Abuja from his trip outside the country tomorrow (Friday), the 12/08/2021 by 1700hrs.\n“Compol (Commissioner of Police) directs all Sector Commanders and DPOs to deploy adequately inward Abuja.\nPresident Buhari had left Nigeria for the United Kingdom on July 26 to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nOn Thursday, Buhari paid a visit to former Lagos State Governor and National Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Tinubu, who is said to be recuperating in the United Kingdom."
  },
  {
    "headline": "APC at Crossroads as PDP Tells Court to Declare Buni, Deputy’s Seats Vacant",
    "summarized_story": "Keyamo and others, like Senators Babafemi Ojudu and Ita Enang, had raised concerns about future elections, particularly, in a situation, where the convention to elect new leaders of the APC was conducted under the Yobe State governor.\nApart from Buni, PDP, citing section 187(1) of the 1999 Constitution, as amended, also sought the removal of Gubana from office as deputy governor.\nAlthough Oshiomhole did not challenge the dissolution of the NWC then, some aggrieved party members had approached the court seeking to stop the Buni-led caretaker committee.\nWhile the party would be battling on the one hand to legitimise the Buni-led committee, the Yobe State governor, on the other hand, would be battling to save his office as governor.\nIn the suit filed on their behalf by their lawyer, Chief Emeka Etiaba, SAN, the plaintiffs insisted that Buni ceased to be a governor from the moment he accepted to act as APC caretaker committee chairman."
  },
  {
    "headline": "At Babangida’s 80th Birthday Lecture, Panelists Address His Challenges",
    "summarized_story": "The colloquium was designed as part of events to mark Babangida’s 80th birthday coming up next Tuesday, August 17.\nThey also expressed concern about poor handling of Nigeria’s multi-ethnic nature, and set the agenda for the future.\nAkilu recalled how the former military president gave out his only car to a friend, who needed it.\nAbubakar, while underscoring the leadership qualities that endeared Babangida to many Nigerians, said, “Once you are a leader, everybody is yours.\nRegretting that the Babangida was one of the most misunderstood Nigerians, Abubakar noted that Babangida has the love of Nigeria at heart."
  },
  {
    "headline": "FG Spends N122bn to Procure Johnson & Johnson Covid-19 Vaccine",
    "summarized_story": "According to him, the 177,600 doses of Johnson and Johnson vaccines that arrived the country with roll wout schedule for Monday, was part of 29 million doses the government procured that is being expected.\nAnd, of course, when we were compelled to have that lockdown at the beginning, we learnt a lot of lessons.\nIn fact, Israel the other day announced that they’re doing some lockdown, but there’s no more generalised lockdown but precision lockdown of certain areas.\nFurther on the doctors’ strike, Ehanire said it was not a good time for doctors to go on strike.\nThey’re not federal, federal government cannot compel a state to pay you a certain salary that you want."
  },
  {
    "headline": "Divestment: Wood MacKenzie Values Shell’s Equity in JV Assets at $2.3bn",
    "summarized_story": "“Discussions with the Nigerian government are ongoing on the next steps for our onshore business in Nigeria.\nIt listed the assets up for sale as OML 11, OML 20, OML 21 (Assa North), OML 22 (Enwhe), OML 23 (Soku), OML 25, OML 27, OML 28 (Gbaran-Ubie), OML 31, OML 32, OML 33, OML 35, OML 36, OMLs 43 and 45 (Forcados-Yokri), OML 46, OMLs 74 & 77 and OML 79.\nRather than sell single OMLs, Shell is seeking buyers for asset packages in the eastern, western and shallow water delta,” the firm stressed.\nMacKenzie disclosed that there could be as much as four billion barrels of Oil Equivalent (BOE) across the JV.\nIn February, a Dutch court held Shell’s Nigerian subsidiary responsible for multiple oil pipeline leaks in the Niger Delta and ordered it to pay damages to farmers, leading van Beurden to call its Nigerian onshore assets as a “headache”."
  },
  {
    "headline": "BUSTED: Buhari Regime Votes N15billion For Police Special Operations In The North, Excludes Southern Region",
    "summarized_story": "The President Muhammadu Buhari-led government has set aside over N15 billion as the “Police Special Operations Fund” to tackle insecurity in the North-East, North-West and North-Central states.\nThe Police Special Operations Fund (Item 16) under Police Formation and Commands will be given N15,166,188,712.\nThe item reads, “Police Special Operations Fund (Service-wide Vote) North-East/North-West/North-Central – N15,166,188,712.”The supplementary budget is silent on the Southern states which also have had a fair share of the security challenges bedevilling the country.\nSaharaReporters had also on Tuesday reported that in the N983 billion supplementary budget signed into law, recurrent (non-debt) expenditure will gulp N123 billion, while N895 billion will go into capital expenditure.\nFrom the supplementary budget, the Federal Ministry of Health got N2.8 billion to procure molecular laboratory equipment in national hospitals."
  },
  {
    "headline": "BUSTED: Buhari Regime Votes N15billion For Police Special Operations In The North, Excludes Southern Region",
    "summarized_story": "The President Muhammadu Buhari-led government has set aside over N15 billion as the “Police Special Operations Fund” to tackle insecurity in the North-East, North-West and North-Central states.\nThe Police Special Operations Fund (Item 16) under Police Formation and Commands will be given N15,166,188,712.\nThe item reads, “Police Special Operations Fund (Service-wide Vote) North-East/North-West/North-Central – N15,166,188,712.”The supplementary budget is silent on the Southern states which also have had a fair share of the security challenges bedevilling the country.\nSaharaReporters had also on Tuesday reported that in the N983 billion supplementary budget signed into law, recurrent (non-debt) expenditure will gulp N123 billion, while N895 billion will go into capital expenditure.\nFrom the supplementary budget, the Federal Ministry of Health got N2.8 billion to procure molecular laboratory equipment in national hospitals."
  },
  {
    "headline": "How Oyo Governor, Makinde's Appointee Illegally Sold Off 22 Buses Bought By Ajimobi Government – Workers’ Petition Reveals",
    "summarized_story": "But reverse is the case for Dare Adeleke, the chairman of the present board members of the company.\n\"Instead of the board members to work together and formulate policies that will make the masses enjoy the benefits and success of the Governor Seyi Makinde-led administration, the greedy chairman has pocketed other board members.\nAt least, not 10 Daewoo buses had already sold off out of 90 buses purchased during the administration of Ajimobi.\n\"At least between 10 and 12 Hummer buses have been sold by Adeleke without board approval for auction.\nGovernor Makinde should do a proper investigation because if urgent action is not taken, Dare Adeleke will ruin PTS completely.\""
  },
  {
    "headline": "How Oyo Governor, Makinde's Appointee Illegally Sold Off 22 Buses Bought By Ajimobi Government – Workers’ Petition Reveals",
    "summarized_story": "But reverse is the case for Dare Adeleke, the chairman of the present board members of the company.\n\"Instead of the board members to work together and formulate policies that will make the masses enjoy the benefits and success of the Governor Seyi Makinde-led administration, the greedy chairman has pocketed other board members.\nAt least, not 10 Daewoo buses had already sold off out of 90 buses purchased during the administration of Ajimobi.\n\"At least between 10 and 12 Hummer buses have been sold by Adeleke without board approval for auction.\nGovernor Makinde should do a proper investigation because if urgent action is not taken, Dare Adeleke will ruin PTS completely.\""
  },
  {
    "headline": "How Oyo Governor, Makinde's Appointee Illegally Sold Off 22 Buses Bought By Ajimobi Government – Workers’ Petition Reveals",
    "summarized_story": "But reverse is the case for Dare Adeleke, the chairman of the present board members of the company.\n\"Instead of the board members to work together and formulate policies that will make the masses enjoy the benefits and success of the Governor Seyi Makinde-led administration, the greedy chairman has pocketed other board members.\nAt least, not 10 Daewoo buses had already sold off out of 90 buses purchased during the administration of Ajimobi.\n\"At least between 10 and 12 Hummer buses have been sold by Adeleke without board approval for auction.\nGovernor Makinde should do a proper investigation because if urgent action is not taken, Dare Adeleke will ruin PTS completely.\""
  },
  {
    "headline": "NECO: We may release 2021 SSCE results in three weeks",
    "summarized_story": "The National Examination Council (NECO) says the release of results for its 2021 Senior Secondary School Examination (SSCE) may come in three weeks.\nAdvertisementAzeez Sani, spokesman of the council, confirmed the timeline of the procedure to TheCable Lifestyle on Friday.\nWe’ve not had issues so far.”Earlier, NECO said that about 1.3 million candidates were taking part in the ongoing 2021 SSCE across the country.\nAccording to the registrar, NECO was working towards perfecting plans to introduce computer-based exam.\nCopyright 2021 TheCable."
  },
  {
    "headline": "Four housemates evicted from Nigeria’s teachers reality show",
    "summarized_story": "Four housemates have been evicted from the second edition of Teachers Naija, a Nigerian reality TV show.\nAdvertisementThe quartet — Enyinnaya Victor Maduabuchi, Olatunji Raphael Dapo, Ukpong Victor Josiah, and Peters Ekene Eunice — were sent packing from the show on Monday following their nomination for eviction earlier in the week.\nThe eviction show had kicked off with about eight housemates, who were nominated for eviction, canvassing their qualities and also stating why they should remain in the house.\nTheir eviction now shrinks the number of housemates to 16 — five males, 11 females — as the TV show inches towards a crescendo.\nThe show airs on DStv Channel 195 and GoTV Channel 97 from 8pm to 9pm every day."
  },
  {
    "headline": "1.3m candidates write 2021 NECO exam — 200k more than last year",
    "summarized_story": "The National Examination Council (NECO) says about 1.3 million candidates are taking part in the ongoing 2021 Senior School Certificate Examination (SSCE) across the country.\nAdvertisementAccording to NAN, Ibrahim Wushishi, NECO’s registrar, broke the news in Yola, Adamawa state, on Thursday.\nThe registrar said about 1.1 million candidates sat for the examination last year.\nWushishi said that the increase in students this year was a testimony to the recognition and acceptability growth of NECO.\n“The conduct of the examination has demonstrated the mission and vision of the council for credible examination."
  },
  {
    "headline": "Destiny Etiko buys house to celebrate 32nd birthday",
    "summarized_story": "BY IBEH THEODORAAdvertisementDestiny Etiko, Nigerian actress and model, has bought a new house to commemorate her 32nd birthday.\nIn the post, Etiko, who turned a year older on Thursday, said the gesture was her own way of showing love to herself.\nAdvertisement“A birthday gift from me to me, thank you Jesus ” she wrote in a terse post accompanied by picture of the house.\nIn several other posts, she shared clips of cash gifts, cakes and other items that she received from fans and colleagues.\nEtiko has established herself as a prominent name in the Nigerian movie industry with strings of projects, awards and recognition."
  },
  {
    "headline": "Simi: I’ll be anxious if my daughter decides to do music",
    "summarized_story": "Simi, Nigerian singer, says she will be anxious if her daughter decides to do music when she grows.\nSimi got married to Adekunle Gold, another singer, in January 2019 and they had their first child together in June 2020.\nSpeaking of the girl child, the songstress said: “Whatever she wants to do, I’ll be 150 percent in support.\nI’ll be anxious if she decides to do music, only because I don’t want her to feel any kind of pressure.\nThat pressure of having parents that are musicians can I have you under pressure."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "Obaseki congratulates Odigie-Oyegun on 82nd birthday, hails contribution to devt of Edo, Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated ex-governor of the state and former national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun on his 82nd birthday, hailing his commitment to Nigeria’s unity and development.\nIn a statement, the governor extolled the virtues of the elder statesman, describing him as an “erudite politician, true democrat and administrator par excellence, whose exemplary leadership has positively impacted the nation’s political space.”Obaseki noted, “On behalf of the government and good people of Edo State, I congratulate you, Chief John Odigie-Oyegun, as you mark your 82nd birthday anniversary.\n“You have continued to lead an enviable life that is worthy of emulation, distinguishing yourself as a role model, true democrat and administrator par excellence.\n“From your early days in the federal public service, where you rose to the peak of your career as a permanent secretary, up to when you got elected as the governor of Edo State, you have carried on with your vision of engendering sustainable development.\n“I applaud your unalloyed dedication and commitment to the Nigerian project and pray that the Almighty God will grant you more years in good health and happiness.”..."
  },
  {
    "headline": "Edo readies to receive second batch of COVID-19 vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state would, by weekend, receive its second batch of the coronavirus (COVID-19) vaccines, to protect the people against the deadly virus.\n“The Edo State COVID-19 response team has been reactivated; l am the chairman of the team and the deputy governor is the chairman of the Technical Committee.\nOko-Oboh noted: “We are receiving about 3.2 million doses of the COVID-19 vaccines, including Moderna, AstraZeneca, as well as Johnson and Johnson.\nIf you take AstraZeneca as the first dose, it must be AstraZeneca for the second dose and not Moderna.\nWe are expecting and encouraging everyone to come forward for the second dose of the AstraZeneca vaccine when it arrives.”..."
  },
  {
    "headline": "When Oredo Corpers Defiled Rain to Keep Benin City Clean – Nigerian Observer",
    "summarized_story": "The disciplinary NYSC officials in Oredo have not doubt instilled discipline in the serving Corps member which has put the Corps members always on the go when duty calls.\nSo when the Corpers’ Liaison Officer (CLO), Afemi Samson posted a reminder on the WhatsApp group that reads:“Attention Corps members, there will be a National Environmental Sanitation Day!\nOn Saturday, 17th July, corpers serving within Benin metropolis were spotted in every nook and cranny of the town carrying out sanitation.\nCorps members are expected to use one day in a week for group CDS activities.\n___________________________________________________________________________________________________________________Sinafi Omanga is a serving Corps member with The Nigerian Observer, Benin City."
  },
  {
    "headline": "NIDO President, Odibo, renowned pharmacist, Prof. Odidi, others make list of steering c’ttee to set up Edo Diaspora Agency – Nigerian Observer",
    "summarized_story": "The governor had, on Thursday, 5th August 2021, inaugurated the Edo State Head of Service, Anthony O. Okungbowa Esq., as the chairman of 8-man Steering Committee for the setting up of the Diaspora agency, while Mr. Isaac Ebewele serves as secretary.\nOdibo, with over 28 years of cross-industry experience in Consulting, IT/Telecom and Finance in Switzerland is currently a senior consultant at Itau Private Bank Zurich.\nProf. Odidi, who trained at Harvard University, University of London, University of Toronto, and Ahmadu Bello University, is an innovator who co-founded Intellipharmaceutical International Inc., which is listed and trading on two international stock exchanges in the USA and Canada.\nHe has a proven track record and experience in innovation, drug development, testing, clinical trials, regulatory and drug manufacturing.\nThe committee is expected to complete its assignment within a period of thirty (30) days and submit a report to the Edo State Government."
  },
  {
    "headline": "Kidnapped information commissioner regains freedom 5 days after – Family",
    "summarized_story": "ADVERTISEMENTThe Niger State Commissioner for Information and Strategy, Muhammad Idris, who was kidnapped five days ago, regained his freedom around 9.30 p.m. on Thursday, the family has said.\nA member of the family, Ado Ada, who issued a statement on the development, expressed his delight over the victim’s safe return.\nHe said “his release was wholly the result of the efforts of his family and no ransom was paid.\nThe heavily armed gunmen had invaded the commissioner’s residence at the village and whisked him away on foot to an unknown destination.\nThe following day, Monday, the abductors, however, opened discussions with the family which resulted in the release of the victim, though without any ransom paid."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Sterling Bank partners Nexford to create global talent pipeline",
    "summarized_story": "Ukachukwu remarked that the benefits of the partnership for Sterling Bank are multiple.\nThis saves Sterling Bank money on current early stage training to upskill graduates to the required level.\nHe said Sterling Bank will also provide the students with partial scholarships and internships during their studies, in addition to post-graduation job opportunities.\nFadl Al Tarzi, CEO of Nexford University said, “We are delighted to partner with an institution privileged to have such forward thinking leadership.\nOlamidun Majekodunmi, Country Director of Nexford University said, “Our partnership with Sterling Bank is a perfect example of how Nexford is helping to bridge gaps between employers and higher education."
  },
  {
    "headline": "ASSBIFI says 80% of employees in banks, other financial institutions are casual workers",
    "summarized_story": "The Association of Senior Staff of Banks, Insurance and Financial Institutions (ASSBIFI) has said 85 percent of bank and other financial institutions’ employees are casual workers.\nThe association’s president Oyinkansola Olasanoye, who made the disclosure, also lamented the industry poorly remunerated casual workers.\n“Our major problem has been casualisation because, in every bank, insurance company, and the financial institution in Nigeria, as of today, almost 80 per cent of the workers are casual workers,” Ms Olasanoye he said.\n“We respect the casual workers, but we realise that due to inadequate compensation, it is easy for them to be used as frauds,” added the ASSBIFI president.\n“The casual workers are not employees of the institution."
  },
  {
    "headline": "Cholera kills 146 in Kebbi State – Govt",
    "summarized_story": "The government of Kebbi State, through its Epidemic Rapid Response Team, has confirmed that 146 people have died in the state so far following the cholera outbreak this year.\nThis was disclosed by Permanent Secretary, Kebbi Ministry of Health, Dr Aminun Haliru-Bunza, in a meeting with the state Governor, Atiku Bagudu and his Deputy, Col. Samaila Yombe-Dabai (Rtd), on the cholera outbreak in the state on Thursday, according to the News Agency of Nigeria.\nThe Health Commissioner disclosed that the state has recorded a total of 2,208 cases of diarrhoea and vomiting which were reported between January and August this year, citing records from the Sir Yahaya Memorial Hospital, Birnin Kebbi.\nHe said, “Between January and August 2021, 2,208 cases of Diarrhea and Vomiting have been reported in 20 out of 21 Local Government Areas of the state, out of which 55 samples were tested and 26 turned out positive.\n“A total of 146 deaths have been reported across the state, however, the team clarified that for Cholera, a single confirmed case is termed as an outbreak (Epidemic) of Cholera in an area.”He urged the public to adopt measures of personal hygiene and prevent open defecation to slow the spread of the disease in the state"
  },
  {
    "headline": "Kidnapped Niger commissioner freed, family says no ransom paid",
    "summarized_story": "The Niger State Commissioner for Information and Strategy, Muhammad Idris, kidnapped five days ago, has regained his freedom.\nAccording to a statement by his family, his abductors released him at about 9.30 p.m. Thursday night.\nA member of the family, Ado Ada, who issued the statement, expressed his delight over the victim’s safe return.\n“His release was wholly the result of the efforts of his family, and no ransom was paid.\nThe following day (Monday), the kidnappers opened discussions with the family, resulting in Mr Idris’ release, but the family said it paid no ransom."
  },
  {
    "headline": "JUST-IN: Nigerian High Commission In UK Shuts Down Over COVID-19",
    "summarized_story": "The Nigerian High Commission in the United Kingdom has been shut down following reported exposure to COVID-19.\nThis was contained in a statement issued on Thursday August 12, 2021, which was made available to our LEADERSHIP by the Nigerian Ministry of Foreign Affairs in Abuja.\nIt noted that the mission would be closed for 10 working days as an official tested positive to COVID-19.\nADVERTISEMENTThe release titled, ‘Closure of Nigerian High Commission, London’ reads: “The Head of Immigration Section and two other officials went for a meeting at the Home Office.\n“At the entrance, Coronavirus test was administered on them and one of them tested positive to COVID-19."
  },
  {
    "headline": "JUST-IN: Nigerian High Commission In UK Shuts Down Over COVID-19",
    "summarized_story": "The Nigerian High Commission in the United Kingdom has been shut down following reported exposure to COVID-19.\nThis was contained in a statement issued on Thursday August 12, 2021, which was made available to our LEADERSHIP by the Nigerian Ministry of Foreign Affairs in Abuja.\nIt noted that the mission would be closed for 10 working days as an official tested positive to COVID-19.\nADVERTISEMENTThe release titled, ‘Closure of Nigerian High Commission, London’ reads: “The Head of Immigration Section and two other officials went for a meeting at the Home Office.\n“At the entrance, Coronavirus test was administered on them and one of them tested positive to COVID-19."
  },
  {
    "headline": "Keren-Happuch: Mother Of Dead Rape Victim Demands Justice",
    "summarized_story": "The mother of late Keren-Happuch Aondodoo Akpagher, a 14 year-old SS1 student of Premiere Academy Lugbe, Abuja, Mrs. Vivien Akpagher, has cried out for justice.\nLEADERSHIP gathered that the bizarre circumstances surrounding the untimely death of Keren-Happuch have continued to generate angry reactions from her loved ones including her heartbroken mother who is demanding justice for her tragic death.\n“All we need is one press conference to counter all their falsehoods with incontrovertible and undeniable evidence,” Ughegbe stated.\n“During the conversation which was between Keren-Happuch’s mother, Mrs. Vivien Akpagher, the matron of the school, Mrs. Grace Salami, and the head of Pastoral, Mr. Adesanmi they admitted to the mother that they had failed in their responsibility to protect Keren-Happuch.\nIn fact, Mrs Salami concluded that the rape must have been very recent."
  },
  {
    "headline": "Keren-Happuch: Mother Of Dead Rape Victim Demands Justice",
    "summarized_story": "The mother of late Keren-Happuch Aondodoo Akpagher, a 14 year-old SS1 student of Premiere Academy Lugbe, Abuja, Mrs. Vivien Akpagher, has cried out for justice.\nLEADERSHIP gathered that the bizarre circumstances surrounding the untimely death of Keren-Happuch have continued to generate angry reactions from her loved ones including her heartbroken mother who is demanding justice for her tragic death.\n“All we need is one press conference to counter all their falsehoods with incontrovertible and undeniable evidence,” Ughegbe stated.\n“During the conversation which was between Keren-Happuch’s mother, Mrs. Vivien Akpagher, the matron of the school, Mrs. Grace Salami, and the head of Pastoral, Mr. Adesanmi they admitted to the mother that they had failed in their responsibility to protect Keren-Happuch.\nIn fact, Mrs Salami concluded that the rape must have been very recent."
  },
  {
    "headline": "Carry Yourselves With Dignity, Ngige Tell Doctors",
    "summarized_story": "The Minister of Labour and Employment, Sen. Chris Ngige, has advised doctors in the country to be humble and carry themselves with dignity, rather than ‘play God or compete with God’.\nNgige gave the advice while speaking at the 2nd Summit of Medical Elders Forum (MEF) on Thursday, in Abuja.\n“Some of these colleagues were Presidents, Secretary-Generals of the Nigerian Medical Association (NMA) and even NARD,” Ngige asked?\nThe Executive Director, AHBN, Dr Aminu Magashi, noted that for the health system of any country to deliver quality health care services to the population they serve, there must be strong political leadership commitment and effective health system governance.\n“The profession, which is driven largely through the Nigerian Medical Association and its affiliate bodies, has been a major pivot for repositioning and advancing the profession."
  },
  {
    "headline": "Anger, condemnation as FG hikes vehicle number plate, driving licence rates by 50%",
    "summarized_story": "THE Federal Government has commenced the implementation of new rates for vehicle number plates and driving licence across the country.\nAccording to the Joint Tax Board, Nigerians will now pay N18,750 for standard private and commercial number plates against the old rate of N12,500.\nFancy number plate which was N80,000 is now N200,000; motorcycle number plate is N5,000 from N3,000 while articulated number plates (three plates) attract N30,000 from N20,000.\nOut of series number plate has also been revised to N50,000 from N40,000 while government fancy number plate is N20,000 against the former N15,000 rate.\nHe also described as incorrect the report that the standard number plate was N55, 000."
  },
  {
    "headline": "Anger, condemnation as FG hikes vehicle number plate, driving licence rates by 50%",
    "summarized_story": "THE Federal Government has commenced the implementation of new rates for vehicle number plates and driving licence across the country.\nAccording to the Joint Tax Board, Nigerians will now pay N18,750 for standard private and commercial number plates against the old rate of N12,500.\nFancy number plate which was N80,000 is now N200,000; motorcycle number plate is N5,000 from N3,000 while articulated number plates (three plates) attract N30,000 from N20,000.\nOut of series number plate has also been revised to N50,000 from N40,000 while government fancy number plate is N20,000 against the former N15,000 rate.\nHe also described as incorrect the report that the standard number plate was N55, 000."
  },
  {
    "headline": "BBNaija6: How my mother tried to abort me – Angel",
    "summarized_story": "BBNaija6: How my mother tried to abort me – AngelBBNaija6: How my mother tried to abort me – AngelBig Brother Naija Shine Ya Eye housemate, Angel, has revealed that her mother tried to abort her as an unborn child.\nSpeaking from a personal view, Angel shared the travails her mother had to go through as a result of teenage pregnancy.\nYou’re a woman, a young woman.\n‘You’re 16 years and you’re pregnant’, which is what most women go through.\nShe ended her presentation by stating that her mother pushed through hurdles and her being in BBNaija at 21 years is a sign that her mother did something right."
  },
  {
    "headline": "BBNaija6: How my mother tried to abort me – Angel",
    "summarized_story": "BBNaija6: How my mother tried to abort me – AngelBBNaija6: How my mother tried to abort me – AngelBig Brother Naija Shine Ya Eye housemate, Angel, has revealed that her mother tried to abort her as an unborn child.\nSpeaking from a personal view, Angel shared the travails her mother had to go through as a result of teenage pregnancy.\nYou’re a woman, a young woman.\n‘You’re 16 years and you’re pregnant’, which is what most women go through.\nShe ended her presentation by stating that her mother pushed through hurdles and her being in BBNaija at 21 years is a sign that her mother did something right."
  },
  {
    "headline": "Premier League returns: Preview of Brentford vs Arsenal",
    "summarized_story": "The 2021-22 Premier League season will begin today at the Brentford Community Stadium where newly-promoted Bees play host to London rivals Arsenal.\nBrentford, coached by Thomas Frank, are plying their trade in the English top-flight for the first time since 1947.\nTeam NewsStar striker Toney- who fired Brentford to promotion with 33 league goals last term remains at the club despite several interests from top-flight outfits- is expected to be fit to start today’s game.\nBrentford possible starting lineup:Raya; Jansson, Ajer, Pinnock; Roerslev, Janelt, Onyeka, Norgaard, Henry; Mbeumo, ToneyArsenal possible starting lineup:Leno; Chambers, White, Mari, Tierney; Xhaka, Lokonga; Pepe, Smith Rowe, Aubameyang; Lacazette.\nFact: The last time Arsenal visited Brentford in league action was May 1947."
  },
  {
    "headline": "Jose Mourinho wants Iheanacho at Roma",
    "summarized_story": "Agency ReportJose Mourinho and AS Roma are considering making an offer for Kelechi Iheanacho if they fail to sign Tammy Abraham.\nIheanacho signed a new three-year Leicester City contract in April but he is now reported to be a transfer target for Jose Mourinho’s AS Roma.\nThe Serie A club have already agreed to a £34million deal with Chelsea for Abraham, but the 23-year-old England international has asked for time to think about the offer.\nThe 23-year-old England striker must now decide if he wants to join the Italian club, which are managed by former Chelsea boss Jose Mourinho.\nDespite his limited game-time during the second half of last season, Abraham ended the campaign as Chelsea’s joint-top scorer with 12 goals."
  },
  {
    "headline": "New Documentary On #EndSARS To Premiere August 28",
    "summarized_story": "On August 28, a new film inspired by the horrific events that resulted in the shooting of #EndSARS demonstrators at the Lekki toll plaza in Lagos on the night of October 20, 2020, will be released.\nThe new documentary, named “ENDSARS Documentary,” aims to rekindle debates about #EndSARS and the circumstances that led to the historic movement, according to the film’s makers.\nAccording to the statement, the trailer to the documentary will be released on August 26 via all social media handles of global streaming platform Meroestream.\nThis would then be followed by the actual premiere on August 28, still on Meroestream.\nThe documentary was produced by award-winning journalist and film producer Seun Oloketuyi alongside an associate producer Rolake Adesina."
  },
  {
    "headline": "FG Reopens Eko Bridge, Begins Repair Of Airport Flyover",
    "summarized_story": "On Friday, August 13, the Federal Government declared that the Eko Bridge, which had been closed for renovations, would reopen to traffic.\nFrom August 13, he added, traffic would be redirected for the rehabilitation of the burned-out Lagos Airport flyover.\n“The Alaka to Costain section of Eko bridge which was closed to traffic since 4th June, 2021 will now be opened on Friday 13th August 2021.\nHe also stated that extra maintenance on the Eko bridge would not necessitate its closure.\nOn June 4, the Eko Bridge was closed and traffic was redirected for the second phase of the bridge’s renovation in the Costain direction."
  },
  {
    "headline": "BREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests",
    "summarized_story": "The Nigerian High Commission in London has ceased operations due to daily protests by Nigerians who have joined the #BuhariMustGo and #RevolutionNow movements and assembled at the commission.\nThe Nigerian Mission, embarrassed by the gatherings that were placing President Muhammadu Buhari and his associates under pressure, declared its closure for ten days, according to SaharaReporters.\n“Nigeria has temporarily shut its UK Embassy due to embarrassment by #BuhariMustGo protesters.\nSaharaReporters were able to capture video showing London police officers chatting with Nigerian demonstrators and appearing to be pleasant.\n“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London."
  },
  {
    "headline": "BREAKING: Abducted Niger Commissioner Regains Freedom",
    "summarized_story": "Alhaji Mohammed Sani Idris, the kidnapped Niger state Commissioner for Information, has been released.\nHe was released on Thursday night, according to THISDAY.\nHe was “hale and hearty,” according to a reputable source at the Ministry of Information.\nThe source did not say how the commissioner was freed or whether a ransom was paid.\nDetails later…"
  },
  {
    "headline": "Abdusalami at IBB dialogue, speaks on why separation will be difficult",
    "summarized_story": "Leading the pack of guests comprising associates and former aides to Babangida was a former Head of State, General Abdulsalami Abubakar (retd).\nThe roll call also had Alhaji Bello Maitama, Professor Sam Oyovbaire, Major-General Tunji Olurin (retd), Professor Adele Jinadu, and former Lagos state governor under the regime, Brigadier-General Olagunsoye Oyinlola (rtd) in attendance.\nThe occasion was theIbrahim Badamasi Babangida Legacy Dialogue 2021 put together by the Ibrahim and Maryam Babangida Library and Museum.\nHe further said, upon graduating from secondary school, Babangida joined the military, where “as an officer and gentleman, the ex-Head of State, also displayed his leadership qualities.\n“When you know General Babangida, you will understand that these narratives did not fit the picture."
  },
  {
    "headline": "VIDEO: Kidnapped Niger information commissioner regains freedom, reunites with family",
    "summarized_story": "NextAbdusalami at IBB dialogue, speaks on why separation will be difficult"
  },
  {
    "headline": "Breaking: Nigeria shuts high commission office in UK as officials test positive for COVID-19",
    "summarized_story": "The Nigeria High Commission in London, the United Kingdom, has been shut down for 10 days after two of its officials tested positive for COVID-19.\nAn official memo which disclosed the latest development direct those who had contact with the affected officials to go on mandatory isolation.\n“At the entrance, COVID test was administered on them and one of them tested positive to COVID-19.\nThe affected officer immediately isolated while the other officials, who tested negative, will also isolate for the next 10 days.\n“In response to this challenge, the Mission embarked on testing all officials of the mission, after which another official of the Mission tested positive."
  },
  {
    "headline": "Photo Op of the Flag off of construction of access road and car park of the Kagini Train Station -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "ICRAD uncovers imposition of illegal fees in FCT Secondary Schools -NigPilot",
    "summarized_story": "In its petition letter, ICRAD explained that the affected students are being compelled to pay the sum of N1, 500 per session outside the official fees recognized by the Federal Capital Territory Administration FCTA for secondary school students.\n“It has come to our notice that the Senior Secondary School Students in the FCT, particularly those in SS1 and 2 are being forced to pay the sum of N1, 500 per session outside the official fees recognised by the FCTA.\n“This fee surreptitiously tied to School Management Systems, only allow the students to check their results online.\n“Surprisingly is the fact that the fees is not paid into any of the recognised school account linked to government Treasury Single Account TSA, but into a private company’s account.\n“Assuming without conceding that the said fee is for consulting services rendered to FCT secondary school board, it is the responsibility of the board to pay for consultancy under the Public Procurement Act and not the students."
  },
  {
    "headline": "FG laments over 130bn unutilised UBEC counterpart funds -NigPilot",
    "summarized_story": "Federal Government has described as regrettable the inability of some states of the Federation in accessing counterpart funds from the Universal Basic Education Commission, UBEC, for developing primary education in their States.\nEducation Minister, Adamu Adamu, who stated this at this year’s 65th National Council on Education meeting in Jalingo, Taraba State, said, over One Hundred and Thirty Billion Naira (#130,000,000,000)in UBEC custody is still unutilised due to the inability of states to provide their 50 percent counterpart funds.\nSpeaking through the Minister of State for Education, Hon Chukwuemeka Nwajiuba, the Minister said, the affected states need to reprioritize basic education as it is the bedrock for further and continuing education, too strategic to be ignored.\nEmphasising the need for co-operation from the states, Adamu Adamu said the tasks of developing education at all levels, securing our children and ensuring basic sanitation in our schools requires that all hands must be on deck to achieve the desired results.\nPresident of the Association of Proprietors of private schools, Evangelist Ajibade Augustine stated that members of the Association are more than ever before, determined to take more children off the streets in their efforts at eradicating the out of school children phenomenon."
  },
  {
    "headline": "2023: Race for APC Nat. Chairmanship gets tougher as Yuguda throws hat in the ring -NigPilot",
    "summarized_story": "One-time Minister of State for Transport and former governor of Bauchi State, Mallam Isa Yuguda , has joined other top political gladiators from the north in the race for the national chairmanship of the ruling All Progressives Congress, APC.\nHe said, “I was privileged to serve in Nigeria for six years as Minister and eight as governor.\nI think I have served long enough in the Villa to know the dynamism in the power at the center.\nI’m the dullest person, at least I still have to offer something that will be meaningful.\n“I believe we are here to begin a journey we will never regret, a journey that will be sustainable."
  },
  {
    "headline": "Nigeria Records 753 More COVID-19 Cases, Five New Deaths",
    "summarized_story": "Nigeria has recorded 753 more cases of coronavirus disease (COVID-19) with five new fatalities in the past 24 hours.\nWhile Lagos remains the epicentre of the virus with 364 new cases, FCT recorded 12 infections with Akwa Ibom coming second on the list with 141 cases.\nThe single-shot J&J vaccine was acquired through the African Vaccine Acquisition Trust (AVAT), with support from Afrexim bank.\nMore of the J&J vaccines are expected in the country.\nNigeria is expected to step up its Covid-19 vaccination program after receiving over four million doses of the Moderna vaccine from the US government last week."
  },
  {
    "headline": "Marburg Virus: Nigeria At Low Risk, Says NCDC",
    "summarized_story": "﻿Nigeria is at low odds of an outbreak of the Marburg virus, the Federal Government disclosed on Friday.\nMarburg, a highly dangerous pathogen that causes haemorrhagic fever, was first identified in Germany in 1967 and was recently confirmed in Guinea.\nREAD ALSO: Factfile: The Marburg Virus, Ebola’s Deadly Cousin“We are very aware and it tells us that we have to always be on our guard here.\nWe set up a risk analysis team yesterday, evaluated the risk for Nigeria.\nThe virus is part of the so-called filovirus family to which the Ebola virus also belongs."
  },
  {
    "headline": "Boko Haram Surrender: It Should Not Be Blanket Amnesty And Pampering – Ndume",
    "summarized_story": "Chairman of the Senate Committee on Army, Senator Ali Ndume, has reaffirmed his stand against blanket amnesty for repentant Boko Haram fighters.\nSpeaking on the development as a guest on Channels Television’s Politics Today, Senator Ndume noted that this did not come to him as a surprise.\n“It is only that, as I have said before, there shouldn’t be blanket amnesty and pampering treatment to those who have surrendered,” the lawmaker said.\nREAD ALSO: More Boko Haram Members Surrender In Borno, Beg For ForgivenessAccording to him, what needs to be done now is to ensure that the seemingly contrite insurgents are carefully profiled without any rush to have them return back to the community.\nThe legislator is of the opinion that the army should be more focused on ensuring that the Boko Haram war is brought to an end even faster than it has been predicted in various quarters."
  },
  {
    "headline": "Nigerian High Commission In London Closes After Two Officials Test Positive For COVID-19",
    "summarized_story": "The Nigerian High Commission in London has been closed for 10 days after two officials tested positive for COVID-19.\nThe High Commission stated this in a statement on Thursday night.\n“This afternoon, the Head of Immigration Section and two other officials went for a meeting at the Home Office,” it said in the statement.\n“At the entrance, COVID test was administered on them and one of them tested positive to COVID-19.\nThe affected officer was immediately isolated while the other officials who tested negative will also be isolated for the next 10 days.”The Mission explained that, as a result, it began testing all officials after that, leading to another positive case."
  },
  {
    "headline": "Police Arrest 15 Suspected Cultists In Nasarawa",
    "summarized_story": "The Police have arrested 15 suspected cultists who admitted to belonging to Vikings and Black Axe confraternity in Nasarawa.\nIn a statement by the spokesman of the command, ASP Ramhan Nansel, the suspects were arrested in Lafia on Tuesday following an intelligence gathering that rival cult groups were planning to attack each other.\nHe said, the Commissioner of Police CP Adesina Soyemi, swiftly mobilised a team comprising of personnel of the Police Command’s Anti-cultism, Anti-kidnapping and SWAT which stormed the cultist hideouts at Transformer and D.D world street located at Ombi1, opposite Isah Mustapha Agwai Polytechnic and arrested the suspects.\n“In furtherance to the above, the Commissioner of Police wishes to assure the good people of the State of comprehensive security coverage and advised Parents and guardians to caution their wards and proteges to refrain from any unlawful gathering.”He warned hoteliers, proprietors of lounges and other recreational facilities against consenting to the use of their facilities/properties to aid cult-related activities as owners of such facilities are liable for prosecution as well.\nThe CP has ordered all the suspects be charged to court upon conclusion of the investigation and however, warned all criminals to flee from Nasarawa State as the Police Command will make the state too hot for them."
  },
  {
    "headline": "Marwa commends German govt over 2m Euro dog facility for NDLEA",
    "summarized_story": "Chairman/Chief Executive of the National Drug Law Enforcement Agency, NDLEA, Brig.\nGen. Mohamed Buba Marwa (Retd) has commended the German government over ongoing efforts to boost the operational capability of the Agency with a world-class narcotic detection dog training facility.\nHe expressed appreciation for past supports to the NDLEA especially in the areas of training, supply of drugs detection dogs, and vehicles, adding that the 2million euro dog training school being planned for the agency will further boost NDLEA’s operations.\nAs such, he urged the German government to consider donating more dogs to the agency to be able to cover more areas of responsibility.\nHe assured that the dog school project where more narcotic detection dogs will be deployed and groomed will be completed in phases between the next three to four years."
  },
  {
    "headline": "Van Dijk signs new 4 year deal with Liverpool",
    "summarized_story": "Liverpool defender Virgil Van Dijk has signed a new four-year deal, the club announced on Friday.\nThe Netherlands international is set to make his return to first-team action after almost a year out with a knee injury when Liverpool kick-off their 2021-22 Premier League campaign against Norwich City on Saturday.\nVan Dijk is the latest Liverpool player to sign a new long-term extension, with goalkeeper Alisson Becker, defender Trent Alexander-Arnold and midfielder Fabinho all inking new deals in the past month.\n“I feel good,” Van Dijk added.\nHe also won the Champions League title in 2019 in the same season that he was voted PFA Player of the Year and UEFA Defender of the Season."
  },
  {
    "headline": "NIM, Freshbreed Leaders, NCFront, others mourn Mohammed Fawehinmi",
    "summarized_story": "Leaders of Conscience have condoled with the family of Fawehinmi over the sudden passing of Mohammed Fawehinmi, the Scion of the Gani Fawehinmi dynasty.\nThe group is comprised of National Consultative Front, NCFront and Freshbreed Leaders under the broad civil society platform known as the Nigeria Intervention Movement, NIM .\nOkunniyi said Nigeria and the entire human race have lost an indefatigable enigma of a great potential, who was a terror to the oppressors of the masses.\nHe said Mohammed was an icon and a selfless defender of people’s rights throughout his adult life, always challenging the excesses of government and the ruling class.\nThe Groups further asserted that the Nigerian civil society has lost an emerging giant in the current rescue mission of leaders of conscience and Freshbreed leaders ahead of its planned 2023 intervention."
  },
  {
    "headline": "Vote Count Begins in Zambia’s Closely Fought Elections",
    "summarized_story": "Electoral officials in Zambia has commenced vote counting following the successful staging of the southern African nation’s general elections.\nSome voters complained about the slow pace of voting in an election that is seen as a test of Zambia’s democracy.\nPresident Edgar Lungu deployed more troops in parts of the country to quell election violence in the tightly contested polls pitting him against long-time rival Hakainde Hichilema.\n“How can you talk about free and fair elections when our opponents have taken this election as war?” he said.\nAddressing opposition fears of fraud, Hichilema said Zambia’s next leader “must be determined by the… voters, not the people who count the votes”."
  },
  {
    "headline": "South Africa Wants More Men to Take Covid Jabs",
    "summarized_story": "South Africa has urged more men in the country to come out in larger numbers and take Covid jabs as their numbers trails that of women.\nAbout 60% of vaccines have been administered to women, health officials noted on Friday during a media briefing on the government’s efforts in the fight against the disease.\nHealth Minister Joe Phaahla ruled out the easing of Covid restrictions despite a “downward trend” in infections.\nSouth Africa has so far registered 2,568,511 cases of Covid and 76,243 deaths.\nIt has the most cases in Africa."
  },
  {
    "headline": "Sudan, ICC Sign Cooperation Deal, as Darfur Trials Inch Closer",
    "summarized_story": "Sudan has signed a cooperation deal with the International Criminal Court, a step further towards ex-dictator Omar al-Bashir facing trial for genocide in the Darfur conflict.\nBashir, 77, has been wanted by the ICC for more than a decade over charges of genocide, war crimes and crimes against humanity in the Sudanese region.\nTwo other former aides are also wanted to face war crimes charges.\nThe ICC issued an arrest warrant for Bashir in 2009 for war crimes and crimes against humanity in Darfur, later adding genocide to the charges.\nBashir is jailed alongside two other former top officials facing ICC war crimes charges — ex-defence minister Abdel Rahim Mohamed Hussein and Ahmed Haroun, a former governor of South Kordofan."
  },
  {
    "headline": "Nigeria: APC, PDP Are the Same, Former Presidential Aide Okupe Says",
    "summarized_story": "Doyin Okupe, a former senior aide to ex-Nigerian President Goodluck Jonathan says the ruling All Progressives Congress (APC) and the country’s opposition People’s Democratic Party (PDP) are one and same.\nAccording to the physician turned politician, there’s not much separating the two Nigerian political parties as seventy per cent of people who control power in the APC today were all members of the PDP.\nMr Okupe stated this on Friday when he featured on an ARISE News programme, The Morning Show.\nHe mentioned the present and former governors of Ogun state as members who have held sway in the PDP but now find themselves as leaders in the APC.\nHe also said the whole uproar of national officers resigning in the PDP, as well as the crisis rocking the APC, are just moves towards the 2023 elections."
  },
  {
    "headline": "Six People Killed in Mass Shooting in Plymouth, England",
    "summarized_story": "Six people, including a child, were killed in a mass shooting in the city of Plymouth in southwest England on Thursday evening, in an incident described by the British Home Secretary as “shocking”.\nPolice had earlier described the shooting as a “serious firearms incident” and said the situation was contained.\nThe United Kingdom has one of the lowest gun homicide rates in the world, and mass shootings are rare.\nThis was the first mass shooting in the country for 11 years.\n“The incident in Plymouth is shocking and my thoughts are with those affected,” Home Secretary Priti Patel said on Twitter."
  }
]