[
  {
    "headline": "BREAKING: IPOB threatens one month sit-at-home protest in South-East if…",
    "summarized_story": "The Indigenous People of Biafra has threatened a one-month sit-at-home protest in ‘Biafraland’ if its leader, Nnamdi Kanu, is not brought to court on October 21.\nHe said IPOB got from a reliable source that the Department of State Services would not bring Kanu to court on October 21 as a ploy to continue to incarcerate him.\n“The Federal Government of Nigeria has again perfected plans not to bring him to court on that day.\nIf by October 21, Kanu is not brought to court, Nigeria will know that Kanu commands the unflinching loyalty of over 60 million Biafrans home and in Diaspora.\n“Their plan is to silence agitations for freedom as championed by Nnamdi Kanu and Sunday Ighoho so that the Fulani from across Africa will overrun Nigeria."
  },
  {
    "headline": "BREAKING: Lawan names conference committee for Electoral Act amendment",
    "summarized_story": "The President of the Senate on Wednesday named the Senate Leader, Abdullahi Yahaya as the Leader of the seven-member conference committee to meet with the House of Representatives team to iron out the contentious aspects of the Electoral Act (amendment) Bill.\nOther members of the Senate committee are, Kabiru Gaya (North-West), Ajibola Basiru (South-West), Danjuma Goje (North-East), Uche Ekwunife (South-East), Sani Musa (North-Central), and Mathew Urhoghide (South-South).\nA close observation of the seven-member committee members revealed that only one of them (Urhoghide) voted in support of the electronic transmission of results when there was a division on the issue.\nEkwunife was not available to cast her vote while the remaining four voted against the electronic transmission of results until the Independent National Electoral Commission got approval from the Nigerian Communication Commission and the National Assembly.\nDetails later…"
  },
  {
    "headline": "Breaking: Senate sets up 7-member Conference Committee on Electoral Act Amendment Bill",
    "summarized_story": "By Henry Umoru – AbujaThe Senate has set up a Conference Committee to harmonize positions on the Electoral Act Amendments Bill.\nPresident of the Senate, Senator Ahmad Lawan who announced this Wednesday during plenary, said that the conference Committee will work with that of the House of Representatives in order to be on the same page on Electronic transmission of results by the Independent National Electoral Commission, INEC.\nAccording to Lawan, Senate Leader, Senator Yahaya Abdullahi, APC, Kebbi North will be the leader of the team.\nProvisions of clause 52(3) of the Electoral Act ( Amendment ) Bill 2021 sharply divided the Senators across party lines during consideration of the entire report.\nThe clause which as recommended by the Senate Committee on Independent National Electoral Commission ( INEC) provides for electronic transmission of election results by INEC where and when practicable was rejected by an amendment raised by Sabi Abdullahi."
  },
  {
    "headline": "Police retirees say benefits “too poor”",
    "summarized_story": "Some senior Police retirees based in Edo have decried what they referred to as “poor retirement benefits” after their service years.\nThe retirees, who were at the headquarters of the state’s Police Command in Benin, also called on the authorities of the Nigeria Police Force to yank them off the current Police contributory pension scheme.\nRetired SP Anthony Nnachor, Chairman, Edo Police Senior Officers Retirees, who led the retirees to the command, claimed that Police retirees were the least paid among security agencies in the country.\nHe also appealed to the Federal Government to review the Police scheme and return the pension scheme to the Police-defined benefit of old.\nResponding to the retirees’ demands, Mr Miller Dantawa, Deputy Commissioner of Police in charge of Operations in the state, said that serving policemen were also in pains over the plight of the retirees."
  },
  {
    "headline": "Commodity terms of trade declines in Q2’21 ― NBS",
    "summarized_story": "By Elizabeth AdegbesanThe National Bureau of Statistics, NBS, said the All- products terms of trade (TOT) index decreased by 0.35 per in the second quarter of the year (Q2’21).\nThis was due to declines in the prices of live animals, animal products, wood and articles of wood; wood charcoal and articles, vehicles, aircraft, and parts thereof, vessels among others.\nThe terms of trade (TOT) represent the ratio between a country’s export prices and its import prices.\nDuring the period under review, America recorded 3.46 per cent, Europe 0.56 per cent, Oceania 0.27 per cent and Asia 0.18.\nThe month–on–month changes show an increase of 0.48 per cent in May and 0.23 per cent in June .”Vanguard News Nigeria"
  },
  {
    "headline": "2023: ADC reprimands NEF, says enough of this dichotomy",
    "summarized_story": "Recall Baba-Ahmed had also said the North has the majority number to produce Nigeria’s president without recourse to any rotational arrangement.\nAccording to him, “I am infuriated when any of our respected public intellectuals sounds this way.\nReducing our rich knowledge to North and South thinking creates the kind of dichotomy that impedes development and the kind of national cohesion needed to leverage our various people.\n“Holding unto leadership by any group and creating the kind of poverty, insecurity, and division we have now leverages none.\nI feel serious that aiming to use the gaps in the democratic process to dominate others or threaten them hurts everyone."
  },
  {
    "headline": "Varsity Pro-Chancellors appoint Prof Dimkpa Briggs as Chairman",
    "summarized_story": "By Joseph ErunkeABUJA–THE Committee of Pro – Chancellors of Nigerian Federal Universities has named Prof. Nimi Dimkpa Briggs as its chairman.\nHe takes over from Professor Munzali Jubril, Pro -Chancellor of Federal University Lafia who, has been chairman since 2017.\nBashirDalhatu was appointed the Deputy Chairman.\nAlhaji Bashir is the current Chairman of Council and Pro – Chancellor of Moddibo Adama University Yola.”“I wish the two leaders of the committee success as they take over.\nthe mantle; of leadership,” the committee’s Secretary-General said in the statement."
  },
  {
    "headline": "Electoral Amendment Bill: Lawan constitutes Conference Committee",
    "summarized_story": "Senate President, Dr Ahmad Ibrahim Lawan has constituted a Conference Committee for the 2021 Electoral Act Amendment Bill which was passed into law few weeks before the parliamentarians went on a two-month annual recess.\nThe upper and lower legislative chambers passed different versions of the bill that necessitated a harmonisation before transmitting the final copy to President Buhari for assent.\nThe Committee, which was set up on Wednesday, has the Senate leader, Senator Abdulahi Yahaya as Chairman.\nOther members of the Committee are: Sen.Kabiru Gaya, Sen.Uche Ekwunife, Sen. Danjuma, Sen.Mathew Urhoghide, Sen.Surajudeen Basiru, and Sen.Sani Musa.\nDAILY POST recalled that the Senate passed the bill into law on July 15 amid controversies on section 52 of the Bill."
  },
  {
    "headline": "EKSU warns ASUU against disrespecting, maligning varsity’s Governing Council",
    "summarized_story": "Olanipekun said this on Wednesday while addressing journalists in Ado Ekiti on alleged unruly action taken against the Governing Council ASUU.\nThe VC , who debunked the accusations, expressed regret at how the ASUU members had barged into the Council meeting and brought a stalemate.\nThey just invaded the Council meeting even without notice.\n“Despite the provocation, the council still went ahead and directed that some of the ASUU’s demands should be met.\nOn whether the Council would wield the big stick against unruly ASUU members, the VC said: “The Council out magnanimity had decided to overlook the ASUU’s action and extended hands of fellowship to them”."
  },
  {
    "headline": "Insecurity: We’ll defend our land with every legal means – Zangon Kataf’s Atyap people",
    "summarized_story": "The natives of the Atyap Chiefdom in Zangon Kataf Local Government Area of Kaduna have said they will do all it takes to defend themselves following the incessant attacks and killings of their people by suspected Fulani militias.\nRecall that the Atyap chiefdom in Zangon Kataf had of recent come under heavy attacks resulting to killing, maiming, destroying of houses and places of worship as well as destruction of crops in farmlands.\nThe President, Atyap Community Development Association (ACDA), Dr Samuel Achie, in a statement cried out that their chiefdom was under siege by Fulani attackers and vowed that they would embrace any lawful means to protect themselves from going into extinction.\nHe, however, called on the Federal Government and the international community to come to the aide of the Atyap people before it is too late, saying that many people have been rendered homeless with nothing to feed on following the massive destruction of the suspected Fulani militias.\nHe added that the attacks on the villages by the suspected Fulani militias continued unabetted, saying that besides those killed, many injured with houses and crops in farmlands destroyed beyond imagination."
  },
  {
    "headline": "Nnamdi Kanu vs Buhari govt: IPOB threatens one month lockdown, gives reason",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Wednesday threatened to declare a month-long “lockdown” over its leader, Nnamdi Kanu’s incarceration.\nIPOB vowed to declare a one month lockdown across the Southeast, if the Federal Government refuses to produce Kanu in court.\nIn a statement, Powerful claimed that the plot was to demoralise Kanu and the Biafra agitation.\nIf by October 21, Kanu is not brought to court, Nigeria will know that Kanu commands the unflinching loyalty of over 60 million Biafrans home and in Diaspora.\nTheir plan is to silence agitations for freedom as championed by Nnamdi Kanu and Sunday Ighoho so that the Fulani from across Africa will overrun Nigeria."
  },
  {
    "headline": "Emir of Gaya, Alhaji Abdulkadir dies in Kano",
    "summarized_story": "The Emir of Gaya, Alhaji Ibrahim Abdulkadir, is dead.\nThe Emir, who has been sick, died on Wednesday morning in KanoDetails later…"
  },
  {
    "headline": "BREAKING: House of Reps receives MTEF report",
    "summarized_story": "By Tony Akowe, Abuja- Advertisement -The House of Representatives on Wednesday recieved the report of its Committee on Finance on the Medium Term Expenditure Framework and Fiscal Strategy Paper(MTEF) for 2022 to 2024.\nThe MTEF/FSP is the template on which the annual budget preparation is based.\nThe MTEF document, submitted to the National Assembly in July, was referred to the House Committee on Finance to interrogate and make recommendation to the House before the 2022 budget is presented by the President.\nThe Committee Chairman, James Faleke, submitted the report to the House at Wednesday plenary.\nIt was earlier scheduled for presentation and consideration on Tuesday but was stepped down."
  },
  {
    "headline": "BREAKING: Panic as gunmen kill two policemen, injure three at Enugu checkpoint",
    "summarized_story": "By Damian Duruiheoma, Enugu- Advertisement -Two policemen were on Wednesday morning killed by gunmen at Nachi community in Oji River Local Government Area of Enugu State.\nThree other cops also sustained severe gunshot injuries in an attack that happened at a police checkpoint in the area around 9am.\nThe Nation learnt that the policemen were on duty at the checkpoint when the gunmen took them unawares and attacked them.\nThe deceased died on the spot as the gunmen shot sporadically until they left the scene.\nEnugu police spokesman Daniel Ndukwe said the Command had launched a full scale investigation into the incident with a view to tracking down the assailants."
  },
  {
    "headline": "BREAKING: Senate constitutes conference committee on Electoral Act",
    "summarized_story": "According to Lawan, the Senate Leader, Senator Yahaya Abdullahi, is to serve as the leader of the Senate conference committee.\nOther members of the committee are the Chairman of the Senate Committee on the Independent National Electoral Commission (INEC), Senator Kabiru Gaya representing North West, Senator Danjuma Goje (North East) and Senator Sani Musa (North Central).\nOthers are Senator Matthew Urhoghide (South South), Senator Ajibola Basiru (South West) and Senator Uche Ekwunife (South East).\nThe two Chambers had passed the Electoral Act Bill without agreement on the mode of transmission of election results.\nOnly Senator Urhoghide voted for electronic transmission of election results while Senator Ekwunife was absent during the voting exercise."
  },
  {
    "headline": "11 in race for APC national chairman",
    "summarized_story": "The two major national conventions that produced the former National Working Committees (NWC) did not generate the kind of attention the forthcoming national convention is currently generating.\nSome elements in the defunct Congress for Positive Change (CPC) have mounted a campaign for the bloc to produce the next national chairman.\n“My dealings as a national chairman will exhibit absolute transparency in the party’s affairs as one of its hallmarks.\nBoth ACN and ANPP blocs have had their slots; it is the turn of the CPC bloc to produce the next national chairman.\nHe is perceived as the most eligible aspirant to occupy the position of APC national chairman."
  },
  {
    "headline": "BREAKING: Gunmen attack police checkpoint in Enugu, kill 2 cops",
    "summarized_story": "From Geoffrey Anyanwu, EnuguThe Enugu State Police Command has suffered another loss in the hands of unknown gunmen as it lost two policemen to bullets of the hoodlums.\nThe two policemen were said to be on duty at a checkpoint at Nachi in Oji River local government of the state with the colleagues when the gunmen unexpectedly attacked and shot them.\nWhen contacted, the State Police Public Relations Officer, Daniel Ndukwe said the Command had commenced action to track down the killers of the cops.\nHe said: “Full-scale investigation that will lead to fishing out of the assailants has commenced.\nFurther development will be communicated, please.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "2023: Northern, southern leaders join forces to fight PDP, APC",
    "summarized_story": "In his welcome address, Bugaje identified poor leadership recruitment process at the heart of the problems confronting the country.\nIn other words when you reduce the problems of this country to what they are, ultimately, it all comes to leadership.\nWe knew we wouldn’t need their agreement before we said that we are not going to have presidency in the North in 2023.\n“It was the support of the south that made President Buhari to win his elections in 2015 and 2019.\nWe are very surprised that Hakeem has suddenly forgotten so soon how President Buhari emerged as president."
  },
  {
    "headline": "The Sun award, call to more duty –Kyari, NNPC GMD",
    "summarized_story": "The Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari, has described his nomination for The Sun Man of the Year 2020 Award as a loud call to double his efforts in delivering on his mandate .\nHe stressed that singling him out forcthe award in the midst of millions of illustrious Nigerians would propel him to surpass his current feat.\nThe NNPC boss said: “I wonder if I do deserve this award because I’m just doing what I have to do as NNPC GMD.\n“Last year, NNPC recorded major strides in the gas sector with the commissioning of the Oredo Integrated Gas Handling Facility (IGHF) and the Liquefied Petroleum Gas Storage and Dispensing Unit, constructed to address domestic gas supply challenges.\nOther award winners are Mr. Moses Ekpo, deputy governor of Akwa Ibom State, Chief Olabode George, Prof George Obiozor, President-General of Ohanaeze Ndigbo Worldwide and Amb."
  },
  {
    "headline": "Buhari returns petroleum industry law to NASS for amendments – The Sun Nigeria",
    "summarized_story": "From Fred Itua, AbujaThe Senate, yesterday, received a request from President Muhammadu Buhari, to amend the Petroleum Industry Act (PIA) 2021 passed by the National Assembly over two months ago.\nThe request was contained in a letter dated September 16, 2021, and read during plenary on Tuesday by Senate President, Ahmad Lawan.\nIn addition, the president proposed a deletion of Sections 11(2)(f), 11(2)(g), 34(2)(f) and 34(2)(g) from the Petroleum Industry Act, which would see to the removal of the Ministries of Petroleum and Finance form the Board of the Nigerian Petroleum Regulatory Authority and Upstream Regulatory Commission.\n“This will ensure effective management of the regulatory institutions through uniform implementation of public service rules for employees of the Authority.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "FG probes fraud in COVID-19 vaccination",
    "summarized_story": "From Fred Ezeh, AbujaFederal Government said it had uncovered fraud in the administration of COVID-19 vaccines that had to do with people trying to get vaccination cards without being vaccinated.\nIn response, it said the State Security Services (SSS), ICPC and other law enforcement agencies have been engaged to investigate and prosecute persons and their accomplices attempting to fraudulently acquire vaccination cards.\nHe insisted that ongoing COVID-19 vaccination and vaccination cards were free of charge at all designated sites across the 36 states and the FCT.\nHe insisted that possession of vaccination cards without receiving the vaccines is criminal and punishable by law.\n“In this second phase of the vaccination rollout, we’ve had 4,349 reports of non-serious AEFI cases and 40 reports of serious AEFI cases with the Moderna vaccines."
  },
  {
    "headline": "Buhari Proposes New Amendments to PIA, Nominates Regulatory Boards",
    "summarized_story": "Buhari, in a letter read yesterday on the floor of the senate, also sought an increase in the membership of the board of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA).\nBuhari explained that the appointment of two non-executive members to the board of the midstream, downstream and upstream commissions, as provided for by the Act, did not reflect balanced geopolitical representation.\nFor the upstream, the president nominated Isa Ibrahim Modibbo as Chairman, while Mr. Gbenga Komolafe was selected as Chief Executive Officer.\nThis saved Nigeria monies that had perennially been expended on national downstream petroleum assets maintenance, operations and security.\nHe was also General Manager, Operations, Petroleum Equalisation Fund (PEF); and General Manager, Operations, Petroleum Products Pricing Regulatory Agency (PPPRA), among several other positions."
  },
  {
    "headline": "Banditry Has Transformed into Insurgency, Time to Eliminate Them, Masari Warns",
    "summarized_story": "He said: “From experiences of other countries, you need to liquidate banditry and insurgency completely.\nI said it before let me repeat it again, the issue of banditry in Katsina, Zamfara, Sokoto, Kebbi, part of Niger and Kaduna States has no religious problem and tribal.\nEarlier, the Minister, Mohammed said the security measures adopted by the Masari-led government in combating banditry were yielding positive results.\nAccording to him, “From experiences of other countries, you need to liquidate banditry and insurgency completely.\nMohammed, who spoke earlier, said the security measures adopted by the Masari-led government in combating banditry were yielding positive results."
  },
  {
    "headline": "In Show of Strength, Nigeria Raises $4bn through Eurobonds",
    "summarized_story": "Ndubuisi FrancisNigeria has raised $4 billion through Eurobonds, which was a reflection of investors’ confidence in the economy.\nAccording to the DMO, bids for the Eurobonds were received from investors in Europe and America, as well as Asia.\nAccording to the statement, the size of the Order Book and the quality of investors demonstrates confidence in Nigeria.\nIt further explained that when Nigeria raised funds externally through Eurobonds, it freed up space in the domestic market for private sector and sub-national borrowers.\nThe issuance of Eurobonds by Nigeria has opened up opportunities for Nigeria’s corporate sector, notably banks, to issue Eurobonds to raise capital in the ICM.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Senate Gives Committee One Week to Consider Buhari’s $4.05bn, €710m Loan Request",
    "summarized_story": "Deji Elumoye in AbujaPresident of the Senate, Dr Ahmad Lawan, has referred the request of President Muhammadu Buhari, seeking to borrow $4.054bn, €710m, $125m external loans to the Senate Committee on Foreign and Local Debts for further legislative action.\nLawan at Tuesday’s plenary asked the Committee, chaired by Senator Clifford Ordia, to work on the Buhari’s request and submit its report next Tuesday.\nThis directive was sequel to a motion to that effect moved by the Senate Leader, Senator Yahaya Abdullahi, and seconded by the Minority Leader, Senator Enyinnaya Abaribe.\nThe Senate had upon resumption from two-month annual recess last week received a formal request from President Buhari to consider and approve an external loan to fund projects captured under the 2018-2021 borrowing plan.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Nominates Boards for EFCC, Upstream Regulatory Commission, Petroleum Regulatory Authority",
    "summarized_story": "*Seeks senate confirmationDeji Elumoye and Juliet Akoje in AbujaPresident Muhammadu Buhari has written three letters to the Senate for the confirmation of nominees into the boards of the Nigerian Midstream and Downstream Petroleum Regulatory Authority, Upstream Regulatory Commission and the Economic and Financial Crimes Commission (EFCC).\nThe three confirmation letters from the President were read at Tuesday’s plenary by Senate President, Dr Ahmad Lawan.\nThe nominees for confirmation into the Nigerian Petroleum Regulatory Board are: Idaere Gogo Ogan (Chairman); Engr.\nSarki Auwalu (Chief Executive); Abiodun A. Adeniji (Executive Director, Finance and Accounts); and Ogbugo Ukoha (Executive Director, Distributions Systems, Storage and Retail Infrastructure).\nGbenga Komolafe (Chief Executive); Hassan Gambo (Executive Commissioner, Finance and Accounts); and Ms Rose Ndong (Executive Commissioner, Exploration and Acreage Management)."
  },
  {
    "headline": "2023: Five Northern Ex-Governors Jostle To Become Chairman Of Ruling Party, APC",
    "summarized_story": "It was followed up by the local government congress while the state congress is slated for October 2.\nFrom growing indications, the APC national chairmanship aspirants, who are mostly from the North, include; one; Abdulaziz Yari; a two-term former governor of Zamfara State.\nAnother aspirant is Isa Yuguda; former Bauchi State governor and former Minister of Aviation.\nFour, there is Kashim Shettima; he is former Borno State governor and a lawmaker in the National Assembly.\nFormer Nasarawa State governor, Tanko Al-Makura, is another contender for the national chairmanship position."
  },
  {
    "headline": "2023: Five Northern Ex-Governors Jostle To Become Chairman Of Ruling Party, APC",
    "summarized_story": "It was followed up by the local government congress while the state congress is slated for October 2.\nFrom growing indications, the APC national chairmanship aspirants, who are mostly from the North, include; one; Abdulaziz Yari; a two-term former governor of Zamfara State.\nAnother aspirant is Isa Yuguda; former Bauchi State governor and former Minister of Aviation.\nFour, there is Kashim Shettima; he is former Borno State governor and a lawmaker in the National Assembly.\nFormer Nasarawa State governor, Tanko Al-Makura, is another contender for the national chairmanship position."
  },
  {
    "headline": "Infamous Ex-Minister, Fani-Kayode Hires Women To Stage 'Mini Solidarity Welcome Rally' After Defection Backlash",
    "summarized_story": "The former Minister had shared a video showing the women dancing and singing.\nWhile speaking, Fani-Kayode had said he was instrumental to the defection of three Peoples Democratic Party (PDP) governors to APC.\nWith what we have witnessed, l would rather die than join a filthy, rat-infested sinking ship like the Almajiri Peoples Congress (APC).\nFani-Kayode was accused of directly using parts of the money at various times, including N250,650,000.00, which he allegedly used between March 20 and 25, 2015.\nAccording to the EFCC, Fani-Kayode allegedly received the sum of N26 million from the office of the former National Security Adviser (ONSA), Col. Sambo Dasuki (retd.)"
  },
  {
    "headline": "Infamous Ex-Minister, Fani-Kayode Hires Women To Stage 'Mini Solidarity Welcome Rally' After Defection Backlash",
    "summarized_story": "The former Minister had shared a video showing the women dancing and singing.\nWhile speaking, Fani-Kayode had said he was instrumental to the defection of three Peoples Democratic Party (PDP) governors to APC.\nWith what we have witnessed, l would rather die than join a filthy, rat-infested sinking ship like the Almajiri Peoples Congress (APC).\nFani-Kayode was accused of directly using parts of the money at various times, including N250,650,000.00, which he allegedly used between March 20 and 25, 2015.\nAccording to the EFCC, Fani-Kayode allegedly received the sum of N26 million from the office of the former National Security Adviser (ONSA), Col. Sambo Dasuki (retd.)"
  },
  {
    "headline": "BREAKING: Senate Sets Up Seven-man Committee On Electoral Act Amendment Bill",
    "summarized_story": "The Nigerian Senate has set up a seven-man Conference Committee to harmonise positions on the Electoral Act Amendments Bill.\nThe Senate President, Ahmad, Lawan announced this during the plenary on Wednesday adding that the conference Committee would work with that of the House of Representatives on the electronic transmission of results by the Independent National Electoral Commission.\nSenator Yahaya Abdullahi, of the All Progressive Congress, Kebbi North will be the leader of the team, Lawan added.\nThe lawmakers were divided across party lines during consideration of the report on provisions of clause 52(3) of the Electoral Act (Amendment) Bill 2021.\nThe Senators then considered the report that has 158 clauses, just as the Senate conceded the powers of the Independent National Electoral Commission, INEC to the Nigerian Communications Commission, NCC that will now transmit results of election rather than the latter."
  },
  {
    "headline": "These reckless comments on 2023 presidency",
    "summarized_story": "AdvertisementWe need a Nigerian president – not one that will be defined by his geographical or ethnic character.\nSome prominent Nigerians and groups have been heating up the cauldron with their intemperate comments on the 2023 presidency.\nHakeem Baba-Ahmed, spokesman of the Northern Elders Forum, was reported to have made some uncharacteristic comments on the geography of power in 2023.\nEven if most people agree that power should orbit to the south in 2023, there is still a need for popular consensus.\nAdvertisementPolitical, religious, group and community leaders should be disciplined in their public comments on the 2023 presidency."
  },
  {
    "headline": "These reckless comments on 2023 presidency",
    "summarized_story": "AdvertisementWe need a Nigerian president – not one that will be defined by his geographical or ethnic character.\nSome prominent Nigerians and groups have been heating up the cauldron with their intemperate comments on the 2023 presidency.\nHakeem Baba-Ahmed, spokesman of the Northern Elders Forum, was reported to have made some uncharacteristic comments on the geography of power in 2023.\nEven if most people agree that power should orbit to the south in 2023, there is still a need for popular consensus.\nAdvertisementPolitical, religious, group and community leaders should be disciplined in their public comments on the 2023 presidency."
  },
  {
    "headline": "IPOB: There'll be one-month lockdown in south-east if FG fails to bring Kanu to court",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says the south-east region will go on a one-month lockdown, if the federal government fails to bring Nnamdi Kanu, its leader, to court on October 21.\nAdvertisementOn July 26, Binta Nyako, judge of the federal high court, Abuja, adjourned the trial of Kanu till October 21, owing to the failure of the federal government to produce him in court.\nIn June, Nnamdi Kanu was arrested and extradited to Nigeria to face trial.\nAdvertisementReacting, IPOB, in a statement, by Emma Powerful, its spokesperson, alleged that the federal government has perfected plans not to bring Kanu to court on the next adjourned date.\nThe group said its “peaceful resolution” towards the trial of Kanu should not be misconstrued as weakness, while stressing that there will be one month lockdown in the south-east, if the federal government fails to bring Kanu to court."
  },
  {
    "headline": "IPOB: There'll be one-month lockdown in south-east if FG fails to bring Kanu to court",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says the south-east region will go on a one-month lockdown, if the federal government fails to bring Nnamdi Kanu, its leader, to court on October 21.\nAdvertisementOn July 26, Binta Nyako, judge of the federal high court, Abuja, adjourned the trial of Kanu till October 21, owing to the failure of the federal government to produce him in court.\nIn June, Nnamdi Kanu was arrested and extradited to Nigeria to face trial.\nAdvertisementReacting, IPOB, in a statement, by Emma Powerful, its spokesperson, alleged that the federal government has perfected plans not to bring Kanu to court on the next adjourned date.\nThe group said its “peaceful resolution” towards the trial of Kanu should not be misconstrued as weakness, while stressing that there will be one month lockdown in the south-east, if the federal government fails to bring Kanu to court."
  },
  {
    "headline": "Umahi: South-east declared as red zone by FG ministries -- projects won't come",
    "summarized_story": "David Umahi, governor of Ebonyi, has expressed the fear that the declaration of the south-east as a “red zone” owing to insecurity will deprive the area of federal projects.\nAdvertisementUmahi said this on Tuesday, in Abakaliki while inaugurating the leadership of the south-east traditional rulers council.\nThe governor said the federal government’s ministries recently declared the south-east as a red zone because of the high wave of insecurity in the area.\nAccording to him, the insecurity in the region, occasioned by agitation for self-determination, amounts to “self-inflicted injury” by the people.\nAdvertisement“The declaration of south-east as a red zone by these ministries means that what is due to us would be difficult to come,” Umahi said."
  },
  {
    "headline": "Ventures Park launches larger hub in Abuja for its expanding user base",
    "summarized_story": "Image credit: Supplied by Ventures Park.\nA shared workspace at the new Ventures Park campus in Abuja.\nThe new Ventures Park campus in Abuja.\nAfter launching its second innovation hub, Ventures Platform is considering partnerships that could see it expand across Africa, according to Oguchi.\n“The work we do at Ventures Platform is pan-African, and the work that Ventures Park does as a part of that vision is really important,” she said."
  },
  {
    "headline": "A backstory to the tussle between CBN and popular website abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Techpoint Build 2021!!! Free Netflix for Kenyans, CBN on the eNaira, Cartona’s series A",
    "summarized_story": "Share this article:Good day,Today I’m discussing:Techpoint Build 2021Netflix’s free plan in KenyaMore on Nigeria’s CBDCCartona’s Series ATechpoint Build is coming!!!\nKenyans can now watch Netflix for free and without AdsPhoto Credit: NetflixYes, you read right.\nUS-based movie streaming platform, Netflix, announced on Monday that it had begun the rollout of a free Netflix plan for Kenyans.\nHowever, Conk hinted at the most likely reason for this offering: free subscribers can upgrade to a paid subscription to access the platform’s full catalogue of movies and shows.\nRecall that in July, it was announced that the eNaira is set to launch on October 1, 2021."
  },
  {
    "headline": "Tesla backed ZOLA Electric is solving Africa’s energy shortage by digitising energy",
    "summarized_story": "As Africa’s population and need for economic growth increase, the need for a reliable and sustainable energy source also rises.\nZOLA Electric has a product called Infinity that takes power from solar panels, power grids, and other power sources.\nIt then uses an installed software to switch to the most readily available energy source while simultaneously storing energy.\nZOLA Electric sells its products through its partners, who, while serving as distributors, interact directly with customers.\nWhile Lenihan claims ZOLA Electric creates primary energy solutions, they still depend on other energy sources."
  },
  {
    "headline": "Techpoint Build 2021 is here! Be part of the largest startup and tech gathering in West Africa",
    "summarized_story": "Share this article:Since its inception in 2017, Techpoint Build has successively held for four consecutive years, with over 5,000 people attending each gathering.\nTechpoint Build remains Techpoint Africa’s largest conference aimed at connecting key players in the African startup community.\nAt Techpoint Build 20211 Event1 stageSpecial industries focusLots of engaging activitiesTechpoint Build 2021 theme: The next frontierVenue : To be announced soon.\nThe Techpoint Build 2021 theme is about building actual frontiers that enable tech development for Africa and how we can prepare ourselves to harness the opportunities across industries.\nPitchstorm at Techpoint Build 2021 will pit the best startups across multiple industries against each other, with one winner emerging overall."
  },
  {
    "headline": "Edo govt partners firm on construction of Benin Mall – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Tuesday, entered an agreement with Persianas Nigeria Limited for the development and construction of a modern shopping centre in Benin City, the Edo State capital.\nThe Edo State Governor, Mr. Godwin Obaseki, while addressing journalists after signing the partnership agreement for the Benin mall project, said the project is coming after twelve years of failed attempts.\nObaseki said the goal of his administration is to ensure that Benin City has all the features of a modern smart city while stimulating the economy.\nAccording to him, “Our struggle to bring Shoprite or a major mall experience to Edo State has been on for more than a decade.\nOnce the mall is built, the government intends to sell its own interests to Edo people who are interested in being part-owners."
  },
  {
    "headline": "Senate approves establishment of nationwide emergency communications service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Senate on Tuesday passed a bill seeking to establish the Nationwide Emergency Communications Service.\nIt also approved 112 as the toll-free number for emergencies.\nThe approval followed the consideration of the report of Senate Committee on Communication on Nationwide Toll-Free Emergency Number (Establishment) Bill, 2021, at plenary.\nThe report was presented by Sen. Biodun Olujimi(PDP-Ekiti) on behalf of the Chairman of the Committee, Sen Oluremi Tinubu (APC-Lagos).\nOlujimi explained that Clause 11 of the bill prohibited use of telephone and mobile telecommunications services to place a false, frivolous or vexatious calls to the emergency number 112."
  },
  {
    "headline": "Edo urges patience, assures of completion of Ekehuan Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has called for patience and collaboration of residents of Ekehuan Road axis of Benin City, reassuring that the government is committed to the completion of the ongoing reconstruction and dualisation of the road and other projects in the state.\nPermanent Secretary, Edo State Ministry of Infrastructure, Engr.\nFerguson Enabulele gave the assurance in Benin City, during an inspection visit to the area to assess the level of work done on the road.\nHe however appealed to the residents to be patient with the government, noting that work on the project would resume after the rains.\nOn their part, the youths expressed satisfaction with the state of work done on the project, lauding the developmental strides of the Governor Godwin Obaseki-led administration across the state."
  },
  {
    "headline": "COVID-19 3rd wave: Edo begins administration of second dose of Moderna vaccines, records two more deaths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State, on Tuesday, commenced the administration of the second dose of Moderna vaccines across the state’s 18 local government councils as part of ramped up efforts to contain the third wave of the coronavirus (COVID-19).\nPermanent Secretary, Edo State Ministry of Health, Dr. Osamwony Irowa disclosed this to journalists during the daily briefing on COVID-19 at the Government House in Benin City.\nAccording to him, “We are starting the administration of the second dose of Moderna vaccines within the state.\nWe urge those who took the Moderna first dose to come out for the second dose from today to ensure that they are fully vaccinated.\nThere are enough vaccines in the state, as we recently received another supply of vaccines."
  },
  {
    "headline": "Electoral Amendment: Lawan constitutes conference committee comprising 5 senators who voted against electronic transmission",
    "summarized_story": "The Senate President, Ahmad Lawan, has constituted a seven-member conference committee on the Electoral Amendment Bill.\nThe committee is to meet with the House of Representatives to harmonise the differences in the bill passed by both chambers in July.\nThe bill seeks to resolve issues concerning INEC’s introduction of modern technologies into the electoral process, particularly accreditation of voters, electronic voting and electronic transmission of results from polling units.\nPREMIUM TIMES reported how the lawmakers passed the bill amid chaos and disagreement in the chamber.\nBut in the seven-member panel set up by Lawan, five of the lawmakers voted against the electronic transmission of results in an election."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Over 8,000 Boko Haram terrorists have surrendered to Nigerian Army",
    "summarized_story": "Not less than 8,000 Boko Haram terrorists have surrendered to the Nigerian Army.\nEyitayo said the terrorists surrendered from their enclaves in Sambisa Forests, as well as other hideouts.\n“Our intensified operations had blocked their logistics’ routes and supplies, bombardments all over, that is why they started surrendering and diseases have overpowered many of them.\nOn the handling of the surrendered terrorists, Eyitayo disclosed that the Nigerian army was responsible for receiving, profiling or screening of the terrorists.\nNwachukwu acknowledged and commended efforts of the troops in putting pressure on the terrorists to abandon their illicit activities."
  },
  {
    "headline": "MTN Nigeria to raise N89.999bn through bond issuance",
    "summarized_story": "Adebayo ObajemuMTN Nigeria has notified the Nigerian Exchange Limited and the public that an application has been sent to the Securities and Exchange Commission (SEC), for the clearance of the transaction documents for its proposed bond issuance valued at N89.999 billion; Series 2 of the N200 billion registered shelf programme.\nSeries 1 -valued at N110 billion was successfully raised in May 2021.\nThe final decision on the launch of the bond will be taken once all regulatory approvals are obtained."
  },
  {
    "headline": "Stocks to watch as profit taking persists on NGX",
    "summarized_story": "It is trading 16.67% away from its 52 weeks high of N9.\nGoing by its Book Value of N21.51, relative to its current share price of N7.55, FBNH is considered very cheap.\nIt is trading 21.94% away from its 52 weeks high of N9.80.\nZenith Bank’s Book Value at N36.42 relative to its current share price of N22.95 make the stock a bargain.\nIt is trading 22.58% away from its 52 weeks high of N3.10, which suggests an upside potential for the stock."
  },
  {
    "headline": "Chinese banks to set up branches in Nigeria",
    "summarized_story": "Chinese Ambassador to Nigeria, Cui Jianchin, has said he is in talks with Chinese banks to establish operations in Nigeria to boost Nigeria’s economy and expand trade relations between the two nations.\nHe explained that establishing Chinese banks in the country would also be a point of discussion during the China-Nigeria Binational Committee meeting.\nWhen you list the world’s 10 big banks, six are in China.\nExtolling the extant China-Nigeria trade relations, the Chinese ambassador noted that the trade volume between China and Nigeria was nearly $20 billion, increasing from 2020’s $19.2 billion.\nHe disclosed that the Chinese embassy would honour 50 Nigerian employees of Chinese companies in Nigeria for their outstanding performance and contribution to strengthening diplomatic ties"
  },
  {
    "headline": "October 1: Nigeria Will Experience Freedom From Attacks, Oppression ― Kumuyi",
    "summarized_story": "The General Superintendent of Deeper Christian Life Ministry (DCLM), Pastor William Kumuyi, has said that Nigeria will experience real independence from attacks, oppression and torture as it celebrates this year’s Independence Day anniversary on October 1, 2021.\nKumuyi made the declaration upon his arrival to Abuja for a 5-day crusade with the theme, ‘Divine Solution Global’ which is starting, on Friday, September 24.\nThe programme will last for 5 days and it is from Friday all through to Tuesday,” Pastor Kumuyi said.\nFurthermore, he said “after the programme, we will be having our independence, I believe that with the focus on a divine solution for all, not just for people who are on the ground, but we are going to connect online with people all over this nation and all over the world.\nOn pardoning repentant Boko Haram, Pastor Kumuyi was of the opinion that the government should approach the issue with carefulness in order to restore peace in the country."
  },
  {
    "headline": "October 1: Nigeria Will Experience Freedom From Attacks, Oppression ― Kumuyi",
    "summarized_story": "The General Superintendent of Deeper Christian Life Ministry (DCLM), Pastor William Kumuyi, has said that Nigeria will experience real independence from attacks, oppression and torture as it celebrates this year’s Independence Day anniversary on October 1, 2021.\nKumuyi made the declaration upon his arrival to Abuja for a 5-day crusade with the theme, ‘Divine Solution Global’ which is starting, on Friday, September 24.\nThe programme will last for 5 days and it is from Friday all through to Tuesday,” Pastor Kumuyi said.\nFurthermore, he said “after the programme, we will be having our independence, I believe that with the focus on a divine solution for all, not just for people who are on the ground, but we are going to connect online with people all over this nation and all over the world.\nOn pardoning repentant Boko Haram, Pastor Kumuyi was of the opinion that the government should approach the issue with carefulness in order to restore peace in the country."
  },
  {
    "headline": "Philippines’ President Slams Rich Countries For Hoarding COVID-19 Vaccines",
    "summarized_story": "Philippines’ President, Rodrigo Duterte on Wednesday condemned the rich countries’ selfish plan to hoard COVID-19 vaccines while poor and developing nations are experiencing vaccine drought.\nHe added that rich countries hoard life-saving vaccines while poor nations wait for trickles.\nThe country has administered over 41.79 million doses of COVID-19 vaccines and more than 18.8 million people have been fully vaccinated.\nChina has been delivering COVID-19 vaccines to the Philippines since Feb. 28, it was the first to provide coronavirus vaccines to the Southeast Asian country.\nChina delivered more than 50 per cent of the Philippines’ COVID-19 vaccines stockpile."
  },
  {
    "headline": "Philippines’ President Slams Rich Countries For Hoarding COVID-19 Vaccines",
    "summarized_story": "Philippines’ President, Rodrigo Duterte on Wednesday condemned the rich countries’ selfish plan to hoard COVID-19 vaccines while poor and developing nations are experiencing vaccine drought.\nHe added that rich countries hoard life-saving vaccines while poor nations wait for trickles.\nThe country has administered over 41.79 million doses of COVID-19 vaccines and more than 18.8 million people have been fully vaccinated.\nChina has been delivering COVID-19 vaccines to the Philippines since Feb. 28, it was the first to provide coronavirus vaccines to the Southeast Asian country.\nChina delivered more than 50 per cent of the Philippines’ COVID-19 vaccines stockpile."
  },
  {
    "headline": "Elumelu Selects 12 Africans For Mentorship Programme",
    "summarized_story": "Businessman and chairman of Heirs Holdings, Tony Onyemaechi Elumelu, has selected 12 Africans for a mentorship programme.\nElumelu made the announcement on his verified Facebook page on Wednesday.\n“We have such great minds on our continent and it was tough making a selection of 12 people,” Elumelu wrote.\nRecall Elumelu had earlier on September 10, 2021 called for entries to participate in his next mentorship session through his Facebook page in order to select those who will be part of the live session.\n“I will make a selection of 10 people (by Tuesday, 14th of September) from the entires to join my next mentorship session,” he had said."
  },
  {
    "headline": "Alleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu Hotel",
    "summarized_story": "Alleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu HotelAlleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu HotelTop Nollywood actors including Jide Kosoko, Fred Amata, Yemi Solade were spotted holding a peaceful protest at the Radisson Blu Hotel situated on Isaac John Street, Ikeja, GRA.\nOther actors present at the scene include Mahmood Alli-Balogun, Grace Amah, Yinka Akanbi, Sunny Mcdon, and Ejike Asiegbu.\nThe protest was instigated by the Audio-visual Rights Society (AVRS).\nThe group accused the hospitality outfit of refusal to pay for use of their intelligent properties in their different branches..\nHe said Radisson Blu owes the copyright collective society close to N50 million."
  },
  {
    "headline": "Alleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu Hotel",
    "summarized_story": "Alleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu HotelAlleged N50m debt: Commotion as Nollywood stars protest at Radisson Blu HotelTop Nollywood actors including Jide Kosoko, Fred Amata, Yemi Solade were spotted holding a peaceful protest at the Radisson Blu Hotel situated on Isaac John Street, Ikeja, GRA.\nOther actors present at the scene include Mahmood Alli-Balogun, Grace Amah, Yinka Akanbi, Sunny Mcdon, and Ejike Asiegbu.\nThe protest was instigated by the Audio-visual Rights Society (AVRS).\nThe group accused the hospitality outfit of refusal to pay for use of their intelligent properties in their different branches..\nHe said Radisson Blu owes the copyright collective society close to N50 million."
  },
  {
    "headline": "External security: Sanwo-Olu tasks Nigerian Navy, others",
    "summarized_story": "He said Lagos State Government will continue to have a robust security architecture with the Nigerian Navy and other security agencies for security of lives and prosperity of the citizens.\nHe said: “We will continue to have a robust security architecture with the Nigerian Navy and other security operatives; Nigerian Army, Nigerian Air force and others.\nSanwo-Olu also commended the Nigerian Navy for its impactful activities in Lagos, stressing that the State would continue to render the necessary support to ensure a robust security architecture.\nSpeaking earlier, the Chief of Naval Staff who was accompanied by top Naval officers, said the courtesy visit to Governor Sanwo-Olu was aimed at strengthening the cordial relationship with Lagos State.\nHe said there is a very cordial relationship between the Nigerian Navy, Lagos State Government and the good people of the State, noting that the State had contributed greatly to the success of the Nigerian Navy."
  },
  {
    "headline": "External security: Sanwo-Olu tasks Nigerian Navy, others",
    "summarized_story": "He said Lagos State Government will continue to have a robust security architecture with the Nigerian Navy and other security agencies for security of lives and prosperity of the citizens.\nHe said: “We will continue to have a robust security architecture with the Nigerian Navy and other security operatives; Nigerian Army, Nigerian Air force and others.\nSanwo-Olu also commended the Nigerian Navy for its impactful activities in Lagos, stressing that the State would continue to render the necessary support to ensure a robust security architecture.\nSpeaking earlier, the Chief of Naval Staff who was accompanied by top Naval officers, said the courtesy visit to Governor Sanwo-Olu was aimed at strengthening the cordial relationship with Lagos State.\nHe said there is a very cordial relationship between the Nigerian Navy, Lagos State Government and the good people of the State, noting that the State had contributed greatly to the success of the Nigerian Navy."
  },
  {
    "headline": "353 Nigerian doctors dump Nigeria for UK",
    "summarized_story": "No fewer than 353 Nigerian doctors have dumped Nigeria for the United Kingdom in the last 100 days, as the negotiation between striking doctors and government stalemated.\nAccording to a report by Punch, UK’s General Medical Council licensed the 353 Nigerian-trained doctors between June 10, 2021 and September 20, 2021.\nThe statistics also showed that between July 24, 2020 and September 21, 2021, about 862 Nigeria trained doctors were licensed in the UK despite the COVID-19 pandemic.\nOverall, 8, 737 doctors who obtained their degrees in Nigeria currently practise in the UK.\nOjebo argued that the doctors migrating to Saudi Arabia might even be more than those moving to the UK."
  },
  {
    "headline": "Lawan takes drastic action on EFCC, Petroleum Agencies Board nominees",
    "summarized_story": "President of the Senate, Ahmad Lawan, has forwarded President Muhammadu Buhari’s nominees into the board of the Economic and Financial Crimes Commission (EFCC) to the Committee on Anti-Corruption and Financial Crimes for screening.\nAlso forwarded were the names of appointees into the newly established Boards of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NPRA) and Upstream Regulatory Commission (URC) to the Committees on Petroleum (Downstream) and (Upstream), respectively.\nThe upper chamber on Tuesday received a request from President Muhammadu Buhari to confirm the nominees as Members of the Board of the Nigerian Midstream and Downstream Petroleum Regulatory Authority.\nThe President in another letter to the upper chamber also sought the confirmation of the Board of the Upstream Regulatory Commission.\nThe nominees for confirmation into the Nigerian Petroleum Regulatory Board are: Idaere Gogo Ogan (Chairman); Engr."
  },
  {
    "headline": "We regret getting rid of Jonathan to elect Buhari, Northern Elders lament",
    "summarized_story": "The Northern Elders Forum has said that it regretted that it got rid of then-President Goodluck Jonathan in the 2015 elections to vote in the incumbent, Major General Muhammadu Buhari (retd.).\nNEF, therefore, said that the next President of Nigeria should be one who would act in the “opposite direction” of Buhari, who hails from Katsina, North-West Nigeria.\nNEF Director of Publicity and Advocacy, Dr. Hakeem Baba-Ahmed, spoke on Tuesday when he featured on Arise TV’s ‘The Morning Show’ breakfast programmeHe said, “Is there any Nigerian who is not disappointed in President Buhari including diehard APC people?\nIs there anybody who would not tell you he wished President Buhari had done much better?\n“We have lived under Southern Presidents because we recognise that Nigeria is made up of sections, ethnic groups and interests."
  },
  {
    "headline": "“Stop Eating About, You Lack Dignity,” Joe Igbokwe Fires Femi Fani-Kayode Again",
    "summarized_story": "Joe Igbokwe, a chieftain of the All Progressives Congress, APC, has told the former minister of Aviation, Femi Fani-Kayode who recently defected from PDP to APC to stop eating about as if it’s Christmas.\nMr Igbokwe who is also the Special Adviser to the Lagos state governor on Drainage stated this when he appeared on Arise TV on Wednesday morning.\nIgbokwe said Mr. Fani-Kayode lacks the political character to have been received by the President at the Villa adding that the former PDP director of media has no principle.\nWe, the foundation members are worried,” Mr Igbokwe stated.\nThe Anambra-born politician however noted that Mr. Fani-Kayode is an intelligent man but stressed that he “lacks dignity and people can hardly point what he stands for."
  },
  {
    "headline": "Senator Ararume lacks the requisite experience to head NNPC Board – Adeyanju kicks",
    "summarized_story": "The Convener of Concerned Nigerians for the protection of Human Rights and Rule of Law Initiative, Deji Adeyanju has kicked against the appointment of Senator Ifeanyi Ararume as chairman of Board, Nigerian National Petroleum Company Limited.\nThe activist in a statement described Ararume’s appointment as a travesty.\nPresident Muhammadu Buhari who serves as the Minister of Petroleum Resources had approved the appointment of Ararume as chairman of board of the newly incorporated Nigerian National Petroleum Company Limited.\n“The appointment of Ararume whom former president Olusegun Obasanjo in 2011 described as the “Big Thief” has brought to the fore, President Muhammadu Buhari’s penchant for outlandish and unconventional methods of appointing cronies and men of questionable characters”.\n“We call on the President to as a matter of urgency, reverse the appointment of Senator Ararume as chairman of Board, Nigerian National Petroleum Company Limited as it goes against reason and logic”."
  },
  {
    "headline": "Health Minister Tests Positive For COVID-19",
    "summarized_story": "Brazil’s Health Minister Marcelo Queiroga tested positive for COVID-19 hours after accompanying President Jair Bolsonaro to the United Nations General Assembly in New York on Tuesday, the government said.\nIt added that the rest of the delegation tested negative for the virus.\nread moreThe health minister was the second member of the Brazilian delegation in New York to have tested positive.\nA young diplomat who was part of an advance team preparing Bolsonaro’s visit tested positive on the weekend and was isolated.\nBolsonaro, who regarded Trump as a political role model, has opposed lockdowns to prevent the spread of COVID-19 and seldom uses a mask."
  },
  {
    "headline": "Breaking: Newly appointed Emir is dead",
    "summarized_story": "The emir of Gaya, Alhaji Ibrahim Abdulkadir, has died at the age of 93 after a protracted illnessBlueprint findings revealed that the monarch has been indisposed since his appointment as the new emir of Gaya following the creation of four additional emirates in Kano dtate by governor Abdullahi Umar Ganduje.\nThe late Abdulkadir remained out of sight for the last few months, as he always sent a representative to hold brief for him at every function where the presence of emirs were needed.\nAs at the time of filing this report, his remains were yet to be committed to mother earth as people were left anxious waiting at his palace in Gaya to catch a glimpse of his corpse and the eventual performance of the funeral rites.\nA serving presidential aide Bashir Ahmad has also confirmed his demise via his Facebook page on Wednesday."
  },
  {
    "headline": "Incorporated NNPC‘ll end politics, entrenched corruption – Experts",
    "summarized_story": "Similarly, President Buhari appointed Ifeanyi Ararume as NNPC board chairman while Kyari and Umar I. Ajiya are chief executive officer and chief financial officer respectively.\nHe also said this would put an end to all the political and economic scheming, intriguing and compromises.\nHe said this would ensure effective management of the regulatory institutions through uniform implementation of public service rules for employees of the Downstream Petroleum Regulatory Authority .\nThe nominees for confirmation into the Nigerian Petroleum Regulatory Board are: Idaere Gogo Ogan (Chairman); Engr.\nGbenga Komolafe (Chief Executive); Hassan Gambo (Executive Commissioner, Finance and Accounts); and Ms Rose Ndong (Executive Commissioner, Exploration and Acreage Management)."
  },
  {
    "headline": "Southern govs’ anti-open grazing law unimplementable – El-Rufai",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has cautioned against politicising the open grazing controversy, saying the new law banning the activity in the southern states of Nigeria is not implementable.\nSome southern states like Ondo, Oyo, Lagos, Enugu and Osun, as well as the northern state of Benue, among others, have passed the anti-open grazing law.\nHe said the Northern Governors Forum (NGF) agreed that the way to go is ranching.\n“The Northern state Governors Forum has already taken a position that open grazing is not a sustainable way of livestock production.\nWe have taken a position as northern state governors and we are implementing that."
  },
  {
    "headline": "Mailafia: Silencing the voices of the Middle belt -NigPilot",
    "summarized_story": "on arrival, the name of the doctor that was billed to attend to Dr. Mailafia was not on duty.\nAt a point, Dr. Mailafia complained over his breathing problems and pleaded with the doctors to place him on a ventilator.\nThe doctors in Gwagwalada refused all entreaties by the family members of Dr. Mailafia to follow the advice of the foreign consultants, insisting that they have already pronounced him dead.\nWhile the above narration sums up the circumstances under which Dr. Mailafia died, we still await the result of the actual cause of his death.”As a nationalist and patriot that he was, Dr. Mailafia was completely dedicated to the emancipation of ethnic nationalities from the clutches of oppression.\nAs a former presidential candidate in the 2019 poll, Dr. Mailafia sought to deploy politics to bring about the dream he had for his country."
  },
  {
    "headline": "Mailafia: Silencing the voices of the Middle belt -NigPilot",
    "summarized_story": "on arrival, the name of the doctor that was billed to attend to Dr. Mailafia was not on duty.\nAt a point, Dr. Mailafia complained over his breathing problems and pleaded with the doctors to place him on a ventilator.\nThe doctors in Gwagwalada refused all entreaties by the family members of Dr. Mailafia to follow the advice of the foreign consultants, insisting that they have already pronounced him dead.\nWhile the above narration sums up the circumstances under which Dr. Mailafia died, we still await the result of the actual cause of his death.”As a nationalist and patriot that he was, Dr. Mailafia was completely dedicated to the emancipation of ethnic nationalities from the clutches of oppression.\nAs a former presidential candidate in the 2019 poll, Dr. Mailafia sought to deploy politics to bring about the dream he had for his country."
  },
  {
    "headline": "Miners’ association laments invasion of mining sector by foreigners, non members -NigPilot",
    "summarized_story": "Miners’ Association of Nigeria , MAN, has decried the rising trend of foreign nationals invading mining communities in the country also stating that rich miners in the country were not members of the association.\nHe said that a low level of technology, inadequate manpower, and invasion of mining communities has led to the increasing loss of revenue in the sector.\nThe Miners’ association president further explained that ninety-nine percent of rich miners in the country were not members of the Association.\nHe attributed the challenges of curbing illegal mining to connivance of illegal miners with security officers, lack of adequate manpower, low level technology and invasion of mining communities.\nThe mandate was sequel to a motion on illegal mining and smuggling of gold in the country brought by Senator Orji Uzor Kalu."
  },
  {
    "headline": "Miners’ association laments invasion of mining sector by foreigners, non members -NigPilot",
    "summarized_story": "Miners’ Association of Nigeria , MAN, has decried the rising trend of foreign nationals invading mining communities in the country also stating that rich miners in the country were not members of the association.\nHe said that a low level of technology, inadequate manpower, and invasion of mining communities has led to the increasing loss of revenue in the sector.\nThe Miners’ association president further explained that ninety-nine percent of rich miners in the country were not members of the Association.\nHe attributed the challenges of curbing illegal mining to connivance of illegal miners with security officers, lack of adequate manpower, low level technology and invasion of mining communities.\nThe mandate was sequel to a motion on illegal mining and smuggling of gold in the country brought by Senator Orji Uzor Kalu."
  },
  {
    "headline": "Consortium of lawyers, ethnic youth leaders, CSOs chide Washington Post -NigPilot",
    "summarized_story": "“Out of the five questions Mr. Whoriskey inquired about, question 1 has been resolved by a competent court of law in Nigeria and the decision widely publicized.\nA simple internet search would have availed Mr. Whoriskey of the judgment of the case and the present state of affairs.\nIn answering the allegations against Mr. Peters, the groups claimed that “Mr.\nHe has severally denounced any such attempt to link the purchase of his property with Dieziani under such premises.\nNo furniture that belonged to him can be found at any other place other than in his property."
  },
  {
    "headline": "COVID-19: Nigeria Records 513 New Cases, Three More Deaths",
    "summarized_story": "Nigeria has recorded 513 new cases of COVID-19 with three deaths across the country.\nData from the NCDC revealed that Nigeria has confirmed a total of 202,704 cases from the samples collected and tested so far.\nOf the confirmed cases, 191,370 infected people have been recovered from the disease and 2,664 people have died across all 36 states of the Federation and the FCT.\nThe United States is the worst-affected country with 676,092 deaths, followed by Brazil with 590,955, India with 445,385 deaths, Mexico with 271,765 deaths, and Russia with 199,808.\nThe United States will announce “additional commitments” on fighting Covid-19 when the White House hosts a summit on the pandemic on Wednesday, President Joe Biden says."
  },
  {
    "headline": "Buhari Asks Senate To Amend PIA Over ‘Unbalanced Geographical Representation’, Others",
    "summarized_story": "President Muhammadu Buhari has asked the Senate to amend the Petroleum Industry Act (PIA) 2021.\nHe made the request in a letter read by the Senate President, Ahmad Lawan, during plenary on Tuesday on the floor of the upper chamber of the National Assembly in Abuja.\nIn the letter dated September 16, President Buhari explained that his proposal became necessary having carefully reviewed the administrative structure of both the Nigerian Midstream and Downstream Petroleum Regulatory Authority, and the Nigerian Upstream Regulatory Commission.\nREAD ALSO: Nigeria Is Not Interested In Naming, Shaming Terrorism Sponsors – PresidencyWhile the PIA provides for the appointment of two non-executive board members, President Buhari is seeking an expansion of the membership.\nHe, however, asked the Senate to confirm the appointment of Isa Modibbo as Chairman of the Upstream Regulatory Commission, and Gbenga Komolafe as its Chief Executive."
  },
  {
    "headline": "One Person Killed As Building Collapses In Akure",
    "summarized_story": "An elderly woman died on Tuesday morning in Akure after a building partially collapsed in the Ondo State capital.\nChannels Television crew visited the scene later after the incident occurred in Akure South Local Government Area of the state.\nREAD ALSO: Nigeria Is Not Interested In Naming, Shaming Terrorism Sponsors – PresidencyAccording to eyewitnesses, the occupants of the building were thrown into panic when part of the building caved in at about 3am while most of them were fast asleep.\nBut seven other persons, who also live in the house, were rescued by neighbours who raced to the scene of the incident.\nWhile police authorities in Ondo have yet to make an official statement regarding the incident, the body of the woman killed was moved to the morgue by policemen at the scene."
  },
  {
    "headline": "COVID-19: 20% Of Full-Time Nigerian Workforce Lost Employment In 2020 – Report",
    "summarized_story": "At least 20 per cent of the full-time workforce in Nigeria lost employment during the COVID-19 pandemic in 2020, a new report released on Tuesday has revealed.\nThe report tagged ‘The Impact of COVID-19 on Business Enterprises in Nigeria’, was jointly released by the United Nations Development Programme (UNDP) and the National Bureau of Statistics (NBS).\nBased on in-depth interviews with almost 3,000 businesses from both formal and informal sectors across major industries of the economy, the report assesses the impact of COVID-19 on business enterprises in the country.\n“While there have been promising signs of recovery this year, COVID-19 has had an outsized socio-economic impact on Nigeria,” it said.\nIn addition, the report revealed that one in three business enterprises surveyed indicated that some businesses have permanently closed due to operational challenges resulting from the pandemic."
  },
  {
    "headline": "Biden Says US Not Seeking ‘Cold War’ As He Vows To Lead",
    "summarized_story": "Addressing the UN General Assembly for the first time as President, Biden promised to work to advance democracy and alliances, despite friction with Europe over France’s loss of a mega-contract.\n“We are not seeking a new Cold War or a world divided into rigid blocs,” Biden said.\nChinese President Xi Jinping is set to address the General Assembly later Tuesday but by video in light of Covid-19 precautions.\n‘Recipe For Trouble’Opening the General Assembly, Secretary-General Antonio Guterres warned of growing divisions between the United States and China and urged dialogue.\nIt would be far less predictable than the Cold War.”The UN General Assembly is meeting in person for the first time in two years but at limited capacity and with pandemic precautions."
  },
  {
    "headline": "Governor Dapo Abiodun Visits Asiwaju Tinubu in London",
    "summarized_story": "Governor Abiodun shared pictures of the Monday visit to the APC Leader in London on his Facebook page.\nOgun State Governor, Prince Dapo Abiodun, has visited the National Leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, at his London home.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month September 2021 (355) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,365) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,181) inside lagos (1) International (7,087) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,087) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (20,751) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,532) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,406) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (278) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,036)"
  },
  {
    "headline": "Troops kill 26 bandits leaders, destroy 5 camps in Zamfara -",
    "summarized_story": "Twenty six Notorious armed bandit leaders have been killed in Zamfara stateFive other bandit groups have also been destroyed by troops as military sustained air and ground raid on bandit campsThirteen motorcycles belonging to the bandits were destroyed by troops of the Nigerian Armed ForcesThe successes were recorded during air bombardments around Baranda forest and other areasThe bandits were eliminated by fighter jets of the Nigerian Air Force that have sustained aggressive raids at forests housing bandits terrorizing communities in the North West ZoneTVC NEWS gathered that some of the notorious bandits killed include Hussaini Rabe, Murtala Sabe, Basiru Nasiru, Sama, and Isah.\nThe slain bandits were said to be loyal to a notorious bandit chief known as Abu ReddeRecall that Nigerian Armed Forces in collaboration with others agencies have been carrying aggressive unslaught against bandits and their collaborators in zamfara since third of SeptemberThe operation according to authorities is yielding positive results as saveral bandit camps and leaders were destroyed."
  },
  {
    "headline": "Governor Zulum Suspends Ramat Polytechnic Management -",
    "summarized_story": "Borno State Governor, Professor Babagana Umara Zulum has suspended the entire management of the state owned Ramat Polytechnic in Maiduguri, for a period of six months.\nThe Governor during a surprise visit to the institution was shocked to see workshops and laboratories no longer functioning, and many marches were out of use with some covered by cobwebs and rodents roaming around due to neglect.\nGovernor Babagana Zulum after assessing all infrastructures and learning conditions, directed the State’s Commissioner of Higher Education, Science, Technology and Innovation, Dr. Babagana Mallumbe to take over the affairs of the School immediately.\nThe management of the school were suspended from work for six months, due to what the governor described as incompetency.\nThe Governor further directed the ministry of water resources to drill two deep aquifers borehole and carry out a complete water channel network within the polytechnic, which is coming after prior interventions he approved for Polytechnic in 2019, to reduce problems of water supply."
  },
  {
    "headline": "Women group calls for improved security in North West region",
    "summarized_story": "Women across North West states have called on the government and other duty bearers to address the current spate of insecurity in the region.\nThese include the recurrent cases of banditry, Kidnappings for ransom and attacks on school and innocent citizens in North-West states.\nThe women who converged on Kaduna on Tuesday are saddened that violent extremism and communal clashes induced by widened segregation along ethnic and religious divides has also led to forced displacement and loss of lives.\nThey said peace remains a prerequisite for development and call on the government to put effective strategies in place to end the violence as women and children are the worst hit.\nThe group also enlightened women on their role in the peace building process."
  },
  {
    "headline": "Usyk Could Be Joshua’s Toughest Test, Ex-World Champion Groves Says",
    "summarized_story": "Britain’s Anthony Joshua could face his toughest test yet when he fights Oleksandr Usyk in London on Saturday, says ex-world champion George Groves.\nJoshua, 31, puts his WBA, WBO, IBF and IBO world heavyweight titles on the line against Usyk, a former undisputed cruiserweight world champion.\n“He showed that in unifying the cruiserweight division in great fights and I believe he could be Joshua’s toughest test to date.\n“Usyk will start fast and Joshua should be cagey as Usyk is a bit lighter.\nHearn said: “I’m always nervous for an Anthony Joshua fight, especially when you’re fighting someone that really believes he is going to win."
  },
  {
    "headline": "Trump Sues Niece and New York Times Over Tax Story",
    "summarized_story": "Former US President Donald Trump is suing his niece and the New York Times over a 2018 article that alleged he was involved in “dubious tax schemes”.\nThe lawsuit, filed in New York, accuses Mary Trump and newspaper reporters of being “engaged in an insidious plot” to obtain confidential documents.\nIt alleges that Ms Trump, 56, breached a settlement agreement barring her from disclosing the documents.\nIt alleges that Mr Trump “suffered significant damages” and states that he is seeking compensation of no less than $100m (£73m).\nLast year, Ms Trump filed her own lawsuit accusing Mr Trump and two family members of fraud and conspiracy, alleging that the then-president, his sister Maryanne Trump Barry and brother Robert Trump – who died last August – cheated her out of an inheritance."
  },
  {
    "headline": "Melbourne Earthquake: Tremor Rattles Southeast Australia",
    "summarized_story": "A 5.9 magnitude earthquake has rattled southeast Australia, damaging buildings in the city of Melbourne.\nThe earthquake was also felt in neighbouring South Australia and New South Wales (NSW).\nSpeaking from the US, Mr Morrison noted earthquakes were uncommon in Australia and they “can be a very, very disturbing event”.\nOne federal MP, Michael McCormack, said the “ground [was] shaking violently” in Wagga Wagga, NSW.\nThe geoscience agency says Australia experiences a potentially damaging earthquake – defined as above 6.0 magnitude – about every 10 years."
  },
  {
    "headline": "Samuel Eto’o Announces Candidacy for Presidency of Cameroon Football Federation",
    "summarized_story": "Former Cameroon international Samuel Eto’o is to stand as a candidate in the race for the presidency of his country’s football federation (Fecafoot).\nIt is time to rebuild our football,” Eto’o said.\nFecafoot has not announced when it will release the final list of eligible candidates who can run for the presidency.\nThe announcement by Eto’o comes amid controversy in Cameroon after candidates with dual nationality had been told they could not stand in the elections.\nSo far, Eto’o is the third former Indomitable Lion to run as president of Cameroon’s football federation."
  },
  {
    "headline": "‘Game-changer’: China to Stop Funding Overseas Coal Projects",
    "summarized_story": "In the run-up to the historic 2015 Paris climate deal, a joint US-China agreement helped kick-start the successful negotiations.\n“It is clear the writing is on the wall for coal power.\nI welcome President Xi’s commitment to stop building new coal projects abroad – a key topic of my discussions during my visit to China,” he said on Twitter.\nNon-governmental groups in a letter earlier this year said the state-run Bank of China was the largest single funder of coal projects, providing $35bn since the Paris climate agreement.\nIf there’s no public finance of coal from China, there’s little to no global coal expansion,” Justin Guay, the director of global climate strategy at the Sunrise Project, a group advocating for a global transition from coal and fossil fuels, said of Xi’s promise."
  }
]