[
  {
    "headline": "Why Nigeria should be worried about ‘Deltacron’, other variants –Physician",
    "summarized_story": "Recall that a scientist in Cyprus discovered Deltacron, which combines the Delta and Omicron strains.\nSpeaking with PUNCH HealthWise, Akande said “Nigeria needs to be worried since we know all variants eventually find their ways onto many countries as people travel globally.\nPreventive measures at the points of entry have not proven to be 100 percent in preventing spread to Nigeria.\n“Not much is known currently on this new variant.”He added that Nigeria needs to scale up vaccination to protect its citizens.\n“Nigeria needs to scale up vaccination to protect its citizens."
  },
  {
    "headline": "Why Nigeria should be worried about ‘Deltacron’, other variants –Physician",
    "summarized_story": "Recall that a scientist in Cyprus discovered Deltacron, which combines the Delta and Omicron strains.\nSpeaking with PUNCH HealthWise, Akande said “Nigeria needs to be worried since we know all variants eventually find their ways onto many countries as people travel globally.\nPreventive measures at the points of entry have not proven to be 100 percent in preventing spread to Nigeria.\n“Not much is known currently on this new variant.”He added that Nigeria needs to scale up vaccination to protect its citizens.\n“Nigeria needs to scale up vaccination to protect its citizens."
  },
  {
    "headline": "Lassa fever breaks out in Kaduna, two killed, residents fight over dumped fish",
    "summarized_story": "This was as residents of Narayi, in the Chikun Local Area of the state scrambled for suspected toxic frozen fish dumped at a cemetery in the area.\nMeanwhile, Ikara said the two Lassa fever cases involving a female and a male were recorded in Kubau and Chikun Local Government Areas of the state.\nOn the dumped toxic frozen fish, it was gathered that the incident happened penultimate Friday when several cartons of the suspected toxic frozen fish were dumped in a cemetery.\nAn eyewitness said once some passers-by spotted the vehicles offloading the suspected toxic frozen fish at the cemetery, they scrambled and moved the cartons containing the toxic fish to their homes.\nA viral WhatsApp message on Wednesday warned residents of the danger inherent in consuming the fish."
  },
  {
    "headline": "Lassa fever breaks out in Kaduna, two killed, residents fight over dumped fish",
    "summarized_story": "This was as residents of Narayi, in the Chikun Local Area of the state scrambled for suspected toxic frozen fish dumped at a cemetery in the area.\nMeanwhile, Ikara said the two Lassa fever cases involving a female and a male were recorded in Kubau and Chikun Local Government Areas of the state.\nOn the dumped toxic frozen fish, it was gathered that the incident happened penultimate Friday when several cartons of the suspected toxic frozen fish were dumped in a cemetery.\nAn eyewitness said once some passers-by spotted the vehicles offloading the suspected toxic frozen fish at the cemetery, they scrambled and moved the cartons containing the toxic fish to their homes.\nA viral WhatsApp message on Wednesday warned residents of the danger inherent in consuming the fish."
  },
  {
    "headline": "Those kidnapped are not our students – Plateau Poly",
    "summarized_story": "By Marie-Therese Nanlong, JosThe authority of the Plateau State Polytechnic, Heipang, Barkin Ladi local government area has debunked the ongoing rumour that two students of the institution were abducted on Wednesday night.\n“But within a short while, some kidnappers came and took the two ladies, those ladies, Bencit and Lokfei are residing with the woman.\n“The two ladies they picked are not students of our school.\n“Even our students did not know what happened, they are writing their exams, the campus is flourishing well with academic activities.\nMeantime, efforts are ongoing to rescue the kidnapped victims and arrest other perpetrators of the act.”Vanguard News Nigeria"
  },
  {
    "headline": "Buhari visits Ogun, commissions landmark projects",
    "summarized_story": "James Ogunnaike, ABEOKUTAPresident Muhammadu Buhari is currently on a one-day official visit to Ogun state to commission some projects.\nHe was received by dignitaries including the State Governor, Prince Dapo Abiodun; his Lagos State counterpart, Babajide Sanwo-Olu; Kayode Fayemi (Ekiti State), Arakunrin Rotimi Akeredolu (Ondo State), Gbenga Oyetola (Osun State), Mai Mala Buni (Yobe State) Ogun State former governors, including Chief Olusegun Osoba, Gbenga Daniel, Senator Ibikunle Amosun among others.\nThe President in the company of Governor Abiodun has commissioned the 14km Epe/ Ijebu-ode Expressroad in the state,Ogun Gateway City at Sagamu interchange and the 42km Abeokuta/ Sagamu road.\nOther projects to be commissioned include two housing projects.\nThereafter, the President is expected to hold a town hall meeting with critical stakeholders and party faithful in Abeokuta, the state capital."
  },
  {
    "headline": "Mali-Tunisia AFCON game ends in confusion",
    "summarized_story": "The Africa Cup of Nations descended into chaos on Tuesday after farcical scenes involving the referee in Tunisia’s opening group stage clash with Mali.\nOfficial Janny Sikazwe blew the final whistle after just 85 minutes before restarting play, but then blew again with just 89 minutes and 43 seconds of the Group F clash gone.\nHowever, in the final dramatic twist, Tunisia appeared to refuse to come out and play the final three minutes, although Sikazwe and Mali did wait for them.\nThe Zambian official then blew the whistle calling off the match, meaning full time has now officially been called.\nTunisia however were seemingly making a valid point with their initial protests, with two VAR checks taking place during the Group F clash."
  },
  {
    "headline": "Cameroonian climate ‘very difficult’ for Algeria",
    "summarized_story": "Algerian players say Cameroon’s tropical climate was a factor in their 0-0 draw against minnows Sierra Leone in their first match at the Africa Cup of Nations.\n“It was very difficult with the heat, and especially for us who play in Europe.\nWe are not used to it,” Algeria midfielder Haris Belkebla told BBC Sport Africa.\nThey were beaten quarter-finalists in Equatorial Guinea in 2015 and failed to get out of their group two years later in Gabon.\nBensebaini admitted Algeria were frustrated by Leone Stars goalkeeper Mohamed Nbalie Kamara, who made a string of saves."
  },
  {
    "headline": "NDDC boss rejects entreaties to contest 2023 presidential race",
    "summarized_story": "By Etop EkanemNiger Delta Development Commission, NDDC, Sole Administrator, Dr. Efiong Akwa, has dismissed various entreaties enjoining him to join the forthcoming 2023 presidential race.\nAkwa, who turned down the entreaties at an occasion to celebrate the New Year Thanksgiving in Amamong, Okobo Local Government Area of Akwa Ibom State, said he does not have the capacity for such exalted position of governance for now.\nALSO READ: 2023: Nigeria’ll experience infrastructural revolution if Umahi emerges President — Ebonyi APCHis words: “I sincerely thank all of you for your supports, solidarities and the call for me to run for the presidency of Nigeria.\n“Being a NDDC sole administrator isn’t enough criteria to become the president of the country.\nVanguard News Nigeria"
  },
  {
    "headline": "Anambra Governor-elect, Soludo appoints Oby Ezekwesili to head transition team",
    "summarized_story": "The Anambra State Governor-elect, Charles Soludo, has appointed former Minister of Education, Obiageli Ezekwesili, as head of his transition team.\nThe governor, who is expected to be inaugurated in March 2022, succeeds the current governor of the state, Willie Obiano.\nDAILY POST recalls that Soludo, a former Governor of the Central Bank of Nigeria, was declared winner of the November 6, 2021, governorship election in Anambra.\nThe governor-elect, who contested under the All Progressives Grand Alliance, APGA, defeated his closest rivals, Peoples Democratic Party’s Valentine Ozigbo and All Progressive Congress’ Andy Uba had 43,285 votes.\nThere is currently no official statement regarding the appointment of Mrs Ezekwesili, however, according to Peoples Gazette, the transition team would be inaugurated on January 20."
  },
  {
    "headline": "Boko Haram surrendering – Senate committee tasks Nigerian military on suppressing ISWAP",
    "summarized_story": "The Senate Committee Chairman on Army, Senator Ali Ndume, has urged the military to suppress the activities of the Islamic State West Africa Province (ISWAP) in Southern Borno.\nNdume made the call when he led members of the committee on an oversight visit to the headquarters of Joint Operation Hadin Kai in Maiduguri on Wednesday.\nAccording to him, ‘Boko Haram terrorists are surrendering’, while ISWAP is still attacking people.\n“As Boko Haram members are surrendering, ISWAP is attacking people, particularly in the southern part of the state.\n“We will continue to put our best to ensure total peace is restored to the northeast and Borno in particular,” Musa said."
  },
  {
    "headline": "I disagree with Buhari on state police – Orji Uzor Kalu",
    "summarized_story": "The Senate Chief Whip, Orji Uzor Kalu, has faulted President Muhammadu Buhari’s stance on state police.\nAppearing on Arise TV, the former Governor of Abia State said states should be allowed to have their own police.\nRecently, Buhari had said governors will use state police to witch-hunt and intimidate perceived critics and opponents.\nRuling out the issue of state police under his administration, Buhari had said: “State police is not an option.\nI don’t have the same opinion as the president (Mr Buhari) on state police."
  },
  {
    "headline": "Building collapse: Bishop Ibiyeomie visits victims in hospital as church confirms incident [PHOTOS]",
    "summarized_story": "Following the collapse of a building housing a branch of Salvation Ministry at Okpanam, Asaba, Delta State, where many worshippers were reportedly trapped, Bishop Ibiyeomie, founder of the ministry, has paid visits to hospitalised victims.\nDAILY POST recalls that the building, which was rented by the church for worship purposes, collapsed during service on Tuesday.\nConfirming the incident, the church, in a statement issued and made public on Wednesday, sympathized with the victims, saying an investigation is ongoing.\n“The church is currently working with relevant authorities in investigating the cause of the incident.\n“Our immediate prayers and thoughts are with the persons and families affected by the incident, and the church is committed to providing all necessary supports while an investigation is ongoing”."
  },
  {
    "headline": "BREAKING: Court strikes out criminal charges against Imo Deputy Speaker over alleged N75m fraud",
    "summarized_story": "A Federal Capital Territory High Court in Abuja on Thursday struck out a criminal charge brought against the Deputy Speaker of the Imo State House of Assembly, Amarachi Chyna Iwuanyanwu, over his alleged involvement in a N75 million fraud.\nIn a ruling, Justice Charles Agbaza struck out the charges upon the request of the Inspector General of Police (IGP).\nThe IGP, who filed the charges, however, on Thursday brought a motion on notice to the court requesting that the charges be terminated.\nIn the motion argued by his counsel, Mr Umoh Inah, the police chief asked the court to throw away the charges in the interest of justice.\nThe motion was not opposed by Chief Chris Uche (SAN), who stood for the Deputy Speaker."
  },
  {
    "headline": "Fleeing robber shoots colleague in Ondo",
    "summarized_story": "A member of a three-man gang has shot his colleague dead while fleeing from operatives of the Ondo State Security Network codenamed Amotekun Corps.\nOne of the robbers was said to have angrily shot one of his colleagues but they were later arrested.\nCommander of Ondo Amotekun Corps, Akogun Adetunji Adeleye, who paraded the suspects and items recovered from them, said the robber was shot by his colleague to conceal a secret.\n“We were able to retrieve the bus with registration number FKJ 430 XV as well as belongings of the victims.\n“I am from Okenne and a farmer at Elegbeka, Ondo State."
  },
  {
    "headline": "UPDATED: Gunmen abduct three Plateau poly students",
    "summarized_story": "Suspected Gunmen on Wednesday night stormed the Plateau State Polytechnic Barkin Ladi and kidnapped three students.\nThe abducted students were identified as Bencit and Longfei and one other person.\nThe Police confirmed the incident and informed one suspect has been arrested.\nSources said the three gunmen stormed the hostel known as ‘Plateau Embassy’ towards the end of the School fence and whisked the three girls away after shooting sporadically in the air.\nThe spokesman of Plateau Police Command, ASP Gabriel Ubah, who confirmed the incident in a statement to reporters , explained: “ The Plateau State Police Command is aware of the kidnap incident in Ban Village behind Plateau State Polytechnic Heipang on the 12/01/2022 at about 20:05hrs where three persons were abducted."
  },
  {
    "headline": "JUST IN: Buhari visits Ogun, commissions projects",
    "summarized_story": "President Muhammadu Buhari has paid a visit to Ogun State to commission some projects The Nation can report.\nHe arrived Thursday morning and was received by Governor Dapo Abiodun; Lagos Governor Babajide Sanwo-Olu; former Ogun State Governor Gbenga Daniel and other dignitaries.\nThe President, in the company of Governor Abiodun, commissioned the 14km Epe/ Ijebuode Express Road in the State.\nHe is also expected at the Sagamu interchange where he will commission the Ogun city gate and the 42km Abeokuta/ Sagamu road.\n- Advertisement -Other projects to be commissioned include two housing projects; 527 units of a low and medium Housing Scheme at Kobape and the high-brow, 83 duplexes at the Kings Court Estate at Oke Mosan in Abeokuta, the state capital."
  },
  {
    "headline": "Jailbreak: NCoS, NSCDC to beef up security in custodial centres in Rivers",
    "summarized_story": "Jailbreak: NCoS, NSCDC to beef up security in custodial centres in RiversThe Rivers command of the Nigerian Correctional Service (NCoS), says it is collaborating with sister security agencies to beef up security in custodial centres across the state.\nMr Alex Oditah, the state NCoS Comptroller, stated this in a statement in Port Harcourt on Thursday by the command spokesperson, DSC Juliet Ofoni.\n“The visits are sequel to the directive from the Comptroller General of Corrections, Mr Haliru Nababa to collaborate with sister security agencies to beef up security around custodial centres in the state.\n“This is in view of the incessant attacks on custodial centres in the country,” he said.\nOn his part, Aliyu said the collaboration would go a long way to discourage attacks on custodial centres."
  },
  {
    "headline": "JUST IN: Gunmen abduct two Plateau poly students",
    "summarized_story": "JUST IN: Gunmen abduct two Plateau poly studentsGunmen on Wednesday night stormed the Plateau State Polytechnic Barkin Ladi and kidnapped two students.\nThe abducted students were identified as Bencit and Longfei.\nThe Police confirmed the incident and informed one suspect has been arrested.\nSources said the three gunmen stormed the hostel known as ‘Plateau Embassy’ towards the end of the School fence and whisked the two girls away after shooting sporadically in the air.\nThe spokesman of the Plateau state Police Command, ASP Gabriel Ubah, who confirmed the incident to The Nation, said: ” It happened in Ban Village heipang."
  },
  {
    "headline": "Anambra: Soludo appoints ex-minister Ezekwesili as head of transition team",
    "summarized_story": "From Obinna Odogwu, AwkaAnambra State Governor-Elect Prof Chukwuma Soludo has appointed the former Minister of Education, Oby Ezekwesili, as the head of his transition team ahead of the March 17 handover.\nSoludo, a former Central Bank of Nigeria (CBN) governor, was declared the winner of the November 6, 2021 governorship election in the state.\nHe defeated the candidate of the Peoples Democratic Party (PDP), Chief Valentine Ozigbo, who came second.\nAlthough an Abuja court recently declared that the All Progressives Congress (APC) had no candidate in the poll, INEC had declared that Senator Andy Uba came third on the party’s platform.\nOther members of the transition committee were not yet known at the time of filing this report as the list has not been officially released."
  },
  {
    "headline": "2023 presidency: Pressure mounts on Osinbajo",
    "summarized_story": "The calculation, according to the source, is that religion would play a major role in who succeeds Buhari in 2023.\n“The North, particularly the North West, which has the bulk of northern votes, would not necessarily queue behind a Christian deputy and give him their votes.\nOn account of age, he’s young, and he’s a Christian.”However, a senior party official privy to the matter described the pressure on Osinbajo as “mere speculation.\nThe North, particularly the North West, would not be disposed to having a Christian representing them…”Choice of running mate100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe President is expected is to meet with “APC governors to ‘firmly agree’ on a convention date and the mode of choosing candidates for the NWC.”"
  },
  {
    "headline": "Jubilation as FG lifts Twitter suspension",
    "summarized_story": "Economic watchers say billions of naira has been lost since the ban as most Nigerians use it as a platform to run their businesses.\nThese issues bordering on national security, cohesion and the effects of the abuse of the Twitter platform forced the the Federal Government to suspend the operation of Twitter to address the direct and collateral issues around its operations in Nigeria.\n“The process of resolving this impasse between the FGN and Twitter Inc. has helped lay a foundation for a mutually beneficial future with endless possibilities.\nTwitter is a platform of choice for many Nigerians ranging from young innovators to public sector officials who find it helpful to engage their audience.\nTherefore, our engagement will help Twitter improve and develop more business models to cover a broader area in Nigeria."
  },
  {
    "headline": "Air Peace CEO gifts Super Eagles N10m for win against Egypt",
    "summarized_story": "By Chinelo ObogoChief Executive Officer of Air Peace, Allen Onyema, has gifted the Super Eagles N10 million for winning their first match against Egypt and promised a further N50 million if they lift the AFCON trophy.\nDo us proud and when you come back with the cup, I’m going to give you N50 million,” Onyema said.\nHe used the medium to harp on the uniting power of football, stressing that whenever the Eagles play, Nigerians jettison their ethnic and religious sentiments to forge a united font in support of the team.\nIt can be recalled that during the qualifying stages, the Air Peace helmsman delivered a similar unity-themed and motivational speech to the Super Eagles on board one of the airline’s brand new Embraer 195-E2 aircraft, and gave them a cheque of N20 million.\nThe Falcons of the 1999 squad were also beneficiaries of N10 million from the aviation cognoscente during the 3rd NFF-Aiteo Football Awards last year in Lagos."
  },
  {
    "headline": "National convention: Our priority is to resolve disputes, litigations -APC",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has declared that resolution of various disputes arising from its recently conducted congresses and various litigations against the ruling party remain its major priority rathan than picking a date for national convention.\n“As a focus-driven, process-oriented political party, the APC caretaker committee under the leadership of Governor Mai Mala Buni will not be distracted by self-serving antics of the sponsors of fake news.\n“The APC caretaker committee is already embarking on nationwide consultations with party stakeholders to prepare the ground for a rancour-free national convention.\n“To this end, the sub-committee on budgeting and other substructures will be set up in due course.\n“Finally, the party notes and appreciates the continued support of well-meaning members and leaders as the APC caretaker committee undertakes the immediate task of addressing contestations within the party, litigations, fallouts of recently-conducted congresses and generally reposition the party ahead of the national convention,” he said."
  },
  {
    "headline": "Buhari: Alao-Akala Served Nigeria, Oyo with Dedication",
    "summarized_story": "Alao-Akala, who was governor of Oyo State between 2007 and 2011, died at his Ogbomoso country home early yesterday at 71.\nOyo State Governor ‘Seyi Makinde, on learning of Alao-Akala’s passing, abruptly ended the 2022 Inter-faith Prayer Service organised by the state’s civil service.\nSanwo-Olu stated, “On behalf of the government and people of Lagos, I commiserate with my brother, the Oyo State Governor, Engr.\n“The passage of Otunba Alao-Akala hurts me, because of the critical role he was playing in Oyo APC before his demise.\n“APC commiserates with party members in Oyo State and diaspora, especially, all Oyo State indigenes on the sad and shocking news."
  },
  {
    "headline": "222 Days After, President Unbans Twitter",
    "summarized_story": "This comes exactly 222 days after the government suspended the Twitter in the country.\nThe NITDA DG said, Pantami in the Memo, updated and requested the president’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nThe Technical Committee engaged and worked directly with the Twitter team,” Abdulahi explained in the statement.\n“We encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Nigeria Lifts Ban on Twitter",
    "summarized_story": "Olawale AjimotokanThe federal government of Nigeria has lifted the ban on Twitter effective from 12 midnight of January 13, 2022.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nThe statement stressed that Twitter has agreed to enroll Nigeria in its Partner Support and Law Enforcement Portals, which provides a direct channel for government officials and Twitter staff to manage prohibited content that violates Twitter community rules.\n“Therefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\n“We encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Breaking: Ex-Oyo Gov, Alao-Akala, Dies at 71",
    "summarized_story": "Kemi Olaitan in IbadanFormer Governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nIt was gathered that the chieftain of the All Progressives Congress (APC) died on Wednesday.\nHowever, the cause of his death is still unknown at the time of filing this report.\nBorn on June 3, 1950, at Ogbomoso in the Ogbomoso North local government area of Oyo State, he had his elementary school at Osupa Baptist Day School, Ogbomoso before proceeding to Kamina Barracks Middle School, 5th Battalion of Infantry in Tamale, Ghana.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ernest Adegunle Oladeinde Shonekan, GCFR, CBE, 1936-2022",
    "summarized_story": "At each budget year, Chief Shonekan would be invited to critique our budget proposals, and gave us further input to enrich the final budget.\n“As a leader, Chief Shonekan was well-respected, because of the enormous goodwill he brought into governance.\nThe statement said, “Chief Shonekan was a first-class administrator, boardroom guru and astute leader, whose imprint in the business and political firmaments cannot be erased.\nIn his brief time as Head of State, Chief Shonekan tried his best to advance peace, stability and development in Nigeria.\n“Even outside office, Chief Shonekan remained committed to the unity, stability and development of our nation."
  },
  {
    "headline": "BREAKING: Nigerian Government Lifts Twitter Ban After Six Months",
    "summarized_story": "The Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nKashifu, in a statement in Abuja, said the approval was given following a memo written to the President by Minister of Communications and Digital Economy, Isa Ali Ibrahim.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\nSome countries, groups and prominent individuals have described the ban as a gross violation of human rights.\nSocial Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians filed a lawsuit, challenging the government of Buhari over the indefinite suspension of microblogging platform, Twitter."
  },
  {
    "headline": "BREAKING: Nigerian Government Lifts Twitter Ban After Six Months",
    "summarized_story": "The Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nKashifu, in a statement in Abuja, said the approval was given following a memo written to the President by Minister of Communications and Digital Economy, Isa Ali Ibrahim.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\nSome countries, groups and prominent individuals have described the ban as a gross violation of human rights.\nSocial Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians filed a lawsuit, challenging the government of Buhari over the indefinite suspension of microblogging platform, Twitter."
  },
  {
    "headline": "How Ex-Oyo Governor, Alao-Akala Was Found Dead In His Room After Abuja Trip",
    "summarized_story": "A family member has narrated how Chief Adebayo Alao-Akala, a former governor of Oyo State died.\nSaharaReporters had reported the death of the former governor in the early hours of Wednesday at the age of 71.\nHe said, “He returned from Abuja yesterday (Tuesday) and still held meeting with some people in the evening.\nAlao-Akala, a retired Police Officer, was also a former Chairman of Ogbomoso North Local Government Area.\nHe was Deputy Governor from 2003 to 2007, and later governor from 2007 to 2011 on the platform of the Peoples Democratic Party."
  },
  {
    "headline": "How Ex-Oyo Governor, Alao-Akala Was Found Dead In His Room After Abuja Trip",
    "summarized_story": "A family member has narrated how Chief Adebayo Alao-Akala, a former governor of Oyo State died.\nSaharaReporters had reported the death of the former governor in the early hours of Wednesday at the age of 71.\nHe said, “He returned from Abuja yesterday (Tuesday) and still held meeting with some people in the evening.\nAlao-Akala, a retired Police Officer, was also a former Chairman of Ogbomoso North Local Government Area.\nHe was Deputy Governor from 2003 to 2007, and later governor from 2007 to 2011 on the platform of the Peoples Democratic Party."
  },
  {
    "headline": "Amotekun Personnel Seize Cows Over Violation Of Open Grazing Law In Ondo",
    "summarized_story": "The Ondo State chapter of Amotekun Corps on Wednesday arrested many cows within Akure metropolis for flouting the state’s anti-grazing law.\nSaharaReporters gathered that the arrest caused heavy vehicular traffic along Arakale/NEPA Road in the state capital as Amotekun operatives conveyed the seized cows to their headquarters in Alagbaka.\nGovernor Rotimi Akeredolu had in August 2021 signed the anti-open grazing bill after it was passed by the state’s House of Assembly.\nAkeredolu said the move was in line with the resolution of Southern governors that all states in the region should make a law prohibiting open grazing before September 1, 2021.\nHe said the law was a welcome development that would prevent “needless instances of skirmishes” on the people of the state."
  },
  {
    "headline": "TIMELINE: From 'civil war tweet' to tax talks — how FG, Twitter negotiation ended",
    "summarized_story": "After months of negotiation, the federal government, on Wednesday, announced that it has lifted the suspension of Twitter operations in Nigeria.\nTWITTER DELETED BUHARI’S TWEETOn June 2, 2021, Twitter deleted the president’s tweet, saying the tweet violated its rules.\nMALAMI ORDERS PROSECUTION OF TWITTER BAN VIOLATORSOn June 5, 2021, Abubakar Malami, attorney-general of the federation, ordered the prosecution of those violating the ban on Twitter in Nigeria.\n‘NIGERIA NEEDS TWITTER’On June 11, 2021, Senate President Ahmad Lawan said Nigeria needs Twitter just as much as Twitter needs Nigeria.\nFG LIFTED SUSPENSION ON TWITTER OPERATIONSOn January 12, 2021, Buhari approved the lifting of the suspension on Twitter operations in Nigeria."
  },
  {
    "headline": "TIMELINE: From 'civil war tweet' to tax talks — how FG, Twitter negotiation ended",
    "summarized_story": "After months of negotiation, the federal government, on Wednesday, announced that it has lifted the suspension of Twitter operations in Nigeria.\nTWITTER DELETED BUHARI’S TWEETOn June 2, 2021, Twitter deleted the president’s tweet, saying the tweet violated its rules.\nMALAMI ORDERS PROSECUTION OF TWITTER BAN VIOLATORSOn June 5, 2021, Abubakar Malami, attorney-general of the federation, ordered the prosecution of those violating the ban on Twitter in Nigeria.\n‘NIGERIA NEEDS TWITTER’On June 11, 2021, Senate President Ahmad Lawan said Nigeria needs Twitter just as much as Twitter needs Nigeria.\nFG LIFTED SUSPENSION ON TWITTER OPERATIONSOn January 12, 2021, Buhari approved the lifting of the suspension on Twitter operations in Nigeria."
  },
  {
    "headline": "Gunmen abduct three in yet another attack on Plateau community",
    "summarized_story": "Three persons have been kidnapped by gunmen in a village in Plateau state.\nThe victims were kidnapped in Ban village behind the Plateau State Polytechnic on Wednesday night.\nAdvertisement“The Plateau state police command is aware of the kidnap incident in Ban village behind Plateau State Polytechnic Heipang on the 12/01/2022 at about 20:05hrs where three persons were abducted,” he said.\nThe abduction occurred a day after 18 people were reportedly killed in an attack on Ancha community in Bassa LGA of the state.\nThe wife of Silas Vem, deputy chief of staff to Sonny Tyoden, deputy governor of Plateau, was abducted by gunmen on Sunday."
  },
  {
    "headline": "Gunmen abduct three in yet another attack on Plateau community",
    "summarized_story": "Three persons have been kidnapped by gunmen in a village in Plateau state.\nThe victims were kidnapped in Ban village behind the Plateau State Polytechnic on Wednesday night.\nAdvertisement“The Plateau state police command is aware of the kidnap incident in Ban village behind Plateau State Polytechnic Heipang on the 12/01/2022 at about 20:05hrs where three persons were abducted,” he said.\nThe abduction occurred a day after 18 people were reportedly killed in an attack on Ancha community in Bassa LGA of the state.\nThe wife of Silas Vem, deputy chief of staff to Sonny Tyoden, deputy governor of Plateau, was abducted by gunmen on Sunday."
  },
  {
    "headline": "Lawan: N'assembly worried about Nigeria's borrowings -- nobody likes taking loans",
    "summarized_story": "Senate President Ahmad Lawan says the national assembly is concerned about the country’s level of borrowing.\nAdvertisementThe Lawan-led national assembly has not declined any request for approval of loans by the executive.\nAdvertisement“We expect that when we generate more we borrow less.”Lawan said the national assembly under his leadership has stabilised Nigeria’s economy and polity.\n“I also daresay, the ninth national assembly stabilised the polity.\nAdvertisement“Mark me, some of the people saying these people [calling the national assembly names] are ignorant or mischievous because they don’t want us to succeed.”"
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Crazily high valuations, investor FOMO, the ripple effects of Y Combinator’s new deal",
    "summarized_story": "Here, we look at the deal and what it means for African founders.\nAccording to the terms of the new deal, Y Combinator will invest $125,000 for 7% of a company as it has always done.\nWith more money flowing into the ecosystem, startups will find it easier to raise money at high valuations.\nFor the most part, African startups at this stage have raised little amounts of capital, usually under $2 million.\nSince it funded the first African startup in 2009, it has only funded 66 African startups."
  },
  {
    "headline": "Twitter ban lifted, cracking YC’s SAFE, SeamlessHR’s $10m funding",
    "summarized_story": "According to The Nation, the federal government of Nigeria has lifted the ban on Twitter with the approval of the President, Muhammadu Buhari.\nAccording to Abdullahi, the ban will be lifted at precisely 12 a.m., Thursday, January 13, 2022.\nI’m writing this newsletter a day before, so I can’t confirm if Twitter will work without a VPN.\nIf you’d like to go down memory lane, here are some articles that examined the effects of the Twitter ban, reactions to it and events that took place after it.\nNigeria-based HR startup, SeamlessHR, has raised a $10 million Series A led by TLcom Capital."
  },
  {
    "headline": "Nigerians can finally access Twitter as government lifts 7-month suspension",
    "summarized_story": "Share this article:The Nigerian Federal Government has lifted its ban on the microblogging site, Twitter after 7 months.\nThe announcement was made by Kashifu Inuwa Abdullahi, Director-General of the National Information Technology Development Agency (NITDA) on Wednesday, January 12, 2022.\nAccording to Abdullahi, the lift was approved following a memo written to the President by Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\nMinister of Information and Culture, Lai Mohammed revealed after a Federal Executive Council (FEC) meeting that Twitter and Nigeria were making headway in their negotiations.\nThe Nigerian government suspended Twitter on June 4, 2021, after it deleted a controversial tweet made by Nigeria’s President, Muhammadu Buhari."
  },
  {
    "headline": "Oil prices to decline in 2022, 2023 – EIA",
    "summarized_story": "“The declining prices are driven by a shift from global petroleum inventory declines during 2021 to inventory increases in 2022 and 2023.\nHowever, after the COVID-19 pandemic began in 2020, petroleum consumption returned faster than petroleum production, resulting in this inventory draw.\nIt was also projected that increased tight oil production in the United States and gradually increasing crude oil production from OPEC+ (which includes OPEC members and Russia) will account for most of the increased crude oil production.\nIn addition, global petroleum inventories will increase by 0.5 million b/d in 2022, which will put downward pressure on crude oil prices.\nFurthermore, 2023 is expected to witness continued inventory growth, averaging 0.6 million b/d while global petroleum production was projected to increase by 1.8 million b/d in 2023 from 2022, averaging 102.8 million b/d, the EIA analysis showed."
  },
  {
    "headline": "Global miners Rio Tinto and Barrick Gold looking at Nigeria says Minister",
    "summarized_story": "Global miners Rio Tinto and Barrick Gold looking at Nigeria says MinisterTwo of the world’s biggest miners – Barrick Gold and Rio Tinto could be running operations in Nigeria soon as Africa’s top oil producer seeks to bring its huge minerals deposits out of the ground and onto the market.\nAccording to a Bloomberg report, the two global giants have expressed interest in Nigeria’s largely untapped mining sector.\nThe report quoted the mining minister as having confirmed the interest which could pivotal for Nigeria.\nVancouver-based Thor poured first gold from its mine in southwestern Nigeria in July last year and is targeting output of 85,000 ounces a year.\nBarrick and Rio didn’t immediately respond to emails seeking comment."
  },
  {
    "headline": "Nigeria stocks to watch in 2022",
    "summarized_story": "Notwithstanding imminent risks to equity market rally in 2022, Nigerian stocks are still attractive and should remain resilient in this year.\nThe big question now is: what stocks should investors buy in 2022?\nMeristem analysts target price (TP) for Dangote Cement is N287.81; Vetiva analysts target price for the stock is N280; while United Capital analysts target price is N270.3.\nGoing by these analysts 2022 target price for the cement maker, the stock has upside potential and should be considered a BUY.\nVetiva also rated the stock a BUY with 2022 target price at N796.57."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Emmanuel Difom named Guinness Nigeria’s Finance and Strategy Director",
    "summarized_story": "Adebayo ObajemuGuinness Nigeria has appointed Emmanuel Difom as Finance and Strategy DirectorThe brewery giant has given notice to the investing public that the Board of Directors of the Company at its meeting held on 26th October 2021, gave approval to the appointment of Mr. Emmanuel Difom as the Finance and Strategy Director of the Company with effect from 1 st November 2021.\nMr. Difom has fifteen years of experience at top level.\nHe is a an achiever with strong experience in Business Strategy, Finance, and Tax management supported by a solid background in FMCG, Oil and gas and Banking sectors.\nThe Board of Directors is assured that Mr. Difom brings the right skillset to the Board with his level of experience and understanding of the Diageo landscape.\nIn addition to this, the wide experience of Mr. Difom in British American Tobacco (BAT), his knowledge of the business terrain in Nigeria and his good track record were very high points contributing to the Board’s confidence in his appointment as the Finance and Strategy Director."
  },
  {
    "headline": "Nigerian govt lifts Twitter ban after 222 days",
    "summarized_story": "The government of President Muhammadu Buhari has announced lifting of a ban it imposed on Twitter in Nigeria since June 2021.\nThe regime initially insisted that the social media giant must register as a business and open an office in Nigeria, a demand that was rejected by Twitter.\nHowever, Mr Abdullahi who announced the decision said the president only acted on a recommendation to lift the suspension.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\n“In the Memo, the Minister updated and requested the President’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.”Facebook Notice for EU!"
  },
  {
    "headline": "Sterling Bank Powers Art with Imperium",
    "summarized_story": "Sterling Bank Plc has partnered with the Nike Art Gallery to install solar panels at the gallery via the bank’s Imperium outlet as part of its commitment to a renewable energy powered Nigeria as well as the development of the nation’s tourism sector.\nThis follows recent partnerships with the gallery to drive an appreciation as well as the investment opportunities available in the arts and tourism sectors in Nigeria.\nThe renewable energy sector is one of the five sectors of the economy that the bank is presently concentrating investments in.\nShina Atilola, Divisional Head for Retail and Consumer Banking at Sterling Bank added that the bank attempts to enrich lives and unlock new opportunities in Nigeria’s tourism sector through partnerships with key tourism industry players as well as other sectors where investments are being focused under its HEART’s of Sterling programme.\nHe further urged interested prospects to equally approach officers of the bank for discussions on other products of the bank or visit www.imperiumng.com."
  },
  {
    "headline": "JABU debunks rumours on Ogunbiyi’s PhD title",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Board of Trustees, Governing Council, Senate, and Management of Joseph Ayo Babalola University (JABU), Ikeji Ararkeji, Osun State has countered the speculations on Dr Akin Ogunbiyi’s PhD title, confirming that the award is authentic and genuine.\nIn a letter signed by the University registrar, Pastor Dapo Adeniyi, the institution cleared the air on the insinuation that the chairman of Mutual Benefits Assurance Plc has been “lying to the public and deceiving Osun People” on his PhD title.\nTo set the record straight, the letter was forwarded to pressmen by the campaign office of the gubernatorial aspirant of the People’s Democratic Party in Osun State.\n“As a member of the Joseph Ayo Babalola University Alumni Association, you have consistently exemplified yourself with a deep sense of duty and tenacity toward the growth of the University.\nIt argued that Dr Ogunbiyi parades one of the best credentials amongst the PDP aspirants having studied at Yale and Oxford Universities among other top institutions in the world."
  },
  {
    "headline": "Banditry: We Need Tucano Fighter Jets In Zamfara – Matawalle",
    "summarized_story": "Governor Bello Mohammed of Zamfara State has called for more concerted efforts in fighting banditry to ensure speedy elimination of the menace in the entire North West region and beyond.\nTo hasten the success of the ongoing operations in the state, Governor Matawalle called on the federal government to deploy more interventions in the state including more Armoured Personnel Carriers (APCs) and specifically, the Super Tucano fighter jets in the state.\nThese blackspots are Gando, in Bukkuyum local government area, Munhaye of Tsafe local government area, Bayan Ruwa, in Maradun local government area, Kabaro- Sangeku, of Dansadau and Magami axis.\nADVERTISEMENT“The security challenge in Zamfara State and other states in the North West is unprecedented.\nGovernor Matawalle added."
  },
  {
    "headline": "ISWAP Attacks On The Rise, Governor Zulum Cries Out",
    "summarized_story": "Borno State Governor Babagana Zulum yesterday raised fresh concerns over the increasing activities of the Islamic State of West Africa (ISWAP) terrorists in the core and northern parts of the state.\nADVERTISEMENTZulum said, “ISWAP terrorists are having checkpoints between Damboa and Biu local government areas, collecting taxes from the communities.\nFew days ago, I got security report that ISWAP terrorists are holding a marriage ceremony in one of the communities with the presence of over 300 motorcycles.\nHe, however, called on the troops to check the activities of terrorists in the Borno State and North East region.\n“The breakdown further shows that 61.8 percent of the yearly abduction figures affected the North West region, 21.6 percent in the North Central and 5.5 percent in the North East."
  },
  {
    "headline": "7 Months After, Federal Govt Lifts Ban On Twitter Operations",
    "summarized_story": "The federal government has lifted the suspension slammed on US micro-blogging organisation, Twitter, in Nigeria following a directive from President Muhammadu Buhari to end the ban effective from today.\nLEADERSHIP recalls that the federal government suspended Twitter operations in Nigeria after it pulled down a statement by President Buhari which it considered offensive.\n“Twitter has also agreed to comply with applicable tax obligations on its operations under Nigerian law.\n“Therefore, the federal government lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January, 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "7 Months After, Federal Govt Lifts Ban On Twitter Operations",
    "summarized_story": "The federal government has lifted the suspension slammed on US micro-blogging organisation, Twitter, in Nigeria following a directive from President Muhammadu Buhari to end the ban effective from today.\nLEADERSHIP recalls that the federal government suspended Twitter operations in Nigeria after it pulled down a statement by President Buhari which it considered offensive.\n“Twitter has also agreed to comply with applicable tax obligations on its operations under Nigerian law.\n“Therefore, the federal government lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January, 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Tinubu/Umahi: Other Aspirants Play Down Pressure To Declare Publicly",
    "summarized_story": "The former Lagos State governor who just declared has clearly done his consultations.\nADVERTISEMENTHe said Uzodimma was against him because of his presidential ambition.\nThat actually is not the way a man of Dr. Saraki’s calibre will declare presidential ambition.\nWhen it is time to formally declare his ambition, everybody in the country will know”.\nMeanwhile, former deputy governor of the Central Bank of Nigeria (CBN), Prof Kingsley Moghalu, was the first to openly declare his presidential ambition."
  },
  {
    "headline": "Opinion: The Election of 2023 in Prospects – By CHINEDUM ANAYO",
    "summarized_story": "Personally, the 2023 election is an election of reckoning.\nPresident Buhari has disclosed that even if he has a desired candidate, he would rather not specify, so that the person would not be eliminated before the election.\nNigeria is in a setting, the 2023 election is in a frame and the candidates, the major thread.\nWe have also seen recent photos in the media, where it seems that former President Jonathan and Incumbent President Buhari are very close.\nIt is the same Jonathan that the President Buhari administration viciously blamed for everything that is inappropriate with Nigeria today and now he and President Buhari are seen as ‘buddies’."
  },
  {
    "headline": "Opinion: The Election of 2023 in Prospects – By CHINEDUM ANAYO",
    "summarized_story": "Personally, the 2023 election is an election of reckoning.\nPresident Buhari has disclosed that even if he has a desired candidate, he would rather not specify, so that the person would not be eliminated before the election.\nNigeria is in a setting, the 2023 election is in a frame and the candidates, the major thread.\nWe have also seen recent photos in the media, where it seems that former President Jonathan and Incumbent President Buhari are very close.\nIt is the same Jonathan that the President Buhari administration viciously blamed for everything that is inappropriate with Nigeria today and now he and President Buhari are seen as ‘buddies’."
  },
  {
    "headline": "Lecturer’s son arrested in Benue for alleged killing of UNIJOS lover",
    "summarized_story": "A 20-year-old man, Moses Oko, has been arrested by the police for allegedly killing a 300-level student of the University of Jos, Jennifer Anthony, for suspected ritual purposes.\nAnthony had been declared missing by friends and fellow students.\nHer lifeless body was later found at a hotel in Jos, along Zaria Road, on New Year’s Day with some of her body parts, including her eyes, missing.\nParading the suspected killer of the undergraduate at the command headquarters in Jos on Wednesday, the Plateau State Commissioner of Police, Bartholomew Onyeka, said Moses was arrested in Benue State with the help of his father, Joseph Oko, a lecturer at the University of Jos.\nThe suspect will be arraigned at the end of investigation.”The victim’s friend, Jessica Dung, told PUNCH Metro on Wednesday that Moses was arrested in a psychiatric home in Makurdi, Benue State, adding that his hair was shaved to suggest that he was mentally unstable."
  },
  {
    "headline": "Lecturer’s son arrested in Benue for alleged killing of UNIJOS lover",
    "summarized_story": "A 20-year-old man, Moses Oko, has been arrested by the police for allegedly killing a 300-level student of the University of Jos, Jennifer Anthony, for suspected ritual purposes.\nAnthony had been declared missing by friends and fellow students.\nHer lifeless body was later found at a hotel in Jos, along Zaria Road, on New Year’s Day with some of her body parts, including her eyes, missing.\nParading the suspected killer of the undergraduate at the command headquarters in Jos on Wednesday, the Plateau State Commissioner of Police, Bartholomew Onyeka, said Moses was arrested in Benue State with the help of his father, Joseph Oko, a lecturer at the University of Jos.\nThe suspect will be arraigned at the end of investigation.”The victim’s friend, Jessica Dung, told PUNCH Metro on Wednesday that Moses was arrested in a psychiatric home in Makurdi, Benue State, adding that his hair was shaved to suggest that he was mentally unstable."
  },
  {
    "headline": "Cameroon separatists bent on disrupting AFCON, kill 2 civilians, one soldier",
    "summarized_story": "At least two civilians were killed on Wednesday in clashes between government forces and separatist fighters in Cameroon’s restive Anglophone region hosting Group F of Africa Cup of Nations(AFCON).\nIn another report by Reuters, the separatists claimed they killed a soldier during an attack in Buea.\n“Our forces launched an IED attack that killed one soldier.\nThe aim, Ayaba said, was to disrupt preparations for two Group F games that are being played on Wednesday in Limbe, a coastal city about an hour’s drive south from Buea.\nThe first Group F game, between Mali and Tunisia, went ahead on Wednesday with Mali winning 1-0, and the match between Gambia and Mauritania got underway as planned."
  },
  {
    "headline": "Gunmen invade PLAPOLY, abduct 3 students",
    "summarized_story": "By Polycarp AutaPlateau Police Command has confirmed the abduction of three students of Plateau State Polytechnic, Barkin Ladi.\nASP Ubah Ogaba, the Police Public Relations Officer (PPRO) of the command, confirmed the incident in a statement on Thursday in Jos.\nOgaba said the students were kidnapped on Wednesday night at Ban, a community behind the main Campus of the institution at Heipang, Barkin Ladi Local Government Area of the state.\nRelated News Plateau polytechnic students protest postponement of semester exams“We aware of the kidnap incident in Ban Village behind Plateau State Polytechnic main campus, Heipang, where three persons were abducted.\n“Meanwhile, efforts are ongoing to rescue the kidnapped victims and arrest other members of the gang,” he said."
  },
  {
    "headline": "BREAKING: Dele Momodu Declares For 2023 Presidency",
    "summarized_story": "Otunba Dele Momodu has declared his interest to run for president on the platform of the Peoples Democratic Party, PDP.\nThe media mogul indicated his interest while handing a letter of interest to the PDP National Chairman at the party’s secretariat in Abuja.\nDetails shortly…Brief ProfileChief Dele Momodu (born Ayòbámidélé Àbáyòmí Ojútelégàn Àjàní Momodu; 16 May 1960) is a Nigerian journalist/publisher, businessman, and motivational speaker.\nIn 2015, he officially launched Ovation TV and subsequently launched an online newspaper called The Boss.\nMomodu has received hundreds of awards and honours for his work in the world of business, politics, literature, the music industry and the fashion industry."
  },
  {
    "headline": "BREAKING: Dele Momodu Declares For 2023 Presidency",
    "summarized_story": "Otunba Dele Momodu has expressed interest in running for president on the Peoples Democratic Party’s (PDP) platform.\nWhile delivering a letter of interest to the PDP National Chairman at the party’s office in Abuja, the media magnate expressed his interest.\nSoon, there will be more information…"
  },
  {
    "headline": "2023 Presidency: Tinubu’s Declaration Unsettles Osinbajo’s Camp",
    "summarized_story": "The declaration by Bola Ahmed Tinubu on the 2023 presidential election has halted all momentum in Vice President Yemi Osinbajo’s camp, DAILY POST gathered.\nSources in Osinbajo’s camp told DAILY POST that the move by Tinubu has temporarily halted the underground mobilization that is ongoing.\nBefore the announcement by Tinubu, Osinbajo was in a strong momentum.\nIt is only responsible of me to give my unwavering loyalty to President Buhari,” the VP wrote.\nIn the aftermath of the declaration, Mr Tinubu notified Buhari of his intention to run despite claiming that he is still consulting."
  },
  {
    "headline": "Tinubu Reacts To Death Of Fomer Oyo State Governor Alao Akala",
    "summarized_story": "Asiwaju Bola Tinubu, the National Leader of the ruling All Progressives Congress (APC), has expressed great sorrow over the death of former Oyo State governor, Otunba Adebayo Alao-Akala.\nTinubu, a former Lagos State Governor in a statement signed Tunde Rahman of his Media office acknowledged that late Alao-Akala would “sorely” be missed by the people of Ogbomoso, Oyo State and the All Progressives Congress.\nTinubu in his condolence message said: “I received the news of the passing of former governor of Oyo State, Otunba Alao-Akala, with shock and deep sadness.\n“Coming a month after the death of Soun of Ogbomoso, Oba Jimoh Oyewumi, the loss of Alao- Akala, another eminent son of Ogbomoso and Oyo State, is disheartening.\nAs governor of Oyo State, he contributed his quota to the development of the state and tried to enhance the welfare of the people."
  },
  {
    "headline": "Zulum on insecurity: Peace has returned to 11 local government areas, 2 still under ISWAP",
    "summarized_story": "The governor, who acknowledged that peace had returned to 11 local government areas of the state, however, said Abadam and Guzamala local government areas were still under the control of Boko Haram terrorists.\n“Although, the current Service Chiefs, the Theatre Commander, and indeed our General Officer Commanding 7 Division are up and doing.\nOn the committee delegation were Senator Abba Moro, representing Benue South, and Vice Chairman of the Committee, Senator Hassan Mohammed Gusau, Senator Kola Balogun from Oyo South Senatorial district, and Senator Bulus K. Amos from Gombe South.\nHe urged them to further weaken the ISWAP base so the successes recorded in the insurgency fight could be properly consolidated.\nThat incident on December 23, 2021 happened around Udawa village after Buruku in Chikun Local Government Area of the state."
  },
  {
    "headline": "APC reveals plans ahead of national convention, clears air",
    "summarized_story": "The national leadership declared that its immediate task for now was to address and resolve contestations within the party, litigations, fallouts of recently conducted congresses and generally reposition the party ahead of the national convention.\nWhile some members were asking for the national convention in February, others believed that reconciliation of all the crisis across all the chapters of the party should be considered first.\n“The faceless authors and sponsors of fake news on APC activities, in this case the planned National Convention are simply bent on causing confusion and fomenting crisis through misinformation.\n“The APC Caretaker Committee is already embarking on nationwide consultations with Party stakeholders to prepare the ground for a rancour-free National Convention.\nHe also tasked the APC leadership to ensure emergence of a popular candidate like him, saying he enjoyed “massive support of both old and young in Ekiti state.”"
  },
  {
    "headline": "Breaking: At last, FG lifts ban on Twitter",
    "summarized_story": "The Federal Government has lifted the suspension of Twitter operations in Nigeria after approval by President Muhammadu BuhariThe decision was announced by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi.\nDetails loading…"
  },
  {
    "headline": "‘We Are Deeply Committed To Nigeria,’ Twitter Reacts To FG’s Suspension Lift",
    "summarized_story": "The microblogging site, Twitter has reacted to the Federal Government’s decision to lift the restrictions placed on it in Nigeria since June.\n“We are deeply committed to Nigeria, where Twitter is used by people for commerce, cultural engagement, and civic participation,” the tech giant Tweeted.\nREAD ALSO: Timeline: Nigeria’s Suspension Of Twitter OperationsTwitter was accessible in Nigeria on Thursday after the government lifted a seven-month ban on the social media network.\nNigeria halted Twitter operations after the company deleted a comment by President Buhari, provoking an international outcry over freedom of expression.\nBut the presidency said the move had nothing to do with the social media platform’s action."
  },
  {
    "headline": "LIVE: Buhari Visits Ogun State, Commissions Landmark Projects",
    "summarized_story": "﻿President Muhammadu Buhari has paid a visit to Ogun State to commission some projects.\nHe arrived on Thursday morning and was received by dignitaries including the state Governor Dapo Abiodun; Lagos State Governor Babajide Sanwo-Olu; Ogun State former Governor Gbenga Daniel, among others.\nThe President in the company of Governor Abiodun commissioned the 14km Epe/ Ijebuode Express Road in the state.\n﻿At the Sagamu interchange, President Buhari was joined by Ogun State Governor Abiodun; Ekiti State Governor Kayode Fayemi; Ondo State Governor Rotimi Akeredolu; Lagos State Governor Babajide Sanwo-Olu and the Deputy Governor of Oyo State, Rauf Olaniyan.\nAt the interchange, President Buhari commissioned the Ogun city gate and the 42km Abeokuta/ Sagamu road."
  },
  {
    "headline": "Timeline: Nigeria’s Suspension Of Twitter Operations",
    "summarized_story": "June 4: The Federal Government indefinitely suspended the operations of Twitter in Nigeria.\nJune 4: Main opposition party the Peoples Democratic Party (PDP) rejects the Twitter suspension, says President Buhari is pushing Nigerians to the wall.\nJune 4: Nobel Laureate Professor Wole Soyinka says Twitter suspension is a petulant gesture unbecoming of a democratically elected President.\nAugust 11: The Federal Government says it will lift the suspension Twitter in a matter of days,August 11: Twitter confirms it is meeting with representatives of the Federal Government.\nSeptember 15: About 100 days after the suspension, the Federal Government says it is not unmindful of the anxiety over lifting the suspension, pledges to restore Twitter services."
  },
  {
    "headline": "FG Lifts Twitter Suspension After Seven Months",
    "summarized_story": "The Federal Government has lifted the suspension on microblogging site, Twitter, seven months after it suspended the social media platform in Nigeria.\nThis was contained in a statement issued by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi.\n“Therefore, our engagement will help Twitter improve and develop more business models to cover a broader area in Nigeria.\nNigeria halted Twitter operations in June after the company deleted a comment by Buhari, provoking an international outcry over freedom of expression.\nBut the presidency said the move had nothing to do with the social media platform’s action."
  },
  {
    "headline": "11 Killed In Philippines Truck Crash",
    "summarized_story": "At least 11 people were killed after a small truck packed with partygoers, including children, overturned in the southern Philippines, police said Thursday.\nAround 50 people were crammed into the truck, most of them in the open tray, when it veered off the road and into a tree.\nEleven people were killed, including a three-year-old child, De Oro said, adding police were seeking to confirm another three deaths.\nDeadly road mishaps are common in the Philippines, where drivers frequently flout the rules and vehicles are often poorly maintained or overloaded.\nIn 2019, 19 farmers were killed in the mountainous northern Philippines when a truck carrying them and sacks of rice seeds plunged backwards down a deep ravine."
  },
  {
    "headline": "Shonekan was a unifying force for Nigeria",
    "summarized_story": "Former President, Olusegun Obasanjo has described former Head of the Interim National Government (ING), Ernest Shonekan as a unifying force for the nation.\nHe said his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nFormer President Obasanjo said “He would be remembered as a man of sustained strongwill to succeed.\nHe further discribed the former Head of Interim National Government as “a unifying force for the nation and his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nIndeed, Chief Shonekan died at a time the country is in dire need of his leadership, wealth of experience and wisdom to tackle the multifaceted challenges facing the nation.”"
  },
  {
    "headline": "President Buhari pays tribute to life, legacy of ex-interim President, Shonekan -",
    "summarized_story": "President Muhammadu Buhari has received with profound sadness the news of the death of a great statesman and former Head of the Interim National Government, Chief Ernest Shonekan.\nIn a statement by his media aide, Femi Adesina, the President extends deepest condolences to Chief Shonekan’s wife, Margaret, loved ones, as well as the government and people of Ogun State.\nThe President notes that Chief Shonekan demonstrated to all that the love for country and commitment to her development, peace and unity transcend the trappings of office and the transient nature of political power.\nAccording to him, Nigeria owes a great debt to Chief Shonekan, the peacemaker, who even at the twilight of his life time never stopped believing and working for a prosperous and democratic country.\nThe President prays that the memory of the departed Head of Government will remain a blessing to Nigeria even as he finds perfect peace with Almighty God."
  },
  {
    "headline": "Photos: Super Eagles players having walk out ahead Egypt clash -",
    "summarized_story": "Nigeria’s senior national team, Super Eagles, on Tuesday morning had a walkout exercise ahead of the AFCON match against the Pharaoh’s of Egypt.\nBoth Egypt and Nigeria will this evening open the group D matches in the ongoing AFCON 2021 competition in Cameroon."
  },
  {
    "headline": "More than 200 people killed in recent attacks on Zamfara communities",
    "summarized_story": "The People’s Democratic Party in Zamfara said the casualty figure in the recent bandits attack on seven Communities in two Local Government Areas of the state is over two hundred and not fifty eight as the Government state claimed.\nThe PDP said, the casualty in Bukuyyum Local Government Area alone is over one hundred and fiftyZamfara state Chairman of the party Bala Condemn the killings described it as barbaricThe opposition party has also raised the alarm over an alleged sinister plot by the ruling All Progressives Congress to frame up, arrest and detain critical stakeholders of the partyThe party adds that the Move is unpolitical and an attempt to Intimidate and Silence Opposition Parties in zamfaraBala Mande insist that the PDP in Zamfara will not stop speaking the mind of the MassesThe Ruling All Progressive Congress and the Main opposition party PDP in Zamfara have been at logger head in recent timesThe clash has now taken a different dimension as both parties are accusing each other for being responsible for the worsening Insecurity in the state“Plenty of our members are the list of arrest by Security Operatives following directives of the state government authorities”“As we speak, Security agencies are on the trail of Prof. Kabiru Jabaka the Vice Chairman of the PDP Simply because he spoke the the truth and expose the weakness of the Zamfara State Government” Bala MandeThey Called on International Community to deny travel Visa to undemocratic political leaders in Nigeria."
  },
  {
    "headline": "Senior Tories Urge Boris Johnson to Quit After Party Apology",
    "summarized_story": "Boris Johnson is facing calls from senior Tories to resign after he admitted attending a drinks party during lockdown.\nCabinet members including deputy PM Dominic Raab rallied round Mr Johnson.\nHe said he would write to the 1922 Committee, which organises Conservative leadership contests, to register his lack of confidence in the prime minister.\n27 November 2020A leaving event was held for No 10 aide, Cleo Watson, where people were drinking, and Mr Johnson made a speech, according to sources.\n18 December 2020Downing Street originally denied a report by the Daily Mirror that a party took place in Downing Street."
  },
  {
    "headline": "Djokovic in Australian Open Draw as Visa Saga Continues",
    "summarized_story": "Novak Djokovic remained in limbo even after he was included in the draw for the Australian Open on Thursday, with the tennis star still awaiting a government decision on whether to deport him for not being vaccinated for COVID-19.\nDespite the cloud hanging over Djokovic’s ability to compete, Australian Open organizers included the top seed in the draw.\nAustralian Open tournament director Craig Tiley also declined comment after the draw ceremony for the tournament that starts Monday.\nDeputy Prime Minister Barnaby Joyce said most Australians disapproved of the nine-time and defending Australian Open champion coming to Melbourne to compete in breach of the nation’s tough pandemic quarantine rules.\nBut the Australian Border Force rejected the exemption and canceled his visa upon arrival before a federal judge overturned that decision."
  },
  {
    "headline": "French Teachers Go on Strike Over Handling of Pandemic",
    "summarized_story": "Less than two weeks after the winter term started, French teachers are already exhausted by the pressures of surging COVID-19 cases.\nOn Thursday, French teachers are walking out in a nationwide strike organized by teacher’s unions to protest virus-linked class disruptions and ever-changing isolation rules.\nHis ministry counted 50,000 new COVID-19 cases among students in “recent days” and a huge number of classes shut down due to the virus: 10,553.\nThe SNUIPP teacher’s union says discontentment is rising among French teachers.\nThe union expects that some 75% of teachers will go out on strike, with half of the schools closed across the country."
  },
  {
    "headline": "Real Beat Barcelona 3-2 to Qualify for Spanish Super Cup Final",
    "summarized_story": "Real Madrid are through to the Spanish Super Cup final after beating rivals Barcelona in extra-time.\nFederico Valverde slotted in the winner after Ansu Fati’s late equaliser forced extra time in Saudi Arabia.\nIn a thrilling El Clasico clash, Real took the lead three times, with Barca coming back twice before Valverde eventually made it 3-2.\nReal striker Karim Benzema scored and assisted in normal time, but Luuk de Jong and Fati levelled in each half.\nLast season’s La Liga champions Atletico Madrid take on Athletic Bilbao on Thursday in the other semi-final, with the winner facing Real Madrid – chasing their 12th Super Cup – in Sunday’s final in Riyadh."
  },
  {
    "headline": "Mali Beat Tunisia Amid Controversy as Referee Blows for Full-Time Early – Arise News",
    "summarized_story": "Mali and Tunisia’s Africa Cup of Nations game finished in chaos after the referee first signalled for full-time on 85 minutes, then ended the match when the clock showed 89 minutes and 47 seconds.\nHowever, in more farcical scenes, Tunisia’s players did not return to the field and Mali were declared winners.\nThen he ended the match 23 seconds before the 90th minute mark – and without adding on any additional time for stoppages.\nMali substitute Toure was shown a straight red card late on for catching the ankle of Tunisia defender Dylan Bronn, another incident which required a check on the video screen.\nThe city in south-west Cameroon has seen an increased security presence because of recent conflict stoked by local militants pursuing a separatist agenda."
  }
]