[
  {
    "headline": "Muslim/Muslim ticket unacceptable, says CAN, NSCIA differs",
    "summarized_story": "Bayo Oladeji, said having a Muslim/Muslim ticket would set the country on fire.\nOladeji also argued that CAN would not support two Christians running on a joint ticket in 2023.\nAny party that tries Muslim/Muslim ticket or Christian/Christian ticket will fail.\nSo, if they want to try Muslim/Muslim ticket, let them try it.\nThose who are planning Muslim/Muslim ticket should also find out what was the outcome of MKO Abiola and Kingibe ticket."
  },
  {
    "headline": "Cameroonian refugees protest deportation of separatist leaders, demand N68m",
    "summarized_story": "The judgment, according to them, was secured by a team of Nigerian lawyers led by a human rights activist, Femi Falana (SAN).\nThe refugees made the demand during a protest in Abuja to commemorate the four-year anniversary of the arrest and extradition of over 49 of their leaders and others.\nThe leaders were said to have been arrested by security agencies at a hotel in the Jabi area of Abuja and other cities in Nigeria.\nJustice Chikere had in her judgment held that the forced deportation of the Cameroonians was illegal and unconstitutional.\nSpeaking with journalists during the commemoration rally on Tuesday, the President, Association of Southern Cameroon Refugees in Nigeria, Ernest Cho, decried the non-implementation of the court judgment."
  },
  {
    "headline": "Police probe alleged murder of reveller in A’Ibom hotel party",
    "summarized_story": "The Akwa Ibom State Police Command said it has authorised the conduct of an autopsy to determine the cause of the death of one Ernest Akpan in a hotel at Ikot Udoma in the Eket Local Government Area of the state.\nAkpan was said to have been murdered in mysterious circumstances at the hotel at an end of the year party alongside his friends.\nInvestigation is ongoing and I think in no distant time, the killers will be unveiled,” Macdon assured.\nOur correspondent reports that the commencement of the autopsy followed pressure mounted by the deceased’s family, who obtained the CCTV footage of activities at the hotel on the day of the incident.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Joint security to be deployed to Edo community over herdsmen invasion",
    "summarized_story": "By Ozioruva AliuBENIN CITY – THE police in Edo State late yesterday said a joint security team of police, military and other security agencies would be deployed to 2nd Abumwemre Camp (settlement) in Ovia North East local government area of Edo state as a result of alleged threat by suspected migrant herdsmen.\nThe Police Public Relations Officer, SP Bello Kontongs stated this after a joint security team, comprising the Nigeria Army and the Nigeria police and the media visited the multi-ethnic Camp where he assured the people of security of lives and property.\nREAD ALSO:Police recover 109 anti-aircraft ammunition in KatsinaThe visit was occasioned by reported invasion of the area by suspected herdsmen some of them dressed in military camouflage.\nKotongs spoke in behalf of the State Commissioner of police, CP.\n“We want to assure the Community and residents of Edo State and the State government has decided to send a delegation to douse the tension and ensure people are safe."
  },
  {
    "headline": "Crack in Apostolic Church Mission over election of new President",
    "summarized_story": "By Ugochukwu Alaribe, UMUAHIATrouble is brewing in the Apostolic Christian Church Mission, ACCM, with its national headquarters at 34 Omuma Road, Aba, Abia State, over the installation of a new President.\nVanguard gathered that contrary to the Constitution of the Church, two Apostles and the surviving members of the Board of Trustees, BoT, of the Church are set to install a new President of the Church after the death of the immediate past President, Rev.\nVanguard also gathered that the Church operates a seven-man BoT, in which three members can form quorum to install a new President.\nHowever, only two members of the BoT are alive and can’t elect a new president according to the Church’s Constitution.\n“That by the provisions of the Constitution of the Church, particularly article 7(1)(j), a new president of the Church can only be installed by the Trustees of the Church after the burial of the late president."
  },
  {
    "headline": "FG to increase power generation to 25,000MW — Minister",
    "summarized_story": "Abubakar Aliyu has said that the Buhari administration was worried about power generation hovering around 5,000MW.\nHe said efforts were on to increase it to 7,000MW, then 11,000 MW before finally reaching 25,000MW in a few years time.\nAccording to him, the 215MW Kudenda power station in the Chikun local government area of Kaduna state, which has reached 80% completion, will be completed soon.\nThe Minister said the major challenge faced by electricity in Nigeria is the poor transmission of power generated, adding that the government is doing everything possible to harvest the generated power, transmit them and generally improve electricity supply across the country.\n“This power station project started in 2012 and it has reached over 80% completion before work stalled, now we are trying to revive it."
  },
  {
    "headline": "Akwa Ibom Assembly denies receiving share of N171.2bn derivation windfall",
    "summarized_story": "The report even alleged that the state Governor’s ‘Grade A Lawmakers’ received additional N20 million each.\n“During the 2021 Christmas celebration, at least five members of the House of Assembly did constituency briefing and empowerment.\nAkpan who is also the deputy leader of Akwa Ibom House of Assembly, stressed that such a thing never happened.\nHis words: “The said media report is a deliberate lie, it is untrue, misleading and mischievous; it is a futile attempt to mislead our constituents.\n“The mere fact that some members of the State Assembly empowered their constituents during the Yuletide season should not bring this mendacious propaganda."
  },
  {
    "headline": "Uzodimma to Okorocha: You’re my younger brother, I can’t join issues with you",
    "summarized_story": "By Idowu BankoleThe Imo State Governor Sen. Hope Uzodimma has broken his silence on issues revolving around attacks on the performance of his government and person, saying he can’t join issues with former Governor of the State, Sen. Rochas Okorocha on matters concerning governance in the state.\nRecall, sections of the media have it that, ex-Governor, Senator Okorocha had accused the Imo State Governor of witch-hunting his family since his emergence as Governor.\n“All of you who know me well in Imo state, I tried one time or the other to contest the election.\nEmeka Ihedioha; former Governor, Okorocha; former Governor.\n“I don’t want to join issues with him."
  },
  {
    "headline": "Kwara: We handled 1,027 cases in Kwara 2021 – NSCDC",
    "summarized_story": "The Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC) received 1, 027 cases, bordering on different offences, from the 16 local government areas of the state, in the year 2021.\nThe State Commandant of NSCDC, Makinde Ayinla, stated this during a press conference in Ilorin on Tuesday.\nAyinla said that the cases bordered on different offences like theft, assaults, land disputes, rape, criminal breach of trust, burglary and debt among others.\nHe explained that 31 cases were prosecuted with 6 convictions, while 24 cases were still pending in court.\nAyinla, said that no death was recorded during the cause of work in the state by operatives of the command."
  },
  {
    "headline": "Amotekun has made Ondo most peace state in Nigeria – Akeredolu",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State has described the birth of the Amotekun Corps in the state as timely, stressing that the move has made the state to be adjudged the most peaceful state in the country.\nWhile emphasising that one of the parameters to measure a healthiness of a state is it security situation, Akeredolu said the Amotekun Corps has performed creditably well.\nWhile commending other security agencies in the state for their efforts at sustaining peace in the state, he said Amotekun Corps was been put in place to complement their efforts.\n“We salute the military, police, Nigerian Security and Civil Defence Corps and other paramilitary agencies for their efforts in sustaining the peace in our State.\nLet me reiterate for the umpteenth time that the Amotekun Corps has been put in place to complement their efforts."
  },
  {
    "headline": "Magodo Estate: IGP Baba, AGF Malami sent us, we can’t leave – Police reply Sanwo-Olu",
    "summarized_story": "An unidentified Chief Superintendent of Police (CSP) on Tuesday turned down the order of Lagos Governor, Babajide Sanwo-Olu, to leave Magodo Phase 2 Estate.\nThe officer informed Sanwo-Olu that he and others colleagues were there at instance of Inspector-General of Police, Usman Baba and Attorney General and Minister of Justice, Abubakar Malami (SAN).\nThe governor and officials of the state were at the location to calm nerves of residents protesting the deployment of security operatives.\nThe governor said, “Can you call your superiors in Abuja and tell them that the governor is here, as the Chief Security Officer?\nFor security purpose, I cannot tell you the number.”Noting that the officers are not Lagos State Police Command, Sanwo-Olu announced that he would call the IGP Baba and AGF Malami to resolve the situation."
  },
  {
    "headline": "Four dead, warder injured in attempted Osun jail break",
    "summarized_story": "Four inmates have reportedly been shot dead as they made an attempt to break out of the Nigerian Correctional Service facility at Kosere, Ile-Ife.\nThe incident, which occured around 9am on Tuesday, it was gathered was repelled by personnel of the Nigerian Correctional Service.\nAt the time of filing this report, the spokesperson of Osun Command of Correctional Service, Sola Adeotan, said there was no information on the incident.\nHowever, the spokesperson of the Osun State Police Command, Yemisi Opalola confirmed the incident but asked to be given time to get more details on the incident.\nAs at the time of filing this report, Osun State Comptroller of Corrections, Lanre Amoran, had visited the facility for an on-the-spot assessment."
  },
  {
    "headline": "How to Oyo schools resume January 10",
    "summarized_story": "Oyo State Government on Tuesday directed all public to resume for second term 2021/2022 academic session on Monday, January 10, 2022.\nChairman, Oyo State Universal Basic Education Board (SUBEB), Dr. Nureni Aderemi Adeniran, made the announcement during New Year prayers with officials.\nAdeniran said the Ministry of Education, Science and Technology and SUBEB would monitor compliance across the state.\nAdeniran wished schools, teachers and students a safe, successful session and urged them to observe all COVID-19 safety protocols.\nThe chairman assured that welfare of staff members remains the top priority of the management and the Governor Seyi Makinde administration."
  },
  {
    "headline": "Africa leaders chart pathway for peace, COVID-19 at Dakar Forum",
    "summarized_story": "The International Forum for Peace and Security in Africa held at Abdou Diouf International Conference Centre, Dakar, Senegal explored ways to get Africa out of the grip of wars and COVID-19.\nSall added that national responsibility, international solidarity and collective security mean that peace and security in Africa are integral to world peace and security.\nHe called for the review of the intellectual right by world power for African countries to be able to manufacture vaccines.\nWe have a lot of experience in this region because we are the main partners with the Sahel countries.\n“NAPSA, a New Approach for Peace and Stability in Africa that we introduced in the last forum, is one example."
  },
  {
    "headline": "Wike accuses Ogoni leaders of betrayal",
    "summarized_story": "Rivers State Governor Nyesom Wike yesterday accused some Ogoni leaders of insincerity in the struggle for a better living standard.\nSuch leaders, the governor said, promote disunity among themselves, only to blame the backwardness of Ogoni land on others.\nWike spoke at the 30th anniversary of Ogoni Day with the theme: “Leaving no one behind”, which held in Khana Local Government Area yesterday.\nAll of you here today for Ogoni Day, are you standing firm for Ogoni people?\nSenator Barry Mpigi commended the governor for gracing the occasion and identifying with the Ogoni people and their struggle."
  },
  {
    "headline": "President mourns former CNS Ibrahim, ex-Head of DMI Sabo",
    "summarized_story": "President Muhammadu Buhari has mourned former Chief of Naval Staff (CNS), Rear Admiral Ishaya Iko Ibrahim (retd.\n), as well as a former Head of the Directorate of Military Intelligence (DMI), Brig.-Gen. Ibrahim Sabo.\nThe statement said: “President Buhari condoles with family of former Chief of Naval Staff, Rear Admiral Ishaya Iko Ibrahim (retd.\n), who served as Flag Officer Commanding (FOC) Naval Training Command and Naval Western Command before reaching the peak of his career.\n- Advertisement -“The President prays that the Almighty God will receive the souls of the departed former military officers, and comfort their families,” the statement said."
  },
  {
    "headline": "AYCF to President: withdraw list of INEC commissioners from Senate",
    "summarized_story": "The Arewa Youth Consultative Forum (AYCF) has urged President Muhammadu Buhari to withdraw the names of the Independent National Electoral Commission (INEC) Commissioners he sent to the Senate for confirmation and include the names of people with integrity and capability to deliver.\nIn a statement, AYCF’s National President Shettima Yerima said without appointing credible people as INEC commissioners, the President should not expect credible elections in 2023.\nHe said: “If this is not reversed, it may portend bad omen for the coming general election and beyond.\n“We, therefore, call on Mr. President, for the sake of national interest and the need to safeguard our electoral democracy in 2023, to recall the list he sent to the Senate and appoint people who have proven records of commitment to electoral integrity that Nigerians already know nationwide.\nAYCF added that if Mr. President fails to withdraw and review the list of nominees sent to the Senate and make changes, the clear message is that serving your country with integrity and honesty doesn’t matter anymore."
  },
  {
    "headline": "Fed Govt set to gazette order classifying gunmen terrorists",
    "summarized_story": "The Federal Government is set to gazette the court order classifying bandits as terrorists, it was learnt yesterday.\nThe November 26, 2021 judgment by Justice Taiwo Taiwo of the Federal High Court in Abuja has also become a critical factor in the deployment of Super Tucano aircraft in the fight against terrorists, kidnappers and bandits.\nMalami spoke on the gazette and the request for Kanu’s release on the Nigeria Television Authority (NTA) ‘Good Morning Nigeria’ show.\nBoko Haram was also proscribed.”The AGF said the outcome of IPOB and Boko Haram’s proscription encouraged government to consider the decision to deploy military hardware against bandits.\nAnd that is how the idea of looking at the activities of the bandits, cattle rustlers, kidnappers come into being."
  },
  {
    "headline": "Protest in Magodo over demolition plan, police presence",
    "summarized_story": "By Christopher OjiResidents of Magodo Phase 2 Estate in Lagos State, yesterday, took to the street to protest against the presence of about 50 policemen at the gate.\nThis was after the estate’s management had ordered the closure of the gates in protest against the planned demolition of property within the estate.\nHowever, the board of trustees of the estate has apologized to Odumosu over the misdemeanor of the guards who barred him from entering the estate.\nThe family were said to have led the group and armed policemen to the estate to execute a Supreme Court judgement.\nThe group was about to enter the estate with a bulldozer when the estate management ordered the closure of the gate."
  },
  {
    "headline": "NAF appoints new AOCs, branch chiefs, others",
    "summarized_story": "From Molly Kilete, AbujaThe Nigerian Air Force (NAF) has announced the appointment of new Branch Chiefs, Air Officers Commanding (AOCs), Commandants of Tri-Service and NAF institutions as well as Unit Commanders to head the various units and formations of the Service across the country.\nThe appointments, according to the Chief of the Air Staff (CAS), Air Marshal Oladayo Amao, is aimed at reinvigorating the NAF for greater performance, enhanced productivity, operational efficiency, and effective service delivery.\nAlso appointed are AVM Emmanuel Wonah, former Managing Director NAF Investments Limited (NAFIL) as Chief of Aircraft Engineering (CAcE), HQ NAF, AVM Raimi Salami is now redeployed as the Chief of Communications Information Systems (CCIS) HQ NAF, while AVM Olatokunbo Adesanya has been appointed as Chief of Logistics (CLOG), HQ NAF.\nFurthermore, AVM Aliyu Bello, erstwhile AOC Mobility Command (MC), Yenagoa is now the Chief of Standards and Evaluation (COSE), HQ NAF, AVM Nelson Calmday is to take over as the Chief of Administration (COA), HQ NAF and AVM Paul Jemitola is now the Air Secretary, HQ NAF.\nThe newly appointed and redeployed senior officers are expected to assume their new offices on or before Friday, 7 January 2022."
  },
  {
    "headline": "Lagos blue, red lines rail begins operation Q4, says Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Babajide Sanwo-Olu, yesterday, said the much-awaited blue and red lines trains are to commence operation before the fourth quarter of the year.\nHe stated this when he took a tour of the train project from Ikeja, where the red line begins to Yaba, Ebute Meta and finally to Marina where the blue line terminates.\n“Our promise on the blue and the red line is still on course.\nThe red and blue line rail is part of the intermodal transportation system of the Babajide Sanwo-Olu administration in reducing gridlock and ensuring interconnectivity in different parts of the state.\nAnd when completed, the 37 kilometres Red Line Rail Project will link Agbado to Marina, while the 27.5 kilometres Blue line Rail Project will run from Okokomaiko to Marina."
  },
  {
    "headline": "3 killed in Plateau, Lalong vows to sign death penalty for kidnappers",
    "summarized_story": "From Gyang Bere, JosNo fewer than three persons have been reportedly killed by gunmen at Rafin Bauna in Bassa Local Government Area of Plateau State.\nIt was gathered that the victims were ambushed and killed by their assailants.\nPlateau State Governor, Simon Lalong, in a press statement signed by Director of Press and Public Affairs, Makut Simon Macham, condemned the attack and urged security operatives to unmask the perpetrators.\nHe sympathised with the families of the victims and assured them that justice would be done.\nMeanwhile, he has warned kidnappers to leave the state as anyone who caught and convicted for kidnapping would face the death penalty."
  },
  {
    "headline": "Electoral bill: Nigeria not ripe for direct primary –IPAC",
    "summarized_story": "From Fred Ezeh, AbujaInter–Party Advisory Council (IPAC) has commended the decision of President Muhammadu Buhari to withhold assent to the amended Electoral Act Bill due to the inclusion of compulsory direct primary for political parties.\nIPAC said the president was right in rejecting the bill, stressing that at this stage of democratic journey, Nigeria does not appear to be sufficiently ripe and prepared for the direct primary model in the selection of political party standard bearers.\n“The only expressed grouse of the president was the mandatory use of direct primary in the selection of standard bearers of all the political parties.\n“This should not be a difficult task given that the two arms are, incidentally, controlled by the same political party, the All Progressives Congress.\nLawmakers should simply expunge the clauses regarding direct primary, thereby, saving the other provisions among which are the one on the mandatory electronic transmission of election results by INEC."
  },
  {
    "headline": "Buhari Appoints Doyin Salami as Chief Economic Adviser",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has appointed Dr. Doyin Salami as his Chief Economic Adviser (CEAP).\nThis is coming less than 17 months to the end of the eight-year administration of President Buhari and also the first time a Chief Economic Adviser will be named for the president since he assumed office on May 29, 2015.\nAccording to a statement issued on Tuesday by the Media Adviser to the President, Femi Adesina, Dr Salami was until his latest appointment the Chairman of the Presidential Economic Advisory Council (PEAC).\nThe Chief Economic Adviser to the President is expected to address all issues on the domestic economy and present views on them to the president; closely monitor national and international developments, trends and develop appropriate policy responses.\nHe is also to develop and recommend to the president national economic policies to foster macro-economic stability, promote growth, create jobs and eradicate poverty, among others."
  },
  {
    "headline": "No Controversy on Who Becomes Next Olubadan, Say Ibadan High Chiefs",
    "summarized_story": "Curiously, the Osi Olubadan, High Chief Rasheed Ladoja, and two other members of the council were absent at the meeting.\nSanwo-Olu said in the message, “On behalf of the government and people of Lagos, I commiserate with my brother, the Oyo State Governor, Engr.\n“The death of Oba Adetunji is a great loss to the people of Ibadan and he will be greatly missed.\n“Late Oba Adetunji was a patriotic Nigerian, who was deeply committed to the peace, unity and development of our country.\nHis nearly six years on the throne brought peace and great development to his kingdom and the entire Oyo State."
  },
  {
    "headline": "Buhari: Tofa, True and Irreplaceable Nationalist",
    "summarized_story": "Tofa died at Aminu Kano Teaching Hospital (AKTH), in Kano State, in the early hours of yesterday after a brief illness.\nThe Emir of Kano, Alhaji Aminu Ado Bayero, and former governor of Kano State, Mallam Ibrahim Shekarau, were among prominent Nigerians that attended the funeral prayer.\nApart from the president, Kano State Governor Abdullahi Ganduje, former Vice President Atiku Abubakar, and Yobe State Governor Mai Mala Buni were among those, who sent early tributes to the deceased.\nBuhari, while leading the nation in mourning Tofa, described him as a politician of note, who was also a promoter of Islamic culture and civilisation.\nThe president described Tofa as a true nationalist that would be difficult to replace."
  },
  {
    "headline": "FG Commences Collection of Income Tax on Bonds, Short-term Securities from Today",
    "summarized_story": "•Stockbrokers express divergent view over new policyKayode TokedeThe federal government will today commence the collection of income tax on bonds, short-term securities.\nThis followed the expiration of a 2012 gazette which exempted Companies Income Tax (CIT) from bonds and short-term securities in the past 10 years.\nThe proposed charges on fixed income securities should not discourage investors from the asset class.\n“However, it will be a function of the volume an investor is buying from the fixed income market.\nA Lagos-based analyst, Mr. Moses Ojo noted that the introduction of tax income on government securities would further reduce activities."
  },
  {
    "headline": "NFF to Deny Unvaccinated Journalists Access to Eagles Training",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Nigeria Football Federation (NFF) has made the possession of COVID-19 vaccination cards mandatory for journalists wishing to cover the Super Eagles training session at the Moshood Abiola National Stadium, Abuja.\n“We appreciate you for positively projecting our darling team, the Super Eagles.\n“There will be full media access to the team’s training today, 3rd January, 2022 from 5pm.\nThere will also be 15 minutes access to all players and officials after the training.\n“In strict adherence to COVID-19 protocols, everyone will present their COVID-19 vaccination cards or PCR Test result (72hrs maximum) at the gate,” the statement said."
  },
  {
    "headline": "EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027",
    "summarized_story": "“Pressure came from two Northern governors for President Buhari to allow Jonathan to complete his term and return power to the North for another eight years beginning from 2027,” the source revealed.\nHowever, top power brokers close to Buhari see the former Lagos governor as politically unpredictable and therefore have been working against his interest.\nIn November 2021, another group, Patriots of Bola Ahmed Tinubu, was established in Abuja to further push the former Lagos governor’s ambition of succeeding President Buhari in office in 2023.\nCouncil, Abdulmumin Jibrin, said the former Lagos governor will contest the 2023 election because he had more experience to run Nigeria than the others eyeing the position.\nLike Tinubu, there are dozens of other groups also currently drumming support for Osinbajo ahead of the 2023 election."
  },
  {
    "headline": "EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027",
    "summarized_story": "“Pressure came from two Northern governors for President Buhari to allow Jonathan to complete his term and return power to the North for another eight years beginning from 2027,” the source revealed.\nHowever, top power brokers close to Buhari see the former Lagos governor as politically unpredictable and therefore have been working against his interest.\nIn November 2021, another group, Patriots of Bola Ahmed Tinubu, was established in Abuja to further push the former Lagos governor’s ambition of succeeding President Buhari in office in 2023.\nCouncil, Abdulmumin Jibrin, said the former Lagos governor will contest the 2023 election because he had more experience to run Nigeria than the others eyeing the position.\nLike Tinubu, there are dozens of other groups also currently drumming support for Osinbajo ahead of the 2023 election."
  },
  {
    "headline": "EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027",
    "summarized_story": "“Pressure came from two Northern governors for President Buhari to allow Jonathan to complete his term and return power to the North for another eight years beginning from 2027,” the source revealed.\nHowever, top power brokers close to Buhari see the former Lagos governor as politically unpredictable and therefore have been working against his interest.\nIn November 2021, another group, Patriots of Bola Ahmed Tinubu, was established in Abuja to further push the former Lagos governor’s ambition of succeeding President Buhari in office in 2023.\nCouncil, Abdulmumin Jibrin, said the former Lagos governor will contest the 2023 election because he had more experience to run Nigeria than the others eyeing the position.\nLike Tinubu, there are dozens of other groups also currently drumming support for Osinbajo ahead of the 2023 election."
  },
  {
    "headline": "EXCLUSIVE: EFCC Operative Who Exposed How Nigeria’s Attorney-General, Malami, Ordered Unfreezing Of ‘Big Cases’ Bank Accounts Detained After Leaked Audio",
    "summarized_story": "He was arrested when the audio leaked to media and was published.\nHe is being detained at the EFCC in Abuja,” the source said.\n“Yes, Malami introduced you to Ameh, so it will not be possible to debrief him,” the EFCC official said.\nAlso, his account was recently unfrozen to enable him to quickly move out the money as advised by the EFCC operative.\nFollowing the leaked audio and dust in generated, the EFCC on December 23, 2021 announced that it was investigating the issue, adding that it frowned against acts of corruption."
  },
  {
    "headline": "EXCLUSIVE: EFCC Operative Who Exposed How Nigeria’s Attorney-General, Malami, Ordered Unfreezing Of ‘Big Cases’ Bank Accounts Detained After Leaked Audio",
    "summarized_story": "He was arrested when the audio leaked to media and was published.\nHe is being detained at the EFCC in Abuja,” the source said.\n“Yes, Malami introduced you to Ameh, so it will not be possible to debrief him,” the EFCC official said.\nAlso, his account was recently unfrozen to enable him to quickly move out the money as advised by the EFCC operative.\nFollowing the leaked audio and dust in generated, the EFCC on December 23, 2021 announced that it was investigating the issue, adding that it frowned against acts of corruption."
  },
  {
    "headline": "New COVID variant discovered in France -- but WHO says it's not yet a threat",
    "summarized_story": "A new COVID variant has been discovered in France.\nAdvertisementThe variant, called B.1.640.2 and dubbed the IHU variant, is said to have infected 12 people in France so far.\nAdvertisementAs of November 2021, WHO has identified seven major COVID variants — Alpha, Beta, Gamma, Delta, Omicron, Lambda, and Mu.\nThe most recent variant, Omicron — labelled a “variant of concern” — was detected by South African authorities in November.\nThe Delta and Omicron variants have been linked to high infection rate across the world."
  },
  {
    "headline": "New COVID variant discovered in France -- but WHO says it's not yet a threat",
    "summarized_story": "A new COVID variant has been discovered in France.\nAdvertisementThe variant, called B.1.640.2 and dubbed the IHU variant, is said to have infected 12 people in France so far.\nAdvertisementAs of November 2021, WHO has identified seven major COVID variants — Alpha, Beta, Gamma, Delta, Omicron, Lambda, and Mu.\nThe most recent variant, Omicron — labelled a “variant of concern” — was detected by South African authorities in November.\nThe Delta and Omicron variants have been linked to high infection rate across the world."
  },
  {
    "headline": "TRENDING VIDEO: 'I am acting on IGP's order' -- CSP defies Sanwo-Olu in Magodo",
    "summarized_story": "Abimbola Oyewole, identified as a chief superintendent of police (CSP), on Tuesday, defied Babajide Sanwo-Olu, governor of Lagos, during the latter’s visit to Magodo estate to intervene over a planned demolition.\nThe state, however, said the supreme court verdict only relates to “allocation” and not “possession” of any land, adding that the Shangisha landlords cannot claim any land at Magodo.\nSanwo-Olu had later arrived at the estate with some government officials, including Moyosore Onigbanjo, the attorney-general of Lagos.\nOn arrival, the governor asked the CSP to explain his reasons for being at the estate without the knowledge of the state.\nAdvertisement“It’s a case between the supposed people and the Lagos state government."
  },
  {
    "headline": "TRENDING VIDEO: 'I am acting on IGP's order' -- CSP defies Sanwo-Olu in Magodo",
    "summarized_story": "Abimbola Oyewole, identified as a chief superintendent of police (CSP), on Tuesday, defied Babajide Sanwo-Olu, governor of Lagos, during the latter’s visit to Magodo estate to intervene over a planned demolition.\nThe state, however, said the supreme court verdict only relates to “allocation” and not “possession” of any land, adding that the Shangisha landlords cannot claim any land at Magodo.\nSanwo-Olu had later arrived at the estate with some government officials, including Moyosore Onigbanjo, the attorney-general of Lagos.\nOn arrival, the governor asked the CSP to explain his reasons for being at the estate without the knowledge of the state.\nAdvertisement“It’s a case between the supposed people and the Lagos state government."
  },
  {
    "headline": "US hits new daily record with over 1 million fresh COVID infections",
    "summarized_story": "The United States has set a new single-day record with over one million fresh coronavirus infections recorded in the country.\nAccording to The Guardian, the new figure comes days after a previous daily record of 590,000 cases.\nAdvertisementThe development comes amid concerns of high transmissibility linked to the Omicron COVID variant.\nAlthough the US had imposed a travel ban on eight southern African countries over concerns related to the Omicron variant, the ban was lifted on December 31.\nAnnouncing the suspension of the travel ban, Kevin Munoz, a White House spokesperson, had said the decision was recommended by the Centers for Disease Control and Prevention."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Not your typical African tech stories",
    "summarized_story": "For the third year running, people are living through different levels of lockdowns and increasing cases of COVID-19 and its variants.\nSome countries are still reconsidering lifting lockdowns, while others have experienced more than three waves of the pandemic already.\nI’m tempted to ask, “when does all this end?” So, this is another reminder for you to stay safe.\nHowever, this does not affect Blackberry devices running on Android OS.\nIt features the lives and exploits of African tech specialists across the world."
  },
  {
    "headline": "Meaningful reflection and excitement for the future",
    "summarized_story": "Unsurprisingly, the industry that stood out heads, shoulders, and knees above the pack was the fintech space.\nContext: In recent years, mobile money adoption in Ghana has been growing in leaps and bounds to rival Kenya’s success story.\nA levy on mobile money transactions would improve taxation revenues, but there’s no telling how it would impact the average mobile money user.\nWhatever the apex bank decides tomorrow could heavily affect Nigeria’s fintech space.\nAlso, in 2021, Nigerian fintech, Piggyvest, said it disbursed $587.5 million to 3.5 million customers."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "Early prevention, palliative care poor in fight against cervical cancer",
    "summarized_story": "Nigeria seems to be playing fiddle in the fight against cervical cancer without an adequate capacity for primary prevention and palliative care, despite bearing the fourth worst burden of death from the disease after China, India and Indonesia.\nThe analysis, aimed at the content of policies for the prevention of cervical cancer in Africa, scored Nigeria two points on primary prevention, three on secondary and just one on tertiary prevention, a cumulative of six points.\nIn a country where about 12,075 women are diagnosed with cervical cancer each year, the second most frequent cancer among women, the study shows that campaigns about risk factors for cervical cancer are inadequate.\nMany cervical cancer prevention activities in low- and middle-income countries are donor-funded.\nFor example, the WHO strategy for cervical cancer elimination recommends twice-lifetime screening – ages 35 and 45."
  },
  {
    "headline": "BusinessDay set to host 2022 Africa Business Convention",
    "summarized_story": "BusinessDay Media Limited, producer of BusinessDay (Nigeria), West Africa’s leading provider of business intelligence and information on diversified media platforms including online, mobile, and print, is delighted to announce its plans to host the Africa Business Convention – Africa’s biggest business conference and investment expo.\nTop African government and business leaders as well as high-level networking on the African continent are expected to grace the convention and proffer solutions that will address challenges in the business environment across Africa.\n“Following the devastating impact of the COVID-19 pandemic since it hit the continent in early 2020, there is no better time to discuss Africa’s recovery than now,” Ogho Okiti, Managing Director, BusinessDay (Nigeria) said.\nRead also: Business leaders to participate in Africa business conferenceOkiti who is also the Project Lead, ABC 2022 added that one of the key objectives of ABC2022 is to leverage the event to attract investors and showcase strategic investment opportunities in Africa as the continent continues to recover from the pandemic.\n“The convention plans to welcome in-person, 300+ top decision-makers in government and business leaders, and virtually, 3000+ global attendees, including investors, thought leaders, policy experts, development professionals, innovators, global media, etc,” he said."
  },
  {
    "headline": "December rally eludes manufacturers",
    "summarized_story": "The contraction was unexpected, as experts noted that the festive season was supposed to boost manufacturers’ output.\nThe decline was due to the increased uncertainty among manufacturers on the back of the fast-spreading omicron variant of COVID-19 which was first reported to the WHO in late November.\nRead also: Three major things manufacturers need to scale in the New YearFurthermore, supply constraints remained a challenge despite the opportunity presented by the yuletide season to ramp up production activities.\nAmong the five sub-indices analyzed, the most common response was no change, which accounted for over 50 percent.\nDespite manufacturers’ anticipation for increased product demand, the decline in new orders which used to perform well during the period shows that the decline in consumers’ purchasing power is more intense than before."
  },
  {
    "headline": "Ossiomo Power commissions new 40MW IPP to power Industrial Park in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… powers Ologbo, Obayantor communitiesBENIN CITY – Ossiomo Power in Benin City has commissioned a new 40MW Independent Power Plant (IPP) dedicated to providing power to the Benin Industrial and Enterprise Park and local communities in Ikpoba Okha Local Government Area of Edo State.\nManaging Director, Ossiomo Power, Dr. Uwa Igiehon, in an interview with journalists, said in conjunction with the Edo State Government, the power plant is providing 24/7 power to Ologbo and Obayantor communities in the area.\nDr. Igiehon said the new plant is a testament to Governor Godwin Obaseki’s pledge to light up Edo State.\nAccording to Dr. Igiehon, “The 40MW plant was tested on 29th of December and is fully operational.\nDr. Igiehon said the initiative has provided succour to members of Ologbo community who now benefit from the power supply from the new power plant."
  },
  {
    "headline": "Obaseki boosts traffic mgt in Benin, to acquire more tow trucks, install bus-stop signposts, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…expands EDSTMA operations to Auchi, Uromi, Ekpoma, othersBENIN CITY – The Edo State Government is acquiring more tow trucks and installing bus stop signposts and traffic lights to strengthen the response of the Edo State Traffic Control and Management Agency (EDSTMA) to traffic management in the Benin metropolis.\nHe stated that aside from conducting the basic function of traffic management, the agency was able to reduce traffic menace by 50 percent, adding, “For 2022, there is need to expand to Okada and Owan axis.\nWe want passengers to be able to identify their bus stops.\nWe are coming up with bus-stop road signs with the names of such bus stops.\nA driver should be able to call a name to which a passenger responds and not just stop at random everywhere."
  },
  {
    "headline": "Edo sets up c’ttee to audit orphanages, threatens to shut down charity homes operating as businesses – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has disclosed plans to set up a committee to monitor and audit orphanage homes in the state, threatening to close down and prosecute orphanage homes operating as businesses as against their designation as charities.\n“They build orphanage homes with the intention to make a profit, rather than for charitable purposes.\nYou will understand that the issue of human trafficking has been a very strong challenge globally and at the state level, Governor Godwin Obaseki has made serious efforts to stamp out human trafficking in Edo State.\nIt then means we must reform every department that is within the purview of this ministry.\nIt is a charity and if you do not have the heart to do charity, you cannot be in the issue of managing orphanage homes."
  },
  {
    "headline": "Edo residents hail Obaseki on ‘most peaceful Yuletide season’ on back of security reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Bold and courageous reforms initiated by the Edo State Governor, Mr. Godwin Obaseki have been identified as being instrumental to the relatively peaceful yuletide celebration witnessed across Edo State.\nThe governor had in the last few months mobilized communities and security agencies in the state in activating a community policing model that involved local vigilantes, who collaborate with security agencies to provide intelligence and patrols.\nThis development had forestalled crime and criminality in major cities, towns and communities across the state.\nA cross-section of residents in Edo State hailed the state government for the peaceful atmosphere in which they marked the Yuletide festivities.\nHe made all this possible with the bold reforms in security management.”..."
  },
  {
    "headline": "Group asks IGP to probe Lagos CP for ‘misuse of privilege’ in Magodo estate incident",
    "summarized_story": "A group, the Human and Environmental Development Agenda (HEDA), has asked the Inspector General of Police (IGP) Usman Baba, to probe Hakeem Odumosu, Lagos commissioner of police, over what it called misuse of privilege in an incident at Magodo Brooks Estate in Lagos.\n“And a passer-by widow with three children, at Brooks Estate in Magodo, Lagos by the Lagos State Commissioner of Police, Mr. Hakeem Odumosu, on Saturday, January 1st, 2022.\n“We invite the inspector-general of police to order an investigation into the misuse of privilege by the Lagos commissioner of police and further call on Lagos state governor, Mr. Babajide Sanwo-Olu.\nThe Lagos Police Commissioner Odumosu had also ordered the arrest of one Adebola Fatiregun, a female resident who is a widow, and her three children for intervening in the matter.\nIn the statement titled, ‘Brooks estate not locked down by Lagos CP’, the police spokesperson said the CP did not lock down the estate as speculated on social media."
  },
  {
    "headline": "Malami says Buhari govt hasn’t declared bandits as terrorists after court order because it follows global best practices",
    "summarized_story": "Nigeria’s Attorney and Minister of Justice, Mr. Abubakar Malami, has said the President Muhammadu Buhari government is yet to officially designate bandits as terrorists because the government is following international best practices.\nThe Buhari government had come under criticism for hastily declaring separatist group, the Indigenous People of Biafra (IPOB) as a terrorist group in 2017, while refusing to label bandits carrying out killings and kidnappings across the North.\nIn the case of IPOB, Malami was able to gazette the designation of IPOB as terrorists on the same day that Justice Abdu Kafarati gave the order on September 20, 2017.\n“With that in mind, Nigeria acted, first by proscribing IPOB, taking into consideration the threats to lives and properties they have caused in the nation.\nAnd that is how the idea of looking at the activities of the bandits, cattle rustlers, kidnappers come into being."
  },
  {
    "headline": "Uzodinma names Okorocha, Nwosu as sponsors of banditry, kidnapping in Imo",
    "summarized_story": "Imo State governor, Senator Hope Uzodimma has accused ex-Governor Rochas Okorocha and his son-in-law, Uche Nwosu of being the brains behind banditry and kidnapping in the state.\nThe governor’s chief press secretary, Mr Oguwike Nwachuku made the allegation in a statement on Tuesday.\nOkorocha had said at a press conference last week that, “It appears to me as though the misery behind unknown gunmen has been unravelled by recent happenings.\nAnd what is (sic) unknown gunmen?\nUnknown gunmen now are set of policemen from government house."
  },
  {
    "headline": "Al-Ghais to succeed Barkindo as OPEC Secretary-General",
    "summarized_story": "The Organization of the Petroleum Exporting Countries (OPEC) has appointed Kuwaiti’s Haitham Al-Ghais as its next Secretary-General.\nOPEC in a statement issued after its special video conference held yesterday, said the appointment takes effect on August 1st, and will last for three years.\n“These efforts are widely credited with helping to stabilize the global oil market since the unprecedented market downturn related to the COVID-19 pandemic, and providing a platform for recovery.\n“Before being appointed Secretary-General, Mr Barkindo held a number of key roles at OPEC between 1986 and 2010, including as Acting Secretary-General in 2006.\nHe also told a Saudi-owned TV channel that the OPEC+ alliance, which gathers OPEC and other crude producers, is important for the stability and balance of oil marketsFacebook Notice for EU!"
  },
  {
    "headline": "Why Okorocha Is In Sumpremacy Contest With Me – Uzodimma",
    "summarized_story": "The governor of Imo State, Hope Uzodinma, has revealed that the immediate-past governor of the state and Senator representing Imo West senatorial district, Rochas Okorocha, was in sumpremacy contest with him because he (Okorocha) wants to remain the governor of the state for ever, even after leaving office.\nUzodinma made the disclosure at the 2022 Imo Stakeholders Meeting/Luncheon held at the Government House, Owerri, the state capital on Tuesday.\n“We have had previous governors like Achike Udenwa, Ikedi Ohakim and Emeka Ihedioha but the difference between the former governor Rochas Okorocha and others is that he is out of office but still want to remain the governor of Imo State,” Uzodinma said.\nMbadiwe University for Imo peopleAccording to him, “As you may well know, the university was built and furnished with tax payers money of not lessan N40bn.\nYet, an individual, abusing his office as governor brazenly wanted to appropriate it to himself as a privately owned establishment."
  },
  {
    "headline": "Amaechi Seeks Public Appraisal Of Activities In Transportation Sector",
    "summarized_story": "The minister of transportation, Rotimi Amaechi, has called for public appraisal of the activities of the transportation sector under his watch.\nThe minister, who stated this in a statement he personally signed on Tuesday, said he understood the need for appraisal and so desired to know from the citizenry how the Ministry of Transportation ha fared.\nWe desire to know where you feel we have succeeded or are succeeding, where we should improve, and or where you feel we are failing or have failed,” Amaechi said.\nThe minister also stated that all feedback should be sent to his personal email addresss: chibuikeamaechi128@gmail.com.\n“However, we understand the need for appraisal and so desire to know from the citizenry how we have faired, being that we are accountable to you."
  },
  {
    "headline": "INEC Releases Timetable For Ekiti Gov’ship Election",
    "summarized_story": "The Independent National Electoral Commission (INEC), on Tuesday, released the timetable and schedule of activities for the conduct of the June 18, 2022 Ekiti State governorship election.\nThe timetable from the INEC headquarters in Abuja indicated that notice of election has already been pasted at the INEC State Office in Ado- Ekiti on January 3, 2022, showing that party primaries will start from January 4 and end 29.\nThe “Notice of Election” signed by the INEC chairman, Prof Mahmood Yakubu, noted that the last day of withdrawal and replacement of candidates is February 25, 2022 while campaigns will begin on March 20 and will be rounded off on the June 16, 2022.\nThe 14-item timetable will be concluded with the conduct of the election on the June 18, 2022.\nADVERTISEMENTINEC, therefore, advised all the 18 political parties participating in the exercise to follow the schedule judiciously."
  },
  {
    "headline": "INEC Releases Timetable For Ekiti Gov’ship Election",
    "summarized_story": "The Independent National Electoral Commission (INEC), on Tuesday, released the timetable and schedule of activities for the conduct of the June 18, 2022 Ekiti State governorship election.\nThe timetable from the INEC headquarters in Abuja indicated that notice of election has already been pasted at the INEC State Office in Ado- Ekiti on January 3, 2022, showing that party primaries will start from January 4 and end 29.\nThe “Notice of Election” signed by the INEC chairman, Prof Mahmood Yakubu, noted that the last day of withdrawal and replacement of candidates is February 25, 2022 while campaigns will begin on March 20 and will be rounded off on the June 16, 2022.\nThe 14-item timetable will be concluded with the conduct of the election on the June 18, 2022.\nADVERTISEMENTINEC, therefore, advised all the 18 political parties participating in the exercise to follow the schedule judiciously."
  },
  {
    "headline": "AFCON 2021: Gbajabiamila, Omo-Agege, Sanwo-Olu, Others In Federal Govt’s Delegation",
    "summarized_story": "The Federal Government has named a high-powered delegation to lead the Nigerian contingent to the forthcoming 2021 edition of Africa Cup of Nations (AFCON) tournament starting on Sunday, January 9, 2022 in Cameroon.\nThe delegation will be led to the event by the Lagos State governor, Babajide Sanwoolu.\nFemi Gbajabiamila; Deputy Senate President, Senator Ovie Omo-Agege; the chairmen of the Senate and House Committees on Sports, Senator Obinna Ogba and Hon.\nThe delegation is expected to leave for Cameroon on Monday, January 10, 2022 ahead of Nigeria’s first game on Tuesday January 11.\nThe Super Eagles of Nigeria are in Group D alongside Egypt, Sudan and Guinea Bissau."
  },
  {
    "headline": "Tears as family confirms singer Slim Joe’s death at 30",
    "summarized_story": "lNigerian musician, Joshua Olonitola, A.K.A Slim Joe, died on Sunday after complications with a kidney-related ailment, at age 30.\nThe ‘O ti Yan Yan’ crooner was reported to have been seeking N15million for urgent medical intervention before he passed on.\nIn a sad turn of events, the singer has been reported dead on Sunday.\nJegede wrote, “I lost a cousin, Joshua Olonitola aka, Slim Joe of Oti yanyan fame.\n“Aburo, it is painful to lose a good brother like you to death at your prime of fame and age."
  },
  {
    "headline": "Tears as family confirms singer Slim Joe’s death at 30",
    "summarized_story": "lNigerian musician, Joshua Olonitola, A.K.A Slim Joe, died on Sunday after complications with a kidney-related ailment, at age 30.\nThe ‘O ti Yan Yan’ crooner was reported to have been seeking N15million for urgent medical intervention before he passed on.\nIn a sad turn of events, the singer has been reported dead on Sunday.\nJegede wrote, “I lost a cousin, Joshua Olonitola aka, Slim Joe of Oti yanyan fame.\n“Aburo, it is painful to lose a good brother like you to death at your prime of fame and age."
  },
  {
    "headline": "Ritual killing: Police arrest three Bayelsa teenagers",
    "summarized_story": "The Bayelsa State Police Command has arrested three teenage suspects for alleged attempted ritual killing.\nIt identified the suspects as Emomotimi Magbisa, Perebi Aweke and Eke Prince, who are all 15 years of age.\nAccording to the command, they “allegedly accosted one Endeley Comfort ‘f’ 13 years, hypnotised her to follow them to the apartment of Emomotimi Magbisa in Sagbama community, cut her finger and sprinkle the blood on a mirror for ritual purposes.\n“The suspects were subsequently arrested and some substance suspected to be charms were recovered from them.\nThe suspects have been transferred to the Anti-kidnapping unit for discreet investigation.”The Commissioner of Police, Bayelsa State Command, Ben Okolo, commended the efforts of the community youths for vigilance in the area."
  },
  {
    "headline": "Ritual killing: Police arrest three Bayelsa teenagers",
    "summarized_story": "The Bayelsa State Police Command has arrested three teenage suspects for alleged attempted ritual killing.\nIt identified the suspects as Emomotimi Magbisa, Perebi Aweke and Eke Prince, who are all 15 years of age.\nAccording to the command, they “allegedly accosted one Endeley Comfort ‘f’ 13 years, hypnotised her to follow them to the apartment of Emomotimi Magbisa in Sagbama community, cut her finger and sprinkle the blood on a mirror for ritual purposes.\n“The suspects were subsequently arrested and some substance suspected to be charms were recovered from them.\nThe suspects have been transferred to the Anti-kidnapping unit for discreet investigation.”The Commissioner of Police, Bayelsa State Command, Ben Okolo, commended the efforts of the community youths for vigilance in the area."
  },
  {
    "headline": "Breaking: Buhari appoints Doyin Salami chief economic adviser",
    "summarized_story": "President Muhammadu Buhari has appointed Dr Doyin Salami, his Chief Economic Adviser.\nA 1989 doctorate degree graduate in Economics of Queen Mary College, University of London, Doyin Salami, is Managing Director and Head Markets Practice at KAINOS Edge Consulting Limited.\nThe Chief Economic Adviser to the President is expected to address all issues on the domestic economy and present views on them to the President.\nAccording to a statement by media adviser, Femi Adesina, Salami will develop and recommend to the President national economic policies to foster macro-economic stability, promote growth, create jobs, and eradicate poverty, among others.\nAt present, Buhari has a special economic adviser, Adeyemi Dipeolu who works in the Vice President’s office."
  },
  {
    "headline": "Toyota dethrones GM in U.S.",
    "summarized_story": "Agency ReportsJapanese automaker Toyota Motor Corp outsold General Motors Co in the United States in 2021, marking the first time the Detroit automaker has not led U.S. auto sales for a full year since 1931.\nToyota sold 2.332 million vehicles in the United States in 2021, compared with 2.218 million for General Motors, the automakers said on Tuesday.\nGM’s U.S. sales were down 13% for 2021 – and down 43% in the fourth quarter – while Toyota was up 10% for the year.\nGM has been the largest seller of vehicles in the United States since 1931, when it surpassed Ford, according to data from industry publication Automotive News.\nToyota had been credited by analysts for weathering the chip shortage better than other automakers."
  },
  {
    "headline": "BREAKING: Four Killed, Prison Official Injured In Foiled Osun Jailbreak",
    "summarized_story": "During an attempted jailbreak by some of the inmates at Kosere Correctional Centre in Ile Ife, Osun State, four detainees reportedly died on Tuesday.\nSome detainees plotted to escape during morning sanitation, according to a high security source who spoke with our correspondent.\nThe incident happened during morning sanitation on Tuesday.\nHowever, when approached, Sola Adeotan, a spokeswoman for the Osun Command of Correctional Service, stated there was no information about the event.\nYemisi Opalola, the Osun command’s Police Public Relations Officer, acknowledged the event but requested additional time to gather facts."
  },
  {
    "headline": "Kaduna Government Extends Ban On Motorcycles In State Indefinitely",
    "summarized_story": "The Kaduna State Government has extended the prohibition on motorbikes being used for business or personal reasons in the state indefinitely.\nSamuel Aruwan, the state’s Commissioner for Internal Security and Home Affairs, announced the news on Tuesday in a statement.\nThe state government’s first three-month restriction ended in December 2021, according to reports.\nOther containment procedures, according to Aruwan, were also completely in place.\n“Restriction on the movement of tricycles from dusk till dawn (7pm to 6am) in Birnin Gwari, Giwa, Igabi, Chikun, Kachia, Kagarko and Kajuru LGAs,” he said."
  },
  {
    "headline": "2022 Inter-Religious Prayer: Osun Workers Usher Oyetola Into Office With funfair After Yuletide",
    "summarized_story": "…as govt doles out cars, other prizes to workers, says they are brains behind its success storyIn Grand display of pomp and circumstance on Tuesday morning, Osun workers welcomed and ushered in the State Governor, Adegboyega Oyetola, into office after the Yuletide.\nThe elated, enthusiastic and jubilant workers were seen with pro-government banners with different inscriptions such as “Osun Workers are saying Thank You”; “We are solidly behind you and your Adminstration”; “Thank You for being there for us”, among others.\nGovernor has donated cars to some workers, the first of its kind in the history of the State since its creation.\nThat is why we workers in our volition came out en masse to receive him warmly back to office after the Yuletide celebrations.\nGovernor Oyetola urged the residents to continue to maintain peace, religious tolerance and harmonious relationship that the State was known for."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Invade Borno Community, Burn Houses, Loot Shops",
    "summarized_story": "Militants from Boko Haram’s Islamic State-backed West Africa Province (ISWAP), formerly known as Jam’at Ahl as-Sunnah lid-Da’wah wa’l-Jihd, stormed a community in Borno State, demolishing buildings and stealing shops.\nTerrorists assaulted Komdi village in the Damboa Local Government Area of the state on Monday night, razing numerous homes, according to SaharaReporters.\nHe went on to say that the army defeated the terrorists in a gunfight and forced them to flee.\nThe Nigerian Army has stated that the insurgency has been mostly defeated on numerous occasions, while downplaying any losses.\nThe terror group has killed approximately 50,000 people and displaced millions of people, mostly in the states of Adamawa, Borno, and Yobe."
  },
  {
    "headline": "[Breaking] Insecurity: Imo state government names Okorocha, son-in-law as sponsors",
    "summarized_story": "Ahead of scheduled stakeholders’ meeting on Tuesday inside government house Owerri, the Imo state government has identified Senator Rochas Okorocha and his son-in-law Chief Uche Nwosu as sponsors of kidnapping and banditry in the state.\nA statement by the Chief Press Secretary/Media Adviser to the Governor, Oguwike Nwachuku, alleged that Okorocha and Nwosu have been mentioned by suspects currently in detention.\nPart of the statement reads, “For the avoidance of doubt, Okorocha and Nwosu have been specifically mentioned by suspects who are in the custody of security agents, as being sponsors of kidnapping and banditry in Imo State, using their relationship with former ex-militants to perpetrate the crimes.\n“Rather than clear their names, they appear bent on using both overt and covert means to blackmail the Police High Command, which legitimately arrested Uche Nwosu.\nThey are also actively seeking to dent the image of the fine security officers attached to the Governor of Imo state.”There have been heightened criminal activities in the state in recent times with killings, kidnappings and burning of highly-placed individuals’ houses as major insecurity issues."
  },
  {
    "headline": "APC Convention: Why February date is sacrosanct – PGF boss",
    "summarized_story": "The APC chieftain described as ‘illogical’ recommendation through a letter written by Senator Orji Uzor Kalu to the APC CECPC Chairman, Mai Mala Buni, dated December 13, 2021, calling for the postponement of the APC convention.\nIn an open letter to all the APC leaders Monday in Abuja, Lukman warned of the repeat of 2019 Zamfara experience if the needful was not done.\nThe APC chieftain said: “It is very difficult to excuse the CECPC from the campaign to postpone the February Convention.\nIf the CECPC is not interested in the postponement of the Convention from the agreed February 2022 date, why is it difficult to make formal announcement about the date and venue of the Convention?\nBut how united are party leaders behind the candidate will be a more determining factor."
  },
  {
    "headline": "Revealed! What ex-presidential candidate, Tofa, told youth two months before his demise",
    "summarized_story": "He said: “The late Tofa was noted for his untiring commitment to public enlightenment and was unafraid to speak the truth all the time that he lived.\n“Sen Anyim regrets that Alhaji Tofa died when his experience and elderly counsel would be most needed as the country battles with multiple challenges.\nAnyim deeply condoles with the late Alhaji Tofa’s family, the good people of Kano State and Alhaji Tofa’s many friends and associates all over Nigeria.\nIn another condolence message, Jigawa state Governor Muhammad Badaru lauded the late politician as a statesman, industrialist, politician and community leader.\n“The late Tofa was a passionate believer of the organic links between generations who was always available for young people."
  },
  {
    "headline": "EXCLUSIVE: State Police Is Not An Option, Says President Buhari",
    "summarized_story": "President Muhammadu Buhari believes state police is not an option for the nation.\nThe President made the remark in an exclusive interview with Channels Television which is scheduled to air on Wednesday at 7 pm (WAT).\nCalls for state policing have been made by several Governors as a way to solve insecurity across the country.\nREAD ALSO: Police CSP Defies Sanwo-Olu’s Order To Vacate Magodo Estate, Claims AGF, IGP Sent HimNigeria’s current policing system is controlled by the Federal Government.\nThe President alluded to the propensity for Governors to abuse their powers as his argument against state police."
  },
  {
    "headline": "Magodo Dispute: Police CSP Defies Sanwo-Olu’s Order To Vacate Estate, Claims AGF, IGP Sent Him",
    "summarized_story": "﻿The lingering land dispute at the Magodo Phase II Estate in Lagos took a different dimension on Tuesday as a Chief Superintendent of Police (CSP) publicly defied the order of the state governor, Babajide Sanwo-Olu, to vacate the premises.\nHe engaged the yet-to-be-identified CSP who led the police team on the operation from Abuja and asked them to vacate the estate.\nI cannot precisely tell you how many we are,” the CSP replied the governor.\n“This is not an expectation that I would expect for them because they don’t have any business here at all.\nThe case is between the state government, and I am the governor standing in front of you, not with my residents.”"
  },
  {
    "headline": "Uzodinma Makes U-Turn, Fails To Name Sponsors Of Insecurity In Imo",
    "summarized_story": "Imo State Governor, Hope Uzodinma has made a U-turn and failed to name the sponsors of attacks in the state contrary to a pledge he made.\nSpeaking during the Imo stakeholders meeting at the Government House in Owerri on Tuesday, Uzodinma acknowledged that he promised a fortnight ago to name the sponsors of attacks in Imo.\nBut the governor craved the indulgence of the people that he would no longer name names but would leave security agencies ‘to do their work’ and prosecute those found culpable.\nThe difference between the former governor and Okorocha, Uzodinma explained, is that the senator is out of office but still wants to be in the Government House.\n“I have many former governors in Imo State."
  },
  {
    "headline": "How 42 Children, Pregnant Women Regained Freedom In Zamfara – Police",
    "summarized_story": "﻿Police authorities in Zamfara have confirmed the release of 97 persons abducted by bandits in Shinkafi and Tsafe Local Government Areas (LGAs) of the state.\nGiving a breakdown of the number of the returnees, he explained that 68 people were released in Shinkafi while 29 others regained freedom in Tsafe.\n“The victims were in captivity for over three months and they include 33 male adults, seven male children, three female children, and 25 women including pregnant/nursing mothers respectively.\nThe victims, said to have been abducted by a bandits’ kingpin Ado Aleru, include 25 females including pregnant and nursing mothers, and four male children.\nElkanah said all the rescued victims were treated by the joint medical teams of the state government and the police."
  },
  {
    "headline": "California Twins Born In Different Years",
    "summarized_story": "A set of twins born 15 minutes apart in California have very different birthdays — one in 2021 and the other in 2022.\nA quarter of an hour later, on New Year’s Day, his sister Aylin Yolanda Trujillo was born.\nREAD ALSO: EU Bans Cancer Threat Chemicals In Tattoo InkThe Natividad Medical Center, where the babies were delivered, said in a statement last week that some estimates suggest there is a one-in-two-million chance of twins being born in different years.\n“It’s crazy to me that they are twins and have different birthdays,” the babies’ mother, Fatima Madrigal, was quoted as saying in the statement.\nThe Centers for Disease Control and Prevention says around 120,000 twins are born every year in the United States, representing roughly three percent of births."
  },
  {
    "headline": "APC caretaker committee must ensure National Convention goes beyond just electing NWC",
    "summarized_story": "A chieftain of the All Progressives Congress and Director General Of the Progressives Governors Forum, Salihu Lukman, has appealed to the party’s Caretaker Extraordinary Convention Planning Committee, to ensure that the February 2022 Convention is not just about electing National Working Committee members.\nHe urged party leaders on recommendations from the Convention, which he says should guide the review process of the party’s manifesto and bring out some of the campaign agenda of the APC for the 2023 campaigns.\nSalihu Lukman says It is quite worrisome that speculations about the Convention are allowed to create strong doubts as to when the Convention will hold.\nThe major gap, however, is that no date or details of Committees, their membership and terms of reference, were given,a worrisome situation.\nGiven the roll out of political activities for the year, Mr Lukman advised the Caretaker Committee to set up relevant committee for the party’s national assembly, to rest speculations is some quarters that the convention will not hold in February."
  },
  {
    "headline": "Tinubu hails Prof. Bolaji Akinyemi at 80",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has poured encomiums on elder-statesman and former Foreign Affairs Minister, Prof. Bolaji Akinyemi, as he turns 80 on January 3, 2022.\nIn a statement by his Media Office signed by Mr. Tunde Rahman, Asiwaju, the former Lagos governor, said:“Warm congratulations to former Minister of Foreign Affairs, Prof. Bolaji Akinyemi, on attaining 80.\nErudite scholar, author, diplomat, pro-democracy activist and committed progressive, Prof. Akinyemi has done a lot for this country.\nEasily one of the best the country has produced in that office till date, his two years in office were significant as they represented some of the country’s best moments in international relations.\n“Rich in experience, wisdom and knowledge, Prof. Akinyemi is today an important elder-statesman."
  },
  {
    "headline": "Shekarau, Nanono mourn MKO Abiola's opponent Bashir Tofa",
    "summarized_story": "In this video, Senator Ibrahim Shekarau and former Minister of Agriculture, Nanono speak on the death of former Presidential candidate, Alhaji Bashir Tofa.\nMr Tofa, a former presidential candidate of the NRC in the 1993 Presidential Election, died Monday morning at the age of 76."
  },
  {
    "headline": "Buhari, Tinubu, others mourn late Olubadan, Saliu Adetunji",
    "summarized_story": "Tributes are pouring in for the late Olubadan of Ibadan, Oba Saliu Adetunji as President Muhammadu Buhari, Bola Ahmed Tinubu & others have sent their condolence messages.\nOba Adetunji died on Sunday at the University Teaching Hospital, Ibadan.\nHe was aged 93."
  },
  {
    "headline": "Sanwo Olu Speaks to Magodo Residents",
    "summarized_story": "Reactions have continued to trail the arrest of residents and security guards of Magodo Brooks estate by the Lagos state commissioner of police Hakeem OdumosuIn a post via Twitter, human rights lawyer Inibehe Effiong said that the commissioner of police owes everyone arrested an apology alleging that since the CP’s visit to the estate was private, he was confined by law, to subject himself to the protocol of the estate.\nLagos state governor, Babajide Sanwo-Olu visited the area Tuesday to calm down tensions."
  },
  {
    "headline": "Kabiru Adamu: Lack of Accountability a Key Issue in Security Sector",
    "summarized_story": "KABIRU ADAMU discussed the proliferation of firearms in the country and the role of security agencies in fostering insecurity."
  },
  {
    "headline": "Controversy Over Selection of New Olubadan",
    "summarized_story": "BOLAJI AYORINDE spoke about the death of the 44th Olubadan of Ibadanland, the late Oba Saliu Adetunji, Aje Ogunguniso I, and the controversy already brewing over the selection of his successor."
  },
  {
    "headline": "Father Mbaka Denies Support for Buhari – Trending with Ojy Okpe",
    "summarized_story": "Reactions have continued to trail the arrest of residents and security guards of Magodo Brooks Estate by the Lagos State Commissioner of Police Hakeem Odumosu.\nReverend Father Ejike Mbaka, spiritual director of the Adoration Ministry in Enugu State, has been trending on social media over comments he made during his new year church service.\nA video of an unidentified pastor bathing naked female members of his church during the crossover service on New Year’s Eve has gone viral!\nIn the video , the Pastor could be heard urging his female church members to come forward for the holy bath.\nAccording to reports, the Pastor engaged in the ritual, to cleanse his members so they will become holy and pure."
  },
  {
    "headline": "Security Forces Block Roads in Khartoum, Omdurman as Sudan Braces for Fresh Anti-Military Protests",
    "summarized_story": "Sudanese security forces have beefed up security in and around Khartoum as pro-democracy protesters called for mass rallies in a bid to keep up pressure on the ruling military following the resignation of civilian Prime Minister Abdalla Hamdok.\nHamdok, who was deposed and put under house arrest in an October 25 coup, had returned to government on November 21 under a deal signed with military leader General Abdel Fattah al-Burhan.\nFollowing the prime minister’s resignation, protesters told Al Jazeera they will not give up their fight for full civilian rule, “with or without Hamdok”.\nProtesters in Sudan say they won’t give up until the country is under civilian rule.\nThe military, he said, would “protect the democratic transition” until Sudan is able to hold free and fair elections."
  }
]