[
  {
    "headline": "Swedish PM resigns after no-confidence vote",
    "summarized_story": "Sweden’s Prime Minister Stefan Lofven on Monday resigned, one week after he lost a vote of no confidence in parliament, leaving it up the speaker of parliament to begin the search for a replacement.\nNoting the difficult situation the Covid-19 pandemic posed, coupled with the fact that the next general election is a year away, Lofven told a press conference a snap election was “not what is best for Sweden.” Following the no confidence vote last week, Lofven could have either called a snap election or resigned."
  },
  {
    "headline": "Gunmen abduct lady in Osun Fulani settlement",
    "summarized_story": "Some yet-to-be-identified men bearing arms have reportedly abducted a lady in his father house located in Gaa Fulani in Ora, Osun State.\nAccording to a resident of the town, simply identified as Oyekanmi, the incident occurred on Sunday evening.\nIt was also learnt that the victim was abducted in the presence of his father, a Fulani settler called Alhaji Bayo and whisked off to an unknown destination.\nRead Also“The victim was abducted in her father’s house around 7pm on Sunday.\nShe had not also responded to a text message sent to her on the matter as of the time of filing this report."
  },
  {
    "headline": "Herbert Wigwe is second time African Banker of the Year",
    "summarized_story": "The Group Managing Director/CEO of Access Bank PLC Herbert Wigwe has been recognised as the African Banker of the Year at the 2021 edition of the African Banker Awards.\nOver the last 12 months, Access Bank has established a presence in South Africa following its acquisition of Grobank.\nThe African Banker Awards have become the most respected and recognised industry event celebrating African banking achievements.\nCommenting on the award, Group Publisher of African Banker and Chair of the Awards Committee, Omar Ben Yedder said, “Herbert is one of the most respected bankers on the continent, without a shadow of a doubt.\nWhat he and his team have done at Access Bank is nothing short of remarkable.”The Awards ceremony held virtually during the Annual meetings of the African Development Bank."
  },
  {
    "headline": "Scores escape death as 3-storey building undergoing construction collapses in Lagos",
    "summarized_story": "As owner risks revocation of land titleBy Olasunkanmi AkoniThe collapsed buildingScores of workers, on Sunday, narrowly escaped death, when a 3-storey building undergoing construction suddenly collapsed at Olufiditi Street, Alaba Oro, area of Lagos State.\nAccording to a source, the incident happened following a heavy wind that swept across the area aftermath of Saturday heavy rainfall.\nOther emergency responders at the scene were: Nigeria Police, Lagos State Safety Commission, Lagos State Fire and Rescue Services, Lagos State Building Control Agency, LABSCA, among others.\nAccording to Oke-Osanyintolu, “The Agency received a distress call in the early hours Sunday afternoon, June 27, 202, concerning a collapsed building at the above address.\n“This led to the immediate activation of the agency’s response plan and necessary deployment of resources to the incident scene."
  },
  {
    "headline": "Tension in Osun community as gunmen abduct Fulani settler’s daughter",
    "summarized_story": "By Shina Abubakar, OsogboUnknown gunmen on Sunday evening abducted the daughter of Alhaji Bayo Fulani at his residence located around Ga- Fulani, Ora-Igbomina area of Ifedayo in Osun state.\nThe gunmen in their numbers, it was gathered attacked the victim’s father attempting to kill him, but bullets were not penetrating his body.\nALSO READ: LASU: Sanwo-Olu appoints former AG, 12 others as members governing councilFindings revealed that the assailants armed with guns having discovered that the father escaped their assault resorted to deal with the girl before they eventually took her away.\nEfforts to get the Police spokesperson to react proved abortive as she did not pick her calls or reply to the text sent to her phone.\nVanguard News Nigeria"
  },
  {
    "headline": "BREAKING: Tension in Osun community as gunmen abduct Fulani settler’s daughter",
    "summarized_story": "Shina Abubakar, OsogboUnknown gunmen on Sunday evening abducted daughter of Alhaji Bayo Fulani at his residence located around Ga- Fulani, Ora-Igbomina area of Ifedayo in Osun state.\nThe gunmen in their numbers, it was gathered attacked the victim’s father attempting to kill him, but bullets were not penetrating his body.\nFindings revealed that the assailants armed with guns having discovered that the father escaped their assault resorted to deal with the girl before they eventually took her away.\nEfforts to get Police spokesperson to react proved abortive as she did not pick her calls or reply the text sent to her phone.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "[VIDEO] Anambra 2021: Intrigues, drama as APC, PDP’s candidates emerge -",
    "summarized_story": "Two of the three Uba brothers – Senators Andy Uba and Ugochukwu Uba, emerged as candidates.\nWith the emergence of the candidates, the shape of the November 6 governorship election is taking form.\nConduct of primaries is within the party’s constitution.”How Andy Ubah won APC ticketThe former Senator who represented Anambra South Senatorial District, Andy Ubah, was declared winner of the APC governorship primary contested by 13 other aspirants.\nThe election committee chairman, however, debunked insinuations from some of the contestants that the exercise was deliberately delayed, pointing out that his committee only needed to be thorough and transparent.\n“This therefore painted any reported outcome of the primary election as dubious because in actual fact there was no primary election."
  },
  {
    "headline": "Police parade three suspected kidnappers, others in Imo",
    "summarized_story": "The Imo State Police Command has arrested and paraded three suspected kidnappers at the command headquarters, Owerri, the state capital.\nAccording to the state police report, the anti-kidnapping unit of the state command apprehended the 30-year-old.\nPolice parade 109 suspected criminals in Cross RiverThe suspect confessed to belong to a kidnapping syndicate that has been terrorizing the state and its environs.\nThey were arrested at Obilibi Mbieri Mbaitoli LGA of the state at D and D Bosphorus Hotel and Suites, Enugu State.\nImo: Police arrest four more suspects involved in attack on headquartersThe Imo State Commissioner of Police, Abutu Yaro, while addressing the press, commended the officers of the command for their efforts in combating crimes in the state."
  },
  {
    "headline": "Social media needs to be regulated",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, has called for the regulation of social media in Nigeria.\nGbajabiamila said regulating social media will protect all Nigerians from its negative aspect.\nThe Speaker, who spoke on Channels Television, said the National Assembly has been contemplating regulating social media for a long time.\nHe lamented that the National Assembly had faced harsh criticism over attempts to regulate social media.\nThat is my position about social media regulation."
  },
  {
    "headline": "Obasanjo raises alarm over increasing population",
    "summarized_story": "193 universities not enough for Nigeria’s population – Minister, AdamuHe said: “We have moved from 120 million to over 200 million.\nWe have added the population of France to our population and if we continue the way we are going, by the year 2050, we will be the third largest country in the world.\n“If we still continue, by the year 3000, we would be the largest country in the world.\n“What are we going to do to handle that, how are we going to handle that population?\nAccording to him, those who antagonise family planning should employ other means to ensure that the population does not escalate beyond its current state."
  },
  {
    "headline": "Poverty: Senator Nnamani warns of looming ‘demographic bomb’",
    "summarized_story": "Former Governor of Enugu State, Senator Chimaroke Nnamani has cautioned the government at various levels to quickly find a way of positively responding to youth bulge in the country’s population.\nWhile linking youth restiveness to demographics, he said an inappropriate response would spell doom for the nation.\nThe Senator spoke on the State of the nation, identifying national transformation, poverty, critical infrastructure, youth bulge, gap crisis, among others as major areas of concern.\nBut the question is- how does society react to youth bulge?\nSociety can react to youth bulge by business as usual or they can react to youth bulge by business unusual."
  },
  {
    "headline": "2023 election: Prophet Hezekiah gives insight on right candidate",
    "summarized_story": "The General Evangelist, Christ Apostolic Church (CAC) Worldwide, Prophet Hezekiah Oladeji has advised that Nigerians must look inward before voting for any candidate of their choice in the 2023 Presidential elections.\nNAN reports that Oladeji made this known during an interview with newsmen in Ekiti State on Sunday.\nAccording to him, “Nigerians should look forward to a neutral and well qualified person during the elections.”He further condemned the spate of kidnapping and incessant killing of innocent persons in some parts of the country.\n“There is a need for fervent prayers as it is the only way of addressing these challenges, including guaranteeing more peace, progress and socio-economic stability in the country.\n“The activities of the bandits could have been curtailed, if necessary actions had been taken by the Government since the group started unleashing mayhem in the country."
  },
  {
    "headline": "BREAKING: Gunmen abduct one in Osun community",
    "summarized_story": "By Toba Adedeji, OsogboGunmen on Sunday night attacked a Fulani settlement at Papa area along Ekan/Omu-Aran road in Ora-Igbomina, Osun State and kidnapped one person, The Nation has learnt.\nIt was gathered the gunmen, numbering three, arrived at the settlement in Ora-Igbomina in Ifedayo Local Government Area around 8 PM and shoot severally to scare residents.\nADVERTISEMENTIt was learnt the residence of one Alhaji Fulani was attacked and her daughter abducted in the process.\nA resident of the community told The Nation police have arrived at the scene of abduction to rescue the victim.\nOsun Police spokesperson, Mrs. Yemisi Opalola, did not respond to calls and SMS as at the time of filing this report."
  },
  {
    "headline": "Nobody can kill me or say I should not come to Lagos – Sunday Igboho",
    "summarized_story": "By Alao AbiodunYoruba Nation Agitator Chief Sunday Adeyemo aka Sunday Igboho has declared nobody can attack or kill him over the Yoruba Nation rally billed for Lagos on Saturday, July 3, 2021.\nIgboho, while receiving a vehicle presented to him by some donors to support the Yoruba Nation agitation, stated that nobody can tell him not to come to Lagos adding that the Yoruba Nation rally will go on as planned.\nHe said: “Some people are going about saying we shouldn’t come to Lagos that we’ll be killed, it is a lie and it is all false.\nNobody has said he will kill Igboho in Lagos, and nobody has said Igboho should not come to LagosADVERTISEMENT“I’m a true son of the soil, Lagos is a Yoruba land and does not belong to the Hausas or any other tribe, so let us focus on the current struggle and don’t let us dwell on rumors.\nLagos is a Yoruba land and majority of those in Lagos are Yorubas and the way Yorubas are suffering, many are not satisfied."
  },
  {
    "headline": "We want Yoruba liberation, not restructuring, says Sunday Igboho",
    "summarized_story": "By Alao AbiodunYoruba Nation Agitator Chief Sunday Adeyemo aka Sunday Igboho has told President Muhammadu Buhari he is not in support of restructuring but liberation of Yorubas.\nADVERTISEMENTHe said: “Our demand is simple, to tell Buhari that we do not want restructuring but Yoruba Nation.\n“On Yoruba Nation, no going back.\nNoah’s ark can be likened to the current Yoruba agitation.\n“Don’t think we are joking, what we are pursuing now is Yoruba Nation."
  },
  {
    "headline": "BREAKING: One killed, many injured as masquerades invade Osun mosque",
    "summarized_story": "By Toba Adedeji, OsogboOne person has been reportedly killed when armed masquerades invaded a mosque at Oluode Aranyin area of Osogbo capital of Osun.\nThe Nation gathered many worshippers were injured during the attack on Sunday evening.\nThe masquerades then shot indiscriminately, killing one worshipper in the process.\nSpokesperson of Osun Police Command, Yemisi Opalola, did not respond to calls and SMS on the incident as at press time.\nChairman of Osun Muslim Community, Alhaji Mustapha Olawuyi, told The Nation he was attending a burial rite and promised to get back."
  },
  {
    "headline": "APC leaders clear air on flagbearer",
    "summarized_story": "Leaders of All Progressives Congress (APC) in Somolu had cleared the air on the chairmanship candidate for the forthcoming council election.\nThis was as thousands of APC members in Somolu defied the early morning downpour yesterday to applaud the emergence of Abdul Hamed Salawu as the party’s candidate.\nADVERTISEMENTMatiluko hailed Senator Anthony Adefuye’s consistency in ensuring stability among party members in Somolu.\n“APC in Somolu is a well-coordinated chapter of the party with strong internal mechanism to resolve issues,” he said.\n“All the leaders of APC in Somolu agreed long before now that Salawu should complete his second term,” Matiluko said."
  },
  {
    "headline": "Anambra Guber: Ngige calls for cancellation of APC primary",
    "summarized_story": "From Obinna Odogwu and Mokwugwo SolomonFormer Anambra South Senator, Andy Uba, has been declared winner of the governorship primary election of the All Progressives Congress (APC) in Anambra State.\nUbah emerged winner in the primary election contested by 13 other aspirants.\nHe added that the minor delay was not the fault of the committee or that of the party members, but that of logistics.\nMeanwhile, confusion is trailing the outcome as some of the party members and stakeholders have rejected the process leading to the congress.\nReacting to the declaration of Uba, State Publicity Secretary of the party, Okelo Madukaife, rejected the result, describing it as fake."
  },
  {
    "headline": "Buhari replies Niger Delta Avengers, says threat unnecessary",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has replied the Niger Delta Avengers, a militant group in the oil-producing Delta region threatening to resume attacks amid rising insecurity and disagreements over the share of oil wealth communities should get.\nThe president said it was curious that the threat was coming less than 48 hours after he met with the leadership of the Niger Delta and Ijaw National Congress (INC), at the Presidential Villa, where he responded to the germane issues raised, especially call for restructuring of the Federation, and the inauguration of a Board for the Niger Delta Development Commission (NDDC).\nAccording to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, he said threat was unnecessary.\n“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\n“God Bless the Federal Republic of Nigeria.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Constitution review: Speakers root for state police",
    "summarized_story": "From Paul Osuyi, AsabaSpeakers of the 36 states Houses of Assembly have made a case for the establishment of state police to tackle insecurity in the country.\nThey want the ongoing review of the 1999 Constitution to accommodate the concept of state police and community policing.\nThis was contained in a communiqué issued at the end of the second quarter general meeting of the Conference of Speakers of State Legislatures of Nigeria held in Asaba, Delta State.\nSigned by the chairman of the conference and Speaker of Bauchi State House of Assembly, Abubakar Suleiman, the communiqué commended the Federal Government’s in fighting insecurity.\nHe stated that there was need for dialogue on how to ensure fairness and equity in the governance of the country."
  },
  {
    "headline": "40 oil firms in possession of dormant refinery licenses",
    "summarized_story": "By Adewale SanyaoluEarly hopes of Nigeria’s refining capacity growing by 1,862,000 million barrels per day (bpd) has further been dashed as 40 firms are currently in possession of dormant refinery license, a Department of Petroleum Resources (DPR) refinery status report has revealed.\nThe DPR refinery license status report indicated that as at May 2021, a total of 68 refineries license and approval had been granted, out of which 40 are inactive.\nOthers are; American Exploration Company Nigeria Limited, Epic Refinery and Petrochemical Industries Limited, Masters Energy Oil and Gas Limited, Grifon Energy Limited, Sifax Oil and Gas Company Limited, Capital Oil and Gas Industries Limited, Green Energy International Limited, Fresh Energy Limited, Chyzob Oil and Gas Limited, Ibafon Oil and Gas FZE Refinery Limited, Owena Oil and Gas Limited, Tonwei Refinery, NSP Refineries and Oil Services, Rehoboth Natural Resources Dev.\nThe rest include; Niger Delta Petroleum Resources and Petrochemical Limited, RG Shinjin Petrochemicals Limited, Jil-Amber Consortium PHRC, Dee Jones, Hi-Rev Oil Limited, Starex Petroleum Refinery Limited, Eko Petrochem & Refining Company Limited, Petrolex Oil & Gas Limited, Ikwe-Onna Refinery Limited, Clean Waters Refinery, Southwest Refineries and Petrochemicals Company Limited, Obat Refinery Limited, Antonio Oil Company Limited.\nIn 2019, Kaduna Refining and Petrochemical Company Limited only processed crude in one month (June); Port Harcourt Refining Company Limited in two months (February and March); and Warri Refining and Petrochemical Company Limited in four months (January, February, March and May)."
  },
  {
    "headline": "Obasanjo raises the alarm over population explosion",
    "summarized_story": "From Laide Raheem, AbeokutaFormer president Olusegun Obasanjo has called for proper population management, expressing the fear that the geometric population explosion without a corresponding socio-economic development, may spell doom for the country.\nObasanjo, who spoke at a mentoring session for students of some selected schools across the country, organised by Students for the Advancement of Global Entrepreneurship (STAGE), said Nigeria’s increasing population must be properly managed to engender national development.\nWhile calling for more actions in population management, Obasanjo charged the young students to uphold the virtues of integrity, honesty and good moral standing, to take them to their respective chosen careers in life.\n“Mentorship and motivation of this nature may just be the tonic that will fire the necessary patriotism for national development in these budding leaders of tomorrow,” Obasanjo said.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Why Grazing Routes Are Difficult to Recover",
    "summarized_story": "However, THISDAY’s investigation has revealed that the grazing routes have been taken over, over the years, by modern facilities built for the public good.\nIn Kano State, the state government has acknowledged that the grazing routes have been taken over by public infrastructure, including schools.\nAlthough Niger State has 11 grazing routes, covering about 1,865 kilometres, 1,368 kilometres of these routes are primary routes while the remaining 496 kilometres are secondary routes.\nHe explained: “The committees are working with already list of encroachers on the grazing reserves and discussions are in top gear to reclaim these grazing reserves.\nThe Special Adviser on Media and Public Enlightenment to the Governor, Mr. Zalaini Bappa, said even some former governors who trespassed on the grazing reserves returned the land."
  },
  {
    "headline": "Petrol Subsidy Bites Harder, NNPC Proposes N114.3bn Deduction in June",
    "summarized_story": "These implied that the deduction by the NNPC more than quadrupled from the N25.374 billion in February to N114 billion in June.\nAdded to export crude oil, the revenue generated was $616.037 million.\nAll the transactions were hinged on N382.80 to one dollar exchange rate as advised by the Central Bank of Nigeria (CBN), according to the national oil company.\n“Crude oil export revenue received in May 2021 amounted to $167.72 million, equivalent to N64.2 billion.\nBesides, the corporation said it expended N5 billion on export financing, N8.3 billion on the non-functional refineries and N83.3 billion on the ongoing Nigeria/Morocco pipeline."
  },
  {
    "headline": "Buhari: Drug Trafficking, Abuse Pose More Threat than Insurgency, Banditry",
    "summarized_story": "•Says drug abuse already stretches across three generationsDeji Elumoye in Abuja and Laleye Dipo in MinnaPresident Muhammadu Buhari, yesterday, identified drug trafficking and abuse as more threatening to the stability of the nation than banditry and insurgency that are prevalent in some parts of Nigeria.\nThe enormity of the danger of drug abuse calls for an urgent need to nip the problem in the bud.\n“Today, it is a glaring fact that Nigerian youths are involved in drug abuse.\nHe said: “And in this campaign, we are tackling the scourge of drug abuse and trafficking on all fronts.\nIn addition to the arrest and prosecution of drug offenders, we have worked out intensive drug abuse awareness and sensitisation programmes targeting different groups, with an emphasis on youths."
  },
  {
    "headline": "Army Chief Orders Destruction of All Boko Haram, ISWAP Enclaves in North-east",
    "summarized_story": "The army chief also declared that traditional institutions were critical to bringing the insurgency war to an end.\nA statement issued by the Nigerian Army Headquarters said the army chief ordered troops of Sector 2 Joint Task Force North-east Operation Hadin Kai to destroy all Boko Haram and Islamic State West Africa Province (ISWAP) enclaves in their various locations.\nAmong the dignitaries, who accompanied the COAS were the Chief of Operations (Army) Major General Ibrahim Yusuf and the Theatre Commander Operation Hadin Kai, Major General Christopher Musa.\nMeanwhile, the army chief said traditional institutions were critical to the success of ongoing operation to end Boko Haram insurgency and terrorism in the North-east.\nMeanwhile, the Nigerian Air Force yesterday denied that the Nigerian Air Force Base, Kaduna, was attacked by Boko Haram."
  },
  {
    "headline": "NEITI: $584m Oil, Gas Deals Sealed in Asset Ownership Changes in 2019",
    "summarized_story": "Besides, Nigerian Petroleum Development Company (NPDC) acquired OML 11, formerly operated by Shell Petroleum Development Company (SPDC), in a contract totalling $456.03 million.\nDuring the year under review, seismic data acquisition was up by 348 per cent, field development plans 65 per cent, well activities 45 per cent, while gas development plan was down by 75 per cent, with six approved for 2019, as opposed to 24 in 2018.\nSeplat was next with 7 million barrels, followed by SNEPCo, with 3.8 million barrels.\nIn addition, NPDC and Neconde suffered losses and subsequent deferment of 3.7 million barrels, Newcross’ was 3.2 million barrels, Aiteo deferred 2.84 million barrels, Energia’s share of deferment was 1.7 million barrels, while APDNL’s loss was 733,000 barrels during the year.\nAll deferred production amounted to 55.2 million barrels while there were 1,387 pipeline breaks, with Mosimi recording the highest with 637 breaks, followed by Port Harcourt, 536, and Warri with 96 breaks."
  },
  {
    "headline": "EXCLUSIVE: New Wife Of Nigeria's Senate President, Lawan, Moves To Multi-million Naira Abuja Mansion",
    "summarized_story": "The President of the Senate, Ahmad Ibrahim Lawan, has moved his new wife, Zainab Algoni Abdulwahid from Maiduguri, Borno state to Abuja.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nSee Also Exclusive EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building DeterioratesThe bride was said to have bought three houses in Maiduguri out of the money.\n“She is now here in Abuja staying in a mansion provided by Senate President.\nA text message sent to Ola Awoniyi, Special Adviser on Media to the Senate President was not replied to."
  },
  {
    "headline": "EXCLUSIVE: New Wife Of Nigeria's Senate President, Lawan, Moves To Multi-million Naira Abuja Mansion",
    "summarized_story": "The President of the Senate, Ahmad Ibrahim Lawan, has moved his new wife, Zainab Algoni Abdulwahid from Maiduguri, Borno state to Abuja.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nSee Also Exclusive EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building DeterioratesThe bride was said to have bought three houses in Maiduguri out of the money.\n“She is now here in Abuja staying in a mansion provided by Senate President.\nA text message sent to Ola Awoniyi, Special Adviser on Media to the Senate President was not replied to."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "Ortom: We're not against Fulani -- there's land for ranching in Benue",
    "summarized_story": "Samuel Ortom, Benue governor, says land is available for herders who intend to go into livestock ranching in the state.\nAdvertisementOrtom said this in Abuja at the 72nd birthday of Iyorwuese Hagher, former Nigerian ambassador to Mexico.\n“His Excellency, Governor Samuel Ortom has explained again and again that we, the Benue people, are not against the Fulani.\nAdvertisement“Those who have a lot of cattle are still using ranching, and any Fulani person who wants to establish a ranching in Benue will have the land.\nEven if our ‘Chairman’ wants to start a ranch, he will get the land today."
  },
  {
    "headline": "Ortom: We're not against Fulani -- there's land for ranching in Benue",
    "summarized_story": "Samuel Ortom, Benue governor, says land is available for herders who intend to go into livestock ranching in the state.\nAdvertisementOrtom said this in Abuja at the 72nd birthday of Iyorwuese Hagher, former Nigerian ambassador to Mexico.\n“His Excellency, Governor Samuel Ortom has explained again and again that we, the Benue people, are not against the Fulani.\nAdvertisement“Those who have a lot of cattle are still using ranching, and any Fulani person who wants to establish a ranching in Benue will have the land.\nEven if our ‘Chairman’ wants to start a ranch, he will get the land today."
  },
  {
    "headline": "Subsidy payment: NNPC plans N114bn deduction from remittance to FAAC in July",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says it will deduct N114.3 billion from its June remittance to the Federation Account and Allocation Committee (FAAC) — due in July.\nAdvertisementIn April, the corporation had written Ahmed Idris, accountant-general of the federation, informing him that the corporation would not make any remittance to the FAAC in May.\nThe NNPC had also deducted N126.2 billion from remittance to FAAC in June as reported by TheCable.\nAdvertisement“In addition, May value shortfall of N114,337,097,352.49 is to be deducted from June federation proceeds in July 2021 FAAC meeting.\nThe difference comes back to as much as N140 billion to N150 billion cost to the country monthly,” he had said."
  },
  {
    "headline": "Subsidy payment: NNPC plans N114bn deduction from remittance to FAAC in July",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says it will deduct N114.3 billion from its June remittance to the Federation Account and Allocation Committee (FAAC) — due in July.\nAdvertisementIn April, the corporation had written Ahmed Idris, accountant-general of the federation, informing him that the corporation would not make any remittance to the FAAC in May.\nThe NNPC had also deducted N126.2 billion from remittance to FAAC in June as reported by TheCable.\nAdvertisement“In addition, May value shortfall of N114,337,097,352.49 is to be deducted from June federation proceeds in July 2021 FAAC meeting.\nThe difference comes back to as much as N140 billion to N150 billion cost to the country monthly,” he had said."
  },
  {
    "headline": "COVID-19 paradox: Nigerian households suffer food prices surge amid dwindling income",
    "summarized_story": "How much of the increase in food prices can be attributed to COVID-19?\nInsecurity and border closure played significant parts in the hike in food pricesDataphyte’s food price survey asked respondents in the 13 states what other factors they thought really contributed to the price increase.\nDataphyte’s survey complementary to the Official NBS’Dataphyte embarked on this recent market survey mainly to spotlight the effect of the COVID-19 on food prices.\nNevertheless, the Nigerian government has not provided any intervention to curb or moderate the unending increase in food prices across the country.\nDr Laniran observed that “overall, the factors that make food price hike persist are structural challenges of the government."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Minly’s $3.6M seed funding, Google’s search warning, World MSME Day",
    "summarized_story": "Good day,Today I’m discussing:Minly’s $3.6M seed fundingGoogle’s warning notice for unreliable sources of breaking newsWorld MSME Day and the impact of the COVID-19 pandemic on small businessesCairo-based Minly raises $3.6M in seed fundingMinly team.\nSource: MenabytesEgypt’s Minly has raised $3.6 million in seed funding to connect fans and celebrities with authentic and personalised experiences.\nAdvertisementCameo lookalike: Like Cameo, Minly allows users to connect with celebrities such as athletes, musicians, and actors.\nGoogle will start warning you when search results are unreliablePhoto on PhotostockeditorIn a blog post, Danny Sullivan, Public Liaison for Search at Google, revealed the company’s newest feature for search results.\nA warning notice will now appear, indicating that sources for a particular news topic might be unreliable."
  },
  {
    "headline": "Policies, technology and Nigerian MSMEs’ battle for survival in a pandemic",
    "summarized_story": "The arrival of the pandemic seems to have changed the perspective of some small business owners.\nPer academic researchers Roberto Dell’Anno and Omobola Adu, Nigeria’s employment uncertainties and rapid urban migration are responsible for the rise of informal businesses.\nHowever, the arrival of the pandemic created a lot more problems for MSMEs across the globe, and Nigerian business owners faced problems born from systemic and infrastructural challenges.\nWith government incentives treated with deep scepticism, some Nigerian businesses had to find ways to survive.\nPeter’s scope expanded to running ad campaigns on Google and Facebook and getting a feel of other established businesses running his line of work."
  },
  {
    "headline": "How technology is helping this AC technician scale his business",
    "summarized_story": "AdvertisementIt’s why when we were asked to pitch possible stories for an article, the event “World Refrigeration Day” caught my attention.\nWorld Refrigeration DaySince 2019, World Refrigeration Day is celebrated every June 26.\nIt is an international awareness campaign established by the World Refrigeration Day Secretariat to raise the profile of the refrigeration, air-conditioning, and heat-pump sector.\nAfter watching several hours of AC installation and work tools videos on YouTube myself, I am inclined to agree.\nA vacuum pump is an essential tool used to repair cooling units to clean the compressor by removing unwanted air and water vapour."
  },
  {
    "headline": "Nigeria drifts off broadband target as internet access slows",
    "summarized_story": "The number of Nigerians with access to high-speed internet slowed down last May as users face an economic downturn amid the covid pandemic.\nThe tepid rate at which infrastructure is being rolled out coupled with the 4-month ban on new SIM registrations are some of the reasons.\nAt this pace, it means Nigeria is drifting…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Insecurity: Govs, LG Chairmen pocket over N375bn security vote annually, yet situation persists",
    "summarized_story": "Other states include, Lagos State: N1.429B Monthly [N1.297B (Public order and safety) + N132.5M (Social Protection)] (N17.149B Annually [N15.559B + N1.59B]), Ondo State: N600M Monthly (N7.2B Annually) Osun State: N400M Monthly (N4.8B Annually), Ogun State: N80-N100M Monthly (N960M-N1.2B Annually) Ekiti State: N100M Monthly (N1.2B annually), Oyo State: N1bn Monthly (N120B annually), Borno State: N806.25M Monthly (N9.675B Annually), Yobe State: N316.667M Monthly (N3.8B Annually).\nIn the same vein Imo State governor receives N333.333M Monthly (N4B Annually), Enugu State: N600M Monthly (N7.2B Annually), Anambra State: N850M Monthly (N10B Annually), Abia State: N700M Monthly (N8.4B Annually), Cross River State: N500M Monthly (N6B Annually), Rivers State: N1.5B Monthly (N18B Annually), Akwa Ibom State: N1.8B Monthly (N21.6B Annually), Edo State: N900M Monthly (N10.8B Annually) and Delta State: N2B Monthly (N24B Annually), respectivelyOthers are, Niger State: N1.308B Monthly (N15.7B Annually), Plateau State: N216.667M Monthly (N2.6B Annually), Kogi State: N400M Monthly (N4.8B Annually), Nasarawa State: N100M Monthly (N1.2B annually).\nChairmen of local government areas, it was gathered, collect up to N50m each amounting to N38 billion annually.\nAnalysts say Buhari should show his commitment to fighting corruption by cutting down on his government’s widespread use of security votes.\nWhen you look at the history of security vote in Nigeria, you will not find anywhere in the 1999 constitution that allows security vote to be enjoyed by anybody."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "In the coming week, oil prices are expected to be bullish on signs of demand growth.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nMoney marketFinancial system liquidity opened the previous week at N75.53bn which pushed funding rates lower at the start of the week.\nTreasury bills marketThe Treasury Bills Market started last week on a quiet note and a similar sentiment was sustained till the close of the week.\nMeanwhile, further disaggregation of Nigeria’s domestic public debt showed that the Federal Government’s domestic debt stock was put at N16.51trn while the domestic debt of States and FCT domestic debt stock was given as N4.12trn."
  },
  {
    "headline": "Edo First Lady hosts reception for couple left stranded by Marriage Court Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State First Lady, Mrs. Betsy Obaseki, at the weekend, organised a wedding reception for Mr. and Mrs. Abel Eromosele Ugiagbe, the couple whose marriage ceremony was disrupted by the absence of the Registrar of the Federal Marriage Registry, in Benin City, Edo State.\nMrs. Obaseki said her decision to host the reception for the couple was to ease the pain they went through following the disappointment on their wedding day, adding that the compassionate nature of Mr. Abel Eromosele Ugiagbe who felt bad that the registrar lost his job drew her closer to the couple.\nShe noted, “After I confirmed the report as true, I called my friend and wife of the Minister for Interior, Mrs. Aregbesola who briefed her husband about the development.\nThe Minister apologized to the couple.\nOsaigbovo Iyoha, congratulated the couple on the success of their wedding despite the disappointment they experienced over the failure of the Registrar of the Federal Marriage to show up for the marriage."
  },
  {
    "headline": "God will heal our land – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has dedicated his administration to God Almighty, declaring that God will heal Nigeria and Edo State from all forms of social vices and political backwardness that hinder development.\nCiting the book of Timothy 2:1-2, Obaseki said, “I have the privilege and grace of God to offer prayers and declarations over the sphere of politics and government in Edo State.\nHe declared, “God will heal our land through Godly leaders who make Godly policies and lead with the fear of God.\n“I declare that Jesus Christ is Lord over politics and government in Edo State.\nI declare that the sphere politics in our state is blessed because of our prayers to the Lord."
  },
  {
    "headline": "Ogirrua of Irrua celebrates 50th coronation anniversary – Nigerian Observer",
    "summarized_story": "Chief, Martin Uhumoibhi, immediate past Vice Chancellor of Ambrose Alli University, Prof. Ignatius Onimawo, Dr. Igene Christopher, among others.\nAwards of honour were presented to some personalities such as, current senator representing Edo Central, Senator (Engr) Clifford Odia, Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHe appreciated the efforts of the government and people of Edo State in ensuring that peace prevail in the land, and thanked guests and all that contributed to the success of his 50th Coronation Anniversary.\nOthers in their remarks, including Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHighpoint of the one week celebration was the cutting of the 50th Coronation Anniversary cake by the celebrant, Ogirrua of Irrua and Okaijesan of Esanland, HRH William Momodu amidst cheers."
  },
  {
    "headline": "Edo Modular Refinery ready to begin operations – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Friday, said the Edo Modular Refinery being developed by Edo Refinery and Petrochemical Company Limited (ERPC) with support from the Edo State Government, in Ologbo, Ikpoba – Okha Local Government Area of the state, is ready to commence operations.\n“The plant is ready; it’s ready to receive crude oil; it’s ready to process and it’s ready to deliver products.\nThe governor has this project dear to his heart; not only this project, the power plant is also situated in Ologbo.\nIn his response, the Managing Director of the Edo Modular Refinery, Tim Tian, commended the governor for his contribution in the actualization of the project.\nTian, who attributed the outbreak of the COVID-19 pandemic as a major challenge which affected the project, said the refinery is ready to produce crude oil products."
  },
  {
    "headline": "Kano anti-corruption boss alleges ‘interference, intimidation’ by govt officials",
    "summarized_story": "ADVERTISEMENTThe head of Kano State Anti-Corruption and Public Complaints Commission, Muhuyi Magaji, has said he is facing interference and intimidation from government officials in his work.\nMr Magaji, who did not give names, however, said that will not deter him from bringing corrupt government officials to justice.\nMr Magaji stated this in a statement posted on the commission’s Facebook page.\nBut that cannot happen because I am not afraid to lose the job,” Mr Magaji said.\n“Even if I leave the state’s anti corruption agency, Nigerian law allows for private detective (work)."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "IPOB/ESN Members Kill Juju Man Over Failed Charms",
    "summarized_story": "AdvertisementsThe media adviser to the Imo State commissioner for police, Mike Abatam, made the claims in a statement.\nHe said after killing him, the aggrieved members decimated his body, beheaded him and burnt him inside his house.\nOkeke who hailed from Umudim Ukwu Orji Awomama in Oru East local government area of Imo State, was killed last Friday in his home.\nAbatam said the late Okeke had received huge sums of money from the group in exchange for charms to protect them from police gunshots but which failed repeatedly.\n“Large sums of money were funneled to the deceased with promises of invisibility and decimation by the police troops,” Abatam said."
  },
  {
    "headline": "IPOB/ESN Members Kill Juju Man Over Failed Charms",
    "summarized_story": "AdvertisementsThe media adviser to the Imo State commissioner for police, Mike Abatam, made the claims in a statement.\nHe said after killing him, the aggrieved members decimated his body, beheaded him and burnt him inside his house.\nOkeke who hailed from Umudim Ukwu Orji Awomama in Oru East local government area of Imo State, was killed last Friday in his home.\nAbatam said the late Okeke had received huge sums of money from the group in exchange for charms to protect them from police gunshots but which failed repeatedly.\n“Large sums of money were funneled to the deceased with promises of invisibility and decimation by the police troops,” Abatam said."
  },
  {
    "headline": "Gov Emmanuel Sets Agenda For Tourism Operators",
    "summarized_story": "Governor of Akwa Ibom State Udom Emmanuel has tasked Nigerian Association of Tour Operators (NATOP) to adopt new strategies that would make the nation’s tourism potentials attractive.\nAdvertisementsEmmanuel who made the call at the fifth annual general meeting of the association in Uyo at the weekend expressed dismay over the dwindling fortunes of the sector despite the vast tourism potentials of the country.\nThe governor however expressed delight with the new level of commitment and zeal demonstrated in recent times by the tourism operators and other stakeholders in promoting the industry in the country, saying the new lease of life in the sector if sustained could generate huge revenue for both practitioners and the government.\nHe said the hospitality of Akwa Ibom people remained untapped as the state is blessed with several cuisines while natural tourist sites including the residence of Mary Slessor, the blue River, the longest coastline in Nigeria, the annual Christmas Carol and Christmas Village have become must see events in the calendars of lovers of tourism.\nHe pledged the assistance and partnership of the state government to NATOP but urged the organisation to adopt measures that would project their services and attract goodwill to the country, expressing hope that the conference would develop a new template for running tourism in Nigeria."
  },
  {
    "headline": "Gov Emmanuel Sets Agenda For Tourism Operators",
    "summarized_story": "Governor of Akwa Ibom State Udom Emmanuel has tasked Nigerian Association of Tour Operators (NATOP) to adopt new strategies that would make the nation’s tourism potentials attractive.\nAdvertisementsEmmanuel who made the call at the fifth annual general meeting of the association in Uyo at the weekend expressed dismay over the dwindling fortunes of the sector despite the vast tourism potentials of the country.\nThe governor however expressed delight with the new level of commitment and zeal demonstrated in recent times by the tourism operators and other stakeholders in promoting the industry in the country, saying the new lease of life in the sector if sustained could generate huge revenue for both practitioners and the government.\nHe said the hospitality of Akwa Ibom people remained untapped as the state is blessed with several cuisines while natural tourist sites including the residence of Mary Slessor, the blue River, the longest coastline in Nigeria, the annual Christmas Carol and Christmas Village have become must see events in the calendars of lovers of tourism.\nHe pledged the assistance and partnership of the state government to NATOP but urged the organisation to adopt measures that would project their services and attract goodwill to the country, expressing hope that the conference would develop a new template for running tourism in Nigeria."
  },
  {
    "headline": "Look Beyond N65,000 Amnesty Stipend, Dikio Tells Ex-militants",
    "summarized_story": "Interim administrator of the Presidential Amnesty Programme (PAP), Col. Milland Dixon Dikio (rtd) has urged the leaders of the first phase beneficiaries of the programme to look beyond the monthly N65,000 stipends from the federal government, declaring that the new model from the PAP was designed to make ex-agitators employers of labour.\nHe promised to look into the complaints and concerns of the ex-agitators on the re-organisation of the programme’s offices for effective service delivery.\n“Niger Delta as a riverine area should be investing heavily on maritime transport and maritime security.\nWe must own it because it is who we are.\nThis Niger Delta will be the best place to live and do business in my lifetime."
  },
  {
    "headline": "Jos violence: Abia warns against further attacks on Enyimba players",
    "summarized_story": "The Abia State Government has condemned the attack on Enyimba players in Jos, following their goalless draw against home side Plateau United in a Nigeria Professional Football League match on Sunday.\nThe attack left two Enyimba players – defender Dare Olatunji and goalkeeper Sabirou Bassa-Djeri injured.\nFans of the home team were also angered after the centre referee waved play on following pleas from Plateau United players for a penalty.\nWhile condemning the attack, the Abia State Commissioner for Information, John Kalu, called on NPFL officials to investigate the incident and punish the fans involved.\nHe said, “Abia State Government condemns in totality the barbaric attack on players of Enyimba FC in Jos following a goalless draw in a league game with Plateau United."
  },
  {
    "headline": "Jos violence: Abia warns against further attacks on Enyimba players",
    "summarized_story": "The Abia State Government has condemned the attack on Enyimba players in Jos, following their goalless draw against home side Plateau United in a Nigeria Professional Football League match on Sunday.\nThe attack left two Enyimba players – defender Dare Olatunji and goalkeeper Sabirou Bassa-Djeri injured.\nFans of the home team were also angered after the centre referee waved play on following pleas from Plateau United players for a penalty.\nWhile condemning the attack, the Abia State Commissioner for Information, John Kalu, called on NPFL officials to investigate the incident and punish the fans involved.\nHe said, “Abia State Government condemns in totality the barbaric attack on players of Enyimba FC in Jos following a goalless draw in a league game with Plateau United."
  },
  {
    "headline": "FG keeps Twitter in suspense over talks",
    "summarized_story": "Twitter users may have to wait a little longer to have access to the social media platform.\nThe Federal Government team appears not to be in a hurry to fix a date for talks with the micro bloggers.\nIt was however learnt that the government may set legal, security and business hurdles for Twitter before it can resume operation in Nigeria.\nThe panel set up by President Muhammadu Buhari has not fixed a date for meeting with the Twitter management.\nThe Federal Government had on June 4 suspended Twitter operation in the country for pulling down a tweet by the President."
  },
  {
    "headline": "FG keeps Twitter in suspense over talks",
    "summarized_story": "Twitter users may have to wait a little longer to have access to the social media platform.\nThe Federal Government team appears not to be in a hurry to fix a date for talks with the micro bloggers.\nIt was however learnt that the government may set legal, security and business hurdles for Twitter before it can resume operation in Nigeria.\nThe panel set up by President Muhammadu Buhari has not fixed a date for meeting with the Twitter management.\nThe Federal Government had on June 4 suspended Twitter operation in the country for pulling down a tweet by the President."
  },
  {
    "headline": "Yusuf Buhari set to marry Kano princess Zara Ado Bayero: Video",
    "summarized_story": "Preparations are in top gear for the wedding of Yusuf Buhari, the only son of President Buhari and Kano Princess Zara Nasir Ado Bayero.\nZara, a 19 year-old graduate of Brighton University, is the daughter of the Emir of Bichi.\nA powerful delegation to ask for permission for the wedding to go ahead, visited the Emir Aminu Ado Bayero in Kano on Sunday.\nAminu Ado Bayero is the senior brother of the Emir of Bichi, Nasiru Ado Bayero.\nAccording to reports, the wedding is expected to be held between August and September this year."
  },
  {
    "headline": "Swedish PM Lofven resigns, days after losing confidence vote",
    "summarized_story": "Agency ReportSwedish Prime Minister Stefan Lofven said on Monday he has handed in his notice of resignation and asked parliament’s speaker to find a new premier.\nLofven, the Social Democrat leader quit a week after he lost a vote of no-confidence.\nLofven lost the confidence vote in parliament on June 21 after the Left Party withdrew its support.\nThe loss triggered frenzied talks as both the centre-left and centre-right tried to line up enough support to form a government.\nIt took Lofven four months to form a government after 2018’s inconclusive election."
  },
  {
    "headline": "IPMAN threatens to cut fuel supply nationwide from Tuesday",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has disclosed that plans are underway by its members to shut down all filling stations across the country.\nIPMAN warned it might also cut down supplies from Tuesday should the Federal Government and Inspector General of Police fail to address alleged illegalities perpetrated by the Police Force.\nIPMAN National Public Relation Officer (PRO), Yakubu Suleiman, disclosed this on Sunday in a chat with reporters in Jos.\nSome police officers last Friday were alleged to have invaded IPMAN National Secretariat for some unstated reasons.\nSuleiman described the invasion as an illegal clampdown over alleged sponsorship by some impostors parading themselves as executives of IPMAN."
  },
  {
    "headline": "JUST IN: Passengers Trapped In The Bush As Abuja-Kaduna Train Breaks Down",
    "summarized_story": "Hundreds of passengers on the Abuja/Kaduna train are currently stranded in Dutse, Kaduna, as the train developed faults a few minutes into the journey.\nFive minutes after the train departed the Rigasa Station in Kaduna, it developed a mechanical fault.\nMidat Joseph, an Assistant National Secretary of the Nigeria Union of Journalists (NUJ), who is one of the passengers, said the train developed fault around 7:am.\nAn engineer of the NRC, who addressed the passengers, told them that it would take them two hours to fix the train.\nWe have contacted the Idu Train Station for another locomotive."
  },
  {
    "headline": "If We Don’t Manage Our Population Wisely, Nigeria Would Become A Lliability By 2050 —Obasanjo",
    "summarized_story": "Nigeria’s population expansion, according to former President Olusegun Obasanjo, could become a concern if it is not effectively handled.\nIn response, Obasanjo predicted that if the population surge continues, Nigeria will overtake China as the world’s third-largest country by 2050.\n“If we don’t start getting it right now, we will not get it right by 2050.\nBut if we don’t do what we have to do – which we are not doing now – the population will become a liability.\nSome people don’t like family planning and all that, but whatever you do, you must manage your population for the benefit of all that is within your nation.”"
  },
  {
    "headline": "Buhari Reacts To Niger Delta Avengers’ Threat To Shutdown Oil Production",
    "summarized_story": "The Niger Delta Avengers threatened and demanded that economic sabotage be carried out by attacking major oil and gas sites unless specific demands, including the development of the Niger Delta and the reorganization of the Federation, were realized, according to the media on Sunday.\nI thank you for paying this courtesy visit not too long after your election in April, and swearing-in last May.\n“I also want to congratulate you all for your election and to add that a lot of responsibility is placed on your shoulders, especially coming from the fact that the Ijaw National Congress was almost without leadership for some time.\n“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "Military Bombs Boko Haram, ISWAP Commanders During Meeting",
    "summarized_story": "During a conference around the Lake Chad axis, the Nigerian military bombed Boko Haram and Islamic State West African Province (ISWAP) commanders and leaders.\nBoko Haram and ISWAP camps were hit by Nigerian Air Force jets in Sabon Tumbu, Jibularam, and Kwalaram, according to news reports.\n“Their leaders, including Ali Chakkar and other top ISWAP commanders, were holding a meeting when the attacks were launched.\n“The precision-guided airstrikes coordinated by the Air Task Force Command resulted in the killing of very large numbers of ISWAP and Boko Haram terrorists,” the source said.\n“We don’t differentiate between Boko Haram and ISWAP terrorists as we successfully launched the devastating intelligence-led aerial attacks targeting the terrorists in those locations”, he said."
  },
  {
    "headline": "Matawalle set to join Ayade, Umahi in APC …Senators, 6 Reps, ex-deputy gov Wakkala, Yuguda follow gov",
    "summarized_story": "Strong indication emerged Sunday that Zamfara state Governor Bello Matawalle will defect from Peoples Democratic Party ( PDP) to the ruling All Progressives Congress (APC).\nEbonyi state Governor Dave Umahi left the party last year while a PDP lawmaker, Senator Peter Nwaoboshi also joined the APC last week.\nTsafe, an APC chieftain in the state, was the first to call on Matawalle to join APC March last year.\nTsafe said he was condemned and called names by PDP chieftains when he first called on the governor to join APC.\n“All arrangements have been concluded for the governor to join APC."
  },
  {
    "headline": "Insecurity in FCT: UniAbuja, Veritas varsity, COED Zuba, 5 others on red alert",
    "summarized_story": "“As you can see in the school, students are going about their normal businesses without tension, there is calm because there is reasonable security.\nVeritas UniversityAt Veritas University, a privately owned institution, the institution scaled down academic activities, including vacating the students on campus.\nBut the situation at the College of Education, Zuba is almost similar to the UniAbuja as the school’s permanent site is entirely without front and back perimeter fence.\n“We have perimeter fence around the temporary site and also around the permanent site,” a senior staff insisted.\nFrom behind it shares a boundary with the thick bush adjacent to the CCECC, International Cancer Centre along the Lugbe Expressway but with a near nonexistent perimeter fence."
  },
  {
    "headline": "Pictures: Pandomonium as hoodlums attack Enyimba players in Jos after Aba-based club picked point vs Plateau United",
    "summarized_story": "NextInvestors participation in stock market drops in May"
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Kumuyi urges Nigerians to connect with God for divine intervention -NigPilot",
    "summarized_story": "…begins 6 days crusade in Abuja, othersAmidst daunting challenges the country grapples with, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi , yesterday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin”, he said."
  },
  {
    "headline": "Population Explosion: If We Don’t Get It Right Now, We Won’t By 2050 – Obasanjo",
    "summarized_story": "Chief Olusegun Obasanjo has asked Nigerian leaders to begin at this moment in the nation’s history, to prepare for and against population explosion.\nSpeaking further about the situation which he says has slowed down national development, Obasanjo expressed worry over the management of the population of the nation.\n“What are we going to do to handle that, how are we going to handle that population?\n“What we need to do is education about population management.\nSome people don’t like saying family planning, but whatever you do, you must manage your population to the benefit of all that is living within your nation,” Obasanjo stated."
  },
  {
    "headline": "Niger Delta Avengers’ Sabre-Rattling Rather Unnecessary, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has said that the threat issued by the Niger Delta Avengers on Saturday is rather unnecessary.\nMr. Adesina said when the Niger Delta and Ijaw National Congress visited the president, issues such as the call for restructuring and the inauguration of a board for the Niger Delta Development Commission (NDDC) were addressed.\nThey said the south-south remains the most underdeveloped region in the country, with their needs and interests “undermined by the failed Nigerian State”.\nHowever, as you know, the process of granting licenses is guided by laid-down rules and regulations, most of which even favour local content and local contractors.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "How FG Will Tax Profits Made By Global Tech Giants In Nigeria – Osinbajo",
    "summarized_story": "Nigeria is set to utilise its legal provisions that empower the Federal Government to collect taxes on profits made in the country by global technology and digital firms not based in the country, but with a significant economic presence here.\n“I think the most important thing is that we must widen our tax net so that more people who are eligible to pay tax are paying.\n“The Finance Act has shown that we are very prepared to ensure that these big technology companies do not escape without paying their fair share of taxation in Nigeria.\nMany of them do incredible volumes here in Nigeria and in several other parts of the region.\nAlso CIT for companies with revenues between N25 and N100m (described in the Act as “medium-sized” companies) has been reduced from 30% to 20%."
  },
  {
    "headline": "SERAP Asks African Commission To Order FG, NASS To Withdraw Bills To Gag Media",
    "summarized_story": "The bills are reportedly sponsored by Chairman, House Committee on Information, Mr Segun Odebunmi (PDP, Oyo State).\nThere are no effective or sufficient local remedies available to the Complainant.”“Nigerian courts do not entertain cases on the legality of anti-media and anti-human rights bills.\nAlso, one of the lawmakers pushing the bills Mr Odebunmi Olusegun has reportedly boasted that ‘No court will stop us from passing the bills.\nThe Nigerian authorities should also give assurances that they will fully implement the resolutions and declarations on freedom of expression, access to information and media freedom in the country.\n4.Undertake a prompt review of Nigerian legal framework and administrative practices on freedom of expression, access to information, and media freedom to ensure their consistency and compatibility with the African Charter, and resolutions and declarations by the African Commission."
  },
  {
    "headline": "Japan Olympic Chief Says ‘No Way’ To Ensure Zero Virus Cases",
    "summarized_story": "Japan’s Olympic chief said Monday there was “no way” to ensure zero virus cases among teams arriving for the Tokyo Games, as officials prepare to tighten screening procedures.\nJapanese Olympic Committee president Yasuhiro Yamashita said “thorough measures” would be necessary at airports, after two members of Uganda’s team tested positive last week following their arrival in Japan.\n“No matter what measures are put in place, there is no way we will have zero positive cases arriving,” Yamashita told reporters.\n“I think the athletes will be spending their time here in Japan in extremely restricted conditions,” he said.\nI think that’s where the Tokyo Games can be significant.”AFP"
  },
  {
    "headline": "Obaseki unveils new pavilion facility designs for Edo Museum",
    "summarized_story": "Governor of Edo State,Godwin Obaseki, has revealed plans to speed up the construction of the much-anticipated Edo Museum of West African Art (EMOWAA).\nThe Governor announced that construction of an early-phase facility called the EMOWAA Pavilion will begin before the end of the year during a retreat organized by the National Commission for Museums and Monuments in Benin City.\nAccording to the him, “The integration of EMOWAA into the daily life of our people, and its impact on a greatly improved urban fabric, will begin with the opening of the EMOWAA Pavilion.\nThe landscaped grounds outside the building will include an informal public gathering place and a museum facility for outdoor programs”, he concluded.\nAfter EMOWAA is completed, the Pavilion will serve as a basis for continuous archaeological research, a training hub for archaeology, conservation, heritage studies, and museology, as well as a storage and conservation facility for EMOWAA’s artefacts."
  },
  {
    "headline": "UK Health Secretary Matt Hancock resigns over alleged affair with Senior aide",
    "summarized_story": "UK Health Secretary Matt Hancock, has resigned following reports of a secret romance with a Senior aide Gina Coladangelo.\nThe Sun UK published a photo of Hancock purportedly “kissing and embracing Gina Coladangelo” at the Department of Health’s London headquarters.\nHe also admitted that he broke covid-19 guidelines as such, he had to take the lead and stay away from his office.\n“I am writing to resign as Secretary of State for Health and Social Care.\nBBC reports that UK Prime Minister, Boris Johnson felt “sorry” upon receiving Hancock’s resignation letter."
  },
  {
    "headline": "Synagogue Church releases funeral details of T.B Joshua",
    "summarized_story": "The funeral details for Prophet T.B.\nJoshua, the founder of the Synagogue Church of All Nations, who died on June 5 have been released.\nThe Church had announced that the funeral would be completed in a week from July 5 to 11.\nThe church had previously stated that Joshua would be buried at the church, despite the requests of the traditional authorities in Arigidi Akoko, Ondo, where the prophet was born.\nAdvertisementIt also assured its members that worship will not stop at the church following shutdown since Joshua’s demise."
  },
  {
    "headline": "South Africa Toughens Restrictions to Combat Delta Variant",
    "summarized_story": "South African President Cyril Ramaphosa has reimposed restrictions for two weeks to combat a surge in the highly contagious Delta coronavirus variant.\nAl Jazeera’s Robyn Smith, reporting from Cape Town, said, according to the government, the Delta variant is currently the dominant variant in South Africa.\nPresident Cyril Ramaphosa says South Africa facing ‘massive resurgence’ of coronavirus infections as he reimposes restrictions.\nSouth African President Cyril Ramaphosa has reimposed restrictions for two weeks to combat a surge in the highly contagious Delta coronavirus variant.\nAl Jazeera’s Robyn Smith, reporting from Cape Town, said, according to the government, the Delta variant is currently the dominant variant in South Africa."
  },
  {
    "headline": "Niger Delta Avengers’ Threat Unnecessary, Says Presidency",
    "summarized_story": "The Presidency Sunday described as unnecessary, the threat by the Niger Delta Avengers (NDA) to bomb oil installations if some of their demands are not met by the federal government.\nIt, however, said it was curious that the threat came barely 48 hours after President Muhammadu Buhari met with the leadership of the Niger Delta and Ijaw National Congress (INC), at the State House, Abuja during which they discussed crucial issues, especially the call for restructuring of the federation and the inauguration of a board for the Niger Delta Development Commission (NDDC).\nA statement Sunday by the media adviser to the president, Mr. Femi Adesina, said the media was sunday awash with threats and demands by Niger Delta Avengers to embark on economic sabotage through the bombing of critical oil and gas installations unless certain demands, including the development of the Niger Delta, and restructuring were met.\nIn addition, Buhari told his visitors that the National Oil Spill Detection and Response Agency was working to make sure that oil spills are reduced and new ones prevented.\nBuhari had told Niger Delta leaders that all the agencies of government had been directed to ensure that they enforce compliance by the international oil companies (IOCs) to international best practices."
  },
  {
    "headline": "Why Grazing Routes Are Difficult to Recover in Nigeria: Report",
    "summarized_story": "However, THISDAY’s investigation has revealed that the grazing routes have been taken over, over the years, by modern facilities built for the public good.\nIn Kano State, the state government has acknowledged that the grazing routes have been taken over by public infrastructure, including schools.\nAlthough Niger State has 11 grazing routes, covering about 1,865 kilometres, 1,368 kilometres of these routes are primary routes while the remaining 496 kilometres are secondary routes.\nHe explained: “The committees are working with already list of encroachers on the grazing reserves and discussions are in top gear to reclaim these grazing reserves.\nThe Special Adviser on Media and Public Enlightenment to the Governor, Mr. Zalaini Bappa, said even some former governors who trespassed on the grazing reserves returned the land."
  },
  {
    "headline": "Nigeria: Petrol Subsidy Bites Harder, NNPC Proposes $280m Deduction in June",
    "summarized_story": "These implied that the deduction by the NNPC more than quadrupled from the N25.374 billion in February to N114 billion in June.\nAdded to export crude oil, the revenue generated was $616.037 million.\nAll the transactions were hinged on N382.80 to one dollar exchange rate as advised by the Central Bank of Nigeria (CBN), according to the national oil company.\n“Crude oil export revenue received in May 2021 amounted to $167.72 million, equivalent to N64.2 billion.\nBesides, the corporation said it expended N5 billion on export financing, N8.3 billion on the non-functional refineries and N83.3 billion on the ongoing Nigeria/Morocco pipeline."
  },
  {
    "headline": "US Airstrikes Target Iran-backed Militias in Syria, Iraq",
    "summarized_story": "The U.S. military, under the direction of President Joe Biden, conducted airstrikes Sunday against what it said were “facilities used by Iran-backed militia groups” near the border between Iraq and Syria.\nPentagon Press Secretary John Kirby said the militias were using the facilities to launch unmanned aerial vehicle attacks against U.S. troops in Iraq.\nKirby said the U.S. military targeted three operational and weapons storage facilities — two in Syria and one in Iraq.\nHe described the airstrikes as “defensive,” saying they were launched in response to the attacks by Iran-backed groups.\nIn February, the U.S. launched airstrikes against facilities in Syria, near the Iraqi border, that it said were used by Iranian-backed militia groups."
  }
]