[
  {
    "headline": "Resident doctors strike enters day 61 as Nigeria clocks 61",
    "summarized_story": "Lara AdejoroAs Nigeria marks its 61st independence, the ongoing strike by the National Association of Resident Doctors also enters its day 61 today (Friday).\nThis is even as the resident doctors insist that it will continue the total and indefinite strike action until its demands are met.\nRecall that the NARD had at the end of its National Executive Council meeting in Umuahia on July 31, announced a strike action that began on August 2, 2021.\n“The government should also commence payment of the Medical Residency Training Fund and also salary arrears of resident doctors owed on the GIFMIS platform,” he told PUNCH HealthWise.\n“If these are done, it will show the government’s commitment to the welfare of our members and we will reciprocate the gesture by ending the strike action."
  },
  {
    "headline": "Resident doctors strike enters day 61 as Nigeria clocks 61",
    "summarized_story": "Lara AdejoroAs Nigeria marks its 61st independence, the ongoing strike by the National Association of Resident Doctors also enters its day 61 today (Friday).\nThis is even as the resident doctors insist that it will continue the total and indefinite strike action until its demands are met.\nRecall that the NARD had at the end of its National Executive Council meeting in Umuahia on July 31, announced a strike action that began on August 2, 2021.\n“The government should also commence payment of the Medical Residency Training Fund and also salary arrears of resident doctors owed on the GIFMIS platform,” he told PUNCH HealthWise.\n“If these are done, it will show the government’s commitment to the welfare of our members and we will reciprocate the gesture by ending the strike action."
  },
  {
    "headline": "Lithuanian doctors remove screws, nails from man’s stomach",
    "summarized_story": "Doctors in Lithuania said on Friday they had removed over a kilogram of nails and screws from the stomach of a man who started swallowing metallic objects after quitting alcohol.\nAn X-ray of his stomach showed up pieces of metal — some measuring up to 10 centimetres (four inches).\n“During the three-hour operation with X-ray control, all foreign bodies, even the smallest ones, in the patient’s stomach were removed,” said surgeon Sarunas Dailidenas.\nThe hospital provided local media with a photograph of a surgical tray heaped with nails and screws.\nThe doctor said that the man had begun swallowing the metal objects over the last month after he had stopped drinking."
  },
  {
    "headline": "Lithuanian doctors remove screws, nails from man’s stomach",
    "summarized_story": "Doctors in Lithuania said on Friday they had removed over a kilogram of nails and screws from the stomach of a man who started swallowing metallic objects after quitting alcohol.\nAn X-ray of his stomach showed up pieces of metal — some measuring up to 10 centimetres (four inches).\n“During the three-hour operation with X-ray control, all foreign bodies, even the smallest ones, in the patient’s stomach were removed,” said surgeon Sarunas Dailidenas.\nThe hospital provided local media with a photograph of a surgical tray heaped with nails and screws.\nThe doctor said that the man had begun swallowing the metal objects over the last month after he had stopped drinking."
  },
  {
    "headline": "Out-of-school Children in Nigeria worrisome — PFN",
    "summarized_story": "By Onozure Dania, LagosThe Prison Fellowship of Nigeria PFN has said yesterday that Nigeria has the highest number of out-of-school in sub-Saharan Africa, with more than 10million children of schooling age out -of- school warning that urgent steps need to be taken.\nSpeaking at the Launch of The Promisepath Mentoring and Psychosocial Support Programme for 600 vulnerable and At-Risk Children, the Executive Director of PFN, Mr Benson Iwuagwu, said “The Promisepath programme was conceived when the Prison Fellowship International conducted comprehensive research in more than 30 countries representing every continent, along with a survey of PFI National Ministries.\nThe analysis revealed that vulnerable and at-risk children from all development context shares five major risks to their well-being.”“Promisepath is the new programme designed to reach out to vulnerable and at-risk children especially those whose parents are incarnated.\nThe programme is based on Prison fellowship Nigeria‘s longstanding Angel Tree Christmas programme with added round components of education and community-based mentoring.\n““The beneficiaries of the Promisepath programme must be between ages 4-18 in public primary or secondary school in Nigeria and whose parent is incarcerated, this includes either sentenced or pre-trial detention in correctional/custodial facilities, as well as house arrest, whereby house arrest prevents the parent from employment.”Also speaking at the event, The Commissioner for Education Lagos State, Mrs Folashade Adebusayo said that the ministry is very passionate when it comes to education, adding that their logo is that no child should be left behind."
  },
  {
    "headline": "Rotary Club of Ojodu gets new president",
    "summarized_story": "By Chioma ObinnaRotary Club of Ojodu, District 9110 recently installed its 17th president, Rotarian Kedienhon Jude Emuobosa, to direct its affairs 2020/2021.\n“We are here to celebrate Mothers and children who would have died if we fail to provide them with the necessary health facilities, we are here to celebrate children that would be vaccinated and prevented from Polio Virus.\nKedienhon further said he would make a greater impact by partnering with other service clubs, and individuals or entities that share common interest with the Club.\nHe added that there are several needy people in the community and the world, whose only hope would come from Rotary.\nThe look of relief on the faces of community members who attend our annual health fair is long-lasting."
  },
  {
    "headline": "Independence Day Broadcast: Timi Frank knocks Buhari over claims",
    "summarized_story": "“The nation’s currency exchanged for about N180 to a dollar when Buhari took over power, but his administration created multiple foreign exchange rate windows.\nHowever, Buhari would want the world to believe that his regime has recorded appreciable economic revival in the country.\nIn Southern Kaduna, killing of innocent villagers has continued unabated.\n“Unfortunately, Dr. Chike Akunyili who was husband to late Professor Dora Akunyili recently fell victim of that heightened orgy of violence now ravaging the South East.\n“For Buhari, it is easy to name a Federal Lawmaker as a financier of secessionist agitation in South East, but not easy to identify Boko Haram sponsors in the North."
  },
  {
    "headline": "October 1: Ameliorate Nigeria’s worsening economic condition, Atiku Group tells FG",
    "summarized_story": "By Luminous Jannamike, AbujaA political pressure group, Atiku Kawai Media Group, has advised the Federal Government to listen to the agitation of the people and make changes that will ameliorate their worsening socio-economic conditions.\nThe group stated this in a message to mark Nigeria’s 61st Independence Day anniversary which was signed by its National Publicity Secretary, Abdurrahman Suleiman, in Abuja.\nThe first day of October marks our independence day.\n“We call on the government to ameliorate worsening socio-economic conditions bedevilling the Nigerian polity and cement our sovereignty with sustainable development.\nIndependence Day is a reminder for us that we all are Nigerians first irrespective of our diversity."
  },
  {
    "headline": "Nigeria, pride of black race, says Ambassador to Qatar",
    "summarized_story": "By Victoria OjemeThe Nigerian Ambassador to the State of Qatar, Amb.\nYakubu Ahmed, has said that Nigeria is the pride of black race.\nThe envoy used the occasion to commend the cordial relations between Nigeria and Qatar.\nAccording to Ahmed, a good example was the high-level bilateral engagements between both countries such as the state visit of President Muhammadu Buhari to Qatar in 2016 and the state visit of His Highness, Sheikh Tamim Al-Thani, Amir of the State of Qatar to Nigeria in 2019.\nThe Ambassador reiterated the fact that Nigeria was poised to increase cooperation with Qatar especially in the areas of Agriculture, Oil and Gas, Mining, and infrastructural development."
  },
  {
    "headline": "Tell our people real reason investors withdrew from Ibom deep seaport project – NKpubre to Gov Emmanuel",
    "summarized_story": "Former MD/CEO of Nigerdock Plc; Engr Nkpubre Okon Nkpubre, has challenged Governor Udom Emmanuel of Akwa Ibom State to tell the people the reasons the preferred bidder as well as other investors backed out of the Ibom Deep Seaport project.\nHe said the people who wrote the petition felt disgruntled over the change in nomenclature from Ibaka to Ibom deep seaport as well as the relocation of the project site from Ibaka, Oron to Ibeno Local Government.\n“That is why the Chinese who first expressed interest in the Deep Sea Port withdrew.\n“Let the whole world know that Oron nation is not against the change of the name of the Sea Port from Ibaka Deep Sea Port to Ibom Deep Sea Port as falsely claimed by Governor Udom Emmanuel.\nWhat Oron nation is against is the unjustified relocation of the Deep Sea Port based on a clearly fraudulent criteria and also the ill-advised idea of a Dugout Port."
  },
  {
    "headline": "Nigeria at 61: Ebonyi records total lockdown over IPOB sit-at-home",
    "summarized_story": "The independence celebration of Nigeria at 61 and Ebonyi State at 25 Friday recorded low participation in South east geopolitical zone, especially in Ebonyi were all markets, filling stations, transport depots were totally shut down.\nInvestigation revealed that major streets of Abakaliki, capital of Ebonyi State were deserted by people except few other streets that some youths were seen to be playing football.\nIt was gathered that the popular Pa Ngele Oruta township stadium which would have been used to celebrate the independence of Nigeria at61 and Ebonyi State creation at 25 were allegedly closed to avert being vandalized by hoodlums.\nRecall that the governor Chief David Umahi had said “Anybody who says sit-at-home, Ebonyi people are not going to sit-at-home and I’m appealing to south east people to understand the dangers of the sit-at-home and those who are orchestrating the sit-at-home are our brothers who are outside the country.\nWe believe strongly in south east, that even the peaceful agitation that was devoid of venom and hate speeches have been hijacked by people who have ulterior motives,” he said."
  },
  {
    "headline": "Police honour Kazeem Abonde, CSP murdered during okada riders clash in Lagos",
    "summarized_story": "The Police honoured the late Chief Superintendent Kazeem Abonde with a colour parade on Friday in Lagos.\nThe lying in state was held at the State Headquarters in Ikeja before the body was transported to Oyo State.\nAbonde was killed on September 23 in Ajao Estate when he led operatives to effect the Lagos government ban against okada riders.\nThe CSP, whose head was smashed, died in a pool of blood before emergency services reached him.\n“Such display of savagery as the one in which CSP Abonde died will not be allowed no matter the circumstances."
  },
  {
    "headline": "Osoba in London for knee replacement surgery – Gov Abiodun reveals",
    "summarized_story": "Former Ogun State Governor, Chief Olusegun is currently recuperating in London after a knee replacement surgery, Governor Dapo Abiodun has said.\nAbiodun, who just returned from a controversial trip to the the United Kingdom, said he visited Osoba during his stay.\n“Our Baba, Chief Olusegun Osoba, underwent knee replacement surgery in the UK and we thank God that it went well, as he is now fine and in perfect condition.\nAbiodun, while congratulating Osoba over the success of the knee replacement surgery, explained that the elder statesman was recuperating well after the surgery he underwent on Thursday, September 30.\nOsoba is a close friend to the National Leader of the All Progressives Congress (APC), Chief Bola Tinubu, who was said to have earlier undergone a knee surgery in the UK."
  },
  {
    "headline": "Unknown gunmen kill popular Fulani herdsman in Kwara",
    "summarized_story": "Unknown gunmen have killed a popular Fulani herdsman, simply identified as Ibrahim at Ago-Are community in Ifelodun Local Government Area of Kwara State.\nThe victim, Ibrahim, was gruesomely murdered at Ago-Are with the attackers still at large.\nSpokesman of the Kwara State Command of the Nigeria Security and Civil Defence Corps, NSCDC, Babawale Zaid Afolabi, disclosed this in Ilorin, on Friday.\n“Yes, we got the report on Friday, through our Divisional Officer in the town, Najimu Lawal about another attack in Ago-Are community.\n“This time around, a Fulani herdsman simply known as Ibrahim or Ibro, was attacked and hacked to death by the assailants,” the spokesman stated."
  },
  {
    "headline": "How Buhari, governors, others celebrated Nigeria’s 61st independence anniversary",
    "summarized_story": "Reprieve for four in PlateauIn the spirit of independence, Governor Simon Lalong of Plateau State on Friday pardoned four inmates for exhibiting good conduct while serving in the correctional center.\nDiri stated this on Friday in a statewide broadcast to mark Nigeria’s 61st and Bayelsa State 25th anniversary aired on all the major stations in Yenagoa.\nSaid Mallam Abdulrazaq: “I join Mr. President and the rest of the country to felicitate our compatriots, especially the people of Kwara State, on the 61st independence anniversary.\nToday is the 61st independence anniversary of Nigeria and we are celebrating it in a beautiful brand new stadium.\nHe spoke after the special Jumaat prayer to mark the 61st independence of Nigeria."
  },
  {
    "headline": "Afenifere, PANDEF, others flay Buhari over Independence Day speech",
    "summarized_story": "Afenifere said the speech was evidence that the President was not in touch with reality, PANDEF said the speech echoed bigotry and nepotism while the Ilana Omo Oodua said the speech exposed him as a northern president.\nIn a statement issued by its National Publicity Secretary, Comrade Jare Ajayi,Afenifere said the picture painted by President Buhari of the Nigeria situation was at variance with the reality.\nIt noted: “As at the time President Buhari assumed office in 2015, a bag of rice was around N7,000 while a US dollar exchanged for about N180 even in the black market.\n“This independence day speech reverberates the bigotry and nepotism of the Buhari administration.\nIn a statement titled ‘Buhari mocked Nigerians with his Independence Day speech’, Adeyanju said: “It is beyond sad to hear President Buhari commending the military for failure in his Independence Day speech."
  },
  {
    "headline": "House joins Senate in asking Buhari to declare bandits, sponsors as terrorists",
    "summarized_story": "By Tony Akowe, Abuja- Advertisement -The House of Representatives yesterday expressed support for the Senate in asking President Muhammadu Buhari to declare bandits and their sponsors as terrorists.\nThe House said doing so would underline the determination of the Federal Government to reduce criminality and murders by bandits across the country.\nIn moving the motion, Benson said: “The Senate on Wednesday, September 29, 2021, adopted a motion asking President Buhari to declare bandits ravaging the northern part of the country as terrorists and wage a total war on them.\n“They also asked that the President declare all known leaders of bandits wanted and arrest them wherever they are found for speedy prosecution.\n“I will like to echo the same sentiment and ask honourable colleagues to join the Senate in urging Mr. President to declare bandits and their sponsors as terrorists."
  },
  {
    "headline": "Google celebrates Nigeria’s 61st Independence with a doodle",
    "summarized_story": "The largest search engine in the world, Google on Oct. 1, celebrated Nigeria’s 61st Independence Day anniversary with a doodle.\nGoogle celebrated Nigeria on its website with a special doodle depicting a red coloured Eagle atop an image of the national colours of Green and White.\nA click on the doodle opens up another page where very important facts and videos about Nigeria and its history were displayed.\nIn celebration of Nigeria 61st Independence, Google said “Today’s doodle celebrates this monumental occasion with a depiction of Nigeria’s national animal and symbol of strength— the Eagle.”Explaining the design, Google stated: “On this day in 1960, Africa’s most populous country, with over 200 million inhabitants, became a sovereign republic, an anniversary commemorated as Nigeria’s Independence Day.\n(NAN )Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "President Muhammadu Buhari lifts ban on Twitter",
    "summarized_story": "President Muhammadu Buhari has approved a conditional lifting of ban on the microblogging giant, Twitter.\nThe president made this position known during a broadcast to mark Nigeria’s 61st Independence Anniversary on Friday in Abuja.\n“Following the suspension of Twitter operations, Twitter Inc. reached out to the Federal Government of Nigeria to resolve the impasse.\n“The Committee, along with its Technical Team, has engaged with Twitter and have addressed a number of key issues.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NASS member, others financing Kanu, Igboho –Buhari",
    "summarized_story": "By Louis IbahPresident Muhammadu Buhari has restated his commitment to the unity of the country.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\n“The recent arrests of Nnamdi Kanu and Sunday Adeyemo, and the ongoing investigations being conducted have revealed certain high-profile financiers behind these individuals.\nWe are vigorously pursuing these financiers, including one identified as a serving member of the National Assembly.\nFellow Nigerians, the past eighteen months have been some of the most difficult periods in the history of Nigeria."
  },
  {
    "headline": "NIGERIA @ 61: PDP, CAN, govs, Lawan, Kalu, Tinubu, others set agenda for FG",
    "summarized_story": "“There shall be showers of blessings because God shall judge the evil doers in the nation.\n“Violence shall become a thing of the past in Nigeria and all Nigerians shall dwell in safety in the name of Jesus.\nChairman, Committee on Primary and Secondary Education, Sanni Okanlawon, also urged Nigerians to unite in the efforts to end insecurity.\n•Lawan, Tinubu urge unity, faithSenate President, Ahmad Lawan, urged Nigerians to unite for the progress of the country and continue to keep faith with their fatherland.\nWhile charging politicians not to heat the polity with provocative utterances, he urged Nigerians to be law-abiding, optimistic and peaceful."
  },
  {
    "headline": "Insecurity: Stop these senseless killings, Pope Francis tells Buhari",
    "summarized_story": "Catholic pontiff, Pope Francis, has asked President Muhammadu Buhari to find ways to stop the killings of Nigerians across the country.\nLamenting what he described as senseless killings of innocent Nigerians by suspected jihadists, the Pope called on the Federal Government to guarantee the safety of all citizens.\nHe said it was not only in Southern Kaduna that people were being massacred, stressing that everywhere in the country, Nigerians were being killed.\n“It is sad that Nigerians are still literally dying every day through very barbaric and senseless killings.\nTo all victims of the violence and killings in the land, we send prayers and condolences."
  },
  {
    "headline": "Nigeria’s 61st Independence Anniversary in Photographs",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Breaking: Protests in Abuja as Nigeria Marks Independence Anniversary",
    "summarized_story": "By Olawale AjimotokanMinutes after President Muhammadu Buhari addressed the nation in commemoration of Nigeria’s 61st Independence anniversary, massive anti- government protest embroiled as protesters took over the roads in Abuja.\nThe police are, however, using teargas to disperse the protesters.\nThe postesters, mainly youth activists, blocked the International Airport Road and were seen carrying the “Buhari Must Go” placards.\nA detachment of police which arrived the scene, removed the roadblock and hauled teargas canisters to disperse the protesters.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Blames Middlemen for Rising Food Prices",
    "summarized_story": "President Muhammadu Buhari has blamed middlemen for the rising prices of foodstuffs in the country .\nIn his national broadcast on Nigeria’s 61st independence anniversary Friday, Buhari said, “Unfortunately, as our food production capacity has increased, food prices have been going up due to artificial shortages created by middlemen who have been buying and hoarding these essential commodities for profiteering.”To address this, the President directed the ministry of Agriculture to rehabilitate the national food reserve agency and work with some agencies to address the problem.\n“I am hereby directing the Ministry of Agriculture and Rural Development to rehabilitate the National Food Reserve Agency and also work with security agencies, the Nigerian Commodity Exchange, and the National Assembly to find a lasting solution to these disruptive and unpatriotic hoarding activities”, Buhari said.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Buhari Expresses Displeasure over COVID-19 Vaccines Distribution",
    "summarized_story": "President Muhammadu Buhari has called on the global community for the equitable distribution of COVID-19 vaccines, describing the current rate of distribution as unacceptable.\nThe president, in a speech to mark Nigeria’s Independence anniversary Friday, said: “I will take this opportunity to remind the global community that the current state of access to COVID-19 vaccines is unacceptable.\nWe cannot afford a situation where a handful of countries keep the global vaccine supply to themselves at the expense of other nations.\n“We must act now to accelerate equitable distribution of COVID-19 vaccines.\nThis is the message I conveyed to the international community in New York last week.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "For the Record: Buhari’s Independence Day Broadcast (Full Text)",
    "summarized_story": "It is with full gratitude to God that today, we celebrate Nigeria’s sixty first Independence Anniversary.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b.\n*Being the full text of the of the 61st Independence Day Address by President Muhammadu Buhari on Friday 1st October, 2021."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "Investigation: How Cross River State Magistrate Pervates Justice, Exploits His Office For Personal Gain",
    "summarized_story": "IKM/RTM/12/2019 in favor of Mrs. Florence Innocent that, Mr. Loveday Eke pay her “N400,000 being arrears of two years rent, mense profit of N16,000 per month from January 2019 until possession and N15,000 for cost of action.”Judgment that Mr. Loveday Eke is indebted to.\nEssentially, the action was taken to recover a balance of N50,000 from Mr. Loveday.\nPeople familiar with the nefarious activities of Magistrate Bassey Nsidieti Bassey, Registrar of Ikom Magistrate’s Court told our correspondent in anonymity that this was his usual practice.\nEvidence that the Toyota Camry that was sold doesn’t belong to Loveday, judgment debtor but Edim Samuel Okpa.\nThe next day, Friday, Mr. Isiaka brought the N50,000 which made it N160,000 of N725,000 he owed Mrs. Scholastica in judgment."
  },
  {
    "headline": "Nigeria gets World Bank approval on $400m loan for COVID vaccines",
    "summarized_story": "The World Bank has approved $400 million credit facility for the purchase and deployment of COVID vaccines in Nigeria.\nAdvertisementThe approval was announced in a statement issued by the World bank.\nAccording to the statement, the approval was granted on Thursday, and the fund is expected to be used to finance easier access to vaccines for Nigeria.\nThis will be implemented as part of the COVID-19 Preparedness and Response Project,” the statement reads.\n“The additional financing will allow Nigeria purchase and deploy COVID-19 vaccines, strengthen relevant health systems that are necessary for a successful deployment and to prepare for future health emergencies."
  },
  {
    "headline": "Nigeria gets World Bank approval on $400m loan for COVID vaccines",
    "summarized_story": "The World Bank has approved $400 million credit facility for the purchase and deployment of COVID vaccines in Nigeria.\nAdvertisementThe approval was announced in a statement issued by the World bank.\nAccording to the statement, the approval was granted on Thursday, and the fund is expected to be used to finance easier access to vaccines for Nigeria.\nThis will be implemented as part of the COVID-19 Preparedness and Response Project,” the statement reads.\n“The additional financing will allow Nigeria purchase and deploy COVID-19 vaccines, strengthen relevant health systems that are necessary for a successful deployment and to prepare for future health emergencies."
  },
  {
    "headline": "NCDC records 55 deaths new deaths as suspected cholera cases exceed 81,000",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed 1,825 new suspected cases of cholera, bringing the country’s current total to 81,413.\nWith suspected cases now reported in 28 states and the federal capital territory (FCT), a total of 2,791 deaths have also been recorded.\nAdvertisementThe NCDC also said Rivers, which is the latest addition to the list, had a backlog of suspected cases which were reflected in the current report.\nAdvertisement“There was a 38% decrease in the number of new suspected cases in week 37 (1,825) compared with week 36 (2,955).\n“No new state reported cases in week 37 and Rivers was added to reflect the backlog in early reporting.”"
  },
  {
    "headline": "NCDC records 55 deaths new deaths as suspected cholera cases exceed 81,000",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed 1,825 new suspected cases of cholera, bringing the country’s current total to 81,413.\nWith suspected cases now reported in 28 states and the federal capital territory (FCT), a total of 2,791 deaths have also been recorded.\nAdvertisementThe NCDC also said Rivers, which is the latest addition to the list, had a backlog of suspected cases which were reflected in the current report.\nAdvertisement“There was a 38% decrease in the number of new suspected cases in week 37 (1,825) compared with week 36 (2,955).\n“No new state reported cases in week 37 and Rivers was added to reflect the backlog in early reporting.”"
  },
  {
    "headline": "Irabor: Division present in Nigeria's polity won't be allowed in the military",
    "summarized_story": "Lucky Irabor, chief of defence staff, says opinions that promote division in Nigeria’s polity won’t be encouraged in the military.\nAdvertisementThe CDS, who spoke at a meeting with journalists, said troops will be unrelenting in their efforts to ensure that they protect Nigeria’s integrity.\nHe, however, enjoined the media to be careful about publishing reports and articles that may pass across information liable to cause disunity in the military.\nIrabor said going by the administrative procedures in the army, officers will do everything possible not to allow division to affect the fight against insurgency and banditry.\nSpeaking on the incident at the meeting on Wednesday, the defence chief said it wasn’t “strictly” a banditry attack."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "What can Nigerians do on the new eNaira website?",
    "summarized_story": "The website of Nigeria’s official digital currency, eNaira, went live on Monday, four days before its planned launch on October 1, as disclosed by Central Bank governor, Godwin Emefiele.\nA welcome note on the website describes the eNaira as a “Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira.”The website is a central repository where users can find comprehensive information about the official digital currency, but it offers much more than just details of the eNaira.\nDownload the eNaira applicationThe eNaira app (termed “Speed”) can be downloaded from either the Google PlayStore, Apple App Store, or by scanning a QR code on the website.\nJoin the eNaira communityThe community is a social hub where, according to a note on the website, eNaira users across the globe can connect with one another, share their experiences using the digital currency, offer as well as request help.\nThe eNaira website is loaded with very important information and instructions as well as answers to potential questions in the FAQ section."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "#TwitterBan update: Should you worry if Twitter succumbs to Nigerian government’s demands?",
    "summarized_story": "Share this article:Again, Nigerians have been promised the lifting of the four-month-long Twitter ban.\nRecall that in early June 2021, the Nigerian government indefinitely suspended Twitter after the platform removed a Tweet by the president for violating its rules.\nTo that end, it is awaiting a response on three final requests made to the social media platform, which are registration, physical presence in Nigeria, and fair taxation.\nAfter all, it appears to be what the social media company would have agreed to before establishing an office in any country.\nTrue to this, the country is one of the African countries without any case of Internet censorship or government-influenced social media censorship."
  },
  {
    "headline": "Independence Day Musings: Nigeria’s proposed startup bill cannot afford to fail",
    "summarized_story": "A startup act is a piece of legislation meant to create an enabling environment for high growth technology-enabled businesses, i.e.\nWho wouldn’t love government salaries for founders and tax breaks for eight years, as found in Tunisia’s Startup Act 2018?\nNigeria’s proposed Startup Bill seeks to harmonise these existing laws and provide relevant innovation-friendly updates that would boost startup activities in the country.\nBack to Table of Content ↑Key details about Nigeria’s proposed startup actRoughly six days after TechCabal’s publication, the website for the Nigerian Startup Bill went live.\nWhile asking hard questions on implementation, both Olagunju and Sarumi are wary of using the Startup Act for vanity metrics."
  },
  {
    "headline": "More on NFTs, MIT’s prosthetic limbs project, Facebook’s Internet connectivity plan",
    "summarized_story": "Today I’m discussing:More on NFTsMIT’s 3D-printed prosthetic limbs in Sierra Leone2Africa Cable and Internet connectivityMore on NFTsNon-fungible tokens (NFTs) are digital assets that represent physical objects such as art, music, in-game items, and videos.\nAdvertisementAlthough they have been around since 2014, NFTs are gaining popularity as a popular way to buy and sell digital artwork.\nAccording to Facebook, when they are completed, the extension will make 2Africa the world’s longest subsea cable system.\nIn May 2020, Facebook announced plans to build a $1 billion undersea Internet cable for faster Internet access in Africa.\nFor context on Subsea Internet Cables in Africa, please, read: Subsea Internet cables and the race to connect Africa to the InternetWhat I’m reading and watchingGoogle Maps is making it easier to see wildfires and tree coverage."
  },
  {
    "headline": "Competence, not region, should determine Nigeria’s next president – Sanusi",
    "summarized_story": "Muhammadu Sanusi, the former emir of Kano and one-time Central Bank of Nigeria (CBN) governor, said in an interview on Arise TV on Friday that Nigeria must worry more about the competence of the next President rather than his region.\nNational Assemblies are not doing their jobs as required; that is the problem,” Sanusi stated.\nSanusi said that progressive countries like the United States of America do not worry about where the president comes from.\nRead Also: 2023: Who wants to be Nigeria’s next president?\nSanusi urged Nigerians to insist on character and competence and not the region the next president comes from."
  },
  {
    "headline": "How flawed elections cripple democracy in Nigeria since independence",
    "summarized_story": "Martin Onovo laments the failure of the nation’s electoral process to positively affect its democracy.\n“Nigeria’s electoral process is still at the infancy stage because of the abnormalities displayed by the electoral actors.\n“As it is, the electoral process in this system still lacks transparency, fairness, and credibility.\nOnce an electoral process lacks these three ingredients, it remains a charade in its totality,” Okunade states further.\nThe earlier it is permanently addressed, the better for Nigeria,” Onovo adds."
  },
  {
    "headline": "Nigeria stagnant as world races towards knowledge-based economy",
    "summarized_story": "A broken educational system and dearth of opportunities abound in a global race for the skills that would make them competitive in a knowledge-based economy.\nExperts say a knowledge-based economy relies more on intellectual capabilities than natural resources to enhance economic growth and development.\nTo achieve the UAE vision of developing a diverse and flexible knowledge-based economy, it developed its Vision 2021 plan in 2010.\nHowever, Nigeria has made very little progress in innovation towards its transition to a knowledge-based economy.\n“The Nigerian government has not really seen the importance of having a knowledge-based economy."
  },
  {
    "headline": "President Buhari’s Independence Day Address – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestINDEPENDENCE DAY ADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA ON THE OCCASION OF NIGERIA’S SIXTY FIRST INDEPENDENCE ANNIVERSARY, FRIDAY 1ST OCTOBER, 2021.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nEarlier this year, I launched the Integrated National Security and Waterways Protection Infrastructure, the Deep Blue Project, which is designed to secure Nigerian waters up to the Gulf of Guinea.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "PDP will return to power in 2023 – Wike …Receives Nwuke, Deeyah, others APC, AAC decampees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHarcourt Port – Rivers State governor, Nyeson Ezenwo Wike says Peoples Democratic Party (PDP) elected governors are working in unison to ensure that the party wins the presidential election in 2023.\nThe governor stated that PDP in the State has never been owned by an individual as is the case with the APC.\nAnd he challenged the remnants of the APC to mention what Federal government has done for Rivers state in the last six years.\nLet nobody bother himself, PDP will take over Rivers State again because it is very obvious.\nFormer Rivers State APC spokesperson, Ogbonna Nwuke, said in the last six years they have been in the wilderness."
  },
  {
    "headline": "BOWFT Update: Naija Ratels, others get consolation prizes, as overall prize money increases* – Nigerian Observer",
    "summarized_story": "The teams that got their consolation prizes were; Heartland Queens of Owerri, Naija Ratels of Abuja, Rolly Angels of Benin City, Fortress Ladies of Benin City, Royal Queens of Warri, Sunshine Queens of Akure, Confluence Queens of Lokoja, and Kaduna Queens.\nShe saw it all by herself in company of the Sports-loving Deputy Governor of Edo State, Rt.\nThe prize money for the fourth place winners is newly created.\nThe semi finals will be played on Saturday, October 2, at the Samuel Ogbemudia Stadium, with Bayelsa Queens slugging it out against FC Robo in the first semi finals at 3pm and Edo Queens battle against Rivers Angels in the second semi finals at 5pm.\nThe grand finale and closing ceremony hold on Sunday, October 3, at the Samuel Ogbemudia Stadium at 5pm."
  },
  {
    "headline": "BOWFT: Edo Queens thrash Heartland, set up semifinals clash with Rivers Angels …Mrs Shaibu Impressed with Tourney – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Queens put an impressive performance today as they thrashed Heartland Queens 5-0 in the last match of Group A to set up a semi finals clash with NWFL champions Rivers Angels.\nThe coach Matthew Wmimo led Edo Queens could not have settled for anything less than such a 5-star performance as they played as they played in the presence of the Deputy Governor of Edo state and the first lady Betsy Obaseki.\nEdo Queens took the Owerri girls to the cleaners with five unreplied goals,courtesy Emmem Essien’s brace, Elizabeth Zirike’s second half long range stike and two ealy goals from Rebecca Ajumudaand Adaobi Okah respectively.\nEdo Queens won all their three group games with 10 goals scored .\nShe highlighted the huge benefits of the tournament to include continuous fight against girl child trafficking and abuse and promotion of women football in the country."
  },
  {
    "headline": "SPECIAL REPORT: Since independence, Nigeria’s per capita income highest under Jonathan, Yar’Adua",
    "summarized_story": "Per capita income since independenceAt $2,792, Nigeria made the highest average per capita income under Goodluck Jonathan.\nThe years between 2002 and 2020 returned the highest per capita income, with 2012 to 2014 having the highest respective returns.\nNigeria lags behindSome countries that were economic peers of Nigeria have been able to ramp up their per capita income over the years, but Nigeria has not.\nFor instance, in 1990 Nigeria’s per capita income was around $568, about two times China’s $348.\nBut economists discourage comparing a country’s per capita income with another’s because many variables determine the figure."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Name sponsors Boko Haram, herdsmen – Yoruba group tells Buhari",
    "summarized_story": "Recall that Buhari had in his speech, said that his government had conducted investigations revealing the financiers of agitators in the Southeast and Southwest.\nWe are vigorously pursuing these financiers including one identified as a serving member of the national assembly.\nPresident said an unknown Sitting Member of the Nigerian National Assembly is involved in the funding of Sunday Igboho.\nThe Yoruba people from villages to villages to the Diaspora are contributing their hard-earned resources to oil and sustain the agitation.\n“Our appeal to Buhari is to, as a matter of urgency, name the invincible national assembly member so that the Yoruba People can celebrate him because he is supporting a NOBLE STRUGGLE."
  },
  {
    "headline": "United States govt congratulates Nigeria on 61st independence anniversary",
    "summarized_story": "OBINNA EZUGWUThe United States government has congratulated Nigeria on the occasion of her 61st independence anniversary, hailing the strong partnership between the two countries.\nNigeria, which got independent from Britain on October 1st, 1960, clocked 61 years as an independent country on October 1st, 2021.\n“On behalf of the United States Government and the American people, I extend best wishes to the people of Nigeria on the 61st anniversary of their independence,” he said.\n“The strong partnership between our two countries is based on our common commitment to democracy and diversity, and a shared spirit of entrepreneurship.\n“The United States looks forward to expanding our relationship over the coming year and advancing our mutual interests.”"
  },
  {
    "headline": "Buhari spoke about IPOB, Igboho’s sponsors, but failed to mention Boko Haram, bandits financiers – Activist",
    "summarized_story": "Adeyanju noted that Buhari needs prayers for saying his administration has performed better than previous democratic governments since 1999.\nThe statement, titled, ‘Buhari mocked Nigerians with his Independence Day speech –Adeyanju’, was obtained by SaharaReporters on Friday.\n“It is beyond sad to hear president Buhari commending the military for failure in his Independence Day speech.\n“The president also said he has discovered sponsors of IPOB and Oduduwa agitators but failed to talk about sponsors of Boko Haram that Dubai revealed recently because they are from his zone.\nIt is unthinkable that the president of a nation should openly peddle so much falsehood as Buhari has just done."
  },
  {
    "headline": "Hoodlums enforcing IPOB sit-at-home kill one in Imo",
    "summarized_story": "Hoodlums enforcing enforcing a sit-at-home order issued by the Indigenous People of Biafra (IPOB) have killed a drive in Imo State.\nMike Abattem, police spokesperson, in the state, has not responded to a request to comment on the incident.\nChima Okoronkwo, a resident in the area, called on the government to urgently end the killings in the state.\nThe proscribed group had said the order is in solidarity with Ambazonia, a secessionist group in Cameroon, whose purported independence anniversary is on October 1.\nThe sit-at-home order has grounded commercial activities in Imo state with major roads and public places deserted."
  },
  {
    "headline": "Anniversary: X3M Ideas Revamps Oregun High School’s Laboratory",
    "summarized_story": "The World Bank said the number of scientists and engineers in sub-saharan Africa are very low compared to more industrialised countries.\nSteve said, “Over 40 per cent of the roughly 200 million residents in Nigeria, Africa’s most-populous country, are youths.\nConfident, fervid and enterprising, they want to chart their own course and are hopeful for the future of the nation.\nConsidering how important STEM is to the growth and development of Nigeria, the number of graduates in scientific disciplines is horribly low.\nWe’re aiming to drive a change in this regard by enabling the science-related dreams of the students in Oregun Junior High.”For nine years, X3M Ideas has consistently delivered impactful social intervention projects."
  },
  {
    "headline": "Anniversary: X3M Ideas Revamps Oregun High School’s Laboratory",
    "summarized_story": "The World Bank said the number of scientists and engineers in sub-saharan Africa are very low compared to more industrialised countries.\nSteve said, “Over 40 per cent of the roughly 200 million residents in Nigeria, Africa’s most-populous country, are youths.\nConfident, fervid and enterprising, they want to chart their own course and are hopeful for the future of the nation.\nConsidering how important STEM is to the growth and development of Nigeria, the number of graduates in scientific disciplines is horribly low.\nWe’re aiming to drive a change in this regard by enabling the science-related dreams of the students in Oregun Junior High.”For nine years, X3M Ideas has consistently delivered impactful social intervention projects."
  },
  {
    "headline": "Nigeria @ 61: Buhari’s Address Worst In Country’s History, Says PANDEF",
    "summarized_story": "The Pan Niger Delta Forum (PANDEF) has described the Independence Day address by President Muhammadu Buhari to Nigerians on October 1, as the worst in the history of the country.\nPANDEF, in a statement made available to LEADERSHIP on Friday in Port Harcourt by its spokesman, Ken Robinson, stated that the President’s Independence Day speech reverberated the bigotry and nepotism of the present administration.\nThe statement reads in part: “This year’s Independence Day speech by President Muhammadu Buhari can easily be deemed the worst independence day speech in Nigeria’s history.\nReports of the horrendous activities of Bandits, Insurgents and Herders are upsetting and terrifying.\n“This independence day speech reverberates the bigotry and nepotism of the Buhari administration."
  },
  {
    "headline": "Nigeria @ 61: Buhari’s Address Worst In Country’s History, Says PANDEF",
    "summarized_story": "The Pan Niger Delta Forum (PANDEF) has described the Independence Day address by President Muhammadu Buhari to Nigerians on October 1, as the worst in the history of the country.\nPANDEF, in a statement made available to LEADERSHIP on Friday in Port Harcourt by its spokesman, Ken Robinson, stated that the President’s Independence Day speech reverberated the bigotry and nepotism of the present administration.\nThe statement reads in part: “This year’s Independence Day speech by President Muhammadu Buhari can easily be deemed the worst independence day speech in Nigeria’s history.\nReports of the horrendous activities of Bandits, Insurgents and Herders are upsetting and terrifying.\n“This independence day speech reverberates the bigotry and nepotism of the Buhari administration."
  },
  {
    "headline": "October 1: NISCN Felicitates With Nigerians, Calls For Collaboration",
    "summarized_story": "The National Industrial Safety Council of Nigeria (NISCN), has congratulated all Nigerians on the country’s 61st independence anniversary while assuring commitment to industrial safety in the country.\nThe council noted that it will continue to carry out these duties within the framework of its responsibilities.\n“We call on governments to show more commitment to tackling and eradicating all forms of challenges – be it political, socio-economic and all diverse problems facing industrial safety in the country,” the statement said.\nWhile wishing Nigerians a fruitful independence celebration, the council reminded Nigerians the fact that the nation’s founding fathers, in spite of the differences in faith, tribe and tongue came together for Nigeria’s independence.\nNational Industrial Safety Council of Nigeria was established as a tripartite organisation, to boost the awareness-raising and advocacy component of the Ministry of Labour and Productivity mandate in Occupational Safety and Health."
  },
  {
    "headline": "Ohanaeze to IPOB: Disband ESN now",
    "summarized_story": "The Ohanaeze Ndigbo Worldwide, Youth wing, has called on the leadership of the Indigenous People of Biafra, IPOB, to redeem itself from the reports of the attacks in the Igboland by disbanding the Eastern Security Network, ESN, an armed group of the IPOB.\nThe acting National Leader of the Ohanaeze Youth wing, Jones Onwuasonya, made this call in Owerri on Friday, regarding the level of violence recorded since the formation of the group.\n“This situation leaves no doubt that the leadership of the IPOB has either lost control of the situation or some fifth columnists have hijacked the initiative and are now hiding under its the Biafran agitation to wreak havoc across the Southeast.\nIt, therefore, becomes pertinent to invite the IPOB leadership to take steps towards quickly redeeming herself.\n“By disbanding the Eastern Security Network (ESN), as it remains an illegal militant and armed group."
  },
  {
    "headline": "Ohanaeze to IPOB: Disband ESN now",
    "summarized_story": "The Ohanaeze Ndigbo Worldwide, Youth wing, has called on the leadership of the Indigenous People of Biafra, IPOB, to redeem itself from the reports of the attacks in the Igboland by disbanding the Eastern Security Network, ESN, an armed group of the IPOB.\nThe acting National Leader of the Ohanaeze Youth wing, Jones Onwuasonya, made this call in Owerri on Friday, regarding the level of violence recorded since the formation of the group.\n“This situation leaves no doubt that the leadership of the IPOB has either lost control of the situation or some fifth columnists have hijacked the initiative and are now hiding under its the Biafran agitation to wreak havoc across the Southeast.\nIt, therefore, becomes pertinent to invite the IPOB leadership to take steps towards quickly redeeming herself.\n“By disbanding the Eastern Security Network (ESN), as it remains an illegal militant and armed group."
  },
  {
    "headline": "Fintech 5.0: Evaluating how FirstBank strengthens collaboration",
    "summarized_story": "Tagged Fintech Summit, the annual engagement has continued to help in catalysing the fintech sector to ever-higher levels from year to year.\nHeld in Lagos the commercial capital of Nigeria and arguably the fintech capital of Africa, given Nigeria’s status as the leading nation in the fintech space in Africa, the annual FirstBank Fintech Summit has attracted an average of a thousand participants, who are mostly fintech owners, workers and enthusiasts, yearly.\nLast year’s Summit, Fintech Summit 4.0 with the theme“How Blockchain and Artificial Intelligence will Disrupt Fintech in Nigeria”, however, drew an unprecedented number of participants – over 6,000 from across 52 different countries.\nFirstBank through the Firstmonie platform further supports the fintech industry via partnership collaborations with local and international fintechs.\nThis relationship climaxes every year in the annual Fintech Summit and the forthcoming Fintech Summit 5.0 promises to take the relationship to a whole new dimension."
  },
  {
    "headline": "Three Ghanaians, one Nigerian kidnapped in Akwa Ibom community",
    "summarized_story": "Gunmen suspected to be sea pirates on Thursday attacked and abducted four fishermen in Ibaka, Mbo Local Government Area of Akwa Ibom State.\nThey were kidnapped just behind the Nigerian Navy FOB Base in Ibaka waterways on their way to the sea for fishing expedition.\n“They attacked four separate boats, stole their outboard engines and kidnapped four persons, among whom were three Ghanaians and one Nigerian who are currently in their custody.\n“The activities of these sea pirates have crippled the Ibaka fishing community and its environs, as fishermen could not go for fishing due to the fear of being attacked.\n“In Ibeno last week, more than 10 outboard engines were seized by the sea pirates."
  },
  {
    "headline": "OAU students ordered to vacate hostels by noon Saturday, school shut",
    "summarized_story": "By Dorcas Elusogbon/Ile-IfeStudents of Obafemi Awolowo University, Ile Ife have been ordered by the authorities to vacate the hostels by noon Saturday following a protest over the death of a student.\nAll students have been directed to vacate their halls of residence and the campus, latest by noon on Saturday, 2 October, 2021.\nHe said the lady reported to the university’s Health Centre with signs and symptoms of a severe infection.\nShe reported back to the Health Centre in the morning of Thursday, 30th September, 2021.\nIn the meantime, the University management has put in place a machinery to unravel the circumstances surrounding the immediate and remote cause(s) of the students’ protests."
  },
  {
    "headline": "U.S. surpasses 700,000 COVID-19 deaths",
    "summarized_story": "The United States surpassed 700,000 COVID-19 deaths on Friday, with Brazil and India not too far behind.\nWhile Brazil has recorded 597,255 deaths, the world’s second highest fatalities, India has logged 448,605.\nThe highly transmissible Delta variant has driven a surge in COVID-19 cases that peaked around mid-September before falling to the current level of about 117,625 cases per day, based on a seven-day rolling average.\nOn Friday the U.S. Centers for Disease Control and Prevention said the country has administered 393,756,866 doses of COVID-19 vaccines and distributed 477,069,555 doses.\nThose figures are up from the 392,909,995 vaccine doses the CDC said had gone into arms by Thursday out of 474,245,945 doses delivered."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Ten persons were burned alive at the Kachiwe hamlet in the Munya Local Government Area of Niger State by gunmen suspected of being bandits.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women.\nThe people could not reach out to the security agencies neither could they reach out to the council."
  },
  {
    "headline": "You Were A Child When We Negotiated Independence, Afenifere Leader Slams Buhari Over Speech",
    "summarized_story": "The President; Major General Muhammadu Buhari; Afenifere Leader Chief Ayo Adebanjo; Afenifere Leader Chief Ayo Adebanjo; Afenifere Leader Chief Ayo Adebanjo (retd.)\nAfenifere leader, Chief Ayo Adebanjo, has lambasted the President, Major General Muhammadu Buhari (retd.\n“When we got to that conference, Chief Awolowo re-educated them that you cannot run the country as a unitary system.\nIt was in the Daily Times of 1954.”The Afenifere leader said that the 1960 Constitution gave all the regions financial autonomy, such that every region was able to control its own destiny.\nThe Afenifere leader also lambasted Vice-President Yemi Osinbajo and the All Progressives Congress leader, Bola Tinubu, for paying lip service to restructuring."
  },
  {
    "headline": "Nigeria At 61: Ortom Lists Bandits, Terrorists, Failed Economy As Reasons Citizens Shouldn’t Celebrate.",
    "summarized_story": "Given the worst occurrences of insecurity in the country under President Muhammadu Buhari’s administration, Benue State Governor Samuel Ortom said there was nothing to rejoice about Nigeria at 61.\nWhat are we celebrating, bandits, kidnappers, herdsmen, insurgents, failed economy or what?\nThe truth is that we have nothing to celebrate as a people because we the leaders have failed this country.\nHe revealed that over 100 security operatives were killed by Fulani Herdsmen turned bandits in the course of securing lives and properties in Benue State between 2017 till date.\nBut we must keep fate in our country Nigeria, because it is God that brought us together in the mist of our diversity."
  },
  {
    "headline": "Nigerians Will Prefer Islamic Rule — IMN Leader, El-Zakzaky",
    "summarized_story": "Sheikh Ibraheem El-Zakzaky, the head of the Islamic Movement in Nigeria (IMN), has stated that if given the opportunity, most Nigerians will choose the Islamic system of administration over the neocolonial system of government.\n“I believe that if there will be a plebiscite in this country and people will be asked ‘which system would you like?’ Is it the status quo, which is inherited from the British colonialists or the Islamic system?\n“I’m sure that the majority will choose the Islamic system.\n“However, this depends on the people being given the choice similar to what happened in Iran with the referendum that followed the victory of the country’s Islamic Revolution in 1979.\n“Nigerian authorities admit in private not in public, that they fear the Islamic Movement and the potential that it may help establish the Islamic system just as the Revolution in Iran."
  },
  {
    "headline": "VIDEO: Ex-Lagos governor, Asiwaju Bola Tinubu, receives Northern House of Reps Caucus in London",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Ex-Military governor in Delta, Cross River is dead",
    "summarized_story": "A former Military administrator of Delta and Cross River states, Commodore Ibrahim Kefas (Rtd), has died.\nKefas served as administrator of both states at different times under General Sani Abacha who was then Nigeria’s President.\nBlueprint reports that Kefas, passed on on a day Nigeria marked her 61st anniversary of independence.\nDetails loading…"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari, Vice President Yemi Osinbajo, others mark Nigeria’s 61st Independence anniversary",
    "summarized_story": ""
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "NCAA refutes ban on travelers without proof of vaccination -NigPilot",
    "summarized_story": "Nigerian Civil Aviation Authority , NCAA has refuted trending reports that the Federal Government through the NCAA has given a directive that from December 1 this year, travelers without proof of vaccination would not be permitted to board both local and international flights.\nThe NCAA in a statement issued on Thursday by its General Manager, Public Relations, Sam Adurogboye, Authority stated that it did not give any such directive.\n“On the other hand, we want to enjoin purveyor of such unfounded news to cross-check facts before publishing.\n“Meanwhile, the Authority will continue to support all Federal Government initiatives to curb the spread of the Delta variant.\n“However, we expect strict adherence to safety protocols in and out of the airports by wearing our facemask, washing our hands periodically, using alcohol-based hand sanitizer, maintaining social distance and avoiding crowded space,” the statement read."
  },
  {
    "headline": "Troops kill 479 terrorists, bandits in September -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ), on Thursday, said that troops in all theatres of operation killed no fewer than four hundred and seventy-nine (479) Boko Haram/Islamic State of West African Province ISWAP terrorists and bandits in the month of September.\nThis is in addition to the one hundred and five (105) terrorist fighters and bandits that were arrested in September.\n“Troops of Operation HADIN KAI sustained the operational tempo in land and air offensives against terrorists and other criminal elements in the North East theatre.\nCumulatively, a total of 85 BHT/ISWAP terrorists were neutralized and 43 terrorists including their collaborators and logistics suppliers were arrested in the course of the various operations.\nAlso, 47 armed bandits, informants and bandits’ collaborators were arrested within the period,” he also revealed."
  },
  {
    "headline": "Nigeria@61: Young Nigerians Share Thoughts On Youth Participation In Politics, Leadership – Channels Television",
    "summarized_story": "﻿Six young Nigerians on Friday shared their thoughts on the participation of youths in politics and leadership in the country.\nDoes our infrastructure, do our health care and many other things look like N300tn has passed through us?\nKate HenshawA lot of people have run away because of the term ‘dirty politics’ and that is so wrong because we need to get involved.\n‘Money Politics’: Can young people thrive without money?\nThe second thing you must look at is integrity… After that you look at other things; what is your love for the nation?"
  },
  {
    "headline": "OAU Shut Down After Protests Over Student’s Death",
    "summarized_story": "The management of the Obafemi Awolowo University (OAU), Ile-Ife in Osun State, has closed down the school “until further notice” following protests that rocked the varsity in the aftermath of a student’s death.\n“In view of this, all students are hereby directed to vacate their halls of residence and the Campus latest by 12:00 noon on Saturday, 2nd October 2021.”The swearing-in ceremony of newly-elected Students’ Union members has also been suspended, the statement added.\nRELATED: UNIBEN Students Block Highway, Protest Increased Late Registration Fee“In the meantime, the University management has put in place the machinery to unravel the circumstances surrounding the immediate and remote cause(s) of the crisis,” it said.\n“She was promptly treated with some drugs prescribed and asked to report back as an out-patient.\nShe reported back to the Health Centre in the morning of Thursday, 30th September 2021."
  },
  {
    "headline": "Nigeria’s 61st Independence Day Celebration In Photos",
    "summarized_story": "Nigeria, on Friday, marked its 61st Independence Day anniversary with a ceremonial parade in the nation’s capital, Abuja.\nThe parade, which was witnessed by President Muhammadu Buhari and other dignitaries present at Eagle Square, was also broadcast live on national television.\nMany cheered throughout the performance, particularly when some military personnel blindfolded, dismantled firearms, and reassembled them with great showmanship.\nThe event’s acrobatic shows, punctuated with both contemporary and cultural dance displays, delighted the audience too.\nBelow are photos from the parade as taken by Channels TV’s Sodiq Adelakun:"
  },
  {
    "headline": "President Buhari’s Full 61st Independence Anniversary Speech",
    "summarized_story": "INDEPENDENCE DAY ADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA ON THE OCCASION OF NIGERIA’S SIXTY-FIRST INDEPENDENCE ANNIVERSARY, FRIDAY 1ST OCTOBER, 2021.\nIt is with full gratitude to God that today, we celebrate Nigeria’s sixty-first Independence Anniversary.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "We Have Not Had Time To Sit And Think As A Nation – Ighodalo",
    "summarized_story": "﻿The Senior Pastor of Trinity House, Pastor Ituah Ighodalo on Friday said Nigerians have not had time to sit and think as a nation.\nHe stated this during Channels Television’s special programme, ‘[email protected]: Thoughts on leadership,’ to mark Nigeria’s Independence Anniversary.\nAccording to him, several Nigerian leaders were either accidental leaders or had limited time to define what Nigeria should be.\n“Everybody has to sit at the table and we have to discuss,” the cleric maintained.\n“I hope that with time and with democracy we will be able to get the cream of the crop as leaders,” he added."
  },
  {
    "headline": "Enugu Residents call on FG to address challenges",
    "summarized_story": "As Nigeria marks her 61st independence anniversary, from the colonial administration, expectations are high across the country, as the people look forward to a better future.\nSouth East region witnesses a sharp contrast of what independence anniversary ought to be, having it’s social economic activities grounded, with the streets, markets, offices and Banks deserted.\nIn Anambra state, the annual independence rituals were boycotted due to restriction of movement order issued by members of the Proscribed Indigenous People of Biafra (IPOB).\nEnugu state too is not different, sighting only security patrol teams, moving about to ensure safety.\nThe residents are clear in the demands, requesting that government should initiate a dialogue with the IPOB, as measure to douse the tension in the South East region of Nigeria."
  },
  {
    "headline": "Zamfara Govt restores telecommunication services in Gusau after four weeks -",
    "summarized_story": "Zamfara state government has restored Telecommunication Services in Gusau, the state capitalThe state Commissioner for Information Ibrahim Dosara confirmed the development to TVC News on Friday.\nHe said the move is to ease the hardship residents are passing through in terms Communication and financial transactionsHe also added that the move becomes necessary considering the successes recorded so far in addressing the problem of Banditry.\nThe development is coming after four weeks of total shutdown of Telecommunication Services in the state to allow security operatives carryout operation against bandits in their enclaves."
  },
  {
    "headline": "Be proud to be Nigerians and work for its greatness, Makinde urges citizens",
    "summarized_story": "Governor of Oyo state, Seyi Makinde has urged citizens and people of the state to be proud citizens of Nigeria and work for the greatness of the country.\nAccording to her, As we celebrate Nigeria’s 61 years today, we should tap our chests with joy and be proud to be Nigerians.\nThere is a lot to be proud about and we all need to remember that we will do it together.\nTogether the government and the good people of Oyo state will make Nigeria better.\nWe thank God for the improved security in our state, and we will continue to ask you that together let’s work together to continuously make our security situation under continue."
  },
  {
    "headline": "Protesters storm Ojota in Lagos, complain about insecurity, Others -",
    "summarized_story": "Protesters under the banner of #TakeItBack Movement and #RevolutionNow have stormed the Gani Fawehinmi Park in Ojota, Lagos.\nThe protesters registered their displeasure against insecurity, poor economy, lawlessness, and other challenges in the country.\nSecurity operatives including RRS officers, over 10 hilux vehicles of the Nigeria Police Force were sighted at the venue of the protest.\nSecurity operatives were also stationed around Maryland axis to forestall any breakdown of order.\nThe Protesters were however later dispersed by Security Operatives and the situation around the area has now returned to normal with vehicular traffic and business activities now on."
  },
  {
    "headline": "Bismarck Rewane: Borrowing for Real Infrastructure Development Will Kickstart Economy",
    "summarized_story": ""
  },
  {
    "headline": "Sule Lamido: Politics of Ethnicity is the Root of Nigeria’s Problems",
    "summarized_story": "Former Jigawa governor and ex-Foreign Affairs Minister, Sule Lamido, discusses the political evolution of Nigeria since independence…Watch the interview for more…"
  },
  {
    "headline": "Muhammadu Sanusi II: Zoning May Leave Nigeria with Two Useless Presidential Candidates in 2023",
    "summarized_story": "His Royal Highness Muhammadu Sanusi II is a man for all seasons.\nHe has seen it all and has remained true to himself and his beliefs, despite external pressure or influence.\nPrior to his enthronement as the 57th emir of the ancient city of Kano, Sanusi was an Islamic intellectual, academic, political economist and banker.\nEarly this year, Sanusi was appointed the spiritual leader of the Tijanniyah Sufi order in Nigeria and given the title Khalifa Sanusi II.\nAs the leader of the Tijaniyyah Sufi order, he has political and spiritual authority over the second largest Sufi order with over 30 million adherents."
  },
  {
    "headline": "A Look at Nigeria’s Nationhood, 61 Years after Independence",
    "summarized_story": "Nigeria is marking its 61st Independence Day, an anniversary of its freedom from the British colonial government.\nBut over six decades after Africa’s most populous country became free politically, there are questions about the democratic freedom of the people of Nigeria.\nThere are also growing concerns over the inability of the country to cater to the needs of its huge population and the lopsidedness of its federalism which is threatening its unity.\nThis special report focuses on Nigeria’s nationhood, 61 years after independence…"
  },
  {
    "headline": "Nigeria Records 6% Increase In Air Transport As 5.3m Passengers Travel In Q1 2021",
    "summarized_story": "About 5.3 million passengers travelled through Nigerian airports in the first half of 2021 as against 4.9 million recorded in the first half of 2020.\nAccording to the report, a total of 5.3 million domestic passengers travelled by air between January and June 2021 (H1 2021).\nThis figure represented a 6 percent increase when compared to 4.9 million recorded in 2020.\nIt further said the Nnamdi Azikiwe Airport Abuja recorded a total of 1.94 million domestic passengers travelled accounting for 36.9 percent of the total passengers in H1.\nConsequently, for foreign movement statistics, arrival in Q1 2021 was 212,977 while passengers’ departure stood at 222,453 in the same quarter."
  }
]