[
  {
    "headline": "African Union suspends Sudan over military coup",
    "summarized_story": "The African Union said Wednesday it had suspended Sudan until civilian rule in the country is restored, saying it rejected the military takeover as an “unconstitutional” seizure of power.\nThe continent-wide bloc said it “strongly condemns the seizure of power” and was suspending Sudan from all AU activities “until the effective restoration of the civilian-led transitional authority”.\nPrime Minister Abdalla Hamdok was placed under military arrest, along with his ministers and civilian members of Sudan’s ruling council, sparking angry protests on the streets on Khartoum.\nA number of Western powers have called for an urgent meeting with Hamdok, saying they still recognise the prime minister and his cabinet as the constitutional leaders of Sudan.\nThe AU suspended Sudan in June 2019 after pro-democracy protesters demanding civilian rule were gunned down outside army headquarters in Khartoum."
  },
  {
    "headline": "NAFDAC to begin surveillance of drug hawkers in Kaduna",
    "summarized_story": "The National Agency for Food and Drug Administration and Control says preparations have been concluded to start massive surveillance on drug hawkers in Kaduna State.\n“Drug hawking is a serious violation of drug law hence the consumers should always purchase medicines from registered drug outlets.\n“The risks associated with patronising drug hawkers are dangerous and very lethal,” he said.\nMato said NAFDAC had been up and doing to educate and sensitise the unsuspecting consumers on the inherent dangers of patronising drug hawkers.\n“Drug hawkers must not be allowed to toy with the lives of the people,” he said."
  },
  {
    "headline": "Anambra Decides: Reconsider 7-day sit-at-home directive, Ohanaeze begs IPOB",
    "summarized_story": "“This is to enable the governorship election for Anambra State scheduled for November 6 to hold.\n“It is important to note that Anambra State is the economic live wire of the South East with an impressive steady growth trajectory.\nThe implication of the above illustration is that Anambra State is the melting pot of Igbo traders and artisans.\n“Ohanaeze Ndigbo urges the Governor of Anambra State, Chief Willy Obiano to convene a joint meeting of the Anambra State chapter of Ohanaeze Ndigbo led by Chief Emeka Udodeme and the Association of Town Union (ASATU) led by Barr.\nTitus Akpudo with a view to activating meetings in all the 181 towns of Anambra State."
  },
  {
    "headline": "Opposition to Declaring Bandits Terrorists: ACF, MBF, Ohanaeze, Afenifere, CAN rain knocks on Gumi",
    "summarized_story": "Those who criticised Gumi include the Arewa Consultative Forum, ACF; the Pan-Yoruba socio-political organization, Afenifere and the Middle Belt Forum, MBF.\nSheikh Gumi had, on Tuesday, warned that foreign jihadists would come into Nigeria if the federal government declared bandits terrorists.\n“His last testament that Nigeria will cease to exist if the Federal Government declares bandits terrorists is very unfortunate.\nH e said: ‘’I describe the man as a security threat to Nigeria.\n“Such people are more of security threat to the country, a green snake in green grass and a wolf in sheep’s clothing."
  },
  {
    "headline": "Tinubu’s capable of leading Nigeria — South-West govs",
    "summarized_story": "By Olasunkanmi AkoniChairman of the South-West Governors’ Forum and Ondo State Governor, Rotimi Akeredolu(SAN), has said that former Lagos State Governor and National Leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu, is capable of leading Nigeria.\nAkeredolu spoke on behalf of his colleagues during a visit to Tinubu’s residence at Bordillion in Ikoyi, Lagos State, on Tuesday.\nHe said the governors in the region believe in the leadership of the former Lagos State governor.\n“He is not only the leader of the Southwest but also the National leader of the APC in Nigeria.\n“But we in the Southwest first lay claim to him as our leader,” Governor Akeredolu said."
  },
  {
    "headline": "ABUAD Hospital successfully performs first kidney transplant",
    "summarized_story": "By Adesina WahabAfe Babalola University Multi-System Hospital, Ado-Ekiti, ABUAD, has recorded its first kidney transplant after a procedure that lasted five hours, fifteen minutes, thus making the successful transplant the first of its kind in Ekiti/Ondo axis of the country.\nWhen the patient got to ABUAD Multi-System Hospital in April, he was impressed with the way he was attended to after which he proceeded to make enquiries about kidney transplantation in ABUAD Hospital which commenced operation about three-and-half years ago.\nConvinced that his case would be resolved in ABUAD Multi-System Hospital, he started looking for kidney donors, but he was not immediately lucky to get one.\nIt was then the series of counselling session for both of us, the donor and recipient, began.\nAccording to Dr. Stephen Olawale Oguntola, the Coordinator of the Transplant Programme and Lead Nephrologist with the ABUAD Multi-System Hospital, “the transplant was done simultaneously on Wednesday, October 13, using a dedicated twin-transplant theatre right here in this Hospital, thus making it the first successful kidney transplant in Ekiti/Ondo axis of the country”."
  },
  {
    "headline": "PDP: Edo High Court denies restraining order on Orbih, others",
    "summarized_story": "By Ozioruva AliuBENIN CITY – THE Edo State High Court has denied issuing a restraining order on the National Vice Chairman, South-South of the Peoples Democratic Party (PDP) Chief Dan Orbih, State Secretary of the party Hilary Otsu, the member representing Oredo Federal Constituency, Hon Omoregie Ogbeide-Ihama and eight others from attending the PDP National Convention slated for later this week.\nA statement issued by the Court’s Chief Registrar, H.O Osawaru Esq in a statement with REF.\nEDJ/PRO/2021/VOL.11/130 reads in part “Let it be stated for record purposes that no such restraining order was issued by Hon.\nJustice J.O.\nThey also wanted the PDP to deny admittance of the defendants into the national convention"
  },
  {
    "headline": "‘Food has finally finished’ – Nigerians react as Fani-Kayode calls out Ahmed Gumi",
    "summarized_story": "Some social media users have lambasted former Aviation Minister, Femi Fani-Kayode for calling out the controversial Islamic cleric, Ahmed Gumi over his alleged support for bandits.\nThe post, however, triggered a backlash from Nigerians who stormed the comment section to lambast the former minister for calling out Gumi while supporting President Buhari’s government.\n“If Sheik Gumi calls you for food, you will become his praise singer.\nThe reason you posted this is for Sheik Gumi to recognize you and invite you for food”.\nBanditry: Arrest Gumi for threatening end of Nigeria – HURIWA to President Buhari"
  },
  {
    "headline": "Awards for Fayose, Oni, Adebayo, others not politically motivated – Fayemi",
    "summarized_story": "Governor Kayode Fayemi of Ekiti State has said that the impending state awards to be conferred his predecessors, Ayodele Fayose, Niyi Adebayo, Segun Oni, and 45 others, as well as a legal icon, Chief Afe Babalola (SAN), have no political undertone.\nJustifying that the 48 awardees were picked on merit, Fayemi said the illustrious Ekiti indigenes were deemed fit for their contributions to the state’s development in all facets.\nFayemi, who spoke through the Commissioner for Special Duties, Alhaji Ayodele Jinadu, revealed this on Wednesday at a press conference heralding the maiden edition of a state honour, tagged ‘Oni Uyi Awards 2021’, slated for October 30.\n“Governors Ayodele Fayose and Segun Oni are of PDP, but they have contributed their quotas.\nWhen it comes to the issue of development, Governor Fayemi is not political."
  },
  {
    "headline": "Gumi never speaks for victims, he’s only concerned when bandits affected – Omokri",
    "summarized_story": "Socio-political activist, Reno Omokri has accused Islamic cleric, Sheikh Ahmad Gumi of indulging in Public Relations for bandits.\n“How long shall a government that is after Igboho and Kanu continue tolerating the PR work Gumi is doing for terrorists bandits?\n“Gumi is an inspiration to these terrorists,” Omokri tweeted.\nThis is coming after Gumi had warned that it would be dangerous to declare bandits as terrorists.\nIgnore Gumi, declare bandits as terrorists – Afenifere tells Buhari"
  },
  {
    "headline": "Members’ $10bn trapped in scrapped DPR, PEFMB, PPPRA – Oil marketers cry",
    "summarized_story": "Nigerian oil marketers on Wednesday in Abuja cried out over their $10 billion trapped in the scrapped Federal Government-owned Department of Petroleum Resources (DPR), Petroleum Equalisation Fund Management Board (PEFMB), and Petroleum Product Pricing Regulatory Agency (PPPRA).\nThe oil marketers warned that unless their funds are recovered from the three scrapped government agencies, their obligations to the country might be completely jeopardized.\nA statement containing the agony of the oil marketers was signed by their President, Chief Chinedu Okoronko, and made available to our correspondent in Abuja on Wednesday.\nAccording to the association, Mauritz Walton Nig.\nGroup Executive Officer and Managing Director of Mauritz Walton Nig."
  },
  {
    "headline": "Tafawa Balewa’s daughter, others appointed heads of agencies in Bauchi",
    "summarized_story": "Governor Bala Abdulkadir Mohammed of Bauchi State has approved the appointment Dr Yalwa Tafawa Balewa, daughter of late Nigerian Prime Minister, Sir Abubakar Tafawa Balewa, as the new Head of Bauchi Agency for Orphaned and Vulnerable Children (BASOVCA).\nTafawa Balewa replaces Mrs. Hassana Arkila, who was suspended on 18th October 2021 over alleged misconduct.\nOthers are: Maula Aliyu; Zainab Rufai; Kefas Magaji; USA Babayo; Abubakar Salihu; Abubakar Faggo; Garba Kawu and Adamu Madaki.\n“The heads of agencies are – Babayo Madara, State Rural Water Supply Agency (RUWASSA), Dr. Sambo Alkali, Hospital Board and Yalwa Tafawa Balewa, Bauchi Agency for Orphaned and Vulnerable Children (BASOVCA).\n“Others are – Nasiru Hamma, Chairman, Bauchi State Nomadic Education Agency (BASANE), Dr. Abdurrahaman Idris, Executive Secretary, Muslim Pilgrims Welfare Board and Mas’udu Aliyu, Chairman, Drugs Consumables Agency,” the statement read."
  },
  {
    "headline": "NLC blocks Lagos-Abeokuta expressway in protest of its deplorable state",
    "summarized_story": "The Nigeria Labour Congress (NLC) Ogun chapter, on Wednesday in Sango-Ota, blocked the Lagos-Abeokuta expressway over the deplorable state of the highway.\nThe News Agency of Nigeria (NAN) reports that the NLC Lagos State chapter of the congress joined their Ogun counterpart to stage the protest.\n- Advertisement -The chairman said that the 21 days ultimatum given by NLC after the visit of Minister of Works and Housing, Babatunde Fashola to Sango-Ota, had lapsed.\nThe NLC Chairman in Lagos State, Mrs Funmi Sessi also said, “we believe in action and the time for talking is gone.\nShe said that members of the Lagos chapter of NLC came to partner with its colleagues in Ogun in the struggle to ensure that good roads were delivered to the people of the state."
  },
  {
    "headline": "100 people die in fighting between Islamist, army in Somalia",
    "summarized_story": "More than 100 people have died and 200 others have been injured in several days of fighting between government troops and Islamists in the East African country of Somalia.\nREAD ALSO: 144 Nigerian policemen in Somalia to boost security- Advertisement -According to the regional government, the Sufist militia had wanted to influence elections scheduled for next month.\nSomalia, which has been plagued by severe crises for decades, is due to hold parliamentary and then-presidential elections in November.\nThe term of office of the incumbent president, Mohamed Abdullahi Mohamed Farmajo, expired in February, but the elections were postponed due to disputes over election procedures.\n- Advertisement -Since then, there have been repeated tensions and conflicts between numerous interest groups."
  },
  {
    "headline": "Lagos approves laboratory for COVID-19 PCR tests",
    "summarized_story": "The Lagos State Ministry of Health has approved CoolSpring Molecular Laboratory, a medical diagnostic centre in Victoria Island, to carry out COVID-19 PCR tests.\nThe laboratory was approved following a rigorous accreditation and validation process by the Health Facility Monitoring and Accreditation Agency (HEFAMAA) and the Lagos State Biobank.\n- Advertisement -The Chief Medical Director, Faith City Hospital, Dr Austin Ebhomielen, parent company of CoolSpring Molecular Laboratory, stated: “We are excited to collaborate with the Lagos state government to fight COVID-19.”READ ALSO: Lagos distributes 500 life jacketsHe said that the accreditation will provide Lagosians with access to accurate and efficient COVID-19 PCR tests, thereby “increasing testing ability as a country and bringing us nearer to eliminating the pandemic.”- Advertisement -According to him: “The test results are guaranteed within 24-48hours after sample collection and results can be verified online.\nIn addition to onsite services, we provide home testing for individuals who require more privacy and need the service in the comfort of their homes.\nWe however assure and respect the privacy of all patients within and outside our facilities.”"
  },
  {
    "headline": "Five surest ways to pay off your debts",
    "summarized_story": "To pay off your nagging debts, here are steps to consider:* Create a Budget: The first step to relieving debt issues is to create a budget.\n- Advertisement -* Pay off the most expensive debt first: Evaluating the mountain hill of your debts can be depressing.\n- Advertisement -* Stop impulse buying: Buying while in traffic and window-shopping is a big no when you are servicing debts.\nTo pay off your debts on time, it makes sense to sell them off.\nThe extra you earn will go a long way in servicing the debts and meeting immediate needs."
  },
  {
    "headline": "PDP won’t zone presidency in 2023 –Saraki",
    "summarized_story": "By Chinelo ObogoFormer Senate president, Dr. Bukola Saraki, has said despite the fact that the Peoples Democratic Party (PDP) has zoned its national chairmanship to the North Central, it did not prevent any qualified aspirant from any zone from contesting the presidency in 2023.\nSpeaking on a national television programme monitored in Lagos, yesterday, the former Kwara State governor debunked speculations that the party would zone its presidency to the south since it zoned its national chairmanship to the north.\nMore importantly, the country is in a different place now and Nigerians have seen what the ruling party has to offer.\n“Because some people defected from the PDP to APC does not mean that I would defect.\nWe cannot afford to get it wrong in 2023 and PDP is in a better position to give credible leadership.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Alleged terrorism: UN writes Nigeria, Kenya over Kanu",
    "summarized_story": "The decision of the UN followed a petition by Kanu’s brother, Kanunta Kanu and his special counsel, Mr. Aloy Ejimakor.\nIn addition, the UN warned that it would take serious actions against the two countries should the allegations of torture and violation of fundamental human rights against Nnamdi Kanu are confirmed.\nThe statement made by Aloy Ejimakor read in part: “In particular, the said Urgent Appeals state in part that the United Nations is “alarmed by the alleged torture and ill-treatment Mr. Kanu has been subjected to during his illegal custody in Kenya.\nThe allegations in the case of Mr. Kanu raise serious violations of international human rights law and may cause irreparable damage to his life or personal integrity, which we believe warrants prompt attention.\nIn this regard, we are considering to publicly express our concerns in this case in the near future, believing that the wider public should be informed about the implications of these allegations for the enjoyment and exercise of human rights in Kenya and Nigeria."
  },
  {
    "headline": "Bauchi PDP demands probe of Justice Usman by NJC",
    "summarized_story": "An advertorial signed by chairman of the party in the state, Hamza Akuyam, said there was no vacuum in the national leadership of the party.\nHe spoke against the backdrop of reliefs granted by Justice Aliyu Usman on a matter that challenged the tenure of Prince Uche Secondus as party chairman, which he said had previously been denied by Justice Mohammed Sambowal.\n“There is therefore no vacuum in the leadership of the party and the planned convention will hold as scheduled despite all attempts by fifth columnists to thwart it.\nUpon refilling of the case, the state chief judge is required to assign the case to a new judge, no such was done in exact case.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "eNaira’ll help tackle illicit flow of funds –Buhari",
    "summarized_story": "We believe this and many other reforms, will help us increase the number of people participating in the banking sector, make for a more efficient financial sector and help us tackle illicit flow of funds.\nThese initiatives, coupled with our nationwide National Identification Number (NIN) exercise, reinforce our efforts to tackle corruption and fraud.\n“As we strive to build resilience towards a sustainable economy in our various countries, let us not forget the negative impact of climate change on our efforts to achieve this goal.\nNigeria and many countries in Africa, are already facing the challenges posed by climate change.\nClimate change has triggered conflicts, food insecurity, irregular youth migration, rising level of sea waters, drought and desertification, as well as the drying-up of the Lake Chad."
  },
  {
    "headline": "Cholera: Nigeria records 3,208 deaths, 88,704 cases in 10 months -Red Cross",
    "summarized_story": "Nigeria has recorded more than 88,704 cholera cases and 3,208 deaths in 2021.\nAbubakar Kende, secretary-general of the Nigerian Red Cross Society (NRCS) made the disclosure at an ongoing three-day workshop on prevention of cholera in Abuja, yesterday.\nHe added that “the NRCS, in consultation with the Nigerian Centre for Disease Control (NCDC), and support from International Federation of Red Cross and Red Crescent Societies (IFRC) is commencing emergency relief action in five states.\nIn addition to the five states, he said the Independent Committee of the Red Cross was also supporting the control and prevention in Adamawa, Borno and Yobe.\nMr. Bhupinder Tomar, head of delegation, Abuja Cluster, International Federation of Red Cross and Red Cresent Societies, noted that there was urgent need to address the issue of cholera."
  },
  {
    "headline": "News in Photographs: Osinbajo Chairs FEC Meeting",
    "summarized_story": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with Vice-President Yemi Osinbajo presiding.\nThe virtual meeting is holding at the conference room of the First Lady’s office with Osinbajo standing in for President Muhammadu Buhari who is attending the 5th Edition of Future Investment Initiative Summit holding in Riyadh, Saudi Arabia.\nAmong those physically attending the meeting are the Secretary to Government of the Federation, Boss Mustapha; Ministers of Information and Culture, Lai Mohammed; Attorney General of the Federation and Minister of Justice, Abubakar Malami; Finance, Budget and National Planning, Zaineb Ahmed; Works and Housing, Babatunde Fashola; Aviation, Hadi Sirika; and Power, Abubakar Aliyu.\nOther ministers, as well as the Head of the Civil Service of the Federation, Folashade Yemi-Esan, are attending virtually from their various offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NNPC: $3.097bn Investment Opportunities Exist in Condensate Refineries",
    "summarized_story": "•Says Nigeria needs $2.7bn to improve products supply, distribution infrastructure•Projects petroleum products demand to grow to 17.3m MT by 2025Peter UzohoThe Nigerian National Petroleum Corporation (NNPC) has said investment opportunities worth nearly $3.097 billion currently exist in the country’s condensate refineries’ space.\nModular refineries are also adding capacities, such as the 5,000 BPSD Waltersmith refinery, which will be upgraded to 50,000 BPSD.\n“Additional 250,000 BSPD is expected to come from the Condensate Refineries through the private sector partnership.\nThe co-location and condensate refineries will close the PMS supply-demand gap and create positive returns to the investors.\nAs investments in hydrocarbon continued to wane due to energy transition and geopolitics, Kyari said the world economy faced shortages, high energy prices, rising inflation and sluggish growth."
  },
  {
    "headline": "Again, CJN Laments Reckless Court Orders",
    "summarized_story": "Muhammad recalled that the reckless granting of ex parte orders reached a worrisome height recently, and he had to warn some judges to desist from such conduct.\n“The legal profession should, indeed, take the lead in all human affairs.\nWe cannot take the lead when our courts issue ex-parte orders recklessly.\nHe said, “The legal profession is the building under which we are sheltered.\nMay God forbid!”While congratulating Justice Baba-Yusuf on his appointment, the CJN prayed to God to guide, protect and assist him in the discharge of his duty as head of court."
  },
  {
    "headline": "Politicians Still Influencing Judges to Use Court against Democracy",
    "summarized_story": "Whether the appellate court would accede to the demand or not is another, particularly, taking into consideration the recent position of appellate court justices with respect to exparte granted by High Court judges.\nIt is worthy of mention that the appellate court and even the Supreme Court had descended heavily on the High Court judges particularly, in the Anambra governorship suits.\nThe appellate court claimed that the trial court erred by entertaining a suit wherein it lacked jurisdiction.\nBut Okeke challenged the authenticity of the Oye leadership at a Federal High Court in Jigawa State, where judgment was given in his favour.\nBut before Secondus could carry out the order, Justice Edem Kooffreh of a Cross River State High Court on August 28, restrained him from resuming."
  },
  {
    "headline": "Buhari Unveils eNaira as CBN Launches Instrument to Support 300 Companies",
    "summarized_story": "He stressed that Nigeria was the first country in Africa and one of the first in the world to introduce digital currency.\nHe disclosed that the journey to create a digital currency for Nigeria began in 2017.\nCBN decided to implement its own CBDC and to name the digital currency eNaira, with the expectation that the innovation would make significant positive difference to Nigeria and Nigerians, he stated.\nThe eNaira wallet is required to access, use and hold eNaira, which will be exchangeable for other Central Bank Digital Currencies (CBDC).\nThe CBN added that the AML/CFT checks for fraud prevention and detection would apply on the eNaira platform."
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "Akinwumi Adesina: No business can survive in Nigeria without generators -- it's abnormal",
    "summarized_story": "Akinwumi Adesina, president of the African Development Bank (AfDB), says the lack of reliable power supply is affecting the growth of industries in Nigeria.\nQuoting a report by the International Monetary Fund (IMF), Adesina said the country loses $29 billion annually, which is about 5.8 percent of its gross domestic product (GDP) due to a lack of reliable power supply.\nAdvertisement“Today, no business can survive in Nigeria without generators.\nYou succeed not because of the ease of doing business, but by surmounting several constraints that limit industrial manufacturing,” he said.\n“The size of the free trade zone, with a collective GDP of 3.3 trillion dollars, makes it the largest free trade zone in the world by the number of countries,” he said."
  },
  {
    "headline": "Akinwumi Adesina: No business can survive in Nigeria without generators -- it's abnormal",
    "summarized_story": "Akinwumi Adesina, president of the African Development Bank (AfDB), says the lack of reliable power supply is affecting the growth of industries in Nigeria.\nQuoting a report by the International Monetary Fund (IMF), Adesina said the country loses $29 billion annually, which is about 5.8 percent of its gross domestic product (GDP) due to a lack of reliable power supply.\nAdvertisement“Today, no business can survive in Nigeria without generators.\nYou succeed not because of the ease of doing business, but by surmounting several constraints that limit industrial manufacturing,” he said.\n“The size of the free trade zone, with a collective GDP of 3.3 trillion dollars, makes it the largest free trade zone in the world by the number of countries,” he said."
  },
  {
    "headline": "It will be wrong for Secondus to make PDP ungovernable, says Walid Jibril",
    "summarized_story": "Walid Jibril, the Peoples Democratic Party (PDP) board of trustees chairman, has advised Uche Secondus, the suspended chairman of the party, not to make the party ungovernable.\nAdvertisementTheCable had reported how multiple court orders were issued against Secondus, resulting in his suspension, and Yemi Akinwonmi, deputy national chairman (south), was appointed as his replacement.\nSubsequently, a Rivers state high court issued an interim order restraining Secondus from parading himself as the chairman of the party.\nHe said it will be “very wrong” for Secondus, being a founding member of the PDP, to make the party “ungovernable”.\n“Secondus is a member of BOT, he attained the position of the national chairman of this party."
  },
  {
    "headline": "It will be wrong for Secondus to make PDP ungovernable, says Walid Jibril",
    "summarized_story": "Walid Jibril, the Peoples Democratic Party (PDP) board of trustees chairman, has advised Uche Secondus, the suspended chairman of the party, not to make the party ungovernable.\nAdvertisementTheCable had reported how multiple court orders were issued against Secondus, resulting in his suspension, and Yemi Akinwonmi, deputy national chairman (south), was appointed as his replacement.\nSubsequently, a Rivers state high court issued an interim order restraining Secondus from parading himself as the chairman of the party.\nHe said it will be “very wrong” for Secondus, being a founding member of the PDP, to make the party “ungovernable”.\n“Secondus is a member of BOT, he attained the position of the national chairman of this party."
  },
  {
    "headline": "Anambra poll: Ohanaeze begs IPOB to suspend sit-at-home order",
    "summarized_story": "Ohanaeze Ndigbo, the apex Igbo socio-cultural organisation, has appealed to the Indigenous People of Biafra (IPOB) to suspend its planned sit-at-home order.\nThe governorship election in Anambra state is billed to take place on November 6.\n“The Ohanaeze Ndigbo Worldwide pleads with the Indigenous People of Biafra (IPOB) to reconsider the 7 days’ sit-at-home order in the south-east of Nigeria from November 5 to November 11.\nThis is to enable the governorship election for Anambra State scheduled for November 6 to hold,” the statement reads.\n“The implication of the above illustration is that Anambra state is the melting pot of Igbo traders and artisans."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "Here’s everything you need to know about Apple’s new releases",
    "summarized_story": "In a beautiful transition between Tim Cook and Zain Lowe, Apple also revealed the Music Voice Plan, a new subscription category for Apple Music that allows users to seamlessly use Siri with Apple Music.\nThe fall event started off with the introduction of Apple Music Voice Plan, a new subscription offering that allows users to seamlessly enjoy Siri with Apple Music.\nApple Music plansNew colours for Apple HomePod Mini Smart SpeakerAesthetics—that’s the simplest way to describe this update.\nM1 Pro And M1 Max ChipsEarlier in this article, we called these updates the two biggest surprises of the night.\nThe basic models come as standard with the M1 Pro, 16GB of Unified Memory and a 512GB SSD."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Naira’s digitisation via the eNaira: Beyond financial inclusion",
    "summarized_story": "Share this article:Introduction: Naira’s digitisation (the eNaira)A very recent accomplishment of the Central Bank of Nigeria (CBN) is the issuance of the new Central Bank Digital Currency (CBDC), the eNaira.\nConsequently, financial institutions have the responsibility to onboard their customers and integrate the eNaira wallet feature into their digital banking channels.\nIt is hoped that the design model behind the eNaira can permit coordination amongst peers once mCBDCs models become operational.\nAs already stated, the DLT solution for cross-border and FX funds transfer has huge potentials for simplifying cross-border payment with great savings on time and money.\nConclusionNigeria has taken another bold step towards trade finance digitisation by introducing the eNaira; however, the journey has just begun."
  },
  {
    "headline": "What you should know about raising funds, Autochek’s $13.1m seed, VeriFind by VerifyMe, Paystack’s Pay for Me feature",
    "summarized_story": "Another smart address verification toolIs it just me?\nSmart address verification tools like Plus Codes, OkHi, and VeriFind, have been created to solve this challenge.\nIn July 2021, Nigerian Identity verification company, VerifyMe launched VeriFind, a geotagging solution to enhance verifying addresses.\nAlthough, with VeriFind’s technology backed by over 20,000 last mile address verification agents, its remote reach is highly probable.\nLet’s say I want to use the Pay for Me feature to buy a bag on Paystack’s storefront."
  },
  {
    "headline": "First time founder? Here’s everything you need to know as you start raising money",
    "summarized_story": "On their own, these are challenging tasks for anyone, but for a first-time founder with little or no experience, it can be overwhelming.\nMost investors — whether angel investors or traditional VC firms — receive several pitches daily from entrepreneurs looking to get funded.\nFor this article, we’ve focused on raising your first round of funding, usually in the first few months of operation.\nFor example, you don’t need to apply to Y Combinator because everyone you know is applying; that’s the wrong approach to take.\nThat may change as the ecosystem develops, but you need to ensure that your interest aligns with theirs."
  },
  {
    "headline": "FG to present policy on casualisation of employment in Nigeria – Minister – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Minister of Employment, Labour and Productivity, Sen. Chris Ngige, on Tuesday in Abuja, disclosed that the Federal Executive Council would soon present a policy directive on the casualisation of employment in the country.\nNgige made the disclosure at a one-day public hearing on Prohibition of Casualisation of Employment Establishment Bill, 2021.\nThe public hearing was organised by the Senate Committee on Employment, Labour and Productivity.\nThe minister also described the casualisation of employment in Nigeria as worrisome, while accusing the banking, oil and gas, communication sectors as major perpetrators of casualisation of workers in the country.\nNgige also said that most of the companies that were involved in casualisation of workers were doing so at a high risk."
  },
  {
    "headline": "IGP deploys strategic commanders for Anambra governorship election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Inspector-General of Police (IGP), Mr Usman Baba, has ordered the deployment of selected strategic commanders to Anambra, ahead of the Nov. 6 governorship election in the state.\nHe said the strategic commanders affected by the deployment were from the rank of Assistant Commissioner of Police and above.\nMba said that the deployment was to ensure effective supervision of security personnel and operations during the election.\nAccording to him, Egbunike is saddled with the responsibility of overseeing the implementation of the ‘Operation Order’ which evolved from the election security threat assessment.\n“Other strategic commanders deployed in Anambra include five Assistant Inspectors-General of Police (AIGs), 14 Commissioners of Police (CPs), 31 Deputy Commissioners of Police (DCPs) and 48 Assistant Commissioners of Police (ACPs)."
  },
  {
    "headline": "ASUP faults establishment of new polytechnics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Academic Staff Union of Polytechnics (ASUP), has urged the Federal Government to stop the establishment of new Polytechnics in the country.\nASUP President, Mr Anderson Ezeibe, made the call at a two-day workshop tagged: “Advocacy Roundtable on the Future of Nigerian Polytechnics”, organised by the union on Tuesday in Abuja.\n“We do not agree with the continued establishment of new Polytechnics on the largely unsubstantiated premise of providing greater access to tertiary education as the existing ones remain unattractive to young Nigerians.\nHe further said that polytechnics are nowhere close to preferred destinations for Nigerian students seeking tertiary education as the sector suffers from, ”deep seated discrimination in different facets mainly driven by anachronistic tendencies”.\nSen. Ibrahim Shekarau, Chairman of the occasion, said that the persisting problem that bedeviled the education sector and the incessant industrial action was the failure of government to do the right thing."
  },
  {
    "headline": "Edo commissioner charges residents on tax payment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo state commissioner of communication and orientation, Bar.\nEwanta Andrew, has charged residents to support the governor Obaseki-led administration by paying tax to the state government.\nEwanta gave the charge yesterday in Benin when his family member paid him a solidarity visit on his appointment as commissioner.\nHe said the payment of tax by the citizenry enables the government to fulfil its responsibility to the citizens through infrastructural development among others.\nEarlier, the leader of the family Roland Ewanta, said the visit was to assure the commissioner of their support in the discharge of his duty."
  },
  {
    "headline": "EFCC releases ex-Senate President Anyim after spending two days in custody – Lawyer",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released a former Senate President, Pius Anyim, after being held and interrogated for two days over allegations of corruption, his lawyer, Mike Ozekhome, told PREMIUM TIMES on Wednesday.\nMr Anyim, taken into custody on Sunday, was released on Tuesday based on an dministrative bail granted him by the commission, according to Mr Ozekhome, a Senior Advocate of Nigeria (SAN).\nOn his part, Mr Anyim had been named in relation to alleged financial irregularities concerning the Centenary City project in Abuja.\nThe report indicting Mr Anyim was said to have been submitted to the House of Representatives by the committee led by a House member, Herman Hembe.\nDenying any wrongdoing, Mr Anyim, through his lawyer, Mike Ozekhome, sued the House of Representatives in 2017."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "UBA records 37% profit growth, N490.3bn gross earnings in Q3’21",
    "summarized_story": "According to the pan- African bank’s unaudited financial statements filed at the Nigerian Exchange Limited (NGX), its gross earnings rose to N490.3bn from N454.4bn, while operating income increased by 13 per cent year-on-year to N331.7bn from N293.7bn.\nAlso, the shareholders’ funds remained very strong at N798.3 billion up by 10.3% from N724.1 billion recorded in December 2020, thus reflecting a strong capacity for internal capital generation and growth.\nThe Group CFO, Ugo Nwaghodoh said, “The performance reflects our progressive efforts in building on our robust balance sheet, strong customer base and our people, in delivering impressive earnings.\n“Particularly, I am pleased at the 90bps improvement in Cost of Funds (CoF) from 3.2 percent to 2.3 percent in the period.\nThis was despite the increase in our customer deposits by 7.2 percent to N6.1 trillion, portraying the Bank’s deliberate effort to substitute high-cost funds for low-cost deposits.”Facebook Notice for EU!"
  },
  {
    "headline": "Sterling Bank invests in proper waste management in 70% of Nigerian states",
    "summarized_story": "Managing Director and Chief Executive Officer (MD/CEO) of Sterling Bank Plc, Mr. Abubakar Suleiman, has said the bank invested heavily in more than 70 percent of the 36 states in the country by partnering with them to address plastic pollution and ensure excellent waste management in a bid to promote waste recycling.\nHe noted that climate change is a common concern for all countries of the world.\nAccording to him, climate change is an urgent and potentially irreversible threat.\n“Addressing challenges relating to climate change is at the heart of the UK government’s agenda.\nShe projected that, “By 2040s, greenhouse gas will be many times more potent than carbon dioxide, thus accelerating the rate of climate change dramatically."
  },
  {
    "headline": "IGP overhauls Anambra security architecture ahead of November 6 governorship election",
    "summarized_story": "The Inspector General of Police (IGP), Usman Alkali Baba, has ordered a major overhauling of the security landscape in Anambra State ahead of the November 6, 2021 governorship election in the state.\nThe IGP noted that Deputy Inspector General of Police (DIG) Joseph Egbunike has been deployed to Anambra State as the Coordinator of the security component for the Elections.\nDIG Egbunike will be assisted by the DIG in-charge of Operations, Acting DIG Zaki Ahmed.\nThe Senior Officers are to coordinate human and other operational deployments in the three (3) Senatorial Districts, twenty-one (21) Local Government Areas and the 5720 polling units in Anambra State.\nThe IGP reassured the nation that the Force is adequately prepared for the Gubernatorial Elections in Anambra State come November 6th, 2021."
  },
  {
    "headline": "Access Bank signs merger deal with Zambian bank, Atlas Mara Zambia",
    "summarized_story": "Top Nigerian lender, Access Bank Plc on Monday, announced that it has executed a binding agreement with Atlas Mara Limited on a proposed merger between African banking Corporation Zambia Limited (Atlas Mara Zambia) and the Access Bank Zambia Limited.\nSunday Ekwochi, the Company Secretary, Access Bank, who announced the development in a statement on the Nigerian Exchange Limited (NGX), stated that upon the completion of the prospective transaction, the bank was expected to increase its current shareholding in Access Bank Zambia, which following the merger would have over 70 branches and agencies, approximately $1billion total assets and over 300,000 customers in Zambia.\n“The transaction will not require significant additional capital investment requirements from the bank given the capital and other synergies created from the merger between Access Bank Zambia with Cavmont Bank in 2020,” he said.\n“The merger of Atlas Mara Zambia with Access Bank Zambia is expected to augment our presence in Zambia and the broader COMESA region, Africa’s largest free trade area.\n“We are particularly excited by the prospects of increased earnings contribution to the bank from the enlarged Access Bank Zambia, which has also announced the appointment of a new managing Director, Mr. Lishala Situmbeko, who brings over 25 years of cognate experience and deep local relationships into our Zambian operation."
  },
  {
    "headline": "Use Technology For Unity, Nation-building, FSI Tells Federal Govt",
    "summarized_story": "Financial Services Innovators (FSI) has called on the Nigerian government to embrace the language of technology to unite Nigerians.\nThe executive director, FSI, Mrs Aituaz Kola-Oladejo, made the call at this year’s FSI and Nigeria Association of Computing Students’ Innovative Challenge, tagged ‘#TechOnDemand’, hackathon, a statement by FSI said.\nThrough collaboration, we would achieve digital, financial, social and economic inclusion.”LEADERS reports that FSI is a shared infrastructure for the financial services industry to foster innovation and support startups in the country.\n“The hackathon was focused on four key sectors, which were financial services, health, transportation and education sectors fraught with challenges of cash dominance, inefficient processes and inclusion.\n“This platform provided by FSI has gone a long way in harnessing talents to address pressing problems in the Nigerian economy."
  },
  {
    "headline": "Use Technology For Unity, Nation-building, FSI Tells Federal Govt",
    "summarized_story": "Financial Services Innovators (FSI) has called on the Nigerian government to embrace the language of technology to unite Nigerians.\nThe executive director, FSI, Mrs Aituaz Kola-Oladejo, made the call at this year’s FSI and Nigeria Association of Computing Students’ Innovative Challenge, tagged ‘#TechOnDemand’, hackathon, a statement by FSI said.\nThrough collaboration, we would achieve digital, financial, social and economic inclusion.”LEADERS reports that FSI is a shared infrastructure for the financial services industry to foster innovation and support startups in the country.\n“The hackathon was focused on four key sectors, which were financial services, health, transportation and education sectors fraught with challenges of cash dominance, inefficient processes and inclusion.\n“This platform provided by FSI has gone a long way in harnessing talents to address pressing problems in the Nigerian economy."
  },
  {
    "headline": "Ezekwesili, Others Seek Multi-stakeholders’ Solution To Africa’s Learning Crisis",
    "summarized_story": "To address the learning crisis in Sub-Saharan Africa and make foundational literacy and numeracy a priority, Nigeria’s former Minister of Education, Dr Obiageli Ezekwesili, says a multi-stakeholders approach was needed to tackle the issue.\nHCA believes that foundational literacy and numeracy should be prioritised to create a secure future for all African children.\nPart of HCA’s approach to fix the learning crisis is to bring foremost leaders, practitioners and champions on the continent as well as country leaders together to care, respond and act.\nOthers include supporting country leaders and policymakers to understand and implement the right actions.\nADVERTISEMENTLamenting the state of education in the region, she said, “It is shocking how we have continuously denied our children this right."
  },
  {
    "headline": "Ezekwesili, Others Seek Multi-stakeholders’ Solution To Africa’s Learning Crisis",
    "summarized_story": "To address the learning crisis in Sub-Saharan Africa and make foundational literacy and numeracy a priority, Nigeria’s former Minister of Education, Dr Obiageli Ezekwesili, says a multi-stakeholders approach was needed to tackle the issue.\nHCA believes that foundational literacy and numeracy should be prioritised to create a secure future for all African children.\nPart of HCA’s approach to fix the learning crisis is to bring foremost leaders, practitioners and champions on the continent as well as country leaders together to care, respond and act.\nOthers include supporting country leaders and policymakers to understand and implement the right actions.\nADVERTISEMENTLamenting the state of education in the region, she said, “It is shocking how we have continuously denied our children this right."
  },
  {
    "headline": "Warri Monarch To Bequeath Enduring Educational Legacy – Olori Atuwatse III",
    "summarized_story": "The wife of Olu of Warri, Olori Atuwatse III, has disclosed plan of the Olu of Warri palace to bequeath an enduring educational legacy in Warri kingdom, this is just as she harped on the need for every child to receive quality education irrespective of social status.\nAccording to her, “Since our ascension, the state of the Warri Kingdom has deeply disturbed my husband and I.\n“Ogiame Atuwatse III and I have made it one of our priorities to channel our influence and greater investment to our most important resource – the young people of Warri Kingdom.\n“Back then, the average Nigerian child, regardless of social status, had the opportunity to receive excellent quality education that enabled them to stand shoulder to shoulder with their peers around the world.\nUnfortunately, today, it is not so,” Olori Atuwatse III stated."
  },
  {
    "headline": "Katy Perry unveils charity cover of Beatles hit All You Need is Love",
    "summarized_story": "Katy Perry unveils charity cover of Beatles hit All You Need is LoveKaty Perry unveils charity cover of Beatles hit All You Need is LoveKaty Perry has released a cover of The Beatles classic ‘All You Need Is Love’ to raise funds for Baby2Baby.\nLink in bio to listen + help one of my fav causes (sic)”Meanwhile, Katy recently compared being a mother to being a pop star.\nNow that I’m a mom my life is totally different and yet I realized, it’s kind of similar to being a pop star.\nKaty shared: “I made a conscious decision to become a mother, but I didn’t know until I became a mother that you have to strike a balance.\nLet me tell you as someone who has done and seen everything, there’s nothing better than having a beautiful, pure child."
  },
  {
    "headline": "Katy Perry unveils charity cover of Beatles hit All You Need is Love",
    "summarized_story": "Katy Perry unveils charity cover of Beatles hit All You Need is LoveKaty Perry unveils charity cover of Beatles hit All You Need is LoveKaty Perry has released a cover of The Beatles classic ‘All You Need Is Love’ to raise funds for Baby2Baby.\nLink in bio to listen + help one of my fav causes (sic)”Meanwhile, Katy recently compared being a mother to being a pop star.\nNow that I’m a mom my life is totally different and yet I realized, it’s kind of similar to being a pop star.\nKaty shared: “I made a conscious decision to become a mother, but I didn’t know until I became a mother that you have to strike a balance.\nLet me tell you as someone who has done and seen everything, there’s nothing better than having a beautiful, pure child."
  },
  {
    "headline": "I-invest: Securing investment opportunities for Nigerians",
    "summarized_story": "Through the I-invest app, Nigerians are able to access a plethora of investments based on their risk appetite.\nSpeaking at the Summit, Oluseye Olusoga, Founder of I-invest and Group Managing Director, Parthian Partners, said I-invest is leveraging technology for Nigerians to invest and build a savings culture.\nThe application is built by Nigerians to help Nigerians invest in Nigeria.\nSpeaking on his expectations from the #NES27, Olusoga said he wants Nigerians to be more aware and involved in tackling challenges facing the nation in turn changing the country’s narrative.\nThe I-invest App is available for download on Google Play or Apple store."
  },
  {
    "headline": "I-invest: Securing investment opportunities for Nigerians",
    "summarized_story": "Through the I-invest app, Nigerians are able to access a plethora of investments based on their risk appetite.\nSpeaking at the Summit, Oluseye Olusoga, Founder of I-invest and Group Managing Director, Parthian Partners, said I-invest is leveraging technology for Nigerians to invest and build a savings culture.\nThe application is built by Nigerians to help Nigerians invest in Nigeria.\nSpeaking on his expectations from the #NES27, Olusoga said he wants Nigerians to be more aware and involved in tackling challenges facing the nation in turn changing the country’s narrative.\nThe I-invest App is available for download on Google Play or Apple store."
  },
  {
    "headline": "Buhari Should Be Impeached For Spending Millions Of Dollars On Subsidy – Sanusi Lamido",
    "summarized_story": "The deposed emir of Kano, Muhammadu Sanusi ll, claimed on Tuesday that the constitution allows for President Muhammadu Buhari’s impeachment for spending millions in gasoline subsidies without appropriation.\n“Every year, the government spends millions upon millions of dollars on fuel subsidies without appropriation.\n“We have to decide to run a developmental state and not a rental state; not a populists state,” the former emir said.\nHe further said that the Nigerian government was subsidising fuel, electricity at the expense of the growth of education in the country.\n“We are pursuing a populist policy: we want to have cheap fuel, cheap electricity, a strong Naira."
  },
  {
    "headline": "BREAKING: 5 Governors Storm Tinubu’s House [PHOTOS]",
    "summarized_story": "The 5 governors include Governor Babajide Sanwo-Olu, Rotimi Akeredolu of Ondo state, Dapo Abiodun of Ogun state as well as Oyetola of Osun state.\nThe Oyo state Governor was represented by his deputy while the Governor Kayode Fayemi of Ekiti was absent.\nRecall that Mr. Tinubu has been away from Nigeria for 3 months and returned quietly recently.\nOtunba Gbenga Daniel, a former Ogun state governor as well as Ayo Fayose, an ex-Governor of Ekiti state were the first set of VIPs to visit the former Lagos state governor when he arrived in Nigeria.\nMallam Mai Mala Buni, the chairman of the APC caretaker committee equally visited Asiwaju at his Ikoyi home."
  },
  {
    "headline": "South African Firm, Multichoice Loses Appeal, Ordered To Pay N194Billion Tax To Nigeria",
    "summarized_story": "According to the Daily Post, the Tax Appeal Tribunal dismissed the company’s appeal for lack of diligence and ordered it to pay the $342 million tax assessment handed over to them by the FIRS.\nWhile delivering its judgment on the company’s appeal, the tribunal upheld the FIRS’ preliminary objection to Multichoice Africa Holdings B.V.’s appeal.\nThe Tribunal upheld the South African company’s failure to comply with Order 3 Rule 6 of the Tax Appeal Tribunal (Procedure) Rules, 2021, which requires an appellant to deposit half of the assessed sum in dispute before being heard on appeal.\nThe sum is to be paid as a security for the hearing of any tax appeal, according to the Tribunal.\nMultichoice Africa Holdings, the parent company of Multichoice Nigeria, is believed to have avoided paying VAT from its establishment, despite delivering services to its Nigerian arm."
  },
  {
    "headline": "Will Not Enact Law For Financial Independence For Judiciary – Wike",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, has declared that the state government will not pass any legislation giving the state judiciary financial autonomy.\nAccording to the administration, the Nigerian judiciary already has independence under the 1999 constitution.\nNobody can say send this bill to the legislature for judiciary autonomy.\nThe constitution has already guaranteed that the judiciary must be independent and we have agreed on that.\nGovernor Wike, therefore, advised the Federal Government to stop “playing to the gallery” with the issue of financial autonomy for the judiciary."
  },
  {
    "headline": "Breaking: Another Cross River Lawmaker is dead",
    "summarized_story": "A member representing Akpabuyo State Constituency in the Cross River State House of Assembly and a staunch member of the People’s Democratic Party (PDP), Hon.\nReport says Mrs Ironbar died of protracted illness on Wednesday morning at the Assembly Village, Ekot Inim in Calabar metropolis.\nA family member, who preferred anonymity, told newsmen on Wednesday afternoon that Mrs Ironbar died on the early hours of Wednesday.\nGood night Sweetheart.”Ironbar is the fourth Cross River House of Assembly member to die within the last three years.\nOthers were Stephen Ukpukpen of Obudu State Constituency, John Nkoro of Ikom and again another Obudu lawmaker, Godwin Akwaji, who replaced Ukpukpen."
  },
  {
    "headline": "National Convention: Why PDP will bar some delegates – Okowa",
    "summarized_story": "So that shows you that the party is on course for a successful National Convention,” he added.\nExcept for the statutory delegates who by their right and positions held in the past are not by reasons of election are supposed to be delegates.”Earlier in his remark, Okowa said the accreditation sub-committee was critical to the National Convention.\nBlueprint reports that the PDP screening committee had earlier disqualified three aspirants from participating in the national convention.\nOladipo was vying for the position of Deputy National Chairman (South), Muo-Aroh and Olafeso were eyeing the positions of National Secretary, and National Publicity Secretary respectively.\nFintiri said the aspirants were disqualified because they took the party to court with an intention to stop the national convention."
  },
  {
    "headline": "Buhari at Saudi investment summit: Underinvestment in humane projects cause of global insecurity",
    "summarized_story": "By so doing, it will go a long way in reenergizing the global economy in a post COVID-19 era.\n“The humane approach to investment,” he said, “is the only way to address the global challenges we face, especially in the Covid-19 era.\n“We have the Nigeria Sovereign Investment Authority and more recently, I approved the creation of Infrastructure Corporation of Nigeria.\nNigeria and many countries in Africa are already facing the challenges posed by climate change.\nClimate change has triggered conflicts, food insecurity, irregular youth migration, raising level of sea waters, drought and desertification, as well as the drying-up of the Lake Chad."
  },
  {
    "headline": "Desist from admitting National Diploma, part-time, JAMB warns institutions -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB has said that all applications for admissions to First Degree, National Diploma, National Innovation Diploma, and the Nigeria Certificate in Education into Full-Time, Distance Learning, Part-Time, Outreach, Sandwich, and others must be processed only through it.\nThe advisory warned institutions that are still involved in advertising or selling “application forms” for admissions into the programs listed above were advised to desist forthwith.\nIt, therefore, enjoined institutions to advise their candidates to apply to them through the Joint Admissions and Matriculation Board, adding that duplication of application forms is also NOT allowed.\n“ JAMB and the three Regulatory Agencies: (National Universities Commission (NUC), National Board for Technical Education (NBTE), and National Commission for Colleges of Education (NCCE) will ensure that all Tertiary Institutions comply with this policy directive.\nOther Professional Regulatory Agencies are also expected to play critical roles in sanitizing the process,” it said."
  },
  {
    "headline": "Desist from admitting National Diploma, part-time, JAMB warns institutions -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB has said that all applications for admissions to First Degree, National Diploma, National Innovation Diploma, and the Nigeria Certificate in Education into Full-Time, Distance Learning, Part-Time, Outreach, Sandwich, and others must be processed only through it.\nThe advisory warned institutions that are still involved in advertising or selling “application forms” for admissions into the programs listed above were advised to desist forthwith.\nIt, therefore, enjoined institutions to advise their candidates to apply to them through the Joint Admissions and Matriculation Board, adding that duplication of application forms is also NOT allowed.\n“ JAMB and the three Regulatory Agencies: (National Universities Commission (NUC), National Board for Technical Education (NBTE), and National Commission for Colleges of Education (NCCE) will ensure that all Tertiary Institutions comply with this policy directive.\nOther Professional Regulatory Agencies are also expected to play critical roles in sanitizing the process,” it said."
  },
  {
    "headline": "FG begins implementation of Ogoni cleanup, other projets to tackle environmental challenges -NigPilot",
    "summarized_story": "The Federal Ministry of Environment has said it is accelerating the implementation of various projects to address environmental challenges in the country.\nThe Minister of Environment, Sharon Ikeazor disclosed this at the meeting of the 15th National Council on Environment, NCE, held in Abuja, weekend.\nIkeazor said for Nigeria to realize the environment of her dream, it is imperative to consistently tackle environmental challenges such as climate change, deforestation, desert encroachment, loss of biodiversity, flood and erosion, environmental pollution amongst others.\nAnother strategy is the Implementation of a comprehensive program on the domestic use of Liquefied Petroleum Gas.\nThe Minister, therefore, urged National Council to critically appraise the emerging challenges faced by the environment while also acknowledging the opportunities that are inherent to be able to balance our actions towards achieving a sustainable environment."
  },
  {
    "headline": "FG begins implementation of Ogoni cleanup, other projets to tackle environmental challenges -NigPilot",
    "summarized_story": "The Federal Ministry of Environment has said it is accelerating the implementation of various projects to address environmental challenges in the country.\nThe Minister of Environment, Sharon Ikeazor disclosed this at the meeting of the 15th National Council on Environment, NCE, held in Abuja, weekend.\nIkeazor said for Nigeria to realize the environment of her dream, it is imperative to consistently tackle environmental challenges such as climate change, deforestation, desert encroachment, loss of biodiversity, flood and erosion, environmental pollution amongst others.\nAnother strategy is the Implementation of a comprehensive program on the domestic use of Liquefied Petroleum Gas.\nThe Minister, therefore, urged National Council to critically appraise the emerging challenges faced by the environment while also acknowledging the opportunities that are inherent to be able to balance our actions towards achieving a sustainable environment."
  },
  {
    "headline": "FG selects six Universities for production of experts in procurement, others -NigPilot",
    "summarized_story": "Federal Government has selected six federal universities to host the Sustainable Procurement, Environmental and Social Standards Centres of Excellence , SPESSCEs, for the implementation.\nSPESSE also aims to establish strategic partnerships with leading international research funding, research performing and international capacity building organisations and top-performing institutions.\nThe Universities were: Abubakar Tafawa Balewa University, (ATBU), Bauchi; Ahmadu Bello University (ABU), Zaria; the Federal University of Agriculture, Makurdi (FUAM); the Federal University of Technology, Owerri (FUTO); University of Benin (UNIBEN) and University of Lagos (UNILAG).\nAccording to him, by developing curricula aligned with international standards, setting up the Centres of Excellence and supplying qualified professionals, SPESSE will improve, significantly, Nigeria’s capacity for procurement, environmental and social standards.\nRasheed commended the Vice-Chancellors of the selected universities for the key roles they played in developing the winning proposals and urged them to continue to support the Centres for the benefit of their universities, the Nigerian University System (NUS) and the country in general."
  },
  {
    "headline": "BREAKING: AU Suspends Sudan Over Military Coup",
    "summarized_story": "The African Union said on Wednesday it had suspended Sudan until civilian rule in the country is restored, saying it rejected the military takeover as an “unconstitutional” seizure of power.\nThe continent-wide bloc said it “strongly condemns the seizure of power” and was suspending Sudan from all AU activities “until the effective restoration of the civilian-led transitional authority”.\nPrime Minister Abdalla Hamdok was placed under military arrest, along with his ministers and civilian members of Sudan’s ruling council, sparking angry protests on the streets of Khartoum.\nA number of Western powers have called for an urgent meeting with Hamdok, saying they still recognise the prime minister and his cabinet as the constitutional leaders of Sudan.\nThe AU suspended Sudan in June 2019 after pro-democracy protesters demanding civilian rule were gunned down outside army headquarters in Khartoum."
  },
  {
    "headline": "Politicians Fuelling Crisis In Plateau, Says Governor Lalong",
    "summarized_story": "The Chairman of the Northern Governors Forum and Plateau State Governor, Simon Lalong, has accused politicians of fuelling crisis in his state.\nHe noted that Plateau has long been known as a state of peace and tourism before some political actors started creating problems in the state.\nHe lamented that as part of some measures in tackling religious and ethnic violence, some state governors would use resources at their disposal to acquire some technological equipment, which may end up not being used.\nAccording to him, a situation where the Federal Government makes arbitrary deductions without the input of state governors is wrong.\nHe said state governors have agreed not to collect any allocation from the Federation Allocation Account (FAAC) until the issues are resolved."
  },
  {
    "headline": "Lack Of Electricity Killing Nigerian Industries – Adesina",
    "summarized_story": "President of the African Development Bank Group, Akinwumi Adesina, on Tuesday lamented that a paucity of energy was negatively affecting the growth of Nigerian industries.\nAdesina made the comment while speaking at a meeting organised by the Manufacturers Association of Nigeria (MAN) in Abuja.\n﻿“Poor countries need access to bigger markets to grow rapidly,” she said.\n“We should work harder, first to understand the barriers facing micro, medium and small enterprises in global trade and then to lower these barriers.\nAnother is working on empowering MSMEs to trade; and a third is working on lowering barriers facing women in global economic trade.”"
  },
  {
    "headline": "Appeal Court Strikes Out Suit Challenging Secondus’ Suspension From PDP",
    "summarized_story": "The Court of Appeal sitting in Port Harcourt has dismissed an application challenging the suspension of Mr Uche Secondus from the Peoples Democratic Party (PDP).\nThe PDP had filed the application at the appellate court to test the validity of Secondus’ suspension from the main opposition party.\nFollowing the suspension of Secondus, Mr Yomi Akinwonmi has been serving as the PDP National Chairman in an acting capacity.\nListed as plaintiffs in the suit were Mr Eddy Olafeso, Mr Rashidi Sunmonu, Mr Daisi Akintan, Mr Bunmi Jenyo, and Mr Wahab Owokoniran.\nThose listed as defendants were the PDP, Secondus, Yomi Akinwonmi (PDP Deputy National Chairman, South), Senator Suleiman Nazif (PDP Deputy National Chairman, North), Senator Ibrahim Tsauri (National Secretary, PDP), Independent National Electoral Commission (INEC), and the Attorney-General of the Federation (AGF)."
  },
  {
    "headline": "Luxembourg PM Admits Faults In Thesis Plagiarism Row",
    "summarized_story": "Luxembourg’s Prime Minister Xavier Bettel on Wednesday admitted he should have acted “differently” after accusations he plagiarised swathes of his university thesis.\nLocal outlet reporter.lu claimed the liberal leader — in power for eight years — lifted “three quarters” of his 1999 thesis at France’s University of Nancy.\nREAD ALSO: Man Kills Seven In China Knife Rampage“Today, I recognise that I could have — yes, perhaps I should have — done it differently”, Bettel admitted.\nThe most recent scalp was German family minister Franziska Giffey, who stepped down in May this year over claims she plagiarised her doctoral thesis.\nReporter.lu said that Bettel’s 56-page thesis on European Parliament election reforms contained unattributed chunks throughout taken from two books, four websites and a press report."
  },
  {
    "headline": "South West Govs believe in Tinubu's leadership",
    "summarized_story": "Governor of Ondo State, Rotimi Akeredolu has said that all the South West Governors believe in the leadership of the National leader of the APC, Asiwaju Bola Ahmed Tinubu.\nChairman of the South West Governors’ Forum made this known during a visit of the Governors of the South West to the Lagos residence of Asiwaju Bola Tinubu.\nGovernor Akeredolu said the visit is to thank God for the successful return of the APC Stalwart after a long medical trip to the United Kingdom.\nHe describes the Lagos residence of the APC National leader as a mecca of some sort after his safe arrival."
  },
  {
    "headline": "No bomb explosion in Abolongo, but controlled detonation of IEDs",
    "summarized_story": "The Oyo state command of the Nigeria Correctional Service has described a recent explosion at the Abolongo correctional as a controlled detonation of IEDs left behind by attackers of the prison.\nThe Public Relations Officer of the Command, Olanrewaju Anjorin who confirmed this to TVC News said the detonation was carried out by the Anti Bomb Squad of the Nigeria police.\nAccording to him, Nigerians should disregard the report of any explosion as it was a controlled detonation of Improvised Explosive Devices left behind by the attackers of the correctional facility.\nHe urged residents not panic and go about their legitimate businesses ."
  },
  {
    "headline": "Anambra Poll: INEC refutes alleged mass resignation of ad hoc staff over IPOB threat -",
    "summarized_story": "The Independent National Electoral Commission, INEC, has refuted reports that its ad-hoc staff resigned over threats by the Indigenous People of Biafra, IPOB.\nINEC’s Resident Electoral Commissioner in Anambra State, Nwachukwu Orji refuted the claims in Awka, said the Commission is still recruiting ad-hoc staff members.\nReports had it that some ad-hoc staff of INEC terminated their appointment en mass over IPOB-linked threats ahead of the governorship election in the state.\nHowever, Orji described such reports as false and without substance.\nAnambra 2021 Governorship election is slated for November 6."
  },
  {
    "headline": "Angry mob lynch three suspected Bandit informants in Kaduna",
    "summarized_story": "Three suspected bandit informants, a man, his wife and their son have been killed by angry mob at Zangon Aya community in Igabi Local Government Area of Kaduna State.\nThe mob also looted the property of the deceased and set their house ablaze after killing them.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan who confirmed the incidence in a statement said it happened on Monday afternoon when the angry mob stormed the house of the victims suspected to be have been supplying armed bandits with information.\nMeanwhile, Governor Nasir El-Rufai has strongly condemned the violent act of the mob and directed security agencies to conduct thorough investigations into the incident."
  },
  {
    "headline": "Nigeria: $3.097bn Investment Opportunities Exist in Condensate Refineries, NNPC Says",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has said investment opportunities worth nearly $3.097 billion currently exist in the country’s condensate refineries’ space.\nModular refineries are also adding capacities, such as the 5,000 BPSD Waltersmith refinery, which will be upgraded to 50,000 BPSD.\n“Additional 250,000 BSPD is expected to come from the Condensate Refineries through the private sector partnership.\nThe co-location and condensate refineries will close the PMS supply-demand gap and create positive returns to the investors.\nAs investments in hydrocarbon continued to wane due to energy transition and geopolitics, Kyari said the world economy faced shortages, high energy prices, rising inflation and sluggish growth."
  },
  {
    "headline": "Mali Junta Declares ECOWAS’ Special Rep Persona Non Grata",
    "summarized_story": "In a development that gave a sense of heightened tension, the government of Mali, Monday, declared the Special Representative of the Economic Community of West African States (ECOWAS), Hamidou Boly, “persona non grata” and gave him 72 hours to leave the country.\nThis situation, which signaled some obnoxious diplomatic development, was contained in a statement issued on Monday by the Malian Ministry of Foreign Affairs and International Cooperation.\nECOWAS President-in-Office and President of Ghana, John Nana Akuffo-Addo, had made an official visit to Bamako on October 17 to discuss with the Malian authorities about the “evolution” of the proposed transition.\nThe Malian coup of August 18, 2020, had necessitated a political transition since September15, 2020 for 18 months.\nBut lately, the transitional authorities called for the postponement of the first rounds of the presidential and legislative elections scheduled for February 27, 2022, and as a result, extended the deadline for the transitional period."
  },
  {
    "headline": "Japan Startup Targets Supercar Users with $700,000 Hoverbike",
    "summarized_story": "A Japanese startup backed by soccer player Keisuke Honda hopes to persuade wealthy consumers to swap their supercar for a 77.7 million yen ($680,000) hoverbike which went on sale on Tuesday.\nThe “XTurismo Limited Edition” from Tokyo-based drone startup A.L.I.\nThe black and red hoverbike consists of a motorcycle-like body on top of propellers.\nStrict regulations in Japan driven by safety concerns have hobbled the growth of sectors like ride-sharing.\nTechnologies, whose suppliers include engine maker Kawasaki Heavy (7012.T), would help reinforce Japan’s industrial edge amid a generational shift towards new technology such as autonomous and electric vehicles."
  },
  {
    "headline": "UK Retailers Warn of Pre-Christmas Price Rises",
    "summarized_story": "British retailers warned on Wednesday of pre-Christmas price rises after they reported the smallest year-on-year decline in the average selling price of goods in their stores since before the start of the coronavirus pandemic.\nThe British Retail Consortium trade body said shop prices rose by 0.4% on the month in October and were 0.4% lower than a year before, the smallest year-on-year fall since January 2020.\nPrice rises were led by higher costs for food, which was 0.5% more expensive than a year earlier.\nThe BRC’s shop price index covers a narrower range of spending than the consumer price index targeted by the Bank of England, which touched its highest since 2012 in August at 3.2%.\nThe BRC data is produced with market research company NielsenIQ, which said rising prices could lead to a shift away from discretionary spending."
  },
  {
    "headline": "Turkey Extends Syria and Iraq Military Missions By Two Years",
    "summarized_story": "Turkey’s parliament has extended the military’s mandate to launch cross-border operations in Syria and Iraq by two more years.\nEarly this month, Erdogan said Turkey was preparing to step up operations in Syria, where its forces came under attack from Kurdish fighters supported by Washington in the fight against the ISIL group.\nTurkey and its proxies have seized control of territory in northern Syria over four military operations launched since 2016, heavily targeting Kurdish fighters there.\nThe fighters have used their hideouts in northern Iraq as a springboard for attacks aimed at Turkish soil for decades.\nTurkish authorities said on Tuesday that security forces “neutralised” five Kurdish fighters in northern Iraq."
  }
]