[
  {
    "headline": "Nigerian news doesn’t make one happy, after listening, I go on my knees to pray – 94-year-old Rev Adejobi",
    "summarized_story": "Reverend Mother Olive Adejobi, wife of the late Primate Emmanuel Adejobi of the Church of the Lord, Aladura, recently clocked 94.\nThe celebration was fine and I was happy to see everyone around me – (church) members, ministers, little children, among others.\nIt was a pleasant time because we were able to carry the responsibility of both the church and the children well.\nBy the grace of God, I can lead them, pray with them and make them happy.\nAnd I know whenever we pray, God listens."
  },
  {
    "headline": "Izombe carnage: Woman burnt by soldiers dies days after",
    "summarized_story": "One of the people who got burnt when military men invaded Izombe in Oguta Local Government Area of Imo state, last Friday, Mrs Faith Okebata, has died.\nFaith, 36, got terribly burnt while she was fighting to rescue her mother-in-law, Mrs Catherine Okebata, who had a stroke seven years ago.\nA source said, “The woman was trying to rescue her mother-in-law who was in the house after the soldiers set it on fire.\nShe succeeded in rescuing her but she burnt got severely burnt as her breasts, face and other parts of her body were completely burnt.\nOur country home, including all our property got burnt as the military set it on fire.”"
  },
  {
    "headline": "Why I didn’t have intimate relationship on BBNaija –Beatrice Nwaji",
    "summarized_story": "Former Big Brother Naija Shine Ya Eye housemate, Beatrice Nwaji, has said she wanted a woman to win this season because it would be a win for all women.\nFunny enough, when I told my mom I was going for Big Brother Naija, she was so excited and said I was going to win.\nI told her I wasn’t interested in winning and that if I spend a week or two there, I would be happy.\nA woman winning is a win for all women.”Nwaji also opened up on why she didn’t have any intimate relationship like some others on the show.\nShe said, “I did not have an intimate relationship on BBNaija because I wanted a real one."
  },
  {
    "headline": "Lara Rawa speaks on exciting twists at Lagos Cocktail Week 2021",
    "summarized_story": "By Yemisi SuleimanIt is an exciting time for lagoscians as one of Lagos’s most exciting events ‘The Lagos Cocktail Week’ returns after a one-year Covid 19 break.\nFounder of the Lagos Cocktail Week and CEO of Eventi Cocktails Lara Rawa, an award-winning mixologist alongside her partners have brought on board some prestigious liquor; Fayrouz, Desperados, Absolut Vodka, Star Radler, Jameson, Olmeca Tequila, Beefeater Gin, Johnnie Walker, and many others for an exhilarating experience this year.\nWhat is the focus of the Lagos Cocktail week?\nWe are here for the Lagos Cocktail week 2021 and this is the 7th edition.\nHow did the Lagos Cocktail Week begin?"
  },
  {
    "headline": "Lara Rawa speaks on exciting twists at Lagos Cocktail Week 2021",
    "summarized_story": "By Yemisi SuleimanIt is an exciting time for lagoscians as one of Lagos’s most exciting events ‘The Lagos Cocktail Week’ returns after a one-year Covid 19 break.\nFounder of the Lagos Cocktail Week and CEO of Eventi Cocktails Lara Rawa, an award-winning mixologist alongside her partners have brought on board some prestigious liquor; Fayrouz, Desperados, Absolut Vodka, Star Radler, Jameson, Olmeca Tequila, Beefeater Gin, Johnnie Walker, and many others for an exhilarating experience this year.\nWhat is the focus of the Lagos Cocktail week?\nWe are here for the Lagos Cocktail week 2021 and this is the 7th edition.\nHow did the Lagos Cocktail Week begin?"
  },
  {
    "headline": "Standing Tall Against Body-Shaming",
    "summarized_story": "Even today, some thin, tall or plump, young girls still suffer this fate, crushing their self esteem with some developing suicidal tendencies.\nKEMI OTEGBADE: Not only fat people are body-shamedShe stands at 6”.3 tall, a height she gained at only 13!\nIt was okay for boys to be tall but it was a major problem for tall girls whose legs started shooting out very early.\nPeople think it is only fat people who are body-shamed, tall people especially women have been body-shamed from childhood and nobody talks about it, not even their parents.\nHow do you help other young girls now?"
  },
  {
    "headline": "Standing Tall Against Body-Shaming",
    "summarized_story": "Even today, some thin, tall or plump, young girls still suffer this fate, crushing their self esteem with some developing suicidal tendencies.\nKEMI OTEGBADE: Not only fat people are body-shamedShe stands at 6”.3 tall, a height she gained at only 13!\nIt was okay for boys to be tall but it was a major problem for tall girls whose legs started shooting out very early.\nPeople think it is only fat people who are body-shamed, tall people especially women have been body-shamed from childhood and nobody talks about it, not even their parents.\nHow do you help other young girls now?"
  },
  {
    "headline": "Evans Akere: Innovating African Traditional Wear",
    "summarized_story": "Words By – Yemisi SuleimanSince launching his fashion line, Creative Director and CEO of Vanskere, Evans Akere, has become one of the major brands saddled with the responsibility of making African traditional wear acceptable worldwide.\nHow did the VANSKERE brand come to be and how has the brand evolved over the years?\nThe brand has evolved over the years from a basic fashion brand, to a Luxury fashion brand, with emphasis on modern African traditional wear.\nThe Vanskere brand is fun, but there is also a classic appeal to your apparel.\nYou have worked in the fashion industry for quite some years now, what is the best lesson you have learned along the way?"
  },
  {
    "headline": "FG’s insistence on open grazing’ll lead to food shortage – Anglican Bishop warns",
    "summarized_story": "Bishop of Ihiala Diocese of the Church of Nigeria, Anglican Communion, Prof Israel Okoye has warned that the insistence of the Federal Government to support open grazing may lead to food shortage in Nigeria.\nHe said: “Although cattle rearing are key features of animal husbandry, their politicization and seeming treatment as national obligations have attracted objection and resentment.\n“The assumption that the constitution confers on cattle the right of movement along Nigerian roads and communities is untrue.\nAnother errornous stance is that cattle rearing is supported by the federal government, such that herders must be allowed to traverse any part of the country with their cattle as a guarantee for peace.\n“Today, farmers in many parts of Nigeria can no longer go to farm."
  },
  {
    "headline": "NCC upbeat on plans for 5G deployment, restates 97% readiness level",
    "summarized_story": "The Nigerian Communications Commission’s (NCC) plan for Fifth Generation (5G) technology deployment in the country continues to gather momentum with the Commission confirming that its readiness to begin full implementation is at 97 per cent.\nHe said this has made remote work, virtual meetings, virtual studies and virtual healthcare delivery, among others, the new normal.\nDue to the network traffic demand, the EVC said the NCC is working with operators to implement a number of initiatives to ensure network expansion.\nThese, he said, include ongoing plan to auction spectrum in 3.5 gigahertz (Ghz) band to operators for the deployment of 5G network in Nigeria.\nPrior to this, a 5G deployment plan was developed and we have since secured Federal Government’s approval,” he said."
  },
  {
    "headline": "NBA official Ubani declare compulsory vaccination illegal, to sue Nigerian govt",
    "summarized_story": "Monday Ubani, Chairman of Nigerian Bar Association Section on Public Interest and Development Law (NBA-SPIDEL) says he will drag the Buhari administration to court over compulsory vaccination.\nMustapha, Secretary to the Government of the Federation, said civil servants must show proof of vaccination or present a negative PCR test from December 1.\nUbani stressed that the order violated existing labour terms and the fundamental rights of the civil servants to their privacy, life, movement, religious belief and faith, and liberty.\nThe NBA official said any directive on compulsory vaccination is immature, needless, unacceptable and should be totally rejected.\n“When these civil servants were employed, compulsory vaccinations and its attendant punishment for non compliance were not part of their terms of contract."
  },
  {
    "headline": "SERAP sues Buhari, others over plan to monitor WhatsApp messages, phone calls",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari, urging the court to “declare illegal and unconstitutional the plan by the present administration to track, intercept and monitor WhatsApp messages, phone calls, and text messages of Nigerians and other people.”According to SERAP, it severely threatens and violates the right to the preservation of privacy.\nThe suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87 billions to monitor private calls and messages.\nThe suit partly read, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people.”Joined in the suit as Respondents are Abubakar Malami, the Minister of Justice and Attorney General of the Federation and Zainab Ahmed, the Minister of Finance, Budget and National Planning.\nHowever, the date for the hearing of the suit has not been fixed yet."
  },
  {
    "headline": "Insecurity: Anglican Bishop identifies major cause of kidnapping, banditry",
    "summarized_story": "Christian Onyia, Bishop of Anglican Diocese of Nike in Enugu State has proffered major solutions to kidnapping and banditry in Nigeria.\nOnyia said Nigeria had witnessed an increase in kidnapping and banditry due to inequity, injustice, poverty, lack of education and lack of employment opportunities.\nHe said the issues of kidnapping and banditry would be a thing of the past if the issues identified were dealt with.\nAccording to Onyia: “Inequity, injustice, poverty, lack of education and lack of opportunities for employment are major drivers of insecurity in the country.\nHe stressed that with the current level of kidnapping and banditry, it “seems the Federal and state governments are not doing enough to tackle them”."
  },
  {
    "headline": "Laycon, Neo throw weight behind Orijin new flavour",
    "summarized_story": "Almost 12 months after being unveiled as Orijin ambassadors, BBNaija 2020 winner Laycon and one of the five finalists, Neo, have thrown their weight behind a newly launched Orijin flavour, Tigernut, and Ginger.\nThe reality TV stars joined stakeholders and Guinness Nigeria executives at the launch of the new Orijin flavoured recently.\n- Advertisement -- Advertisement -Laycon also performed two of his new songs while reiterating his backing of all the Orijin flavours as well as the newest flavour, Tigernut, and Ginger.\nThe new Orijin Tigernut and Ginger is here to match our fierce energy.\nOur new addition to the Orijin family, Tigernut and Ginger, will carry the same trusted Orijinal heritage."
  },
  {
    "headline": "Shola Fapson warns against flaunting relationships on social media",
    "summarized_story": "Nollywood actress, Shola Fapson has advised against flaunting romantic relationships on social media.\nThe actress said that relationships that are meant to last must be kept away from the eyes of the internet, stating that one can only post eyes, teeth, and other parts of their other half but must never post their face.\nFapson noted that these are some of the things she has learned in recent times.\n- Advertisement -“What I have learned from September and October, keep who you be fucking away from social media.\n- Advertisement -- Advertisement -She continues saying, “Go on dates, baecations, surprise things, post ears, teeth, and fingernails, but avoid showing these Zuckerberg streets your significant other."
  },
  {
    "headline": "Adunni Ade: A sound engineer once groped me on set",
    "summarized_story": "Nollywood actress Adunni Ade has narrated her encounter with a crew member that groped her on a film set.\nThe actress took time to explain how a male sound engineer tried to touch and intimidate her after confronting him.\n- Advertisement -However, according to the actress whose new movie ‘Soole’ is premiering soon, the sound man allegedly pulled her bra and she shoved his hand in between her bra down to her bottom.\nNow in my head, I’m beginning to think that there is a hidden obsession with this man.\nI was shocked when I turned around and saw the sound engineer, his hand was inside my back again.”She further disclosed how the sound engineer tried to intimidate her during a confrontation."
  },
  {
    "headline": "South Africa star DBN Gogo joins Tiwa Savage for Spotify Equal",
    "summarized_story": "South Africa music star DBN Gogo has joined Nigeria’s Tiwa Savage for the Spotify music programme, Equal.\nAccording to a statement from Spotify, DBN Gogo made the list as Africa artist of the month after the popular AmaPiano DJ emerged as the first South African artist to join a growing roster of influential female creators.\n- Advertisement -DBN Gogo recently claimed a spot on the top 10 list of the most streamed artists by South African youth on Spotify.\n“Being a part of Spotify’s EQUAL Music Programme is a reminder that I do not need to apologise for being a powerful woman.\nSo, I decided to make every moment count to ensure that I become everything I wanted,” says DBN Gogo."
  },
  {
    "headline": "KALU HAILS OONI OF IFE, OBA ADEYEYE OGUNWUSI AT 47",
    "summarized_story": "Former Governor of Abia state and Chief Whip of the Senate, Dr Orji Kalu has felicitated with the Ooni of Ife, Oba Adeyeye Ogunwusi on the occasion of his 47th birthday anniversary.\nKalu, who admonished the Ooni of Ife not to relent in his efforts to advance the cause of the people, added that traditional rulers play key roles in promoting unity and harmony across the country.\nHe said, ” on behalf of the people of Abia North Senatorial, I convey my best wishes to the Ooni of Ife, Oba Adeyeye Ogunwusi on the occasion of his 47th birthday anniversary.\n“The Ooni of Ife is a role model to his contemporaries and the younger generation owing to his contributions to humanity.\n“As the paramount ruler marks his 47th birthday anniversary, I wish the Ooni of Ife longer reign on the stool of his forefathers”."
  },
  {
    "headline": "At The Sun Awards: Nigeria’s unity negotiable –Kingibe",
    "summarized_story": "The ceremony is indisputably adjudged the biggest media event in Nigeria.\nGovernors, state and federal legislators, politicians across parties, captains of industry, business moguls, and academics, among others, were in attendance.\nThe night was not only restricted to speeches, handing out awards and honours to those who deserved them.\nWhile the seated guests were waiting for the event to officially begin, the Shuga Band crew sang their hearts out.\nBabagana Kingibe, former SGF (Lifetime Achievement); Chief Frank Okafor, chairman of Marco Polo Group Limited and Prince Chris Igwe, chairman, Mainland Oil Limited (Investor of the Year)."
  },
  {
    "headline": "Sun Awards: We’re building for present, future generations –Wike, Man of the year",
    "summarized_story": "Neya Kalu, who represented her father, Senator Orji Uzor Kalu, commended the awardees for being singled out among millions of Nigerians for the award, saying it was a great feat.\nThe Sun Entrepreneur of the Year award winner, Nnamdi Ezeigbo, in his response, expressed gratitude to The Sun Management for the recognition.\nIn his acceptance speech, the Sun Hospitality Icon of the Year, Chief Obi Iyiegbu, popularly called Obi Cubana, expressed gratitude to God for placing him where he stands today.\nAlso, The Sun Entrepreneur of the Year award winner, Nnamdi Ezeigbo, in his response, expressed gratitude to The Sun Management for the recognition.\nIn his acceptance speech, the Sun Hospitality Icon of the Year, Chief Obi Iyiegbu, popularly called Obi Cubana, expressed gratitude to God for placing him where he stands today."
  },
  {
    "headline": "PDP presidential ticket: Governors, Atiku, others in final battle",
    "summarized_story": "All the gladiators have their eyes on the 2023 PDP presidential ticket.\nAtiku, Saraki, Aminu Tambuwal (Sokoto State governor), Ifeanyi Okowa ( Delta State governor), Nyesom Wike (Rivers State governor) and Bala Mohammed (Bauchi State governor), respectively are touted to be interested in the 2023 PDP presidential ticket.\nThe recent zoning formula for party offices was a fallout of the meeting of the PDP Governors Forum held in September.\nUncertainty over zoning of presidential ticketRegardless, with the national chairmanship position seemingly settled, attention has now shifted to the zoning of the presidential ticket.\nOrdinarily, with the PDP chairmanship position going to the North, the presidential candidate should automatically come from the South."
  },
  {
    "headline": "I’ve no regrets on how my tenure ended as Rivers governor – Celestine Omehia",
    "summarized_story": "Those issues that made you to vie for governor, have they been addressed by Amaechi and Governor Nyesom Wike?\nDo you have any regret not completing your tenure as governor of Rivers State?\nI have said I have no regrets on how my tenure ended and I am eternally grateful to God and the good people of Rivers State who gave me that opportunity to serve.\nWhat method did you deploy to tackle insecurity during your stint in Rivers State that you think the Federal Government can emulate?\nThis method brought in the needed peace and economic growth in Rivers State, Niger Delta and Nigeria as a whole."
  },
  {
    "headline": "In a Dramatic Shift, Kingibe Says Nigeria’s Unity Negotiable",
    "summarized_story": "Speaking yesterday at The Sun Newspaper Awards for 2020 held in Lagos, Kingibe however said even the union between a husband and wife is negotiable.\nKingibe, who received the newspaper’s ‘Lifetime Achievement Award,’ called on Nigerians to learn to respect one another.\n“However, I think that a few of my colleagues believe that the unity of Nigeria is not negotiable.\nSpeaking specifically on the issue of those agitating to leave the country, Kingibe said: “When we ever say we want to go away, I do not think they realise the going away.\nTambuwal stated this when the Chairman of the Christian Association of Nigeria (CAN), Rev."
  },
  {
    "headline": "Crisis Hits APC Congresses in Lagos, Abia, Akwa Ibom, Niger, Enugu, Kwara, Others",
    "summarized_story": "In Lagos State, the APC held three parallel congresses across the state.\nThe State Congress by loyalists of Chief Ikechi Emenike was organised at the Indoor Sports Hall of Umuahia Township Stadium.\nAt the congress held in Owerri, the state capital, Uzodimma’s aide and long-time loyalist, Macdonald Ebere emerged as the state chairman.\nIn Kano State, Governor Abdullahi Umar Ganduje has declared that only the congress held at Sani Abacha Stadium was legal.\nMr. Emeka Beke emerged as the Chairman of Rivers State APC, according to the results announced by the Chairman, Rivers APC Congress Screening Committee, Dr. Abubakar Idris."
  },
  {
    "headline": "Terror Attacks: UK Warns Citizens against Travelling to 12 Nigerian States",
    "summarized_story": "Ejiofor AlikeThe United Kingdom government has warned its citizens in Nigeria against visiting 12 states in the country over possible terror attacks.\nIt also cautioned UK citizens against travelling to the non-riverine areas of Delta, Bayelsa and Rivers states.\n“There may be protests and a heightened security presence in major cities such as Lagos and Abuja.\nThere may be additional protests and a heightened security presence in Abuja and in the South-east for this reason.\nProtests, including “Stay at Home” protests, are likely during October in the South-east region."
  },
  {
    "headline": "500,000 People at Risk of Starvation in North-east, Says UN",
    "summarized_story": "The region has been a mainstay of insurgency attacks for over a decade and the situation has been worsened by the impact of the COVID-19 pandemic and rising high food prices, the WFP said.\nThe UN agency also said the number of internally displaced persons surpassed two million in September.\nHe added that the number of internally displaced surpassed two million in September 2021, reaching another grim milestone.\n“Our food assistance is a lifeline for millions whose lives have been upended by conflict and have almost nothing to survive on.\n“To sustain humanitarian operations in the North-east Nigeria until March 2022, WFP urgently requires $197 million.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Pressure Mounts on Secondus to Withdraw Court Case over PDP Chairmanship",
    "summarized_story": "The High Court of Rivers State sitting in Degema had suspended Secondus as national chairman, but the suspension was set aside by a Kebbi State High Court.\nIn the last sitting of the Court of Appeal, the court in a dramatic manner announced the transfer of the Secondus’ appeal to Port Harcourt, stating that it was where the substantive suit originated.\nThe South-west PDP stakeholders have asked the National Vice Chairman, Ambassador Taofeek Arapaja, to seek re-election as the Deputy National Chairman for the South.\nIn compliance, Arapaja, at the weekend resigned as the vice national chairman for South-west and obtained a nomination form to seek election as the consensus deputy national chairman (South).\nBefore then, stakeholders of the PDP had scheduled Oyinlola as the deputy national chairman for South."
  },
  {
    "headline": "Members Of Apostle Suleman's Church Threaten To Kill YouTuber For Exposing Cleric's Miracle Money Scam",
    "summarized_story": "A YouTuber, Israel Balogun who runs the Wholeness Africa Initiatives channel, has alleged death threats to his life by members of the Omega Fire Ministries led by Apostle Johnson Suleman over a 'Miracle Money' scandal.\nBalogun, in the video, that has generated controversies, had said there was nothing like miracle money but a planned scheme to make people believe angels were dropping money into their accounts.\nHe also alleged that the pastor and ministers of the church will use such tactics to take double of such amounts from church members who received the miracle money.\nSuleman said again, \"Miracle alert, as you get it, run here.\nGod does not deposit money in people's accounts, angels do not share money."
  },
  {
    "headline": "Members Of Apostle Suleman's Church Threaten To Kill YouTuber For Exposing Cleric's Miracle Money Scam",
    "summarized_story": "A YouTuber, Israel Balogun who runs the Wholeness Africa Initiatives channel, has alleged death threats to his life by members of the Omega Fire Ministries led by Apostle Johnson Suleman over a 'Miracle Money' scandal.\nBalogun, in the video, that has generated controversies, had said there was nothing like miracle money but a planned scheme to make people believe angels were dropping money into their accounts.\nHe also alleged that the pastor and ministers of the church will use such tactics to take double of such amounts from church members who received the miracle money.\nSuleman said again, \"Miracle alert, as you get it, run here.\nGod does not deposit money in people's accounts, angels do not share money."
  },
  {
    "headline": "How Pastor Enenche Of Dunamis Church Invited Security Operatives To Arrest #BuhariMustGo Activists—DSS Reveals",
    "summarized_story": "SaharaReporters learnt on Tuesday that the DSS had admitted that the Dunamis church called them to take away the \"suspects.\"\nSee Also Christianity Whereabouts Of Six #BuhariMustGo Protesters Arrested In Dunamis Church Unknown As DSS Denies Involvement“About 48 hours after illegal arrest and detention by Dunamis church, we don’t know the whereabouts of these #BuhariMustGo activists,” one of the sources said.\nEarlier, the FCT command of the DSS as well as the headquarters had both denied being in custody of five activists arrested by Dunamis church security.\nSee Also ACTIVISM You Had No Right To Arrest Activists For Wearing #BuhariMustGo T-shirts—Lawyer Slams Pastor Enenche, Dunamis Church\"The five activists arrested at Dunamis are being detained by DSS director of FCT.\nWhile clarifying the matter, Sowore said the pastor denied claims by some persons that the activists were trying to disrupt the church service."
  },
  {
    "headline": "How Pastor Enenche Of Dunamis Church Invited Security Operatives To Arrest #BuhariMustGo Activists—DSS Reveals",
    "summarized_story": "SaharaReporters learnt on Tuesday that the DSS had admitted that the Dunamis church called them to take away the \"suspects.\"\nSee Also Christianity Whereabouts Of Six #BuhariMustGo Protesters Arrested In Dunamis Church Unknown As DSS Denies Involvement“About 48 hours after illegal arrest and detention by Dunamis church, we don’t know the whereabouts of these #BuhariMustGo activists,” one of the sources said.\nEarlier, the FCT command of the DSS as well as the headquarters had both denied being in custody of five activists arrested by Dunamis church security.\nSee Also ACTIVISM You Had No Right To Arrest Activists For Wearing #BuhariMustGo T-shirts—Lawyer Slams Pastor Enenche, Dunamis Church\"The five activists arrested at Dunamis are being detained by DSS director of FCT.\nWhile clarifying the matter, Sowore said the pastor denied claims by some persons that the activists were trying to disrupt the church service."
  },
  {
    "headline": "You Can’t Win Election In Your Church – Primate Ayodele Tackles Pastor Bakare Over ‘Selfish Claims On 2023 Presidency’",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has taken a swipe at Pastor Tunde Bakare of the Citadel Global Community Church over the latter's comment on running for president in 2023.\nReacting, Primate Ayodele frowned at the remark stating that Pastor Bakare should face his missionary work and stop mismanaging the grace of God upon his life.\nAyodele noted that Bakare cannot win an election in his church not to talk of winning an election in Nigeria.\nSee Also Politics Pastor Tunde Bakare Back In Aso Villa To See Buhari 82 Days After Vowing 'No More Visits'‘’Tunde Bakare is mismanaging the grace of God upon his life and ministry.\nAddressing his members, Bakare had said the new group would be greater than the “Save Nigeria Group”, a pressure group which he convened in 2010."
  },
  {
    "headline": "FULL LIST: UK advises citizens against travelling to 12 Nigerian states",
    "summarized_story": "The United Kingdom (UK) says Boko Haram insurgents are likely to kidnap foreign nationals, warning its citizens against travelling to twelve states in Nigeria.\nThe UK government said there is a high threat of kidnap throughout Nigeria for ideological, financial or political gain.\nHumanitarian hubs and humanitarian workers have been targeted during attacks in the North East, including Monguno, Borno State on 13 June 2020,” the advisory reads.\nAs well as in North-East Nigeria, extremist groups operate in some northern and middle belt states including Bauchi, Gombe, Kano, Kogi, Kaduna, Niger and Adamawa states.\nProtests, including “Stay at Home” protests, are likely during October in the South East region."
  },
  {
    "headline": "FULL LIST: UK advises citizens against travelling to 12 Nigerian states",
    "summarized_story": "The United Kingdom (UK) says Boko Haram insurgents are likely to kidnap foreign nationals, warning its citizens against travelling to twelve states in Nigeria.\nThe UK government said there is a high threat of kidnap throughout Nigeria for ideological, financial or political gain.\nHumanitarian hubs and humanitarian workers have been targeted during attacks in the North East, including Monguno, Borno State on 13 June 2020,” the advisory reads.\nAs well as in North-East Nigeria, extremist groups operate in some northern and middle belt states including Bauchi, Gombe, Kano, Kogi, Kaduna, Niger and Adamawa states.\nProtests, including “Stay at Home” protests, are likely during October in the South East region."
  },
  {
    "headline": "Nigeria's unity is negotiable, says Kingibe",
    "summarized_story": "Babagana Kingibe, a former secretary to the government of the federation (SGF), says the unity of Nigeria is negotiable.\nAdvertisement“However, I think that a few of my colleagues believe that the unity of Nigeria is not negotiable.\nEven the unity of a family is negotiable.\n“The moment either party feels this union is no longer bearable, that he or she will rather go his/her way.\nSo, I am going.”AdvertisementKingibe said those seeking secession from Nigeria should consider the implications of leaving and how it would affect them."
  },
  {
    "headline": "Nigeria's unity is negotiable, says Kingibe",
    "summarized_story": "Babagana Kingibe, a former secretary to the government of the federation (SGF), says the unity of Nigeria is negotiable.\nAdvertisement“However, I think that a few of my colleagues believe that the unity of Nigeria is not negotiable.\nEven the unity of a family is negotiable.\n“The moment either party feels this union is no longer bearable, that he or she will rather go his/her way.\nSo, I am going.”AdvertisementKingibe said those seeking secession from Nigeria should consider the implications of leaving and how it would affect them."
  },
  {
    "headline": "INSIGHT: Piracy hurting Nigeria’s music industry — but is it a necessary evil?",
    "summarized_story": "Today, Nigeria’s music industry players still struggle to knock out random blogs illegally offering songs for free, barely minutes after they debut on streamers like Apple and Spotify.\nMusic shouldn’t be free but, for some reason, the majority of Nigerian hit songs are on blogs at no cost.\nHowever, music industry executives argue that it doesn’t adequately account for trends in the digital economy.\nIn early 2021, Dotman, an Afropop singer, had argued that many Nigerian artistes need piracy to attain increased music circulation due to a structure he claimed is rigged against creatives.\nI don’t want to mention names but some online pirates became celebrities in the music industry and a lot of artistes are friends with them,” the ex-label executive said."
  },
  {
    "headline": "Why Nigerian neobank, Sparkle, preferred local investors in $3.1m funding",
    "summarized_story": "Sparkle, a mobile-based digital bank that provides a combination of financial, lifestyle, and business support services to Nigerians, on Thursday, announced a $3.1 million seed fundraise from entirely Nigerian investors.\nThe latest funding brings Sparkle’s total investment secured to $5.1 million, having previously raised $2 million in pre-seed from friends and family.\n“They all understand the real need for a digital-first platform such as Sparkle.”Get the best African tech newsletters in your inboxIt’s not common in the Nigerian tech ecosystem that a funding round of such value comprises only local investors.\nAccording to Dozie, the Sparkle team was “very deliberate” about having an all-Nigerian round as it always felt that having a selection of strategic local investors would be beneficial to the startup’s growth.\nWe wanted to make sure our investors really understood the market before committing to this round,” he told TechCabal."
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "M-Pesa, Opay, Telebirr, Palmpay: How Chinese tech is powering African fintech",
    "summarized_story": "These Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\nNotably, Wapi Pay, a Singapore-based Kenyan fintech startup powering the Africa-Asia cross-border payment, uses Huawei’s mobile money services.\nAn indication that contemporary fintech startups are also relying on Chinese tech.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Edo govt, NEMA, others sensitise residents on fire disaster mgt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government in partnership with the National Emergency Management Agency (NEMA) and the Nigerian Red Cross Society has intensified sensitisation on fire disaster management.\nAddressing journalists after a road show to mark the 2021 World Disaster Risk Reduction Day, with the theme, “Fire Outbreak and Mitigation Response Sensitization,” in Benin City, the Functioning Director, Edo State Emergency Management Agency (EDOSEMA), Mrs. Carol Odion said the state government will sustain the effort to enlighten residents on fire disaster management.\nThe Assistant Head, Edo Office of the National Emergency Management Agency (NEMA), Omeje Ifeanyi, said: “We are partnering with EDOSEMA to sensitise the public and bring the issue of management of fire outbreaks to the notice of Edo residents.\n“I urge residents in Edo State to do everything to avoid a fire rather than calling on the government for support.\nFire is nobody’s friend as the damage from an outbreak is unquantifiable."
  },
  {
    "headline": "Edo Poly sets for 3rd, 4th convocation, to honour Betsy Obaseki, Omobude, Ogbeifun, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, has unveiled plans to hold its 3rd and 4th convocation ceremony and confer honourary fellowship awards to four Nigerians for their contribution to the development of the state and the country.\nRector, Edo State Polytechnic, Prof. Abiodun Falodun, in a chat with journalists, said the convocation ceremony is billed to hold from October 26 to 28, at the polytechnic main auditorium in Usen, Ovia South-West Local Government Area of Edo State.\nProf. Falodun said the four Nigerians to be honoured at the school’s convocation ceremony include the First Lady of Edo State, Mrs. Betsy Obaseki; Managing Director/CEO of Starzs Marine and Engineering Limited, Engr.\nAccording to him, “We would be holding a combined convocation ceremony this year.\nAnother highlight of this year’s ceremony is the unveiling of the Gabriel Igbinedion administrative complex to the public,” he added."
  },
  {
    "headline": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta Apartment – Nigerian Observer",
    "summarized_story": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta ApartmentShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – A middle-aged lady, identified as Michelle Bazunu, has been allegedly gruesomely murdered at her residence in Bazunu Street, Warri South council area of Delta State.\nDetails of the incident were still sketchy as at Thursday, but it was gathered that the deceased was found with multiple stab wounds and her throat slit in the early hours of Wednesday, October 13, at No1 Bazunu Street, Warri.\nThe area which is close to the popular Igbudu Market in Warri, is notorious for some heinous crimes.\nSecurity operatives were said to have stormed the area in a raid, a while after the victim was gruesomely, murdered.\nWhen contacted, the Delta State Police Public Relations Officer (PPRO), DSP Bright Edafe, could not confirm the sad incident."
  },
  {
    "headline": "Obaseki, Igbinedion, others pay last respect to late Sir Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki; former Governor, Lucky Igbinedion; Edo State Chief Judge, Hon.\nOsaigbovo Iyoha were among dignitaries at the tribute/service of songs held in honour of late music icon, Prof. Sir Victor Uwaifo.\nGovernor Obaseki described Uwaifo as a legend who carved a niche for himself and portrayed Edo State positively to the global community.\nOn his part, Lucky Igbinedion described late Uwaifo as a cultural ambassador and a great musical icon that brought glory to Edo, Nigeria and Africa.\nI thank the Uwaifo family for allowing him to serve the state."
  },
  {
    "headline": "SERAP sues Buhari, wants court to declare ‘plan to monitor WhatsApp illegal’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari, asking the court to “declare illegal and unconstitutional the plan by the administration to track, intercept and monitor WhatsApp messages, phone calls, and text messages of Nigerians and other people, as it severely threatens and violates the right to the preservation of privacy.”The suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87 billion to monitor private calls and messages.\nThe amount is part of the N895.8 billion supplementary budget approved by the National Assembly.\nIt also fails to meet the requirements of legality, necessity, and proportionality.”According to SERAP, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people.”SERAP is also arguing that “The mere threat of mass surveillance, even when secret, coupled with the lack of remedy, can constitute an interference with human rights, including the rights to privacy, freedom of expression, peaceful assembly and association.”SERAP is further arguing that “Privacy and expression are intertwined in the digital age, with online privacy serving as a gateway to secure exercise of the freedom of opinion and expression.\nTherefore, targets of surveillance would suffer interference with their rights to privacy and freedom of opinion and expression whether the effort to monitor is successful or not.”Joined in the suit as Respondents are Abubakar Malami, Minister of Justice and Attorney General of the Federation; and Zainab Ahmed, Minister of Finance, Budget and National Planning."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Two chairmen emerge as Osun APC holds parallel congresses",
    "summarized_story": "Rasaq Salinsile have emerged chairmen of the All Progressive Congress (APC) in Osun State, as party members today, held parallel congresses.\nAnnouncing the results of the Congress, the Chairman of the National Committee on the Osun State Congress, Hon.\n“The All Progressives Congress emerged on the strength of unity and progressive ideals.\nWe remain one united family, and we remain focused on delivering unprecedented progress and development to Osun”, Oyetola said.\nLet’s work for the perpetuation of our government in Osun State through all- known legitimate means”, Famodun said."
  },
  {
    "headline": "CBN Governor, Godwin Emefiele to grace NBE October 28 Lecture",
    "summarized_story": "The Governor of Central Bank of Nigeria (CBN), Mr Godwin Emefiele, is scheduled to give the keynote address at the fourth anniversary lecture of National Business Extra (NBE) newspaper slated for October 28, 2021 in Lagos.\nAs part of the landmark event, the newspaper shall publish special edition of exclusive interviews and/or features stories of the award recipients in all its platforms.\nNBE, an authoritative nationwide newspaper that comes out as a weekly hardcopy and daily online platforms, hit the newsstands in 2017.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "PSL Capital Limited Rebrands, changes name to Parthian Securities Limited",
    "summarized_story": "An indigenous broker/dealer firm, PSL Capital Limited, has completed what it called a strategic rebranding effort as part of its accelerated company growth and renewal of its corporate vision.\nAt the core of the rebrand is a change of the company name to Parthian Securities Limited and an update to the corporate logo and domain name (parthiansecuritiesng.com)Over the past five years, Parthian Securities Limited has cemented its status as a market leader for securities trading in Nigeria and across Africa, a statement from the firm said.\nThis growth reflects the increasing recognition of individuals and companies that Parthian Securities Limited offers an easy and convenient platform for real-time trading of securities.\n“Over the past nine years, we’ve built a strong reputation for innovation and excellence,” said Oluseye Olusoga, Group Managing Director, Parthian Partners Limited.\nCommenting, the Acting Managing Director, Parthian Securities Limited, Mr Ogunwale Kehinde, said: “We are excited about this change, and it marks a strategic pivot in our future direction as a business."
  },
  {
    "headline": "Three dragged to court for attempted murder, theft in Ebonyi",
    "summarized_story": "By Monday OkoroThe Ebonyi State Police Command today, arraigned three men, all indigenes of Afikpo South LGA, to a High Court sitting in Afikpo, for attempted murder, conspiracy and stealing.\nThe suspects: Chukwuemeka Chima, Oko Eseni Oko (Secretary, Caretaker Committee of Amangwu Development Union) and Daniel Nnachi Agwu, were charged with the crime along with two others presently at large.\nOne of the suspects, Chima is also facing two other seperate but similar criminal charges.\nOn his part, Oko Eseni Oko was reportedly rusticated from Ebonyi State University years back for suspected cult-related activities.\nThe offences were committed at Amangwu Edda, in Afikpo South LGA in September, 2019."
  },
  {
    "headline": "Aisha Babangida Seeks Synergy Among NGO For Women Empowerment",
    "summarized_story": "The chairman of the Better Life Programme for African Rural Women (BLPARW), Aisha Babangida, has advocated the need for non-governmental organisations in the country to synergies so as to adequately empower women and girl children in the country.\nOn efforts to change the fortunes of the women, she said BLPARW is connecting with the women, training them, and ensuring they have skills and tools for their businesses so as to provide additional sources of income for them.\nWe also want to ensure that they have the skill and tools for their businesses which will, in turn, provide additional sources of income for them.\nTallen decried that Nigerian rural women and girl child face threats, ranging from domestic violence, sexual harassment, traditional and harmful practices, fear of intimidation, limited access to training facilities, education, malnutrition, and lack of health care facilities.\n‘’If each of us here adopts a strategy of educating a girl child it will go a long way as the government cannot do everything,’’ she added."
  },
  {
    "headline": "Aisha Babangida Seeks Synergy Among NGO For Women Empowerment",
    "summarized_story": "The chairman of the Better Life Programme for African Rural Women (BLPARW), Aisha Babangida, has advocated the need for non-governmental organisations in the country to synergies so as to adequately empower women and girl children in the country.\nOn efforts to change the fortunes of the women, she said BLPARW is connecting with the women, training them, and ensuring they have skills and tools for their businesses so as to provide additional sources of income for them.\nWe also want to ensure that they have the skill and tools for their businesses which will, in turn, provide additional sources of income for them.\nTallen decried that Nigerian rural women and girl child face threats, ranging from domestic violence, sexual harassment, traditional and harmful practices, fear of intimidation, limited access to training facilities, education, malnutrition, and lack of health care facilities.\n‘’If each of us here adopts a strategy of educating a girl child it will go a long way as the government cannot do everything,’’ she added."
  },
  {
    "headline": "Professor Of Journalism Alleges Threat To Life In Petition",
    "summarized_story": "A professor of journalism and mass communication, Olatunji Dare, has written an open letter to the public after petitioning the Nigeria Police over what he describes as a verbal threat to life from an electrical engineer.\nThe emeritus professor of journalism said, “Olukato had never told me that there was any third party to the transaction.\nHe added that the commander put calls to Olukato several times but he had been evasive, claiming he was in Maiduguri, Lagos or Abuja.\nOur reporter called Olukato’s number several times yesterday, but a woman answered, claiming it was a wrong number.\nThe state police spokesman, Mr William Aya, said the matter had not yet been escalated to the state police command."
  },
  {
    "headline": "Professor Of Journalism Alleges Threat To Life In Petition",
    "summarized_story": "A professor of journalism and mass communication, Olatunji Dare, has written an open letter to the public after petitioning the Nigeria Police over what he describes as a verbal threat to life from an electrical engineer.\nThe emeritus professor of journalism said, “Olukato had never told me that there was any third party to the transaction.\nHe added that the commander put calls to Olukato several times but he had been evasive, claiming he was in Maiduguri, Lagos or Abuja.\nOur reporter called Olukato’s number several times yesterday, but a woman answered, claiming it was a wrong number.\nThe state police spokesman, Mr William Aya, said the matter had not yet been escalated to the state police command."
  },
  {
    "headline": "Street Sweepers Get Free Breast and Cervical Cancer Screening, Treatment In Lagos",
    "summarized_story": "Many street sweepers and other women engaged by Lagos Waste Management Authority (LAWMA), have received free breast and cervical cancer screening and treatment, through the agency’s collaboration with Optimal Cancer Care Foundation and Access Bank Plc.\nHe said, “I took interest in this partnership to let you know that your well-being is our priority and we will continue to look after you.\n“I appreciate Optimal Cancer Care Foundation and Access Bank, for choosing LAWMA for this great opportunity exposed to our women.\n70 percent of our workforce is women, this (the screening exercise) is to let you know that we are looking after your health”, he stressed.\nADVERTISEMENTAlso speaking, the medical director of Optimal Cancer Care Foundation, Dr. Femi Olaleye, lectured the women on self- examination for early detection of cervical and breast cancer and the signs to look out for, adding that they should immediately consult their doctors, any time they noticed unusual signs."
  },
  {
    "headline": "Two arrested in Rivers over pornographic display on electronic billboard",
    "summarized_story": "Two arrested in Rivers over pornographic display on electronic billboardTwo arrested in Rivers over pornographic display on electronic billboardThe Rivers State Government says two persons have been arrested in connection to the display of pornographic content on an electronic billboard located in the Garrison axis of Port Harcourt on Thursday.\nThe acting Managing Director, Rivers State Signage and Advertisement Agency, Tony Okeah, told journalists that those arrested were believed to be working for the firm that owns the billboard.\nOur correspondent gathered that some persons believed to be working for the company that owns the gigantic electronic billboard located beside the Rebisi flyover had inserted the wrong video clip, resulting in a public outcry.\n“It is a big blow to the company that owns the billboard structure because we shut down the equipment and now the investigation is ongoing.\nThe two persons who have been arrested are at the Olu Obadanjo Police Station.” Punch."
  },
  {
    "headline": "Two arrested in Rivers over pornographic display on electronic billboard",
    "summarized_story": "Two arrested in Rivers over pornographic display on electronic billboardTwo arrested in Rivers over pornographic display on electronic billboardThe Rivers State Government says two persons have been arrested in connection to the display of pornographic content on an electronic billboard located in the Garrison axis of Port Harcourt on Thursday.\nThe acting Managing Director, Rivers State Signage and Advertisement Agency, Tony Okeah, told journalists that those arrested were believed to be working for the firm that owns the billboard.\nOur correspondent gathered that some persons believed to be working for the company that owns the gigantic electronic billboard located beside the Rebisi flyover had inserted the wrong video clip, resulting in a public outcry.\n“It is a big blow to the company that owns the billboard structure because we shut down the equipment and now the investigation is ongoing.\nThe two persons who have been arrested are at the Olu Obadanjo Police Station.” Punch."
  },
  {
    "headline": "Reps propose bill on takeover of NIJ by government",
    "summarized_story": "A bill to transfer ownership of the Nigeria Institute of Journalism in Lagos to a Federal Government owned and funded institution is currently being considered in the House of Representatives.\nThe section states that “the Governing Council of the Institute shall consist of a Chairman and the following members to be appointed by the President.\nThe bill also grants members of the governing council a four year renewable term of office.\nSection 18 of the bill states that the Institute will be funded from the annual budget and other sundry sources such as gifts, grants subscription, fees and charges for services rendered.\nWhen contacted about the bill, President of the Nigeria Union of Journalists, Chris Isiguzo said he was not aware of the existence of such bill and would not be able to comment on it until he has seen the bill."
  },
  {
    "headline": "Reps propose bill on takeover of NIJ by government",
    "summarized_story": "A bill to transfer ownership of the Nigeria Institute of Journalism in Lagos to a Federal Government owned and funded institution is currently being considered in the House of Representatives.\nThe section states that “the Governing Council of the Institute shall consist of a Chairman and the following members to be appointed by the President.\nThe bill also grants members of the governing council a four year renewable term of office.\nSection 18 of the bill states that the Institute will be funded from the annual budget and other sundry sources such as gifts, grants subscription, fees and charges for services rendered.\nWhen contacted about the bill, President of the Nigeria Union of Journalists, Chris Isiguzo said he was not aware of the existence of such bill and would not be able to comment on it until he has seen the bill."
  },
  {
    "headline": "Buhari, Malami sued over 'plan to monitor WhatsApp messages'",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari.\nThe human rights group asked the court to “declare illegal and unconstitutional the plan by Buhari’s administration to track, intercept and monitor WhatsApp messages, phone calls, and text messages of Nigerians and other people, as it severely threatens and violates the right to the preservation of privacy.”The suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87bn to monitor private calls and messages.\nThe amount is part of the N895.8bn supplementary budget approved by the National Assembly.\nIt also fails to meet the requirements of legality, necessity, and proportionality.”According to SERAP, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nNo date has been fixed for the hearing of the suit."
  },
  {
    "headline": "CAC set to block fraudulent registration applications",
    "summarized_story": "By Ikenna UwadilekeThe Corporate Affairs Commission (CAC) has resolved to block suspected fraudulent applications to register new companies.\nAlhaji Garba Abubakar, the registrar-general of CAC, pointed out that the measure was to further boost the Federal Government’s fight against corruption.\n“Given the provisions of the law, the Commission discontinued the issuance of certified true copies of some documents.\nIn addition, CAC will deploy a Customer Relationship Management (CRM) system toward resolving customer challenges in real-time.\nAyoola Olukanni, Director-General Nigerian Association of Chambers of Commerce, Mines and Agriculture (NACCIMA) and Monturayo Elegberum from Manufacturers Association of Nigeria (MAN)."
  },
  {
    "headline": "SERAP Sues Buhari, Others Over Plan To Monitor WhatsApp Messages, Phone Calls.",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari, requesting that the court “declare illegal and unconstitutional the current administration’s plan to track, intercept, and monitor WhatsApp messages, phone calls, and text messages of Nigerians and others.”According to SERAP, it severely threatens and violates the right to the preservation of privacy.\nThe suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87 billions to monitor private calls and messages.\nThe suit partly read, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people.”Joined in the suit as Respondents are Abubakar Malami, the Minister of Justice and Attorney General of the Federation and Zainab Ahmed, the Minister of Finance, Budget and National Planning.\nHowever, the date for the hearing of the suit has not been fixed yet."
  },
  {
    "headline": "#EndSARS: How Buhari’s Regime, Lagos Governor Sanwo-Olu Mobilised Armed Thugs To Attack Unarmed Protesters — Sowore",
    "summarized_story": "Human rights activist, Omoyele Sowore has said President Muhammadu Buhari’s regime mobilised armed thugs to disrupt the #EndSARS protest which was organised by young Nigerians last year.\nAccording to him, Buhari’s regime conveyed thugs in government-registered vehicles to attack peaceful protesters, leading to the death of some of the demonstrators.\nHe further said the Lagos State governor, Babajide Sanwo-Olu gave out air-conditioned BRT buses to the hoodlums to invade a protest venue last October.\n#RevolutionNow #BuhariMustGo.”Buhari had in the past claimed last year’s #EndSARS protest against police brutality was aimed at removing him from office.\n“This question was answered last year when there was the #EndSARS protest."
  },
  {
    "headline": "Nigeria’s Anti-graft Agency, EFCC Invites Ex-Vice Presidential Candidate, Peter Obi For Questioning",
    "summarized_story": "The EFCC, Nigeria’s anti-corruption agency, has summoned Peter Obi, the former governor of Anambra State, for questioning over his secret and illegal offshore operations, which PREMIUM TIMES reported in the ongoing Pandora Papers series.\nSources separately said the invitation is in connection with revelations in our Pandora Papers report.\nMr Obi has, however, continued to claim no wrongdoing.\nOthers included Governor Abubakar Bagudu of Kebbi State, Governor Gboyega Oyetola of Osun State as well as his associates including former Lagos Bola Tinubu, and Ogun State Governor Dapo Abiodun.\nIt is not clear if the EFCC’s action on Mr Obi is connected to Mr Buhari’s directive."
  },
  {
    "headline": "Medical Trip: What My Aso Rock Sources Told Me About Buhari – Reno Omokri.",
    "summarized_story": "Reno Omokri, a former presidential adviser, claims that some insiders at Aso Rock told him that President Muhammadu Buhari is planning another medical vacation to London, United Kingdom.\nOmokri had constantly argued that President Buhari’s inability to fix public health facilities was responsible for his incessant trip to London for medical attention.\nThe post reads, “I understand from my sources within Aso Rock that General Buhari is planning another London health vacation.\n“The last time he tried it, we surrounded his premises during Harass Buhari Out of London.\n“However, if he tries it this time around, we will give him the mother of all Harass Buhari out of London rally."
  },
  {
    "headline": "At last, Police break silence on 2020 recruitment exercise",
    "summarized_story": "The Nigeria Police Force (NPF) in collaboration with the Police Service Commission (PSC) are set to conclude the ongoing 2020 recruitment exercise of 10,000 Police Constables as the recruitment portal is set to open on Monday, October 18, just as examinations are to commence on Friday, October 29.\nA press statement by the Force Public Relations Officer (FPRO), CP Frank Mba, Saturday in Abuja, said: “candidates are required to check their recruitment status on the recruitment portal, www.policerecruitment.gov.ng which will be opened from Monday, October 18, through to Tuesday, October 26, 2021.\n“Candidates who are qualified for the next stage of the recruitment exercise are to print out their examination slip which must be presented on the examination date scheduled for Friday, October 29, and Saturday, October 30, 2021, at designated centres across the country.\n“Candidates are equally advised to check their email and phone numbers for notifications.”Mba said the Force, while reiterating that the recruitment exercise is absolutely free of charge and without any pecuniary obligation, enjoins candidates to call 08100004507 for further enquiries about the recruitment exercise."
  },
  {
    "headline": "Breaking: Iheanacho torments Maguire as Leicester City outclass Manchester United, Man City labour to victory",
    "summarized_story": "Leicester City increased the pressure on Manchester United manager Ole Gunnar Solskjaer as they ran out fully deserved winners in a thriller at King Power Stadium.\nLeicester City were vastly superior after the break and went ahead when Caglar Soyuncu sparked a flurry of late goals when he pounced in a goalmouth scramble with 12 minutes to go.\nThe presence of Jonny Evans in defence provided reassurance and quality while Iheanacho tormented Maguire, who delivered a laboured and error-strewn display.\nOnce again, Leicester showed resolve and quality to hit United again within seconds and that was that.\nManchester City Labour vs BurnleyManchester City also defeated lowly-placed Burnley 2-0."
  },
  {
    "headline": "Uneasy calm as gunmen kidnap monarch’s twin children, maid, driver, guard",
    "summarized_story": "Suspected kidnappers have abducted six-year-old twin children of a prominent monarch in Kwara state, the Owalobo of Obbo-Aiyegunle, Oba Samuel Adelodun.\nThe suspected kidnappers also abducted the monarch’s driver, Kunle; a security man, Lawrence, and a maid, Bukunmi.\nSpokesperson of the Kwara state police command, Ajayi Okasanmi confirmed the development.\nBut the abductors were said to have left the Sienan bus the victims were driving in on the roadside.\nMeanwhile, the state police command said it has lauched a manhurnt to arrest and rescue the victims unhurt ."
  },
  {
    "headline": "E-transmission of results: Nigeria on threshold of economic, political prosperity – Elekima",
    "summarized_story": "ople’s Life Improvement Foundation, PLIF , has enthused that the passage of the electoral Act amendment that allows for electronic transmission of results by the national assembly will launch Nigeria into the era of economic and political prosperity.\nBecause, the constitution of Nigeria has vested the sovereignty of Nigeria on the people of Nigeria.\n“”Power belongs to the people” , unfortunately it has only been on the lips , while the strong, rich, thugs, guns is what dictates elections in Nigeria.\n“We, therefore embarked on a crusade to educate the people of the reasons for the leadership failure in Nigeria.\nNigeria is almost a failed State this is the opportunity and time of restoration.”"
  },
  {
    "headline": "Agriculture: Over 4million Nigerians out of poverty-Min -NigPilot",
    "summarized_story": "Honorable Minister of Agriculture and Rural Development, FMARD, Mohammad Mahmood Abubakar, says the ministry has lifted about 4,205,576 Nigerians out of poverty in the last two years.\nHe said this during his maiden press briefing with journalists in Abuja to mark the 2021 World Food Day, WFD, in partnership with Food and Agriculture Organisation, FAO, and other stakeholders.\nThe policy he said, when approved, will improve agricultural extension services in the country and help increase better production and better environment.\n“As part of our effort to ensure food security, a total of 446 potable water points were provided to rural communities nationwide with 286,500 households having access.\nThe aim he said, is for the country to be fully self-sufficient in rice and other crops that provide food to Nigerians."
  },
  {
    "headline": "IDRW: Helpline Foundation calls for empowerment of rural women -NigPilot",
    "summarized_story": "The group also advocates the inclusion of indigenous women, in enhancing agricultural and rural development, and eradicating rural poverty.\nThe President and Founder of the NGO, Dr. Jumai Ahmadu, made the call in a statement on Friday as part of activities to mark 2021 International Day of Rural Women IDRW, which is marked every 15th Oct to celebrate rural women all over the world.\nShe said this year’s International Day of Rural Women with the theme: Rural Women Cultivating Good Food for All” was in line with the ongoing programmes being carried out by the Helpline Foundation in recent times aimed at encouraging access to food and addressing hunger, malnutrition, and food insecurity.\n“The theme for this year being Rural Women Cultivating Good Food for All , was as a result of neglect to the rural women by the policymakers, as the government does not remember them.\nSome of the rural women organisation that benefited from our empowerment programmes includes Yeyedu women, Bwari women and Kurudu women."
  },
  {
    "headline": "Niger Delta Ministry inaugurates committee on harmonization of work plans -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs Sen.Godswil Akpabio who was represented by the Permanent Secretary, Dr. Babayo Ardo, officially inaugurated the committee recently in Abuja.\nThe president, he said, therefore charged the Ministry on the harmonization of the development plans.\n“The two major plans developed with the assistance of United Nations Development Programme (UNDP) to support the Ministry in coordinating development and implementation some years ago include the Niger Delta Development Commission (NDDC), Regional Development Master Plan and the Ministry of Niger Delta Affairs (MNDA), Niger Delta Action Plan.\n“Successive efforts by other stakeholders in the region also led to the initiation of other existing development plans.\nMembership of the committee is drawn from the Ministry and the Niger Delta Development Commission, NDDC."
  },
  {
    "headline": "Nigeria Records 35 Deaths, 376 More Cases In 24 Hours",
    "summarized_story": "Nigeria has recorded 35 deaths from the coronavirus disease and 376 more cases within the last 24 hours.\nBased on the latest reports, the countries with the newest deaths were the United States with 1,659 new deaths, followed by Russia with 998 and Brazil with 525.\nAfter the US, the hardest-hit countries are Brazil with 602,099 deaths from 21,612,237 cases, India with 451,814 deaths from 34,037,592 cases, Mexico with 283,574 deaths from 3,744,574 cases, and Russia with 221,313 deaths from 7,925,176 cases.\nLatin America and the Caribbean overall has 1,506,032 deaths from 45,445,934 cases, Europe 1,346,943 deaths from 70,386,373 infections, and Asia 854,745 deaths from 54,951,304 cases.\nThe United States and Canada has reported 749,943 deaths from 46,439,525 cases, Africa 214,863 deaths from 8,419,477 cases, Middle East 203,742 deaths from 13,655,783 cases, and Oceania 2,451 deaths from 216,333 cases."
  },
  {
    "headline": "Amnesty For Bandits: Hardcore Elements Should Face Justice – General Usman",
    "summarized_story": "Former Director of Army Public Relations, Brigadier General Sani Usman, has said that hardcore elements should face justice as part of efforts to curtail banditry activities in some parts of the country.\nBut speaking during an interview on Channels Television’s Newsnight, Usman frowned at the idea of granting amnesty to bandits.\n“You have to talk about justice for the victims, justice for even the perpetrators of the crimes.\nRemember that it is not everybody that is in Boko Haram that deliberately entered Boko Haram.\nHundreds of Boko Haram members have also since surrendered to the army along with families and children."
  },
  {
    "headline": "Abducted Emir Of Bungudu Regains Freedom",
    "summarized_story": "The abducted Emir of Bungudu, Alhaji Hassan Attahiru, has regained his freedom.\nA family member of the Emir, Gazali Shehu Ahmad, who is also a Special Adviser to Zamfara State Governor on Strategy, confirmed his release on his personal Facebook page on Saturday.\nThe Emir was in captivity for 32 days before he regained his freedom“On behalf of the family and Bungudu Emirate, we wish to thank everyone for the prayers and support during this trying time,” Ahmad said on Facebook, on behalf of the family and Bungudu emirate.\n“We appreciate all the efforts of Kaduna State Government throughout this challenging period.\n“We wish to plead with the public to respect the privacy of the Emir in the coming weeks as he receives medical attention and post-trauma management.”"
  },
  {
    "headline": "EFCC Grills Rabiu Kwankwaso",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Saturday grilled former governor of Kano State, Rabiu Musa Kwankwaso over allegations of abuse of office, diversion of public funds and fraudulent allocation of government properties to cronies.\nKwankwaso, a chieftain of the Peoples Democratic Party, was first invited by the EFCC in September but failed to honour the invitation.\nREAD ALSO: EFCC Discontinues Case Against Kogi StateAn associate of the politician informed Channels Television that Kwankwanso may have been invited in relation to a petition by some retired employees of the Kano State Government.\nThe retired employees had told the EFCC that the former governor mismanaged pension remittances to the tune of N10 billion between 2011 and 2015, to fund a housing project for his cronies.\nEFCC spokesperson, Wilson Uwujaren did not comment on the interrogation of the former governor when contacted on Saturday."
  },
  {
    "headline": "Fake Policeman, Soldier, 661 Others Arrested As NDLEA Raids Notorious Drug Joints",
    "summarized_story": "A fake police officer and a soldier suspected to also be fake were among 663 drug traffickers and users arrested when operatives of the National Drug Law Enforcement Agency (NDLEA) raided notorious drug joints in Lagos, Abuja, Benue and other parts of the country.\nIn the raids which led to the seizure of assorted illicit drugs weighing over 153, 256.876 kilograms, a youth corps member was also arrested.\nAccording to a statement on Sunday by NDLEA spokesman, Femi Babafemi, the drugs seized were destroyed afterward.\nA day earlier, operatives also raided drug joints in Ojo and Maryland areas of the state where six persons were arrested and different quantities of drugs seized.\nHe called for continued collaboration between the NDLEA and other stakeholders especially the armed forces and other law enforcement agencies."
  },
  {
    "headline": "Abducted Emir of Bungudu in Zamfara regains freedom -",
    "summarized_story": "Recent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month October 2021 (287) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,392) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,194) inside lagos (1) International (7,137) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,529) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,183) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,598) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,410) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (282) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,040)"
  },
  {
    "headline": "EFCC interrogates former Kano Governor, Rabiu Musa Kwankwaso -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has grilled a former Kano State Governor Rabiu Musa Kwankwaso in connection with the alleged mismanagement of N10billion pension cash.\nThe pension remittances were alleged to have been used to fund a housing project for some cronies.\nAccording to a source, the EFCC invited the former Governor following a petition by some retired employees of the Kano State Government.\n–The source said: “Kwankwaso reported to the EFCC earlier on Saturday and he is currently being grilled by a team of operatives at the commission’s headquarters Abuja.\n” He is being questioned over allegations of abuse of office, diversion of public funds and fraudulent allocation of government properties to cronies."
  },
  {
    "headline": "Ade Adetimehin returned as Ondo APC chairman",
    "summarized_story": "Ade Adetimehin has been returned as the Ondo state Chairman of the All Progressives Congress, APC during the State Congress held at the International Culture & Event Centre, the Dome, Akure this Saturday.\nDelegates converged on the Dome from the 18 local government areas of the State for the APC State congress.\nMr. Adetimehin and other executive members emerged through consensus mode adopted by the party in the state.\nMr. Logap while addressing newsmen after the election commended the attitude of the party members which resulted to a peaceful process.\nThe newly elected executives were thereafter sworn-in by the chairman of the APC state Congress in ondo State."
  },
  {
    "headline": "Confusion as Oyo PDP produces two chairmen in state congress",
    "summarized_story": "Following the ongoing crisis in the People’s Democratic Party in Oyo state, two state chairmen have emerged in the party in the just concluded congress in the state.\nDayo Ogungbenro emerged as the State Chairman of the Governor Seyi Makinde’s led PDP with a total vote of three thousand one hundred and ten.\nHe called on the aggrieved members of the party to have a rethink and reunite with the part in the state.\nMeanwhile, Michael Okunlade who emerged as the PDP Chairman of the aggrieved faction lamented that the governor had sidelined them in the affairs of the state.\nHe said the attention of the governor had been drawn to their grievances but he has refused to acknowledge their demands."
  },
  {
    "headline": "500,000 People at Risk of Starvation in Nigeria’s Northeast, UN Says",
    "summarized_story": "The United Nations World Food Programme (WFP) has warned that half a million women, men, and children in Borno, Yobe, and Adamawa states are at risk of starvation as its funding for the region dries up.\nThe UN agency also said the number of internally displaced persons surpassed two million in September.\nHe added that the number of internally displaced surpassed two million in September 2021, reaching another grim milestone.\n“Our food assistance is a lifeline for millions whose lives have been upended by conflict and have almost nothing to survive on.\n“To sustain humanitarian operations in the North-east Nigeria until March 2022, WFP urgently requires $197 million.”Michael Olugbode in Abuja"
  },
  {
    "headline": "UK Warns Citizens Against Possible Terror Attacks in 12 Nigerian States, #EndSARS Protests in Lagos, Abuja – Arise News",
    "summarized_story": "The United Kingdom government has warned its citizens in Nigeria against visiting 12 states in the country over possible terror attacks.\n“There may be protests and a heightened security presence in major cities such as Lagos and Abuja.\nThere may be additional protests and a heightened security presence in Abuja and in the South-east for this reason.\n“Since 9 August, there has been an increase in protests and demonstrations in the South-east region of Nigeria.\nProtests, including “Stay at Home” protests, are likely during October in the South-east region."
  },
  {
    "headline": "Melbourne to Ease World’s Longest Covid Lockdowns as Vaccinations Rise",
    "summarized_story": "More easing, including the reopening of many retailers, will come once 80% of eligible Victorians are fully vaccinated – estimated by Nov. 5 at the latest.\nEighty percent of the state’s people have been fully vaccinated.\nThe new strategy makes lockdowns highly unlikely once 80% of the population is fully vaccinated.\nThe government is also in discussions with Singapore about reopening travel between the two countries for the fully vaccinated.\nOn Saturday, New Zealand vaccinated more than 2.5% of its people as part of a government-led mass vaccination drive."
  },
  {
    "headline": "Up to 17 US Missionaries and Family Kidnapped in Haiti",
    "summarized_story": "As many as 17 American Christian missionaries and their families, including children, were kidnapped on Saturday by gang members in Haiti’s capital of Port-au-Prince, U.S. media reported.\nThe kidnapping happened after the missionaries left an orphanage in the crisis-engulfed Caribbean nation, the New York Times and CNN said.\nThe Washington Post reported that an audio from the Ohio-based Christian Aid Ministries said “men, women and children” associated with the group were being held by an armed gang.\n“The mission field director and the American embassy are working to see what can be done,” the audio was quoted as saying.\n“Pray that the gang members will come to repentance and faith in Jesus Christ.”The victims included 14 adults and three minors, CNN said, citing an unnamed source in Haiti’s security forces."
  },
  {
    "headline": "In a Dramatic Shift, Former SGF Kingibe Says Nigeria’s Unity Negotiable",
    "summarized_story": "Contrary to the claims by many Nigerian leaders that the unity of the country is non-negotiable, a former Secretary to the Government of the Federation (SGF), Alhaji Babagana Kingibe, has declared that the unity of Nigeria is negotiable.\nSpeaking Saturday at The Sun Newspaper Awards for 2020 held in Lagos, Kingibe however said even the union between a husband and wife is negotiable.\nKingibe, who received the newspaper’s ‘Lifetime Achievement Award,’ called on Nigerians to learn to respect one another.\n“However, I think that a few of my colleagues believe that the unity of Nigeria is not negotiable.\nSpeaking specifically on the issue of those agitating to leave the country, Kingibe said: “When we ever say we want to go away, I do not think they realise the going away."
  }
]