[
  {
    "headline": "Interpol combs West Africa for 120 fleeing Kogi inmates",
    "summarized_story": "THE International Police has launched a manhunt for the over 120 fleeing inmates of the Medium Security Correctional Centre, Kabba, Kogi State, who escaped during an attack on the facility on Sunday.\nIt was gathered that Interpol would concentrate its search on neighbouring countries, including Benin, Ghana, Niger, Chad and Cameroon, where many of the fleeing Kogi prison inmates might be hiding.\nHe confirmed that Interpol would be focusing attention on neighbouring countries which may be the destination choice of the fugitives.\n“Just as directed by the honourable minister, Interpol will be looking at the neighbouring countries for the escaped inmates.\nWe have been having various engagements and they are continuing.”The NCoS spokesman revealed that investigation into the attack was going on, adding that the mastermind had yet to be identified."
  },
  {
    "headline": "Troops, hunters dislodge Adamawa bandits fleeing Zamfara bombardment",
    "summarized_story": "Troops of Nigerian army have neutralized bandits who fled Zamfara State into Adamawa State.\nThe bandits were said to have fled Zamfara and established a new camp in a forest in the Maiha Local Government Area of Adamawa State.\nThe soldiers, who raided the hideout located in a forest, killed the bandits and recovered 11 rocket launchers and three grenades.\nThe Chairman of the Maiha Local Government Council, Idi Amin, who disclosed the details of the military raid, said he believed the bandits to be members of the Islamic state West African province, who fled Zamfara into Adamawa.\nHe said, “I thank God that the combined team of military and our local hunters have been able to kill bandits who fled Zamfara to our state."
  },
  {
    "headline": "Runsewe hosts diplomatic community to herald 2021 INAC expo",
    "summarized_story": "In a strategic bid to ensure that the 2021 International Arts and Crafts (INAC) Expo meets its desired objectives, the National Council for Arts and Culture (NCAC) played host to the Diplomatic Community in Nigeria to a Pre-INAC dinner in Abuja.\nOther strategic contents and interventions at each edition of INAC Expo, Otunba Runsewe further stated, includes practical workshops and robust exhibitions geared towards reawakening and energizing the cultural sector towards economic empowerment, information sharing, skills acquisition and overall socio economic integration of Countries.\nHighpoint of the evening which was held at the Ladi Kwali hall of Sharaton Hotel and Towers, Abuja was a raffle draw where members of the Diplomatic Community were rewarded with various artistic gift items.\nThe Chief host, Otunba Runsewe presented gifts of appreciation to 25 Countries and stakeholders that attended the event.\nPIX: Caption: Members of the Diplomatic Community in a group photograph with Otunba Olusegun Runsewe, DG National Council for Arts and Culture & President World Craft Council, African RegionAttachments area"
  },
  {
    "headline": "Competition: APWEN disburses cash to winners",
    "summarized_story": "Felicia Agubata Science Competition and Scholarship for girls in primary schools FASCOS, organized by the Association of Professional Women Engineers of Nigeria, APWEN Lagos Chapter under the leadership of Engr.\nMary Afolayan, the much-awaited cash disbursement to the winners of the competition was held at Vetland Primary School.\nwas witnessed by parents of the winners, teachers, the Ifako/Ijaye Local Government Education Board, as well as Association of Women Engineering of Nigeria, APWEN.\nSpeaking to the winners, the immediate past President APWEN, National, Engr.\nWe do not want out 0f school children."
  },
  {
    "headline": "Defection: Yahaya Bello receives Fani-Kayode",
    "summarized_story": "Kogi State Governor, His Excellency Yahaya Bello on Thursday played host to former Minister of Aviation, Chief Femi Fani-Kayode who just dumped the Peoples Democratic Party for the All Progressives Congress (APC).\nChief Fani-Kayode was earlier led on a visit to President Muhammadu Buhari in the State House, Presidential Villa Abuja by the Governor of Yobe State and All Progressives Congress (APC) Caretaker/Extra-Ordinary Convention Planning Committee (CECPC) Mai Mala Buni after his defection from the PDP to the APC.\nHe said haven worked closely with some key players in the party like Governor Yahaya Bello in resolving some national issues; he was convinced that the party believed in the unity and progress of the country.\nHe commended Governor Yahaya Bello for his convincing role in wooing many oppositions party members into the APC as Chairman, Committee on Sensitization and Mobilization for Women, Youth and People Living with Disability.\nWhile congratulating Chief Fani-Kayode, Governor Bello assured the former Aviation Minister of equal rights and participation in the APC."
  },
  {
    "headline": "Police arrest 25 suspects, recover firearms in Kaduna",
    "summarized_story": "The Police Command in Kaduna State said it had arrested 25 suspects for various crimes from August to September, an official said on Thursday.\nThe Command’s Public Relations Officer, ASP Muhammad Jalige disclosed this at a news briefing held at the Command Headquarters in Kaduna.\nJalige said the suspects were arrested for various crimes, which included armed robbery, culpable homicide, kidnapping, cultism, impersonation, possession of illegal firearms, among others.\nThe News Agency of Nigeria (NAN) reports that among the suspects arrested were those who allegedly conspired to kill Abdulkareem Na-Allah, the son of Sen. Bala Ibn-Na-Allah, the Senator representing Kebbi South.\nJalige added that the command’s operatives recovered pump actions rifles, pistols, Ak47 rifles, motor vehicles, live ammunition, among others, from the suspects."
  },
  {
    "headline": "2023: APC vows to remove moles to win Enugu",
    "summarized_story": "The All Progressive Congress (APC) says it will provide amenities lacking in Enugu State if elected into power in 2023.\nThe state APC Caretaker Chairman, Chief Chikwado Chukwwunta, made the promise in Enugu at the end of the state executive committee meeting of the party.\nHe said that the party would do all within its capacity to ensure that it would occupy the Lion Building (Enugu State Government House) in 2023.\nHe added that Enugu State under APC leadership in 2023 would do well in education like Anambra State under the leadership of Mr Peter Obi.\nHe noted that APC had not ruled Enugu State in the past eight years."
  },
  {
    "headline": "CAN suspends Gombe chairman for congratulating Pantami",
    "summarized_story": "The Christian Association of Nigeria, CAN has suspended its Gombe State Caretaker Chairman, Rev.\nCongo was suspended after he wrote a congratulatory letter to the Minister of Communication and Digital Economy, Isa Pantami, without the approval of the association’s National Executive Committee.\nThey stated in the letter that they were “proud” of Pantami as a “son”.\nHowever, CAN in a letter by its General Secretary, Joseph Daramola, dated September 15 2021, titled: ‘Letter of Suspension’, sent to CAN caretaker committee chairman in Gombe, stated that the congratulatory letter was issued without the consent of the mother body.\n“It is not only provocative but undermines the CAN NEC executive."
  },
  {
    "headline": "Judas of Oduduwa – Sheikh Gumi slams Fani-Kayode over defection to APC",
    "summarized_story": "Controversial Kaduna-based Islamic scholar, Sheikh Gumi, has slammed former Aviation Minister, Femi Fani-Kayode over his defection to the All Progressives Congress, APC.\nFani-Kayode, who had been a great critic of the Buhari-led administration, joined APC on Thursday after he was received by the President at the State House, Abuja.\nGumi, reacting, shared a throwback statement by Fani-Kayode in 2018 saying he would rather die than join the APC or bow to President Muhammadu Buhari.\nGumi said he had long neglected the rantings of Fani-Kayode, knowing fully well that he is a traitor and fake.\nHis post on Facebook read, “I have for long neglected the rantings of the Judas of Oduduwa attacking me knowing fully well that he is fake and a traitor."
  },
  {
    "headline": "COVID-19: We have been providing funds to run isolation centres – Oyo government",
    "summarized_story": "Oyo State Government, on ThursdayM said that it has been providing funds for the running of isolation centres in the state.\nDAILY POST recalls that some facilities have been designated as isolation centres due to the advent of coronavirus pandemic.\nOur correspondent gathered that there are allegations that paucity of funds had hit the State’s isolation centres.\n“The claims made about the paucity of funds affecting Oyo State Isolation Centres are false and baseless.\nAlso, since the Delta variant started, all the different Isolation Centres remained open and they have been functioning effectively."
  },
  {
    "headline": "Judicial officers in Rivers to own houses after retirement",
    "summarized_story": "The Rivers State Executive Council has approved that a bill for the enactment of a law which would enable judicial officers to own their own houses after retirement be sent to the state House of Assembly.\nThis was disclosed by the state Commissioner for Information, Paulinus Nsirim, after the SEC meeting presided over by Governor Nyesom Wike on Wednesday.\nThe commissioner explained that the action of the council is in line with the state governor’s policy to ensure that judicial officers who serve the state meritoriously are housed after retirement.\nIn his words “And to entrench this as its policy, a bill has been passed to Rivers State House of Assembly for the enactment of a law.\nSo that, at the end of this administration, subsequent administrations that will come will ensure that this policy is not toiled with.”The commissioner also disclosed that Rivers state has been selected as the South -South Zonal Headquarters of the Federal Judicial Service Commission, and added that the state would establish a judicial institute to train magistrates and judges to complement the activities of the National Judicial Council."
  },
  {
    "headline": "Acting Comptroller-General of Immigration, Jere vows to secure nation’s borders",
    "summarized_story": "The acting Comptroller-General of Immigration, Idris Isah Jere, has vowed his commitment to Nigeria’s borders, saying that as an immigration personnel who has served in various capacities, he understood the daunting challenges being faced.\nJere, last week, took over leadership of Immigration Service in acting capacity pending when Muhammed Babandede would finally retire from service as the 16th Comptroller-General of Immigration.\nThe Minister of Interior and former governor of Osun State, Rauf Aregebesola, in his remarks, urged him to effectively take charge of borders and further passport reforms.\nHe joined the service in 1987 as a Deputy Superintendent of Immigration and has served in various Commands and Formations including Adamawa, Borno, and Benue State Commands among others.\nHe was the Deputy Comptroller General in charge of Finance and Accounts until 10th September 2021 when he took over from the former Comptroller General, Muhammad Babandede (rtd) as acting Comptroller General."
  },
  {
    "headline": "Strike only language FG understands – ASUU",
    "summarized_story": "By Emma Elekwa, Onitsha- Advertisement -The Academic Staff Union of Universities Owerri Zone has threatened to embark on another industrial action over Federal Government’s refusal to implement the Memorandum of Action (MOA) signed with the union in December last year.\nBriefing reporters on Thursday in Awka, Zonal Coordinator, Comrade Uzo Onyebinama, said it was unfortunate the union would contemplate another strike barely nine months it suspended the last one.\nHe however said they were left with no choice since it seemed strike was the only language the government understands.\nAccording to him: “We’ve tried to look for other alternative avenues to attract the government attention, but all appears meaningless to them.\nIt’s obvious that it’s only when we embark on strike that they will look our way."
  },
  {
    "headline": "PHOTOS: Former Minister Fani-Kayode dumps PDP for APC",
    "summarized_story": ""
  },
  {
    "headline": "Why States must collect VAT, by Southern Govs",
    "summarized_story": "By Damian Duruiheoma, Enugu- Advertisement -The Southern Nigeria Governors Forum has supported moves by States to take over the collection of Value Added Tax (VAT) from the Federal Inland Revenue Service (FIRS).\nThis was contained in a communique after the meeting of the Forum in Enugu on Thursday.\nThe Governors, in a communiqué, read by their chairman Rotimi Akeredolu (Ondo), resolved to support the position that collection of VAT falls within the powers of the States.\nThe Governor further commended the Southern States for enacting anti-open grazing law, urging them to implement the law to the letter.\nParts of the communique read: “The meeting expressed satisfaction with the rate at which the states in the Southern are enacting or amending the anti-open grazing law, which aligns with the uniform template and aspirations of the Southern governors and encourage the states that are yet enact the law to do so expeditiously."
  },
  {
    "headline": "PDP mocks Presidency over economic council chair’s comments on debts",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) has said comments credited to Chairman, Economic Advisory Council (EAC), Doyin Salami, on the country’s rising debt profile is a validation of its position on the government.\nThe party in a statement by Secretary, Kola Ologbondiyan, said Salami comments was a validation of its stance that government has mortgaged the country to foreign interests.\nIt noted that it was disheartening that the All Progressives Congress (APC)-led Federal Government cannot point to any legacy project it has financed with the loans.\nSalami’s revelation only validates apprehensions that President Buhari, who is still borrowing more money, is completely disconnected from his economic team, while the corrupt cabal in his Presidency has taken advantage of the situation to pillage the vaults.\n“More frightening is the revelation by EAC that the nation’s debt stock might soon hit N45 trillion."
  },
  {
    "headline": "UN march has nothing to do with IPOB, self-determination group",
    "summarized_story": "From Oluseye Ojo, IbadanNigerian Indigenous Nationalities Alliance for Self-Determination (NINAS), yesterday, flayed the Presidency for linking its ongoing one million march opposite the United Nations (UN) Headquarters, New York, with activities of the Indigenous People of Biafra (IPOB).\nIt, however, said the one million march in New York had nothing whatsoever to do with IPOB.\nThe renowned historian said rather than losing sleep and temper over the march, “the Nigerian government should, without further delay, declare Miyyetii Allah a terrorist organisation as being demanded by NINAS, saying, “the real terrorists in Nigeria are operating under Miyyetii Allah.\n“We demand an end to the genocide, being perpetrated by Miyyetii Allah against our people.\nMiyyetii Allah is a terrorist group and it should be declared such by the United Nations."
  },
  {
    "headline": "The Sun Awards 2020 winners: Why they emerged",
    "summarized_story": "They are the high- flyers, the winners of The Sun Awards, 2020.\nThese exceptional Nigerians hugged the broad landscape of excellence, resilience and doggedness with flourish.\nIconic governor of Rivers State, Nyesom Wike, a never- say- die political broker, took the highway of belligerence in astute defiance of popular values.\nIn a season of turmoil, his reforms, bold initiatives and economic engineering engendered a talismanic view of a state burdened with poverty.\nThese are the winners of The Sun Awards 2020."
  },
  {
    "headline": "Southern govs insist on states’ collection of VAT",
    "summarized_story": "From TONY JOHN, Port HarcourtGovernors of Southern States of Nigeria, under the aegis of Southern Governors Forum (SGF), have resolved to support the position that the collection of Value Added Tax (VAT), falls within the powers of the states.\nThe Nigerian Southern Governors Forum (SGF) had met to review the state of the nation and the progress of implementation of the decisions reached in her previous meetings.\nOn the Petroleum Industry ACT (PIA), the chairman said the forum expressed satisfaction with the handling of issues around the PIA and ownership of Nigerian National Petroleum Corporation (NNPC) by the larger Nigerian Governors’ Forum.\nThe forum thanked the host Governor, Ifeanyi Ugwuanyi, for the successful meeting and chose Rivers State as the next host for the Southern Governors Forum meeting in November, 2021.\nOthers were the Governor of Enugu State, Ifeanyi Ugwuanyi; Governor of Bayelsa State, Duoye Diri; Governor Babajide Sanwo-Olu of Lagos State and Governor Oluwaseyi Abiodun of Ogun State."
  },
  {
    "headline": "Igboho speaks from detention in Benin Republic",
    "summarized_story": "Igboho had been in detention in Cotonou, Benin Republic since he was arrested at a airport in Cotonou, when he attempted to travel to Germany with his wife.\nHis wife had been freed by the court, while he has been facing trial in the neighbouring country.\nHe will also like people to respect his family by not calling his mom out for anything public.\nIn that wise, people are advised to take anything said by anybody, claiming to be from him with a pinch of salt.\nThe exception is the statement by his lead counsel."
  },
  {
    "headline": "Southern Govs Back VAT Collection by States",
    "summarized_story": "*Insist president must come from South in 2023Governors from the south of Nigeria have expressed their support for the collection of Value Added Tax (VAT) by state governments.\nAkeredolu said that the governors resolved and affirmed the position that the collection of VAT fell within the powers of state governments.\n“We resolved to support the position that the collection of VAT falls within the powers of the state.\n“The meeting expressed satisfaction with the rate at which states in the south of Nigeria are amending or enacting the anti-open grazing law.\nThe News Agency of Nigeria (NAN) reports that nine governors and seven deputy governors out of the 17 states in the southern Nigeria attended the meeting."
  },
  {
    "headline": "Breaking: Fani-Kayode Joins APC, Meets Buhari",
    "summarized_story": "Fani-Kayode was presented to President Buhari at the State House, Abuja on Thursday as the newest member of the APC.\nSpeaking with newsmen after he was received by Buhari, the former critic of the ruling party claimed he was instrumental to the defection of three former PDP governors to APC in recent times.\nFani-Kayode said he impressed it upon Governors Ben Ayade of Cross River state, Dave Umahi of Ebonyi state and Bello Matawalle of Zamfara State the need for them to leave PDP for APC.\nFani-Kayode, who explained that he was a founding member of the APC, said he returned to the APC for the unity of the country.\nHe said he was wooing the governors of Oyo, Bauchi and Enugu states, Seyi Makinde, Bala Mohammed and Ifeanyi Ugwuanyi respectively to also join the APC."
  },
  {
    "headline": "Breaking: EFCC Chairman Slumps in State House",
    "summarized_story": "By Kingsley NwezehThe Chairman of the Economic and Financial Crimes Commision (EFCC), Abdulrasheed Bawa, slumped during a presentation at an event in the State House on Thursday.\nThe EFCC boss felt unwell while making a speech at the National Identity Day celebration in the Presidential Villa.\nFollowing concerns about the health of Bawa after the incident, t he Commission assured the public that its chairman was now okay.\nSpokesman of EFCC, Wilson Uwujaren, said the chairman had recovered.\n“I am pleased to inform you that the Chairman of the EFCC is now stable,” he stated."
  },
  {
    "headline": "DPR to Exceed N3.2trn Revenue Benchmark, Adjusts to N5trn By Year End",
    "summarized_story": "It called for industry synergy to ensure that President Muhammadu Buhari’s vision for the sector was realised.\nThe DPR executive secretary explained, “Last year, we exceeded our revenue target.\n“We are targeting N5 trillion for government, but as it is now, the N3.2 trillion as of 30 August, we had generated 70 per cent.\nWe have producing reservoirs of 1,700, but we are not producing from all these oil and gas reservoirs.\nIn his remarks, Gusau stated that the managements of both organisations were sorting out all the issues raised during the PTDF’s earlier visit to the DPR."
  },
  {
    "headline": "Southern Govs Back VAT Collection by States",
    "summarized_story": "*Insist president must come from South in 2023Governors from the south of Nigeria have expressed their support for the collection of Value Added Tax (VAT) by state governments.\nAkeredolu said that the governors resolved and affirmed the position that the collection of VAT fell within the powers of state governments.\n“We resolved to support the position that the collection of VAT falls within the powers of the state.\n“The meeting expressed satisfaction with the rate at which states in the south of Nigeria are amending or enacting the anti-open grazing law.\nThe News Agency of Nigeria (NAN) reports that nine governors and seven deputy governors out of the 17 states in the southern Nigeria attended the meeting."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "BREAKING: Femi Otedola 'Accepts' PDP’s Offer To Run Against Ambode",
    "summarized_story": "Femi Otedola, a businessman and Chairman of Forte Oil PLC, has “accepted” the offer of a governorship ticket by the Peoples Democratic Party (PDP).\nPDP offers Femi Otedola governorship ticket.\nPDP offers Femi Otedola governorship ticket.\nAnd I am sure you feel the same way because we all envision a better Lagos, a Lagos of our dreams.\nI ask you to believe again and together, let’s achieve more,” Governor Ambode said."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Sources: CBN investigating Oniwinde Adedotun, abokiFX founder, for ‘illegal’ forex trading",
    "summarized_story": "The Central Bank of Nigeria (CBN) is investigating Oniwinde Adedotun, the founder of abokiFX, TheCable has learnt.\nAdvertisementSources within the apex bank told TheCable on Thursday night that Adedotun and abokiFX Limited are currently under investigation for “illegal foreign exchange transactions”.\nAbokiFX is a web platform that reports movements in the foreign exchange market since as early as 2014.\nAn insider, familiar with the events, told TheCable that “unusual forex transactions” were found in his account, suggesting the promoters of the platform have been involved in illegal forex trading.\nAdvertisementThe apex bank is said to be investigating seven accounts belonging to Adedotun and abokiFX, vetting every forex transaction from 2019 till 2021."
  },
  {
    "headline": "Sources: CBN investigating Oniwinde Adedotun, abokiFX founder, for ‘illegal’ forex trading",
    "summarized_story": "The Central Bank of Nigeria (CBN) is investigating Oniwinde Adedotun, the founder of abokiFX, TheCable has learnt.\nAdvertisementSources within the apex bank told TheCable on Thursday night that Adedotun and abokiFX Limited are currently under investigation for “illegal foreign exchange transactions”.\nAbokiFX is a web platform that reports movements in the foreign exchange market since as early as 2014.\nAn insider, familiar with the events, told TheCable that “unusual forex transactions” were found in his account, suggesting the promoters of the platform have been involved in illegal forex trading.\nAdvertisementThe apex bank is said to be investigating seven accounts belonging to Adedotun and abokiFX, vetting every forex transaction from 2019 till 2021."
  },
  {
    "headline": "'I was dehydrated' -- Bawa opens up on dizzy spell",
    "summarized_story": "Abdulrasheed Bawa, chairman of the Economic and Financial Crimes Commission (EFCC), says he had a dizzy spell midway through his speech on Thursday.\nAdvertisementBawa had stopped his remarks abruptly at an event organised by the National Identity Management Commission (NIMC) at the presidential villa, Abuja.\nFollowing the incident, Wilson Uwujaren, spokesperson of the anti-graft commission, had said Bawa is in good shape after he received medical attention.\nReacting to the incident while speaking on Politics Today, a Channels Television programme, Bawa said his doctors informed him that he was dehydrated.\nAdvertisement“While giving my goodwill message during the programme organised by the National Identity Management Commission (NIMC), there was a sort of dizziness on me and I had to excuse myself from the stage,” he said."
  },
  {
    "headline": "'I was dehydrated' -- Bawa opens up on dizzy spell",
    "summarized_story": "Abdulrasheed Bawa, chairman of the Economic and Financial Crimes Commission (EFCC), says he had a dizzy spell midway through his speech on Thursday.\nAdvertisementBawa had stopped his remarks abruptly at an event organised by the National Identity Management Commission (NIMC) at the presidential villa, Abuja.\nFollowing the incident, Wilson Uwujaren, spokesperson of the anti-graft commission, had said Bawa is in good shape after he received medical attention.\nReacting to the incident while speaking on Politics Today, a Channels Television programme, Bawa said his doctors informed him that he was dehydrated.\nAdvertisement“While giving my goodwill message during the programme organised by the National Identity Management Commission (NIMC), there was a sort of dizziness on me and I had to excuse myself from the stage,” he said."
  },
  {
    "headline": "Matawalle: We backed out of dialogue with bandits because they deceived us",
    "summarized_story": "Bello Matawalle, governor of Zamfara, says the state reversed the decision to dialogue with bandits because the government was deceived.\nHe had also asked his colleagues to endeavour to negotiate with bandits in the interest of promoting peace.\nBut while attending a Juma’at service on September 10, the governor said the state will no longer offer amnesty to repentant bandits.\nWe thought it was something we could continue with them, but we later realised that they had deceived us.\nWe don’t have many of such issues in Zamfara state.”Zamfara, in recent times, has recorded numerous attacks by bandits on communities across the state."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "How BFree is improving trust in the lending space",
    "summarized_story": "This incident is one out of many which indicate that digital lenders will go the extra mile, sometimes using unethical methods, to get their loans back.\nThe sanction served as a clarion call for digital lenders to use ethical alternative methods to collect loans.\nBut it didn’t take long to see that there were some cracks in the collection process.\nAt BFree customers are appraised based on two factors: willingness and capability to pay.\nFlosbach believes that BFree’s ultimate goal is to increase trust in the African lending space."
  },
  {
    "headline": "Goldman Sachs-backed Jumo launches its first loan product in Ivory Coast",
    "summarized_story": "South Africa-based Jumo has partnered with MANSA Bank and MTN Mobile Financial Services to provide loans to entrepreneurs and small businesses in Ivory Coast.\nIn Ivory Coast, which is Jumo’s most recent market, the collaboration will see the company introduce its new short-term and small-scale loan product, VitKash, built in partnership with MANSA and offered through MTN’s mobile money platform.\nThe recent expansion was driven by a number of factors, which according to Kone make the West African nation an “attractive market” for Jumo.\n“Ivory Coast has all the characteristics of an attractive market with high growth potential.\n“In the WAMU (West African Monetary Union) zone, there is a strong will from the BCEAO (the central bank of 8 Francophone West African States) to improve financial inclusion and financial literacy,” Kone said."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "Why mortgage banks still struggle despite N29bn intervention",
    "summarized_story": "Notwithstanding their recapitalisation and consolidation plus the intervention of the Nigerian Mortgage Refinance Company (NMRC), Nigeria’s primary mortgage banks (PMBs) are still struggling with liquidity issues.\nAs a private sector-led mortgage refinancing company, NMRC has the public purpose of promoting homeownership for Nigerians while deepening liquidity in the mortgage market by raising long-term funds from the capital market.\nRead also: Nigerian banks grow profit by most in 7yrs despite limited cashNMRC had raised a total of N19 billion from the capital market to refinance mortgage loans provided by partnering mortgage and commercial banks.\nTypical mortgage interest rates in Nigeria range between 6-10 percent for the National Housing Fund (NHF) and between 15-25 percent for commercial mortgage institutions.\nThe trick here is that at 15 percent interest rate, it takes a lender approximately seven years to recover the N25 million he lends out."
  },
  {
    "headline": "Nigeria to meet investors over $3bn Eurobond issuance September 17, 20",
    "summarized_story": "Nigerian authorities will on September 17 and 20, 2021 hold virtual meetings with potential investors for the proposed $3bn Eurobond issuance, according to the Debt Management Office (DMO).\nThrough the issuance, Nigeria, currently rated B2 (Negative) by Moody’s, B- (Stable) by S&P and, B (Stable) by Fitch, hopes to raise up to USD$3 billion but not more than USD$6.2 billion.\nIn order to avail local investors the opportunity to invest in the Eurobonds, meetings will also be held with local investors.\nSince the ICM debut in 2011, Nigerian investors have always participated in the biding process, including banks, insurance companies and PFAs.\nOverall, Eurobond issuances by Nigeria and the investor meetings that precede the pricing, have provided a strong global platform for Nigeria to tell its own story and opportunities available in Nigeria for investors."
  },
  {
    "headline": "Nollywood produces most movies in 5yrs but piracy limits profit",
    "summarized_story": "The Nigerian film industry, Nollywood, produced its highest movies in five years in the second quarter (Q2) of 2021, but piracy is crimping the industry’s profitability.\nAccording to the National Bureau of Statistics (NBS), Nollywood produced 635 movies in Q2’ 2021 compared with 626 movies produced in the same period last year.\nIts growth in Q2’ 2021 is the highest compared with the same period in the last five years.\n“Piracy tops the list of the film industry’s many challenges fuelled by weak enforcement of Nigeria’s copyright law,” analysts at FBNQuest note.\n“In the digital era of today, piracy has morphed into illegal download and distribution of movies without paying for them."
  },
  {
    "headline": "Edo reads riot act to operators of unapproved private schools, lecture centres …sets up taskforce, to prosecute promoters – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has warned against operating private schools and lecture centres without approval from the State Ministry of Education, noting that operators of such centres risk prosecution.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., decried the activities of some private individuals and organizations, who operate educational centres with substandard instructional facilities and personnel in shanties across the state.\nHe said, “This, we have learned, is being perpetrated in the guise that they are running these facilities in partnership with the Government when in fact they are reaping off unsuspecting members of the public through these unapproved private schools and lecture centres.\n“The Edo State Government is committed to providing quality education for all and will not condone the perpetration of this aberration and the activities of those who are working to truncate the lofty efforts of the government to deliver quality education to children in Edo State.”According to him, “All existing illegal private schools and lecture centres, as well as all private individuals/organisations running these centres are advised to visit the Planning, Research and Statistics of the Ministry of Education for guidelines on schools’ registration/approval.”“Government has constituted a taskforce to clamp down on illegal private school/lecture centres to seal the premises and prosecute those promoting them.”Ogie urged parents/guardians to register their children and wards at only approved private schools and lecture centres or, in the alternative, at the nearest public school."
  },
  {
    "headline": "Obaseki congratulates Omosefe on victory at national scrabble championship – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with Prince Omosefe, who emerged winner of the eighth edition of the Nigerian Scrabble Players Championship held at the Federal Capital Territory, Abuja.\nThe Edo player, Omosefe recorded 11 wins with a plus 954 cumulative spread to win the national competition, defeating about 30 other players.\nThe governor, in a statement, described the scrabble star as an enviable ambassador of the state, hailing his prowess in the word game.\nAccording to the governor, “I warmly congratulate Prince Omosefe on his victory at the eighth edition of the Nigerian Scrabble Players Championship held at the Federal Capital Territory, Abuja.\nI am indeed proud of his exploits and even more confident that he would bring more glory to our state and country.”..."
  },
  {
    "headline": "COVID-19 3rd wave: Edo confirms death of three more unvaccinated persons, as infection soars, mortality climbs to 57 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has confirmed the death of three more persons who were not inoculated with the coronavirus (COVID-19) vaccines, amid ramped up efforts by the government to vaccinate more citizens to protect them and achieve herd immunity against the deadly virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi said the three new deaths reported from the Stella Obasanjo and Irrua Specialist hospitals, raised the total number of deaths recorded in the third wave of the pandemic in the state to 57.\nAccording to him, “Edo State, in the last 24 hours, recorded three more deaths of persons who have not been inoculated with the COVID-19 vaccines, bringing the total mortalities recorded in the third wave of the pandemic in the state to 57.\nHe further disclosed that the state has so far in the third wave of the pandemic collected 13,945 samples and recorded 1,115 confirmed cases and 523 recoveries, with over 71,420 persons inoculated since the commencement of the second phase vaccination exercise in the state."
  },
  {
    "headline": "IOM launches Another Community Based Reintegration project in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The International Organisation for Migration (IOM) yesterday in Benin City, Edo State launched a Community-Based Reintegration (CBR) project.\nFinancier of the project, the Switzerland government’s message was presented by Monvel Mvhelebach, a Programme Manager who represented the Swiss Embassy.\nHe expressed optimism that the collaboration with other stakeholders intl the project, including IOM was important to give meaning to the lives of returned migrants.\nProject Assistant, Benin Office, Aigbeze Uhimwen identified stakeholders in the project to include Benin Technical College which is expected to provide the manpower needs, Edojobs, NAPTIP and the private sector.\nAccording to him, “Despite the synergises approaches and efforts taken by the state government to address unemployment and positively engage its teeming youths through various programmes, Edo State still ranks as the most endemic for irregular migration and human trafficking."
  },
  {
    "headline": "Buhari ya yi abinda na ga cewa komawa APC ne kawai zan yi in saka masa – In Ji Fani Kayode",
    "summarized_story": ""
  },
  {
    "headline": "Buhari ya yi abinda na ga cewa komawa APC ne kawai zan yi in saka masa – In Ji Fani Kayode",
    "summarized_story": ""
  },
  {
    "headline": "Jami’ar Ilori da jam’ar Maiduguri ne jami’o’in Arewa biyu cikin 10 da suka fi dibar ɗalibai a bana",
    "summarized_story": ""
  },
  {
    "headline": "Jami’ar Ilori da jam’ar Maiduguri ne jami’o’in Arewa biyu cikin 10 da suka fi dibar ɗalibai a bana",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnatin Buhari za ta kashe Naira biliyan 38.4 domin kammala titina a jihohi biyar",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Biafra agitation: Uko commends Igbo lawmakers for intervention, insists only power devolution can end quest for separation",
    "summarized_story": "OBINNA EZUGWUFounder, Igbo Youth Movement (IYM) and Secretary, Eastern Consultative Assembly (ECA), Evangelist Elliot Ugochukwu-Uko has commended Igbo national assembly members for making effort to find solution to ongoing security challenge in the Southeast, but warned that lasting peace will continue to elude the country until there is power devolution.\nReacting to the intervention of the lawmakers, Uko said they have done well and therefore should be supported.\n“Any search for resolution, that doesn’t include the reconstruction of the polity, may not resolve the loss of faith driving the agitation.\n“I believe the legislators are sincere because I know they don’t know an alternative route of escape from the crisis.\n“Meanwhile, I commend the Southern Governors Forum for their sagacity and their newfound dedication to the truth and dynamism."
  },
  {
    "headline": "Slumped Bawa back at his desk after receiving treatment —EFCC",
    "summarized_story": "EFCC Head, Media and Publicity, Wilson Uwujaren, made this known in a statement titled, ‘Bawa Is Hale and Hearty – EFCC’.\n“The Chairman of the Economic and Financial Commission, EFCC, Abdulrasheed Bawa is hale and hearty.\n“He has since received medical attention and is due back at his desk.”Recall that Bawa, 41, slumped while delivering a goodwill message at the event.\n“Please, excuse me, I can’t continue,” he had said before he walked off the stage and slumped on his chair.\nThe EFCC boss, who was rushed out, had earlier mentioned that the EFCC was grieving the loss of a colleague."
  },
  {
    "headline": "Ifeanyi Ugwuanyi hosts Southern governors in Enugu",
    "summarized_story": "Ifeanyi Ugwuanyi, is currently hosting governors of the southern states of Nigeria under the aegis of the Conference of Governors of Southern Nigeria.\nThe governors are currently in a closed-door meeting at the Government House, Enugu.\nThe governors had set September 1, 2021, deadline for the enactment of the law banning open grazing.\nHowever, while some states including Enugu, the current host had signed the bills into law, others are yet to do so.\nOther issues may be the boiling tax wars between the states and the Federal Government, especially those of VAT and Stamp Duty."
  },
  {
    "headline": "How To Dethrone Buhari Before 2023, By SKC Ogbonnia",
    "summarized_story": "We have become a debtor and beggar nation.”Fellow Nigerians, the above quotation is culled from the coup speech which Major-General Muhammadu Buhari and his military colleagues used to overthrow a democratically elected government in 1984.\nWe are no longer talking about the condition of the economy which has since gone comatose under President Buhari.\nThe gist is that President Muhammadu Buhari has ruined Nigeria down to its lowest ebb and any failure to dethrone him before 2023 is to set a very dangerous precedent for the country.\nPut it this way: the dethronement of Muhammadu Buhari is no longer a question of WHY; it is now a question of HOW.\nInstead of Muhammadu Buhari, who is shamelessly irredeemable, the resentment should be directed towards the legislators who have the constitutional obligation to remove the dreadful leader from office."
  },
  {
    "headline": "Bandits Deceived Us, We Won’t Negotiate Again – Zamfara Gov",
    "summarized_story": "Zamfara State governor, Bello Matawalle, has said bandits did not honour pacts entered with them and the state government won’t negotiate with them again.\nRecall that the governor had been a strong advocate of negotiating with bandits to end the insecurity in the North-West part of the country.\nThe governor, who spoke to State House correspondents on Thursday, said the military action against the bandits was yielding results.\n“As you are aware, we have a lot of security personnel that were deployed to Zamfara State and they are working seriously.\nWe thought it was something we could continue with them, but we later realised that they had deceived us."
  },
  {
    "headline": "Bandits Deceived Us, We Won’t Negotiate Again – Zamfara Gov",
    "summarized_story": "Zamfara State governor, Bello Matawalle, has said bandits did not honour pacts entered with them and the state government won’t negotiate with them again.\nRecall that the governor had been a strong advocate of negotiating with bandits to end the insecurity in the North-West part of the country.\nThe governor, who spoke to State House correspondents on Thursday, said the military action against the bandits was yielding results.\n“As you are aware, we have a lot of security personnel that were deployed to Zamfara State and they are working seriously.\nWe thought it was something we could continue with them, but we later realised that they had deceived us."
  },
  {
    "headline": "JUST-IN: Senator Shehu Sani Defects To PDP",
    "summarized_story": "Senator Shehu Sani who represented Kaduna Central senatorial district in the 8th Assembly from 2015-2019, has eventually joined the Peoples Democratic Party (PDP).\nSenator Sani who was Senator on the platform of the All Progressives Congress (APC) in 2015 could not return to the Senate in 2019 when he had unresolved issues with the Governor Nasir el-Rufai of Kaduna State and was unable to get the party’s ticket, forcing him to defect to the People’s Redemption Party (PRP) under which he contested for the same seat but lost the election.\nOnly recently he dumped the PRP after which he said he was in consultation to determine his next line of action, until the present development that he has pitched his tent with the PDP ahead of the 2023 general election.\nADVERTISEMENTIt is not clear what position he will be vying for come 2023 but rumours has it that he might be seeking for an executive position in the state or possibly a return to the Senate.\nConfirming his defection, his close aide, Malam Suleiman Ahmed confirmed that “it is true that distinguished Senator Shehu Sani has finally settled to join the PDP but official ceremony and reception will be in the next two weeks all things being equal.”He said the former lawmaker confirmed his defection on Thursday, September 16, 2021 when he had a meeting with relevant PDP stakeholders in Kaduna."
  },
  {
    "headline": "JUST-IN: Senator Shehu Sani Defects To PDP",
    "summarized_story": "Senator Shehu Sani who represented Kaduna Central senatorial district in the 8th Assembly from 2015-2019, has eventually joined the Peoples Democratic Party (PDP).\nSenator Sani who was Senator on the platform of the All Progressives Congress (APC) in 2015 could not return to the Senate in 2019 when he had unresolved issues with the Governor Nasir el-Rufai of Kaduna State and was unable to get the party’s ticket, forcing him to defect to the People’s Redemption Party (PRP) under which he contested for the same seat but lost the election.\nOnly recently he dumped the PRP after which he said he was in consultation to determine his next line of action, until the present development that he has pitched his tent with the PDP ahead of the 2023 general election.\nADVERTISEMENTIt is not clear what position he will be vying for come 2023 but rumours has it that he might be seeking for an executive position in the state or possibly a return to the Senate.\nConfirming his defection, his close aide, Malam Suleiman Ahmed confirmed that “it is true that distinguished Senator Shehu Sani has finally settled to join the PDP but official ceremony and reception will be in the next two weeks all things being equal.”He said the former lawmaker confirmed his defection on Thursday, September 16, 2021 when he had a meeting with relevant PDP stakeholders in Kaduna."
  },
  {
    "headline": "Buhari Tasks NIMC, Others On Complete Database For Nigeria",
    "summarized_story": "President Muhammadu Buhari has tasked the National Identity Management Commission (NIMC) other agencies and stakeholders in identity management to intensify efforts to achieve a complete and sustainable national database for Nigeria to help in policy formulation for the country.\nADVERTISEMENTHe stressed that digital identity would make for easy planning and would assist in critical decision making in sectors such as health, education, agriculture, women and youth development and as well in tackling unemployment.\nPantami in his speech delivered by the Permanent Secretary in the Communication Ministry, Bitrus Nabasu Bako, noted that the event was to raise awareness and sensitise the citizenry about the pivotal role of digital identification in Nigeria.\nGovernment’s knowledge of its people (citizens and residents) is fundamental to planning, governance, fiscal management, accountability, security, etc.\n“Establishing a foundational ID is the first step to empowering people & facilitating access to basic government services, civil registration & vital statistics system and the National Identity Management System have been designated as the foundational IDs in Nigeria,” Aziz stated."
  },
  {
    "headline": "Buhari pledges to use football for national development, unity",
    "summarized_story": "‘‘Our National women’s football team, the Super Falcons are a force to reckon with both on the continent and internationally.\n‘‘I have also approved the unveiling of a committee to draw up a 10 year football development master plan for the country.\nOur youth are always positively engaged when our national football teams are on assignment.\nIn his remarks, Infantino renewed FIFA’s commitment to support the development of football in Nigeria, pledging to strengthen its partnership with the Nigeria Football Federation.\nThe FIFA president thanked President Buhari for supporting the development of the game, appealing to him to help FIFA amplify the message of football as a uniting force."
  },
  {
    "headline": "Buhari pledges to use football for national development, unity",
    "summarized_story": "‘‘Our National women’s football team, the Super Falcons are a force to reckon with both on the continent and internationally.\n‘‘I have also approved the unveiling of a committee to draw up a 10 year football development master plan for the country.\nOur youth are always positively engaged when our national football teams are on assignment.\nIn his remarks, Infantino renewed FIFA’s commitment to support the development of football in Nigeria, pledging to strengthen its partnership with the Nigeria Football Federation.\nThe FIFA president thanked President Buhari for supporting the development of the game, appealing to him to help FIFA amplify the message of football as a uniting force."
  },
  {
    "headline": "Congratulatory message to Pantami: CAN suspends Gombe chairman",
    "summarized_story": "The Christian Association of Nigeria, CAN, has asked its caretaker committee chairman in Gombe State, Rev.\nSunday Congo, to temporarily vacate his office for writing a congratulatory letter to the Minister of Communication and Digital Economy, Isa Ali Ibrahim Pantami, without approval of its National Executive Committee.\nCongo had extolled Pantami over his promotion to the rank of a Professor of Cyber Security by Federal University of Technology, Owerri; describing him as a ‘son’.\nHowever, a letter dated 15th September 2021, signed by CAN’s General Secretary, Joseph Daramola, and addressed to the caretaker committee chairman of the apex Christian ” in Gombe, said Congo’s suspension took immediate effect.\nIn view of the above, you are hereby directed to relinquish your position in Gombe CAN executive with immediate effect and hand over all CAN’s property to your next in line in your bloc."
  },
  {
    "headline": "Congratulatory message to Pantami: CAN suspends Gombe chairman",
    "summarized_story": "The Christian Association of Nigeria, CAN, has asked its caretaker committee chairman in Gombe State, Rev.\nSunday Congo, to temporarily vacate his office for writing a congratulatory letter to the Minister of Communication and Digital Economy, Isa Ali Ibrahim Pantami, without approval of its National Executive Committee.\nCongo had extolled Pantami over his promotion to the rank of a Professor of Cyber Security by Federal University of Technology, Owerri; describing him as a ‘son’.\nHowever, a letter dated 15th September 2021, signed by CAN’s General Secretary, Joseph Daramola, and addressed to the caretaker committee chairman of the apex Christian ” in Gombe, said Congo’s suspension took immediate effect.\nIn view of the above, you are hereby directed to relinquish your position in Gombe CAN executive with immediate effect and hand over all CAN’s property to your next in line in your bloc."
  },
  {
    "headline": "Stop Yoruba Nation agitation now",
    "summarized_story": "Yoruba Nation agitator, Sunday Igboho has called on his followers to halt any agitation for now.\nAccording to Aliyu, in a statement, Igboho asked his supporters to ignore any message to the contrary.\n“In that wise, he has advised against staging any demonstration or rally in his name for the time being.\nHe will also like people to respect his family by not calling his mum out for anything public.\nOn no account should anybody attack any public place or security personnel on the pretence of agitating for Yoruba nation,” the statement said."
  },
  {
    "headline": "Gunmen hit Kabba again, abduct college staff, pastor, one other",
    "summarized_story": "A staff of Kogi State College of Education, Technical, Kabba and two other men have been abducted from a farm in the ancient town.\nKabba is headquarter of Kabba-Bunu Local Government Area, LGA.\nThe abductees; Olorunpomi Damilola, a staff of College of Education Technical Kabba and Pastor Mayowa Otitolaye are said to be partnering in running of a poultry farm while the identity of the third abductee was not yet known as of the time of filing in this report.\nThe Kogi State Police Public Relations officer, (PPRO) ASP William Aya confirmed the story, but said the police and local vigilantes are already on the trail of the kidnappers.\nCommunity leaders in the entire Kogi West Senatorial Zone have been raising the alarm over the influx of herdsmen in the area."
  },
  {
    "headline": "BREAKING: EFCC Chairman, Bawa Speaks On Slumping At A Public Event In Abuja",
    "summarized_story": "Abdulrasheed Bawa, the Chairman of the Economic and Financial Crimes Commission, EFCC, has revealed that his doctors recommended him to drink more water after he slumped at an event.\nHe explained that he had some dizziness and that doctors had told him he was dehydrated.\nBawa collapsed at the third National Identity Day event at the Banquet Hall Villa on Thursday afternoon, according to NEWS DIRECT.\nBawa was giving a goodwill message when he abruptly came to a halt, staggered back to his seat, and collapsed.\nBawa said he was dizzy and had to go to the hospital on Channels Television’s Politics Today a few hours after the incident."
  },
  {
    "headline": "BREAKING: Governor Ganduje Storms London To Visit Tinubu [PHOTOS]",
    "summarized_story": "Kano State Governor, Abdulahi Umar Ganduje has visited the National Leader of the All Progressives Congress, Bola Tinubu, in London.\nRecall that five Nigerian Senators had earlier visited the former Lagos state governor in London.\nBola Tinubu has spent over 70 days in the United Kingdom for medical reasons, according to reports which his media team has refuted.\nSeveral other politicians including the ex-Ogun state governor, Ibikunle Amosun, Members of the Lagos state house of Assembly, Lagos state governors, Babajide Sawnwo-Olu have all paid visits to Mr. Tinubu in London.\nFemi Gbajabiamila, also made his way to Central London to visit his political godfather, Tinubu."
  },
  {
    "headline": "Southeast Govs Absent As Southern Colleagues Meet In Enugu",
    "summarized_story": "Four of the five Southeast governors were absent from the Southern Governors meeting that was held in Enugu state today, Thursday, September 16.\nThe host governor, Ifeanyi Ugwuanyi of Enugu state was the only governor from the South East that attended the meeting.\nOther Governors in attendance at the meeting include Ifeanyi Okowa (Delta); Gbenga Oyetola (Osun); Babajide Sanwo-Olu(Lagos); Nyesom Wike(Rivers); Udom Emmanuel(Akwa Ibom); Duoye Diri (Bayelsa) and Dapo Abiodun (Ogun).\nThe Deputy Governors who attended the meeting include Prof Evara Esu (Cross River); Udo Okochukwu(Abia); Bisi Egbeyemi (Ekiti); Kelechi Igwe (Ebonyi); Rauf Olaniyan(Oyo); Philip Shuaibu (Edo) and Prof. Placid Njoku(Imo).\nThe Governors, first ushered into a security guard of honor, were later received by Ugwuanyi at the Government Lodge."
  },
  {
    "headline": "BREAKING: Senator Shehu Sani Defects To PDP, Becomes Governorship Candidate [PHOTO]",
    "summarized_story": "Senator Shehu Sani has joined the Peoples Democratic Party, or PDP, for the first time.\nSani switched from the Peoples Redemption Party (PRP) to the Peoples Democratic Party (PDP).\nSani had been preparing to join the Opposition Party for some time, he discovered.\nHe met with all 23 PDP local government chairmen in Kaduna State at his apartment last month to devise a strategy for the 2023 elections.\nOn Thursday, he announced his defection to party executives in a meeting."
  },
  {
    "headline": "Pictures: FIFA President, Gianni Infantino, storms Abuja National stadium, parleys Minister Sunday Dare, Amaju Pinnick",
    "summarized_story": "The Minister of Youth and Sports Development together with the President of Nigeria Football Federation Amaju Pinnick on Thursday received visiting President of World football governing body FIFA Gianni Infantino inside Moshood Abiola National stadium Abuja."
  },
  {
    "headline": "(VIDEO) Breaking: Minister Sunday Dare, Pinnick receive FIFA president, Gianni Infantino, inside Abuja National stadium",
    "summarized_story": "The Minister of Youth and Sports Development together with the President of Nigeria Football Federation Amaju Pinnick on Thursday received visiting President of World football governing body FIFA Gianni Infantino inside Moshood Abiola National stadium Abuja."
  },
  {
    "headline": "Breaking: Relief as UCTH successfully performs first open heart surgery",
    "summarized_story": "The Chief Medical Director(CMD) of the University of Calabar Teaching Hospital (UCTH) has disclosed that the tertiary health institution has performed its first open heart surgery on Wednesday, September 15, 202, being the first to do so in the South South region of the country.\nAfter two years of sacrificial hard work, doggedness, critical planning and determination against many odds, here we are today.\nHours of work went into this project.\n“As far as I know, we are the first Tertiary Health Institution in South-South Nigeria to accomplish this, and join a group of very few elite centres nationwide.\nTo the Cardiothoracic Unit & the Heart Surgery Team led by Prof Etiuma, I say Thank you,” Prof Ikpeme said."
  },
  {
    "headline": "CCCN celebrates 2021 Mid-Autumn festival virtually -NigPilot",
    "summarized_story": "The China Cultural Center in Nigeria (CCCN) has unveiled series of online programs to celebrate the festival, beginning from 14 to 28 of September 2021.\nExplaining that the Mid-autumn festival is an annual Chinese traditional festival, Mr Wang disclosed that Sept 21 will witness the arrival of the 2021 Mid-autumn festival.\nAccording to the statement, “Nowadays the Mid-Autumn Festival celebration has already become very popular worldwide.\nThe Festival is the second most important festival in China just after the Chinese Spring Festival .\n“The highlight of this Mid-Autumn Festival celebration lies in Heilongjiang part."
  },
  {
    "headline": "CCCN celebrates 2021 Mid-Autumn festival virtually -NigPilot",
    "summarized_story": "The China Cultural Center in Nigeria (CCCN) has unveiled series of online programs to celebrate the festival, beginning from 14 to 28 of September 2021.\nExplaining that the Mid-autumn festival is an annual Chinese traditional festival, Mr Wang disclosed that Sept 21 will witness the arrival of the 2021 Mid-autumn festival.\nAccording to the statement, “Nowadays the Mid-Autumn Festival celebration has already become very popular worldwide.\nThe Festival is the second most important festival in China just after the Chinese Spring Festival .\n“The highlight of this Mid-Autumn Festival celebration lies in Heilongjiang part."
  },
  {
    "headline": "e-commerce spending in Nigeria stood at $13bn -FG -NigPilot",
    "summarized_story": "Federal Government has disclosed that the current e-commerce spending in Nigeria is estimated at $13billion yearly.\nwho stated this in Abuja at the Second National E-commerce Roundtable Session in Nigeria, said e-commerce is projected to rise to about $75billion in revenue per annum by 2025.\nShe, therefore, said her ministry was passionate about the growing Investment opportunities in the e-commerce value chain, which are capable of contributing significantly to the country’s Gross Domestic Product(GDP).\nIn view of the cross-cutting nature of e-commerce, Ngige said her ministry was open to collaborate with any organisation that would support the development of the e–commerce ecosystem in Nigeria.\nHe lamented that in spite of the growing opportunities in the e-commerce, Nigeria has not been able to explore it’s enormous potential."
  },
  {
    "headline": "e-commerce spending in Nigeria stood at $13bn -FG -NigPilot",
    "summarized_story": "Federal Government has disclosed that the current e-commerce spending in Nigeria is estimated at $13billion yearly.\nwho stated this in Abuja at the Second National E-commerce Roundtable Session in Nigeria, said e-commerce is projected to rise to about $75billion in revenue per annum by 2025.\nShe, therefore, said her ministry was passionate about the growing Investment opportunities in the e-commerce value chain, which are capable of contributing significantly to the country’s Gross Domestic Product(GDP).\nIn view of the cross-cutting nature of e-commerce, Ngige said her ministry was open to collaborate with any organisation that would support the development of the e–commerce ecosystem in Nigeria.\nHe lamented that in spite of the growing opportunities in the e-commerce, Nigeria has not been able to explore it’s enormous potential."
  },
  {
    "headline": "3.7m jobs in offing as FG launches youth employment plan -NigPilot",
    "summarized_story": "The employment market for Nigerian youths is about to receive a boost as the federal government is set to create 3.7 million jobs annually through joint efforts with the private sector in several priority areas with high job creation potentials.\nMinister of Youths and Sports Development, Mr. Sunday Dare, stated this Tuesday in Abuja at the official launch of the Nigerian Youth Employment Action Plan, NIYEAP, 2021-2024.\nNIYEAP, which was developed with technical assistance from the International Labour Organization, ILO, and support from ECOWAS and the Spanish Development Agency, is to promote decent jobs for youths.\nIt is also expected to contribute to the achievement of the job creation target of the National Youth Policy(2019) to create 3.7 million jobs annually.\nThe NIYEAP, which identifies strategic lines of action the “four Es”: Employability, Entrepreneurship, Employment, and Equality and Rights, is expected to contribute to address the challenge of youth employment through effective implementation."
  },
  {
    "headline": "Southern Governors Back VAT Collection By States, Zoning Of 2023 Presidency To South",
    "summarized_story": "They made the declaration on Thursday at a meeting of the governors held at the Government House in Enugu State.\nAccording to him, the meeting resolved to support the position that the collection of VAT falls within the powers of the states.\nThe governors reaffirmed their commitment to fiscal federalism and stressed the need for the southern states to pursue its inclusion in the Nigerian Constitution, through the ongoing constitutional amendment.\nAhead of the general elections in 2023, the governors insisted that the next Nigerian leader must come from the South.\nSimilarly, the governors lauded the Nigerian Governors’ Forum for its handling of issues around the Petroleum Industry Act (PIA) and ownership of the Nigerian National Petroleum Corporation (NNPC)."
  },
  {
    "headline": "VIDEO: I Am Very Much Ok, EFCC Boss Bawa Speaks From Home",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC), Mr Abdulrasheed Bawa, says he is well and in good shape following the incident at an event on Thursday in Abuja.\n“I am ok, you can see that I am very much ok,” he said on the Channels Television’s political programme.\nBawa Is Hale And HeartyEarlier, Bawa was delivering a speech titled ‘Importance of Digital Identification’ in commemoration of the National Identity Day when he was said to have become emotional suddenly.\nFollowing the incident, EFCC spokesman, Wilson Uwujaren, corroborated the position of the minister in a statement, saying Bawa was in a good shape.\n“The Chairman of the Economic and Financial Commission, EFCC, Abdulrasheed Bawa is hale and hearty,” the statement read."
  },
  {
    "headline": "UPDATED: Fani-Kayode Joins APC, Explains Role In Defection Of Three PDP Governors",
    "summarized_story": "Former Minister of Aviation, Mr Femi Fani-Kayode, has officially defected from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nThe former PDP chieftain was introduced to President Muhammadu Buhari as the newest member of the ruling party on Thursday during a visit to the Presidential Villa in Abuja.\nFani-Kayode, a former spokesman for the PDP Presidential Campaign Council, said he was instrumental in the events that led to the defection of the three governors.\nThe former minister revealed that he was equally wooing three more governors in the main opposition party to join the ruling party.\nHe listed them to include Governor Seyi Makinde of Oyo State, Governor Bala Mohammed of Bauchi State, and Governor Ifeanyi Uguanyi of Enugu State."
  },
  {
    "headline": "UPDATE: Nine Civilians Killed, 23 Injured In NAF Airstrike On Yobe Community – SEMA",
    "summarized_story": "Nine civilians were killed on Wednesday following an airstrike on Buwari community in Yunusari Local Government Area of Yobe State, authorities have said.\nThe airstrike which locals and the government believe was an accidental fire by the Nigerian Air Force (NAF), also left 23 people injured.\nConfirming the development, Secretary to the State Emergency Management Agency (SEMA), Mohammed Goje, said two of the victims who were critically injured have been transferred to the Yobe State University Teaching Hospital for further treatment.\nNAF Makes U-TurnWhen initial reports emerged on Wednesday, suggesting that a fighter jet belonging to NAF had attacked civilians in Yobe State, military authorities denied the claims.\nBut NAF spokesman, Air Commodore Edward Gabkwet, later affirmed that a fighter jet had been deployed to the region, following intelligence regarding terrorists’ movements along the Kamadougou Yobe River line."
  },
  {
    "headline": "VAT Dispute: Appeal Court Reserves Ruling On Lagos Govt’s Application For Joinder",
    "summarized_story": "The Court of Appeal in Abuja has reserved its ruling on the application for a joinder filed by the Lagos State government as the legal tussle over the collection of Value Added Tax (VAT) continues.\nHe, therefore, urged the court to uphold the application for joinder, arguing that the case of joinder sought to prevent multiplicity of action.\nOn his part, counsel to the Rivers State government and SAN, Ifedayo Adedipe, supported the application for joinder by the Lagos State government.\nBut counsel to the FIRS and SAN, Mahmoud Magaji, opposed the application for joinder while relying on Section 243 of the Constitution.\nHe explained that the Constitution does not support applications for joinder and Lagos State was not a party to the suit at the trial court."
  },
  {
    "headline": "Updated: Southern governors insist power must shift to South in 2023 -",
    "summarized_story": "Governors of the Southern region of Nigerian have insisted that power should be shifted to the South come 2023.\nThis forms part of the resolutions reached at its meeting held in Enugu, insisting that power rotation between North and South, as introduced in 1999, should be respected.\nThe meeting which had 9 Governors, with 6 deputies having Anambra state governor absent, urged the sub-regions to implement the regional security outfits.\nAmong other issues raised at the meeting Include the need for states to enact its Values Added Tax law, as well as encouraging states to implement its Anti-Grazing law.\nThe next meeting has been moved to River state in November, 2021."
  },
  {
    "headline": "Bandits used abducted students, Staff as human shields during military raid",
    "summarized_story": "Zamfara state Governor, Bello Matawalle said abductors of students and staff of government day secondary school kaya used their victims as human shields during military raid on their camps.\nThe students and staff of government Day secondary kaya in Maradun local government, were abducted on first September 2021 in broad daylight while receiving lectures.\nGovernor Bello Matawalle said the abductors used their victims as shields during the military raid on their camps.\nThe seventy five students and staff rescued were reunited with their families in kaya, Maradun local government area.\nThe Zamfara state government assures residents that measures have been put in place to stop the recurrence of school abductions."
  },
  {
    "headline": "BREAKING: Fani-Kayode finally dumps PDP for APC -",
    "summarized_story": "President Muhammadu Buhari on Thursday received the new member of the All Progressives Congress, Femi Fani-Kayode, at the State House, Abuja.\nFemi Fani-Kayode was a former minister of Aviation and chieftain of the Peoples Democratic Party (PDP).\nHe was presented to President Muhammadu Buhari by the Chairman, Caretaker Committee of the APC, and governor of Yobe State, Mai Mala Buni on Thursday at the Presidential Villa, Abuja.\nHe further disclosed that he was instrumental for the exit of three Peoples Democratic Party, PDP, governors to the APC.\nThe governors he mentioned were Dave Umahi of Ebonyi State, Ben Ayade of Cross River State and Bello Matawale of Zamfara State."
  },
  {
    "headline": "Man paraded for supplying fuel to bandits in Sokoto",
    "summarized_story": "A suspected merchant who has allegedly benefitted from the activities of armed bandits by supplying fuel and other consumables to the to the criminals has been arrested in Sokoto state.\nThe suspect was paraded at the Sokoto state police command headquarters alongside other suspected criminals arrested by men and officers of the command.\nThe suspect was arrested along Illela road in Sokoto with the twenty three jerricans of fuel intended to be delivered to the suspected armed bandits.\nAlso paraded are two suspected armed bandits who have confessed to have participated in several attacks within Sokoto state and other North West Geopolitical region.\nA notorious motorcycle snatcher who specializes in drugging his victims and impersonating the army have also been arrested and was among the suspected criminals paraded."
  },
  {
    "headline": "Obogoro in Bayelsa, Deep in Nigeria’s Niger-Delta, Faces Erosion Threat",
    "summarized_story": "Coastal erosion and flooding are two natural disasters confronting the Obogoro community in Bayelsa State.\nThe people seek the collaboration of the State and Federal Governments to save their land as more buildings cave into the encroaching river.\nARISE Correspondent, Ovieteme George reports…"
  },
  {
    "headline": "IPOB and Yoruba Nation Agitators Are Like Terrorists, Says Gbajabiamila – Trending With Ojy Okpe",
    "summarized_story": "The Speaker of the House of Representatives Femi Gbajabiamila’s comment, which compared those agitating for secession to Boko Haram Insurgents and ISWAP terrorists has garnered mixed reactions On social media.\nMeanwhile President Muhammadu Buhari’s announcement, that about “eight million” individuals are currently benefiting under the “conditional cash transfer programme” has sparked outrage amongst some Nigerians.\nThe conditional cash transfer program which was established to benefit poor and vulnerable Nigerians, comes with a stipend of N5,000 thousand, and is paid monthly to the most vulnerable households in the country.\nAlso, ARISE News is sad to report on the passing of one of our most hard working Producers, Oluwaseun Oluwagbemi, who died on Saturday September 11th.\nHe was the Producer of The Morning Show’s What’s Trending segment, and was loved by everyone."
  },
  {
    "headline": "French Forces Kill Islamic State Leader in Sahara",
    "summarized_story": "The head of the Islamic State group in the Sahara has been killed by French troops, President Emmanuel Macron has said.\nAdnan Abu Walid al-Sahrawi formed Islamic State in the Greater Sahara (ISGS) in 2015.\nThe group is blamed for most attacks in the region, including the targeted killing of French aid workers in 2020.\nLast August, Sahrawi personally ordered the killing of six French charity workers and their Nigerien guides and drivers, the French presidency said.\nIn June, Mr Macron announced that Operation Barkhane would end in its current form, and that French troops would be cut in the region over the course of several years."
  },
  {
    "headline": "Attacks on Eritrean Refugees in Tigray ‘Clear War Crimes’",
    "summarized_story": "Eritrean soldiers and Tigrayan militias raped, detained and killed Eritrean refugees in Ethiopia’s northern region of Tigray in attacks that amounted to “clear war crimes”, an international rights watchdog has said.\nTens of thousands of Eritrean refugees live in Tigray, a mountainous and poor province of about five million people.\n“The horrific killings, rapes, and looting against Eritrean refugees in Tigray are clear war crimes,” said Laetitia Bader, the Horn of Africa director at Human Rights Watch (HRW), whose work drew on interviews with 28 refugees and other sources, including satellite imagery.\nPrior to the Tigray conflict, Ethiopia hosted around 150,000 Eritrean refugees, fleeing poverty and an authoritarian government.\nTigrayan forces marched fleeing refugees back to Hitsats, shooting some stragglers, refugees reported to HRW."
  },
  {
    "headline": "Simone Biles Blames System That ‘Enabled Larry Nassar Abuse’",
    "summarized_story": "Elite US gymnast Simone Biles has testified before the Senate about abuse she suffered at the hands of disgraced former team doctor, Larry Nassar.\n“I blame Larry Nasser, and I also blame an entire system that enabled and perpetrated [sic] his abuse,” said Ms Biles, the most decorated Olympic gymnast of all-time.\nGymnast Maggie Nichols – the first victim to report her abuse to USA Gymnastics – also testified.\nFour-time Olympic gold medallist Simone Biles – one of the most famous figures in world sports – called for the agents involved to be federally prosecuted.\nIn total, Nassar was accused of sexual abuse by more than 330 women and girls at USA Gymnastics and Michigan State University."
  }
]