[
  {
    "headline": "Bill prohibiting health workers’ strike may be reintroduced –Lawmaker",
    "summarized_story": "Alfred OlufemiThe House of Representatives member who sponsored a withdrawn bill that sought to stop health workers from embarking on protests, Simon Atigwe, says he may consider reintroducing the bill.\nThe Nigerian Association of Resident Doctors and the Joint Health Sector Union had knocked members of the House of Representatives over plans to use the bill to outlaw strikes in the health sector.\n“Originally, the idea of the bill is to encourage the government to ensure that health workers do not go on strike because of the consequences.\n“If they eventually (health workers) go on strike, the government will be held liable by the citizens,” Atigwe told our correspondent.\nBut they just heard about the ban on health workers’ strikes but didn’t know much about the idea."
  },
  {
    "headline": "Bill prohibiting health workers’ strike may be reintroduced –Lawmaker",
    "summarized_story": "Alfred OlufemiThe House of Representatives member who sponsored a withdrawn bill that sought to stop health workers from embarking on protests, Simon Atigwe, says he may consider reintroducing the bill.\nThe Nigerian Association of Resident Doctors and the Joint Health Sector Union had knocked members of the House of Representatives over plans to use the bill to outlaw strikes in the health sector.\n“Originally, the idea of the bill is to encourage the government to ensure that health workers do not go on strike because of the consequences.\n“If they eventually (health workers) go on strike, the government will be held liable by the citizens,” Atigwe told our correspondent.\nBut they just heard about the ban on health workers’ strikes but didn’t know much about the idea."
  },
  {
    "headline": "80% of PHCs can’t store, administer COVID-19 vaccines, says NGO",
    "summarized_story": "Friday OlokorThe National Primary Healthcare Development Agency on Monday signed a Memorandum of Understanding with a human rights organization under the aegis of Connected Development to strengthen and foster health sector accountability in Nigeria.\n“This kind of partnership is a giant step towards transparency and openness in the NPHCDA.\nThis MoU signing is an opportunity to openly demonstrate this transparency.\nWe welcome this collaboration because it is also an opportunity to hear from the people we serve.\n“More than 70 per cent of PHCs across the country do not have the right infrastructure, right drugs, utilities, and limited healthcare workers."
  },
  {
    "headline": "80% of PHCs can’t store, administer COVID-19 vaccines, says NGO",
    "summarized_story": "Friday OlokorThe National Primary Healthcare Development Agency on Monday signed a Memorandum of Understanding with a human rights organization under the aegis of Connected Development to strengthen and foster health sector accountability in Nigeria.\n“This kind of partnership is a giant step towards transparency and openness in the NPHCDA.\nThis MoU signing is an opportunity to openly demonstrate this transparency.\nWe welcome this collaboration because it is also an opportunity to hear from the people we serve.\n“More than 70 per cent of PHCs across the country do not have the right infrastructure, right drugs, utilities, and limited healthcare workers."
  },
  {
    "headline": "We’re anxious to produce Nigeria first Nobel Laureate in Science – FG",
    "summarized_story": "Ogbonnaya Onu…Awards scholarships to best students in STEMBy Emmanuel ElebekeThe Minister of Science, Technology, and Innovation, Dr. Ogbonnaya Onu says the Federal government is very anxious to produce the first Nigerian Nobel Laureate in Science.\nThe Minister made this known on Monday in Abuja while awarding scholarships on behalf of the Federal Government to the best students of Science, Technology, Engineering, and Mathematics (STEM) in the country.\nHe said the award came as a challenge to young Nigerians to show interest in Science subjects through STEM.\nWe are challenging all Nigerian students in secondary schools to show interest in science and take up career in science.\nNigeria is blessed in a very unique way, we have got virtually all minerals both solid and liquid."
  },
  {
    "headline": "FCTA begins tree planting, beautification along Airport Road",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) on Monday disclosed plans to commence beautification and tree planting along the airport road.\nMr Ikharo Attah, Senior Special Assistant on Monitoring, Inspection and Enforcement to FCT Minister, made the disclosure during an advocacy visit to Sauka Community along the airport road, in Abuja.\nHe noted that Sauka community, as one of the strategic settlements along the airport road axis, had some contravention which needed to be corrected.\n“The Minister has directed us to commence massive tree planting and landscaping on the stretch of airport road.\n” We are also going to embark on refuse evacuation and intra community refuse collection points ."
  },
  {
    "headline": "Makinde approves appointment of 42nd Olubadan of Ibadanland",
    "summarized_story": "Governor Seyi MakindeBy Adeola BadruOyo State Governor, ‘Seyi Makinde, has approved the appointment of Senator Lekan Balogun as the 42nd Olubadan of Ibadanland.\nThe approval follows a recommendation to that effect made by the Olubadan-in-Council and which was communicated to the governor.\nMakinde wishes the newly confirmed Olubadan a peaceful and eventful reign.\nThe governor said: “I am pleased to announce the appointment of the Otun Olubadan of Ibadanland, High Chief Lekan Balogun as the 42nd Olubadan of Ibadanland.\n“The appointment is in line with the Olubadan of Ibadan Chieftaincy Declaration, as well as the unique and time-tested tradition of our people."
  },
  {
    "headline": "Love is special to me – Singer/actress, Sandra Ifudu",
    "summarized_story": "Singer and actress Sandra Ifudu does not mince words on her belief in love.\nShe says the day is set aside to celebrate love specially even though love is to be celebrated everyday.\n“Of course, I believe in love.\nLike I said, love is a beautiful thing and it makes the world go round.\nLove is special to me because I can’t even imagine this world without love in the first place,” she says."
  },
  {
    "headline": "FRSC begins clamp down on motorists using drugs, intoxicating substances",
    "summarized_story": "The Federal Road Safety Corps (FRSC), Ogun Command, says it has begun an exercise to arrest motorists found using drugs and other intoxicating substances while driving in Ogun.\nThe Sector Commander of FRSC, Mr Umar Ahmed, said this in an interview with the News Agency of Nigeria (NAN) on Monday in Ota, Ogun.\n“Anyone tested with our equipment and found driving under the influence of alcohol or using intoxicating substances would be arrested and handed over to National Drug Laws Enforcement Agency (NDLEA) for further investigation and prosecution.\n“We implore motorists to desist from using drugs or any intoxicating substances that could affect their decisions negatively, thus leading to road crashes,” he said.\nThe FRSC boss also cautioned motorists against speeding and wrong overtaking to avoid unnecessary crashes on the roads."
  },
  {
    "headline": "Katsina bans Yansakai vigilante group, declares members wanted",
    "summarized_story": "Katsina State Government has announced the ban on the activities of “Yan Sa Kai” vigilante group, ordering their arrest by the police and other security agencies for their recalcitrant offences and extra judicial killings in the state.\nThis was disclosed in a statement duly signed by the Special Adviser on Security Matters to the state government and made available to DAILY POST by the State Director General, Media, Abdul Labaran Malumfashi.\nAccording to the Special Adviser on Security Matters, Ibrahim Ahmed Katsina, with the ban, the police and security agencies are directed to ensure that all ‘Yan Sa Kai activities across the State are dismantled, noting that “henceforth, nobody should take the law into his hands, under whatever guise.\nArrested suspects should be handed over to the Police or any security agency for proper investigation and action where need be.”Following the directives of the Katsina state government, the Katsina Command has directed “all its Commanders and Divisional Police Officer (DPOs) to go after the recalcitrant offenders and their sponsors wherever they are in the state and make sure they face the wrath of law.”The Command also warned “members of the public to disassociate themselves with the group and cooperate with security agencies,reporting any “Dansakai or Yansakai” within their domains.\nsaying “the Command will not fold its arms while some disgruntled members of the public take laws into their hands, brazenly killing innocent citizens, destroying and looting public property without recourse to the rule of law.”According to the statement, henceforth “the Nigeria Police Force and indeed other sister security agencies will deal decisively with any person or group of persons found parading themselves as Yansakai or any other like name in the state.”"
  },
  {
    "headline": "Gunmen attack Aregbesola’s convoys in Osogbo",
    "summarized_story": "Unknown gunmen on Monday attacked the convoy of Minister of Interior, Rauf Aregbesola, during a roadshow he conducted in Osogbo, the Osun State capital.\nThe pandemonium broke when Aregbesola got to Orisunbare market, close to Old-Garage when sounds of gunshots rented the air.\nA team of combined security operatives from the Nigeria Security and Civil Defence Corps, Nigeria Immigration Service and Department of State Security, who were among Aregbesola’s convoy, repealed the thugs.\nThis is coming after Aregbesola openly declared support for the former Secretary to the State Government, Moshood Adeoti and proclaimed him as the next governor of the state.\nMeanwhile, DAILY POST reported earlier that Osun State announced that it has credible reports that some “misguided cowards” have invaded Osogbo, the state capital with armed thugs to foment trouble."
  },
  {
    "headline": "Sylvester Oromoni: My son was not taken to hospital – Father reveals",
    "summarized_story": "He gave a timeline of events from when Oromoni Jnr was brought home from school by his guardian, Mr Clifford Tejere, on Nov. 23, 2021.\nHe was taken to a diagnostic centre,” Oromoni Snr said.\nHe said on Nov. 26, 2021, he left for Warri, Delta, with his son and arrived in the evening and that Oromoni Jnr was not taken to the hospital on that day.\nThe witness further revealed that after Oromoni Jnr was confirmed dead, the family wanted to bury him immediately.\nResponding to more questions, Oromoni Snr revealed that he had never been to his son’s hostel at Dowen College."
  },
  {
    "headline": "Buhari reacts to emergence of Lekan Balogun as 42nd Olubadan of Ibadan",
    "summarized_story": "President Muhammadu Buhari has reacted to the appointment of Senator Lekan Balogun as the 42nd Olubadan of Ibadanland.\nIn a congratulatory message signed by Femi Adesina, his media adviser, President Buhari said that the Balogun has earned the appointment through his dedication in diligently serving his people.\nBuhari said he believes that the appointment will bring peace and prosperity to the land and continued honour to the crown.\nRecall that Governor Seyi Makinde of Oyo State approved the appointment of Senator Balogun as the 42nd Olubadan of Ibadanland.\nThat the position of Olubadan of Ibadanland became vacant on Sunday, January 2 this year."
  },
  {
    "headline": "EFCC secures final forfeiture of ‘top military officer’s’ properties worth N3.07bn",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has secured the final forfeiture of 20 landed properties valued at over N3,007,000,000 belonging to “a top military officer”.\nA statement on Monday by EFCC Head of Media, Wilson Uwujaren, did not name the senior officer.\nIn May 2020, the court ordered the interim forfeiture of the properties following an ex parte application alleging that they were proceeds of unlawful activities.\nIn the absence of any contestation, the court ordered the final forfeiture of the assets located in Kano, Katsina, Calabar (Cross River) and Kaduna States.\nThey include Fuel Stations, Event Centers, Plazas, Block Industries, Truck Assembly Plant, Polythene Production factory and Table Water factory."
  },
  {
    "headline": "Gunshots, panic as Osun govt, Aregbesola trade blames",
    "summarized_story": "There was panic on Monday at Old Garage area, Osogbo the capital of Osun State when security operatives in the convoy of Minister of Interior, Rauf Aregbesola shot sporadically.\nThe incident caused panic as residents of Osogbo around Ajekunle, Rasco, Orisunmbare, Post Office, Ola-Iya, station road and Fagbewesa areas ran helter skelter.\nA trader at Old Garage Idowu, said: “Aregbesola’s convoy was passing through old garage area when the incident occurred.\n“They were charging at him to launch an attack on him but his security operatives who were part of his convoy shot sporadically to scare them away.\n“Oyetola thugs fired several gunshots at Aregbesola’s, Adeoti (Sheu) convoy after declaring his preferred choice for Governorship."
  },
  {
    "headline": "Buhari to grant scholarship to 3 best young Nigerian scientists",
    "summarized_story": "President Muhammadu Buhari will grant scholarships up to Doctorate level to three young Nigerians who emerged the best in the final exams of the 774 Young Nigeria Scientists Presidential Award for 2022.\nOnu said Buhari will receive and grant scholarships to the young pupils at the opening ceremony of the STI Expo 2022, starting on March 14, 2022.\n- Advertisement -Onu said it is imperative to nuture young pupils to come out the best because Nigeria needs the best hands and minds to solve national problems.\nHe also exhorted other candidates who emerged the best in their states to become the best in their university years.\nMaster Gbolahan Ayinde of Ogun state emerged second while Uchendu Judith from Edo state took the third position."
  },
  {
    "headline": "Osun 2022: Aregbesola endorses Adeoti, hits Oyetola",
    "summarized_story": "Minister of Interior Rauf Aregbesola has endorsed the ex-Secretary to Osun State Government Moshood Adeoti as Governor.\nHe noted that the party was back in the hands of true progressives who will work assiduously to win in the July 16 governorship election.\nAregbesola alleged that Governor Adegboyega Oyetola’s administration has deviated from the true tenets of APC.\nHe urged party stakeholders to work for the success of Adeoti in Saturday’s shadow poll.\nIn Shaa Allah, Adeoti is the next governor of Osun."
  },
  {
    "headline": "I miss you every day, Actress Eniola Badmus remembers mom 18 years after",
    "summarized_story": "Actress Eniola Badmus has commemorated the death of her mother, 18 years after.\nEniola also highlighted some of the values her mother instilled in her while reiterating how much she’s missed by her siblings and herself.\n- Advertisement -“Dear mother, you were the first woman I have loved and I will love for eternity.\n“I still miss you so much, mom.\n“Continue to rest on I miss you IYE BIODUN!"
  },
  {
    "headline": "Super TV: How killer’s bad SMS English tipped off Ataga’s friends, by witness",
    "summarized_story": "Ataga’s friend and co-founder of Super TV, Mr Rahman Saliu, said the deceased was fluent in English but the SMS sent to him from Ataga’s phone contained uncharacteristic errors.\n“The construction of that message was not Michael’s because Michael was very fluent in English.\nOutgoing payment transaction information from Ataga’s bank account led the search to the Airbnb apartment where he was killed.\n“When I got to the mortuary, I saw Michael’s body.\nI started tracking Chidinma, I started looking at Michael’s calls from 9mobile and MTN, Chidinma was calling him with a WhatsApp number."
  },
  {
    "headline": "nigerians-in-germany-host-orji-kalu-endorse-him-for-president",
    "summarized_story": "Nigerians in Germany under aegis of the Nigerian Union have declared support and allegiance to the Chief Whip of the Senate, Senator Orji Uzor Kalu as their candidate for the 2023 Presidency.\nThe group made their declaration at a special dinner held in Frankfurt Germany in honour of the former Abia governor, citing his national acceptance and governance expertise ,Nigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe group mentioned that Orji Kalu’s detribalised character will unite the nation and also foster peace and unity which the nation desperately needs."
  },
  {
    "headline": "Wanted DCP Abba Kyari, 4 others now in our custody – NDLEA",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has confirmed that the suspended Deputy Commissioner of Police (DCP) and former head of the Intelligence Response Team (IRT), Abba Kyari, and four others are now in its custody.\nThis came a few hours after the agency had declared Abba Kyari wanted over his involvement in a 25 kilograms Cocaine deal.\nThe confirmation was contained in a statement by the Director of Media and Advocacy, Femi Babafemi.\nThe statement reads: “The Nigerian Police Force has handed over the suspended DCP Abba Kyari, the erstwhile Commander of Intelligence Response Team (IRT) at the Force Intelligence Bureau of the Nigerian Police Force, to the anti-narcotic agency.\nFive of the wanted suspects namely: DCP Abba Kyari; ACP Sunday J Ubua; ASP Bawa James; Inspector Simon Agirgba and Inspector John Nuhu were driven into the National Headquarters of NDLEA in Abuja at about 5 pm on Monday 14th February to formally hand them over for interrogation and further investigation."
  },
  {
    "headline": "(UPDATED) NDLEA declares Abba Kyari wanted",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Intelligence Response Team (IRT), Abba Kyari wanted for belonging to an international drug cartel.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nKyari, a deputy commissioner of police who has refused to honour the invitation by the NDLEA was equally wanted for pushing illicit drugs.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works."
  },
  {
    "headline": "ASUU declares one month nationwide strike",
    "summarized_story": "By Gabriel DikeThe Academic Staff Union of Universities (ASUU) has declared one month strike in public universities in the country.\nThe decision was taken at a two-day National Executive Council (NEC) meeting held at the University of Lagos (UNILAG).\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe National President of ASUU, Prof. Emmanuel Osodeke, is about addressing the press on the reason for the one month."
  },
  {
    "headline": "Anxiety as ASUU prepares for full-scale strike",
    "summarized_story": "Some students and parents, who spoke to Daily Sun, expressed fears about what might be the outcome of the ASUU NEC meeting.\nI have spent extra years in school due to incessant ASUU strike, in addition to COVID-19 that disrupted our academic calendar in 2020.\nHe appealed to ASUU NEC not to consider the option of strike as it would have more devastating effect on students who would suffer delayed and disrupted academic programmes.\nHis mother, Mrs. Ngozi Ugwu, pleaded with ASUU to adopt other tactics in dealing with the government without dragging students and parents down with a strike.\nUniversity students and parents in Port Harcourt, Rivers State, have, however, begged ASUU not to embark on its planned strike."
  },
  {
    "headline": "NDLEA: DCP Abba Kyari, 4 Others Now in Our Custody",
    "summarized_story": "Michael OlugbodeFew hours after he was declared wanted by the National Drug Law Enforcement Agency, NDLEA over his alleged illicit drug links, suspended DCP Abba Kyari have been handed by the police to the anti-narcotics agency.\nA statement by the spokesman of the agency, Femi Babafemi, said the Nigerian Police Force handed over Kyari, the erstwhile Commander of Intelligence Response Team (IRT) at the Force Intelligence Bureau of the Nigerian Police Force, to NDLEA.\nHe said five of the wanted suspects namely: DCP Abba Kyari; ACP Sunday Ubua; ASP Bawa James; Inspector Simon Agirgba and Inspector John Nuhu were driven into the National Headquarters of NDLEA in Abuja at about 5pm on Monday to formally hand them over for interrogation and further investigation.\nHe said: “The Agency wishes to assure that no stone will be left unturned to ensure that all suspects already in custody and those that may still be indicted in the course of investigation will face the full weight of the law at the end of the ongoing probe.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Police Arrest DCP Abba Kyari, Four Others After NDLEA’s Drug Allegation",
    "summarized_story": "The IG also ordered the immediate transfer of case to the Nigerian Drug Law Enforcement Agency (NDLEA).\nThe police officers include, DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr.\nNDLEA had earlier on Monday declared the suspended DCP Abba Kyari wanted for allegedly operating a drug cartel.\nIt is to be emphasised that DCP Abba Kyari’s involvement in these allegation occurred while his suspension from service was subsisting.\n” The concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr."
  },
  {
    "headline": "Full Text of NDLEA’s Statement on DCP Abba Kyari and Video of Sting Operation",
    "summarized_story": "TEXT OF PRESS BRIEFING BY THE NATIONAL DRUG LAW ENFORCEMENT AGENCY, NDLEA, ON MONDAY, FEBRUARY 14, 2022.\nThe saga started on Friday, January 21, 2022, when DCP Kyari initiated a call to one of the NDLEA officers in Abuja at 2:12 pm.\nHe also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61,400.\nSo we have a trove of intelligence, hard facts, from chats to photos and video and a detailed transcript of the communication between him and the NDLEA officer.\nWe are making this strong statement to those contemplating harmful action against NDLEA officers."
  },
  {
    "headline": "(Updated) NDLEA Declares Suspended DCP Abba Kyari Wanted over Drug Links",
    "summarized_story": "Michael Olugbode in AbujaThe National Drug Law Enforcement Agency, (NDLEA) has declared the suspended DCP Abba Kyari wanted for allegedly operating a drug cartel.\nNDLEA Spokesman, Femi Babafemi, said at a press conference that invitation was given to DCP Kyari since Friday to make himself available at the NDLEA Headquarters in Abuja to explain his alleged links to a drug cartel.\nAccording to Babafemi, the NDLEA had no option than to declare Kyari wanted for failure to honour invitation extended to him on the matter.\nDCP Kyari was suspended by police authorities pending the outcome of an investigation into his alleged connection with international fraudster Ramon Abbas “Hushpuppi, who is currently standing trial for fraud in US.\nThe suspended police chief is also wanted in the US over links to Hushpipi."
  },
  {
    "headline": "(Updated) ASUU Begins Four-Week Roll over Strike",
    "summarized_story": "By Funmi OgundareThe Academic Staff Union of Universities (ASUU) Monday, said it was embarking on a roll-over four-week strike beginning from February 14, following the failure of the federal government to fully implement the Memorandum of Understanding ( MoU) and the Memorandum of Action ( MoA).\nHe regretted that IPPIS is a cesspool of corruption which glaringly undermines the autonomy of the Nigerian University system, saying that the payment platform was unilaterally imposed by the the government to further compound the multi-faceted problems in the universities.\n“He is a serving minister and a lecturer, this is very wrong.\nNEC has directed all members and branches of our union throughout the federation not to recognise, accord or treat Dr. Isah Ali Pantami as a professor of Cybersecurity under any guide.\nNEC also resolved to sanction all ASUU members who participated in the process that led to the illegal appointment in accordance with the establishment procedures of our union,” the president stressed."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "Corruption-riddled Governor Of Nigeria's Central Bank, Godwin Emefiele To Use CBN's Funds To Finance Presidential Ambition",
    "summarized_story": "There are plans by Godwin Emefiele, governor of the Central Bank of Nigeria, to use funds from the apex bank to fund his presidential ambition, SaharaReporters gathered.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "Corruption-riddled Governor Of Nigeria's Central Bank, Godwin Emefiele To Use CBN's Funds To Finance Presidential Ambition",
    "summarized_story": "There are plans by Godwin Emefiele, governor of the Central Bank of Nigeria, to use funds from the apex bank to fund his presidential ambition, SaharaReporters gathered.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "Federal Capital Territory Administration To Demolish Official Residences Of Senate President, Speaker For Violating Master Plan",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) has revealed plans to demolish the official residences of the President of the Senate and Speaker of the House of Representatives, presently under construction around the Three Arms Zone.\n“The official residences of the President of the Senate and the Speaker of the House of Representatives don’t conform with our Master Plan.\nMeanwhile, the approval was given by the FCT Administration which also supervises the construction of the structures which are located inside the National Assembly.\nFormer FCT Minister and current Governor of Bauchi State, Bala Mohammed, had approved the construction of the structures during President Goodluck Jonathan's administration.\nThe structures are expected to be completed before the expiration of President Muhammadu Buhari’s administration in May 2023."
  },
  {
    "headline": "APPLY: Soludo unveils portal for Anambra indigenes interested in public service",
    "summarized_story": "Ahead of his swearing-in scheduled for March 17, Chukwuma Soludo, governor-elect of Anambra, has unveiled an online platform for Anambra people interested in serving in his administration.\nHe said to enable a credible and competitive process, he has approved the launch of the Anambra talent data bank for indigenes to express interest in volunteering, seeking political appointments or working in paid public service positions.\n“This platform is designed for Ndi Anambra to ‘Express Interest’ in volunteering or seeking a political appointment or career in paid public service positions.\nAdvertisement“We hope to attract problem-solvers with passion, competence, capacity, and integrity who are interested in joining a team of other selfless public servants to transform Anambra State into a livable and prosperous smart megacity.\n“We have a comprehensive outline of political offices, public service, and volunteer options on the Talent DataBank platform to choose what aligns with your competencies, experiences, and passion."
  },
  {
    "headline": "APPLY: Soludo unveils portal for Anambra indigenes interested in public service",
    "summarized_story": "Ahead of his swearing-in scheduled for March 17, Chukwuma Soludo, governor-elect of Anambra, has unveiled an online platform for Anambra people interested in serving in his administration.\nHe said to enable a credible and competitive process, he has approved the launch of the Anambra talent data bank for indigenes to express interest in volunteering, seeking political appointments or working in paid public service positions.\n“This platform is designed for Ndi Anambra to ‘Express Interest’ in volunteering or seeking a political appointment or career in paid public service positions.\nAdvertisement“We hope to attract problem-solvers with passion, competence, capacity, and integrity who are interested in joining a team of other selfless public servants to transform Anambra State into a livable and prosperous smart megacity.\n“We have a comprehensive outline of political offices, public service, and volunteer options on the Talent DataBank platform to choose what aligns with your competencies, experiences, and passion."
  },
  {
    "headline": "Fayemi: Governors contested executive order 10 to prevent arbitrary removal of state funds",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, says the Nigeria Governors’ Forum (NGF) approached the court on executive order 10 to prevent arbitrary removal of state funds.\nOn May 22, 2020, President Muhammadu Buhari signed the order, granting financial autonomy to the legislature and the judiciary in the 36 states of the federation.\nDays after signing the order, Buhari suspended its implementation following reservations expressed by governors.\nThe order empowers the accountant-general of the federation to deduct funds for the state legislature and the judiciary from the federation allocation to the states.\nSpeaking on the development in an interview with Channels Television on Monday, Fayemi said governors are still committed to financial autonomy for state judiciary and legislature despite the supreme court verdict."
  },
  {
    "headline": "Fayemi: Governors contested executive order 10 to prevent arbitrary removal of state funds",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, says the Nigeria Governors’ Forum (NGF) approached the court on executive order 10 to prevent arbitrary removal of state funds.\nOn May 22, 2020, President Muhammadu Buhari signed the order, granting financial autonomy to the legislature and the judiciary in the 36 states of the federation.\nDays after signing the order, Buhari suspended its implementation following reservations expressed by governors.\nThe order empowers the accountant-general of the federation to deduct funds for the state legislature and the judiciary from the federation allocation to the states.\nSpeaking on the development in an interview with Channels Television on Monday, Fayemi said governors are still committed to financial autonomy for state judiciary and legislature despite the supreme court verdict."
  },
  {
    "headline": "Bad English gave out Ataga’s killers, Super TV co-founder tells court",
    "summarized_story": "Rahman Saliu, the co-founder of Super TV, has told a court how an SMS from the phone of Usifo Ataga, the late media entrepreneur, raised suspicion just around when he died.\nAdvertisementSaliu testified on Monday as the fifth prosecution witness during a Lagos state high court sitting at the Tafawa Balewa Square (TBS) in the ongoing trial of Chidinma Ojukwu, the prime suspect in the Super TV CEO’s murder.\nSaliu said the deceased was fluent in English but an SMS sent to him from Ataga’s phone had errors.\nAdvertisementSaliu said he had a task that needed to be completed urgently, so he didn’t call Ataga back until he was done.\n“Then I sent him a screenshot of the billing system in the Super TV App, that it was working and his response to me was ‘Ok, great’,” he added."
  },
  {
    "headline": "Facebook under fire for poor treatment of African content moderators",
    "summarized_story": "Meta-owned Facebook has come under fire for the treatment of African content moderators according to a recent TIME article.\nTIME revealed that content moderators in Nairobi were subject to poor pay and working conditions by Sama, a company responsible for Facebook’s Sub-Saharan Africa content moderation since 2019.\nIt contracts the services of more than 15,000 content moderators globally, most of whom are employed by third-parties like Sama.\nAccording to TIME, at least two Sama content moderators resigned after being diagnosed with mental illnesses including post-traumatic stress disorder (PTSD), anxiety, and depression.\nAccording to several copies of Sama content moderators’ performance reviews, TIME revealed that the moderators were measured against target metrics for average time spent and quality."
  },
  {
    "headline": "YC’s backing of its first Namibian startup shows investors are paying attention to the country",
    "summarized_story": "The government had locked down the country without making adequate palliative plans to support its people during the period.\nJabu partnered with local and multinational suppliers to deliver their goods directly to informal retailers across Namibia.\nHeadquartered in Namibia, with operations in Zambia, Jabu is a data-driven e-commerce startup that helps small retailers with sourcing products and inventory management.\nThe funding makes Jabu the first Namibian startup to be backed by YC.\n“Our first challenge was getting investors to recognise the country,” Akinin said."
  },
  {
    "headline": "Airtel Africa poaches Bayo Adekanmbi from MTN to lead its global strategy",
    "summarized_story": "Airtel Africa has tapped Bayo Adekanmbi to lead its strategy, partnership, and sustainability roadmap.\nThe role is based in the company’s headquarters in the UK and Adekanmbi is now part of the company’s executive committee and reports directly to the the CEO Segun Ogunsanya.\nIn this role, according to the company’s website, Adekanmbi will be “responsible for leading strategic business-wide initiatives, including innovation, strategic investment, operational efficiencies, and partnerships.\nBefore joining Airtel Africa, he worked with MTN Nigeria and South Africa for 14 years, holding different senior roles, including Strategy Director (MTN Business Unit), Global Marketing Strategist, General Manager (Business Intelligence), and most recently Chief Transformation/Strategy Officer for MTN Nigeria.\nBesides building cutting-edge strategy, Adekanmbi is a data science professional who supports the development of talents in this space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Sendchamp is bringing versatility to customer relations with a multi-channelled message delivery platform",
    "summarized_story": "AdvertisementSendchamp is a software company on a mission to help businesses improve customer relations by reducing the technicalities involved.\nHe had to combine tools like Mailchimp, GetGist and HelpCrunch because they each only provided one mode of communication, which meant more spending on customer communication.\nIt also offers a customer relations management (CRM) platform solution that allows technical and non-technical people to manage customer relations effectively.\nSo far, it has helped businesses using its platform reach 300,000 customers and delivered three million messages.\nSendchamp wants to be a significant part of that market as Kayode believes that every business in Africa will use Sendchamp to boost customer relations."
  },
  {
    "headline": "Romance in the metaverse",
    "summarized_story": "It appears Ghanaians can now travel through 44,000 airports, using their National ID cards — Ghana Card — as an e-passport.\nNow, with the Web3 and metaverse craze gaining momentum, it appears that we most definitely haven’t seen the end of digital romance.\n😉Accessible healthcare for AfricansPhoto by Tyck via IwariaDon’t judge me; I’m not too fond of hospitals.\nIn Africa, however, access to primary healthcare is hampered by low budgeting, little staffing, and sometimes bureaucratic bottlenecks.\nChimgozirim had a chat with Njabulo Skhosana, founder of South African healthtech startup, Healthdart, to understand how it hopes to make primary healthcare accessible to Africans."
  },
  {
    "headline": "What Valentine’s Day could look like in the Metaverse and Web3 era",
    "summarized_story": "What do you do when Valentine’s Day is around the corner, and you want to get your love a gift they will appreciate, but you can’t ask them since that will ruin the surprise?\nAdvertisementHere are some ideas you could consider to have a swell Valentine’s Day while we await those days.\nGifting non-fungible tokens (NFTs)Different forms of Valentine’s Day packages have been in our faces since the year began.\nWith this, every gesture in real life is translated into your action in that virtual world, and you get to feel everything.\nDrone gift deliveryHow do you intend to spend your Valentine’s Day?"
  },
  {
    "headline": "Obaseki to connect NUJ Secretariat, EBS to Ossiomo Power, urges journalists to key into health insurance policy – Nigerian Observer",
    "summarized_story": "That led us to this arrangement of the Ossiomo power plant, which is working and we are enjoying it here in Government House.\n“I don’t see why we cannot connect you to that 24-hour power supply.\nWe will be extending the line towards Ikpoba Hill to Auchi Road and will be able to connect you.\n“We are going to have every agency of government to have a plan, have its own key performance indicators, and their score cards.\nEarlier in his address, Alenkhe reassured the governor of the collaboration of journalists in the state in ensuring the realization of the Making Edo Great Again (MEGA) Agenda."
  },
  {
    "headline": "Edo Poly hails Obaseki, Ogbeifun for Maritime Institute initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The management of Edo State Polytechnic, Usen, has applauded the Edo State Governor, Mr. Godwin Obaseki and the Chief Executive Officer of Starz Maritime and Engineering Limited, Dr. Greg Ogbeifun, for the setting up of the Greg Ogbeifun Institute of Maritime Technology, (GOMIT) at the institution.\nHe also expressed appreciation to the Federal Ministry of Science and Technology as well as the state’s Ministry of Education for their support to the realisation of the institution.\nAccording to him, “The staff and management of Edo State Polytechnic, Usen, heartily appreciate the Governor of Edo State, Mr. Godwin Obaseki, the Chief Executive Officer, (CEO), Dr. Greg Ogbeifun and Commissioner for Education, Dr. Joan Osa Oviawe, for the endowment of the Greg Ogbeifun Institute of Maritime Technology (GOMIT) to our institution.\nWe are essentially training high-valued staff who will be highly sought after in the industry.\nHe said captains of ships and academics from the polytechnic have been drafted to deliver dual location training for the institute, adding that the institution is ready to roll out the training programmes."
  },
  {
    "headline": "Community Send SoS To Obaseki, Oba Ewuare II – Nigerian Observer",
    "summarized_story": "Odionwere of Ologbo central community, Pa Osaigbovo Ogieayevbona said , Johnson Atseleghe with some unknown soldiers, the DPO Ologbo Police division and his thugs erected a signboard in the boundary between Edo and Delta states.\nHe said,” the next day a task force came from Government House and pulled down the signboard.\n“After pulling down the oba’s signboard, they went into the community, beating up people and chasing traders away from the market which caused pandemonium in the community.\n“Also they went to the Edo State government revenue checking point, drove the collectors away and burnt down the post.\nCollaborating the statement of the Odionwere, a member of the revenue collectors, Peter Ase said the thugs came around 1.30 pm to attack them."
  },
  {
    "headline": "Edo govt inaugurates c’ttee to ease access to land for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To address issues of lack of access to land among smallholder farmers in the state, the Edo State Governor, Mr. Godwin Obaseki, has inaugurated a 13-member committee to finetune policies and programmes relating to land management especially as it relates to agricultural development.\nHe charged the committee members to work assiduously towards ensuring that the state government’s Making Edo Great Again (MEGA) agenda is actualised.\nWe also want to ensure that smallholder farmers have a voice,” he said.\n“We need to find solutions to the issue of land in the state.\nEdo State should be known as a friendly state with respect to investments."
  },
  {
    "headline": "Nigeria TechWomen Alumni Mentor 30 Adolescent Girls in STEM Fields",
    "summarized_story": "The United States government exchange alumni say they are at the forefront of promoting STEM education and implementing programs to encourage Nigerian women and girls to pursue studies and careers in tech fields.\nAlumni of the 2021 U.S. government sponsored TechWomen program on Monday concluded a STEM mentoring program called, “EduChamps” for 30 adolescent girls from African Church Grammar School, Ibadan.\nSupported by the U.S. government, the program provided mentorship and skills training for girls to explore careers and business opportunities in STEM.\n“STEM education is the key foundation for any country’s economic success,” Foltz said.\nIn 2011, the U.S. government introduced the TechWomen program to empower the next generation of women leaders in the technology field."
  },
  {
    "headline": "Osun 2022: Aregbesola endorses Adeoti, days he is next governor",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Minister of Interior and former governor of Osun State, Ogbeni Rauf Aregbesola on Monday, declared that the former Secretary to the State Government, Alhaji Moshood Adeoti, is the next governor of the state.\nHe also noted that the Rasaq Salinsile led party executives is the authentic APC in Osun.\nIn Shaa Allah, Adeoti is the next governor of Osun.\nWe should all support him.”In his remarks, the leading governorship aspirant of the APC in Osun, Alhaji Adeoti expressed his gratitude to the party for the support.\nRazaq Salinsile; Former Speaker, Osun State House of Assembly, Rt."
  },
  {
    "headline": "Qatar Aiways seals participation at 5th FIFA Club World Cup",
    "summarized_story": "for clinching the FIFA Club World Cup UAE 2021 title, which took place last Saturday in a highly competitive final against SE Palmeiras.\nQatar Airways, the tournament’s Official Airline Partner, was present at Mohammed Bin Zayed Stadium in the UAE for a special prize distribution ceremony.\nWe will proudly be the Official Airline Partner for the upcoming FIFA World Cup Qatar 2022™, where fans from around the world will be able to experience a truly unique and hospitable service on board our flights.”With only a few months until the highly anticipated FIFA World Cup Qatar 2022, football enthusiasts from around the world can now book travel packages, with flexible booking options.\nSubsequently, Qatar hosted the two consecutive FIFA Club World Cup™ tournaments in 2019 and 2020.\nIn December 2021, the FIFA Arab Cup Qatar 2021 demonstrated yet again the country’s readiness for the grandest upcoming stage in world football, the FIFA World Cup Qatar 2022."
  },
  {
    "headline": "Re- Tension in Ebonyi over Governorship Zoning, By Abia Onyike",
    "summarized_story": "The title of the news which was presented as features was titled, “Tension in Ebonyi over Governorship zoning”.\nIt can remind people of the old Abakaliki and Afikpo blocks and resurrect the unresolved issues sorrounding the Ebonyi Charter of Equity.\nECHOES OF EBONYI CHARTER OF EQUITYJust last week, some Elders of Ebonyi South zone met and made a vigorous argument that the Ebonyi Charter of Equity is yet to be implemented as envisioned by the Founding Fathers of the State.\nIn the current debate over the zoning if the Governorship seat, echoes of Ebonyi Charter of Equity have started to rent the air.\nAbia Onyike, a former commissioner for information in Ebonyi State, wrote from Abakaliki"
  },
  {
    "headline": "Akwa Ibom Tasks NIS On Illegal Immigrants, Human Trafficking, Others",
    "summarized_story": "The Akwa Ibom State government has charged the Nigeria Immigration Service (NIS) to intensify surveillance on activities of illegal immigrants and human trafficking barons for enhanced safety and security of Nigerians.\nGiving the charge, the Commissioner for Information and Strategy, Comrade Ini Ememobong, while playing host to the Comptroller of the Akwa Ibom State Command of the Nigeria Immigration Service, CIS George Didel, over the weekend, said the task before the Service was enormous.\nComrade Ememobong who pledged the readiness of his ministry to partner the NIS for greater achievements in the state, said: “We will give you free airtime on our Radio and Television Update programmes to enable you enlighten the populace on the negative impact of illegal immigrants and human trafficking.\nYou will also be given a space in our publications – “Akwa Ibom Impact” magazine and “Explore Akwa Ibom” to get the people well informed on how to alert the authorities when they have information about these criminals”.\nThe Comptroller implored the Commissioner to assist State Command with adequate publicity on all state-owned media, with a view to educating all and sundry on the need to have valid travel documents, which could either be the regular Nigerian passport or the ECOWAS travel certificate."
  },
  {
    "headline": "2023: Abe May Become Wike’s Successor – APC Stalwart",
    "summarized_story": "A stalwart of the All Progressives Congress (APC) in Rivers State, Princewill Dike, has predicted that a frontline member of the party in the state, Senator Magnus Ngei Abe, may succeed Governor Nyesom Ezenwo Wike in 2023.\nThe APC stalwart said: “Senator Magnus Abe is openly reaching out, consulting.\nAside of his political wizardry, Rivers State is predominantly PDP.\n“Till now, the public doesn’t know the Rivers APC gubernatorial aspirants.\nBy now, Rivers APC gubernatorial aspirants should openly be consulting and reaching out, to be known by the public.”ADVERTISEMENTDike called on the Minister of Transportation, Rt."
  },
  {
    "headline": "Illicit Drug Deals: Police Finger NDLEA, Arrest Kyari, 4 Others",
    "summarized_story": "Following the declaration of DCP Abba Kyari wanted by the National Drug Law Enforcement Agency (NDLEA), for alleged drug peddling, the Nigeria Police Force has arrested him and four other police officers involved in what it called unprofessional conduct and tampering with exhibits.\nThe police said the suspects were arrested for their involvement in an alleged case of criminal conspiracy, discreditable, unethical, and unprofessional conduct, official corruption and tampering with exhibits in a case of illicit drug trafficking involving a perpetual transnational drug cartel.\nThe concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr.\nA statement signed by Force spokesperson, CSP Olumuyiwa Adejobi, on Monday, said the arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency on February 10, 2022 and subsequent discreet investigation by the NPF.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers."
  },
  {
    "headline": "Illicit Drug Deals: Police Finger NDLEA, Arrest Kyari, 4 Others",
    "summarized_story": "Following the declaration of DCP Abba Kyari wanted by the National Drug Law Enforcement Agency (NDLEA), for alleged drug peddling, the Nigeria Police Force has arrested him and four other police officers involved in what it called unprofessional conduct and tampering with exhibits.\nThe police said the suspects were arrested for their involvement in an alleged case of criminal conspiracy, discreditable, unethical, and unprofessional conduct, official corruption and tampering with exhibits in a case of illicit drug trafficking involving a perpetual transnational drug cartel.\nThe concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr.\nA statement signed by Force spokesperson, CSP Olumuyiwa Adejobi, on Monday, said the arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency on February 10, 2022 and subsequent discreet investigation by the NPF.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers."
  },
  {
    "headline": "Fani-Kayode’s Ex-Wife Docked Over Alleged Attempted Murder",
    "summarized_story": "The estranged wife of a former Minister of Aviation, Chief Femi Fani-Kayode, Precious Chikwendu, was on Monday docked at a Federal High Court (FHC) Abuja for the attempted murder of her former husband, Fani-Kayode.\nChikwendu was also alleged to have, through her Facebook page, referred to Fani-Kayode as “Mr.\nAlex Ejesieme, SAN, counsel to Fani-Kayode’s ex-wife (2nd defendant), urged the court to admit the defendants to bail based on the earlier administrative bail granted them by the police.\nHowever, an effort to talk to Ejesieme, lawyer to Precious Chikwendu, was unsuccessful as he refused to grant an interview.\nThe former minister had also alleged that Chikwendu stopped calling the children on the telephone for about seven months now contrary to her habit in the past."
  },
  {
    "headline": "Aregbesola officially parts way with Bola Tinubu",
    "summarized_story": "Minister of Interior, Rauf Aregbesola, has finally shown where he belongs in the emerging political equation: He is no longer with his once-upon-a-time mentor, Asiwaju Bola Ahmed Tinubu.\nIn Osun, where Aregbesola has shown his political colour, he is not supporting Governor Gboyega Oyetola, Tinubu’s nephew, in the forthcoming All Progressives governorship primary.\nInstead, he has declared support for former Secretary to the Osun State Government, Alhaji Moshood Adeoti.\nThe former governor of Osun State, claimed Oyetola’s administration has deviated from the true tenets of the All Progressives Congress, APC.\nAregbesola said the party is back in the hands of true progressives who will work assiduously to win in the July 16 governorship election in the state."
  },
  {
    "headline": "Trump Organisation accounts unreliable: Auditors Mazars USA",
    "summarized_story": "In a major blow to former U.S. President Donald Trump, the accounting firm Mazars USA said it could no longer stand behind a decade of statements, a court filing showed on Monday.\nMazars said it had based its conclusion on a January filing by the New York Attorney General, its own investigation and information from internal and external sources.\nThe letter, which was filed in New York state court, also said Mazars would no longer work for the Trump Organization.\nNew York state’s attorney general has accused the Trump Organization of repeatedly misrepresenting the value of its assets to obtain financial benefits.\nThe Trump Organization did not immediately respond to a request for comment."
  },
  {
    "headline": "Two Shot Dead, As Aregbesola’s Thugs, NSCDC Personnel Shoot At Passers-by In Osun",
    "summarized_story": "Former Osun Governor, Ogbeni Rauf Aregbesola on Monday, invaded Osogbo, the Osun capital with armed thugs and NSCDC personnel, who were shooting sporadically and in the process two persons were alleged to have been shot dead.\nTrouble started when Aregbesola was said to have brought out his head from an open roof, as though he was running for election and the shout of “ole, ole, “ rented the air.\nAnger by the attitude of some of the residents, the interior minister was said to have ordered his thugs and the NSCDC personnel attached to him to open fire.\nIt was in the process that two persons were said to have been shot dead.\nIt will be recalled that last year, a right group had petitioned the Presidency over the misuse of NSCDC personnel by the Interior minister to harass and intimidate perceived political enemies."
  },
  {
    "headline": "BREAKING: Abba Kyari, Four Others Handed Over NDLEA",
    "summarized_story": "The Nigerian Police have arrested and handed over DCP Abba Kyari, the suspended Commander of the Intelligence Response Team (IRT), and four other police officers linked to drug trafficking by the Nigerian Drug Law Enforcement Agency (NDLEA), for tampering with illicit drugs investigations and other unprofessional activities in the country.\nACP Sunday Ubuah, ASP Bawa James, Inspr.\nSimon Agrigba, and John Nuhu were among those arrested and handed over to the NDLEA.\nMeanwhile, ASP John Umoru has been declared wanted after allegedly fleeing.\nAccording to the police, the policemen arrested have been turned over to the NDLEA for investigations into criminal conspiracy and tampering with exhibits in a case of illicit drug trafficking involving a permanent global drug cartel."
  },
  {
    "headline": "BREAKING: DCP Abba Kyari arrested by police",
    "summarized_story": "The suspended Head of the Intelligence Response Team, DCP Abba Kyari, has been arrested by the Nigerian police.\nThe PUNCH exclusively gathered that he was arrested alongside four others on Monday.\nKyari was arrested hours after National Drug Law Enforcement Agency declared he wanted over alleged drug links.\nDetails later…"
  },
  {
    "headline": "BREAKING: NDLEA Releases Video Evidence Of Abba Kyari’s Drug Cartel Links",
    "summarized_story": "Video evidence against suspended Deputy Commissioner of Police Abba Kyari has been published by the National Drug Law Enforcement Agency, or NDLEA.\nNDLEA showed footage of Kyari trying to bribe one of its operatives in a bid to carry out a drugs heist in the country.\nRecall that the agency had declared him wanted over alleged links to a drugs cartel.\nTo further buttress the NDLEA’s claims against Kyari, the footage of him giving the operative wads of dollar bills was released.\nSee video below…Breaking: NDLEA releases video evidence as it declares Abba Kyari wanted pic.twitter.com/ZtkbhIWpBu — AIT (@AIT_Online) February 14, 2022"
  },
  {
    "headline": "Pictures: Yunusa Sani Masaga bags new chieftaincy title in Niger",
    "summarized_story": "A public servant and philanthropist, Engr.\nYunusa Sani Masaga, has been turbaned as Sarki Samari Masaga.\nBlueprint reports that his turbaning ceremony took place at Masaga Palace Bida Niger state."
  },
  {
    "headline": "Police nab Abba Kyari, 4 others, hand them over to NDLEA",
    "summarized_story": "He said the IGP has also ordered the transfer of the case to NDLEA, even as he has charged the NDLEA to also investigate the indicted officers of the agency.\n“The arrest led to the recovery of substantial quantity of powdery substance suspected to be cocaine from the two narcotic couriers.\n“It is to be emphasised that DCP Abba Kyari’s involvement in these allegation occurred while his suspension from service was subsisting.\n“The concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspector Simon Agrigba, and John Nuhu.\nThey have all been, accordingly, handed over today February 14, 2022 to the NDLEA authorities."
  },
  {
    "headline": "Pictures: Commuters confused, frustrated as fuel scarcity worsens in Abuja",
    "summarized_story": "Commuters around the federal government secretariat, were, Monday, left stranded as fuel scarcity bites harder.\nThe situation which has grown from bad to worse has dumped transport system especially in Abuja, the nation’s capital.\nAt the popular Federal Secretariat located around the Business District, Blueprint observed how many civil servants and other workers who stood for hours after work were left stranded with few vehicles appearing to load passengers.\nSome of them who spoke to Blueprint lamented that the fuel situation has doubled the cost of transportation.\nI have been standing here waiting for vehicle go to Nyanya for over two hours."
  },
  {
    "headline": "UPDATED: Police Arrest Abba Kyari, Four Other Officers",
    "summarized_story": "The police have arrested a suspended Deputy Commissioner of Police (DCP), Abba Kyari, and four other police officers.\nOthers arrested alongside Kyari include ACP Sunday Ubuah, ASP Bawa James, Inspector Simon Agrigba, and Inspector John Nuhu, while the fifth suspect, ASP John Umoru, is still at large.\nRELATEDWanted Abba Kyari, Four Others Now In Our Custody – NDLEANDLEA Declares Abba Kyari Wanted For Drug Trafficking“The arrest of the officers was sequel to pieces of information received from the leadership of the National Drug Law Enforcement Agency (NDLEA) on 10th February 2022,” said Adejobi who is a Chief Superintendent of Police.\n“It is to be emphasised that DCP Abba Kyari’s involvement in these allegations occurred while his suspension from service was subsisting.\n“The concerned officers include DCP Abba Kyari, ACP Sunday Ubuah, ASP Bawa James, ASP John Umoru (at large), Inspr."
  },
  {
    "headline": "NDLEA Declares Abba Kyari Wanted For Drug Trafficking",
    "summarized_story": "﻿The National Drug Law Enforcement Agency has declared suspended Deputy Commissioner of Police, Abba Kyari, wanted over alleged links with drug trafficking.\nHe asked the NDLEA officer to persuade men of the FCT Command, to play along as well.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\n“He also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61, 400.\n“We are making this strong statement to those contemplating harmful action against NDLEA officers."
  },
  {
    "headline": "VIDEO: Nobody Should Address Pantami As A Professor – ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) on Monday kicked against the promotion of Ali Isa Pantami, the Minister of Communications and Digital Economy, as a professor, describing it as illegal.\nLast year, the Federal University of Technology Owerri (FUTO) had named the minister as a professor in cybersecurity during its council’s 186th meeting.\nREAD ALSO: ASUU Declares One-Month Warning StrikeBut addressing a press conference after its National Executive Council meeting, ASUU President, Professor Emmanuel Osodeke, said the Minister was not qualified for appointment as a professor.\n“From the information made available to us, Dr Pantami was not qualified and he violated the established procedure for appointment of professor.\nPantami has to quit as a minister and be tried for doing double jobs within the same federal system."
  },
  {
    "headline": "ASUU Declares One-Month Warning Strike",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has declared a one-month warning strike.\nASUU also said the 2009 agreement reached with the Federal Government ought to be reviewed every three years.\nIn 2020, ASUU had embarked on a nine-month strike over the government’s failure to honour its part of the deal.\nThe lecturers, however, called off the strike after a series of meetings with the Federal Government.\nBut in November, ASUU issued a three-week ultimatum to the government over the handling of the deal."
  },
  {
    "headline": "Proprietor Makes U-Turn In Court, Denies Killing Hanifa Abubarkar",
    "summarized_story": "The case of the death of Hanifa Abubarkar took a new twist on Monday as her proprietor, Abdulmalik Tanko, made a U-turn to deny killing the five-year-old schoolgirl.\nShe was reportedly abducted by the school proprietor – Tanko – who demanded ransom from her parents and was said to have killed her in December last year.\nLawan, who doubles as the Commissioner for Justice, assured the people that the state government would provide the necessary witnesses required in the case.\nHanifa later was buried in a shallow grave within the school premises.\nIn his reaction, Governor Abdullahi Ganduje recommended stringent sentences as the best punishment for people who commit such crimes Tanko was accused of."
  },
  {
    "headline": "Zamfara CJ inaugurates 7-man committee to investigate deputy Gov -",
    "summarized_story": "Zamfara State Chief Judge, Kulu Aliyu has Inaugurated a seven man committee to Investigate allegations against the State Deputy Governor Mahdi Aliyu Gusau.\nThe Committee is chaired by retired Justice Halidu Tanko Soba.\nAdvertisementShe adds that the Committee members are of unquestionable integrity and not been members of any public service, legislative Houses or political party.\nThis Development is coming five days after the Zamfara state House of Assembly request the state chief judge to Set up a Committee to Investigate Deputy Governor Mahdi Aliyu Gusau.\nAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of gross misconduct, abuse of office among other thingsAdvertisementIt is coming amidst move by the Zamfara State House of Assembly to Impeach the Mahdi Aliyu as the state Deputy GovernorAdvertisementA federal high court in Abuja had in November last year restrained the Zamfara State House of Assembly from from any move to impeach the deputy Governor."
  },
  {
    "headline": "Nigeria's problem needs immediate change in leadership",
    "summarized_story": "Presidential aspirant on the platform of the opposition People’s Democratic Party, Sam Ohuabunwa visited former military President Ibrahim Babangida in his hilltop residence in Minna, Niger State.\nSpeaking to journalists after the closed door meeting he said Nigeria’s problem needs immediate change in leadership.\nAdvertisementThis is why Mazi Sam Ohuabunwa is visiting former president Ibrahim Badamosi Babangida.\nThe state party chairman Tanko Beji while receiving the aspirant at the party secretariat pledged his support noting that the chapter is ready to support all aspirants to give them equal opportunities.\nAdvertisementWith so many people indicating interest to represent the party at the polls getting a nod from the stalwarts is becomes paramount for aspirants."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Senator Philip Aduda raises concern over BVAS Operation",
    "summarized_story": "The Senator representing Federal Capital Territory has raised concerns over the functionality of the Bimodal Voting Accreditation System, BVAS.\nPhillip Aduda enjoins INEC to get its act right ahead the 2023 general election.\nAdvertisementHe spoke after casting his vote at the Polling units 004 in Karu.\nWhile he describes his accreditation and voting process as seamless, the lawmaker said reports reaching him from other parts of the nation’s capital are not palatable regarding the BVAS."
  },
  {
    "headline": "Nigeria: Wanted Cop Abba Kyari Arrested By Police, Handed Over to Drug Enforcement Agency – Arise News",
    "summarized_story": "Few hours after he was declared wanted by the National Drug Law Enforcement Agency, NDLEA over his involvement in a cocaine deal, suspended DCP Abba Kyari have been handed by the police to the anti-narcotics agency.\nA statement by the spokesman of the agency, Femi Babafemi said the Nigerian Police Force has handed over the suspended DCP Abba Kyari, the erstwhile Commander of Intelligence Response Team (IRT) at the Force Intelligence Bureau of the Nigerian Police Force to them.\nHe said five of the wanted suspects namely: DCP Abba Kyari; ACP Sunday Ubua; ASP Bawa James; Inspector Simon Agirgba and Inspector John Nuhu were driven into the National Headquarters of NDLEA in Abuja at about 5pm on Monday 14th February to formally hand them over for interrogation and further investigation.\nHe said: “The Agency wishes to assure that no stone will be left unturned to ensure that all suspects already in custody and those that may still be indicted in the course of investigation will face the full weight of the law at the end of the ongoing probe.”Michael Olugbode in Maiduguri"
  },
  {
    "headline": "Lai Mohammed Accuses Canada Of Double Standards – Trending With Ojy Okpe",
    "summarized_story": ""
  },
  {
    "headline": "Ukraine Hints at Concessions to Russia as German Leader Visits Region",
    "summarized_story": "European banks in particular fear that Russia could be excluded from the SWIFT global payment system, which would prevent the repayment of Russian debts.\nThe Kremlin said it expected Putin’s talks with Scholz on Tuesday to address Ukraine, security guarantees for Russia, and Nord Stream 2, which is awaiting European Union approval.\nSullivan said the United States would also “defend every inch of NATO territory … and Russia, we think, fully understands that message”.\nWashington and some European nations have been scaling back or evacuating embassy staff and urging citizens to leave Ukraine.\nUkraine on Sunday invoked a treaty to demand talks with Russia and members of the Organisation for Security and Cooperation in Europe OSCE within 48 hours to discuss Russia’s military build-up."
  },
  {
    "headline": "ASUU: Nigerian Lecturers Declare Nationwide Strike",
    "summarized_story": "Nigeria’s Academic Staff Union of Universities has declared a “comprehensive and total” strike.\nThe strike was declared at a press conference addressed by the President of ASUU, Prof. Emmanuel Osodeke, on Monday.\nAccording to him, the union tried to avoid the strike but the Federal Government is unresponsive to the union’s demands.\nThe ASUU chairman also said ASUU NEC faulted the creation of new universities.\nHe should be cautioned,” the ASUU president said."
  },
  {
    "headline": "Nigeria: NDLEA Declares Suspended Cop Abba Kyari Wanted for Drug Trafficking",
    "summarized_story": "Nigeria’s National Drug Law Enforcement Agency (NDLEA) on Monday said the suspended top police officer Abba Kyari is a member of an international drug cartel.\nNDLEA also declared Kyari, a deputy commissioner of police and former head of the Intelligence Response Team (IRT), wanted for pushing illicit drugs.\nKyari was suspended by the police after United States’ FBI indicted him in the fraud case of a popular fraudster, Ramon Abbas, known as Hushpuppi.\nUnited State authorities said Kyari was a conspirator with Hushpuppi in a $1.1 million deal to defraud a Qatari businessman."
  }
]