[
  {
    "headline": "Zamfara police rescue two kidnap students of FGC Yauri",
    "summarized_story": "Zamfara State Police Command has rescued two kidnapped students of Federal Government College, Birnin Yauri in Kebbi State.\nBriefing newsmen on Sunday, the Zamfara State Police Commissioner, Husaini Rabiu said the two students were rescued in a bush in Babbar Doka Village of Maru Local Government Area of the state.\nRabiu said, “On 31st July 2021, Police Tactical Operatives attached to Operation Restore Peace deployed to Dansadau Area of Maru LGA for Anti-Banditry and Kidnapping Operations rescued one Maryam Abdulkarim, a 15 year old girl from Wushishi LGA of Niger State and Faruk Buhari, a 17-year-old boy from Wara in Kebbi State at a nearby bush in Babbar Doka Village of Dansadau Emirate.\n“Investigation revealed that the rescued victims were among the abducted students of Federal Government College Yauri, Kebbi State.”The Commissioner said the victims were taken to the hospital for medical checks, adding that they have been debriefed at the Police Command Headquarters, Gusau.\nHe maintained that the students would be handed over to the Kebbi State Government through the Kebbi State Police Command."
  },
  {
    "headline": "30 of 65 private jets in Nigeria owe customs duties -Official",
    "summarized_story": "The Nigeria Customs Service says 30 out of 65 private airplanes verified so far are liable to pay required duties to the Federal Government.\nThe Customs Public Relations Officer, Mr Joseph Attah, made this known while speaking with the News Agency of Nigeria in Abuja on Sunday.\n“The exercise as I stated in our previous briefings, is not intended to be punitive or to embarrass them but to ensure that these private jets that operate in the country are properly documented.\n“With this, you can now tie proper ownership to every aircraft or private jet that flies into and out of the country.\n“We are aware that owners of private jets are highly placed Nigerians who should be respected and approached in a manner that provides all necessary convenience and that is what these extensions stands for,” he explained."
  },
  {
    "headline": "#TwitterBan: We are monitoring closely repression in Nigeria, says Commonwealth",
    "summarized_story": "In the Urgent Appeal, SERAP had stated that: “The Nigerian government has repeatedly demonstrated that it is not committed to protecting human rights.\nThis order for prosecution of Twitter users violates the legal rule that there should be no punishment without law.”“Respect for Commonwealth values is essential for citizens to trust Commonwealth institutions.\nThere are well-founded fears that the human rights situation in Nigeria will deteriorate even further if urgent action is not taken to address it.”“According to our information, the Nigerian government on Friday 4 June, 2021 unlawfully ordered all internet service providers to suspend Twitter in Nigeria.\nThe lack of transparency undermines the rule of law and Nigerians’ ability to participate in their own government.”“Lack of transparency and accountability, and the absence of the rule of law in Nigeria have contributed hugely to denying Nigerians their fundamental human rights.\nPeople have been targeted simply for using Twitter and peacefully exercising their fundamental human rights.”Vanguard News Nigeria"
  },
  {
    "headline": "[BREAKING] Hushpuppi: IGP recommends immediate suspension of DCP Abba Kyari",
    "summarized_story": "Recall, last week, DCP Abba Kyari was indicted by a US court sitting in California over alleged involvement in internet fraud of over a 1.1million US dollars with Ramonu Abba popularly known as Hushpuppi where it was alleged that he (Hushpuupi) swindled a Qatari businessman trying to set up a school in Qatar.\nDCP Abba Kyari has since denied any involvement in the said internet fraud whose victim was said to be a Qatari businessman.\n4-man special investigation panel begins probeA 4 man panel has been set up by the IGP to investigate the FBI’s indictment of DCP Abba Kyari.\n“The SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).\n“The SIP is also to obtain a detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter,” The letter stated."
  },
  {
    "headline": "DCP Abba Kyari: Arewa youths blow hot, take swipe at US Court",
    "summarized_story": "By Ibrahim Wuyo, KadunaThe Arewa Youth Consultative Forum (AYCF) has taken a swipe at the American Court that ordered the arrest of DCP Abba Kyari, and dismissed what it described as “the attempted intimidation of a police officer right inside his independent fatherland”.\nIn a statement signed by the group’s National President, Alhaji Yerima Shettima, AYCF sounded a note warning that “nothing must happen to him( DCP Kyari)”.\nThe group rejected the purported plan to arrest DCP Kyari, describing the move by the FBI as “totally unacceptable, a slap on the sensibility of our compatriots and a ridicule on one of our finest crack detectives”.\n” While we are conscious of our sovereignty as a nation, we demand justice for a man with unrivalled records of detective capabilities in the recent history of Nigeria”, the youths said.\nVanguard News Nigeria"
  },
  {
    "headline": "1, 868 security men killed by B/Haram – Tony Blair Institute Report",
    "summarized_story": "These were contained in a report titled: Violent Extremism in Sub-Saharan Africa: Lessons from the Rise of Boko Haram, published by UK-based Tony Blair Institute for Global Change.\nThe authenticity and legitimacy of those challenging Boko Haram on the front lines are essential to a successful countercampaign.\nThis grew into a sophisticated funding channel as Boko Haram became more influential in Maiduguri’s religious and social circles.\nBoko Haram today“While Boko Haram effectively operates as the three distinct factions of ISWAP, JAS and Ansaru, they are still inherently the same.\nBoko Haram today“While Boko Haram effectively operates as the three distinct factions of ISWAP, JAS and Ansaru, they are still inherently the same."
  },
  {
    "headline": "CONTENTIOUS APC CONGRESSES: One killed in Ekiti, protests in Osun, Abia, A/Ibom",
    "summarized_story": "But the Chairman of Ogun APC Ward Congress Committee, Wale Onu, declared there was no parallel election of party executives in the 236 wards in the state.\nOne feared dead, severalothers injured in EkitiViolence characterized the ward congresses of the APC held in Ekiti State, as one person was feared killed and many others injured.\nIn Ado-Ekiti ward 8, thugs unleashed mayhem on party members and disrupted the process.\nHowever, the congress was disrupted at Olorunda Ward 8, as party members disagreed on modalities for the congress.\nNajeem Salaam disclosed that members trooped out but after waiting for the Committee from Abuja for hours, the ward congress committee eventually oversaw the process."
  },
  {
    "headline": "North, South Korea: Patience Jonathan calls for lasting peace",
    "summarized_story": "Former Nigerian First Lady, Patience Jonathan has urged women to promote peace in North and South Korea.\nShe charged world leaders to pressure the leadership of North and South Korea to embrace harmony.\nShe added that the capacity of women is recognised by both United Nations Security Council Resolution 1325 and the United States’ Women, Peace and Security Act of 2017.\nJonathan specifically appealed to the leaders of North and South Korea; the United States, China, Russia and Japan to work towards accord.\n“North and South Korea should set aside political differences."
  },
  {
    "headline": "Weed out criminal elements, restore your good image – Emir tasks Fulani leaders",
    "summarized_story": "Alhaji Abbas Njidda, the Emir of Muri, has enjoined the leadership of the Fulani ethnic group in Taraba State to expose those soiling the image of the tribe.\nContrary to rumour that his marching order was directed to the Fulani ethnic group, the emir stated that his directive was solely meant for herders terrorising residents.\nGlad that the monarch, who is also of the Fulani extraction, has expressed dismay over Fulani herders linked to the enumerated ills , the association, as made known by him, will work hard to flush out bad elements among them.\nDrumming the association’s readiness to act positively to herald the much desired sanity among all Fulani herders, he enjoined members of the tribe engaging in such vices to desist.\nHe also vowed to set up committees to ensure that the emir’s directives are adhered to."
  },
  {
    "headline": "Kaduna churches close early for fear of kidnappers",
    "summarized_story": "Churches in Kaduna on Sunday closed earlier than usual for fear of bandits’ attack.\nSome churches that usually conduct two-hour services reduced their closing time to an hour as rumours spread across the state that bandits are now targeting churches and mosques to kidnap members.\nRecall that a few weeks ago, a kidnapped young girl, who was released, told her parents in Kaduna that she heard kidnappers while in their den discussing possibilities of targeting churches and mosques.\n“I heard kidnappers planning to attack churches since schools across the state are now on vacation,” she said.\nKidnappers have taken over the state, as they kidnap, demand for ransom and kill at will, if ransom is delayed."
  },
  {
    "headline": "NMA gives Zamfara govt two-week ultimatum to address insecurity",
    "summarized_story": "The Zamfara State chapter of the Nigerian Medical Association (NMA) has lamented the rising insecurity situation in the state, giving the state government a two-week ultimatum to address the scourge.\nThis was disclosed to newsmen in Gusau, the state capital, by the association’s Chairman, Dr Manor Nature Tsafe, at the NMA headquarters.\nNMA debunks reports linking member to banditry in Zamfara“Therefore the association is giving the state government two weeks ultimatum to address the rising insecurity situation in the state,” he added.\nDr. Tsafe explained that medical doctors and nurses are now the target of bandits in the state.\nThe Chairman raised an alarm over a plan by bandits to abduct more doctors and nurses in various hospitals in the state."
  },
  {
    "headline": "Twitter ban: Commonwealth places Nigeria on watchlist",
    "summarized_story": "The Commonwealth has placed Nigeria on its watchlist over the suspension of Twitter, a microblogging platform.\n“This underscores a commitment to the Universal Declaration of Human Rights and other relevant human rights covenants and international instruments”, Scotland noted.\nSERAP asks Commonwealth to sanction Nigeria over Twitter banHer comments followed the June 5, 2021, appeal by the Socio-Economic Rights and Accountability Project (SERAP) urging the Commonwealth to hold the Nigerian government to account.\n“The Commonwealth Secretary-General has been following the developments in Nigeria very closely and she is engaging the relevant stakeholders”, it read in part.\nThe directive was sequel to the deletion of President Muhammadu Buhari’s tweet, which according to Twitter violated the rules."
  },
  {
    "headline": "Anxiety in Benue as abductors of Commissioner’s wife demand N51million",
    "summarized_story": "By Uja Emmanuel, MakurdiThere is anxiety in Makurdi, the Benue state capital as the adducted wife of Commissioner for Land and Survey, Mrs. Ann Unenge, spent three nights with her abductors.\nHer abductors yesterday evening demanded for a ransom of N51million before she would be released.\nThe gunmen had on Thursday waylaid Mrs. Unenge in her Highlander jeep with Benue registration number MKD 288.\nThe Nation gathered that there was a struggle between the abductors and Mrs. Unenge at B.\nSame night, Mrs. Ann Unenge was abducted."
  },
  {
    "headline": "Imo police kill two suspected armed bandits in gun duel",
    "summarized_story": "By Chris Njoku, OwerriIMO State Police Command yesterday shot dead two armed bandits while attempting to launch attack on Njaba Police station.\nThe bandits who were in a convoy moving towards Njaba town were intercepted by the Command’s Operation Restore Peace team at about 1.20am in a crossfire.\nADVERTISEMENTIn a statement, the police spokesman, CSP Michael Abattam said two of the suspects were gun down in the ensuing fire fight while others escaped into the bush with gunshot wounds.\nHe said on searching the vehicle one Ak 47 rifles was recovered with ten rounds of live ammunition and a locally made double-barrel pistol with two expended cartridges.\nAccording to him, the bandits detonated an Improvised Explosive Devices into the parking lots of a nearby Njaba Police Station causing minimal damage."
  },
  {
    "headline": "Anambra FRSC boss assures motorists of officers’ good conduct",
    "summarized_story": "By Emma Elekwa, OnitshaTHE Federal Road Safety Corps (FRSC) in Anambra State has assured motoring public in the state of its readiness to ensure officers’ conduct themselves in the highest level of professionalism and civility.\nHe said, “But I want to assure all road users in the state that the Command is doing everything possible to ensure officers’ conduct themselves in the highest level of professionalism and civility.\n“Before we send out our men each day, we conduct patrol briefing where we give them patrol focus, as well as talk to them about civility and professionalism while on the road.\n“These are outside regular courses the corps organises to improve the officers’ professionalism.\nBut it calls for patience on the part of the motoring public as we keep bringing the attention of relevant government departments responsible to expedite work on the road."
  },
  {
    "headline": "APC dismisses fears of legal ’time bomb’ over caretaker committee",
    "summarized_story": "By Augustine Okezie, KatsinaThe All Progressive Congress (APC) has dismissed fears in several quarters over the status of Governor Mala Mai Buni-led Caretaker/Extra ordinary National convention planning Committee (CECPC).\nADVERTISEMENTThe Committee, according to a member of the CECPC representing North West, Senator Abba Alli, is simply acting and will soon hand over after the party’s national convention.\nHe said: “The fears of party members and concerned Nigerians over holding the ward congress despite recent Supreme Court ruling on Ondo State Governorship election is unfounded.\n‘’The APC leadership sought extensive legal advice from its counsel and other legal opinions before going ahead with the Congresses.\n“We did not just decide to hold the ward congress despite the Supreme Court ruling."
  },
  {
    "headline": "Hushpuppi: IGP recommends Abba Kyari for ‘immediate suspension’, sets up investigative panel",
    "summarized_story": "From Molly Kilete, AbujaThe Inspector General of Police (IGP), Usman Alkali Baba, has recommended the ‘immediate suspension’ of the Head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, from the Nigeria Police Force.\nThe IGP has also announced the setting up of a Special Investigation Panel comprising four senior police officers, headed by the Deputy Inspector General of Police in charge of the Force Criminal Investigations Department, Joseph Egbunike, to investigate the allegations against Kyari.\nThe IGP, in a letter dated July 31, to the Police Service Commission (PSC), noted that the recommendation for the suspension of the officer was in line with the internal disciplinary processes of the Force.\nForce public relations officer Frank Mba made this known in a statement in Abuja:Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Seven people killed, many injured, 200 houses burnt in fresh Plateau attack",
    "summarized_story": "From Gyang Bere, JosSeven persons were reportedly killed and over 200 houses were burnt when armed bandits suspected to be Fulani herdsmen attacked Jebu Miango community in Bassa Local Government Area of Plateau State in the early hours of Sunday.\nIt was gathered that the deadly operation which lasted for about 4 hours into the early hours of Sunday left several people badly injured, including women and children.\nA lawmaker representing Rukuba/Irigwe Constituency in the Plateau State House of Assembly, Hon Musa Agah Avia, confirmed the incident and blamed security for lack of quick intervention.\nFor now, three corpses have been recovered and well over 200 houses burnt.\nA community leader who gave his name as Joshua Lawrence said seven corpses have been recovered and nine persons hospitalised."
  },
  {
    "headline": "Alleged corruption: EFCC arrests Saraki, ex-Senate president",
    "summarized_story": "Saraki served as President of the Senate between 2015 and 2019.\nDuring his reign as Senate President, he had a running battle with President Muhammadu Buhari.\nIn 2015, Saraki was tried by the Code of Conduct Tribunal, over alleged under-declaration of assets when he held sway as governor of Kwara State.\nMedia aide to Saraki, Yusuph Olaniyonu, did not respond to calls made to his active mobile line when contacted.\nBut sources at the anti-graft agency said that Saraki was being grilled over alleged theft and other sundry allegations leveled against him by the EFCC."
  },
  {
    "headline": "State of the nation: I see danger —Abdulfatah Ahmed, ex-Kwara governor",
    "summarized_story": "From Romanus Ugwu, AbujaComing from a solid background as a lecturer, banker, state Commissioner before hitting the climax of becoming a governor, Abdulfatah Ahmed, the immediate past governor of Kwara State, is probably one of the most equipped Nigerian politicians both in academics and cognate experiences.\nFrom Romanus Ugwu, AbujaComing from a solid background as a lecturer, banker, state Commissioner before hitting the climax of becoming a governor, Abdulfatah Ahmed, the immediate past governor of Kwara State, is probably one of the most equipped Nigerian politicians both in academics and cognate experiences.\nWe are quite organised and I can proudly tell you that we are one of the most organised PDP state chapters in Nigeria.\nThis saw us creating a new funding window for capital project that cut across infrastructure, human capital development and state economy.\nIn short, we were able to bring out some new things especially driven out of necessity for Kwara State."
  },
  {
    "headline": "Tragic Saturday: Bandits behead 2 policemen, bomb station",
    "summarized_story": "From Stanley Uzoaru,OwerriThere was palpable fear in Umuaka in Njaba Local Government Area of Imo State in the early hours of yesterday as bandits allegedly bombed the Umuaka Divisional Police Station, the police quarters and allegedly beheaded two of the officers.\nHowever, the police ‘Operation Restore Peace’ which got hint of the activities of the bandits’ attack at the station immediately swung into action, killing two of the criminals while others ran away.\nMeanwhile, the state police spokesman, Michael Abattam, confirmed the attack on the station as well as the police killing two of the bandits, but did not confirm the beheading of his colleagues.\nHe also appealed to the people to avail police information of persons seen treating bullet wounds or hiding within the community or report such to the nearest police station.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "IG Recommends Kyari’s Suspension over FBI Indictment",
    "summarized_story": "A United States Court had recently ordered the arrest of DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer”, it said.\nThe statement titled “FBI Indictment: IGP Recommends Suspension of DCP Abba Kyari”, reads:“The Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the Service of the Nigeria Police Force, pending the outcome of an ongoing internal investigations touching on him.\n“The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer."
  },
  {
    "headline": "Protests Hit APC Congresses in Kwara, Lagos, Imo, Osun, A’Ibom, Delta, Others",
    "summarized_story": "Some of the affected states include: Kwara, Ekiti, Kano, Lagos, Imo, Oyo, Osun, Akwa Ibom, Rivers, Delta, and Enugu.\nOne person was killed in Ado Ekiti, the Ekiti State capital, during the ward congress held across the 177 wards in the state.\nHowever, despite the protests, the APC last night hailed the conduct of the congresses across the states, saying that its National caretaker chairman and Yobe State Governor, Mr. Mai Mala Buni, was not distracted.\nThe protesters demanded the cancellation of the ward congress, alleging that Akpanudoedehe “fraudulently manipulated the lists to include only his loyalists as candidates for the congresses”.\nThe Enugu APC ward congress was also characterised by the allegation of missing result sheets across the 260 wards in the state."
  },
  {
    "headline": "MTN Records N790.3bn Revenue in Q1 2021",
    "summarized_story": "The company’s Earnings Before Interest, Tax, Depreciation, and Amortisation (EBITDA), grew by 27.6 per cent to reach N417.2 billion.\n“Voice revenue grew by 13.1 per cent, benefitting from an 11.8 per cent increase in traffic and our customer value management (CVM) initiatives.\n“Data revenue continued the positive momentum from H2 2020, rising by 48.3 per cent,” he explained.\nAccording to him, Fintech revenue rose by 48.2 per cent driven by increased adoption of Xtratime and the core fintech services.\nThis puts MTN Nigeria on the highest possible GCR scale for short-term and long-term ratings, providing a solid platform for growth.”According to him, 2021 would mark the 20th anniversary of MTN’s presence in Nigeria."
  },
  {
    "headline": "Resident Doctors to Resume Nationwide Indefinite Strike Tomorrow",
    "summarized_story": "*Consultants give 21-day ultimatumOnyebuchi Ezigbo in Abuja and Seriki Adinoyi in JosNigeria’s health sector is about to face another round of crisis as the resident doctors have resolved to commence a nationwide indefinite industrial action tomorrow (Monday).\nThe resident doctors, under the auspices of the National Association of Resident Doctors (NARD), said they would embark on the strike due to the failure by the federal and state governments to attend to the issues affecting the welfare of its members.\nThey also noted the alleged non-payment of COVID-19 inducement allowance to some of its members in federal and state tertiary institutions.\nConsultants Give FG 21-day UltimatumMeanwhile, MDCAN has given 21-day ultimatum to the federal government and NSIWC to halt persistent cut in wages of members or face total and indefinite nationwide strike action.\n“All clinical lecturers in the remaining universities should be placed on CONMESS Scale for the purpose of their remuneration in the university."
  },
  {
    "headline": "Economists Fault 2022-2024 MTEF, Say N14.6tn Debt Service Plan Unsustainable",
    "summarized_story": "As shown in the MTEF, the federal government projected to spend N3.6 trillion on debt servicing in 2022, N4.9 trillion in 2023, and N6.1 trillion in 2024, bringing debt service cost to a cumulative of N14.6 trillion.\nWe do not have to pay N14.6 trillion we have projected for debt servicing in three years.\nMany state and federal governments are spending a substantial share of their revenues on debt servicing.\nIn 2022, under the framework, the federal government put projected expenditure at N13.95 trillion, comprising N3.4 trillion for non-debt expenditure, N3.6 trillion for debt servicing, and N3.61 trillion for the implementation of capital projects.\nIn the 2024 fiscal year, is projected to spend N16.8 trillion to finance its budget, with debt servicing gulping N6.1 trillion; recurrent expenditure N6.4 trillion, and capital expenditure standing at N3.61 trillion."
  },
  {
    "headline": "BREAKING: Nigeria's Police IG Recommends Suspension Of Embattled 'Super Cop', Abba Kyari As Panel Begins Probe",
    "summarized_story": "The Inspector-General of Police, IGP, Usman Alkali Baba, has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending fraud allegations against him.\nDCP Abba KyariThis was disclosed in a statement on Sunday with Ref No.\nUS court documents outlined a dispute among members of the Hushpuppi conspiracy, which allegedly prompted him to arrange to have an individual identified as ‘co-conspirator’ Kelly Chibuzor Vincent, jailed in Nigeria by DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "BREAKING: Nigeria's Police IG Recommends Suspension Of Embattled 'Super Cop', Abba Kyari As Panel Begins Probe",
    "summarized_story": "The Inspector-General of Police, IGP, Usman Alkali Baba, has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending fraud allegations against him.\nDCP Abba KyariThis was disclosed in a statement on Sunday with Ref No.\nUS court documents outlined a dispute among members of the Hushpuppi conspiracy, which allegedly prompted him to arrange to have an individual identified as ‘co-conspirator’ Kelly Chibuzor Vincent, jailed in Nigeria by DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "EXCLUSIVE: APC Leader, Tinubu Hospitalised In US, Undergoes Surgery",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently hospitalised in Maryland, the United States, SaharaReporters has learnt.\nIn January 2021, Tinubu was also reported sick and hospitalised in Paris, France.\nTinubu had earlier complained of exhaustion and had travelled out to rest before the news of his collapse gone viral.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age illnesses.\nSee Also Scandal 2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age“Tinubu is in Paris, France for a medical checkup."
  },
  {
    "headline": "EXCLUSIVE: APC Leader, Tinubu Hospitalised In US, Undergoes Surgery",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently hospitalised in Maryland, the United States, SaharaReporters has learnt.\nIn January 2021, Tinubu was also reported sick and hospitalised in Paris, France.\nTinubu had earlier complained of exhaustion and had travelled out to rest before the news of his collapse gone viral.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age illnesses.\nSee Also Scandal 2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age“Tinubu is in Paris, France for a medical checkup."
  },
  {
    "headline": "Five Activists Arrested From Dunamis Church Spend 28 Days In Cell As Department Of State Services Violates Court Order, Bail Conditions",
    "summarized_story": "Five activists arrested at the Dunamis International Gospel Centre for wearing #BuhariMustGo T-shirts by the Department of State Services (DSS) have now spent 28 days in detention as the secret police continue to violate court order on their release.\nThe DSS which dragged them before a Magistrates' Court in Mpape last Thursday, also refused to allow them to perfect their bail conditions before hurrying them back into detention.\nHuman rights activist, Omoyele Sowore, on Sunday reiterated the unjust incarceration of the activists, calling for their immediate release from detention.\nIt had been reported that despite a release order from the Federal High Court, the DSS filed charges at a lower Magistrates' Court in Abuja against the five activists which also granted them bail.\nSee Also Exclusive EXCLUSIVE: Blind Saxophonist Arrested In Dunamis Church Falls Sick In Department Of State Services’ Custody, Denied Access To DoctorsThe situation is giving their families and relatives a serious concern."
  },
  {
    "headline": "'We've turned to God, government has failed us' -- parents of abducted Baptist students wail",
    "summarized_story": "Marcus Angwa, a parent whose child was abducted from Bethel Baptist High School, Damishi, Kaduna, says he and other parents have turned to God to get their children out of captivity.\nSpeaking with the Punch, Angwa said the parents are disturbed by the Kaduna state government’s inability to rescue the students.\nParents are making their own efforts and then leaving the rest to God.\nThe role of the parents is to pray and leave the rest to God.\nAdvertisement“I have not heard anything from the Kaduna state government."
  },
  {
    "headline": "'We've turned to God, government has failed us' -- parents of abducted Baptist students wail",
    "summarized_story": "Marcus Angwa, a parent whose child was abducted from Bethel Baptist High School, Damishi, Kaduna, says he and other parents have turned to God to get their children out of captivity.\nSpeaking with the Punch, Angwa said the parents are disturbed by the Kaduna state government’s inability to rescue the students.\nParents are making their own efforts and then leaving the rest to God.\nThe role of the parents is to pray and leave the rest to God.\nAdvertisement“I have not heard anything from the Kaduna state government."
  },
  {
    "headline": "IGP recommends suspension of DCP Abba Kyari as police begin probe",
    "summarized_story": "Usman Alkali Baba, inspector-general of police (IGP), has recommended the suspension of Abba Kyari, a high-profile officer, over his ties to Ramon Abbas, self-confessed international fraudster better known as Hushpuppi.\nAdvertisementAccording to US court documents, Hushpuppi alleged that he bribed Kyari to arrest one Vincent Chibuzo, a co-fraudster.\n“The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference,” Mba said.\n“The SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed of the NPF by the Federal Bureau of Investigation (FBI),” he said.\n“The SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the force Leadership on the matter.”"
  },
  {
    "headline": "IGP recommends suspension of DCP Abba Kyari as police begin probe",
    "summarized_story": "Usman Alkali Baba, inspector-general of police (IGP), has recommended the suspension of Abba Kyari, a high-profile officer, over his ties to Ramon Abbas, self-confessed international fraudster better known as Hushpuppi.\nAdvertisementAccording to US court documents, Hushpuppi alleged that he bribed Kyari to arrest one Vincent Chibuzo, a co-fraudster.\n“The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference,” Mba said.\n“The SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed of the NPF by the Federal Bureau of Investigation (FBI),” he said.\n“The SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the force Leadership on the matter.”"
  },
  {
    "headline": "COVID-19: Nigeria logs 497 new infections in 18 states -- but zero deaths",
    "summarized_story": "Nigeria’s daily count of COVID-19 cases declined slightly on Saturday — with 497 new infections confirmed in 17 states and the federal capital territory (FCT).\nAdvertisementIn the past seven days, there has been a consistent surge in infections and deaths across the country.\nThe Nigeria Centre for Disease Control (NCDC) confirmed the new positive samples in its update for July 31.\nAdvertisementAkwa Ibom took the second position with 80 positive samples, followed by Kwara and Osun with 73 and 29 positive cases, respectively.\nA total of 164,994 people have recovered after treatment — representing 94.8 percent of 173,908 confirmed cases in Nigeria."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Airtel Africa receives $200 million to invest in network and sales infrastructure",
    "summarized_story": "It had also gotten a $100m investment from Mastercard in Airtel Mobile Commerce BV (AMC BV) in April.\nAirtel Africa says that QIA will hold a minority stake in the company while it retains the majority.\nComparing revenue from Q1 2020 with Q1 2021, Airtel saw a significant increase in revenue at $1.03b, dwarfing Q1 2020’s revenue of $899m by 21.7%.\nIts mobile money customer base went from 18.3 million in Q1 2020 to 21.7 million in Q1 2021, an 18.5% increase.\nHe also believes that the Sovereign Wealth Fund’s investment in Airtel Africa will contribute to sub-Saharan Africa’s financial inclusion."
  },
  {
    "headline": "Who puts out your IT fires when you’ve deleted an entire file from the company’s servers?",
    "summarized_story": "Share this article:Recently, the job of a system administrator — sometimes called a sysadmin or system admin — had begun to fascinate me.\nMy first experience with system administrators was with the technical support staff in the ICTU/CRPU unit of the University of Benin.\nAdvertisementWho are System Administrators?\nSystem Administrators troubleshoot all day, every day.\nHowever, according to Olusegun Balogun, an IT Support Specialist, you don’t necessarily have to have those degrees to become a system administrator."
  },
  {
    "headline": "How LoftyInc Capital invests, Dyslexia and assistive technology, Google’s app update",
    "summarized_story": "How LoftyInc Capital Management invests in Capital investsLoftyInc Capital Management Management Partners.\nThey are all LoftyInc Capital Management (LCM) portfolio companies, one of the oldest venture capital firms in Nigeria.\nThis is an excellent time to revisit it: The unique case of Africans with learning disabilities and assistive technology.\nGoogle has announced a new policy update on the Android Play Store to support user control, privacy, and security, beginning September 1, 2021.\nGoogle claims that with its User Data Policy update, it will be illegal to link persistent device identifiers to personal and sensitive user data or resettable device identifiers unless for pre-approved use cases."
  },
  {
    "headline": "Trapped firms in Onne-Eleme cry out in face of stalemate",
    "summarized_story": "Over 300 companies trapped in the shutdown of the Eleme-Onne section of the East-West Road area near Port Harcourt, Rivers State, have cried out over bleak weeks ahead.\nThe stalemate has caused panic within the companies as the youth began making arrangements for church service at the venue on Sunday.\n“You have large scale corporations such as two fertilizer manufacturing companies who serve the entire country,” he said.\nThe source said: “This is an economic road that delivers traffic to Ogoni of Rivers State, to Akwa Ibom, and to the Cross River States.\n“It is also the road that links the nation to the construction site of the N120billion Bodo-Bonny Road across the sea."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "The Naira closed the week at $/N411.44 at the I&E FX window, at the NAFEX (spot market) it closed at $/N411.19.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nTreasury bills marketThe treasury bills market was largely bullish for most of the trading session last week, as we saw some buying in the week.\nNGX IND, NGX-30, NGX Consumer Goods, and NGX Banking closed the week with -1.32%, -0.60%, +0.06%, and -0.95% respectively.\nMarket breadth for the week closed positive with 37 gainers led by OANDO and BOCGAS as against 35 losers led by LINKASSURE and REGALINSIn the coming week, we expect the possibility of bargain hunting as investors look to take advantage of the result season."
  },
  {
    "headline": "Insecurity: Arrival of Super Tucano in Nigeria raises hope of terrorists’ defeat",
    "summarized_story": "With the arrival, a few days ago, of six Super Tucano jet fighters, Nigeria is set to put to rout the assorted terrorist groups in the country, but experts say Nigeria needs the political will and attitudinal change in order to win the low-grade war.\nRead Also: Security: Six A-29 Super Tucano aircraft leave US for NigeriaIt is celebrating the acquisition of six Super Tucano jets, which arrived Nigeria penultimate Thursday, and some people are commending the government, expressing the optimism that with the military jets, the days of Boko Haram, bandits and kidnappers are numbered.\nWhich African country will want Nigerian soldiers now, when it is obvious that they cannot fight their own battle?\nApart from the Tucano fighter jets, Nigeria is also said to be expecting other fighter jets from Pakistan.\nThe security challenged has over the last five years worsened with the bloody campaign of various categories of terrorists across Nigeria, mainly, the northern part of the country."
  },
  {
    "headline": "More groups hail Obaseki for clamp down on Okhaighele activities, say new law ‘ll fast track devt in Edo – Nigerian Observer",
    "summarized_story": "More groups hail Obaseki for clamp down on Okhaighele activities, say new law ‘ll fast track devt in EdoShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has continued to receive commendations for signing the bill to repeal the Edo State Private Property Protection Law 2017 and re-enacting the Edo State Private Property Protection Law 2021.\nObaseki, while signing the bill into law said “the law affects law and order in the state.\n“When the Governor put an end to the activities of CDAs, the Okhaigele took over the proscribed CDA’s activities and turned themselves to warlords in their various communities, thereby confiscating landed property belonging to individuals.\n“The same duty they were doing as CDAs was what they were also doing as Okhaigeles.\nAt a time when it seemed the Land Grab Act had been abandoned, this amendment surprisingly came on board."
  },
  {
    "headline": "How we used EDOFEST to push for return of artefacts – Ex-Edo arts, culture commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Former Edo Commissioner, for Arts, Culture and Diaspora Affairs, Hon.\nOsaze Osemwengie-Ero has said the Edo Festival of Arts and Culture (EdoFEST), organized in 2018, played a pivotal role in raising awareness for the return of the Benin artefacts.\nWe did a photo exhibition of the stolen artefacts with locations in Europe and America.\nThis exhibition was also done in the palace of His Royal Majesty, the Oba of Benin and to showcase the affected artefacts to the world.\nIt coincided with the Oba’s anniversary, and a lot of visitors who came were at the exhibition hall to look at the artefacts."
  },
  {
    "headline": "Obaseki seeks collaboration to tackle flooding, warns against violating state’s town planning laws – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for citizens’ support, as well as the collaboration of all stakeholders in the state to reduce the incidence of flooding and erosion by ensuring adherence to the state’s Extant Town Planning Laws and Regulations.\nObaseki, who received members of the Edo State Chapter of the Nigerian Institute of Landscape Horticulturist (NILH), noted that the government remains committed to ensuring the safety and wellbeing of all residents.\nThe governor, represented by his Chief of Staff, Hon.\nOsaigbovo Iyoha, reiterated the need for residents to stop erecting buildings in prohibited areas, to check flood and erosion challenges in the state.\nObaseki noted: “As a government, we have been educating our people on our urban renewal reforms, and we see this group as partners in progress to check ecological challenges as a result of flood and erosion."
  },
  {
    "headline": "Edo govt begins awareness campaign on inactivated polio vaccine …inspects Benin Airport, insists on strict adherence to COVID-19 protocols – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Friday, kicked off a fresh campaign to enlighten residents on the need to immunize their children with the Inactivated Polio Vaccine (IPV) to guarantee full protection against Polio Mellitus.\nThe Edo State Deputy Governor, Rt.\nShaibu, while speaking with the Edo women on the need to vaccinate their children, noted that the inactivated polio vaccine provides additional and rapid immunity that covers all three types of polioviruses.\nHe however urged them not to neglect the Oral Polio Vaccine (OPV), adding that a combination of both the OPV and IPV provide stronger protection for the children.\nThe deputy governor was also at the Benin Airport to check protocols put in place by the airport management to prevent the importation of the Delta variant of coronavirus (COVID-19) into the state."
  },
  {
    "headline": "Amidst rising COVID-19 cases, cholera outbreak, Nigerian doctors set for nationwide strike",
    "summarized_story": "The doctors, members of the National Association of Resident Doctors (NARD), blamed the Nigerian government for the strike.\nThey also demanded the review of hazard allowance for health workers due to the risk associated with their profession.\nHealth workers, being the first respondents to patients, have continued to be at risk of exposure to infections including the COVID-19 virus.\nStrike to compound Nigeria’s woesIf it eventually kicks off as planned, the strike action will further compound the woes bedevilling the nation’s healthcare sector.\nThe doctor’s strike is coming at a time Africa’s most populous nation is preparing for a possible third wave of the coronavirus pandemic."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Police IG recommends Abba Kyari for suspension over Hushpuppi multimillion-dollar fraud",
    "summarized_story": "The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe Special Investigation Panel (SIP), comprising four (4) Senior Police Officers, is headed by DIG Joseph Egbunike, the Deputy Inspector General of Police in-charge of the Force Criminal Investigations Department (FCID).\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).\nThe SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter."
  },
  {
    "headline": "I went to EFCC on my own volition – Saraki",
    "summarized_story": "Abubakar Bukola Saraki, Nigeria’s former senate president, has said he was at the headquarters of the Economic and Financial Crimes Commission (EFCC) on his own volition.\nIn a statement late Saturday, Saraki’s media aide, Yusuph Olaniyonu, said the politician “on his volition” appeared before investigators to clarify issues as “a responsible citizen”.\nThe statement said, “The Media Office of Dr. Abubakar Bukola Saraki will like to confirm that this afternoon, Dr. Saraki on his own volition visited the office of the EFCC to clarify any issue that the commission may want to raise with him.\n“Following this complaint, Dr. Saraki, as a responsible citizen, on his own volition approached the commission that at the earliest convenient date, he was willing to visit the commission’s office and clarify all issues they might want to raise with him.\nDr. Saraki also assured the commission that he has nothing to hide and will always make himself available to clear all issues that may require his attention.”"
  },
  {
    "headline": "Refineries incur 13-month N104.3bn loss, refine zero oil",
    "summarized_story": "The NNPC manages Nigeria’s refineries, namely Kaduna Refining and Petrochemical Company, Port Harcourt Refining Company and Warri Refining and Petrochemical Company.\nFigures from the corporation showed that the monthly operating expenditures of the refineries surpassed their revenues all through the 13-month duration.\nThis came as the oil firm’s latest report further showed that all through these months, the refineries were unable to refine crude oil.\n“It (Port Harcourt refinery) will be completed within 18 to 44 months when counting from April this year.\nAlso, oil marketers had urged the corporation to try and hasten the rehabilitation exercise of refineries, particularly the revamp of the Port Harcourt refinery."
  },
  {
    "headline": "MTN Nigeria records 24.1% revenue growth to N790.3bn in Q1 2021",
    "summarized_story": "Telecom giant, MTN Nigeria, has declared revenue of N790.3 billion, representing an increase of 24.1 per cent in its unedited half year results for the period that ended on June 30, 2021.\n“Voice revenue grew by 13.1 per cent, benefitting from an 11.8 per cent increase in traffic and our customer value management (CVM) initiatives.\n“Our 4G network now covers 65.1 per cent of the population, up from 60.1 per cent in December 2020,” he added.\nHe said fintech revenue rose by 48.2 per cent driven by increased adoption of Xtratime and the core fintech services.\nThis puts MTN Nigeria on the highest possible GCR scale for short-term and long-term ratings, providing a solid platform for growth.”According to him, 2021 would mark the 20th anniversary of MTN’s presence in Nigeria."
  },
  {
    "headline": "NDLEA Nabs Lady With 35 Wraps Of Cocaine At Lagos Airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), has arrested a lady, Okafor Ebere Edith, and recovered 35 wraps of cocaine from her underwear.\nEdith, who was arrested on July 30, 2021 during the outward clearance of passengers on Air Cotevoire, to Monrovia, Liberia from the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos, tucked the pellets of cocaine in her underwear to beat security checks.\nNDLEA spokesperson, Femi Babafemi, said she was, however, picked up for search and questioning during which the wraps of the illicit drug were found on her.\nADVERTISEMENTDuring preliminary interview, she claimed her desire to make money pushed her into drug trafficking.\nAfter a thorough search of the warehouse, 125 bags of cannabis sativa were recovered while a man seen praying in front of the house fled into the forest when he sighted the narcotic officers from afar."
  },
  {
    "headline": "NDLEA Nabs Lady With 35 Wraps Of Cocaine At Lagos Airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), has arrested a lady, Okafor Ebere Edith, and recovered 35 wraps of cocaine from her underwear.\nEdith, who was arrested on July 30, 2021 during the outward clearance of passengers on Air Cotevoire, to Monrovia, Liberia from the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos, tucked the pellets of cocaine in her underwear to beat security checks.\nNDLEA spokesperson, Femi Babafemi, said she was, however, picked up for search and questioning during which the wraps of the illicit drug were found on her.\nADVERTISEMENTDuring preliminary interview, she claimed her desire to make money pushed her into drug trafficking.\nAfter a thorough search of the warehouse, 125 bags of cannabis sativa were recovered while a man seen praying in front of the house fled into the forest when he sighted the narcotic officers from afar."
  },
  {
    "headline": "Toyin Alausa, Kemi Korede, others Join Honeyglow Family",
    "summarized_story": "Leading skincare and fashion brand, Honeyglow has unveiled top Nollywood actors as their brand ambassadors.\nThe talented screen icons, Toyin Alausa and Kemi Korede signed the dotted lines for the Honeyglow Skincare and fashion world, while Jide Awobona and Abiodun Adebanjo joined the Honeyglow Fashion World.\nSpeaking at the signing, Honeyglow CEO, Oyindamola Funmilayo Abiona disclosed that the choice of these screen stars was a no-brainer.\n“Our business started in October 2015, and since then there have been several people that have constantly identified with us, and among them are these four.\nI am proud to be showcasing excellence on screen and now in reality.”ADVERTISEMENTJide Awobona, speaking on the deal said, “when you see me looking dashing, stunning and elegant in some classic outfits, you can be sure it’s courtesy Honeyglow Fashion World."
  },
  {
    "headline": "Toyin Alausa, Kemi Korede, others Join Honeyglow Family",
    "summarized_story": "Leading skincare and fashion brand, Honeyglow has unveiled top Nollywood actors as their brand ambassadors.\nThe talented screen icons, Toyin Alausa and Kemi Korede signed the dotted lines for the Honeyglow Skincare and fashion world, while Jide Awobona and Abiodun Adebanjo joined the Honeyglow Fashion World.\nSpeaking at the signing, Honeyglow CEO, Oyindamola Funmilayo Abiona disclosed that the choice of these screen stars was a no-brainer.\n“Our business started in October 2015, and since then there have been several people that have constantly identified with us, and among them are these four.\nI am proud to be showcasing excellence on screen and now in reality.”ADVERTISEMENTJide Awobona, speaking on the deal said, “when you see me looking dashing, stunning and elegant in some classic outfits, you can be sure it’s courtesy Honeyglow Fashion World."
  },
  {
    "headline": "BREAKING: IGP Recommends Suspension Of Abba Kyari Over FBI Indictment",
    "summarized_story": "The inspector-general of police, IGP Usman Alkali Baba, has recommended the immediate suspension of the head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, from the Service of the Nigeria Police Force, pending the outcome of an ongoing internal investigations of allegations against him.\nThe IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Kyari without interference.\nADVERTISEMENTHushpuppi: FBI Mounts Pressure On IGP To Provide DCP KyariHe said the suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe Special Investigation Panel (SIP), comprising four senior police officers, is headed by DIG Joseph Egbunike, the Deputy Inspector General of Police in-charge of the Force Criminal Investigations Department (FCID).\nMba also said the SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Kyari by the US government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "BBNaija 6: No relationship for me in the house – Liquorose",
    "summarized_story": "BBNaija 6: No relationship for me in the house – LiquoroseBBNaija 6: No relationship for me in the house – LiquoroseBBNaija Shine Ya Eye housemate, Liquorose has said she won’t start any relationship in the house.\nShe said this during a conversation with fellow housemates Yousef and Nini.\nThe mult-talented housemate said she prefers to be a spectator in the house than having any romantic relationship with other housemates.\n“I don’t want to be in any relationship, I just want to be a spectator watching everything, everyone from afar,” she said.\nLiquorose has been helping the housemates in their choreography and has also been one of the vocal housemates."
  },
  {
    "headline": "BBNaija 6: No relationship for me in the house – Liquorose",
    "summarized_story": "BBNaija 6: No relationship for me in the house – LiquoroseBBNaija 6: No relationship for me in the house – LiquoroseBBNaija Shine Ya Eye housemate, Liquorose has said she won’t start any relationship in the house.\nShe said this during a conversation with fellow housemates Yousef and Nini.\nThe mult-talented housemate said she prefers to be a spectator in the house than having any romantic relationship with other housemates.\n“I don’t want to be in any relationship, I just want to be a spectator watching everything, everyone from afar,” she said.\nLiquorose has been helping the housemates in their choreography and has also been one of the vocal housemates."
  },
  {
    "headline": "Alleged police harassment: Fuel scarcity looms in Southeast as IPMAN threatens to suspend distribution",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) yesterday threatened to suspend the supply and distribution of products within its designated Eastern zone with effect from tomorrow.\nThe News Agency of Nigeria (NAN) reports that depots to which IPMAN supplies products in its designated Eastern zone include Aba, Calabar, Enugu, Makurdi and Port Harcourt.\n“Following the series of unwarranted attacks by the police against IPMAN, Eastern Zone, the National Executive Committee of IPMAN resolved that members withdraw their services at these units/depots immediately until further notice.\n“The Zonal Chairman, East, should kindly forward (the notice) to chairmen, IPMAN, Aba, Calabar, Enugu, Makurdi and PH Depots/Units for compliance,” the circular stated.\n“So we have resolved to withdraw our services in the Eastern zone indefinitely until legality is restored,” he said."
  },
  {
    "headline": "Alleged police harassment: Fuel scarcity looms in Southeast as IPMAN threatens to suspend distribution",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) yesterday threatened to suspend the supply and distribution of products within its designated Eastern zone with effect from tomorrow.\nThe News Agency of Nigeria (NAN) reports that depots to which IPMAN supplies products in its designated Eastern zone include Aba, Calabar, Enugu, Makurdi and Port Harcourt.\n“Following the series of unwarranted attacks by the police against IPMAN, Eastern Zone, the National Executive Committee of IPMAN resolved that members withdraw their services at these units/depots immediately until further notice.\n“The Zonal Chairman, East, should kindly forward (the notice) to chairmen, IPMAN, Aba, Calabar, Enugu, Makurdi and PH Depots/Units for compliance,” the circular stated.\n“So we have resolved to withdraw our services in the Eastern zone indefinitely until legality is restored,” he said."
  },
  {
    "headline": "Busted: Drug trafficker Edith hides 35 wraps of cocaine on her underwear",
    "summarized_story": "By Kazeem UgbodagaA suspected drug trafficker, Okafor Ebere Edith, has been arrested at the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos with 35 wraps of cocaine recovered from her underwear.\nShe was busted by the National Drug Law Enforcement Agency, NDLEA, on Saturday during the outward clearance of passengers on Air Cotevoire, to Monrovia, Liberia at the MMIA.\nFemi Babafemi, NDLEA‘s spokesman, in a statement on Sunday said the suspect who allegedly tucked the pellets of cocaine in her underwear to beat security checks at the Airport was however picked up for search and questioning during which the wraps of the illicit drug were found on her.\n“During preliminary interview, she claimed her desire to make money pushed her into drug trafficking,” Babafemi said.\nHe charged them and their counterparts in other commands to remain focussed and resolute in pursuit of the goal to rid Nigeria of illicit substances and drug related criminality."
  },
  {
    "headline": "IGP Baba recommends Abba Kyari’s suspension, panel probes FBI papers",
    "summarized_story": "By Taiwo OkanlawonDeputy Commissioner of Police and the Head of the Police Intelligence Response Team (IRT), Abba Kyari has been recommended for suspension by IGP Alkali Baba.\nThe IGP made the recommendation in the wake of the weighty allegations against him by the Federal Bureau of Investigation (FBI) in its case against notorious fraudster Hushpuppi.\nKyari will remain out of service of the Nigeria Police Force pending the outcome of investigations.\nThe IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nHushpuppi claimed he bribed Kyari for the arrest and even made Kyari to send photograph of the arrest."
  },
  {
    "headline": "Akwa Ibom now Nigeria’s leading COVID-19 hotspot after Lagos",
    "summarized_story": "By AbankulaAkwa Ibom state has become the latest hotspot for COVID-19 infections, outside of Lagos as the third wave of the virus rages.\nOn Saturday, Akwa Ibom again logged 80 new cases, second to Lagos, which reported 211 cases.\nIn the last one week, Akwa Ibom has tailed Lagos in daily cases reported.\nAkwa Ibom rising grim profile comes as the NCDC registered additional 497 COVID-19 cases, said to be driven by the spread of the Delta variant.\nApart from Lagos and Akwa Ibom, the 497 new cases were reported from 15 states and the FCT."
  },
  {
    "headline": "Hushpuppi: Nothing Must Happen To Abba Kyari – Arewa Youths To FBI",
    "summarized_story": "On Sunday, the Arewa Youth Consultative Forum, or AYCF, issued a warning that “nothing must happen to DCP Abba Kyari.”The AYCF issued the warning while chastising a US court for ordering the arrest of Abba Kyari, the Deputy Commissioner of Police.\nAYCF National President, Yerima Shettima also dismissed what it described as “the attempted intimidation of a police officer right inside his independent fatherland”.\n“While we are conscious of our sovereignty as a nation, we demand justice for a man with unrivalled records of detective capabilities in the recent history of Nigeria,” the AYCF stressed.\nThe Federal Bureau of Investigation, FBI, had linked Kyari to international fraudster, Abass Ramon popularly known as Hushpuppi.\nHushpuppi is alleged to have bribed Kyari to jail an errant gang member during a fraud deal with millions of dollars."
  },
  {
    "headline": "Resident Doctors Are At Fault, Sanwo-Olu Speaks Over Impending Nationwide Strike",
    "summarized_story": "The National Association of Resident Doctors (NARD) has chastised Lagos State Governor Babajide Sanwo-Olu for the impending statewide strike, which would commence on Monday, July 2, 2021, according to the NARD.\n“Accordingly, Mr Governor, Babajide Olusola Sanwo-Olu, has approved the removal of Grade Level for Internship Programmes/Housemanship/NYSC doctors in the State Public Service.\nThey also observed that some house officers are still being owed one to two months salaries.\nBut surprisingly, Lagos State quickly jumped to the implementation of that and we feel it is not acceptable.\nOther governors have not implemented it, but Lagos State rushed to implement it."
  },
  {
    "headline": "BREAKING: IGP suspends Abba Kyari over Hushpuppi multimillion-dollar fraud",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the Service of the Nigeria Police Force, pending the outcome of an ongoing internal investigations touching on him.\nThe IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).\nThe SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter."
  },
  {
    "headline": "I Was Not Arrested – Saraki Opens Up On EFCC Invitation",
    "summarized_story": "Former Senate President, Bukola Saraki has denied being arrested by the Economic and Financial Crimes Commission, EFCC.\nSaraki made headlines on Saturday evening after a report went viral on social media that he was picked up by operatives of the anti-graft commission.\nReacting to the development, the Kwara-born politician disclosed that he only invited by the commission to clarify some issues.\nHe was not arrested.\nDr. Saraki also assured the commission that he has nothing to hide and will always make himself available to clear all issues that may require his attention.”"
  },
  {
    "headline": "Breaking – ‘Bribery’: Embattled Super Cop, Abba Kyari, faces suspension from Police",
    "summarized_story": "The embattled Deputy Commissioner of Police (DCP) Abba Kyari has been recommended for immediate suspension from the country’s Police force following a multi-million dollar bribery alleged levelled against him.\nThe Inspector General of Police (IGP) Usman Baba gave the recommendatiom pending the outcome of an ongoing internal investigation involving him.\nThe IGP, in his letter to the Police Service Commission, dated 31st July 2021, said the recommendation for suspension of the officer is in line with the internal disciplinary processes of the Force.\nKyari, the Head of the Police Intelligence Response Team, was indicted by a US Court in California over alleged involvement in internet fraud of over a $1.1million by with Ramoni Abba aka Hushpuppi.\nKyari has since denied any involvement in the internet fraud case which victim was said to be a Qatari businessman."
  },
  {
    "headline": "Breaking: Nigerians smell medal as continental record holder, Ese Brume, jumps to 2020 Olympics final",
    "summarized_story": "Nigeria’s reigning African record holder in long jump, Ese Brume, breezed through the qualification round early Sunday morning in the ongoing 2020 Olympics in Tokyo Japan.\nHer leap of 6.76 meters automatically qualified her for Monday’s final.\nAfter days of gloomy participation, Nigerians will smile if she makes podium finish.\nDetails coming…"
  },
  {
    "headline": "Breaking: Resident doctors set to begin strike as COVID-19 escalates",
    "summarized_story": "Government-owned hospitals across Nigeria will be under lock and key as from Monday, August 2, 2021 following strike notice already issued by the National Association of Resident Doctors (NARD).\nThe strike notice was contained in a directive by the leadership of NARD after it concluded a meeting which held in Umuahia, Abia state.\nSpecifically, NARD asked members to begin full strike from Monday, August 2.\nDisclosing this at the end of the meeting, NARD National President, Dr Okhuaihesuyi Uyilawa, disclosed that members have been asked to proceed on a nationwide indefinite industrial action.\nDetails loading…"
  },
  {
    "headline": "APGA leadership Tussle: Jude Okeke wins as Appeal Court strikes out Factional Chairman Edozie Njoku’s appeal -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "East-West Road: Akpabio urges indigenes to support Government efforts -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio, has appealed to indigenes of host communities at the Eleme and Onne axis of the East-West road in Rivers State, to support ongoing efforts of the government aimed at completing the road project as scheduled.\nThe minister made this call during his meeting with Stakeholders and Management of Reynold Construction Company, RCC in his office, on Thursday in Abuja.\nThe minister further disclosed that due to the volume of traffic on the road, it has become imperative that the road be expanded to six lanes, with additional flyovers.\nNader Yusuf noted that the main issue in the Eleme Junction is in the delay of compensation to the indigenes that have properties on that axis of the road.\nHe advised that once relevant funds are made available, payment of compensation would commence immediately."
  },
  {
    "headline": "Host Community Urges Exploration company to commence operations in Atala Marginal field -NigPilot",
    "summarized_story": "With the new license for exploration given to Halkin Exploration and Production Company, the people of Ekeremor constituency 2 and other host communities have urged Halkin Exploration to commence operations in the Atala Marginal field as soon as possible.\nThe host community noted that this will bring the long-awaited dividends to the people of the community.\nIn a statement signed by the member representing Ekeremor Constituency 2 and Deputy Minority Leader in Bayelsa State House of Assembly, Hon.\nThey posited that the Bayelsa State Government should as a matter of urgency congratulate the newly licensed exploration company and avail them the enabling environment to thrive, as her current position is also misleading.\nThe group however applauded the Federal Government for doing the needful by awarding the Atala Oil Field to indigenous oil Exploration Company, the group said any other decision would have been perceived as utter neglect towards the interest of the host communities."
  },
  {
    "headline": "NAF moves to solve pension crisis, creates Directorate of Veteran Affairs -NigPilot",
    "summarized_story": "The CAS disclosed this while declaring open a 2-day Conference for NAF Administrative and Medical personnel.\nHe said the outcome of such innovations would stimulate NAF human resource management efforts to be at par with global organizational standards and best practices.\nTo this end, we will continue to epitomize best human resource management practices to promote our operational effectiveness,” he said.\nThe Chief of Medical Services, Air Commodore Olabode Babalola revealed the desire of the CAS to ensure that the NAF Medical Services measure up to the global best practice.\nHe said the CAS approval of the Medical Conference is a further attestation of his willingness to improve healthcare delivery in the NAF."
  },
  {
    "headline": "Hushpuppi: IGP Recommends Suspension Of Abba Kyari",
    "summarized_story": "The Inspector-General of Police, Usman Alkali Baba, has recommended the immediate suspension of a super cop and Deputy Commission of Police, Abba Kyari, police authorities confirmed to Channels Television on Sunday.\nKyari, an officer who is highly revered by colleagues in the Force and celebrated by members of the general public, was fingered in a bribery scandal involving Ramon Abbas popularly known as Hushpuppi.\nEarlier, the United States District Court for the Central District of California said alleged international fraudster, Hushpuppi used Kyari to arrest and jail a co-conspirator, Chibuzo Vincent.\nDisturbed by the development, the police chief ordered an “internal review of the allegations” against a Deputy Commissioner of Police, Abba Kyari, by a United States Court.\nAccording to the police boss, the suspension is to “create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference."
  },
  {
    "headline": "VIDEO: NDLEA Recovers 35 Wraps Of Cocaine From Lady’s Underwear At Lagos Airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), on Saturday 31st July 2021, recovered 35 wraps of cocaine from the underwear of a lady, Okafor Ebere Edith during the outward clearance of passengers on Air Cotevoire, to Monrovia, Liberia from the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos.\nThe suspect who tucked the pellets of cocaine in her underwear to beat security checks at the Airport was however picked up for search and questioning during which the wraps of the illicit drug were found on her.\nDuring the preliminary interview, she claimed her desire to make money pushed her into drug trafficking.\nChairman/ Chief Executive of the NDLEA, Brig.\nHe charged them and their counterparts in other commands to remain focussed and resolute in pursuit of the goal to rid Nigeria of illicit substances and drug-related criminalities."
  },
  {
    "headline": "Two Abducted Kebbi Students Regain Freedom",
    "summarized_story": "Two out of the abducted students of Federal Government College, Birnin Yauri in Kebbi State have regained their freedom.\nThe students were rescued by the police authorities in a forest of Dansadau District, Maru Local Government Area of Zamfara State.\nSpokesman of the Zamfara State Police Command, SP Mohammed Shehu, confirmed this on Sunday to journalists in Gusau.\nThe rescue effort is coming about six weeks after gunmen suspected to be bandits stormed the school and abducted an unspecified number of students and four teachers.\nREAD ALSO: Gunmen Abduct Students From Federal Government College In KebbiPrior to the Kebbi students’ kidnap, gunmen had whisked away about 200 students of an Islamiyya school in Niger State in May."
  },
  {
    "headline": "Nigeria’s Enoch Adegoke Storms Into 100m Final At #Tokyo2020",
    "summarized_story": "Nigeria’s Enoch Adegoke has stormed into the 100m final at the ongoing Tokyo 2020 Olympics, after finishing second in semi-final 2 as he ran 10.00.\nAdegoke, who was awarded second place in a photo finish with Trayvon Bromell after both timed 10 seconds dead.\nPrior to the Olympics, Bromell was the favourite for the race, having set the fastest time this year of 9.77sec, the seventh-quickest in history.\nHowever, Adegoke beat the United State’s best, coming in just behind Zharnel Hughes who kept the British hope alive by winning the second semi in 9.98seconds.\nAlso through to the semi-final was Ushoritse Itshekiri who finished third in his first-round heat while Nigeria’s third entrant in the event, Divine Oduduru, was disqualified for false starting."
  },
  {
    "headline": "FG To Receive 4.8m Doses Of Vaccines On Monday",
    "summarized_story": "The Federal Government will on Monday receive about 4.8 million doses of Moderna COVID-19 Vaccines, the National Primary Health Care Development Agency (NPHCDA) said on Sunday.\nThe expected shipment will be the largest of vaccines received since the nationwide COVID-19 vaccination campaign started in March this year.\nNigeria has run out of COVID-19 vaccines after an initial four million doses of AstraZeneca, received from the COVAX facility were utilized three weeks ago.\nThis is coming barely Presidential Steering Committee on COVID-19 (PSC), called for strict compliance to the COVID-19 protocols in the conduct of all political events in the country.\nWhile the nation’s commercial capital recorded 211 cases, Akwa-Ibom State came second with 80 new cases while Kwara recorded 73 cases."
  },
  {
    "headline": "Covid-19: 25 Corps members test positive in Gombe NYSC camp",
    "summarized_story": "No fewer than 25 prospective corps members, including a nursing mother, have tested positive for coronavirus at the Gombe NYSC Camp ground located in Amada, Akko LGA.\nCommissioner for Health, Dr. Habu Dahiru, confirmed the matter on Saturday, saying that the 25 corps members had been tested in the previous three days and had been transferred to the state-owned isolation center at the Idris Mohammed infectious disease center in Kwadon.\nHe said, “Out of the 1,291 that were tested using the Polymerase Chain Reaction, , 25 persons were positive, and one is a nursing mother.\n“At the isolation centre, we have made provision for their feeding, medication and their securityAdvertisement“We have drafted Police to provide security to the place.\nThey will be managed at the isolation centre until they are negative and they will be returned to join their fellow corps members."
  },
  {
    "headline": "Kebbi: Police rescue two abducted students of FGC Birnin Yauri",
    "summarized_story": "Troops of Operation Restore Peace have rescued two of the students abducted from federal government college Birnin Yauri.\nThe rescued students are Maryam Abdulkareem, a fifteen-year-old female, and Faruk Buhari, a seventeen-year-old male.\nAccording to CP Rabiu Hussaini, the students were medically checked and debriefed.\nThey will be handed over to the Kebbi State Police Command, who will then hand them over to the Kebbi State Government, who will reunite them with their families.\nHe encouraged the general public especially those living around Dansadau area to help the Police with credible intelligence to rescue the remaining students who are still in captivity."
  },
  {
    "headline": "NDLEA recovers 35 wraps of cocaine from lady’s underwear at MMIA, Lagos, intercepts drugs heading for Europe",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency, NDLEA have recovered 35 wraps of cocaine from the underwear of a lady, Okafor Eber Edith during the outbound clearance of passengers on Air Cotevoire to Monrovia, Liberia from Murtala Muhammed International Airport, MMIA, Ikeja, Lagos.\nDuring preliminary interview, she claimed her desire to make money pushed her into drug trafficking.\nChairman/ Chief Executive of the NDLEA, Brig.\nGen. Mohamed Buba Marwa (Retd) commended the commanders, officers and men of the MMIA and Niger state commands of the Agency for their continued efforts in tracking down traffickers of illicit drugs in their areas of responsibility.\nAdvertisementHe urged them, as well as their counterparts in other commands, to be focused and steadfast in their efforts to rid Nigeria of illicit drugs and drug-related crimes."
  },
  {
    "headline": "Turkey Declares ‘Disaster Areas’ as Wildfire Death Toll Rises",
    "summarized_story": "Turkish President Recep Tayyip Erdogan has declared parts of southern Turkey ravaged by wildfires as “disaster areas”, with the death toll from the fires rising to six after two forest workers were killed.\nFires across Turkey since Wednesday have burned down forests, encroaching on villages and tourist destinations and forcing people to evacuate.\nErdogan declared the regions affected by the forest fires “disaster areas” in a statement on Twitter.\nTurkey has blamed some previous forest fires on arson or outlawed groups such as the Kurdistan Workers Party (PKK).\nSpeaking from Antalya, Al Jazeera’s Resul Serdar said there are still active forest fires in at least 10 locations in Turkey."
  },
  {
    "headline": "Chinese-Canadian Pop Star Kris Wu Detained on Suspicion of Rape",
    "summarized_story": "Police in Beijing have detained Chinese-Canadian pop star Kris Wu on suspicion of rape.\nThe claim prompted widespread condemnation of Wu on Chinese social media and resulted in several luxury brands dropping deals with him.\nThe teenager publicised her accusations against him on social media last month and later in an interview with the internet portal NetEase.\nSince her accusations, more people have spoken out online, accusing Wu’s staff of predatory behaviour such as inviting them to boozy karaoke parties.\nWu, who grew up between Vancouver and Guangzhou, has denied all allegations of assault and insisted he was innocent in multiple social media statements."
  },
  {
    "headline": "How Nairobi Became a Thriving Arts Hub",
    "summarized_story": "For many years, the cultural spotlight in Africa has seemed to be stubbornly focused on the west or south of the continent rather than East Africa.\nMuch of this cultural verve is centred on Kenya’s capital Nairobi, which has emerged as a creative hub.\nIn the two decades Eltayeb has lived in Nairobi, his artwork has been able to thrive with stunning results.\nBeyond Nairobi, across East Africa, creatives are also shaping a new cultural palette, fusing ancient histories with contemporary realities.\nIn Mogadishu, Italian-b rn Somali architect Omar Degan is re-examining the recent histories of a city ravaged by war."
  },
  {
    "headline": "MTN Nigeria Records $1.9bn Revenue in Q1 2021",
    "summarized_story": "MTN Nigeria o Saturday declared revenue of N790.3 billion (about $1.9bn), representing an increase of 24.1 per cent in its unedited half year results for the period that ended on June 30, 2021.\n“Voice revenue grew by 13.1 per cent, benefitting from an 11.8 per cent increase in traffic and our customer value management (CVM) initiatives.\n“Data revenue continued the positive momentum from H2 2020, rising by 48.3 per cent,” he explained.\nAccording to him, Fintech revenue rose by 48.2 per cent driven by increased adoption of Xtratime and the core fintech services.\nThis puts MTN Nigeria on the highest possible GCR scale for short-term and long-term ratings, providing a solid platform for growth.”According to him, 2021 would mark the 20th anniversary of MTN’s presence in Nigeria."
  },
  {
    "headline": "Burkina Faso Sees More Child Soldiers as Jihadi Attacks Rise",
    "summarized_story": "Guns slung over their small frames, the children chanted “Allahu akbar,” as they surrounded her home in Solhan town in Burkina Faso’s Sahel region.\nAs that violence increases, so too does the recruitment of child soldiers.\n“We are alarmed by the presence of children with armed groups,” said Sandra Lattouf, the representative for the United Nations Children’s Fund, or UNICEF, in the country.\nExperts on child recruitment say that poverty pushes some kids toward armed groups.\nAmid this raft of problems, Burkina Faso must now also figure out what to do with the children accused of being affiliated with armed groups."
  }
]