[
  {
    "headline": "UNILAG spokesperson refuses to comment on alleged killer of Super TV CEO",
    "summarized_story": "The Spokesperson for the University of Lagos, Nonye Oguama, has refused to comment on whether alleged killer, Chidinma Ojukwu, is indeed a student of UNILAG.\nOjukwu was paraded by the Lagos State Commissioner of Police, Hakeem Odumosu, for allegedly killing Chief Executive Officer, Super TV, Usifo Ataga, and stealing money from his bank account.\nDuring the parade, 21-year-old Ojukwu claimed to be a 300 level student of Mass Communications Department at UNILAG.\nWhen contacted by The PUNCH after the parade, the UNILAG spokesperson said she would not respond and slammed the media for publishing Ojukwu’s claim of being a UNILAG student.\nWhen challenged with the fact that the parade was a live broadcast, the UNILAG spokesperson remained adamant, insisting that the name of the institution should not have been mentioned."
  },
  {
    "headline": "BREAKING: Again, Buhari embarks on medical trip to London",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), will on Friday proceed to London for medicals.\nHis Special Adviser on Media and Publicity, Femi Adesina, disclosed this in a two-paragraph statement on Thursday.\nThe statement titled ‘President Buhari off to London Friday for medical follow-up,’ read, “President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\n“He is due back in the country during the second week of July 2021.”"
  },
  {
    "headline": "AfCFTA: Pan-African payment settlement system underway",
    "summarized_story": "PAPSS is a centralised payment and settlement market infrastructure for processing, clearing and settling of intra-African trade and commerce payments.\n“We have started a piloting phase of the Pan-African payment and settlement platform of six countries in West Africa who have switched on to the platform.\nBut with the payment and settlement system we have taken the first major step in addressing some of the challenges that are related to the cost of currency,” he noted.\nAccording to Mene, the way the six piloting countries understand the importance of the system to African economy is encouraging.\nAfreximbank is the operator and the main settlement agent for PAPSS and expected to provide settlement guarantee on the payment system as well as overdraft facilities to all settlement agents."
  },
  {
    "headline": "Rail transport generates N5.79bn from 2019 – NBS",
    "summarized_story": "Rail transportation in Nigeria generated N5.79 billion between 2019 and Quarter One of 2021 (Q1, 2021), the National Bureau of Statistics (NBS) has said.\nIt added that revenue generated from goods/cargo in Q1 2021 was put at N26.19 as against N82.57 in Q4 2020.\nFor goods/cargo, in 2019, N362.88 million was generated; in 2020, the sector derived N281.35 million and in Q1 2021, N26.19 million had been generated.\nHowever, for other receipts, N64.57 million was derived in 2019, N5.18 million in 2020 and N8.062 million in Q1, 2021.\nThe bureau said that rail transportation data for Q1 2021 reflected that 424,460 passengers travelled via the rail system in Q1 2021 as against 647,055 passengers recorded in Q1 2020 and 134,817 in Q4 2020."
  },
  {
    "headline": "South only seeking egalitarian nation, not war — PANDEF",
    "summarized_story": "By Davies Iheamnachor – Port HarcourtPan Niger Delta Forum, PANDEF, has said the interest of the South was to ensure that the country became an egalitarian nation where everyone was treated equally.\nThe National Publicity Secretary of PANDEF, Hon Ken Robinson, in Port Harcourt yesterday, described as unfortunate the claim by ACF that the south was trying to trigger war in the nation.\nFew days ago I heard they said they were trying to reach out for dialogue and then the next day they are saying the Southerners are trying to trigger war, how?\nWhat the south is asking for is that we have to be a country let’s be a country.\nLet us have an egalitarian nation where everybody will be treated equally."
  },
  {
    "headline": "We’ll sustain payment of troops in theatre of operations — COAS",
    "summarized_story": "The COAS gave the assurance while declaring open the Nigerian Army Finance Corps Warrant Officer/Senior Non-Commissioned training week for Warrant officers and Senior Non-Commissioned Officers training week 2021, at Nebo hall, Abati barracks, Ojuelegba Laos, yesterday.\nHe stated that for the Nigerian Army to remain competitive in the 21st century, it must continue to develop requisite skills and competences that would make it ever ready to achieve its constitutional mandate.\n“The Nigerian Army must of necessity be creative and improve its problem solving skill to be able to defeat all forms of adversaries, particularly non-state actors.\n“Expectedly, the \\warrant officers and senior non commissioned officers training is coming against the backdrop of a mirage of security challenges besetting our nation.\nRelevant topics have been carefully selected for deliberation to achieve the aim of the theme for this year’s training week."
  },
  {
    "headline": "APC LG Primaries: Protesters storm Sanwo-Olu’s office over alleged Imposition",
    "summarized_story": "He said: “The council chairman locked up the people that were supposed to conduct the primary in Somolu in his office.\nHe also alleged that Bowale Sosinmi, who is the consensus candidate, had been denied his mandate on three occasions, which he said included the one that occured few days to the 2017 local government election.\nInscription on some of the placards of the protesters read, “Somolu unite for Bowale”, “Enough is enough”, “No Bowale, No election”, “Dullar Must Go”, amongst others.\nHazmat said:”The Governor asked me to come and address you when he heard that the people of Somolu were protesting.\n“We had consensus in some Local Government Areas, while those whose candidates did not win, took to the streets to protest,” he said."
  },
  {
    "headline": "Buhari travels to London for medical checkup Friday",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, for a scheduled medical follow-up.\nFemi Adesina, Special Adviser on Media and Publicity to President Buhari, confirmed this in a statement on Thursday.\nAdesina said the President is expected return to the country in the second week of next month.\n“He is due back in the country during the second week of July, 2021,” the statement said.\nRecall that on Tuesday, March 30, 2021, Buhari had visited London to receive medical attention from his physician."
  },
  {
    "headline": "Buhari makes new appointments into Federal Housing Authority",
    "summarized_story": "President Muhammadu Buhari, Thursday, approved the constitution of the Board of Federal Housing Authority (FHA) for a period of three years.\nThe President also reappointed Sen. Lawal Shuaibu, Zamfara State, as Chairman of the board.\nOther members of the Board are: Modestus Umenzekwe, Anambra State; Mumini I. Hanafi, Kwara State; Adamu Maina Dadi, Yobe State; Eng.\nAdamu Ismaila, Adamawa State; Barr.\nZubairu S.N, Nasarawa State; Chinyere Anokwuru, Abia State; Yinka Ogunsulire, Ondo State: Veronica N. Shinnaan, Plateau State; Aleruchi Cookey-Gam, Rivers State and Olajumoke O. Akinwunmi, Ogun State."
  },
  {
    "headline": "Engineering body honours NCC for contribution to economic development",
    "summarized_story": "The Nigerian Academy of Engineering (NAE), one of the highest professional bodies in the engineering field in the country, has presented an award to the Nigerian Communications Commission (NCC) in recognition and appreciation of its support of the activities of the academy towards enhancing economic development.\nThe NAE is a not-for-profit and non-governmental organisation established for the purpose of promoting excellence in technological and engineering training and practice to ensure the technological growth and economic development in Nigeria.\nThe EVC, who spoke with the media shortly after receiving the recognition, said NCC is delighted to have been recognised for the modest contribution to the activities of the Academy and to the advancement of the nation’s economic development.\n“On behalf of the Board, Management and the entire staff of the Nigerian Communications Commission, I wish to express our appreciation to the Nigerian Academy of Engineering.\nThe event which was attended in strict compliance with COVID-19 safety protocols, had Prof. Sam Adefila, as the Guest Speaker."
  },
  {
    "headline": "Ogun Assembly probes N22bn special projects from 2015 to 2019",
    "summarized_story": "The Ogun State House of Assembly has asked the Office of the Accountant General to furnish it with details of the N22billion special projects and assignments carried out by the State Ministry of Special Duties from 2015 to 2019.\nThe Ogun House Committee on Public Accounts and Anti-Corruption led by Musefiu Lamidi, issued the directive while questioning some past and retired management staff of the ministry including some Permanent Secretaries and Directors, who served in the Ministry between 2013 and 2020.\nLamidi, on Thursday, called on the Accountant General to furnish the committee with documents like release warrant, payment vouchers, authorization invoice and receipts on the construction and provision of electricity which he said gulped N513,745,670.41 and was unknown to the officials in the ministry.\nThe committee sought the need for an improved working relationships between the offices of the Accountant General and the Auditor General to ensure seamless reconciliation of all accounts of MDAs on a monthly basis to aid accountability and transparency.\nHe added that the Ministry only received figures of expenditures at the end of every financial year with no supporting details from Office of the Accountant General which made it difficult to keep an up-to-date Department Vote Expenditure Account (DVEA)."
  },
  {
    "headline": "Be sincere, committed to end farmers, herders conflict in Nigeria",
    "summarized_story": "Fulani herdsmen under the auspices of Kulen Allah Cattle Rearers Association of Nigeria, (KACRAN), said famers/herders perennial conflict can be ended if federal government and other relevant stakeholders are sincere and committed to the course.\n“There is a serious need for supervision by government to make sure that the money allocated for the programme is expended judiciously.\nKACRAN’s National President urged federal government to take drastic action against anybody found wanting in sabotaging efforts in reclaiming the cattle routes and encroached grazing reserves.\nWe advise federal government should work hand to hand and related closely with Northern governments, traditional rulers/Chiefs who are the custodians of most of the Northern States free land.\n“State governments of the Northern states who are constitutionally said to be owners of all uncultivated lands be requested to give the programme maximum support and fullest co-operation for it success”."
  },
  {
    "headline": "LASU, Covenant make world’s ranking of top young varsities",
    "summarized_story": "By Kofoworola Belo-OsagieThe Lagos State University (LASU) and the Covenant University Ota have been listed among the top 475 young universities of the world.\nThe ranking by Times Higher Education (THE) features universities 50 years and younger using the same 13 performance indicators as the world rankings of university except for less weight on reputation.\nADVERTISEMENTAccording to THE website, the United Kingdom had 37 institutions on the ranking, which has Nanyang Technological University, Singapore in number one spot.\nIndia follows as the country with the second highest number of institutions on the ranking with 34 schools, while Spain is third with 33.\nLASU ranked higher than Glasgow Caledonian University (188th) Scotland; De Monfort University UK, Birmingham City University, UK (195); Oxford Brookes University (169th); University of Johannesburg (173); University of Northern British Columbia, Canada, among others."
  },
  {
    "headline": "Bandits kidnap 33, kill one, injure five in Southern Kaduna",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaOne person has been killed while 33 others were abducted as bandits attacked Kachia town in the southern part of Kaduna State on Wednesday night.\nKaduna Police Command had earlier confirmed the attack, stating the injured were receiving treatment at an undisclosed hospital.\nThe District Head of Kachia town, Sabiu Suleiman, confirmed that 33 persons were kidnapped during the attack.\nAccording to the District Head, the bandits broke into the town around 9:30pm on Wednesday and started shooting sporadically for more than an hour before security personnel could arrive.\nAccording to him: “27 persons were abducted from Awan Mother Cat junction in Kachia town, five persons were also abducted as the bandits raided a bakery."
  },
  {
    "headline": "We’re not borrowing to fund projects, says Wike",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers Governor Nyesom Wike has clarified his administration is not borrowing to execute projects in the state.\nWike said he would not borrow to complete the Trans-Kalabari Road, which connects Krakrama, Omekwe-ama, Angula-ama, Mina-ama and other communities in the Kalabari area.\nPeople are saying I’m borrowing money.\nIf I’m borrowing and doing the work, have I not done well?\n“But in any case, I am not borrowing money."
  },
  {
    "headline": "DSS detains, grills Osun ex-Councillor for allegedly maligning Governor",
    "summarized_story": "By Toba Adedeji, OsogboThe Directorate of State Services, (DSS) arrested an ex-councilor, Hon Tunde Boladale who served in Isokan Local Government Area, Osun State for maligning Governor Adegboyega Oyetola.\nThe Nation gathered that he was invited to the Command on Wednesday thereafter; he was detained and has not returned to his house.\nA political group within the All Progressives Congress (APC), Osun State, named The Osun Progressives (TOP), which the former governor of Osun State, Rauf Aregbesola chaired the Board of Trustees in a release claimed that Hon Boladale who ended his tenure in Isokan LGA was arrested for making derogatory remarks about the incumbent governor, Adegboyega Oyetola.\nADVERTISEMENTREAD ALSO: Uncertainty over invitation of Mbaka by DSS“A commissioner in the cabinet of Governor Oyetola had invited him meeting urging him to renounce his membership of the Osun Progressives (TOP).\nWhile denying making any statement against the Governor, Boladale affirmed his membership of TOP and unalloyed loyalty to Aregbesola who he said did a lot of good things that he appreciates.”The group condemned the arrest of the ex-councillor."
  },
  {
    "headline": "Breaking: Buhari off to London for medical checks",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujqPresident Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up, Presidency has said.\nAccording to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, is expected back in the country during the second week of July, 2021.\nBuhari was a way for two weeks between March 30th to April 16 for routine medical checks the Presidency has said."
  },
  {
    "headline": "Anambra Election: How Soludo emerged APGA candidate",
    "summarized_story": "FORMER governor of the Central Bank of Nigeria, CBN, Professor Charles Soludo has won the ticket of the All Progressives Grand Alliance, APGA, for the November 6 governorship election in Anambra State.\nFinal Results Of 2021 APGA Governorship Primaries indicates that Professor Soludo won the 2021 APGA governorship primaries overwhelmingly.\nResult SummarySoludo: 740 votesEzenwankwo: 41 votesOkolo: 7 votesIbeh : 4 votesLocal Government BreakdownAguata LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 44Anambra East LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 40Anambra West LGASoludo; 25Ezenwankwo; 1Anaocha LGA:Ezenwankwo 4.\nSoludo: 40Ibeh: 1Okolo: 1Awka North LGAEzenwankwo 4.\nSoludo: 29Ibeh: 0Okolo: 0Awka South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 46Ayamelum LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 28Dunukofia LGAEzenwankwo – 1Damian – NilIbe – 1Soludo – 32Ekwusigo LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 29Idemili North LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 29Idemili South LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 30Ihiala LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Njikoka LGAEzenwankwo – 2Damian – NilIbe – 1Soludo – 41Nnewi North LGAEzenwankwo – 2Damian – 5Ibe – NilSoludo – 19Nnewi South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Ogbaru LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 38Onitsha North LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 35Onitsha South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 40Orumba North LGAEzenwankwo – 4Damian – NilIbe – 1Soludo – 38Orumba South LGAEzenwankwo – 5Damian – NilIbe – NilSoludo – 37Oyi LGAEzenwankwo – 5Damian – NilIbe – 1Soludo – 30"
  },
  {
    "headline": "We’ve no hand in controversial media bills –Presidency",
    "summarized_story": "Adesina said that President Muhammadu Buhari has approved that the Second Peer Review Country Self-assessment Report should be done.\n“The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\n“Nigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\n“So, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "Anambra guber: Crisis in APGA, PDP’ll give us victory- APC",
    "summarized_story": "A leading pressure group, APC Patriots, Anambra has charged aspirants of the All Progressives Congress to close ranks in order for the party to win the November 6, 2021 gubernatorial election.\nSpeaking against the backdrop of intense crisis currently rocking the ruling All Progressives Grand Alliance, APGA and the People’s Democratic Party, PDD, the APC Patriots said that the discordant tunes emerging from both parties leaves the state open for APC to take.\nPart of its strategies included the April 27, 2021 Interactive Session which it convoked at the Transcorp Hilton, Abuja.\nThe event was attended by Vice President Yemi Osinbajo, all the aspirants, ministers, and leading political figures from the South east, including former Senate President, Ken Nnamani.\nAt that epochal event, the aspirants had pledged to go about seeking the party’s ticket in an atmosphere of camaraderie – a pledge, which the APC Patriots noted they have sustained till date."
  },
  {
    "headline": "N37bn NASS renovation budget: We’re vindicated –Lawan",
    "summarized_story": "From Fred Itua, AbujaSenate President, Ahmad Lawan, has said the reported roof leakage at the National Assembly has vindicated its request for the approval of N37 billion for the renovation of the complex.\nIt obstructed Senate plenary sessionIn his remarks, Lawan said media reports that the money had been approved and siphoned by the leadership of the National Assembly was false.\n“The fact that there was a leakage, to me it is a clear testimony, confirmation and vindication of the position the National Assembly took initially.\n“For emphasis, when we approved the budget of N37 billion for the rehabilitation of this complex, it was not a National Assembly budget, it was an FCDA budget, we have nothing to do with this,’’ Lawan said.\nThe National Assembly approved the N37 billion in the 2020 budget."
  },
  {
    "headline": "Away Goals Rule Scrapped in Uefa Competitions Including Champions League",
    "summarized_story": "The away goals rule in European club football is to be abolished from the start of next season, governing body Uefa has confirmed.\nThe rule, used since 1965, decided drawn two-legged games by favouring the team that scored the most away goals.\n“It is no longer appropriate for an away goal to carry more weight,” said Uefa president Aleksander Ceferin.\nIt means games in the Champions League, Europa League, Europa Conference League and Women’s Champions League will no longer use the rule.\n“There is also criticism of the unfairness, especially in extra-time, of obliging the home team to score twice when the away team has scored."
  },
  {
    "headline": "Buhari Returns to London Friday for Medical Check-up",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari will on Friday travel to London, the United Kingdom for a scheduled medical follow-up.\nAccording to a two-paragraph statement issued on Thursday by presidential spokesman, Femi Adesina, the President is due back in the country in the second week of July, 2021.\nThis is the second medical trip of the President to London within four months as he had earlier gone on medical check up to the UK from March 30 to April 16, this year.\nDetails later…"
  },
  {
    "headline": "How 21-year-old UNILAG Undergraduate Allegedly Murdered SuperTV Boss",
    "summarized_story": "By Chiemelie EzeobiA 21-year-old undergraduate of University of Lagos (UNILAG), Chidinma Adaora Ojukwu, has been arrested for the murder of Chief Executive Officer of Super TV, and a Director in Super Network Limited, Michael Usifo Ataga.\nAt the parade of the suspect, the state Commissioner of Police, Hakeem Odumosu, saidfollowing investigation, the suspect was picked up at her parent’s home.\nAccording to him, the suspect had conspired with others, now at large, to murder Ataga.\nOthers include one National Identification Card bearing the suspect’s name, one UBA ATM debit card bearing the suspect’s name and oneUniversity of Lagos ID card bearing the suspect’s name.\nHowever, the murder weapon- a knife, was still missing as the suspect confessed that she disposed of it in a dustbin near her house."
  },
  {
    "headline": "Chidoka: Quota System, Federal Character should not Be Elevated over Merit",
    "summarized_story": "By Michael OlugbodeA former Minister of Aviation, Osita Chidoka, has said the need to ensure that the rule concerning federal character and quota system is enforced in employment and promotion in civil and public service should not be elevated over merit.\nHe said something needed to be done in this regard to allow for progress in the nation’s civil service structure and subsequently make Nigeria to work.\nThe system is not working as effectively or efficiently as it should, the system is failing.\nHe said: “The Government of Nigeria goes fishing in non-public sector waters for talents to drive such results.\nMany Nigerians who ‘cross over’ from civil society and private sector organizations to work in government have challenges adjusting to public service realities and demands."
  },
  {
    "headline": "Osinbajo: Insecurity will Soon Become History in Nigeria",
    "summarized_story": "Says all hands on deck to secure the countryBy Deji ElumoyeVice-President Yemi Osinbajo has expressed optimism that the current security challenges facing Nigeria will soon become a thing of the past.\n“Any country with this number of security challenges must respond as robustly as possible.\nOsinbajo expressed happiness that the traditional ruler has a committee in place in his domain organised for the purpose of tackling insecurity “and that you’ve been able to contain the menace that we see in different parts of the country in your community”.\nWe want to assure you that we are very much in support of you.\nFrom our own end, we are doing a lot to ensure that the menace of insecurity will not remain in our domain.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Again, Buhari To Visit UK For Medical Check-up Friday",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, UK, for a medical check-up.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had reportedly damaged furniture in his office.\nIn 2020, Buhari had not minimised his foreign medical trips to the impact of the COVID-19 pandemic and the global lockdown and strain on medical facilities."
  },
  {
    "headline": "BREAKING: Again, Buhari To Visit UK For Medical Check-up Friday",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, UK, for a medical check-up.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had reportedly damaged furniture in his office.\nIn 2020, Buhari had not minimised his foreign medical trips to the impact of the COVID-19 pandemic and the global lockdown and strain on medical facilities."
  },
  {
    "headline": "UPDATE: How Borno School Suspended 30 Nursing Students For Not Welcoming Buhari During President's Visit",
    "summarized_story": "At least 30 students have been suspended by the management of the Borno State College of Nursing and Midwifery for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\nSee Also Human Rights Borno Nursing School Suspends Student For Not Welcoming Buhari During President's Visit“Thirty of the students were suspended, not one.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit."
  },
  {
    "headline": "UPDATE: How Borno School Suspended 30 Nursing Students For Not Welcoming Buhari During President's Visit",
    "summarized_story": "At least 30 students have been suspended by the management of the Borno State College of Nursing and Midwifery for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\nSee Also Human Rights Borno Nursing School Suspends Student For Not Welcoming Buhari During President's Visit“Thirty of the students were suspended, not one.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit."
  },
  {
    "headline": "'Your Nepotism Is Cancerous, Killing Tertiary Schools In Delta'— Group Tells Governor Okowa",
    "summarized_story": "A pressure group known as Isoko Monitoring Group (IMG) Worldwide has berated Delta state governor, Ifeanyi Okowa, over his management of the tertiary schools in the state.\nThe group accused the governor of \"nepotism and clannishness\", describing it as \"cancerous\".\nThe communiqué, titled: \"Neglect Of Delta State University, Oleh Campus And The Poor Development Of Delta State University Of Science And Technology Ozoro Unacceptable\", was signed on behalf of the group by Kingsley Oroh.\nThe statement said, \"We wish to express our total dissatisfaction at the manner with which the Delta State Governor, His Excellency, Sen. (Dr.) Ifeanyi Arthur Okowa is piloting the affairs of our dear state, especially as it affects the development of tertiary institutions in Delta state.\n\"And kill all tertiary institutions in Delta state, especially Oleh Campus and University of Science and Technology, Ozoro in favour of his hometown, Owa-Alero Campus and University of Delta, Agbor."
  },
  {
    "headline": "UNILAG student who 'killed' Super TV CEO says he forced sex on her",
    "summarized_story": "Chidinma Ojukwu, the 21-year-old student of the University of Lagos (UNILAG), who confessed to stabbing Usifo Ataga, the CEO of Super TV, says he forcefully had sex with her.\nOn Thursday, Hakeem Odumosu, the Lagos police commissioner, while announcing the arrest of Chidinma, who is a 300-level Mass Communication student at UNILAG, said that the suspect had confessed to stabbing Ataga.\nShe alleged that the businessman had forced sex on her the first time but a dispute ensued after he attempted it again.\nWATCH: 21-year-old UNILAG student, Chidinma, confesses to the murder of Super TV CEO, Usifo Ataga.\nHe also revealed that the owner of the apartment rented out to the late Super TV CEO had since been arrested and was in police detention."
  },
  {
    "headline": "UNILAG student who 'killed' Super TV CEO says he forced sex on her",
    "summarized_story": "Chidinma Ojukwu, the 21-year-old student of the University of Lagos (UNILAG), who confessed to stabbing Usifo Ataga, the CEO of Super TV, says he forcefully had sex with her.\nOn Thursday, Hakeem Odumosu, the Lagos police commissioner, while announcing the arrest of Chidinma, who is a 300-level Mass Communication student at UNILAG, said that the suspect had confessed to stabbing Ataga.\nShe alleged that the businessman had forced sex on her the first time but a dispute ensued after he attempted it again.\nWATCH: 21-year-old UNILAG student, Chidinma, confesses to the murder of Super TV CEO, Usifo Ataga.\nHe also revealed that the owner of the apartment rented out to the late Super TV CEO had since been arrested and was in police detention."
  },
  {
    "headline": "Buhari to travel to London for 'medical follow-up'",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, the United Kingdom, for a “scheduled medical follow-up”.\n“President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up,” Adesina said in the statement released on Thursday.\n“He is due back in the country during the second week of July, 2021.”AdvertisementAs president, Buhari has spent 183 days getting medical help in the UK.\nThis is the president’s second medical vacation in 2021.\n“President Buhari is not a medical tourist — if somebody has kept retainership with medical experts; we are talking about 30 years and plus."
  },
  {
    "headline": "Buhari to travel to London for 'medical follow-up'",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, the United Kingdom, for a “scheduled medical follow-up”.\n“President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up,” Adesina said in the statement released on Thursday.\n“He is due back in the country during the second week of July, 2021.”AdvertisementAs president, Buhari has spent 183 days getting medical help in the UK.\nThis is the president’s second medical vacation in 2021.\n“President Buhari is not a medical tourist — if somebody has kept retainership with medical experts; we are talking about 30 years and plus."
  },
  {
    "headline": "CLOSE-UP: Odebunmi, the Oyo rep and 'product of godfatherism' behind NPC, NBC amendment bills",
    "summarized_story": "A barrage of criticism has trailed the move by the house of representatives to amend the laws establishing the Nigeria Press Council (NPC) and Nigeria Broadcasting Commission (NBC).\nBut what many citizens do not know is that Olusegun Odebunmi, a lawmaker from Oyo state, is the arrowhead behind both bills.\nAdvertisementWhile the proposed amendment to the NBC law seeks to put online broadcasters under the purview of the commission, that of the NPC seeks “harsh punishment” for defaulting media organisations and journalists.\nHe enrolled at the Baptist Secondary Grammar School, Oko, in Oyo, where he obtained his secondary school certificate.\nPRODUCT OF GODFATHERISMIn a 2019 interview with City People, Odebunmi said he is a product of godfatherism and that he respects godfathers."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "MTN plans to invest $1.5 billion to boost broadband access in Nigeria",
    "summarized_story": "South Africa-based telecommunications company, MTN, has revealed plans to invest ₦640 billion ($1.5 billion) over the next three years to increase broadband penetration in Nigeria.\nThe announcement was made by MTN Group President, Ralph Mupita, during his team’s visit from South Africa to Nigeria.\nOther members on the team were Tsholo Molefe, MTN Group Chief Financial Officer; Ernest Ndukwe, MTN Nigeria Chairman; and MTN Nigeria CEO, Karl Toriola.\nIf all goes as planned, the investment by the telecom giant will go a long way in improving Internet affordability in the country.\nAdvertisementIndeed, Nigeria has a long way to go if 90% of the populace will access fast and affordable Internet by 2025."
  },
  {
    "headline": "The unique case of Africans with learning disabilities and assistive technology",
    "summarized_story": "Perhaps, Mary typifies the average African who is unaware of what learning disabilities are or doesn’t know enough of assistive technology to get it.\nIn a 2018 fact sheet, WHO describes how technology is helping people with learning disabilities to live healthily, independently, productively.\nLearning disabilities do not affect intelligence but impair one or more cognitive processes related to learning.\nHowever, AT has been proven to improve learning for children with learning disabilities, as reflected in this research where students with learning disabilities used Dragon — a speech-to-text tool — for dictations.\nThe result revealed a significant impact, proving that assistive technology eliminates barriers based on learning disabilities."
  },
  {
    "headline": "Wimbart launches third edition of PR Office Hours",
    "summarized_story": "Early-stage African tech start-ups can now apply for the three-month comms programmeWimbart, the Public Relations agency specialising in Africa & emerging markets, returns with the launch of its third PR Office Hours programme.\nWimbart Office Hours is targeted at early-stage startups and with a focus on companies building tech solutions for Africans on the continent or the Diaspora.\nThe team behind the Wimbart Office Hours programme will work with Cohort three to build a broader understanding of how PR and communications should be an integral part of early-stage tech start-ups’ planning and growth, helping them to realise their vision as they scale.\nWimbart Office Hours alumni from cohorts one and two include Afriktrip, Nuguvu Health and Vybe, amongst others.\nMúyìwá Mátùlúkò, CEO of Techpoint Africa says, “Techpoint are very happy to be a part of Wimbart Office Hours for the second time running."
  },
  {
    "headline": "Soludo in the footstep of technocrats turned politician",
    "summarized_story": "Soludo has remained a respected economic policy authority in Nigeria since leaving the CBN, credited as the only CBN governor in recent times to ensure a single-digit inflation rate for 24 consecutive months.\nA third quarter 2020 data from the National Bureau of Statistics (NBS) showed that Anambra State had the lowest unemployment rate in Nigeria.\nSpeaking recently, while declaring his ambition, Soludo had said he hoped to leverage his international connections to transform the state.\nSpeaking on the exercise, Anambra State governor, Willie Obiano, described the conduct of the primaries as most peaceful, free, fair and transparent.\nSoludo joined the Federal Government in 2003, and became the CBN governor from May 2004 to 2009."
  },
  {
    "headline": "Fintech firms to prioritise access to credit to deepen inclusion",
    "summarized_story": "Most digital banking solutions focus more on payment services while the availability of credit receives little attention when it comes to digitised banking.\nErgo, players in the Fintech space are making a call toward the digitisation of credit to boost the economy.\nIn line with the central topic, stakeholders were urged to transform credit through digital optimisation as it would foster equal access to credit facility to everyone, especially those at the bottom of the pyramid.\nDigital lending is seen as the process of offering loans that are applied for, disbursed, and managed through digital channels.\nThe chairman of CeBIH Adeyemi Atanda said he believes that availing credit is one of the major avenues to drive economic empowerment."
  },
  {
    "headline": "Airlines lose N26bn on Dubai flights ban",
    "summarized_story": "Airlines operating between Nigeria and Dubai have lost N26 billion in the past 19 weeks since the UAE government stopped flights from Nigeria.\nPrior to the ban, Dubai was one of the top destinations visited by Nigerians, but many Nigerians are opting for Cairo, Egypt and Turkey for summer holidays and tourism.\nBusinessDay’s analysis based…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Ease of doing business: FG assures states support on reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Federal Government on Thursday assured states of its support in the development of their respective reform action plans to drive the nation’s ease of doing business ranking.\nDr Jumoke Oduwole, Special Adviser to President Muhammadu Buhari on Ease of Doing Business, made the pledge at the Lagos Chamber of Commerce and Industry (LCCI) Roundtable on Ease of Doing Business.\nOduwole said that the Presidential Enabling Business Environment Council (PEBEC) undertook an Ease of Doing Business (EoDB) Subnational Baseline Survey.\nShe said it would serve to provide status report on the current attractiveness of states business climates for small and medium sized enterprises (SMEs).\nOduwole said that homegrown indicators for states surveyed were infrastructure and security, transparency and access to information, regulatory environment and skills, and workforce readiness."
  },
  {
    "headline": "Osinbajo says FG eager to strengthen military, security agencies’ capacities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo says the recent supplementary budget sent to the National Assembly is part of Federal Government’s efforts to enhance the capacity of the military and other security agencies.\nThe vice president said that the Federal Government was beefing up its response to the nation’s security challenges.\nOsinbajo’s spokesman Laolu Akande said the vice president gave the hint when he received on a courtesy visit at the Presidential Villa, Abuja, the Oluyin of Iyin- Ekiti, Oba Adeola Ajakaiye.\nOsinbajo said that traditional rulers, local and state governments must also collaborate with the Federal Government in tackling insecurity.\n“We have to keep looking at how to support our security services to ensure that our country is safe."
  },
  {
    "headline": "Buhari departs for London for medical follow-up Friday – Nigerian Observer",
    "summarized_story": "Buhari departs for London for medical follow-up FridayShare FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari will proceed to London, the United Kingdom on June 25, for a scheduled medical follow-up.\nMr Femi Adesina, the President’s spokesman confirmed this in a statement in Abuja on Thursday.\n“He is due back in the country during the second week of July, 2021,’’ the presidential aide stated.\nThe News Agency of Nigeria (NAN) reports that the president returned from his previous medical trip to London in April."
  },
  {
    "headline": "Obaseki recommits to Universal Health Coverage, as Edo enrolls over 35,129 persons into Insurance Scheme – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is committed to strengthening the health care system and implementing a sustainable healthcare financing mechanism in the state.\nObaseki, who spoke in Benin City during a parley with healthcare providers, said his administration has undertaken pragmatic reforms and programmes to ensure the attainment of Universal Health Coverage for Edo Residents.\nThe governor, represented by Secretary to the State Government, Osarodion Ogie, Esq., disclosed that the state through the Edo State Health Insurance Commission has, since August 2019 when the commission was established, enrolled 35,129 persons into its Health Insurance Scheme.\n“Right from the inception of my administration, it has been a top priority for our government to make sure that access to healthcare by residents in the State is no longer exclusive to the wealthy and privileged.\nIndeed, health is a fundamental right and all Edo residents should have access to healthcare without having to worry about the financial burden."
  },
  {
    "headline": "UPDATED: Again, Buhari jets to London for medical reasons",
    "summarized_story": "ADVERTISEMENTNigeria’s President Muhammadu Buhari will proceed to London on Friday for what his office described as a ‘scheduled medical follow-up.’The Nigerian leader and members of his family routinely travel to the UK for medical treatment amidst the insufficient and poorly equipped hospitals in the oil-rich country.\nDespite public criticisms of his previous trips, including one at a period doctors in Nigeria were on strike, the Nigerian leader, who has spent six years in office, appears unperturbed by what critics have described as medical tourism.\n“He is due back in the country during the second week of July, 2021,’’ the presidential aide stated; indicating the Nigerian leader will spend about two weeks in London for the medical attention.\nThe president returned from his last medical trip to London in April.\nBefore the April trip, Mr Buhari had also gone to London for medical checkup in May 2018."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BREAKING: Buhari Off To London For Medical Follow-up",
    "summarized_story": "President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up that will last three weeks.\nAdvertisementsThis is disclosed in a terse statement by presidential spokesman, Femi Adesina, on Thursday.\nHe said the President is due back in the country during the second week of July, 2021."
  },
  {
    "headline": "BREAKING: Buhari Off To London For Medical Follow-up",
    "summarized_story": "President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up that will last three weeks.\nAdvertisementsThis is disclosed in a terse statement by presidential spokesman, Femi Adesina, on Thursday.\nHe said the President is due back in the country during the second week of July, 2021."
  },
  {
    "headline": "ICPC, NOA Partner Stakeholders On Ethics, Integrity Policy Implementation",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) and the National Orientation Agency (NOA), have urged stakeholders to key into the new national ethics and integrity policy to curb corruption in the country.\nOwasanoye said that the National Ethics and Integrity Policy seeks to promote societal core values of human dignity, patriotism, personal responsibility, integrity, national unity and professionalism.\nAccording to him, ICPC, in collaboration with the office of the Secretary to the Government of the Federation and the NOA initiated the National Ethnics and Integrity Policy.\nADVERTISEMENT“The essence of this gathering is to intimate you on your roles as critical stakeholders in the implementation of the National Ethics and Integrity Policy.\nAbari said that NOA in collaboration with ICPC was determined to drive the new ethics and integrity policy to its citizens with the view of changing the narratives that has tended to portray the nation and its citizens in bad light."
  },
  {
    "headline": "ICPC, NOA Partner Stakeholders On Ethics, Integrity Policy Implementation",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) and the National Orientation Agency (NOA), have urged stakeholders to key into the new national ethics and integrity policy to curb corruption in the country.\nOwasanoye said that the National Ethics and Integrity Policy seeks to promote societal core values of human dignity, patriotism, personal responsibility, integrity, national unity and professionalism.\nAccording to him, ICPC, in collaboration with the office of the Secretary to the Government of the Federation and the NOA initiated the National Ethnics and Integrity Policy.\nADVERTISEMENT“The essence of this gathering is to intimate you on your roles as critical stakeholders in the implementation of the National Ethics and Integrity Policy.\nAbari said that NOA in collaboration with ICPC was determined to drive the new ethics and integrity policy to its citizens with the view of changing the narratives that has tended to portray the nation and its citizens in bad light."
  },
  {
    "headline": "Delta PDP: My Purported Suspension Unconstitutional, Can’t Stand, Says Nwaoboshi",
    "summarized_story": "The Senator representing Delta North in the National Assembly, Peter Nwaoboshi, on Thursday, said his purpoted suspension from the Peoples Democratic Party (PDP) was unconstitutional and can’t stand.\nAdvertisementsLEADERSHIP reports that Senator Nwaoboshi was reportedly suspended on Wednesday by the Delta State Working Committee of the PDP.\nBut reacting to the suspension on Thursday, the Senator said the State Working Committee of the party can’t suspend him in gross disregard for the constitution of the federal republic of Nigeria.\nAccording to Nwaoboshi, the PDP 2017 constitution as amended, chapter 10, article 57(7), page 99 incapacitated the working committee from suspending him.\nAdvertisements“By the provisions, the State Working Committee has demonstrated complete undemocratic and anti-constitutional behaviour which has rendered their uncharitable pronounced action purportedly suspending Nwaoboshi as null and void and of no consequence whatsoever."
  },
  {
    "headline": "Justice inhabits people’s hearts, and lies will eventually be exposed — Daily Times Nigeria",
    "summarized_story": "Meanwhile, it opposed double standards or politicization of human rights issues, groundless accusations against China based on disinformation or political purposes, and making use of human rights as an excuse to interfere in China’s domestic affairs.\nAside from the 65 countries, six countries from the Gulf Cooperation Council sent a message to support China, and more than 20 countries delivered separate speeches to support China.\nIronically, these Western countries that have acted as self-styled judges of human rights have a poor record of human rights issues, which were discussed and criticized by many countries at the UNHRC.\nThe U.S., the so-called “beacon of human rights”, seems to have always made irresponsible remarks about the human rights situation in other countries, but turned a blind eye to its own problems.\nSince it was founded 100 years ago, the CPC has made its mission striving for people’s human rights and freedom."
  },
  {
    "headline": "Ex-Super Eagles Striker, Ighalo Appointed National Principal’s Cup Ambassador",
    "summarized_story": "Former Super Eagles striker Odion Ighalo has been named the resurrected National Principal Cup’s Ambassador.\nHe stated that the next edition of the revitalized National Principal Cup will feature 2700 secondary schools from around the country.\nSani Lulu, the former president of the Nigeria Football Federation (NFF), owned FOSLA Academy of Karshi, which won the maiden edition of the resurrected Principal Cup 27 years after it was abandoned.\nIghalo’s responsibility as the Cup’s ambassador, according to Dare, will be to travel across the country to witness the Principal Cup matches, inspire the players, and help find talented youngsters.\nWith his appointment, Ighalo has joined the ranks of Daniel Amokachi, Segun Odegbami, Mary Onyali, Tunde Disu, and other National Principal Cup ambassadors."
  },
  {
    "headline": "Eschew differences among yourselves to help end insecurity, Assembly Speakers urges Northern Governors",
    "summarized_story": "By Samuel LukaThe Northern Speakers Forum has called on their Governors to eschew any form of differences among themselves with a view surmounting the menace of insecurity in the region.\nAs Signed by the Chairman of the Communique Drafting Committee Chairman, the Speaker of the Bauchi state Assembly, Rt.\nHonourable Sulaiman Abubakar and two other members, the Forum commended the Chairman Northern Speakers’ Forum, Rt Hon Yusuf Ibrahim Zailani for initiating and hosting the meeting aimed at addressing insecurity in the region.\n“The Forum calls on all the Executive Governors in the Northern Nigeria to eschew differences among them and unite to fight the menace of different forms of insecurity in the North”, the Communique said.\n“The Forum wants budget preparation to skew in favour of security of lives and property."
  },
  {
    "headline": "Buhari off to London Friday, for medical follow-up",
    "summarized_story": "Buhari off to London Friday, for medical follow-upBuhari off to London Friday, for medical follow-upBy CHIKA CHIMEZIEPresident Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\nHe is due back in the country during the second week of July, 2021.\nFemi AdesinaSpecial Adviser to the President(Media and Publicity)June 24, 2021Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari off to London Friday, for medical follow-up",
    "summarized_story": "Buhari off to London Friday, for medical follow-upBuhari off to London Friday, for medical follow-upBy CHIKA CHIMEZIEPresident Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\nHe is due back in the country during the second week of July, 2021.\nFemi AdesinaSpecial Adviser to the President(Media and Publicity)June 24, 2021Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Enugu Student Bags Two Years for Fraud",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC Enugu Zone today June 24, 2021 secured the conviction of one Osondu Kevin Nnamere before Justice I .M Buba of the Federal High Court sitting in Enugu, on a one count charge bordering on Criminal impersonation with the intent to defraud.\nThe defendant was arrested in a sting operation at the Independence Layout area of Enugu on Saturday June 4, 2021 following credible intelligence received on his alleged involvement in computer-related fraud.\nThe defendant’s counsel, E.M Ugwu pleaded with the judge to temper justice with mercy on the grounds that his client is a 21 year-old student who has become remorseful.\nJustice Buba convicted and sentenced Nnamere to 2years imprisonment with an option of N250,000 ( Two Hundred and Fifty Thousand Naira) fine.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Enugu Student Bags Two Years for Fraud",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC Enugu Zone today June 24, 2021 secured the conviction of one Osondu Kevin Nnamere before Justice I .M Buba of the Federal High Court sitting in Enugu, on a one count charge bordering on Criminal impersonation with the intent to defraud.\nThe defendant was arrested in a sting operation at the Independence Layout area of Enugu on Saturday June 4, 2021 following credible intelligence received on his alleged involvement in computer-related fraud.\nThe defendant’s counsel, E.M Ugwu pleaded with the judge to temper justice with mercy on the grounds that his client is a 21 year-old student who has become remorseful.\nJustice Buba convicted and sentenced Nnamere to 2years imprisonment with an option of N250,000 ( Two Hundred and Fifty Thousand Naira) fine.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "23-Yr-Old UNILAG Student Reveals How, Why She Killed Super TV CEO",
    "summarized_story": "Chidinma Adaora Ojukwu, a 21-year-old University of Lagos 300-level student who was previously detained by the Lagos State Police Command, has admitted to stabbing her lover, Super TV CEO Mr Usifo Ataga, to death.\nShe admitted to stabbing the dead after he made sexual contact with her.\nDuring their stay in a short-let flat in Lagos, the Unilag undergraduate student claimed she attacked and stabbed Mr Ataga to death.\nAccording to Chidinma Adaora, “I stabbed him on his neck twice and later on his stomach after he had forcefully had sex with me initially.”“I was tired and exhausted and wanted to sleep but Mr Michael won’t have any of that.\n“He became very violent and tried choking me to death.”The suspect was paraded at the Lagos State Police Command Headquarters in Ikeja on Thursday, according to NEWS DIRECT."
  },
  {
    "headline": "BREAKING: Buhari Off To London For Yet Another Medical Trip",
    "summarized_story": "President Muhammadu Buhari will be on the road again to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\nRecall that President Buhari had on March 30 departed Abuja for London, United Kingdom, for routine medical check-up.\nNigeria’s main opposition party, PDP, has continued to lash at the President, saying his medical trip abroad was a direct indictment of his presidency over its failure to fix the country’s healthcare system.\nIn a statement by its spokesperson, Kola Ologbondiyan, the PDP said it was worrisome that under Mr Buhari, even the highly-rated State House Clinic had become moribund that it could not provide medical check-up for the president.\nThe opposition party said although it had nothing against any person, including Mr Buhari seeking medical services abroad, it was worried that “the Buhari presidency is taking no decisive steps to fix our healthcare system, ostensibly because Mr President can afford overseas medical treatment at taxpayers’ expense.”"
  },
  {
    "headline": "BREAKING: Kogi Ex-lawmaker Hotel Guests Kidnapped In Abuja",
    "summarized_story": "The abductors of Frederick Adejoh, a prince of Igala in Kogi, are being sought by police in the Federal Capital Territory.\nOn Thursday, assailants attacked the Tungan Maje village along the Zuba-Gwagwalada route.\nThe victims were abducted from a hotel in Tungan Maje, Abuja’s Zuba neighborhood.\nMakama, Adejoh, a hotel owner, and an unspecified number of other guests, including politicians, are still missing.\n“The armed men shot sporadically into the air to scare away the security men on guard before kidnapping the hotel owner and guests”, a security source told PRNigeria."
  },
  {
    "headline": "Kogi Lawmaker Makama, Others Kidnapped By Gunmen From Abuja Hotel",
    "summarized_story": "Gunmen kidnapped an unspecified number of people from an Abuja hotel, including Friday Sani Makama, a two-term former member of the Kogi State House of Assembly.\nThe attack took place in the early hours of Thursday, when heavily armed men stormed the Hilltop hotel in Tugun Maga village, in the FCT’s Zuba area.\nAccording to Kogiflame, the hotel manager made a distress call to a family member related to Makama, Prince Frederick Adejoh (Oma Onu Aya), and others, claiming they had been kidnapped.\nThe armed men fired erratic shots into the air to frighten the security guards and grabbed the hotel owner and guests.\nThe hotel is located in Tunga Maje, which is renowned for gunman attacks on the Abuja-Kaduna expressway."
  },
  {
    "headline": "Breaking: Again, Buhari heads to London for medical trip",
    "summarized_story": "President Muhammadu Buhari would be departing Nigeria for London on Friday, in what the Presidency, said was a scheduled medical trip.\nThe President’s spokesman, Femi Adesina, announced the development, in a terse, two-paragraph statement, on Thursday, informing that the President was due back to the country in the second week of July.\nThe statement read: “President Muhammadu Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\n“He is due back in the country during the second week of July, 2021.”"
  },
  {
    "headline": "Breaking: Chaos in PDP as Court stops delegates’ list ahead Anambra guber primaries",
    "summarized_story": "Justice Adeniyi also rejected the request by the PDP and two of its chieftains – Chief Ndubisi Nwobu and Barr.\nHe said: “The first applicant (the PDP), which is the principal party, has maintained in the face of this court that its judgment is null and void for want of jurisdiction.\nThe same party cannot, at the same time, seek equitable reliefs from the same court.\nI there say that no court worth its authority will grant any such application, no matter how well presented and argued,” Justice Adeniyi said.\nThe judge agreed with the plaintiff/claimant that the PDP violated its constitution in the conduct of the Southeast zonal congress of March 6, 2021 and the appointments made therein."
  },
  {
    "headline": "Breaking: Police nab, parade ‘killer’ of Super TV CEO",
    "summarized_story": "A 21-year-old undergraduate of the University of Lagos, simply identified as Chidinma was on Thursday paraded before the public by the Lagos State Police Command, at their headquarters in Lagos, for allegedly killing the Chief Executive Officer, Super TV, Usifo Ataga, in the Lekki area of the state.\nCommissioner of Police, Hakeem Odumosu, informed that the suspect, said to be the mistress of the deceased, whose wife lives in Abuja, had since confessed to committing the crime, which shook the social media last week.\nThe owner of the rented apartment, which Ataga, who lived at the prestigious Banana Island in Lagos, was said to have rented for their secret affair, and where the tragic incident took place had also been arrested and detained over the matter.\nDetails loading…"
  },
  {
    "headline": "Buhari supported #EndSARS movement, says NYCN -NigPilot",
    "summarized_story": "Contrary to popular view that the federal government opposed the #EndSARS movement, the National Youth Council of Nigeria, NYCN, has said President Muhammadu Buhari supported the movement through his actions.\n“We hereby call on all youths to support President Buhari who has shown uncommon love for the youth.\nThe President swiftly disbanded SARS when the youths took to the streets to protest.\nTruly President Buhari ended SARS before anarchy took over the movement.\nNYCN while commending the media for its role in uniting the nation, dismissed calls calling for scrapping of the NYSC scheme."
  },
  {
    "headline": "Senate , FCT Disagree on AGIS Status -NigPilot",
    "summarized_story": "The Senate and authorities of the Federal Capital Territory Administration ( FCTA) , disagreed Thursday on what the actual status of Abuja Geographic Information Systems ( AGIS) , should be in the face of legal instrument being worked upon by the upper legislative chamber .\nDisagreement over the status of AGIS came to the fore at the public hearing organised by the Senate Commitee on Federal Capital Territory ( FCT, Abuja ) on bills seeking legal backing for the Federal Capital Territory College of Nursing and Midwifery and the one seeking for an Act to Establish the Abuja Geographic Information Systems .\nSenator Gusau had in his presentation as sponsor of the bill on AGIS said the Unit needed to be made a full fledged agency backed with law.\nBut in his submission, the Minister of FCT, Mallam Muhammad Musa Bello , said AGIS should be left the way it is now .\nThe Minister however commended the Senate on the move to give the FCT College of Nursing and Midwifery , required legal instrument ."
  },
  {
    "headline": "Insurgency: COAS task soldiers to redouble effort in Southeast -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Maj Gen Farouk Yahaya , has tasked troops in the Southeast to redouble their effort in order to consolidate on their successes in curtailing insurgency in the zone.\nThe COAS expressed delight in the successes so far recorded by the troops in the Southeast.\nGen Yahaya gave this task at Obinze Barracks, Owerri Imo state while addressing the troops during his maiden operational visit to Headquarters 34 Brigade.\nHe pointed out, that more successes would be recorded through compliance to instructions and loyalty to a superior authority.\nHe appreciated them for their spirit of jointness and synergy towards tackling insecurity in the state."
  },
  {
    "headline": "We would not condone reckless comments, Army replies Gumi -NigPilot",
    "summarized_story": "The Nigerian Army on Wednesday evening warned Sheik Ahmad Gumi to desist from reckless comment capable of causing disaffection or dampening the morale of troops as it would not condone such extreme comments.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu gave this warning in a statement in Abuja.\nHe said: “The Nigerian Army has just been alerted to a submission by Sheikh Ahmad Abubakar Gumi when he featured on ARISE TV Morning Show on Wednesday, 23 June 2021 alleging that the Nigerian Military is colluding with marauding bandits who have been responsible for various crimes and atrocities against Nigerians and the Nigerian state.\nIt is also necessary to reiterate that patriotism must be taken to a trajectory where subversive conversations on the state are brought to the barest minimum.\n“Opinion leaders are enjoined to demonstrate patriotism in building the peace, rather than being agents of distabilization, thereby aggravating the current security challenges facing the nation”."
  },
  {
    "headline": "Buhari To Embark On Medical Trip To London",
    "summarized_story": "President Muhammadu Buhari will travel to London, the United Kingdom on Friday, the Presidency has said.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, disclosed this in a statement on Thursday in Abuja.\nHe explained that the President’s trip to London was for a scheduled medical follow-up, adding that he would be back in the country during the second week of July.\nPresident Buhari’s scheduled trip to London comes almost three months since he last visited the United Kingdom for the same purpose.\nHe had travelled to the United Kingdom on March 30 for a routine medical check-up, as indicated in a statement by his media adviser."
  },
  {
    "headline": "Why Nigeria Must Continue To Borrow Responsibly – Senate President",
    "summarized_story": "President of the Senate, Ahmad Lawan, has explained why it is important for the Nigerian government to continue to borrow responsibly to fund critical projects in the country.\nThe Senate President made the remarks on Thursday while briefing State House correspondents after a closed-door meeting with President Muhammadu Buhari in Abuja, the nation’s capital.\nThe Senate President noted that this would be done only after investigating the implementation of such loans through oversight functions to ensure that they were directly deployed for intended projects.\nAccording to him, Nigeria has no other choice than to borrow money and the option of private-public partnerships and Internally Generation Revenue (IGR) was not worthy of consideration.\n“In fact, even those inside Nigeria may not like to invest properly in the sector of infrastructure development,” he said."
  },
  {
    "headline": "Kaduna Security: Bandits Kill Driver, Kidnap 33 People In Kachia",
    "summarized_story": "At least one person has been killed and 33 others abducted following an attack by bandits suspected to be kidnappers in Kachia Local Government Area of Kaduna State.\nDistrict Head of Kachia ward, Idris Suleiman confirmed the incident when security operatives led by the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan visited the area.\nBandits have in recent times left Kaduna in a state of unrest, with many being killed and many others being kidnapped, including students of various institutions.\nThe latest attack in Kachia comes a few days after the village head of Dogon Daji community in Sanga Local Government Area of Kaduna State, Mallam Anja, was shot dead by bandits.\nThe marauders raided the residence of the village head and shot him at close range, after which he died on the spot."
  },
  {
    "headline": "Court Grants Nollywood Actor, Baba Ijesha Bail",
    "summarized_story": "A Special Offences and Domestic Violence Court sitting in the Ikeja area of Lagos has granted bail to Nollywood actor, Olanrewaju Omiyinka, aka Baba Ijesha in the sum of N2million with two sureties.\nSuch relation must also make a monetary bond of N1million to the Chief Registrar of the court.\nREAD ALSO: Alleged Sexual Assault: Nollywood Actor Baba Ijesha Pleads Not GuiltyThe other surety must be a legal practitioner whose call to bar certificate must be verified by the court.\nHe has seven days to perfect the bail but today he was released to the head of the legal team, Babatunde Ogala SAN.\nThe court then adjourned to the 26th, 27th, and 28th of July for the prosecution to open its case against the defendant."
  },
  {
    "headline": "Over 200 Vaccinated In Syria’s Al-Hol Camp",
    "summarized_story": "More than 200 people have been vaccinated against Covid-19 in northeast Syria’s densely-populated Al-Hol camp for the displaced and families of defeated jihadists, a government official said Thursday.\nSyrian health ministry teams had inoculated 205 people up until Wednesday in Al-Hol camp of Hasakeh province, the ministry’s provincial chief Issa al-Khalaf told AFP.\nSyria’s health ministry in April received a first consignment of 203,000 doses of AstraZeneca through Covax, according to the World Health Organization.\nAlmost 7,000 people have so far been inoculated in the Kurdish-held areas, in a campaign launched a month ago, local health chief Jawan Moustafa said.\nThe areas of northeast Syria under Kurdish control, where medical shortages are rife, have recorded over 18,000 cases of coronavirus, including 761 deaths."
  },
  {
    "headline": "EFCC arrests three suspects in N3.5bn Ponzi Scheme fraud in Sokoto",
    "summarized_story": "The Economic and Financial Crime Commission EFCC, Sokoto zonal office has arrested three suspected fraudsters in a Ponzi scheme that have generated over three point five billion naira within the period of six months by defrauding unsuspecting members of the public.\nThe EFCC says the arrest was made possible after a nine month painstaking investigation.\nAddressing journalists at the zonal headquarters , EFCC zonal head, Bawa Usman Kaltungo says the EFCC Zonal office received a complaint from a commercial Bank on suspicious transactions on an account of Annexation Business Concept opened by Sunday Markus.\nAdvertisementThe EFCC says investigation by their personnel revealed that the suspects are involved in a Ponzi scheme with a fictitious addresses and unregistered phone numbers.\nThe EFCC zonal head says, further investigation revealed that Benson Kufre John and Irabor Joseph are the initiators and operators of the fraudulent double interest investment Ponzi scheme called Annexation Biz Concept."
  },
  {
    "headline": "Canada: 751 unmarked graves found at former Saskatchewan residential school",
    "summarized_story": "The Federation of Sovereign Indigenous Nations (FSIN) and Cowessess First Nation in Saskatchewan announced Thursday the discovery of 751 unmarked graves at the former Marieval residential school site.\nFSIN chief Bobby Cameron and Cowessess First Nation Chief Cadmus Delorme made the revelation on Zoom, only weeks after 215 unmarked grave sites were discovered at a Kamloops residential school.\nChief Delorme said they cannot affirm that they are all children in the unmarked graves.\nMarieval Indian Residential School operated between 1899 and 1997.\nWith the help of Saskatchewan Polytechnic and ground-penetrating radar equipment, the Cowessess First Nation was able to locate unmarked graves."
  },
  {
    "headline": "CDS visits retired officers in Ibadan, says military officers not conspiring with enemies",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor has denied allegations that personnel of the Nigerian Army are conniving with terrorists to terrorise the country.\nGeneral Irabor made this known while speaking with newsmen in Ibadan at a meeting with retired military officers in the Southwest zone held in Ibadan.\nThe chief of Defence Staff said the military experience of the past retired officers was necessary to bring back the security architecture of the nation back on track.\nThe General Officer commanding Two Division, Major General Gold Ndubuisi wants the retired officers to play their parts in safeguarding the country’s from enemies.\nAdvertisementThe Chief of Defence Staff will also meet with senior military officers in other zones of the country."
  },
  {
    "headline": "Andy Murray to Defend Olympic Tennis Title at Tokyo 2020",
    "summarized_story": "Andy Murray, a two-time Olympic gold medalist will defend his tennis title at the Tokyo Olympics, after being named in Team GB’s squad on Thursday.\n34-year-old Murray will join Neal Skupski, Dan Evans, Joe Salisbury, Heather Watson and Johanna Konta in the line up.\n“The Olympics means a huge amount to me, it’s a massive honour to be able to compete at a fourth Games,” Murray, who is heading to his fourth Olympic games, said in a statement.\n1 Dan Evans will make his Olympic debut, and team up with Skupski for the men’s doubles.\nMurray will compete as a wildcard entrant at Wimbledon which starts on Sunday."
  },
  {
    "headline": "UEFA Abolishes 56-year Old Away Goals Rule in Major Shake-up of Club Competitions",
    "summarized_story": "UEFA on Thursday abolished away goals rule in European tournament knockout ties and will take effect from the 2021-22 season.\nThe rule had been in place since 1965, was used to determine a winner when teams were level on aggregate after a two-legged match.\nThe team that had scored more goals as the away side were awarded the victory.\nA UEFA statement read: “Following the recommendation of the UEFA Club Competitions Committee and the UEFA Women’s Football Committee, the UEFA Executive Committee has today approved a proposal to remove the so-called away goals rule from all UEFA club competitions (men, women and youth) as of the qualifying phases of the 2021/22 competitions.”Commenting on the abolishment of the away goals rule, UEFA President Aleksander Ceferin said: “The away goals rule has been an intrinsic part of UEFA competitions since it was introduced in 1965.\nThere is also criticism of the unfairness, especially in extra time, of obliging the home team to score twice when the away team has scored."
  },
  {
    "headline": "Despite Evidence, Ethiopia Army Denies Targeting Civilians in Airstrike",
    "summarized_story": "Authorities in Ethiopia have denied that civilians were targeted or killed in the airstrike at Togoga village outside Tigray’s capital, Mekelle.\nThe army’s spokesperson Col Getnet Adane told journalists on Thursday that the airstrike’s targets were rebel fighters who were gathered to celebrate Martyrs’ Day.\nBut the BBC says it has seen evidence of injured women and children receiving emergency treatment in Aider Referral Hospital in Mekelle after the attack.\nRenewed fighting is feared to worsen the humanitarian crisis in Tigray in which millions of people are in need of emergency aid.\nMeanwhile, a doctor at the hospital told the BBC that at least 60 people were killed and more than 40 were injured."
  },
  {
    "headline": "Children, Adolescents Behind Killing of 160 People in Burkina Faso",
    "summarized_story": "UNICEF says children and adolescents made up the bulk of an armed group in Burkina Faso that killed at least 160 people in an attack earlier this month.\nThe raid on the village of Solhan in the north of the country was the deadliest incident in years in an area plagued by jihadist violence.\nA total of 160 bodies were recovered from what local officials in Solhan described as three mass graves, AFP news agency had reported.\nUnicef has strongly condemned the recruitment of children and adolescents.\nFamilies and children should be protected everywhere and at all times”, said Unicef representative in Burkina Faso Sandra Lattouf."
  },
  {
    "headline": "Several Soldiers Killed in Kenya Helicopter Crash",
    "summarized_story": "Several Kenyan soldiers have been confirmed dead after a military helicopter crashed during training outside the country’s capital, Nairobi, a military statement says.\nKenya’s military confirmed the deaths in a statement but failed to give details on the numbers of soldiers involved in the incident.\nInjured soldiers have been airlifted to a military hospital in Nairobi, the statement adds.\nIt is still unclear how many soldiers were onboard the helicopter but local media reports say 23.\nAircraft accident investigators are at the crash site to establish the cause of the accident, the military says."
  }
]