[
  {
    "headline": "FMBN launches non-interest mortgage product",
    "summarized_story": "THE Federal Mortgage Bank of Nigeria has announced the introduction of a non-interest rent-to-own mortgage loan product.\nThe bank said the product was designed to help Nigerians leverage non-interest mortgages to own their homes.\nIn a statement, the Managing Director/Chief Executive Officer, FMBN, Ahmed Dangiwa, said, “I am excited that we have been able to fix this decades-old problem.\n“For over 30 years, a significant number of the over five million Nigerians who contribute to the National Housing Fund Scheme have been prevented from taking advantage of their rights because of the interest-based nature of FMBN housing products.\nIt added that the product’s financing structure is based on the non-interest financing contract of Ijarah Muntahia Bittamleek (Lease to Own) and under the arrangement, it will retain ownership of the property until the financing term ends or at any time during the lease period that the beneficiary wishes to purchase the property."
  },
  {
    "headline": "Many injured as NURTW factions clash in Akure",
    "summarized_story": "Crisis erupted on Tuesday evening between members of two factions of the National Union of Road Transport Workers in Akure, Ondo State, leaving many injured.\nThe state government had suspended the activities of the NURTW in the state while a 21-man Motor Parks Management Committee led by the former state chairman of the union, Jacob Adebo, was set up.\nTo this end, the state police command, on Tuesday, deployed officers and men in the parks to forestall the further breakdown of law and order.\nThe Police Public Relations Officer in the state, Mrs Funmi Odunlami, who confirmed the development, said policemen were deployed to avert violence at the parks.\nShe stated, “After the swearing-in of Jacob Adebo, popularly known as Idajo yesterday by the state government, some of his men went to some parks in Akure metro to take over those parks but met stiff resistance.”Copyright PUNCH."
  },
  {
    "headline": "2023: Guber aspirant unveils 8 point agenda ‘to change fortunes of Kano’",
    "summarized_story": "By Bashir Bello, KANOA governorship aspirant under the ruling All Progressives Congress (APC) in Kano, Engr.\nBashir Ishaq Bashir has unveiled eight (8) points agenda to turn around the fortunes of Kano State.\nMassive investments are being made on projects that have little or no bearing on the economic development of the people.\nAny aspirant that splashes money or has unexplained sources of wealth should not even dream of vying for the numero uno seat in Kano State.\nWe shall turnaround the fortunes of Kano from a consumer economy to an active production hub,” Engr."
  },
  {
    "headline": "9 policemen dismissed for mobilising colleagues in failed strike over poor salary",
    "summarized_story": "Inspector-General of Police Usman Alkali BabaBy Kingsley Omonobi, AbujaFollowing the aborted strike action planned by policemen in the country over poor salary structure and the interception of the correspondences of mobilization for the strike by Force Headquarters, nine police officers have been dismissed on the orders of the Inspector-General of Police, Usman Alkali Baba.\nAccording to a Police signal issued by the CP in charge Police Provost, the officers involved are two inspectors, five sergeants and two constables.\nThe signal said the men were dismissed from service following their orderly room trial for planning and coordinating a strike within the ranks and file of the police.\nTraced, tracked, arrestedThey were said to have been identified, traced and subsequently arrested after their phone calls were tracked.\n“The Commissioner in charge Police Welfare to delete subjects from police nominal roll accordingly."
  },
  {
    "headline": "SOSG donates N400m worth of foodstuffs, textiles to orphans, needy",
    "summarized_story": "The state Governor Barrister Aminu Waziri Tambuwal, represented by his deputy Mannir Dan Iya disclosed this at this years distribution exercise of the Endowment granted by the state government held at Zakkat Commission headquarters in Sokoto.\nHe said this year, the state government has spent over 396 million naira on the purchase of foodstuffs and textiles materials for distribution to the needy and other vulnerable persons in the state.\nHe said the state government has in conjunction with the state Zakkat and Endowment Commission (SOZECOM) commenced the distribution exercise of foodstuffs and textiles materials to Orphans, the less privileged and the needy in the state.\nHe said the state government has sustained the grants and distribution of foodstuffs and clothing materials to Orphans and the less privileged in society every year, especially during the blessed month of Ramadan.\nHe said, the state ministry for religious affairs and the state government are very much comfortable with the leadership of the state Zakkat and endowment Commission and it’s a mode of sharing formulas to the needy in the state."
  },
  {
    "headline": "#WhatsApp introduces new feature",
    "summarized_story": "Tapping on an unsaved number that has been sent on a chat will open an in-app menu that allows users to chat with the person if they are on WhatsApp.\nHowever, the WhatsApp beta for Android version 2.22.8.11 shows that the company is working on a solution for this.\nCurrently, tapping on a number that was sent to you on WhatsApp opens the phone’s dialer app.\nIt will still require the unsaved number to be on your WhatsApp.\nBoth the Android and iOS beta versions of WhatsApp showed an upcoming feature that will not let users forward a message to more than one group at a time."
  },
  {
    "headline": "Reps consider 6-month jail term for crossdressers",
    "summarized_story": "By Levinus Nwabughiogu, AbujaA bill to prescribe sanctions to cross dressing in Nigeria debuted at the House of Representatives on Tuesday.\nEssentially, the bill titled “A bill for an act to amend same sex marriage (Prohibition) act 2023 to prohibit cross dressing and other related matters”, sponsored by by Muda Lawal Ulnar is seeking amendment to the principal act.\n“Provided that this section of this Act shall not apply to cross dressing in the course of a stage play or in any bona ﬁde public entertainment.\n“Section 5 is amended by inserting after the existing Sub-clause (3), a new Sub-clause (4)“A person engaged in cross dressing is guilty of an offense and liable to imprisonment for six months or to a ﬁne of ﬁve hundred thousand Naira.\n“Section 7 of the principal Act is amended by introducing the word ‘cross dressing’ and deﬁning same as;“Cross dressing means the practice of wearing clothes usually worn by a person of the opposite sex.”Vanguard News"
  },
  {
    "headline": "Soldiers, Amotekun operatives clash in Ondo over seizure of cows",
    "summarized_story": "Soldiers from the 32 Artillery Brigade, Ondo State and operatives of the State Security Network dubbed as Amotekun Corps, on Tuesday evening, clashed over the seizure of over 100 cows by the latter in Akure, the state capital.\nAccording to sources, Amotekun operatives seized the cows after receiving distress calls from farmers.\nOne of the sources said the military invaded the location and stopped the cows from being taken away.\nThe soldiers were said to have claimed that the cows belonged to their superiors in the barracks.\n“The troops urged that the Amotekun men not take the cows because they belonged to their military barrack’s officers.”"
  },
  {
    "headline": "Increasing fossil fuel production will make earth almost uninhabitable – Global coalition",
    "summarized_story": "The Global Climate and Health Alliance has issued its position on the Mitigation of Climate Change report by the Intergovernmental Panel on Climate Change (IPCC).\nThe communique proposes drastic action to provide humanity with a chance to limit overall global warming to within Paris Agreement targets.\nIn a statement on Tuesday, the global coalition of health professionals and health civil society organizations said the report could not be more explicit.\nThe official said the war in Ukraine and its repercussions further highlight the urgent need to navigate away from activities that put people’s health and lives at risk.\n“During his April 4th speech, United Nations Secretary-General Antonio Guterrez made clear that countries that are increasing fossil fuel production are ‘dangerous radicals’."
  },
  {
    "headline": "How young people can change the narrative – Emmanuel Edoh",
    "summarized_story": "While speaking to some select journalists, Edo who has diversified into real estate business said he started business as early as his secondary school days.\n” People think that in this part of the world, young people cannot get engaged in business and be genuinely successful.\nBut I think we’re beginning to change that narrative.\nI’m moving into nightlife business.\nEdoh is looking to partner with like-minds in a 5 million dollars investment in nightlife and entertainment industry."
  },
  {
    "headline": "Ramadan: Gov Buni relaxes working hours for Yobe civil servants",
    "summarized_story": "Yobe State Governor, Mai Mala Buni, has approved the adjustment of official working hours in the public service for the holy month of Ramadan.\nThe adjustment was contained in a circular signed by Mohammed Nura, the State’s Head of Service.\nIt said Mondays to Thursdays, the official working hours are now from 8:00am – 3am, while on Fridays it will be from 8:00am – 12:00pm.\n“The adjustment covers the month of Ramadan (Fasting) only and normal working hours will commence immediately after the month of Ramadan”, the circular noted.\nThe Head of Service, however, urged Ministries, Departments and Agencies of government to bring the content of the circular to the notice of all their staff for compliance."
  },
  {
    "headline": "APC convention: Nigerians knew consensus won’t work in Rivers – Abe",
    "summarized_story": "Former Rivers South-East Senator, Magnus Abe, has spoken on the crisis rocking the All Progressives Congress (APC) in Rivers.\nHe explained that it was not about the national convention of the party nor the South-south vice chairmanship position.\nHe said before the contest, members were aware that there was consensus among South-South leaders.\n“Everybody in Nigeria knew that consensus will not work in Rivers State and that is how it played out.”Abe confirmed that some people agreed that there should be a consensus and those who are not favoured by it should withdraw.\nAbe further expressed satisfaction that his ally did not cry when he got to the podium."
  },
  {
    "headline": "Three shot dead, homes razed in Plateau attack",
    "summarized_story": "Gunmen suspected to be herdsmen have attacked another community in Bassa council of Plateau State, killing three person and injuring one.\nThe Nation learnt that the attack on Ariri, a village in Irigwe chiefdom of Miango district, took place about 1.30 am yesterday.\nRecently, about 10 persons were killed and 19 injured in Zerreci community, also in Bassa council.\nDodo said the assailants wrecked the community, looting and burning houses, including a church, and stealing livestock.\nPolice spokesman Gabriel Ogaba did not take calls to his phone nor did he respond to text messages on the incident."
  },
  {
    "headline": "Three kidnap victims freed in Lagos",
    "summarized_story": "Three persons, who were kidnapped by some gunmen in Ayobo Housing Scheme Extension, Oshin in Ayobo-Ipaja, Lagos State, have been released.\nThe News Agency of Nigeria (NAN) reports that the victims: two sisters and a man were abducted on Friday and Sunday respectively by gunmen who invaded their estate.\nNAN reports that the parents of the two sisters, Mr Rashidi and Mrs Oluwalogbon Salami, were grateful to God for the safe return of their daughters.\nMrs Oluwalogbon Salami told NAN yesterday that the entire family was happy because not all that were kidnapped usually returned.\nIt was learnt that the gunmen came through the boundary between Lagos and Ogun, and escaped with their victims on a speedboat."
  },
  {
    "headline": "BEDC’s disputed debt suit adjourned till May 30",
    "summarized_story": "The Federal High Court sitting in Lagos yesterday adjourned till May 30 to hear applications in a suit between three banks and two firms, and Benin Electricity Distribution Company Limited (BEDC) and others over an alleged debt.\nBEDC is challenging its involvement in the disputed debt.\nWhen the suit came up for hearing on March 30, 2022, Justice Bogoro adjourned till April 5 to hear an application by Kemi Pinheiro, SAN, seeking to strike out BEDC’s name from the suit.\n“I urge the court to hear our application first, which takes priority over any interlocutory application,” the lawyer said.\nOgunba did not oppose the application for an adjournment, following which Justice Bogoro fixed May 30 to hear all objections to the counterclaim."
  },
  {
    "headline": "Seven die, houses burnt in Jigawa, Rivers fire",
    "summarized_story": "The police spokesman said four people died instantly while two passed away later in hospital.\nShiisu said the fire started when “the station was selling the petrol to motorists”.\nIn Rivers State, a midnight fire destroyed over 30 makeshift houses at an estate near Y-Junction in Rumuagholu area of Port Harcourt, the state capital.\nIt was gathered that a two-year-old boy died in the blaze that started at 1am on Monday.\nThe fire was said to have started from one room and spread to other apartments in the area."
  },
  {
    "headline": "Police seek special court for fraud cases",
    "summarized_story": "Commisioner of Police, Police Special Fraud Unit (PSFU), Lagos, Anyasinti Josephine Nneka, has appealed to the Chief Judge of Lagos State, Justice Kazeem Olanrewaju Alogba, for the designation of a court that will attend to applications filed by the unit.\nCP Nneka made the request during the PSFU’s courtesy visit to the Chief Judge in Ikeja.\nThe Chief Judge also commented on the fact that the PSFU has been coming to court with competent lawyers/prosecutors, who make the job of the court less difficult.\nOn PSFU’s applications, the chief judge said all criminal matters are generally deemed as “urgent” and are treated as such by the administrative judge.\nThe chief judge, however, appreciated the commitment and sacrifice of personnel of the unit and also promised the CP PSFU his fullest cooperation."
  },
  {
    "headline": "Mixed reactions as PDP throws presidential ticket open",
    "summarized_story": "Those who have obtained nomination forms include Rivers State Governor, Nyesom Wike; Sokoto State Governor, Aminu Tambuwal, Bauchi State Governor, Bala Mohammed, Akwa Ibom Governor, Udom Emmanuel and former Secretary to the Government of the Federation( SGF), Anyim Pius Anyim.\nThe group gave PDP seven days to reconsider ceding PDP presidential tickets to South East or be ready to bear the grevious consequences of such injustice and marginalisation against Southeasteners.\nThere’s no reason any PDP office/flag from ward level to state will be in the Southern Nigeria if they dare to deny a southeastern PDP president ticket.\n“By throwing PDP president ticket open, PDP has murdered justice, fairness and equity.\nSo, it is for the southern PDP members to look at it critically and know what to do."
  },
  {
    "headline": "12 soldiers, 3 vigilante feared killed, 20 injured as bandits attack Kaduna military base",
    "summarized_story": "A source said the terrorists who wielded AK-47 and rocket-propelled grenade (RPG) stormed the military base on motorcycles.\nHe said the confrontation with soldiers lasted for about two hours before the soldiers were eventually subdued.\nThe attack, it was learnt, has thrown the 1 Division of the Nigerian Army in Kaduna into confusion.\nDaily Sun learnt that while the 19 soldiers injured were rushed to the General Hospital, Birnin Gwari, the remains of the 12 soldiers were deposited at the 44 Nigerian Army Reference Hospital, Kaduna.\nMost of the residents slept outside Birnin Gwari town.”He said normalcy returned, yesterday, around 10am, describing the Kaduna /Birnin Gwari as the most dangerous road in the country."
  },
  {
    "headline": "Governors, Speakers meet Friday over insecurity, other national issues",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGovernors of the 36 states of the federation under the auspices of Nigeria Governors Forum (NGF) and Speakers of the States Houses of Assembly would hold a crucial emergency meeting on the worsening security situation in the country.\nIn the invitation issued by NGF’s Director General, Asishana Okauru, on Tuesday, the meeting is scheduled for Friday.\nOkauru said the crucial meeting which will hold at Frazier Suites, Central Business District, Abuja by 4pm,According to him, the 72 participants would brainstorm on issues affecting the security and general well being of Nigerians and other issues of national importance.\nHe quoted the Chairman of the Forum and Governor of Ekiti State, Kayode Fayemi as urging his colleagues to prevail on the speakers of their respective States Houses of Assembly to attend the meeting.\nSpeaker of your State House of Assembly at this important emergency meeting,” Okauru said in the invitation letter."
  },
  {
    "headline": "INEC reads the riot act to political parties over conduct of primaries",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC), has threatened to disqualify any political party that fails to adhere strictly to regulations and guidelines for the conduct of primaries for the 2023 general elections.\nIt also warned that should any political party fail to comply with the provisions regulating the conduct of any of its primaries, its candidates shall be excluded in the election for the particular position.\nWhere a political party fails to comply with the provisions of the Act in the conduct of its primaries, its candidate shall not be included in the election for the particular position in issue.\nHe said primaries must be conducted in the various constituencies as provided in Section 84 of the Electoral Act and that it was a violation of the law to conduct primaries outside the constituencies for which parties are nominating candidates.\nThe Notice of Election was published on Feb. 28, while nomination forms have been made available on the commission’s website since March 1 for political parties to download and issue to their candidates."
  },
  {
    "headline": "Kyari partners NUPENG, NARTO, others to tackle crude oil theft",
    "summarized_story": "Crude oil theft has been having a negative impact on the revenue of the Federal Government, a worrisome development that is denying the country the much-needed funding to boost economic development.\nA report recently released at a meeting on crude oil theft between the Nigerian Upstream Petroleum Regulatory Commission and Oil Producers Trade Section, as well as the Independent Petroleum Producers Group, showed that between January 2021 and February 2022, Nigeria lost a whopping of $3.2billion to crude oil theft.\nThe report revealed that oil theft rose significantly between 2021 and 2022, with over 90 per cent of total crude produced at the Bonny Terminal stolen as at January 2022.\nHe lamented that currently, Nigeria is producing less than 1.5 million barrels per day of crude oil.\nKyari said as major stakeholders in the oil and gas business, that it was high time NUPENG and NARTO collaborate with the NNPC to bring the issue of crude oil theft to an end."
  },
  {
    "headline": "Nigeria’s Presidential Options: The Die is Cast",
    "summarized_story": "An indigene of Ebonyi State, Anyim is one presidential hopeful, who has stayed away from scandals and maintained a lowkey profile.\nBeing speaker and governor are not enough, he has yet to acquit himself as a potential presidential material.\nHe also has age on his side and from a party, which might throw its presidential ticket open for all.\nDele Momodu (PDP, South South)One of the most influential celebrity journalists in Nigeria’s modern history, Bashorun Dele Momodu, is having his second outing in the nation’s presidential run.\nYahaya Bello(APC, North Central)The Kogi State Governor, Yahaya Bello, is another controversial governor, albeit in the ruling party."
  },
  {
    "headline": "JNI: Any Govt Incapable of Protecting Citizens Lacks Moral Justification to Be in Power",
    "summarized_story": "It bemoaned the recent attack on an Abuja-Kaduna passenger train in which eight people were confirmed killed while many others were either abducted or injured.\n“We claim to be people of faith and all these occurrences are allowed without any form of prompt intervention.\n“Moreover, why must security budget and expenditure remain so secretive, despite the reported release of funds?\nThe statement queried, “Again, why can’t the government proactively take the battle to the criminals’ hideouts and wipe them off?\n“Likewise, parents, religious and community leaders have a role to play in the fight against illicit drugs/substance pervading most households within our neighbourhoods."
  },
  {
    "headline": "16 Months after, FG Bars Unlinked SIM Cards, Begins Enforcement",
    "summarized_story": "The recent order to bar all unlinked SIM cards came 16 months after the federal government gave the first order to deactivate all SIM cards not registered and linked to NIN.\nThe deadlines for the NIN-SIM linkage has been extended on multiple occasions to allow Nigerians to freely comply with the policy.\n“Accordingly, Mr. President graciously approved the many requests to extend deadlines for the NIN-SIM linkage.\nAt this point however, government has determined that the NIN-SIM Policy implementation can proceed, as machinery has already been put in place to ensure compliance by citizens and legal residents.\n“Outgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage policy from the 4th of April, 2022."
  },
  {
    "headline": "Terrorists Attack Zamfara Community, Commissioner’s Son Among those Killed",
    "summarized_story": "By Onuminya InnocentThe Nigeria Police on Monday confirmed terrorists attack on Tsafe local government area of Zamfara State.\nIn the attack on Tsafe town, no fewer than four persons were reportedly killed by the terrorists, including the son of the Zamfara State Commissioner for Internal Security and Home Affairs, DIG Mamman Tsafe (retired).\nSources told THISDAY that the suspected terrorists invaded Tsafe Local Government headquarters in Zamfara State Sunday evening firing gunshots.\nThey killed thr Commissioner’s son, Abba Mamman Tsafe, and also cut his hands.\n“With what just happened they have declared war on government , in Zamfara State now no one is safe”, he said."
  },
  {
    "headline": "Breaking: FG Bars Outgoing Calls on SIM Cards not Linked to NIN",
    "summarized_story": "Emma OkonjiThe federal government has barred all outgoing calls on every SIM card that is not linked to the National Identification Number (NIN) of the SIM card owner.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication.\nSimilarly, the National Identity Management Commission (NIMC) has issued over 78 million unique NINs till date,” Pantami said.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nOutgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\n1) Accountant General Sokoto FAAC Account Number 0697434238, Access Bank.\n“The following are suggested for investigation; Investigation should commence on other state government accounts in order to identify other accounts that are prone to unwholesome acts of state officials."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\n1) Accountant General Sokoto FAAC Account Number 0697434238, Access Bank.\n“The following are suggested for investigation; Investigation should commence on other state government accounts in order to identify other accounts that are prone to unwholesome acts of state officials."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Train attack: Reps hold 4-hour meeting with service chiefs on review of security strategy",
    "summarized_story": "The house of representatives says among issues discussed during a meeting with service chiefs on Tuesday was an “all-important” issue of moles in the military.\nTheCable had reported how the legislators expressed dissatisfaction with the attitude of the service chiefs and some heads of agencies invited over the recent attack on a train in Kaduna.\nAt the meeting held on March 30, the public officials were absent and sent in their representatives instead.\nAdvertisementOn Tuesday, the invited government officials appeared before the panel consisting of members of the house leadership and security committees.\nAddressing reporters after the meeting which lasted for four hours, Gbajabiamila said the legislators had “extensive deliberation” with the invited public officials."
  },
  {
    "headline": "Train attack: Reps hold 4-hour meeting with service chiefs on review of security strategy",
    "summarized_story": "The house of representatives says among issues discussed during a meeting with service chiefs on Tuesday was an “all-important” issue of moles in the military.\nTheCable had reported how the legislators expressed dissatisfaction with the attitude of the service chiefs and some heads of agencies invited over the recent attack on a train in Kaduna.\nAt the meeting held on March 30, the public officials were absent and sent in their representatives instead.\nAdvertisementOn Tuesday, the invited government officials appeared before the panel consisting of members of the house leadership and security committees.\nAddressing reporters after the meeting which lasted for four hours, Gbajabiamila said the legislators had “extensive deliberation” with the invited public officials."
  },
  {
    "headline": "Comply with electoral act or be barred from 2023 elections, INEC tells political parties",
    "summarized_story": "The Independent National Electoral Commission (INEC) says political parties that fail to comply with the provisions of the Electoral Act 2022 will not be allowed to participate in the 2023 elections.\n“As required by law, the Commission shall monitor the primaries of each political party that provides the required legal notice in line with Sections 82 (1) and (5) of the Electoral Act,” the statement reads.\nAdvertisement“The Commission wishes to reiterate that parties must adhere strictly to the principles of internal democracy, drawing from their constitutions, guidelines, the Electoral Act and other Regulations and Guidelines issued by the Commission.\n“Their candidates for the 1,491 constituencies for which elections will be conducted in 2023 must emerge from democratic, transparent and valid primaries, in line with the provisions of Sections 29 and 84 of the Electoral Act, 2022.\n“All the activities are in line with the provisions of the Constitution of the Federal Republic of Nigeria 1999 (as amended) and the Electoral Act, 2022."
  },
  {
    "headline": "Comply with electoral act or be barred from 2023 elections, INEC tells political parties",
    "summarized_story": "The Independent National Electoral Commission (INEC) says political parties that fail to comply with the provisions of the Electoral Act 2022 will not be allowed to participate in the 2023 elections.\n“As required by law, the Commission shall monitor the primaries of each political party that provides the required legal notice in line with Sections 82 (1) and (5) of the Electoral Act,” the statement reads.\nAdvertisement“The Commission wishes to reiterate that parties must adhere strictly to the principles of internal democracy, drawing from their constitutions, guidelines, the Electoral Act and other Regulations and Guidelines issued by the Commission.\n“Their candidates for the 1,491 constituencies for which elections will be conducted in 2023 must emerge from democratic, transparent and valid primaries, in line with the provisions of Sections 29 and 84 of the Electoral Act, 2022.\n“All the activities are in line with the provisions of the Constitution of the Federal Republic of Nigeria 1999 (as amended) and the Electoral Act, 2022."
  },
  {
    "headline": "Okowa visits Obasanjo, says 'we need him to help shape Nigeria'",
    "summarized_story": "Ifeanyi Okowa, governor of Delta state, says Nigeria needs to tap from the experience of former President Olusegun Obasanjo on nation building.\nOkowa said this on Tuesday when he visited Obasanjo in Abeokuta, the Ogun capital.\nAccording to a statement by Kehinde Akinyemi, spokesman to Obasanjo, the Delta governor said stakeholders, including traditional rulers, also need to be consulted on finding solutions to challenges affecting security and the economy.\n“We need to sit together and discuss the way forward.”The governor described Obasanjo as ”someone who truly understands Nigeria through and through”, adding that Nigeria “needs to tap from him, especially at a time like this, which will help to shape this nation”.\n“Our dream is to see Nigeria begin to have an improvement in our security and in the economy."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Appetito’s “dark stores” are a test for multi-node last-mile distribution in Africa",
    "summarized_story": "This is one of Appetito’s dark stores in a Cairo suburb.\nThe company plans to add 50 more dark stores every year until 2024.\nBecause customers don’t have to enter the shops, dark stores have more space to store inventory and quickly and accurately fulfil orders.\nStephen Deng, Partner at DFS Lab says his venture capital firm are, “big believers that dark stores represent a shift in last-mile retail that’s here to stay.”But dark stores are not chugging away unchallenged.\nSome of them have even called them a “blight”, which is ironic since the very restrictions these governments enforced enabled dark stores to thrive."
  },
  {
    "headline": "13 years, $10bn processed. How has Paga evolved over the years?",
    "summarized_story": "After considering several ideas for a couple of months, Oviosu came up with what is now Paga.\nPaga was arguably the first fintech company in Nigeria to popularise mobile money among the unbanked.\nIn 2021, Paga opened up its platform to more businesses through Collect APIs, which more than 200 businesses currently use.\nExpansion“The vision is still the same—to solve payments for individuals and businesses,” Oviosu said.\nTayo Oviosu, Paga co-founder and CEO."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Explainer: Here are bank charges approved by CBN",
    "summarized_story": "Here are some of the approved bank chargesElectronic Funds TransferBefore the review, the rate for electronic transfers’ transactions was N50 flat fee.\nBut now, it’s N50 for transactions done above N50, 000, N25 for N5, 000 – N50, 000 and N10 charge for below N5, 000.\nThe charge for hardware token is subject to cost recovery subject to a maximum charge of N2, 500.\nConfirmation Letter, Embassy Letter, Reference Letter, Letter of Indebtedness/Non Indebtedness etc.)\nFee for Short Message Service (SMS) mandatory alert is based on cost recovery from previous maximum charge of N4."
  },
  {
    "headline": "NIN-SIM linkage: Telecoms subscribers lament barred outgoing calls",
    "summarized_story": "Subscribers are already bearing the brunt of the Federal Government’s directive to all telecommunications companies to bar outgoing calls on Subscriber Identity Module (SIM) cards not yet linked with the National Identification Numbers (NIN).\nAfter extending the deadline for the NIN-SIM linkage on many occasions to allow Nigerians link their SIM cards, the Federal Government on Monday ordered various telecommunications providers to enforce compliance with its NIN-SIM policy by blocking all outgoing calls on all unlinked lines.\nRead also: NIN-SIM linkage: Telcos, FG may lose N66.74bnThey questioned the FG’s decision, saying that despite the NIN-SIM linkage, kidnapping for ransom is still on the increase.\nHe said he later received a Short Message Service (SMS) that reads, “Dear customer, due to NIN non-compliance, your line has been restricted from making calls as directed by the Federal Government.\nAnytime I try calling, I hear a voice telling me my line has been barred from making calls and that I should provide my NIN to get it deactivated."
  },
  {
    "headline": "The Nigerian climate change act – key highlights",
    "summarized_story": "IntroductionPresident Muhammed Buhari would be credited for taking a giant stride at the start of this decade on climate action both in Nigeria and globally by signing the Climate Change Act (CCA or the Act) into law on November 18, 2021.\nNational Council on Climate Change and the secretariatThe CCA establishes the National Council on Climate Change (the Council), a statutory body with perpetual succession vested with the powers to make policies and decisions on climate change in Nigeria.\nIt shall also have the obligation to approve and oversee the National Climate Change Action Plan (Action Plan) and administer the Climate Change Fund.\nClimate change obligationsThe Act imposes climate change obligations on Ministries, Departments and Agencies (MDAs), private and public entities.\nAlso, eliminating gas flaring will be critical for the attainment of gas emission targets and overall climate change objectives."
  },
  {
    "headline": "Vigilante operatives escapes ambush by suspected herdsmen in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEvboesi – Vigilante operatives at Evboesi community in Orhionmwon local government area of Edo state narrowly escape death on Monday after suspected armed herdsmen ambushed their vehicle along the Benin-Abraka road adjacent the railway line.\nThe operatives numbering six were about to park their operational vehicles at their base along the road to commence daily security duties when the armed men opened fire on them.\nAs they were about to pack their vehicles, suddenly the herdsmen starting shooting at the vehicles while my men were still inside.\nA motorist, Benjamin Ebiyemi appealed to the state government to support the vigilante groups operating in the area with the necessary logistics to enable them complement the police.\nIf no dem, nobody fear go let am pass that road; and na im the herdsmen dey vex for them."
  },
  {
    "headline": "Enhancing Anti-Corruption and Social Inclusive Reforms Initiatives in Nigeria: ANEEJ lauded at Inception meeting – Nigerian Observer",
    "summarized_story": "“There are research that have now demonstrated that when there is absence of transparency the tendency is to have accountability impaired.\nIn the past, ANEEJ was known for coming from the confrontational background, throwing stones.\nHaving to associate with ANEEJ we know that we would be able to achieve that at the National Assembly,” she enthused.\n“We thank ANEEJ for including the people with disability in this project, we have never had it so good.\nAccording to Sandra Eguagie, the second indicator to be measured in this project is the total number of anti-corruption commitment and oil commission mandate and policy documents reviewed."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "HARIN JIRGI: Tinubu ya baiwa gwamnatin Kaduna gudunmawar naira miliyan 50",
    "summarized_story": ""
  },
  {
    "headline": "Yadda ƴan bindiga suka kashe sojoji 11 suka ji wa 19 rauni a harin Birnin Gwari, jihar Kaduna",
    "summarized_story": ""
  },
  {
    "headline": "DAKATAR DA SHEIKH KHALID: Sanata Ɗansadau ya yi gaban kansa ne, ko dai an biya shi ko kuma neman suna -Gamayyar Kungiyoyin Magoya bayan Buhari",
    "summarized_story": ""
  },
  {
    "headline": "FARMAKI KAN JIRGIN ƘASA: An ceto tarago 7 daga wurin da ‘yan ta’adda su ka dasa bam -NRC",
    "summarized_story": ""
  },
  {
    "headline": "AIKIN GADAR KOGIN NEJA: An kashe naira biliyan 157 daga cikin biliyan 400 da gadar za ta lashe -Zainab, Ministar Harkokin Kuɗaɗe",
    "summarized_story": ""
  },
  {
    "headline": "Abuja Imam sacked for criticising Buhari gets new appointment",
    "summarized_story": "Sheikh Muhammad Nuru Khalid, erstwhile Chief Imam of the National Assembly Legislators’ Quarters Mosque removed for criticising the government of President Muhammadu Buhari over rising insecurity in the country, has gotten a new appointment.\nHe described the termination of his appointment by Legislators’ Quarters Mosque’s management committee as necessary price he had to pay for identifying with the sufferings masses and speaking truth to power.\n“This is the price we pay for aligning with the people and identifying with their sufferings.\n“By the Grace of Almighty Allah, I will be leading my new congregation this Friday, because as cleric we need a platform for operate.\n“There’s a Jum’mat mosque we built behind the CBN Quarters, in Abuja; I will now be leading the congregation there.”"
  },
  {
    "headline": "Ramadan 1443AH: Ademola Adeleke shares rice, beans to Osun indigents",
    "summarized_story": "By Sunday Oguntuyi, OsogboSenator Ademola Adeleke, governorship candidate of the People’s Democratic Party (PDP) in the July 16 governorship election in Osun state, has begun to distribute food items to the less privileged in the state in bid to make the ramadan period smooth for the indigenes.\nAdeleke commenced rice and beans distribution across the 332 wards in the state.\nAccording to one of his aides in charge of the exercise who preferred anonymity, the exercise has become routine for Adeleke dynasty to cushion the hardship melted on the people as a result of battered economy.\nThe exercise which commenced on Monday, will cover all the 10 local government in Osun West Senatorial District.\nHe also urged the people to be orderly during the exercise as no one would be excepted in the food distribution exercise."
  },
  {
    "headline": "Saving public tertiary education in Nigeria",
    "summarized_story": "For several years now, the public tertiary education space in Nigeria has been afflicted by a rash of industrial actions arising from the displeasure of academics and other stakeholders in the system over the inability of government to honour collective bargaining agreements and give a jolt of life to the sector.\nThe latest experience of this disruption in the academic calendar of public tertiary institutions began in February when the Academic Staff Union of Nigerian Universities, ASUU resumed its warning strike action that it had earlier suspended.\nAnd for the better part of seven weeks, the institutions have in the immediate, remained cold rooms for study purposes.\nThey include the challenge of securing enduring quality for the system in a world where tertiary education is evidently a universal engagement where global best practices are the norm.\nIn the past there have been several suggestions, including one that public office holders be forced to compulsorily educate their children and wards within the countrys public tertiary educational system."
  },
  {
    "headline": "Tension mounts over Lekki Tollgate reopening",
    "summarized_story": "By ADEBAYO OBAJEMUIf not properly handled the proposed reopening of Lekki Toll gate may prove a sticky one for the administration of Babajide Sanwoolu of Lagos State.\nBut that was not before the Lekki Concession Company, operators of the Lekki Toll Gate, where the killings happened, was indicted.\nRecently, the Lagos State Commissioner for Information, Gbenga Omotoso, announced plans by the Lagos State Government to open the Lekki Toll Gate closed for over 18 months since the massacre.\n“For money, reopening Lekki Toll gate without the state paying adequate compensations to victims and publicly apologizing is not the path to go”, said Professor Adeagbo Moritiwon, a political scientist.\nSome Nigerians also took to social media to demand justice for people killed and injured at Lekki Toll Gate during the #EndSars protest."
  },
  {
    "headline": "Shanghai: An Yiwa Sama Da Mutane Miliyan 24 Gwajin Cutar COVID-19 A Rana Guda",
    "summarized_story": ""
  },
  {
    "headline": "Ana Bikin Ranar Qingming A Kasar Sin",
    "summarized_story": ""
  },
  {
    "headline": "Za A Kammala Gadar Da Sin Ke Ginawa A Habasha A Farkon Badi",
    "summarized_story": ""
  },
  {
    "headline": "Sanata Danjuma Goje Zai Fice Daga APC Zuwa PDP A Gobe Laraba",
    "summarized_story": ""
  },
  {
    "headline": "Rijistaran JAMB Ya Soki Majalisa Kan Zarginsa Da Karbar Kudade A Wurin Dalibai",
    "summarized_story": ""
  },
  {
    "headline": "BREAKING: PDP Throws Open 2023 Presidential Ticket",
    "summarized_story": "The Peoples Democratic Party’s 37-member zoning committee has thrown available its presidential ticket to all hopefuls as its mandate expires on Tuesday, according to The PUNCH.\nThe committee threw open the ticket “because to a lack of time,” according to a source who requested anonymity, noting “zoning, as per our party constitution, is affirmed.”The document sighted by our correspondent read:“Recommendations of PDP Zoning Committee“1.\nZoning, as in our party constitution, is affirmed.\nInspite of (1) above, (the) Ticket is thrown Open, this time around due to exigency of time.\nOur Party is encouraged to always make the issue of zoning very clear at least 6 months before sales of forms."
  },
  {
    "headline": "Kano Atheist, Mubarak Bala, Pleads Guilty To Blasphemy, Sentenced 24 years Imprisonment",
    "summarized_story": "Mubarak Bala, a Kano-born atheist, was sentenced to 24 years in prison after pleading guilty to all 18 counts made against him, including incitement and disruption of the public peace.\nOn Tuesday, Mr Bala pleaded guilty to all charges before Justice Farouk Lawan of Kano High Court 4, Audu Bako Secretariat.\nMr Bala refused to modify his earlier plea when the judge questioned if he was aware of the repercussions of his guilty plea.\nThe lawyer, on the other hand, attributed his client’s guilty plea to exasperation and anxiety, claiming that his client had been in prison for two years.\nMr Bala, though, who appeared unfazed, raised his hand and said that he was guilty as charged."
  },
  {
    "headline": "Chinmark CEO, Marksman Chinedu Ijiomah reportedly flees Nigeria",
    "summarized_story": "Mr. Marksman Chinedu Ijiomah, the Chief Executive Officer of Chinmark Group, the firm involved in alleged involvement scam, has reportedly fled Nigeria.\nThis comes as some of those who invested funds in his company are preparing mass action lawsuit against him.\nMarksman had last week, vowed that he would not leave Nigeria amid the controversy over his firm and the repeated calls for his arrest.\nRecall that thousands of Nigerians who invested in Chinmark Group, a suspicius investment company, are currently counting their losses as the company has failed to repay their invested funds.\nThe angry investors lamented losing their hard-earned money to Chinmark while alleging that the group was fraudulent."
  },
  {
    "headline": "2023 Zoning: The Age Of Reasoning By Chief Olisa Metuh",
    "summarized_story": "The truth is that zoning at this late hour was designed to favour just one man.\nThe plan is that once it comes to the South even the southeast governors will support the southsouth aspirant to emerge.\nI still submit that zoning at this late hour will breed rancour, division, resentment and bitterness.\nA lot of PDP members erroneously believe that whoever is our presidential candidate will easily win the election.\nI kept quiet in 2015 and will no longer keep quiet when I see plans that will only bring electoral failure."
  },
  {
    "headline": "[Breaking] Resignation call: Amaju Pinnick adamant, convenes NFF executive committee meeting",
    "summarized_story": "Repeated calls by football-loving Nigerians for Amaju Pinnick to resign as President of the Nigeria Football Federation (NFF) seem to have fallen on deaf ears.\nThis is as Pinnick convened and presided over NFF executive committee meeting one week after the surprise ouster of Nigeria’s Super Eagles from the 2022 World Cup scheduled for Qatar.\nThe communique reads, “The Executive Committee tendered unreserved apology to the Federal Government and the people of Nigeria for the inability of the Super Eagles to win a ticket to the FIFA World Cup Qatar 2022.\n“The Executive Committee regretted the death of Dr Joseph Kabungo, appointed as the FIFA Doping Officer for the Nigeria/Ghana FIFA World Cup Qatar 2022 Playoff match in Abuja on 29th March 2022.\nThe NFF had since January 2022 approached the court to vacate the order and the next sitting is scheduled for 26th April 2022."
  },
  {
    "headline": "Ramadan: Malagi donates 1750 bags of grains to Niger IDPs, APC",
    "summarized_story": "The Publisher of Blueprint Newspapers and Kaakaki Nupe Alhaji Mohammed Idris Malagi has reached out to people displaced by bandits in Niger state, with a donation of 1745 bags of grains and vegitable oil worth N27 million.\nMaking the donation, Malagi, who is a gubernatorial hopeful under the platform of All Progressives Congress (APC) said the gesture was in the spirit of the Ramadan.\nRepresented by the Coordinating Secretary, Malagi 2023 Gubernatorial Organisation, Barrister Bala Marka, the governorship aspirant said the gesture also extends to officials of APC in Niger state.\nWhile handing over the food items, to the Niger state government represented by the Director-General, Niger State Emergency Management Agency (NSEMA), Alhaji Ibrahim Inga, Malagi also commenserated with those who have lost loved ones in the attack.\nSimilarly, while presenting the items also to the APC executive from ward to state level, Malagi explained that the gesture was aimed at supporting party members."
  },
  {
    "headline": "Breaking: Tinubu visits El-Rufai, donates N50m to train attack victims",
    "summarized_story": "The All Progressives Congress (APC) national leader, Asiwaju Bola Ahmed Tinubu, on Tuesday paid a condolence visit on Governor Nasir el-Rufai on Tuesday over recent attack on Abuja -Kaduna train.\nDuring the visit, Tinubu, a presidential aspirant donated N50 million for rehabilitation of victims of the attack.\nDetails loading…"
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Shop The Best Street Style From Paris Fashion Week Shows",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Entrepreneurial Advertising: The Future Of Marketing",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "FG Detects Over 1,500 Fake Workers In Civil Service",
    "summarized_story": "The Federal Government has detected over 1,500 workers who presented fake letters of employment to its verification committee.\nYemi-Esan said the Federal Government has suspended the salary of 3,000 civil servants who failed to present themselves for verification.\n“Sometimes in March of 2021, this office informed the ICPC that there were quite a number of fake letters of appointments circulating in the ministries,” the civil service chief said.\n“At that particular time, we discovered that in just one ministry alone, there were over a thousand individuals bearing fake letters of appointments.\n“The Office of the Head of Service received another report, this time from the Federal Civil Service Commission itself, forwarding names of over 500 persons in various MDAs that possess fake letters of appointments.”"
  },
  {
    "headline": "PDP Zoning Committee Concludes Sitting, Declines To Speak On Outcome",
    "summarized_story": "﻿The Zoning Committee of the Peoples Democratic Party (PDP) has concluded its sitting on the party’s zoning arrangement.\nChairman of the Committee, Governor Samuel Ortom of Benue State, who briefed journalists at the end of the committee’s meeting in Abuja, said members have reached a unanimous agreement on the matter.\nHe however declined to speak on what the position of the committee is.\nREAD ALSO: Conduct Democratic Primaries Or Face Disqualification, INEC Tells Political PartiesHe said a report will be forwarded to the National Executive Committee of the party.\nThe PDP zoning committee was inaugurated on March 24 by the National Working Committee following the controversies surrounding the party’s arrangement for the presidency ahead of the 2023 general elections."
  },
  {
    "headline": "Conduct Democratic Primaries Or Face Disqualification, INEC Tells Political Parties",
    "summarized_story": "Ahead of the 2023 general elections, the Independent National Electoral Commission (INEC) on Tuesday advised political parties to ensure their primaries are properly conducted in line with relevant laws.\nMr Okoye warned that the electoral agency will not hesitate to disqualify parties in primaries that do not adhere strictly to the principles of internal democracy.\nHe also advised parties to avoid contentious primaries that may lead to unnecessary lawsuits.\nAll the activities are in line with the provisions of the Constitution of the Federal Republic of Nigeria 1999 (as amended) and the Electoral Act, 2022.\n“Political parties are enjoined to avoid acrimonious primaries that could result in unnecessary litigations that may lead to failure to nominate and field candidates for elections in some constituencies.”"
  },
  {
    "headline": "Senate Extends Implementation Of 2021 Budget",
    "summarized_story": "The Senate has extended the implementation of the 2021 Appropriation Act from March 31 to May 31, 2022.\nThe Upper Chamber gave approval for the budget extension after examining a bill to Amend the 2021 Appropriation Act.\nPresenting the bill during Tuesday’s plenary session, Senate Leader Yahaya Abdullahi, said the extension of the budget period is necessary to ensure that ongoing projects are completed.\nAbdullahi said that the extension of the budget period became necessary in order to complete projects close to completion.\n“As you are aware, the 2021 virement of the aggregate sum of N276 billion was approved for several MDAs by the National Assembly in December 2021 along with 100 per cent release of the 2021 Capital Budget of the MDAs,” he said."
  },
  {
    "headline": "Army Recovers Weapons From Boko Haram Enclave In Sambisa",
    "summarized_story": "The Chief of Army Staff, Lieutenant-General Farouk Yahaya has commended troops of Operation Hadin Kai in the Northeast for capturing large number of weapons from the enclave of Boko Haram insurgents during its recent operations in Sambisa forest.\nREAD ALSO: Army Dismisses Viral Video Of Soldier Allegedly Abandoned By Colleagues“The weapons that were captured from these terrorists speak for themselves,” the army chief said.\nI am very impressed with the commitment and zeal I am seeing in the theatre and indeed all our theatre of operations.\n“Challenges are part of operations but the military and other agencies are not deterred by the few setbacks we’ve had.\nOur call to all these terrorists and bandits is to know that the tide is against them.”"
  },
  {
    "headline": "Saraki, Others visit Governor Makinde, canvass consensus for PDP Ticket -",
    "summarized_story": "Some stakeholders in the People’s Democratic Party say they are working hand in hand ensure a consensus Presidential candidate of the party that will rescue the country from insecurity and economic crisis and other problems.\nFormer Senate President Bukola Saraki made this known while speaking with newsmen in Ibadan at after a meeting with Governor Seyi Makinde.\nThe former Senate President disclosed that since the focus of the party is centred on providing credible and people-oriented government for Nigerians, all aspirants are ready to abide with the position of the party.\nIn his response, Governor Seyi Makinde said the meeting was fruitful, noting that Nigerians should take the party seriously since it has been working on coming up with a presidential candidate who would be acceptable to all.\nMakinde declared that the consensus arrangement still remained intact, adding that it would ensure that people understand the arrangement and any confusion that arises would be addressed."
  },
  {
    "headline": "APC is our party, we cannot leave",
    "summarized_story": "Nigeria’s minister of information and Culture, who also doubles as a leader of the All Progressive Congress in Kwara State, Lai Mohammed, has called on his supporters in the All Progressives Congress (APC) in the State not to defect to the Social Democratic Party (SDP).\nGoing Further He said “On my part, as a founding member of the APC, as someone who has toiled endlessly to build the party and as one who has worked withstakeholders to deliver Kwara State to the APC, leaving the party is not an option”.\n“I am a bonafide member of the APC and I have no intention of leaving the party”.\n“All through my political career, I have always remained loyal to any party in which I have found myself.\nHe used the opportunity to once again call on the leadership of the APC to urgently and decisively address the issues that have forced some members of the party in Kwara to contemplate leaving."
  },
  {
    "headline": "MINDA PDP elders present Senate form to Governor Ortom",
    "summarized_story": "Elders from the Masev, Ihyarev and Nongov Development Association, MINDA, have presented Expression of Intent and Nomination Forms for Senate to Governor Samuel Ortom.\nSecretary of the MINDA PDP Elders Forum, Charles Torbunde, led other members of the forum cutting across Guma, Makurdi, Gwer-East and Gwer-West to make the presentation.\nFew months ago Governor Samuel Ortom made known his interest to run for the Senator seat representing Benue North West Senatorial.\nReceiving the forms, Governor said he was humbled stating that the MINDA elders led him to solicit the support of Jemgbagh for the Senate aspiration.\nGovernor Ortom pledged to represent the people well and speak for them without fear or favour, stressing that he will represent the interest of his constituents."
  },
  {
    "headline": "Police arrest 22 cultists in Ogun in 48 hours",
    "summarized_story": "The Special squad formed by the Police in Ogun State to tackle the increasing cult clashes in the state has arrested no fewer than 22 suspected cultists in different parts of the state in the last 48 hours.\nA press release issued by the Police Public Relations Officer in Ogun State, Abimbola Oyeyemi says the suspects have confessed their membership of Aye and Eiye confraternities.\nHe noted that they were apprehended when the Squad stormed their hideouts at Mayas area of Lafenwa and Oju Ogabra area of Sapon area of Abeokuta.\nHe added that some of the suspects were also arrested in Sagamu during the similar operation carried out by the squad.\nThe Police Public Relations Officer noted that the suspects are currently being investigated to ascertain their roles in the cult war that engulfed the State recently which claimed many lives."
  },
  {
    "headline": "Nigeria: Terrorists Reportedly Kill 15 Soldiers, Three Civilians in Kaduna Military Camp Attack",
    "summarized_story": "About 15 soldiers and three civilians were reportedly killed by terrorists in an attack on a military camp at Poll Wire, Birnin Gwari Local Government Area of Kaduna State.\nThe terrorists who were said to be traveling from Niger slState to Zamfara State in large numbers via Birnin Gwari, reportedly launched a deadly attack on the military camp.\nThe source said the terrorists, who were carrying sophisticated weapons engaged the soldiers in a fierce gun battle at the camp.\nHe said the terrorists may have overpowered the soldiers due to their large numbers.\n“They over powered the soldiers after a fierce gun battle probably because of their large numbers and the kind of weapons they carried."
  },
  {
    "headline": "Atiku Approved By God To Become Nigeria’s President, Says Dino Melaye- Trending With Ojy Okpe",
    "summarized_story": "Former governor of Edo state Adams Oshiomhole on Monday declared his interest in contesting a senatorial seat during the 2023 elections at an event to mark his 70th birthday in Edo State while showing off his dance movesIn another development, Former senator representing Kogi West Dino Melaye has joined those endorsing presidential aspirant Atiku Abubakar in his bid to run for the President of Nigeria.\nMelaye described Atiku as the only unifier of the Federal Republic of Nigeria and said that he received three calls from God revealing that Atiku will become Nigeria’s next president.\nFinally, The Federal government announced on Monday, that two million people will start receiving about Twenty Billion Naira from June this year as basic cash transfers under the National Cash Transfer Programme."
  },
  {
    "headline": "Kyiv Mayor Klitschko Says All European Payments to Russia Are ‘Blood Money’",
    "summarized_story": "The flow of “bloody money” to Russia must stop, Kyiv’s mayor said on Tuesday as the West prepared new sanctions on Moscow after dead civilians were found lining the streets of a Ukrainian town seized from Russian invaders.\nRussia denies targeting civilians and said the deaths had been staged by the West to discredit it.\n“Every euro, every cent that you receive from Russia or that you send to Russia has blood, it is bloody money and the blood of this money is Ukrainian blood, the blood of Ukrainian people,” Mayor of Kyiv Vitali Klitschko, dressed in military clothes, told a mayors’ conference in Geneva via video link.\nRussian news agency Interfax cited a deputy Russian foreign minister as saying talks, which last convened on Friday, were continuing via video link.\nSo far, however, Moscow has kept gas flowing to Europe, despite uncertainty over Putin’s demands for payments in roubles."
  },
  {
    "headline": "Civilians and Police Clash in Peru Over Inflation, President Castillo Imposes Curfew in Lima",
    "summarized_story": "Peruvian President Pedro Castillo has imposed a curfew in the capital, Lima, and the port city of Callao following nationwide protests over rising fuel and fertiliser prices.\nPresident Castillo announced the curfew after a meeting with his Council of Ministers.\nSocial protest is a constitutional right, but it must be done within the law,” President Castillo said in a TV address.\nThe curfew – which will affect some 10 million people – has been widely criticised as “authoritarian” by critics of the president.\nThe protests come at a time when Peru is already suffering from high inflation and the president’s popularity is low."
  },
  {
    "headline": "Sudan: ICC to Try Darfur War Crimes Suspect",
    "summarized_story": "A suspected former leader of the pro-government Janjaweed militia has been charged with 31 counts of war crimes and crimes against humanity.\nHe is wanted on charges of genocide and war crimes, which he denies the charges.\nMr Abd-al-Rahman surrendered to the ICC in 2020 after 13 years on the run.\n“He is alleged to have implemented the counter-insurgency strategy of the Government of Sudan that also resulted in the commission of war crimes and crimes against humanity in Darfur,” the ICC said.\nDuring previous court appearances, Mr Abd-al-Rahman said he was the victim of mistaken identity, Reuters news agency reports."
  }
]