[
  {
    "headline": "Collision: FAAN bars untrained officials from driving on airport taxiway",
    "summarized_story": "In a move to forestall aircraft-vehicle collision at the nation’s airports, the Federal Airports Authority of Nigeria has barred untrained airport officials from driving on airport taxiways.\nThe airport authority, in a statement on Friday, insisted that aviation officials must have undergone the mandatory airline drivers training and be certified appropriately by the regulators to drive on the airside at the nation’s airports.\nA taxiway is a path for aircraft that connects a runway with another area of an airport.\nIn the statement signed by the Authority’s General Manager, Corporate Affairs, Henrietta Yakubu, FAAN stressed the need for safety at airports.\nIt was titled, ‘Airside safety; FAAN prohibits untrained officials from driving on the airside’."
  },
  {
    "headline": "World economic group partners NIPC on investment migration",
    "summarized_story": "The World International Economy Group is seeking partnership with the Nigerian Investment Promotion Commission to facilitate the migration of large investment to Nigeria.\nHe added that the partnership would help Nigeria through the commission to see how the people could be empowered especially the youths.\n“We are here to create partnership with NIPC and we are inviting investors around the world to come and partner with us since we have an investment hub.\n“We are bringing these investments that will help Nigeria Youths as well to gain employment as the government cannot provide all these alone.\nResponding, the Director of Investment Promotion, NIPC, Mr Adesina Emmanuel, said that WIEG was of interest in line with what the commission does."
  },
  {
    "headline": "Borno APC Forum drums support for Sheriff to contest NWC position ahead of February convention",
    "summarized_story": "His words: ” It is my singular honour on behalf Borno State ruling All Progressives Congress Aspirants Forum (BOSAPCAF) to call on our distinguished National Secretary of the Forum, Hon Yusuf Sheriff come out and aspire a position for an undisclosed position in NWC of our great party.\n“Although, we are yet to disclose the position in which, the Forum want Sheriff to vie for, because, the Forum is waiting for the leadership of the APC come out with the zoning arrangements before a decision is taken.\n“We, therefore, want Sheriff to declare his intention within 24 hours contest in the forthcoming National Convention of our great party slated to hold on 26th February 2022 in Abuja.\n“This is because, the ‘Call to Service’ on Sheriff is necessary and apt, considering his contribution towards better the lives of our members, particularly APC youths.\n“It is on records that, Sheriff has secured an appointment for several APC supporters who have been placed in juicy appointment nationwide."
  },
  {
    "headline": "STF Forces neutralize notorious kidnap syndicate, recover arms, ammunition in Jos",
    "summarized_story": "Troops of Operation Safe Haven acting on credible intelligence have burst and neutralised a notorious gang of kidnappers on the Plateau.\nThe syndicate is also believed to be complicit in the Jos jailbreak which was perpetrated last November 2021.\n“The syndicate is also believed to have participated in the Jos prison jailbreak on 28 November 2021.\n“The syndicate met its waterloo when troops of Operation Safe Haven tracked them to Gyero general area where they plan and carry out their nefarious activities.\n“Items recovered from the syndicate includes one AK-47 Rifle, 2 AK-47 rifle magazines, 101 live rounds of 7."
  },
  {
    "headline": "Don’t extend tenure of Service Chiefs; overhaul the security system — CSO tells Buhari",
    "summarized_story": "The CSO in a statement signed by its executive director, Sani Nurudeen explained that extending tenures of service chiefs has neither added value to the nation’s military nor war against insurgency and other forms of insecurity.\nWe wish to remind Mr President that this practice of keeping Service Chiefs beyond their retirement dates does not add value to the security architecture of the country.\nThe security apparatus must quickly be overhauled and new blood injected into the system”, the statement added.\nPlaying politics with security is the single reason why Boko Haram has again taken over two Local Government Areas in Borno State.\nTaking the game to the doorsteps of the terrorists is the only way to defeat them and secure the country."
  },
  {
    "headline": "APC National Chairman: The Ides of February 26 has come as Buhari, Governors, Senators, Stakeholders hold the ace",
    "summarized_story": "I have the support of the majority of the members of the National Assembly, especially the Senators and many APC governors.\nHe is seen as a perfect aspirant with no baggage and a National Chairman who will not spend his time visiting the anti-graft agencies to defend corruption cases.\nAlthough Al-Makura is said to have the support of his state governor, Abdullahi Sule and also said to have the blessing of Buhari like Senator Musa.\nHis ambition has however split the Senate caucus with some senators that want Sani Musa to be the party’s National Chairman.\n“We also note that since the successful merger process the produced the ruling APC former governors have had enough time."
  },
  {
    "headline": "Ekiti PDP: How Fayose, Olujimi, others signed agreement on positions sharing, affirmation of 2020 congresses, others",
    "summarized_story": "The National Working Committee (NWC) of the PDP had in its meeting of Wednesday, January 12, 2022, adopted the report of the 7-man Committee ahead of the June 18, 2022, Ekiti governorship election.\nUmaru M. Bature, the NWC also commended members of the 7-man Committee for their dedicated efforts in the very important assignment.\nFormer Governor Segun Oni, who was the seventh person in the meeting was said to have attended as an observer.\nPDP Deputy Governorship candidate in the 2018 election, Hon Deji Ogunsakin and former House of Reps member, Hon Segun Adekola represented the Fayose group in the meeting while former Senator, Duro Faseyi and Otunba Yinka Akerele represented the Olujimi group.\nOn outstanding congresses, the source said it was resolved that Senator Olujimi should produce the party officials in her Local Government of Ekiti East while three gladiators were identified in Gbonyin Local Government for the sharing of positions."
  },
  {
    "headline": "Biafra: ‘Nigerian Army set out as Pythons to terminate Nnamdi Kanu’s life’ – Abia court",
    "summarized_story": "The Abia State High Court has accused the Nigerian Army of attempting to “terminate” the life of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nJustice Benson Anya held that the Nigerian Army set out as “pythons” to terminate Kanu’s life.\nRecall that the Nigerian Army had in 2017 invaded Kanu’s residence in Afaraukwu, Abia State.\nRuling on the suit, the judge described the action of the Nigerian Army as notorious hence the Nigerian government should tender an apology.\n“It is the view of this court that the Army set out as pythons to TERMINATE the life of Nnamdi KANU."
  },
  {
    "headline": "Court issues last warning to Immigration’s senior lawyer over Odili’s passport",
    "summarized_story": "Adamu, who for the second time declined to appear in court, was given another opportunity of February 7 in the interest of a fair hearing.\nAt Friday’s proceedings, Odili’s lawyer, Ifedayo Adedipe SAN, recalled the order of December 21 last year issued by the court that the Immigration’s senior lawyer must appear in court today and lamented that for the second time, Adamu was not in court and had bluntly refused to release the passport as ordered by the court.\nAdedipe urged the court to, among others, penalise Adamu for disrespecting the court and treating it with contempt.\nHowever, unimpressed with the apology, Justice Ekwo said in the interest of a fair hearing, he would give the lawyer another opportunity.\nLet him deny himself fair hearing, then, the court will take necessary steps.”Justice Ekwo subsequently fixed February 7 for the lawyer to appear in court for his defence in the alleged unprofessional conduct."
  },
  {
    "headline": "Pirates may kill naval officer, UNICAL prof, 10 others – Released victims",
    "summarized_story": "The pirates, on Wednesday, blindfolded and released a four-year-old child, a pregnant woman, an injured person, an elderly woman and the driver of the boat at Akpabuyo Local Government Area of Cross River State.\nThe released victims, who recounted their ordeal, said they heard them vow that if by weekend those still in their den cannot pay the ransom then they will be killed.\nThey Kidnapped us and took us to one dangerous creek, we just departed Calabar and had not approached Oron.\nEven while they were taking five of us out to free, they blindfolded our eyes, especially mine.\nOne of the victims who tried escaping was recaptured and was well beaten.”"
  },
  {
    "headline": "JusticeForHanifa: Kano govt orders closure of primary school minor was buried",
    "summarized_story": "The Kano State Government has ordered the immediate closure of a private school, Noble Kids Academy, at Kwanar Dakata, in the Nassarawa Local Government Area, where the body of an abducted five-year-old girl, Hanifa Abubakar, was buried by the suspects.\nThe state Commissioner for Education, Muhammad Kiru, announced the closure of the school in a statement.\nDAILY POST reported earlier that the remains of the victim, who was abducted in December, were discovered in a shallow grave at the primary school.\n“The school has also been closed till further notice.”He admonished parents whose children attend the private school to stop them from doing so pending the completion of the investigation.\nMeanwhile, the Kano State Police Command confirmed the arrest of two prime suspects, Abdumalik and Hashim Isyaku, who demanded N6 million ransom for her release before she was killed."
  },
  {
    "headline": "Presidency: ‘We’ll fight, vote against Tinubu for opting to continue Buhari’s policies’ – Benue Gov, Ortom",
    "summarized_story": "The former Lagos State governor said he would continue with the policies of Buhari’s administration if elected as president.\nHowever, Ortom pointed out that Buhari’s policies and programmes were bad.\nThe Governor warned that the presidential aspirant would fail in his ambition if he opts to pursue Buhari’s policies.\nAccording to Ortom: “I heard about one of the presidential aspirants who said he would continue from Buhari’s good legacies.\nI want to tell him that if nobody has told him, me I want to tell him that Buhari’s policies and programmes are not good."
  },
  {
    "headline": "Insecurity: LG, RRS institute taskforce to tackle ‘Awawa’ cult in Agege",
    "summarized_story": "The Agege Local Government and Rapid Respond Squad (RRS) in Lagos State have agreed to set up taskforce to tackle the menace of ‘Awawa’ cult and other criminal activities within Agege neighbourhood.\nAlhaji Ganiyu Egunjobi, the Executive Chairman of Agege Local Government, made the disclosure on Thursday during a Security Summit organised by the council.\nEgunjobi said that the local government had established a joint taskforce with the RRS to eradicate insecurity challenges in Agege community.\nAlhaji Haruna Maikudi, the Arewa Community Leader in Agege, thanked the council for organising such important summit to end insecurity in Agege.\nAccording to him, the Arewa in Agege community would work together to ensure peaceful coexistence in the local government."
  },
  {
    "headline": "Buhari returns to Dodan Barracks, 37 years later, by Femi Adesina",
    "summarized_story": "He had been assassinated at that spot on February 13: 1976, while driving to the office from Dodan Barracks.\nSans teeth, sans eyes, sans taste, sans everything.\nEven if it is to turn it to a national monument, Dodan Barracks needs to be preserved for posterity.\nI remember the tall, young, gangling Muhammadu Buhari, and his unsmiling kindred spirit, Tunde Idiagbon, holding court in those days in Dodan Barracks.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "JUST IN: Many feared dead, injured as explosion rocks Ghana",
    "summarized_story": "JUST IN: Many feared dead, injured as explosion rocks GhanaBy Alao Abiodun with agency reportsMany people were feared dead in an explosion in Bogoso, a town in western Ghana on Thursday evening.\nAccording to local authorities, the explosion occurred when a mining truck carrying explosives for a gold mine collided with a motorcycle.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\n- Advertisement -Ghana’s President Nana Akufo-Addo in a series of tweets described the development as a “truly sad, unfortunate and tragic incident”.\n“It is a truly sad, unfortunate and tragic incident, and I extend, on behalf of the government, deep condolences to the families of the deceased, and I wish the injured a speedy recovery."
  },
  {
    "headline": "Why Nigeria must tackle terrorism, banditry, by NIIA DG",
    "summarized_story": "He argued that the government has been very inclusive in its approach to dealing with Boko Haram insurgency.\nThe DG said there is need to address the issue that have provoked acts of terrorism and banditry that becomes a question of security.\nHe noted that Nigeria has had degrading of social infrastructure and safety nets.\nHe said: “The Government has been very inclusive in its approach to dealing with Boko haram.\nMilitary, security forces."
  },
  {
    "headline": "Don’t rest on your oars, Board members urge TheNation employees",
    "summarized_story": "The Board of Directors of Vintage Press Limited, publishers of The Nation, SportingLife and Gbelegbo, yesterday urged the company’s employees to remain committed to its growth.\nVintage Press Limited Chairman Wale Edun spoke at a reception at the company’s headquarters in Lagos for employees who won awards at the 2021 editions of the Nigeria Media Merit Awards (NMMA) and others.\nEdun was accompanied by other board members: Prof. Adebayo Williams, Mr. Adeleke Adeyemo and Hon.\nDuru, who spoke on behalf of the winners, expressed appreciation to the board members for their support.\nWeekend Editor Festus Eriye applauded the board for interacting with the members of staff of the organisation."
  },
  {
    "headline": "Breaking: Gunmen abducts Bayelsa State Commissioner for Trade",
    "summarized_story": "From Femi Folaranmi, YenagoaGunmen have kidnapped the Bayelsa State Commissioner for Trade and Commence, Mr Otokito Federal Oparmiola.\nAccording to investigations, Otokito was kidnapped by heavily armed men from his residence at Otuokpoti, Ogbia Local Government Area.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nSources said the gunmen invaded the community at about 11pm, Thursday night and fired severally shots to scare people away before they proceeded to Otokito’s residence where he was whisked away to an unknown destination.\nDetails later"
  },
  {
    "headline": "Decision on petrol subsidy removal to come in June –NEC",
    "summarized_story": "Sule, who briefed alongside his Edo State counterpart, Godwin Obaseki, said any decision on removal of subsidy would be taken after the budget provision runs its course in June.\nHe said the Federal Government was spending about N2 trillion on petroleum subsidy, an amount he said could have been channelled to the nation’s infrastructure, education, healthcare among others.\n“As you all know and aware, the issue of subsidy has been one matter that NEC has deliberated on, for more than a year now.\nAll of these findings were presented to NEC and NEC has had several deliberations.\nSo, NEC has not come up with any decision yet."
  },
  {
    "headline": "No one’ll be allowed to raise army of thugs –Buhari",
    "summarized_story": "From Noah Ebije, KadunaPresident Muhammadu Buhari has warned that nobody would be allowed to raise an army of thugs to force himself on the people.\n“Nobody should be allowed to raise an army of thugs to force himself on the people.\nNoting the impact of the urban renewal programme, he said he could no longer find his way around Kaduna, even as someone who has lived in the city for long.\nEl-Rufai launched the Kaduna State Urban Renewal Programme in June 2019, shortly after which the projects commenced in Kaduna before those of Kafanchan and Zaria started.\n“The goal of the urban renewal programme is to regenerate Kaduna, Kafanchan and Zaria, the three major cities in the state.”"
  },
  {
    "headline": "You’re haunted by innocent blood spilled during your tenure, Imo",
    "summarized_story": "He claimed that since the police arrested Uche Nwosu in connection with insecurity in the state, Okorocha has been behaving abnormally.\nHe said the recent behaviour of the former governor depicted an early stage of insanity, which needs to be checked before it develops into full madness.\n“Is it not worrisome that Okorocha has veered from psychotic paranoid to being a clown and now a choirmaster of an Area Boys choir?\nWhen he is not howling about persecution by Uzodimma, he is teaching the IG and the police how to do their work.\n“The clownish display by Okorocha about a phantom shooting of God is the height of desperation by a man who wants to make his house boy, turned in-law, to be the governor of Imo State."
  },
  {
    "headline": "Reps mull 10-year jail term for ponzi scheme operators",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, passed for second reading, a bill to repeal the Investments and Securities Act (ISA) 2007 and enact the Investments and Securities Act to establish Securities and Exchange Commission (SEC).\nThe bill, which seeks to make SEC the apex regulatory authority for the Nigerian capital market, prescribes 10-year jail term for ponzi scheme operators, in the country, among others.\nIbrahim, in his lead debate, said current trends in the capital market has made the review of the Investments and Securities Act, Act No.\nIbrahim said”there are new provisions on the regulation of Financial Market Intermediaries (FMIs) such as Central Counter Parties (CCPs), Clearing Houses, Trade Depositories etc.\nSo as of the time of signing the current account, the ponzi scheme was not in existence in Nigeria."
  },
  {
    "headline": "Buhari: El-Rufai is Writing His History in Letters of Gold",
    "summarized_story": "*Vows never to let anyone impose himself on NigeriansDeji Elumoye in Abuja and John Shiklam in KadunaPresident Muhammadu Buhari, yesterday, while inaugurating some projects in different parts of Kaduna State, gave a generous pass mark to the Northwestern state governor, Malam Nasir El-Rufai, saying he was writing history in letters of gold.\nIn yet, another instance, an overly impressed Buhari added: “Thank you very much, Your Excellency, and remarkably, you became my governor.\nHe praised Governor El-Rufai for completing people-oriented projects in the Kaduna metropolis as well as other senatorial districts in the state.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nBuhari is expected to be in Zaria today to commission more road projects under the Urban Renewal Programme."
  },
  {
    "headline": "IMF Proposes $50bn Trust Fund to Help Low-income Countries",
    "summarized_story": "Ndubuisi FrancisAs the COVID-19 pandemic continues to exert heavy strain on the global economy, the International Monetary Fund (IMF) is proposing a $50 billion trust fund which could help low-income and vulnerable middle-income countries to build resilience and sustainability.\nThe trust fund is part of IMF’s options for channeling some of the $650 billion Special Drawing Rights (SDRs) issued in August 2021 to countries with strong external financial positions as well as vulnerable countries through a Resilience and Sustainability Trust (RST).\nLike the IMF’s highly concessional and currently zero interest rate Trust for low-income countries, the RST’s resources would be mobilised on a voluntary basis from members who wish to channel their SDRs or currencies for the benefit of poorer or vulnerable countries.\nThe IMF stated: “Even as countries continue to battle COVID-19, it is crucial not to overlook the longer-term challenge of transforming economies to become more resilient to shocks and achieve sustainable and inclusive growth.\nIt added that the RST’s central objective was to provide affordable long-term financing to support countries as they tackle structural challenges."
  },
  {
    "headline": "NEC: Fuel Subsidy Stays for Now, But May Be Removed Before Year End",
    "summarized_story": "It, however, did not rule out the possibility of the subsidy being removed before the end of this year.\nThe federal government had disclosed plan to phase out the fuel subsidy regime by the second half of this year.\nWhen asked if fuel subsidy removal was discussed at the meeting, Obaseki said though Council discussed the issue, no decision was taken on the matter.\nAccording to him: “The issue of subsidy has been one matter that NEC has deliberated on, for more than a year now.\n“You have to understand that we didn’t make any presentations on the fuel subsidy because there has not been a decision."
  },
  {
    "headline": "Tinubu Visits IBB, Seeks Ex-Military Leader’s Blessing for Presidential Bid",
    "summarized_story": "By Laleye DipoAll Progressives Congress National Leader and former Lagos State Governor Asiwaju Bola Ahmed Tinubu Thursday visited former military president, General Ibrahim Badamasi Babangida, to “get his blessing”.l for his presidential bid.\nTinubu after the parley told newsmen that he was in IBB’s residence to seek his blessing, saying ” there is no way I will visit Niger state without visiting IBB and receive his prayers.\n“I cannot come to Niger state and not stop by to pay a courtesy call on the enigma, General Ibrahim Badamasi Babangida”, Tinubu said.\nGenerally, I came to Niger state to commiserate with the Governor and the people of Niger state.\nThe presidential aspirant had earlier paid a courtesy call on Governor Bello, who spoke glowingly of his contributions to the development of Lagos State."
  },
  {
    "headline": "Buhari: How I Cheated Death in 2014",
    "summarized_story": "Inaugurates flyover, other projects in KadunaDeji Elumoye in AbujaPresident Muhammadu Buhari has gone down memory lane to recollect how he cheated death in Kawo, Kaduna State in 2014.\nSpeaking Thursday while inaugurating the 800-metre long flyover in Kawo, Kaduna State, the President recounted how he narrowly escaped a targeted bomb attack in the vicinity in 2014.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, President Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nAccording to him: ”For many years, I always plied this route and I cannot recount how many times I crossed it.\nAt the Murtala Square, the new city centre of Kaduna State, President Buhari while admiring the remodelled edifice, recalled that he was constrained by family challenges to relocate from Daura to Kaduna after he was released from detention as a former military Head of State."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "Pictures Of Northern Governors Posing With Associate Of Bandits’ Leader, Turji Raise Suspicion",
    "summarized_story": "Some photographs taken in the recent past showing two governors and an associate of notorious bandits’ kingpin, Bello Turji, standing together have raised dusts.\nIn the picture with the suspect, Musa Kamarawa, who has confessed to working with Turji, are the governors of Zamfara and Sokoto, Bello Matawalle and Aminu Tambuwal, and the deputy governor of Sokoto, Mannir Dan Iyya.\nZamfara and Sokoto are two of the North-west states under attacks by bandits in which hundreds of people have been killed and thousands displaced.\nKamarawa was among those first contacted by Mr Matawalle after he was declared governor in 2019, to facilitate a peace accord with bandits, Premium Times reports.\n“Though Bello Turji didn’t accept the peace accord, there were a lot of bandits who turned in their guns and ammunition through Musa (Kamarawa)."
  },
  {
    "headline": "2023: I visited IBB to receive his blessing, says Tinubu",
    "summarized_story": "Bola Tinubu, presidential aspirant of the All Progressives Congress (APC), says he visited Ibrahim Badamasi Babangida (IBB), former military head of state, to “receive his prayers”.\nAdvertisementSpeaking with journalists on Thursday after meeting with Babangida, Tinubu said he cannot visit Niger state without paying the retired general a courtesy call.\n“There is no way I will visit Niger state without visiting IBB and receive his prayers.\nI cannot come to Niger state and not stop by to pay a courtesy call on the enigma, general Ibrahim Badamasi Babangida,” Tinubu said.\nGenerally, I came to Niger state to commiserate with the Governor and the people of Niger state."
  },
  {
    "headline": "2023: I visited IBB to receive his blessing, says Tinubu",
    "summarized_story": "Bola Tinubu, presidential aspirant of the All Progressives Congress (APC), says he visited Ibrahim Badamasi Babangida (IBB), former military head of state, to “receive his prayers”.\nAdvertisementSpeaking with journalists on Thursday after meeting with Babangida, Tinubu said he cannot visit Niger state without paying the retired general a courtesy call.\n“There is no way I will visit Niger state without visiting IBB and receive his prayers.\nI cannot come to Niger state and not stop by to pay a courtesy call on the enigma, general Ibrahim Badamasi Babangida,” Tinubu said.\nGenerally, I came to Niger state to commiserate with the Governor and the people of Niger state."
  },
  {
    "headline": "Nigeria to benefit as IMF proposes $50bn trust fund for low income countries",
    "summarized_story": "The International Monetary Fund (IMF) says it is proposing a $50 billion trust fund to help low and vulnerable middle-income countries build resilience and sustainability.\nAccording to IMF, the fund will help build resilience to balance of payments shocks and ensure a sustainable recovery.\nThe fund is part of IMF’s $650 billion special drawing rights (SDRs) issued in August 2021 to vulnerable countries boost liquidity through Resilience and Sustainability Trust (RST).\nIt, however, called for collaboration from economically stronger IMF members willing to provide resources to help with long term sustainability.\nWe will build on our experience of working with the World Bank and other international institutions and regional development banks, complementing their lending to provide the best support to member countries,” IMF stated."
  },
  {
    "headline": "Nigeria to benefit as IMF proposes $50bn trust fund for low income countries",
    "summarized_story": "The International Monetary Fund (IMF) says it is proposing a $50 billion trust fund to help low and vulnerable middle-income countries build resilience and sustainability.\nAccording to IMF, the fund will help build resilience to balance of payments shocks and ensure a sustainable recovery.\nThe fund is part of IMF’s $650 billion special drawing rights (SDRs) issued in August 2021 to vulnerable countries boost liquidity through Resilience and Sustainability Trust (RST).\nIt, however, called for collaboration from economically stronger IMF members willing to provide resources to help with long term sustainability.\nWe will build on our experience of working with the World Bank and other international institutions and regional development banks, complementing their lending to provide the best support to member countries,” IMF stated."
  },
  {
    "headline": "Moses Simon's hot form, big teams stumble — 5 talking points from AFCON group stage",
    "summarized_story": "The group stage games at the 33rd Africa Cup of Nations (AFCON) came to an end on Thursday night with several talking points to chew on.\nBig guns like Cameroon, Nigeria, Cote d’Ivoire, Morocco, Tunisia and Egypt booked their places in the Round of 16.\nThe Fennecs emerged as Arab Cup champions and were expected to go far at AFCON 2022.\nAdvertisementGiven the performances of the supposedly small teams in the group stage, we can expect more upsets in the Round of 16 as the battle continues across the match centres.\nEguavoen makes historyAugustine Eguavoen, Super Eagles interim gaffer, became the first coach in the history of AFCON to win all group stage games at two different tournaments."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "Meet the 15 semi-finalists for Pitchstorm 3.0",
    "summarized_story": "Mandila Inc: A startup based in Burkina Faso with an app built to teach and preserve African languages.\nUsing data, they provide farmers with information to plan their pre-planting, planting and post-planting operations.\nFinancial inclusionByte: A Nigerian startup replacing account numbers with a phone number, email, or a byte tag for payments in between banks and other financial institutions.\nAxocheck: A Nigerian startup with a mobile app where users can request and schedule home checkups.\nSpacehunt Inc: A Nigerian mobile app that connects renters and buyers to all of the available properties in their city."
  },
  {
    "headline": "Techpoint Awards 2021: And the nominees are…",
    "summarized_story": "[Updated on December 14, 2021]: The Most Outstanding Logistics Startup 2021 was renamed Most Outstanding Mobility & Logistics Startup 2021.\nOn October 21, 2021, Techpoint Africa called for preliminary nominations for the second edition of Techpoint Awards (Nigerian edition), one of the events lined up for Techpoint Build 2021 scheduled to hold in January 2022.\nAfter carefully looking into entries for the blockchain category, the award committee decided to split it into two sub-categories:As with the inaugural edition, Techpoint Awards 2021 is grouped under three categories: Nomination-only, Users’ Choice, and Techpoint Editorial Choice.\nNewbie of the year 2021This category is for startups founded in 2021 with impressive traction and milestones.\nNigerian App of the Year 2021This category is for user-favourite apps built by Nigerians for Nigerians in 2021."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "Streaming vs cinemas: How Nollywood can thrive",
    "summarized_story": "There is, however, a bigger incentive pushing producers and investors in Nollywood toward streaming services – the promise of a global audience.\nThese limitations have played a role in the popularity of streaming services.\nBut the streaming services have made quality production a must-have and now control how the distribution of the movies is run.\nFor example, in areas where 4G is scarce, users may not be able to enjoy the streaming services.\nIn the absence of streaming services in major parts of the country, cinemas can fill the gap for movie lovers through community cinemas."
  },
  {
    "headline": "Politics behind Ghana’s plot to become West African gas hub",
    "summarized_story": "Ghana’s Africa Cup of Nations campaign may have resulted in a humiliating end after losing to the fourth-smallest African nation, Comoros, yet the West African nation has unveiled plans to share in Nigeria’s lunch by becoming sub-Saharan Africa’s first LNG importer in 2022.\nThe project, which is operated via Ghana’s Tema LNG terminal, is backed by Helios Investment Partners and Africa Infrastructure Investment Managers.\n“Competition is free everywhere in the world, so Ghana is free to add more competition to the West African market.\nIf Nigeria put the right kind of investment in infrastructure it can outpace any competition from any West African country,” Victor Eromosele, the longest-serving former general manager finance of Nigeria LNG Limited said.\nRead also: Nigeria-Ghana bilateral trade commissionExperts say Ghana’s latest plot to become West Africa’s gas hub is expected to test Nigeria’s inability to develop and monetise some of its abundant gas reserves that would otherwise remain stranded or be flared."
  },
  {
    "headline": "Nigeria’s taxman turns attention to digital space",
    "summarized_story": "The Federal Inland Revenue Service (FIRS), Nigeria’s tax collection agency, has disclosed plans to focus more on generating revenues from the digital space as the country ramps up efforts to boost its low tax take.\nMuhammad Nami, executive chairman, FIRS, said this while speaking as the special guest at the Pedabo 2022 Annual Public Private Sector Engagement.\n“In 2022, the Service will give priority to the collection of taxes from the digital economy,” Nami said.\n“The Service has deployed a digital service interface, the Digital Economic Compliance (DEC) Tool, to facilitate the implementation of the Regime.\nAs a percentage of GDP, Nigeria only generates 7 percent in tax revenue, less than half of the frontier market average of 15 percent."
  },
  {
    "headline": "Don Urges FG To Create A Favourable Environment For The Green Manufacturing Technology – Nigerian Observer",
    "summarized_story": "Vincent Aizebeoje Balogun have called on the Federal Government to create a favourable environment for the green manufacturing technology sector to thrive.\nAnd to develop the green manufacturing technology through the use of its local content technology for the production of goods in the manufacturing sector.\n“Rather, we need to employ and develop our green manufacturing sector so that we can create more jobs and take our citizens out of the streets” he said.\nHe urged manufacturers operating in the country to key into the green manufacturing technology for the manufacturing of their products.\n“For green manufacturing to thrive, there has to be an understanding and advocacy on the modus operandi towards green mechanical machining processes."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "Nigeria’s Excess Crude Account now $35m",
    "summarized_story": "Nigeria’s Excess Crude Account now stands at $35,868,086.40 as at 17th January 2022, the National Economic Council has revealed.\nIn his presentation, Mr Agba revealed the current state of Nigeria’s underlisted accounts as at 17th of January 2022.\nAccording to him, “Nigeria’s Excess Crude Account (ECA) Balance As At 17th January 2022 Stands At $35,868,086.40.\n“Stabilization Account Balance As Of 17th January 2022 Stands At N30, 685, 611, 413.79.\nDevelopment Of Natural Resources Account Balance As At 17th January 2022 Stands At N42, 820,382,381.40.”The ECA is a savings account retained by the Federal Government and is funded by the difference between the market price of crude oil and the budgeted price of crude oil as contained in the appropriation bill."
  },
  {
    "headline": "NFF says Peseiro has not signed contract to take over from Eguavoen",
    "summarized_story": "An official of the Nigeria Football Federation (NFF) has said Portuguese coach, Jose Peseiro has not signed any contract to take over as coach of the Super Eagles after the 2021 Africa Cup of Nations.\nThe NFF had before the Nations Cup, indicated that it had hired Peseiro to take over from Augustine Eguavoen, who is currently the NFF technical director.\nEguavoen was put in charge of the team after Gernot Rohr was fired.\n“He is not in Cameroon because we have not signed a contract with him yet, he said.\n“If he had signed a contract, he would have definitely been in Cameroon as planned."
  },
  {
    "headline": "Terrorists kill two officers in Katsina base attack",
    "summarized_story": "Terrorists on Tuesday, killed a soldier and an officer of the Nigeria Security and Civil Defence Corps (NSCDC) during an attack on a military base in Shinfida community, Jibia Local Government Area of Katsina State.\nThe terrorists were said to have stormed the military camp in large numbers and began to shoot at the place sporadically.\n“The terrorists attacked the military base located within Government Day Secondary School Shinfida last Tuesday.\n“They attacked the military base on their motorcycles.\nSimilarly, the Niger State Government has confirmed an attack on Ukuru village in the Bobi District of Mariga Local Government of the state, saying unspecified number of people were killed during the attack."
  },
  {
    "headline": "Teacher abducts Kano school girl for ransom, kills her after she recognized him",
    "summarized_story": "A 34-year-old teacher, Abdulmalik Tanko, have been arrested by the police for abducting and killing a 5-year-old Kano pupil, Hanifa Abubakar.\nFamily sources said he was among the first set of people who came to console her parents after the abduction.\nA statement by the police on Thursday confirmed that Abdulmalik was the one who abducted the little girl.\nThe suspect led a combine Team of Operatives of DSS Kano State, Kano State Police Command’s Medical Team and Team of Operation Puff Adder to the scene.\nThe suspect, according to the police, will be charged to court upon completion of investigation."
  },
  {
    "headline": "Diri’s Wife Leads Campaign Against Ritual Killings, Others",
    "summarized_story": "Wife of the Bayelsa State governor, Dr Gloria Diri, has led a coalition of civil society and girl-child welfare advocacy groups to campaign against ritual killings and harvest of human organs in some parts of the state.\nShe called on security agencies to step up the protection of the girl-child in the state.\nLet us watch and protect one another against ritual killing.\nWe are also now against out-of-court settlements and we want the law to punish the perpetrators.\nRitual killing is a distraction because if a child goes missing, government will abandon what they are doing and go in search of the missing child.”ADVERTISEMENT"
  },
  {
    "headline": "56 Years Of Denial Fuelling Biafra Agitation – Ohanaeze Youths",
    "summarized_story": "Apex Igbo socio-cultural youth organisation, Ohanaeze Youth Council (OYC) has attributed the agitation for the restoration of the Sovereign State of Biafra to the denial of a Nigeria president of the Southeast extraction for 56 years.\n“Others are Lower Nigeria Congress led by Tony Nnadi, Biafran National Council led by Asari Dukubo, Biafra National Guard led by Comrd.\nInnocent Orji, Biafra National Youth Guard led by Comrd.\nObinna Ude, Biafra ZOINIST led by Benjamin Onwuka, Biafra Shadow Government led by Engr.\nTherefore, they seek secession for the actualisation of the state of Biafra” Igboayaka revealed."
  },
  {
    "headline": "Minister Lauds Buhari’s Approval Of Minna-Baro Rail Line Project",
    "summarized_story": "He said the approval which is an attestation to President Muhammadu Buhari’s commitment to infrastructure development would boost trading, mining and agro allied activities in and around the state and improve the efficiency of National Inland Waterways Authority (NIWA).\nSambo stated this when he played host to the management team of the National Inland Waterways Authority (NIWA), led by its Managing Director and Chief Executive Officer, Chief George Moghalu who paid a courtesy visit to the Honourable Minister.\nHe said he was sure of increased success in the Federal Ministry of Works and Housing with the pedigree of the Honourable Minister, Mr.Babatunde Raji Fashola, SAN who he referred to as his brother.\nHe thanked the NIWA team for the courtesy visit and their best wishes for him while pledging to continue the bond of relationship with NIWA, his former office which he described as a family relationship and also promised to give them support where necessary.\nEarlier, the managing director and chief executive officer National Inland Waterways Authority, Chief George Moghalu told the Minister that they were in his office to congratulate him on his appointment as the Minister of State for Works and Housing and wish him well."
  },
  {
    "headline": "Minister Lauds Buhari’s Approval Of Minna-Baro Rail Line Project",
    "summarized_story": "He said the approval which is an attestation to President Muhammadu Buhari’s commitment to infrastructure development would boost trading, mining and agro allied activities in and around the state and improve the efficiency of National Inland Waterways Authority (NIWA).\nSambo stated this when he played host to the management team of the National Inland Waterways Authority (NIWA), led by its Managing Director and Chief Executive Officer, Chief George Moghalu who paid a courtesy visit to the Honourable Minister.\nHe said he was sure of increased success in the Federal Ministry of Works and Housing with the pedigree of the Honourable Minister, Mr.Babatunde Raji Fashola, SAN who he referred to as his brother.\nHe thanked the NIWA team for the courtesy visit and their best wishes for him while pledging to continue the bond of relationship with NIWA, his former office which he described as a family relationship and also promised to give them support where necessary.\nEarlier, the managing director and chief executive officer National Inland Waterways Authority, Chief George Moghalu told the Minister that they were in his office to congratulate him on his appointment as the Minister of State for Works and Housing and wish him well."
  },
  {
    "headline": "Kwara Executes 143 Road Projects In 3 Years",
    "summarized_story": "Kwara State government has worked on 143 roads in the last three years.\nADVERTISEMENTHe said that the state government in collaboration with security agencies would embark on the arrest and prosecution of offenders, especially shop owners along such roads.\n“There’s a need for attitudinal change among our people, especially artisans and shop owners along major roads in the state, particularly in the Ilorin metropolis.\nWhat they don’t know is that the government would spend money meant for other people- oriented projects on repair of the damaged roads.\nThe state government would soon start prosecuting shop owners along such roads”, he said."
  },
  {
    "headline": "17 dead, 59 injured as explosion rocks Ghana town",
    "summarized_story": "At least 17 people were killed and 59 injured Thursday by an explosion that devastated part of a town in western Ghana after a truck carrying explosives collided with a motorcycle, the government said.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\nA truck carrying explosives collided with a motorcycle in western Ghana Thursday, causing an immense explosion and a huge “loss of lives”, the Ghanaian president said.\nGhana has suffered a series of gas explosions in recent years caused by leaking fuel.\nIn 2017, at least three people were killed and dozens injured after a tanker truck carrying natural gas caught fire in Accra, triggering explosions at two fuel stations and killing three people."
  },
  {
    "headline": "17 dead, 59 injured as explosion rocks Ghana town",
    "summarized_story": "At least 17 people were killed and 59 injured Thursday by an explosion that devastated part of a town in western Ghana after a truck carrying explosives collided with a motorcycle, the government said.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\nA truck carrying explosives collided with a motorcycle in western Ghana Thursday, causing an immense explosion and a huge “loss of lives”, the Ghanaian president said.\nGhana has suffered a series of gas explosions in recent years caused by leaking fuel.\nIn 2017, at least three people were killed and dozens injured after a tanker truck carrying natural gas caught fire in Accra, triggering explosions at two fuel stations and killing three people."
  },
  {
    "headline": "Drug cartel violence: Mexico records 33,308 murders in 2021",
    "summarized_story": "Mexico recorded 33,308 murders last year, marking a 3.6 percent decrease compared with 2020, in a country long plagued by drug cartel violence, official figures showed Thursday.\nHomicides were on a “downward trend,” Security Minister Rosa Icela Rodriguez said after the second consecutive annual improvement.\nMurders hit 34,690 in 2019, the highest on record, before dropping slightly to 34,554 in 2020.\nSince 2006 when the government of then-president Felipe Calderon launched a controversial anti-drug military operation, Mexico has recorded more than 340,000 murders, according to official figures.\n“The reality is that Mexico is going through one of its worst times in terms of violence,” he said."
  },
  {
    "headline": "Drug cartel violence: Mexico records 33,308 murders in 2021",
    "summarized_story": "Mexico recorded 33,308 murders last year, marking a 3.6 percent decrease compared with 2020, in a country long plagued by drug cartel violence, official figures showed Thursday.\nHomicides were on a “downward trend,” Security Minister Rosa Icela Rodriguez said after the second consecutive annual improvement.\nMurders hit 34,690 in 2019, the highest on record, before dropping slightly to 34,554 in 2020.\nSince 2006 when the government of then-president Felipe Calderon launched a controversial anti-drug military operation, Mexico has recorded more than 340,000 murders, according to official figures.\n“The reality is that Mexico is going through one of its worst times in terms of violence,” he said."
  },
  {
    "headline": "Breaking: Bayelsa commissioner Otokito Oparminola kidnapped",
    "summarized_story": "Bayelsa State Commissioner for Trade and Commence, Mr Otokito Federal Oparminola has been kidnapped by gun-toting men.\nOtokito was kidnapped by the heavily armed men from his residence at Otuokpoti, Ogbia Local Government Area on Thursday night.\nThe gunmen invaded the community at about 11pm and fired several shots to scare people away before they stormed Otokito’s residence.\nThey then whisked him away to an unknown destination, according to The Sun newspaper."
  },
  {
    "headline": "What did PDP do to deserve the loyalty of Igbo?",
    "summarized_story": "What did the PDP do to deserve the loyalty of the Igbo?\nThe Igbo have trudged with the PDP through thorns and thistles, yet have nothing to show for their years of blind loyalty.\nWhat did the PDP do to deserve the loyalty of the Igbo?\nToday and like in the past, the Igbo elite consort with the PDP for their own survival – and not for the advancement of the Igbo.\nI ask again, what did the PDP do to deserve the loyalty of the Igbo?"
  },
  {
    "headline": "Police Arrest Kano Teacher Who Abducted, Killed Schoolgirl, Hanifa Despite Collecting Ransom",
    "summarized_story": "Abdulmalik Tanko was arrested in Kano State for kidnapping and killing Hanifa, a 5-year-old child, despite paying a portion of the N6 million ransom sought.\nSuraj Suleiman, Hanifa’s uncle, confirmed Hanifa’s death and the retrieval of her body at a mushroom private school in Tudunwada, Nasarawa local government area of Kano.\nTanko was Hanifa’s teacher, and it’s been suggested that he murdered her because she recognized him.\n“After his wife rejected to keep Hanifa, he took her to Tudunwada where he operates a private school and then laced her tea with rat poison,” he said.\nNigerians on Twitter have taken to Twitter to demand justice for the young girl, using the hashtag #JusticeForHanifa."
  },
  {
    "headline": "BREAKING: 17 dead, 59 injured as explosion rocks Ghana town",
    "summarized_story": "At least 17 people were killed and 59 injured by an explosion that devastated part of a town in western Ghana after a truck carrying explosives collided with a motorcycle, the government said.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\nA truck carrying explosives collided with a motorcycle in western Ghana Thursday, causing an immense explosion and a huge “loss of lives”, the Ghanaian president said.\nGhana has suffered a series of gas explosions in recent years caused by leaking fuel.\nIn 2017, at least three people were killed and dozens injured after a tanker truck carrying natural gas caught fire in Accra, triggering explosions at two fuel stations and killing three people."
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Attack Chibok, Displace Residents From Borno Communities",
    "summarized_story": "Boko Haram militants stormed Pemi village in the Chibok Local Government Area of Borno State on Thursday night, forcing many inhabitants to flee their homes.\n“They came around 7:00pm and attacked Pemi village, which is some 15 kilometres away from Chibok town.\nOn Thursday, SaharaReporters reported exclusively that extremists were forcing travelers in some Borno State areas to pay fees.\nTerrorists set up checkpoints in the Gubio Local Government Area on Wednesday, military sources said SaharaReporters, handing tax receipts to travelers.\nResidents of several farming areas in Borno State under the organization’s control were given receipts after the group collected levies and taxes from them."
  },
  {
    "headline": "Banditry: Tinubu Donates N50 Million to Niger State Government",
    "summarized_story": "Former Lagos state governor, Asiwaju Bola Ahmed Tinubu, has donated N50 million to the Niger government to help tackle the security challenges in the state.\nThe donation was revealed by the Tinubu Support Group on its verified Facebook page.\nThe group wrote; “Asiwaju in Minna, donates 50 million naira to the state government to support security challenges faced by the state.”Recall that had earlier reported that Tinubu donated the sum of N50million to families of victims of the recent killings in two local government areas of Zamfara state.\nEarlier, Tinubu met with former Military President, General Ibrahim Babangida at his Uphill Residence in Minna Niger State.\nThe meeting, which lasted for about one hour, also had Niger Governor Abubakar Sani Bello in attendance."
  },
  {
    "headline": "Waye sabon shugaban Nijeriya a 2023?",
    "summarized_story": "A bara na ga mota ɗauke da rubutun da ke nuna niyyar takarar daga gwamnan PDP na Bauchi Bala Abdulkadir Muhammad.\nBa a rasa sauran masu niyyar takarar da ba su gama nazarin yin hakan ba irin tsohon gwamnan Kano Rabi’u Musa Kwankwaso.\nTsohon mataimakin shugaban jami’ar Ahmadu Bello Farfesa Ango Abdullahi ke jagorantara majalisar da ke da mambobi da su ka haɗa da tsohon ɗan siyasa Tanko Yakasai da Ambasada Yahaya Kwande.\nGital ya ba da misali da Janar Gowon da ya dare mulki ya na wajajen shekara 30, Buhari a soja ya na wajen 40 hakanan ma shugaba Ibrahim Babangida.\nHakanan dala kullum tsada ta ke yi da hakan kan ƙara tada farashin kayan masarufi."
  },
  {
    "headline": "Matsayin ayyana ’yan bindiga a ’yan ta’adda",
    "summarized_story": ""
  },
  {
    "headline": "Hubbaren Shehu Ɗanfodiyo: Wurin da ba ya rasa masu ziyara",
    "summarized_story": ""
  },
  {
    "headline": "AFCON: Buhari ya taya ‘yan wasan Super Eagles murna",
    "summarized_story": ""
  },
  {
    "headline": "Kano Govt Closes School Where Five-Year-Old Hanifa Was Killed, Buried",
    "summarized_story": "The Kano State Government has ordered the immediate closure of a private school, Noble Kids Academy, in Nassarawa Local Government Area of the state, where abductors of a pupil, Hanifa Abubakar, were said to have killed and buried her remains.\nFive-year-old Hanifa was abducted late last year and one of those involved in the operation was her teacher, Abdulmalik Mohammed Tanko.\nThe abductors demanded a ransom of N6million but went ahead to kill her after receiving the money.\nRead Also: Kidnapped Five-Year-Old Girl, Hanifa Murdered By Teacher“On investigation, Abdulmalik confessed that the victim, Hanifa was his student at a private school in Kwanar Dakata, Nassarawa LGA, Kano State.\nWondering how he poisoned her, how he watched her struggling to die and how he cut her into pieces."
  },
  {
    "headline": "President Buhari Commissions Bridge Where He Was Almost Killed In 2014 By Boko Haram",
    "summarized_story": "﻿President Muhammadu Buhari has commissioned a bridge in Kaduna in an area where he was almost killed by Boko Haram terrorists.\nThe President, at the time an aspirant, was caught in an explosion at the busy Kawu market area.\nDuring the commissioning of the Kawu Bridge on Thursday, Governor Nasir El-Rufai recalled the incident.\nMr President will recall this bridge very well because it was just under this bridge that Boko Haram tried to kill you,” the governor said at the event.\nI would not recall how much I crossed it and you told me how there was an attempt on my life on this route,” Buhari added."
  },
  {
    "headline": "Electoral Act Amendment: NGF Commends Senate, Asks Reps To Include Consensus Option",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) has commended the Senate for re-amending the Electoral Act Amendment Bill giving room for direct, indirect, and consensus options for nominating candidates for the various political parties in the country.\nThey commended the Senate for amending clause 84 regarding the mode of candidate selection in the Electoral Act Amendment Bill.\nThe state governors also discussed issues as regards the nation’s security challenges, health, food security, among others.\nGovernors at the meeting include the NGF Chairman and Ekiti State Governor, Kayode Fayemi; Kano State Governor Abdullahi Ganduje; Nasarawa Governor Abdullahi Sule; Anambra Governor Willie Obiano; Oyo State Governor Seyi Makinde and Osun State Governor Gboyeba Oyetola.\nHowever, unlike their counterparts in the Senate, the Reps adopted direct and indirect primaries but expunged the option of consensus candidature."
  },
  {
    "headline": "We Will Continue To Invest In Road Transport Infrastructure – Gbajabiamila",
    "summarized_story": "The Speaker of the House of Representatives, Femi Gbajabiamila, has assured that the Green Chamber will continue to help the transport industry to thrive and invest in its infrastructure.\nHe stated this on Thursday during the Commissioning the national headquarters of the Road Transport Employers Association of Nigeria (RTEAN) in Abuja, where he noted the critical role played by the transport industry in the country.\nWe will continue to do what we can to help your industry thrive,” he added.\nHere in Nigeria, we are still grappling with the effects of this pandemic on our economy,” Gbajabiamila noted.\n“The road transport sector, like other sectors, has not been spared from the consequences of the economic contraction."
  },
  {
    "headline": "President Buhari Says Democratic Principles Must Guide Democratic Choices",
    "summarized_story": "To this end, he spoke about the use of the police and the military, in dealing with security situations but urged Nigerians to develop confidence in civil authority to build a system “free of chaos”.\n“Nobody,” he warned emphatically, “should be allowed to raise an army of thugs to force himself on the people.\nPresident Buhari, who urged residents of the area to show appreciation for the projects, also commended Alhaji Muhammed Isa, the Emir, for his consolidation of peace among the diverse ethnic and religious communities of the emirate.\nIn acknowledging the improvements in security in the area, the Emir requested permanent bases for the Air Force and the Mobile Police, as well as the restoration of the rail services for which Kafanchan had achieved renown.\nThe president was welcomed to the community by the senator, members of the House of Representatives from the zone, and a large number of enthusiastic citizens who thronged the streets."
  },
  {
    "headline": "APC national chairmanship: I won't join issues with any aspirant",
    "summarized_story": "A former governor of Zamfara state and one of the aspirant for the Chairmanship position in the All Progressives Congress Party, Abdulaziz Yari, said he will not join issues with any other aspirants for the position.\nAdvertisementMr Shinkafi says Abdulaziz Yari was not captured in the revalidation and registration exercise carried out by the party in Zamfara State.\nReacting to the allegations, Abdulaziz Yari says he’s a duly registered member of the All Progressives Congress Party.\nAdvertisementHe also accused Sani shinkafi of formenting trouble with the APC in the state given his antecedent from the All Progressives Grand Alliance (APGA).\nHe called on the Caretaker Committee to disregard Sani Shinkafi describing him as a “noise maker” and means no good for the party."
  },
  {
    "headline": "Tinubu donates N50m to Niger Govt to fight insecurity",
    "summarized_story": "National Leader of the All Progressives Congress, Asiwaju Bola Tinubu has donated N50 Million to the Niger State Government to tackle insecurity, banditry and other security challenges.\nHe made the donation during a condolence visit to the State governor in Minna on Thursday.\nAdvertisementGovernor Bello recently said more than 200 people have been killed in attacks in over 300 communities in the State this year.\nAdvertisement"
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition.\nAdvertisement"
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "South Africa Cricket Coach Boucher Charged Over Racism Allegation",
    "summarized_story": "Cricket South Africa (CSA) has charged the men’s national team coach Mark Boucher with gross misconduct after he was accused of racism by former teammate Paul Adams.\nCSA added that a senior counsel, Advocate Terry Motau, had been appointed to chair a disciplinary hearing into allegations of misconduct against the coach.\nFormer spinner Adams said he had been called a “brown sh*t” in a South Africa team song during his time in the side, which spanned a nine-year period from 1995 to 2004, including by former wicketkeeper Boucher who has since apologised.\nBoucher is in charge of the South Africa One-Day International side who are one game into a three-match home series against India.\nA WhatsApp message received by journalists from CSA had a heading which stated that Boucher and Smith were suspended but this message was deleted almost immediately."
  },
  {
    "headline": "US Seeks to Speed Up Delivery of New F-16 Fighter Jets to Taiwan",
    "summarized_story": "More missions mean more wear-and-tear on Taiwan’s aircraft.\nA move to accelerate the aircraft delivery would be seen in Beijing in part through a political lens, according to Abraham Denmark, a former senior Pentagon official.\nThe missions to intercept Chinese aircraft are putting stress on Taiwan’s air force, which last year had several mishaps, including three fatal crashes.\nTaiwan’s air force last week suspended combat training for its entire F-16 fleet after a recently upgraded model of the fighter jet crashed into the sea in the latest of a series of accidents.\nIn 2020, Taiwan’s air force scrambled jets at least 2,972 times against Chinese aircraft at a cost equivalent to US$905m."
  },
  {
    "headline": "Burkina Faso Authorities Ban Planned Ouagadougou Protests",
    "summarized_story": "Authorities in Burkina Faso’s capital, Ouagadougou, have banned an anti-government protest planned for Saturday, two months after another rally turned violent.\nThe demonstration, called by a civil society movement called Sauvons le Burkina (Save Burkina), was prohibited for “security reasons”, Christian Charles Rouamba, municipal secretary, said in a letter on Thursday.\nTwo officials of the Coalition of African Patriots-Burkina Faso, which had called the rally, were arrested on Thursday, the group said.\nThe worsening security situation has led to street protests calling for Kabore to step down.\nEarlier in January, Burkinabe authorities arrested eight soldiers, including a high-ranking commander, in connection with an alleged plot to “destabilise” the country’s institutions."
  },
  {
    "headline": "Ukraine Tension: Urgent US-Russia Talks in Geneva as Invasion Fears Grow",
    "summarized_story": "US Secretary of State Antony Blinken and Russian Foreign Minister Sergei Lavrov are to hold talks in Geneva later amid mounting fears that Russia could be about to invade Ukraine.\nOn Thursday Mr Blinken warned Moscow of grave consequences if any of its forces crossed the border.\nPresident Vladimir Putin has issued demands to the West, including that Ukraine be stopped from joining Nato.\nThe summit between the top US and Russian diplomats follows moves by Mr Blinken to secure US allies’ backing for sanctions against Moscow.\nState Department officials have said that Mr Blinken will seek to offer Mr Lavrov a “diplomatic off-ramp” to ease tensions."
  },
  {
    "headline": "Tearful Adele Postpones First Live Concerts in Five Years, 24 Hours Before Opening Night",
    "summarized_story": "Adele has postponed her entire Las Vegas residency, just 24 hours before the opening night.\n“I’m so sorry, but my show ain’t ready,” the star told fans in a tearful update on Instagram.\n“I’m sorry, it’s last minute.\nGillian Rowland-Kain, 32, was already on her flight to Las Vegas from New York for Friday’s opening night show when she found out about the cancellation via social media.\nWhile Adele has apparently been beset by production problems and illness within her crew, other Vegas shows have been running as normal."
  }
]