[
  {
    "headline": "Police arrest suspected rail track vandals in Benue",
    "summarized_story": "A criminal syndicate responsible for recent economic sabotage and vandalism of rail tracks in the North-West and North-Central parts of the country have been arrested by operatives of the Nigeria Police Force.\nTheir arrest is part of efforts by the police to clamp down on perpetrators of rail track vandalism and other related economic crimes in the country.\nThe suspects were among 36 others arrested for banditry, kidnapping, armed robbery among others.\nA cordon and search operation conducted by the Police operatives on the building revealed different vandalized rail equipment, stolen rail installation racks, weld-shear, rail puller, other rail accessories and consumables.\nInvestigation is ongoing to identity the destination, the targeted criminal receivers, end-users and other suspects complicit in the crime."
  },
  {
    "headline": "Putin says US-Russia summit ‘constructive’",
    "summarized_story": "A first summit between US President Joe Biden and his Russian counterpart was “constructive”, Vladimir Putin said Wednesday after the talks in Geneva ended.\nWhen exactly is a purely technical question,” Putin told reporters after the summit, which lasted about three and a half hours.\nAfter Biden likened Putin to a “killer”, Russia in March took the rare step of recalling its ambassador Anatoly Antonov.\nAt his press conference after the summit, Putin signalled progress in a number of areas, including an agreement to “start consultations on cybersecurity”.\nHowever, Biden, who had previously characterised Putin as a “killer”, upgraded the Russian leader to “worthy adversary”."
  },
  {
    "headline": "Fuel tanker explosion kills five, injures two in Ogun",
    "summarized_story": "James Ogunnaike – AbeokutaNo fewer than five persons were on Wednesday burnt to death, while two others sustained first degree of injury in a fuel tanker explosion at Ajilete, along Owode-Idiroko road, in Yewa South local government area of Ogun State.\nThe explosion, the witnesses said, killed five persons on the spot, while the two others were injured.\nOlaluwoye said the accident occurred at about 8:15am, pointing out that a bus and a motorcycle were also caught in a web of the explosion and razed.\nThe tank dropped off from the back of the tanker and exploded.\n“The driver had taken away the head of the truck as at the time we got there."
  },
  {
    "headline": "PHED hands over Fake staff to police in Rivers",
    "summarized_story": "The fake staff arrested… desist from making cash payment to individuals, PHED warnsBy Ike UchechukwuA middle-aged man, Brian Anuche has been arrested and handed over to the police for allegedly posing as a staff of Port Harcourt Electricity Distribution Plc (PHED) in Port Harcourt.\n“The suspect, while masquerading as a PHED staff, had approached a customer, Emmanuel Nte, and offered to assist him to activate his account and subsequently pay his bills.\nNte reported the incident to a PHED staff during a routine customer check.\nReacting to the incident, Mr. Nte,lauded PHED for their prompt response and commitment to resolving the issue which led to the arrest of the fraudster.\n“PHED seizes this opportunity to reiterate its earlier warnings to the public against making cash payments to individuals to guard against such ugly incident."
  },
  {
    "headline": "Presidential Amnesty Programme responsible for peace in Niger Delta -NYCN",
    "summarized_story": "By Joseph ErunkeABUJA–THE National Youth Council of Nigeria,NYCN, has attributed the prevailing peace in the Niger Delta to the Presidential Amnesty Programme,PAP.\nAccording to NYCN, the relative peace existing in the region is as a result of success of the Amnesty programme, Niger Delta Development Commission (NDDC) and other interventions of the Federal Government.\n“Our recent tour and engagement with various youth groups in the region has given us a firsthand knowledge of the Presidential Amnesty Programme.\nThe quality of trainings offered by the Amnesty programme has given way to new ideas in intellectual space, driven by science and technology to advance speedy development and growth of the people.\nThe NYCN can confidently declare that the era of violence and armed struggle in the Niger Delta region has finally gone."
  },
  {
    "headline": "Any constitutional review without power devolution, fiscal autonomy, waste of time — Sen Ohuabunwa",
    "summarized_story": "… Worries over militarisation of S’EastBy Steve Oko, AbaSenator Ohuabunwa who stated this in a statement expressed reservations over the ongoing efforts of the National Assembly to review the 1999 constitution.\nOhuabunwa who represented Abia North in the eight senate said that the 1999 constitution was too flawed that only a holistic review of the document without tribal religious or political sentiments can produce acceptable constitution to Nigeria.\nHis words:” What Nigeria needs is a people-oriented constitution that will address all the contentious issues as a result of the flawed 1999 constitution.\n” For me, now is the time to correct the flaws of the 1999 constitution if we want Nigeria to survive its current turbulence”.\nSenator Ohuabunwa also called for the investigation of the reported human rights abuses, intimidation and dehumanization of innocent youths in the area by security agents."
  },
  {
    "headline": "How Nasarawa police tried force us confess we’re kidnappers ― Suspects",
    "summarized_story": "Three suspects held by the Nasarawa State Police Command on allegation of kidnapping have accused the command of demanding N35 million to secure their released and freedomThis is even as the Nasarawa police command has said it will not succumb to intimadation from any quarters as it has remained resolute to stamp out crimes and criminality in Nasarawa.\nALSO READ: Nigeria to reduce import by 35 % in Q1 2022 — Emefiele“It is our brief that Alhaji Bawa Adamu, Abdullahi Adamu and 17 others were arrested by the Police Anti-kidnapping Team in Nasarawa State about the 15th of April,2021 on the instigation of Kire Iki and Dere Dono.\nTo this end, the petitioners did not only demand transfer of the case from the Nasarawa State Police Command but also a thorough and unbiased investigation on the case.\nReacting to the allegations, the Nasarawa State Police Command denied its involvement in the alleged bribery leveled against it.\nHe advised that the command must be allowed to carry out its statutory responsibility of protecting and preserving the lives and property of citizens of the state."
  },
  {
    "headline": "Gov. Ugwuanyi approves installation of fire extinguishers in schools",
    "summarized_story": "In furtherance of his administration’s concerted efforts towards safety of lives and property in Enugu State, Governor Ifeanyi Ugwuanyi has approved the installation of fire extinguishers in primary and secondary schools in the State.\nThe installation, according to the Enugu State Chief Fire Officer, Engr.\nOkwudiri Ohaa, will commence with 216 units of 6kg DCP fire extinguishers for 18 secondary schools cut across the six educational zones in the state.\nAt the PPSMB’s headquarters in Enugu where the fire prevention training for the staff of the Board took place, the Permanent Secretary, Evangelist Dr. Favour Ugwuanyi, thanked Gov.\n“So I want to salute the initiative and salute our governor (Ugwuanyi) for sponsoring this kind of life-saving project."
  },
  {
    "headline": "NCoS: Disquiet as Aregbesola ‘prematurely’ retires 7 Prison ACGs",
    "summarized_story": "There is controversy over the retirement of senior officers at the Nigerian Correctional Service (NCoS), formerly known as Nigerian Prison Service (NPS).\nInterior Minister, Rauf Aregbesola, is accused of prematurely retiring seven Assistant Controller Generals (ACGs) who took part in the screening and examination that produced the current Controller General, Haliru Nababa.\nFollowing Aregbesola’s recommendation, President Muhammadu Buhari appointed Nababa as NCoS CG in February 2021.\n“In 2006, when Olusola Ogundipe was picked from among the ACGs, he worked with hitherto superiors.\nIt was gathered that the officers have sent words to Buhari and the National Assembly to intervene in their retirement."
  },
  {
    "headline": "Gunmen kidnap Heartland staff, Buhari, three others killed in Edo",
    "summarized_story": "A driver with Hartland Construction Company simply identified as Buhari and two police officer were on Tuesday allegedly shot dead by gunmen in the process of kidnapping an expatriate along Benin-Auchi express way in Edo state capital.\nThe driver and the police officer were alleged to have died on the spot while the expatriate was whisked into the bush by the unknown gunmen.\nThe expatriate was said to have been on leave but came back to the country some days ago to resume work.\nCommotion in Umuahia as gunmen rob expatriate, kill policeman, driverThe driver who hails from Jattu, Etsako west local government was said to have been buried immediately according to Islamic rite.\nResponding to the state commissioner of police, Philip Ogbadu, who confirmed the incident said the two officers however survived the attack."
  },
  {
    "headline": "Insecurity: Address influx of illegal migrants to halt killings, kidnappings",
    "summarized_story": "The federal government has been advised to address the influx of illegal immigrants in the country to reduce the spate of kidnapping, attacks and killing of innocent citizens in some parts of the country.\nAdeniji regretted that Nigeria is not running a data-driven system claiming that is the reason foreigners enter the country without being challenged.\nHe said for the federal government to tackle insecurity, it must address the influx of foreigners who enter the country illegally.\n“From my own research, I discovered that there is already a kind of population explosion in this nation, we do not know our population.\nWe do not know the total population of Nigerians and we do not know the number of foreigners who have been entering the country.”"
  },
  {
    "headline": "Bauchi Chief Registrar raises alarm over rising cases of gender-based violence",
    "summarized_story": "The Chief Registrar, Bauchi State High Court, Emmanuel Sublim, has raised an alarm over the rise in rape and gender-based violence, revealing that no fewer than five such cases are filed daily in magistrate courts in the state.\nHe said there was an increase in gender-based violence cases in the state going by the number of such cases heard by courts, particularly magistrate courts, on daily basis, declaring that this was alarming.\nUgwuanyi’s wife campaigns against gender-based violence in Enugu StateHe, however, lamented that most of the cases do not lead to convictions of alleged culprits, attributing this to problems in the investigation, prosecution or even legal advice.\n“Gender-based cases are on the rise in Bauchi State and they seem to be alarming because, from the reports that are usually sent to the Magistrate Courts in Bauchi, I discovered that on a daily basis we have not less than five cases coming to the courts.\nHe submitted that gender-based violence was not something to be swept under the carpets, adding that there was a need for women to be protected by the laws of the land."
  },
  {
    "headline": "Ondo election: Appeal Court gives dissenting judgment on Jegede’s appeal",
    "summarized_story": "By Osagie Otabor, AkureThe Court of Appeal sitting in Akure on Wednesday gave dissenting judgment in the appeal brought before it by the candidate of the People’s Democratic Party (PDP), Eyitayo Jegede in the October 10, 2020 governorship election in Ondo State.\nJegede, who is challenging the victory of Governor Oluwarotimi Akeredolu, had approached the appellate court after the tribunal dismissed his petition for lacking in merit.\nIn the lead judgment read by Justice Theresa Ngolika Orji-Abadua, the court party allowed Jegede to appeal issues one, two, four and five.\nIn their judgement, Justice H. A Barka, Justice J.G Abundaga, Justice Andenyangtso Alli, dismissed the appeal for lacking in merit.\n“The appeal is partly allowed and partly dismissed."
  },
  {
    "headline": "Kidnappers kill two brothers, abduct children in Ondo",
    "summarized_story": "By Osagie Otabor, AkureTwo brothers have been killed by suspected kidnappers who invaded Ajowa Akoko community in Akoko North West Local Government Area in Ondo State.\nThe kidnappers also abducted two other children in the community.\nWitnesses said the kidnappers stormed the community around 1am and gained entrance to the home of one Alhaji Yekini Oludotun after shooting sporadically.\nADVERTISEMENTThe kidnappers were said to have killed two sons of one Mr. Dele in another area and abducted two children.\nOndo Police spokesman, ASP Tee-Leo Ikoro, confirmed the incident at Ajowa and said policemen are on the trail of the criminals."
  },
  {
    "headline": "NBC‘ll be self – funding soon – Lai Mohammed",
    "summarized_story": "Agency ReporterThe Minister of Information and Culture, Alhaji Lai Mohammed, says the National Broadcasting Commission (NBC) will soon be self-funding and stop drawing salaries and allocations from the Federal Government.\nThe minister disclosed this on Wednesday in Abuja at a public hearing on a bill to amend the NBC establishing Act.\n“Very soon, NBC will have to be paying the salaries of its members of staff and run its activities.\nThe minister also raised concerns over the provision in the Bill which prescribed that broadband should be sold absolutely to buyers.\n“Spectrum do not belong to the licensees but to the Federal Government which can be used either for broadcasting or telecommunication."
  },
  {
    "headline": "Correctional Service redeploys seven Deputy Controller Generals",
    "summarized_story": "By Blessing Olaifa, AbujaThe Nigerian Correctional Service has redeployed seven Deputy Controller Generals (DCGs) to inject fresh perspectives to all sectors of the ServiceIt was gathered that the Controller General of Correctional Service, (CGC), Haliru Nababa, approved the redeployment of the Senior Officers “as part of his strategies to reposition the service for better service delivery.”ADVERTISEMENTA statement from the Service Public Relations Officer, Francis Enobore, said those affected in the new posting are DCG Tunde Ladipo who moved from Non-Custodial to Health and welfare While DCG Sylvester Nwakuche, in charge of Training and Staff Development (TSD) now takes over as DCG Non-Custodial.\nOthers are Emilia Oputa Adaobi, DCG Covering Duty (C⁄D) Training and Staff Development; Uche Nwobi, DCG C⁄D Inmates Training and Productivity (ITP); Akinjijonwi Tosin DCG C⁄D Works and Logistics (W&L); Ahmadu Adamu DCG C⁄D Human Resource (HR); Ahmadu Magaji DCG C⁄D Finance and Account (F&A), Enobore said“The posting is geared towards injecting new ideas in the management of the Service to address emerging challenges as well as meet the huge expectations of the public, particularly in the implementation of the NCoS Act 2019,” Enobore asserted."
  },
  {
    "headline": "Bandits Kidnap Rivers United Manager, Eguma",
    "summarized_story": "Rivers United FC manager, Stanley Eguma, is reported to have been kidnapped by bandits Tuesday.\nUnconfirmed sources said the kidnappers are demanding N10 million as ransom for his release.\nTop football sources in the Garden City said Eguma is believed to have been abducted around Enugu axis on his way back to Port Harcourt in his official car.\nWe just heard this and we are waiting to hear from the club management,” one source told a Port Harcourt-based football online site Tuesday.\nEguma was said to be travelling with two of his personal assistants and it is not known if they were also abducted alongside with him or have been released."
  },
  {
    "headline": "INEC Creates 56,872 New Polling Units",
    "summarized_story": "By Chuks OkochaThe Independent National Electoral Commission Wednesday announced the creation of additional 56,873 polling units.\nThis brings the number of polling units in the country to 176,846 polling units.\nThis was announced by the INEC chairman, Prof Mahmood Yakubu, in Abuja Wednesday morning.\nINEC also abolished polling units in private residences and palaces as well as hospitals and any other unauthorised places.\nINEC also said it had removed 749 polling units from inappropriate facilities, with nine of them from shrines and several others from religious houses, royal palaces and private property."
  },
  {
    "headline": "W’Bank: Rising Prices Pushed Seven Million Nigerians Below Poverty Line",
    "summarized_story": "Besides, the World Bank also attributed the deteriorating security situation in Nigeria and rising criminality to a lack of economic opportunities in the country.\nFood prices accounted for over 60 per cent of the total increase in inflation.\nLack of Economic Opportunities Fuelling Insecurity, Criminality in Nigeria, Says W’BankWhile speaking on ‘The Arise Xchange,’ a programme of ARISE NEWS Channel, Chaudhuri said lack of economic opportunities was contributing to the rising crime cases and insecurity in Nigeria.\nSimilarly, food inflation was highest in Kogi 32.82 per cent, Kwara 26.02 per cent and Enugu 25.43 per cent.\nAkwa Ibom, at 20.06 per cent; Bauchi, 18.65 per cent and Abuja 16.91 per cent recorded the slowest rise in year-on-year inflation."
  },
  {
    "headline": "CBN Seeks to Slash Importation by 35%",
    "summarized_story": "James EmejoThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, yesterday said efforts are ongoing to reduce the country’s import bill by about 35 per cent.\nThis, he said would help to reduce importation by about 35 per cent.\n“I got a message that the CBN system had been hacked into and I said the CBN system cannot be hacked into.\nThis followed a request by the CBG for a possible collaboration as it seeks to address acute currency shortages in the country.\nAlready, Emefiele, while receiving a delegation, assured that the CBN has extremely competitive advantage to manage the currency printing job for The Gambia."
  },
  {
    "headline": "Buhari Rallies West African States to Battle Insecurity",
    "summarized_story": "•Army chief says synergy now better among service chiefsDeji Elumoye and Udora Orizu in AbujaPresident Muhammadu Buhari yesterday called for unity among West African States and those in the Sahel to deal with security challenges in their respective nations.\nBuhari had appointed Yahaya to replace former COAS, Lt. Gen. Ibrahim Attahiru, who died in a plane crash in Kaduna.\nAt the army headquarters level here, all the service chiefs now luckily we were all mates in the academy.\n“I believe I have the requisite requirements by the grace of God to now provide my services in this office of the Chief of Army Staff, if confirmed.\n“I, therefore, hope that, if confirmed, the new chief of army staff will do everything possible, working with other service chiefs, to bring this to an end.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "Borno Governor, Zulum Begs Residents Not to Boo Buhari During Thursday's Visit, Confirming SaharaReporters' Story",
    "summarized_story": "Governor Babagana Zulum of Borno state has urged residents to show appreciation to President Muhammadu Buhari during his visit on Thursday.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit.\n“President Buhari has since directed the Nigerian Customs, the Northeast Development Commission and the National Emergency Management Agency, to always support our IDPs with food intervention.\n“President Buhari is concerned about our humanitarian situation and he is sincerely committed to finding peace in Borno.\n“Buhari dearly loves Borno and he does so, with purity of intention, with purity of love, purity of compassion, and the purity of hope for a safer and greater Borno State."
  },
  {
    "headline": "Borno Governor, Zulum Begs Residents Not to Boo Buhari During Thursday's Visit, Confirming SaharaReporters' Story",
    "summarized_story": "Governor Babagana Zulum of Borno state has urged residents to show appreciation to President Muhammadu Buhari during his visit on Thursday.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit.\n“President Buhari has since directed the Nigerian Customs, the Northeast Development Commission and the National Emergency Management Agency, to always support our IDPs with food intervention.\n“President Buhari is concerned about our humanitarian situation and he is sincerely committed to finding peace in Borno.\n“Buhari dearly loves Borno and he does so, with purity of intention, with purity of love, purity of compassion, and the purity of hope for a safer and greater Borno State."
  },
  {
    "headline": "FG seeks law to regulate social, online media",
    "summarized_story": "The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nAdvertisementAt a public hearing organised by the house on Wednesday, Lai Mohammed, minister of information, asked the lawmakers to amend the National Broadcasting Commission (NBC) act to empower the agency to regulate social and online media.\nAkin Akingbulu, executive director of the Institute for Media and Society, said the commission should not receive directives from the minister.\nAlthough no connection has been drawn, the government began moves to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violates its policy.\nAdvertisementTwo days after the incident, the federal government suspended Twitter in Nigeria and directed NBC to “immediately commence the process of licensing all OTT and social media operations in Nigeria”."
  },
  {
    "headline": "FG seeks law to regulate social, online media",
    "summarized_story": "The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nAdvertisementAt a public hearing organised by the house on Wednesday, Lai Mohammed, minister of information, asked the lawmakers to amend the National Broadcasting Commission (NBC) act to empower the agency to regulate social and online media.\nAkin Akingbulu, executive director of the Institute for Media and Society, said the commission should not receive directives from the minister.\nAlthough no connection has been drawn, the government began moves to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violates its policy.\nAdvertisementTwo days after the incident, the federal government suspended Twitter in Nigeria and directed NBC to “immediately commence the process of licensing all OTT and social media operations in Nigeria”."
  },
  {
    "headline": "FEC approves resumption of FCT land swap programme",
    "summarized_story": "The federal government has approved the continuation of the Federal Capital Development Authority land swap scheme which started under former President Goodluck Jonathan administration.\nAdvertisementMohammed Bello, minister of the federal capital territory (FCT), made this disclosure at the end of the weekly federal executive council (FEC) meeting in Abuja, on Wednesday.\nIn 2015, the house of representatives committee on FCT had faulted the land swap programme, alleging that it is fraught with irregularities and a negation of the provisions of the original Abuja master plan.\nThe minister said FEC approved the resumption of the programme following a memo he presented to the council.\nAdvertisement“And who are the parties, the first party is the investor, the second party is the FCT administration, while the third party are the off takers."
  },
  {
    "headline": "FEC approves resumption of FCT land swap programme",
    "summarized_story": "The federal government has approved the continuation of the Federal Capital Development Authority land swap scheme which started under former President Goodluck Jonathan administration.\nAdvertisementMohammed Bello, minister of the federal capital territory (FCT), made this disclosure at the end of the weekly federal executive council (FEC) meeting in Abuja, on Wednesday.\nIn 2015, the house of representatives committee on FCT had faulted the land swap programme, alleging that it is fraught with irregularities and a negation of the provisions of the original Abuja master plan.\nThe minister said FEC approved the resumption of the programme following a memo he presented to the council.\nAdvertisement“And who are the parties, the first party is the investor, the second party is the FCT administration, while the third party are the off takers."
  },
  {
    "headline": "Lagos court denies Baba Ijesha bail in ‘sexual assault’ case",
    "summarized_story": "A magistrate court sitting in Lagos state has denied Baba Ijesha, embattled Nigerian actor, bail in the ongoing trial over alleged sexual assault.\nDuring his trial on Wednesday, Kayode Olabiran, counsel to Baba Ijesha, prayed the court to release his client, citing his deteriorating health.\nThe judge also explained that the case has already been filed before the high court.\nAdvertisementAlso speaking, Yetunde Cardoso, the superintendent of police in charge of the case, said the matter is now beyond the police.\n“Just like the court stated, the case has already been filed before the high court and the Directorate of Public Prosecution (DPP) of Lagos State Ministry of Justice has taken over the matter from the police."
  },
  {
    "headline": "In-house vs. Agency: What tech startups can learn from the biggest question of the corporate world",
    "summarized_story": "While a lot of these ring true, the motivations for internal teams remain strong, and rightly so.\nThey are sometimes unsure how to extend this for external teams.\nA better way to save money is to combine an internal team of a few seasoned experts, some mid-level talents or interns with an experienced team (external) that is tasked with setting the foundation and helping to fully onboard (or sometimes train) the internal team.\nA continuous but cheaper path to continuity may involve the internal team doing the day-to-day work while using the guardianship of the external agency.\nVictor Fatanmi is the Managing Partner at FourthCanvas, a brand strategy and design agency focused on African tech ecosystems."
  },
  {
    "headline": "TechCabal has a new look",
    "summarized_story": "From local startup news to funding rounds across Africa, we’ve kept you up to date with all of it but most importantly, we’ve shown you how technology is positively impacting Africa.\nDark modeLight ModeTC Insights:Our TechCabal Insights team is always bringing you the best in actionable data and research.\nNow you can watch TC Live or Building From Ground Up episodes directly on our new website.\nCentre StageCentre Stage spotlights the people who are working behind-the-scenes in Africa’s tech and business ecosystem.\nThe TC Daily NewsletterWe publish the TC Daily newsletter, the most comprehensive roundup of technology around Africa."
  },
  {
    "headline": "Kenyan-based Mazi Mobility launches electric motorcycle fleet backed by Venture Builder Satgana",
    "summarized_story": "Mazi Mobility, a mobility-as-a-service (Maas) startup founded by Jesse Forrester, recently launched its flagship electric motorcycle fleet in Nairobi, Kenya.\nMazi Mobility is backed by global Venture Builder, Satgana.\n“Mazi is not just an EV company, we are advocates for a sustainable mass mobility change,” says Jesse Forrester, Co-Founder and CEO at Mazi Mobility.\nAs an e-mobility startup, Mazi Mobility fulfils one or more of the UN’s SDGs including SDG#8 (Decent Work and Economic Growth), SDG#11 (Sustainable Cities and Communities) and SDG#13 (Climate Action).\nAs a Venture Builder, we are humbled to be able to support Mazi in its mission to make urban transportation sustainable while empowering low-income drivers.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria’s telco workers strike, Helium Health in Kenya, MarketForce acquires Digiduka",
    "summarized_story": "Good day,Today, I’m discussing:Nigeria’s telecommunications workers to go on strikeHelium Health launches in KenyaMarketForce acquires DigidukaPlanned strike by Nigeria’s telecommunications workers.\nAdvertisementNigerians are no strangers to strike actions, but this would be the first by the country’s telecommunications workers.\nFollowing reports of a planned strike by telecommunications workers last year, the Federal Government stepped in.\nHelium Health launches in KenyaAdegoke Olubisi (CEO), Tito Ovia (Head, Public Growth Sector), Dimeji Sofowora (CFO)After announcing expansion plans last year, Nigerian healthtech startup, Helium Health, has finally launched in Kenya.\nMarketForce acquires DigidukaKenyan startup, MarketForce, has announced the acquisition of Digiduka."
  },
  {
    "headline": "Nigerian telecom workers to kick-off strike today; Data and call services may be disrupted",
    "summarized_story": "Reportedly, users may be unable to conveniently use data and call services during the three days as the strike is likely to disrupt these services.\nMoreover, in March 2021, the telecom association planned to embark on industrial strike action against Huawei Technologies Nigeria Limited, a telecom equipment company.\nHowever, following the Minister of Communications and Digital Economy, Dr Isa Pantami’s intervention, that strike action was suspended.\nWhile the association may be protesting for its rights, the disruptions of data and call services may affect the Nigerian economy.\nIt’s not certain if Pantami will intervene this time, neither is it known if the industrial strike action will aid the association’s demands."
  },
  {
    "headline": "Fatura’s pre-series A funding, Ethio Telecom’s partial privatisation, YouTube’s latest ad ban",
    "summarized_story": "Good day,Today, I’m discussing:Fatura’s latest funding roundEthio Telecom’s 40% stake saleYouTube’s latest ad banEgypt-based Fatura raises $3m pre-series AFatura Co-founders.\nOther investors in the round include Egypt Ventures, The Cairo Angels, Saudi Arabia-based VC, Khwarizmi Ventures, and fintech-focused accelerator, EFG-EV.\nIn July 2020, the startup raised an undisclosed seed round, and this is their second funding round since then.\nEthiopian government to sell 40% stake of Ethio TelecomThe Ethiopian Communications Authority (ECA) has launched a tender to aid the partial privatisation of state-owned telecommunication operator, Ethio Telecom.\nWith this in place, interested private investors can apply, and the chosen bidder will own a 40% stake in Ethio Telecom."
  },
  {
    "headline": "More businesses adjusting to Nigeria’s deepening poverty",
    "summarized_story": "From FMCGs and real estate to insurance and aviation, more businesses in Nigeria are making efforts to adjust their products and services to serve the larger segment of the low-income economy.\nThe marketing strategy, which is increasingly being adopted by many companies to increase their sales by targeting the low-income earners, signals Nigeria’s rising poverty…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "What Nigeria can do in 3-6 months to soften inflation",
    "summarized_story": "What Nigeria can do in 3-6 months to soften inflationMore than 11 million Nigerians are projected by the World Bank to fall into poverty in the next year, largely due to the country’s high inflation rate that has reached new records in 2021, a wake-up call for Africa’s largest economy to take urgent actions.\nAbout 7 million Nigerians have already been pushed into poverty…"
  },
  {
    "headline": "Without reforms, Nigeria’s economic prospects remain subdued",
    "summarized_story": "Different growth projections have been made for Nigeria’s fragile economy for 2021, after it showed a weak 0.11 percent rebound in the fourth quarter of last year.\nThe World Bank projects that Nigeria’s fragile economy could grow by 1.8 percent in 2021, the International Monetary Fund foresees a 1.7 percent growth, while the authorities, betting…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Youth Corpers Disagree With Authorities, Seek National Assembly Intervention – Nigerian Observer",
    "summarized_story": "Authoritative source revealed that the authority of the National Youth Service Corps ( NYSC) have denied applications for redeployment from the north tendered by some southern corps members, mainly doctors, nurses, pharmacists and other healthcare professionals.\nThe medical corps members are worried about their lives due to the insecurity in the northern region where cases of Boko Haram, herdsmen and banditry violence have worsened in recent times.\nHe also noted that there were hardly any provisions made for the corps members in terms of accommodation and security.\nThis is to the Director-General of NYSC; please allow all corps members to relocate or redeploy to their states of choice.\n“The accommodation they give corps members is not befitting."
  },
  {
    "headline": "Orhionmwon NULGE inaugurates new excos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestORHIONMWON – The newly elected executives of Orhionmwon chapter of National Union of Local Government Employees (NULGE) were on Tuesday inaugurated at the council secretariat, Abudu, Edo State.\nSpeaking after their oath taking, the new Orhionmwon NULGE chairman, Osagie Kingsley called for unity among council staff, adding the time of election was over.\nHe assured the council management of continuous workers support “to build the local government and place it where it ought to be”.\nThe outgone chairman, Mathew Ighodaro spoke with our correspondent immediately after ceremony, wished the newly inaugurated executives well, praying they surpass his achievements.\nThe newly inaugurated excos include the Chairman, Osagie Kingsley, Vice chairman, Osazee Joseph, chairperson, Mrs Alenokhuorie Bridget, Secretary, Omoruyi Kelvin, others are Assistant secretary, James Paul, Treasurer, Mrs Ayeboze Osifo, Auditor, Harrison Onaghise."
  },
  {
    "headline": "Edo State Education Board Commends Philanthropist for School Donation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In recognition of the contributions to the development of education in the state and empowerment of students, the Edo State Universal Basic Education Board has commended philanthropist and “entrepreneur” Dennis Ainabel Iseghohimen.\nHe ascribed all the glory to God for his help and pledged to persist in seeking ways to contribute to the socio-economic development of Esan land and Edo State.\nMr. Iseghohimen called on other well-meaning individuals to support the government’s effort to improve the quality of life in communities across not just Esan West but also the whole Edo State.\nThe philanthropist had earlier renovated Eresoyen Primary School in Uhogua, Community in Edo State and is constantly looking for new options to give back to the community.\nDennis Ainabel Iseghohimen is the founder and Director of Nicholas Auto Solution (NAS), www.nicholasautosolution.co.za, Founder, ROTBW Foundation www.rotbwfoundation.com among other businesses."
  },
  {
    "headline": "Aiteo Cup Tourney as EFA,Others Condemn Remo Attack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The defending champions of Edo State FA/Aiteo Cup Bendel Insurance Football Club of Benin have been nominated to represent the state in this year’s Federation/Aiteo Cup competition.\n“We considered the psychological trauma and other physical injuries Insurance suffered in Remo attack and their capacity to give the rest of us in Edo football family, adequate representation during the competition before arriving at our decision.\nThe visitors who expressed disappointment over the attack, encouraged Insurance to be strong, assuring them of continued support.\n” We are visiting you after a week of the attack on you doesn’t mean we do not care about you.\nThe Barbaric act of Remo is capable of bringing Nigeria’s football to disrepute if not checked.”Abu reacted."
  },
  {
    "headline": "Peju Ugboma: Deceased Lagos chef should have been placed on ‘constant monitoring’ – Consultant",
    "summarized_story": "ADVERTISEMENTThe nephrologist who checked Peju Ugboma, the Lagos chef who died of complications from a fibroid surgery, ought to have placed her on constant monitoring, a medical consultant has said.\nSessionDuring cross-examination, a member of the panel, Bernard Onigah, questioned if the time between when Mrs Ugboma was at Premier Medical Specialist Centre and when she was transferred to Evercare hospital “threatened her life”.\nA doctor with Premier Medical Specialist Centre, identified as Osinowo, failed to appear before the panel investigating a “possible violation of patient and consumer rights” in the death of Ms Ugboma.\nAfter Wednesday’s proceedings, Babatunde Irukera, the FCCPC chairman, expressed optimism that the deceased’s family would get closure in the matter.\nThe family had accused the hospital of being responsible for the death of Mrs Ugboma after the surgery."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Army chiefs storm Maiduguri ahead of Buhari’s visit",
    "summarized_story": "Chief of Defence Staff (CDS), General Lucky Irabor, as well as other military brass hats, has arrived in Borno capital with other service chiefs ahead of Thursday’s visit to Maiduguri by President Muhammadu Buhari to assess the security situation in the North-East.\nWith Irabor are Chief of Army Staff, Major-General Farouq Yahaya, Chief of Air Staff, Air Marshal Isiaka Amao, Chief of Naval Staff, Admiral Awwal Gambo, and Chief of Military Intelligence.\nThe Inspector-General of Police, Usman Alkali, who arrived earlier, received the CDS and service chiefs at the Maiduguri Airport from where they all proceeded to headquarters of Joint Task Force Operation Hadin Kai, NAN reported.\nWelcoming the security chiefs to the headquarters of Joint Task Force Operation Hadin Kai, the Acting Theatre Commander, Major-General F.O Omoigui, said the task force has recorded success in many operations.\nMr Buhari is expected to address troops and inaugurate some completed federal and state government projects in Maiduguri on Thursday."
  },
  {
    "headline": "Nigerian stock market rebounds, investors earn N30bn",
    "summarized_story": "This positive outing brought the year-to-date performance of the ASI to stand at -4.24 per cent, Tribune reported.\nFrom the rear of the chart, Abbey, Chi PLC, CWG, Wapic Insurance and Regal Insurance populated the top losers’ chart.\nKey sectoral indices recorded mixed performance, with the Oil&Gas sector gaining 0.92 per cent to become the best performing sector, as the Insurance sector loses 0.51 per cent to become the worst-performing sector.\nConversely, market turnover dipped in the session as it decreased by 23.02 per cent to stand at N2.810 billion as against a value of N2.650 billion recorded in the previous trading session.\nWith regards to the value of traded stocks, Guaranty Trust Bank, Seplat, Zenith Bank, MTN Nigeria and Access Bank made up the top five performers."
  },
  {
    "headline": "BREAKING: Appeal court upholds Akeredolu’s victory",
    "summarized_story": "The Court of Appeal sitting in Akure, the Ondo State capital has upheld the victory of Ondo State governor, Rotimi Akeredolu in the recently held governorship election in the state.\nThe court dismissed the appeal filed by the candidate of the Peoples Democratic Party (PDP) in the election, Mr. Eyitayo Jegede, against Akeredolu who was candidate of the All Progressives Congress (APC).\nThe state election petition tribunal had earlier struck out the petition of the PDP candidate for lack of merit but Jegede approached the appellate court to challenge the verdict of the tribunal.\nThe appeal court, having examined the seven grounds of appeal tabled by the appellant, dismissed the appeal, saying it lacked meritMore later…"
  },
  {
    "headline": "Gani Adams writes UN, AU, others, seeks intervention over herders killings",
    "summarized_story": "The Aareonakakanfo of Yorubaland, Iba Gani Adams, has written to the global community, seeking their intervention in the ongoing killings and kidnappings in Nigeria by suspected herdsmen.\n“We have a situation in which the Federal Government appears overwhelmed and is fast losing grip of its constitutional mandate to protect the land.\n“Obviously, Nigeria is on the precipice, cascading downward in a dangerous and suicidal manner.\n“Every attempt by our people to protect themselves against these marauders is being frustrated by the Federal Government.\nThis singular tragedy has already compromised Nigeria’s existence because our people no longer belief in a system without fairness, equity and objectiveness."
  },
  {
    "headline": "INEC: Reject Onochie’s Nomination, PDP Tells Lawan, Gaya",
    "summarized_story": "The Peoples Democratic Party (PDP) on Wednesday reiterated its rejection of President Muhammadu Buhari’s media aide, Lauretta Onochie, as a national commissioner in the Independent National Electoral Commission (INEC).\nAdvertisementsThe party specifically asked the Senate President, Ahmed Lawan, to return the nomination of Onochie to President Buhari.\nThe PDP national publicity secretary, Kola Ologbondiyan, asserted that Lawan will have no body but himself to blame for the ridiculing of his tenure in office if he failed to return the nomination as demanded by Nigerians.\nAddressing a press conference in Abuja, the party charged Senator Gaya to immediately stand down all deliberations that concern Onochie before his committee.\n“Our party reminds Senator Lawan that the reasons that forced his hands to stand down Onochie’s faulted nomination eight months ago have neither changed nor abated."
  },
  {
    "headline": "INEC: Reject Onochie’s Nomination, PDP Tells Lawan, Gaya",
    "summarized_story": "The Peoples Democratic Party (PDP) on Wednesday reiterated its rejection of President Muhammadu Buhari’s media aide, Lauretta Onochie, as a national commissioner in the Independent National Electoral Commission (INEC).\nAdvertisementsThe party specifically asked the Senate President, Ahmed Lawan, to return the nomination of Onochie to President Buhari.\nThe PDP national publicity secretary, Kola Ologbondiyan, asserted that Lawan will have no body but himself to blame for the ridiculing of his tenure in office if he failed to return the nomination as demanded by Nigerians.\nAddressing a press conference in Abuja, the party charged Senator Gaya to immediately stand down all deliberations that concern Onochie before his committee.\n“Our party reminds Senator Lawan that the reasons that forced his hands to stand down Onochie’s faulted nomination eight months ago have neither changed nor abated."
  },
  {
    "headline": "Grazing Routes: Buhari Being Misadvised, Says Osun Senator",
    "summarized_story": "AdvertisementsBasiru, who doubles as the Senate spokesman, said that there is no federal law creating grazing routes in any part of Nigeria.\n“Neither in the North nor in the South, is there a law creating grazing-routes either as a state law or federal law.\n“There has never been a federal legislation on Grazing Reserves and/or Grazing Routes in Nigeria and Northern Region Laws are not applicable everywhere in Nigeria.\n“Further and be that as it may, none of the extant Grazing Reserves Law made mention of grazing routes not to talk of making provisions thereof.\nIt was only in section 37(1)(a) of the law that the law mentioned “trade route” in criminalizing open grazing outside the grazing reserves areas."
  },
  {
    "headline": "Grazing Routes: Buhari Being Misadvised, Says Osun Senator",
    "summarized_story": "AdvertisementsBasiru, who doubles as the Senate spokesman, said that there is no federal law creating grazing routes in any part of Nigeria.\n“Neither in the North nor in the South, is there a law creating grazing-routes either as a state law or federal law.\n“There has never been a federal legislation on Grazing Reserves and/or Grazing Routes in Nigeria and Northern Region Laws are not applicable everywhere in Nigeria.\n“Further and be that as it may, none of the extant Grazing Reserves Law made mention of grazing routes not to talk of making provisions thereof.\nIt was only in section 37(1)(a) of the law that the law mentioned “trade route” in criminalizing open grazing outside the grazing reserves areas."
  },
  {
    "headline": "Social Inclusion: API Seeks Accurate Data of PWDs In Nigeria",
    "summarized_story": "Africa Polling Institute (API), an Abuja-based research institute, has advocated for accurate data of persons living with disabilities (PWDs) in the country, in order to improve their conditions.\nProf. Bell Ihua, Executive Director, API, said this at a one-day multi-stakeholder workshop on the Nigeria Disability Research Project, on Tuesday in Abuja.\nIhua noted that the project is aimed at gathering evidence-based disaggregated data on Persons With Disability (PWDs) in the country, that would create useful data that would be quoted for many years.\n“So with the support of Ford Foundation, the Africa Polling Institute was asked to midwife the process of generating national data on persons with disabilities in the country.\n“The project has four components, the first is working with the National Bureau of Statistics to generate nation wide data on persons with disabilities."
  },
  {
    "headline": "Gunmen Behead Imo Lawmaker’s Gateman, Set House Ablaze —",
    "summarized_story": "Unknown gunmen stormed the country home of Ekene Nnodumele, the member of the Imo State House of Assembly representing Orsu State Constituency, in Ebenato, Awo Idemili, on Wednesday, beheading a gateman on duty and setting the house on fire.\nImo state has recently been subjected to a slew of attacks, particularly against security forces.\nArmed men stormed the Imo State Police Command and the Nigerian Correctional Service headquarters in Owerri on April 5, setting fire to the buildings and releasing nearly 1,800 convicts.\nThe state governor’s country residence, Hope Uzodinma’s, in Omuma, Oru East Local Government Area of the state, was invaded by gunmen a few days later.\nThey set fire to part of the structure and torched some vehicles in the property during the attack, killing at least one security official."
  },
  {
    "headline": "ISWAP attack Military base in Borno ahead of Buhari’s visit",
    "summarized_story": "Naija News gathered that ISWAP fighters stormed the military base at Kwamdi village, Damboa local government area in 10 utility vehicles.\nA security source told DailyTrust that the base came under attack from gunmen believed to be ISWAP fighters at about 4 pm and it lasted for about an hour and 30 minutes.\nThe source added that fighters seized the opportunity of the sand storm to penetrate the base.\n“Our base at Kwamdi came under attack but we didn’t lose any of our personnel to the attackers, unfortunately the base suffered some damages,” the security source said.\nSpeaking on Buhari’s visit, Governor Babagana Zulum said the President would be appraising the security situation in the northeast."
  },
  {
    "headline": "Police Nabs Fake medical doctor In Bayelsa — Daily Times Nigeria",
    "summarized_story": "Aherhoke Okioma, YenagoaThe Bayelsa State Police Command has paraded a suspect who has been claiming to be a medical doctor in Bayelsa and Delta states.\nHe said the fake medical doctor had been going round seeking for jobs claiming to be Dr. Charles Umeh a serving medical doctor in Taraba state, meanwhile his real name is Akpoviri Vincent Jimmy.\nThe State Chairman of the Nigerian Medical Association (NMA), Dr. Ngowari Torunana said he got the information on Monday from Tobis Clinic that they had restrained a fake medical doctor.\nDr. Torunana said he told the hospital in Ughelli that he was working as a medical doctor in Tobis Clinic for four months and handles most of their surgeries.\nThe 49 year old suspect, Mr. Akpoviri Vincent Jimmy revealed to newsmen that he is a graduate of Psychology from Delta State University."
  },
  {
    "headline": "Unknown Gunmen Allegedly Killed Informant Behind Capture Of ESN Commander, Ikonso",
    "summarized_story": "Gunmen have killed a middle-aged man suspected of being one of the Nigerian Army’s spies in the death of Ikonso Don, the late commander of the Indigenous People of Biafra’s Eastern Security Network (ESN).\nSaharaReporters were able to capture horrific photographs of the victim’s body, which was shot dead along a rural footpath while the shooters fled the scene.\n“The victim is alleged to be the informant the military and the police used in getting Ikonso’s location and in killing him.\nSome said the informant was also a member of the ESN but others said he was a former IPOB member, renounced them and came to the village to hide.\nOn April 26, SaharaReporters claimed that an operation by the Nigerian Army against the ESN and IPOB in Awomama Village in the Oru East Local Government Area of Imo State resulted in the killing of Ikonso Don, an ESN top commander."
  },
  {
    "headline": "Delta awaits £4.2m Ibori-linked loot",
    "summarized_story": "Delta State government on Tuesday insisted that the £4.2 million Ibori-linked loot must be spent on projects in the Southsouth state.\nThe state government suggested that the money can be used for the funding of important road projects in Warri, Agbor, Abraka, Sapele, Igheli, Effurum and Asaba, the Delta state capital.\nThe United Kingdom (UK) government recovered the loot from family members and associates of former Delta State Governor James Ibori.\nDelta Governor Ifeanyi Okowa’s Chief Press Secretary (CPS) Olisa Ifejika, who confirmed the second letter to The Nation, said: “There have been precedents.\n“The on-going state projects are the dualisation of the Ugheli-Asaba Expressway; the Warri/Effurun Erosion Control and Warri/Uwvie Storm Water Control Erosion Road."
  },
  {
    "headline": "Delta awaits £4.2m Ibori-linked loot",
    "summarized_story": "Delta State government on Tuesday insisted that the £4.2 million Ibori-linked loot must be spent on projects in the Southsouth state.\nThe state government suggested that the money can be used for the funding of important road projects in Warri, Agbor, Abraka, Sapele, Igheli, Effurum and Asaba, the Delta state capital.\nThe United Kingdom (UK) government recovered the loot from family members and associates of former Delta State Governor James Ibori.\nDelta Governor Ifeanyi Okowa’s Chief Press Secretary (CPS) Olisa Ifejika, who confirmed the second letter to The Nation, said: “There have been precedents.\n“The on-going state projects are the dualisation of the Ugheli-Asaba Expressway; the Warri/Effurun Erosion Control and Warri/Uwvie Storm Water Control Erosion Road."
  },
  {
    "headline": "Reps query whereabouts of $44m recovered from ex-NIA DG",
    "summarized_story": "The House of Representatives on Tuesday asked questions about the whereabouts of the $44 million the Economic and Financial Crime Commission (EFCC) recovered from the Nigeria Intelligence Agency (NIA) in 2017.\nBut the Office of the National Security Adviser (ONSA) said the money is not in its custody.\nThe Director of Finance and Administration at ONSA, Brig.-Gen. Ja’afaru Mohammed, told the House ad hoc committee investigating the management of recovered funds between 2002 and 2020 that the ONSA had nothing to do with recovered funds and assets.\nThe chairman of the ad hoc committee, Adejoro Adeogun, had quoted EFCC Chairman Abdulrasheed Bawa that the money recovered from the NIA office in Ikoyi was in the custody of the ONSA.\nMohammed told the committee that the NIA money was not with the ONSA and that the office had nothing to do with recovered funds or their management."
  },
  {
    "headline": "Reps query whereabouts of $44m recovered from ex-NIA DG",
    "summarized_story": "The House of Representatives on Tuesday asked questions about the whereabouts of the $44 million the Economic and Financial Crime Commission (EFCC) recovered from the Nigeria Intelligence Agency (NIA) in 2017.\nBut the Office of the National Security Adviser (ONSA) said the money is not in its custody.\nThe Director of Finance and Administration at ONSA, Brig.-Gen. Ja’afaru Mohammed, told the House ad hoc committee investigating the management of recovered funds between 2002 and 2020 that the ONSA had nothing to do with recovered funds and assets.\nThe chairman of the ad hoc committee, Adejoro Adeogun, had quoted EFCC Chairman Abdulrasheed Bawa that the money recovered from the NIA office in Ikoyi was in the custody of the ONSA.\nMohammed told the committee that the NIA money was not with the ONSA and that the office had nothing to do with recovered funds or their management."
  },
  {
    "headline": "Five burn to death as fuel tanker explodes in Ogun",
    "summarized_story": "Five persons have been burnt to death as a fuel-laden tanker exploded at Owode-Idiroko Road, Ogun, Southwest Nigeria.\nIt was gathered that the truck, conveying 33,000 litres of fuel was descending a slope when the tanker detached from the truck and fell to the ground, leading to a loud explosion.\nFive persons were said to have been burnt to death while two others were injured.\nAkinwunmi Olaluwoye, Commander, Idiroko Unit, Federal Road Safety Corps confirmed to the Nation that five deaths were recorded.\nThe tank dropped off from the back of the tanker and exploded."
  },
  {
    "headline": "Lagos government intensifies training of teachers (Photos)",
    "summarized_story": "By Nimot SulaimonLagos State Government organized a mobile workshop for teachers in rural and riverine areas in a bid to equip them for better service delivery in schools across the State.\nAccording to her, the state government has continuously organized various workshop/training of teachers integrating them with modern technologies and the 21 st century skills of teaching various subjects in their respective schools.\nAdelaja emphasized that this training was necessitated due to the review of the curriculum and schemes of work.\nMeanwhile, she added that the State Government has invested huge resources towards building the capacity of teachers with the aim of improving teaching and learning outcomes.\nShe opined that this programme is timely as most teachers newly recruited by the government are deployed to riverine areas."
  },
  {
    "headline": "Just IN: Baba Ijesha charged with sexual assault, court denies bail",
    "summarized_story": "By Taiwo OkanlawonEmbattled Nollywood actor Olanrewaju James Omiyinka popularly known as Baba Ijesha has been arraigned before a magistrate court and slammed with a four-count charge of sexual assault and indecent treatment of a child.\nBaba Ijesha, arrived at the Yaba Magistrates’ Court on Wednesday, in the company of his colleague Yomi Fabiyi and other supporters, as well as family members.\nThe judge, however, denied him bail and remanded him in the police custody where he has been since April, 2021.\nBut he has remained at the Gender Unit of the State CID, Panti, Yaba Lagos despite the bail.\nBut in his ruling, Magistrate P. E Nwaka, held that the court could not grant the actor bail because the matter is beyond its jurisdiction."
  },
  {
    "headline": "Buhari Should Personally Lead Peace Talks With Us To End Insecurity — Bandit Leader Says [Video]",
    "summarized_story": "We are just being killed,” the leader of the gang said in the video.\nSpeaking, the leader of the marauding gang said President Muhammadu Buhari should head the peace talks if he is serious about ending banditry and insecurity in the country.\nHe does not take these peace talks seriously and every day people are being killed.\nGunmen kill, soldiers kill, vigilantes kill.\nYou will see one person having as much as 1,000 hectares, just because he is rich,” the leader said."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "The Islamic State-backed Boko Haram group, the Islamic State West Africa Province (ISWAP), razed a military formation in Kwamdi village, Damboa Local Government Area, Borno State, on Tuesday.\nThe incident comes only two days before President Muhammadu Buhari’s planned visit to the state, which is the epicenter of Nigeria’s insurgency fight.\nBuhari promised to defeat Boko Haram before his victory in 2015, but that promise has yet to be fulfilled six years later.\nThe President will visit Borno for the first time since the February 2020 crisis on Thursday.\nAccording to the Daily Trust, Boko Haram militants overran a military formation in the state’s southern region on Tuesday evening and carted away military weaponry after a gunfight."
  },
  {
    "headline": "Please Don’t Boo Buhari When He Visits On Thursday – Borno Governor, Zulum Begs",
    "summarized_story": "Borno State Governor Babagana Zulum has asked citizens to express President Muhammadu Buhari their thanks during his visit on Thursday.\nDuring a condolence visit to Maiduguri, Borno State, in February 2020, citizens of the state booed the President as his convoy went in and out.\n“President Buhari has since directed the Nigerian Customs, the Northeast Development Commission and the National Emergency Management Agency, to always support our IDPs with food intervention.\n“President Buhari is concerned about our humanitarian situation and he is sincerely committed to finding peace in Borno.\n“Buhari dearly loves Borno and he does so, with purity of intention, with purity of love, purity of compassion, and the purity of hope for a safer and greater Borno State."
  },
  {
    "headline": "Pastor Adeboye, Oyedepo, Big Pastors Are Threat To Christian Unity – Primate Ayodele Speaks On TB Joshua’s Death",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, decried the issues facing the Christian world in Nigeria on Wednesday.\nThe love and harmony in Christianity have been destroyed by top ministers of God who are filled with envy and malice, according to Primate Ayodele.\nWhen the beloved son of Pastor Adeboye died, TB Joshua sent condolences and ordered a 1-minute moment of silence to honour the deceased but now that He is dead, what have they done?\nI’m highly disappointed in Pastor Adeboye who is seen as a prominent Christian leader for keeping silent on this .\nIf at all TB Joshua offended anyone, why can’t they forgive him?"
  },
  {
    "headline": "Breaking: Again, APC’s Akerodolu conquers PDP’s Jegede in Ondo",
    "summarized_story": "The Court of Appeal in Akure has dismissed the petition filed by Mr Eyitayo Jegede (SAN), the governorship candidate of the Peoples Democratic Party (PDP) in the October 2020 governorship election of Ondo State against the election of Governor Rotimi Akeredolu of the ruling All Progressive Congress (APC).\nReading the lead judgment virtually, Justice Theresa Ngolika Orji-Abadua, said the case filed by Jegede lacks merit.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Atlast, UFC Champion, Kamaru Usman, returns home state Edo",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Embattled Nollywood actor, Baba Ijesha, in court over ‘sexual assault’",
    "summarized_story": "NextSWAN Smart City set to birth in Abuja as Sports Writers partner Army"
  },
  {
    "headline": "Online entrepreneurship a plus for Nigeria’s economy, Says Ulochukwu",
    "summarized_story": "As many economies of the world are gradually recuperating from the hit of Covid-19, the CEO and GMD of Bricks to Cribs & Bar BTCBARS, Akarah Ebenezer Ulochukwu has urged the nation to embrace online entrepreneurship to boost the nation’s economy.\nHe made this call during a virtual interview with journalists in Lagos, adding that online entrepreneurship will definitely be a plus to Nigeria’s economy.\nAs the founder of the Royal Niger Green Farms foundation, Akarah, described online entrepreneurship as every other kind of business opportunity.\nIt is definitely not a get-rich quick scheme as some people have been made to believe,” he emphasised.\n“We also have ZILLYBRAIN — this is a branding for my stocks business they nicknamed me the Blackwolf of Wall Street."
  },
  {
    "headline": "FG inaugurates committee on TETFund’s NRDF draft bill -NigPilot",
    "summarized_story": "Federal Government has inaugurated the National Research and Development Foundation, NRDF, draft executive bill committee, with a charge on members to propose legislation that will ensure a robust knowledge economy.\nInaugurating the 11-man committee in Abuja yesterday, the Minister of Education, Malam Adamu Adamu, praised Tertiary Education Trust Fund, TETFund, for coming up with the NRDF initiative.\n“The task of preparing a draft Executive Bill is not an ordinary job.\nBogoro, who doubles as convener of TETFund Research and Development Standing Committee,RDSC, expressed delight that the committee would churn out good draft proposals based on the experience and vast knowledge of its members.\nResponding on behalf of the members of the committee, its chairman, Prof. Auwal Yadudu, promised that the assignment would be carried out with the utmost dedication and seriousness it deserves."
  },
  {
    "headline": "Women Affairs Minister, ex senatorial aspirant, sue for peace -NigPilot",
    "summarized_story": "Minister of Women Affairs, Dame Pauline Tallen, and the immediate past senatorial aspirant for the December 5th Imo North bye-election, Lady Ubah Uchenna, have called for the peaceful coexistence of Nigerians amidst myriads of challenges the country is currently facing.\nThey made the call during a One-Day prayer session organised by the Federal ministry of Women Affairs in collaboration with the National Centre for Women Development and the United Nations Women, held in Abuja recently.\nThe session, tagged ‘Nigerian Women Stand for Peace,’ was aimed at addressing the social-economic crises in the nation, such as the incessant killings, banditries, abduction, and all other forms of social vices currently erupting.\nLady Uchena, who noted that God answers the prayers of Nigerian women, prayed God to touch the hearts of those disturbing the peace and stability of the nation to have a rethink.\nOther notable women who graced the occasion were former First Lady of Nasarawa State, Hajiya ero Almakura, National Project Coordinator for Grassroots Entrepreneurship Skills Acquisition Initiative, Ms Cynthia Obazee, women groups, Civil Society Organisations amongst others."
  },
  {
    "headline": "JUSUN commends Ita Enang for support during industrial action -NigPilot",
    "summarized_story": "Judicial Staff Union of Nigeria, JUSUN, has commended the Secretary, Presidential Implementation Committee for Autonomy of State Judiciary and Legislature, Senator Ita Enang, for his support during the period of their industrial action to press home their demands for a free, strong and independent judiciary in Nigeria.\n“The above mention Union write to appreciate your support during the period of her industrial action to press home her demands for free, strong and independent Judiciary in Nigeria.\n“The Union believes that if judiciary became free, the justice system would be better administered for the betterment of Nigerians.\n“While thanking you for your continuous support during and after the turbulent time of our great union, we assure you of our support always,” part of the letter read.\nSenator Enang is also the Senior Special Assistant to the President on Niger Delta Affairs."
  },
  {
    "headline": "Gunmen Kill One, Abduct Two Chinese In Taraba",
    "summarized_story": "Gunmen suspected to be bandits have killed one person and kidnapped two nationals of the Republic of China in Taraba State.\nMr David Misal, the Police Public Relations Officer in the state, confirmed the incident to Channels Television via a telephone interview on Wednesday.\nThe said community is a boundary town between Benue and Taraba States and has been in the news for attacks arising from mining activities in the area.\nAccording to the Police Public Relations Officer, no contact has been established with the abductors to know what their demands are.\nThis incident comes after weeks of no reported case of kidnap or attack and counter-attack in the area."
  },
  {
    "headline": "Alleged Sexual Assault: Baba Ijesa Pleads Not Guilty, Court Denies Him Bail",
    "summarized_story": "On his part, counsel to the defendant, Kayode Olabiran made a fresh application for bail of Baba Ijesha.\nHe said the matter has been already filed at the High Court, and he urged the court to refuse bail.\nIn his ruling, Magistrate Peter Nwaka refused to vary his bail condition on charges of rape, sexual assault, and abuse of a minor.\nAfter considering all the submissions, Magistrate Nwaka declined to grant the defendant bail on the grounds that he no longer had jurisdiction over the matter.\n“Since there are indications that the matter is before the high court and the defendant will appear before the court, no bail can be given,” the Magistrate said."
  },
  {
    "headline": "INEC Announces Dates To Conduct Ekiti, Osun Governorship Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has announced the dates to conduct the governorship elections in Ekiti and Osun States.\n“Already, activities listed in the timetable for the Anambra State Governorship election are being implemented.\nFollowing the latest development, he unveiled a total of 56,872 new polling units, saying Nigeria now has 176,846 full-fledged polling units.\nThe INEC chairman blamed the establishment of voting points and voting point settlements on the several unsuccessful attempts to create additional polling units.\nHe revealed that the commission has relocated many polling units from inappropriate places to public buildings accessible to voters, polling agents, observers, and the media during elections."
  },
  {
    "headline": "Wike Announces Plan To Enact Anti-Open Grazing Law",
    "summarized_story": "Rivers State Governor, Nyesom Wike has announced a plan to enact anti-open grazing law in the state.\nHe disclosed this on Wednesday during the commissioning of two streets in new G.R.A., Port Harcourt, noting that the decision follows the resolution of the southern governors to ban open grazing in the region.\nREAD ALSO: INEC Removes 749 Polling Units From Shrines, Other Inappropriate Locations“Now that the state Assembly has come back we have to submit the anti-open grazing bill as we agreed in the Southern Governors’ Forum.\nWithout any hesitation we must do it (ban open grazing) to protect our women and youths so that nobody will go and kill them,” Wike said.\nEarlier in May, Southern Governors in a communique jointly signed at the end of their meeting in Asaba, Delta State announced a ban on open grazing of cattle across states in the region."
  },
  {
    "headline": "Three Of Seven Candidates Pull Out Of Iran Presidential Race",
    "summarized_story": "Two days before Iran’s presidential election, which is expected to be won by ultraconservative cleric Ebrahim Raisi, three of the six other men in the race withdrew their candidacies Wednesday.\nUltraconservative lawmaker Alireza Zakani withdrew in the morning, hours after reformist Mohsen Mehralizadeh had also thrown in the towel ahead of Friday’s vote, Iranian media reported.\nLast-minute withdrawals by candidates, often in return for government postings from the eventual winner, are not uncommon in Iran.\nHis departure leaves just one candidate who is considered a reformist in the race, former central bank chief Abdolnasser Hemmati, 66.\nAccording to the few polls available, voter abstention could exceed the 57 percent recorded in parliamentary elections last year."
  },
  {
    "headline": "5 dead, 2 injured in Ogun tanker explosion",
    "summarized_story": "5 persons were burnt to death and 2 others gravely injured in a fuel tanker explosion at Ajilete area of the Owode-Idiroko road, Ogun State.\nWitnesses said there was an explosion which let out a huge flame that burnt the victims.\n2 others were injured – they are all residents of the area where the accident occurred.\nOlaluwoye said the accident occurred at about 8:15am, adding that a bus and a motorcycle were also caught in a web of the explosion and burnt.\nThe number of persons involved are seven – five dead, two injured."
  },
  {
    "headline": "EFCC arrests three for alleged currency counterfeiting",
    "summarized_story": "Three individuals were arrested for conspiracy and money counterfeiting, the Economic and Financial Crimes Commission (EFCC) announced on Wednesday.\nThe Commission in a statement said that its Lagos Zonal Office had commenced investigations into the alleged case of conspiracy and currency counterfeiting levelled against them.\n“And subsequently handed over to the EFCC for further investigation and prosecution,” It stated.\nAdvertisementThe Commission also alleged that the suspects have a network spread across the globe.\nAccording to the commission, investigation has revealed that the suspects, whose operational base is located in Brazil, allegedly produce fake foreign currencies such as US Dollars, Pound Sterling and Euros."
  },
  {
    "headline": "We’ll deliver six-lane Ibeju/Lekki-Epe highway project first quarter 2022 – Sanwo-Olu",
    "summarized_story": "The construction of an 18.7-kilometer six-lane rigid pavement road from Eleko Junction in Ibeju Lekki to Epe T-Junction in Lagos State will be finished and commissioned.\nThe project’s second phase, which will begin later this year, would span 26.7 kilometers from Eleko Junction to Abraham Adesanya Junction in the Eti-Osa axis.\nThe Governor was optimistic the project would be delivered on record time, charging the contractor to scale up the pace of work.\nHe said: “This exercise is an on-the-spot assessment to view the status of the 18.7Km six-lane rigid pavement road construction we are doing from Eleko Junction to Epe.\n“We are happy with the progress of the project, because the contractor works day and night."
  },
  {
    "headline": "Algeria’s Ruling National Liberation Front Wins Most Parliamentary Seats",
    "summarized_story": "Algeria’s ruling party, the National Liberation Front (FLN), has won most seats in last Saturday’s parliamentary election, which saw a low turnout of 23%.\nThe FLN grabbed 105 out of 407 available seats, followed by an historic win for independent candidates who took 78 seats.\nThe National Democratic Rally (RND), the party that was in power under former President Abdelaziz Bouteflika, won 57 seats, while the largest Islamic party the Movement for the Society of Peace (MSP) won 64.\nOnly 5.6 million voters cast their ballots out of the 24.6 million registered, according to the final results announced by the electoral commission.\nThe election was boycotted by the popular protest movement known as Hirak, along with other political parties."
  },
  {
    "headline": "Namibia Imposes Fresh Coronavirus Prevention Restrictions as Cases Spike",
    "summarized_story": "Public gatherings in Namibia will now be limited to ten people and should last no more than two hours if held indoors.\nThis comes as per Tuesday’s decree in a move to stem the drastic increase in new COVID-19 infections, hospitalizations and deaths in the country.\nThe new sanitary measures and restrictions are to ideally improve the situation in Namibia.\nThe Southern African nation currently sees the highest number of new cases per million people per day after Seychelles — according to the African Centre for Disease Control and Prevention.\nNamibia reports 1,040 deaths and .a total of 67,021 confirmed COVID-19 cases — of which over 1,200 were detected on Tuesday."
  },
  {
    "headline": "Man City Begins Title Defence at Tottenham, Man Utd Host Leeds, Liverpool visit Norwich on 2021/22 Premier League",
    "summarized_story": "Premier League champions Manchester City get their 2021/22 title defence underway at Tottenham Hotspur when the new season kicks off on the weekend of August 14.\nThe fast start to the season continues with Arsenal vs Chelsea the following weekend, August 21, before Arsenal travel to Manchester City and Chelsea face Liverpool at Anfield on August 28.\nMan City visit local rivals Manchester United on November 6, but the return match at the Etihad marks the start of a potentially key run of games for Ole Gunnar Solskjaer’s men.\nLiverpool goes to Old Trafford on October 23, while the north London derby is scheduled for September 25 at Arsenal’s Emirates Stadium and January 15 at Tottenham.\nUnited and Chelsea meet at Old Trafford on the penultimate weekend before the season’s final round of games takes place on May 22."
  },
  {
    "headline": "‘Two Great Powers’: Biden, Putin Plunge into Hours of Talks",
    "summarized_story": "Biden and Putin first held a relatively intimate meeting joined by U.S. Secretary of State Antony Blinken and Russian Foreign Minister Sergey Lavrov.\nBiden and Putin were expected to meet for a total of four to five hours of wide-ranging talks.\nPutin flew into Geneva on Wednesday shortly before the scheduled start of the meeting; Biden — who was already in Europe for meetings with allies — arrived the day before.\nAfter the meeting concludes, Putin is scheduled to hold a solo news conference, with Biden following suit.\nRussia’s ambassador to the U.S., Anatoly Antonov, was recalled from Washington about three months ago after Biden called Putin a killer; U.S."
  },
  {
    "headline": "Nigeria: INEC Announces Ekiti, Osun Off-season Guber Polls",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Wednesday announced dates for conducting the governorship elections in Ekiti and Osun states.\nYakubu says the elections are part of the remaining off-season end of tenure elections ahead of the 2023 General Election.\n“In the sequence of off-season elections, the Ekiti and Osun State Governorship elections are holding next year.\nWe implore political parties and aspirants to ensure rancour-free primaries and thereafter conduct peaceful electioneering campaigns.”INEC also announced the creation of an additional 56, 872 polling units across the country.\nProf. Yakubu said Nigeria now has a total of 176, 846 Polling Units from the initial 119, 973 following the conversion of voting points and voting points settlement to full-fledged Polling Units."
  }
]