[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "E-visa For Nigerians on arrival to Turkey challenge temporary, Says Business Council Chair",
    "summarized_story": "The Nigerian-Turkey Business Council Chairman, Dele Oye esq, has assured Nigerians that the challenge of accessing an electronic visa on arrival to Turkey was not peculiar to Nigerians alone but to all African countries, assuring that measures have been put in place to resolve the impasse.\nThe council however cautioned that anyone who has no urgent need to travel should reschedule for a future date.\nThe statement he personally signed on Friday reads in parts: “We wish to bring to the attention of the Members of the Nigeria-Türkiye Business Council of the difficulties in accessing the Republic of Türkiye E-visa/ Visa on arrival platforms by Nigerians (and also in all other African Countries), due to temporary technical challenges.\n“Kindly be rest assured that all measures have been put in place to resolve this issue.\n“For those who have no urgent reasons to travel to the Republic of Türkiye, kindly avoid applying for visas directly to the Republic of Turkey to avoid unnecessary delays.”This disclosure puts to rest rumors that Nigeria was suspended because of the rise in terrorism especially the recent prison break in Abuja."
  },
  {
    "headline": "Malami marries Buhari’s daughter, Nana Hadiza, as third wife",
    "summarized_story": "The Attorney-General and Minister of Justice, Abubakar Malami, and President Muhammadu Buhari’s third daughter from his first marriage, Nana Hadiza, got married on Friday at the Presidential Villa, in a quiet ceremony.\nHe got married to Hadiza, one of Baba’s daughters from his late first wife, Safinatu.\nIt was meant to be a private ceremony, so journalists couldn’t have been part of it”, the source said.\nWith the new marriage, Nana Hadiza becomes Attorney-General Malami’s third wife, having been married to Aisha and Fatima before now.\nThe bride had once been married to Abdulrahman Mamman Kurfi and had six children before the marriage ended in a divorce."
  },
  {
    "headline": "President Buhari arrives in Daura, Katsina State for Eid-el-Kabir",
    "summarized_story": "President Muhammadu Buhari has arrived in his Daura country home in Katsina State, for Eid-el- Kabir celebrations.\nMalam Garba Shehu, the president’s Senior Special Assistant on Media and Publicity, confirmed this in a statement issued on Friday in Abuja.\nHe stated that the president’s plane touched down at the Umaru Musa Yar’Adua Airport in Katsina at 5.15 pm, and he was received by the Gov.\nAminu Masari and other senior state government officials.\nOn arrival in Daura, the president was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other district heads."
  },
  {
    "headline": "Yayale Ahmed urges new transport minister, Adegoroye to bring to bear his experience, intergrity",
    "summarized_story": "Dayo Johnson, AkureFormer Secretary to the Government of the Federation, Alhaji Yayale Ahmed, has asked the new Minister of State for Transport, Prince Ademola Adegoroye, to bring to bear his wealth of experience and integrity on the transformation of the transport sector in the country.\nAhmed made these remarks in Abuja, while chairing a dinner in honour of the Minister hosted by a former Permanent Secretary, Dr. Goke Adegoroye.\nExpressing optimism that Adegoroye will make a difference in the transport sector, Ahmed said he has been highly impressed with the antecedents, political experience and leadership qualities of the minister.\nHe said: “Ademola is a very distinguished politician in Ondo State and Ondo State being one of the highly educated States in Nigeria from time immemorial, I have no doubt in his ability to perform well in his new assignment.\nResponding, Adegoroye thanked all the guests who came to honour him, promising that he would hit the ground running in making indelible contributions to the development of the transport sector."
  },
  {
    "headline": "NDE disburses resettlement loans to train 38 unemployed graduates in Ondo",
    "summarized_story": "Speaking through the NDE Coordinator in Ondo State, Rev Gbenga Olumehintade, the Director General, noted that the directorate had since 1987, been the largest job creation and wealth generation agency.\nFikpo added that ” these has been done via training and resettlement of graduands from various schemes.\nAccording to him the CBTS ” is designed to train the youths and unemployed in demand driven skills in a particular Community.\nFikpo said that the resettled graduands have all undergone in-depth training in various skills including hair dressing,barbing, costmetology, bag making among others.\nThey according to him, will be given tools and equipment relating to their skill as loan packages."
  },
  {
    "headline": "UN reacts to assassination of ex-Japan PM, Shinzo Abe",
    "summarized_story": "The United Nations Security Council on Friday observed a minute’s silence for former Japanese Prime Minister, Shinzo Abe, who was assassinated.\nBrazil’s ambassador to the UN, Ronaldo Costa Filho, presiding over the meeting, said the council members sent their “condolences and deepest sympathy” to the family of Abe.\nIn a terse statement, Secretary-General Antonio Guterres said the UN is “saddened by the horrific killing” of Abe.\n“He’ll be remembered as a staunch defender of multilateralism, respected leader, and supporter of the United Nations,” the statement added.\nThe 67-year-old former Japanese prime minister was shot dead by a gunman who opened fire at close range as the hugely influential politician delivered a campaign speech."
  },
  {
    "headline": "I’m stunned – Biden reacts to assassination of ex-Japan Prime Minister, Shinzo Abe",
    "summarized_story": "United States President, Joe Biden, has paid tribute to Shinzo Abe, a former Prime Minister of Japan, who was assassinated.\nAbe was shot from behind on Friday while speaking at a campaign event in the western city of Nara.\nReacting to the sad news, Biden expressed shock over the assassination of Abe, describing it as a tragedy for Japan and for all who knew him.\nBiden said in a statement which partly read, “I’m stunned, outraged, and deeply saddened by the news that my friend, Abe Shinzo, former Prime Minister of Japan, was shot and killed while campaigning.\n“He was a champion of the alliance between our nations and the friendship between our people.”“I send my deepest condolences to his family.”"
  },
  {
    "headline": "President Buhari jets out of Abuja",
    "summarized_story": "President Muhammadu Buhari on Friday jetted out of the nation’s capital, Abuja.\nBuhari travelled to his country home in Daura, Katsina State, for Eid-el-Kabir celebrations.\nAminu Bello Masari and other senior state government officials.\nOn arrival in Daura, the President was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other District Heads.\nAfter the celebration, the President, who is home with members of his family, will return to Abuja on Thursday, July 14, 2022."
  },
  {
    "headline": "Eid-el-Kabir: Be law-abiding, avoid dangerous driving – Police tell Yobe citizens",
    "summarized_story": "Yobe State Police Command has assured people in the state of sustained efforts in the fight against crime and criminality before, during and after the Sallah festivities.\nThe Command through its Spokesman, DSP Dungus Abdulkarim, gave the assurance in a statement issued to newsmen in Damaturu.\nThe Command also enjoined people in the state to be law abiding citizens, obey traffic regulations, avoid reckless driving and contribute to the existing relative peace in the state by providing useful and credible information at the nearest Police stations.\nIt equally admonished all security personnel to be professional in carrying out their lawful duties while being mindful of the rights of citizens.\n“To this end, the Commissioner of Police wishes all Muslim Ummah happy and peaceful Eid celebrations and calls on all and sundry to be vigilant and security conscious”, it said."
  },
  {
    "headline": "Hold Peter Obi responsible if anything happens to me – Omokri",
    "summarized_story": "A socio-political commentator, Reno Omokri, has alleged threats to his life for not supporting the Labour Party, LP, presidential candidate, Peter Obi.\nOmokri on Friday said that his life and that of his family are at risk for criticising Peter Obi on social media.\nIf anything happens to me, my wife, my children, or siblings, the world should hold Peter Obi responsible.\nPeter Obi was wrong to describe himself as a pilot and other Presidential candidates as “mere drivers”.\nOther Nigerians heard it!”"
  },
  {
    "headline": "Man, 50, to die by hanging for killing wife The Nation Newspaper",
    "summarized_story": "Man, 50, to die by hanging for killing wifeAn Ondo State High Court sitting in Akure has sentenced a 50-year-old welder to death by hanging for causing the death of his wife.\nDaniyan Ojo committed the offence on September 14, 2019 at lrese Road in Shagari Village, Akure.\nOjo was charged with arson, murder and disabling to commit felony.\nAmong the witnesses that testified in the case was a brother of the deceased, Adeniyi Samuel.\nHe ruled that judging from the evidences and testimonies before him, the accused person was guilty as charged and sentenced him to death by hanging."
  },
  {
    "headline": "Malami takes Buhari’s daughter as third wife The Nation Newspaper",
    "summarized_story": "The Attorney-General and Minister of Justice, Abubakar Malami, yesterday took one of President Muhammadu Buhari’s daughters, Nana Hadiza, as his third wife.\nThe Nation gathered that the ceremony took place inside the State House Mosque after the Jumat service, away from prying eyes of uninvited guests, including the media.\n“He got married to Hadiza, one of Baba’s daughters from his late first wife, Safinatu.\n“The Nikkai was performed after the Jumat in the State House mosque and not many people witnessed it.\nWith Malami already married to Aisha and Fatima as his first and second wives, Hadiza becomes the third wife of the attorney-general."
  },
  {
    "headline": "Police arrest alleged notorious kidnappers terrorising Bauchi, Gombe, Taraba The Nation Newspaper",
    "summarized_story": "In a major operation, the Force Intelligence Bureau (FIB) has apprehended one Abdullahi Baka (47), an alleged notorious gunrunner who specialises in supplying illicit arms and ammunition to deadly criminal gangs terrorizing Bauchi, Gombe, and Taraba states.\nFour (4) AK49 rifles, four (4) AK47 rifles, 49 rounds of live ammunition, three AK47 magazines, and one Sub-Machine Gun (SMG) were recovered from the suspects.\nThey were arrested in possession of the sum of N20,000, being the balance of the payment for 500 rounds of AK47 ammunition for a notorious kidnap kingpin, Sani aka Bafudinge.\nThe IGP has tasked all police operatives to consolidate maximally on intelligence gathering, which he said is the crux and fulcrum of modern policing.\nHe also emphasised the important role of community engagement and traditional intelligence gathering with a charge to all officers to employ these in their daily policing duties."
  },
  {
    "headline": "Flutterwave debunks money laundering allegations in Kenya, says ‘we did no wrong’ The Nation Newspaper",
    "summarized_story": "Flutterwave debunks money laundering allegations in Kenya, says ‘we did no wrong’Flutterwave Payment Technology Limited has reacted to media reports that it was involved in an alleged money laundering scheme in Kenya.\nA statement by the company on Thursday, seen by The Nation, said the claims were entirely false, stressing that it maintains the highest regulatory standards in its operations.\nThe company said: “Claims of financial improprieties involving the company in Kenya are entirely false, and we have the records to verify this.\n“We are a financial technology company that maintains the highest regulatory standards in our operations.\nIn the process, we earn our fees through a transaction charge, records of which are available and can be verified.”"
  },
  {
    "headline": "Demolition: Soludo orders sanction of task force officer for manhandling Odumeje The Nation Newspaper",
    "summarized_story": "By Onu Nwanosike, Awka and Emma Elekwa, OnitshaGovernor Chukwuma Soludo of Anambra State has ordered that disciplinary actions be taken against the personnel involved in the manhandling of Prophet Chukwuemeka Ohanaemere (Odumeje) during Thursday’s demolition of the cleric’s church.\nOdumeje’s church was in April this year marked for demolition, in line with Onitsha Urban Renewal Plan spearheaded by the Soludo-led administration.\nDuring Thursday’s demolition exercise, Odumeje was manhandled by security agencies who accompanied the demolition team following his attempt to stop the officials from carrying out the exercise.\nHe was severally slapped and restricted from moving to the demolition area by armed security men.\nBut Soludo, in a statement, condemned the brutalization of the cleric, just as he regretted what he described as unprofessional manner displayed by the officer."
  },
  {
    "headline": "APC woos Wike: Fayose leads Fayemi, Akeredolu, Sanwo-Olu to meet Rivers gov",
    "summarized_story": "From Tony John, Port HarcourtThree South West governors of the All Progressives Congress (APC) on Friday, met Rivers State governor, Nyesom Wike, behind closed-door in Port Harcourt.\nThe governors were Kayode Fayemi (Ekiti State), Rotimi Akeredolu (Ondo State) and Babajide Sanwo-Olu (Lagos State) and former Ekiti State governor, Ayo Fayose.\nIn June, Governor Wike had similar visits by Ebonyi State governor, Dave Umahi, of APC and Mr. Peter Obi, the presidential candidate of the Labour Party (LP).\nOther groups that visited Governor Wike at his private residence in Rumuepirikom were the People’s Democratic Party (PDP) Senate Caucus and Bauchi State governor, Bala Mohammed accompanied by some chieftains of the party.\nMeetings by the visitors with Wike were held behind closed-door and there was no media coverage at the end of the different private discussions."
  },
  {
    "headline": "Kuje attack: Boko Haram has superior weapons -FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government on Friday admitted that the terrorists who attacked the Correctional Centre, Kuje in the Federal Capital Territory (FCT) succeeded because of their large number and the superior firepower.\nAccording to him, the security personnel deployed to the facility did their best to repel the attack but were subdued by the superior weaponry of the terrorists.\nI think what helped them (terrorists) was the number of people they came with and the superior weapons that they came with.\nAnd because nobody anticipated it, the few people who are there guarding the place could not withstand the number that they came with.\npresident is surprised that what happened in Kuje actually took place in spite of all the security arrangement that has been made to ensure that such an incident does not happen."
  },
  {
    "headline": "Sallah: Buhari, govs, others greet Nigerians",
    "summarized_story": "In his message, the President assured Nigerians that he won’t rest until he brings relief to Nigerians, adding that he is quite aware of the difficulties people are facing.\nGovernor Hope Uzodimma of Imo State yesterday put the Muslim community in Imo in a celebratory mood by giving them two cows and two truckloads of 50 kilogramme bags of rice to the admiration of their leaders.\nThe entire Muslim community In Imo State which includes the Hausas, the Oba of Yaruba in Imo State, the Chairman and Secretary of the Hausa Community in Imo State and other leaders were around to receive the gifts.\nSpeaker of the House of Representatives, Femi Gbajabiamila urged Nigerian Muslims, to redouble their prayers for the country.\nIn a press statement it released in Lagos, Globacom urged the Nigerian faithful to celebrate with love and to abide by the teachings of the Holy Koran."
  },
  {
    "headline": "Young Nigerians ecstatic over Peter Obi’s running mate",
    "summarized_story": "By Kate HalimFollowing the announcement that Peter Obi, the presidential candidate of Labour Party, has officially unveiled Yusuf Datti Baba-Ahmed as his running mate for the 2023 presidential election, the internet has been agog with excitement.\nBaba-Ahmed, the founder of Baze University, Abuja was unveiled as Obi’s running mate at the party headquarters in Abuja on Friday.\nOn different social media platforms, social media users are optimistic that with Obi’s choice, Nigeria is headed for better governance.\nMajority of these Nigerians are making posts and dropping comments on social media posts to support Obi’s choice of vice president.\nPeter Obi is huge on economics while Dr. Yusuf Datti Ahmed is huge on education."
  },
  {
    "headline": "Insecurity: Israeli envoy meets Kalu says country ready to assist Nigeria",
    "summarized_story": "From Kenneth Udeh, AbujaAmidst Nigeria’s worrisome security challenges, Ambassador of Israel to Nigeria, Michael Freeman has disclosed the desire of his country to assist Nigeria fight the scourge of insecurity which is bedeviling different parts of the country.\nIn a brief Interaction with Saturday Sun, Freeman described Nigeria as an amazing country with enormous potential, emphasising that though he is only six months old in Nigeria, his country is willing to partner with Nigeria to improve its agricultural and technological sector.\n“I’ve been in the country for only six months and I’m beginning to learn and understand the wonderful country and people of Nigeria.\nKalu maintained that Agriculture and Security are two key areas which Nigeria must tap from Israel, stating they are major aspects of Israel’s expertise.\nAnd I hope that the Federal Government of Nigeria, through all her agencies, should continue building partnerships with the Israelis.”"
  },
  {
    "headline": "I Have Transited from the Prince to the King of Comedy – THISDAYLIVE",
    "summarized_story": "He has featured in some Nollywood movies, played roles on music video sets, hosted his own comedy shows and a lot more.\nI decided to transit from the Prince to the King of Comedy after a professional career evaluation, which included my seven years doing comedy professionally and over 27 years making people laugh.\nEbiye is a perfect blend of the best of the best ever to do it in comedy.\nOriginality is key and I bring it into my creations as pure and as authentic as possible because you can’t actually see an Ebiye content and not laugh.\nI chased comedy like a lion chases his prey and I caught comedy and ate it, I guess."
  },
  {
    "headline": "Outpouring of Love for Olu Jacobs at 80 – THISDAYLIVE",
    "summarized_story": "“A Toast to Olu Jacobs 80th Birthday Celebration”, boldly reads the message.\nOlu Jacobs will clock 80 on Monday 11th of July, 2022.\nBy any conceivable parameters, Olu Jacobs is a successful professional who has paid his dues in the industry and is thus mostly respected by all.\nThe deluge of love since the news of his forthcoming 80th birthday made the rounds has been overwhelming.\nOlu Jacobs is one of those who made good use of their skills to pursue a worthy career, benefiting society and country."
  },
  {
    "headline": "Aquafina Brings ‘Water No Get Enemy’ to Life with PadiofLife Campaign – THISDAYLIVE",
    "summarized_story": "Aquafina Water, with the new #PadiofLife campaign, emphasizes human relationship with water as true friendship, which every human craves for.\nSocial media has over time become an agenda-setter for public discussions, and the #PadiofLife campaign was a notable instance.\nThe #Padioflife campaign highlighted Aquafina’s premium brand status, the importance of choosing a brand you can trust.\nThe campaign also explored Aquafina’s ‘Purity Guaranteed’ mantra and the purification process that places Aquafina premium bottled water ahead of the crowd.\nSo, the next time you think of pure drinking water, go for Aquafina premium drinking water."
  },
  {
    "headline": "I Knew I will End Up in the Arts Sector – THISDAYLIVE",
    "summarized_story": "From literary and debating society to cultural groups in secondary schools, I knew I will end up in the arts sector.\nWhile doing TV, I started working with other filmmakers as producer or line producer then went on to direct and the rest they say is history.\nYou have your first cinema directorial Tiger’s Tail which comes out soon.\nHow did you come up with the story and how long did it take to shoot Tiger’s Tail?\nIt’s a family affair and I love them allWhat makes Tiger’s Tail different?"
  },
  {
    "headline": "Burna Boy Making Waves with ‘Love, Damini’ – THISDAYLIVE",
    "summarized_story": "But one that greeted his entry on stage at a recent concert where he performed to a sold-out crowd.\nThe single is off Burna Boy’s latest studio album ‘Love, Damini’, which he dropped on July 8 via Atlantic Records.\n‘Love, Damini’ is Burna Boy’s 6th album after his debut album ‘L.I.F.E’, ‘On a Spaceship’, ‘Outside’, ‘African Giant’, and ‘Twice as Tall’.\nOn Love, Damini, Burna Boy has already officially released two songs from the album – ‘Kilometre’ and ‘Last Last’ with the latter enjoying impressive level of success.\nHowever, fans became more interested when the Nigerian star spoke on how much royalties Braxton was making from Last Last."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "Ex-Army Chief, Buratai Threatens Lawsuit Against SaharaReporters For Exposing Recovery Of Billions Of Naira Meant for Arms, Ammunition In Abuja House",
    "summarized_story": "A former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\nhas threatened to sue SaharaReporters for exposing the discovery of billions in cash meant for arms and ammunition to fight Boko Haram in his Abuja home.\nBuratai made the threat in a letter signed by his counsel, R.O Atabo, a Senior Advocate of Nigeria (SAN), to the newspaper.\nBurataiSaharaReporters had exclusively reported how the ICPC recovered funds (including foreign currencies) from a house registered to someone fronting for Buratai, a military contractor and Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau.\nThe letter reads partly, “Tukur Buratai (hereafter referred to as “our Client”) on whose firm instruction and authority we write you."
  },
  {
    "headline": "Ex-Army Chief, Buratai Threatens Lawsuit Against SaharaReporters For Exposing Recovery Of Billions Of Naira Meant for Arms, Ammunition In Abuja House",
    "summarized_story": "A former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\nhas threatened to sue SaharaReporters for exposing the discovery of billions in cash meant for arms and ammunition to fight Boko Haram in his Abuja home.\nBuratai made the threat in a letter signed by his counsel, R.O Atabo, a Senior Advocate of Nigeria (SAN), to the newspaper.\nBurataiSaharaReporters had exclusively reported how the ICPC recovered funds (including foreign currencies) from a house registered to someone fronting for Buratai, a military contractor and Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau.\nThe letter reads partly, “Tukur Buratai (hereafter referred to as “our Client”) on whose firm instruction and authority we write you."
  },
  {
    "headline": "Nigerian Society Full Of Contradictions; Religious Persons Divert Money Into Private Pockets – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the Nigerian society “is a bundle of contradictions” where religious people make life difficult for others, divert money meant for all into their private pockets.\nBuhari added that he would not rest until he has addressed the current security challenges and costs of living in the country.\nThe President gave the assurance in his Eid-el Kabir message to Nigerian Muslims and other citizens.\n“I am quite aware of the difficulties people are facing and working to resolve them,” he said in a statement issued by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nPeople display external religiosity without fear of God; they make life difficult for others; money becomes their god; leaders abandon their oaths of office by taking money meant for the welfare of the people and divert it to their private pockets,” he said."
  },
  {
    "headline": "Elon Musk terminates $44bn Twitter deal",
    "summarized_story": "Elon Musk, the billionaire founder of Tesla Inc. said he is terminating his $44 billion Twitter deal, saying the social media company had failed to provide information about fake accounts on the platform.\nMusk said this on Friday, according to Reuters.\nThis comes after Twitter allowed Musk access to its “firehose”, a repository of raw data on hundreds of millions of daily tweets, last month.\nIn a filing, Musk’s lawyers said Twitter had failed or refused to respond to multiple requests for information on fake or spam accounts on the platform, which is fundamental to the company’s business performance.\nAdvertisement"
  },
  {
    "headline": "Elon Musk terminates $44bn Twitter deal",
    "summarized_story": "Elon Musk, the billionaire founder of Tesla Inc. said he is terminating his $44 billion Twitter deal, saying the social media company had failed to provide information about fake accounts on the platform.\nMusk said this on Friday, according to Reuters.\nThis comes after Twitter allowed Musk access to its “firehose”, a repository of raw data on hundreds of millions of daily tweets, last month.\nIn a filing, Musk’s lawyers said Twitter had failed or refused to respond to multiple requests for information on fake or spam accounts on the platform, which is fundamental to the company’s business performance.\nAdvertisement"
  },
  {
    "headline": "Tinubu has agreed to pick Muslim running mate, says Ganduje",
    "summarized_story": "Abdullahi Ganduje, Kano governor, says Bola Tinubu, the All Progressives Congress (APC) presidential candidate, has agreed to pick a Muslim as running mate.\nGanduje said this on Friday during a prayer session with clerics ahead of the Eid-el-Kabir celebration.\nIt is not something new in Nigeria,” Ganduje added.\nThe development comes amid speculations over who Tinubu would pick as his running mate, as the final deadline for the submission of candidates’ names inches closer.\nMeanwhile, after clinching the APC presidential ticket, Tinubu had said his choice for a running mate is in his “pocketbook”."
  },
  {
    "headline": "Tinubu has agreed to pick Muslim running mate, says Ganduje",
    "summarized_story": "Abdullahi Ganduje, Kano governor, says Bola Tinubu, the All Progressives Congress (APC) presidential candidate, has agreed to pick a Muslim as running mate.\nGanduje said this on Friday during a prayer session with clerics ahead of the Eid-el-Kabir celebration.\nIt is not something new in Nigeria,” Ganduje added.\nThe development comes amid speculations over who Tinubu would pick as his running mate, as the final deadline for the submission of candidates’ names inches closer.\nMeanwhile, after clinching the APC presidential ticket, Tinubu had said his choice for a running mate is in his “pocketbook”."
  },
  {
    "headline": "TIMELINE: 1,993 inmates in Edo, 900 in Kuje... 14 times jailbreak happened under Buhari’s watch",
    "summarized_story": "In 2021, TheCable reported how thousands of inmates escaped from different prisons across the country in four years of Buhari’s administration.\nThe inmates attacked the kitchen staff that were on duty and broke loose.\nJune 3, 2018 – Minna medium security prison, Niger stateGunmen attacked Minna medium security prison, Niger state, killing an official and a commercial motorcyclist.\nSeptember 13, 2021 – Kabba Correctional Centre, Kogi stateTwo security operatives were killed in an attack by gunmen on Kabba Correctional Centre in Kogi state.\nNovember 28, 2021 – Jos correctional centre, Plateau stateAbout 262 inmates escaped the correctional centre after gunmen invaded the facility."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Rita Anwiri Chindah on her life as a lawyer and digital content creator",
    "summarized_story": "Today on Everyday People, we meet Rita Anwiri Chindah, an intellectual property and information technology lawyer and an arbitrator based in Port-Harcourt, Rivers State.\nSo sometimes when I want to record, I have to tell my family, cause I stay with my parents.\nI went there the first time and they said, “Okay, maybe come back next week.”And I went back the following week.\nGet ready to subscribe on Spotify, Apple podcast, google podcast and other platforms.\nWhen you’re trying to Google, trying to read different documents, make sure that you give a brief summary of everything."
  },
  {
    "headline": "Edo strengthening institutions to foster sustainable growth, devt, says Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Acting Governor, Rt.\nPhilip Shaibu, has said the state is deemphasizing strong individuals and strengthening institutions to foster sustainable growth and development in the state.\nWe are in a state where the human resources that we are blessed with are underutilized.\nNigeria is blessed with natural resources and also blessed with human resources.\nOn his part, Chairman, Edo CIPM, Osahon Omole, hailed the government for its people-centric projects across the state, urging increased collaboration between the state and the organization."
  },
  {
    "headline": "COVID-19 Vaccination: EDSPHCDA Executive Sec calls for mass participation – Nigerian Observer",
    "summarized_story": "She said that the first dose of the vaccine primes the immune system, alerts it of the presence of the virus in the human body and also creates an antibody response.\n“The second dose acts as a booster to ensure immunity is long lasting.\n”Dr. Eloghosa expressed the need for the second dose of COVID-19 vaccination to be passed across Local Government Areas so that everyone who received the first dose of the vaccine can receive their second dose.\nShe urged the State Health Educator, Mrs Irene Uabor to intensify campaign for adequate information on behavioral and attitudinal change towards receiving the second dose of the vaccination.\nAccording to her, Edo State has recorded an improvement in the number of persons that are fully vaccinated and the number of persons that are partially vaccinated."
  },
  {
    "headline": "Priest’s death: Buhari loses trust of Nigerians if he can’t secure the nation – clerics …as Shaibu calls for prayers – Nigerian Observer",
    "summarized_story": "Comrade Philip Shaibu, on Friday, led other top government functionaries to pay last respects to late Rev.\nChristopher Odia, who was gruesomely murdered by suspected kidnappers, with clerics at the event decrying the worsening spate of insecurity in the country.\nOdia, a catholic priest, was allegedly murdered by his kidnappers in Ikabigbo, Etsako West Local Government Area (LGA) of Edo State.\nJohnbosco Ezehi, charged President Muhammadu Buhari to take urgent steps to guarantee the safety and security of Nigerians.\nIf the President cannot keep our country safe, then he automatically loses the trust of the citizens."
  },
  {
    "headline": "Eid-El Kabir: Police Beef Up Security In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command has put in place adequate proactive security measures to ensure peaceful and crime free Eid-el-kabir festivities in the state.\nThe commissioner of police in Edo State CP Abutu Yaro directed all tactical commanders, Divisional Police Officers, DPOs, and their supervisory area commanders to emplace a watertight security in their various areas of operations before, during and after the Sallah celebration.\nShe stated further that CP Abutu Yaro also directed area commanders to increase police intensive patrol, traffic control officers, stop-and-search operations, raids on black spots and other crime-prone locations across the state.\n“He further enjoins all Muslim ummah to be security conscious while celebrating Eid-el-kabir and report any suspicious individual, movement or criminal activities to the police”.\nRecall that the Federal government of Nigeria has declared 11th and 12th July, 2022 public holidays for the celebration."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Abubakar Malami marries Buhari’s daughter, Nana Hadiza in Aso Rock",
    "summarized_story": "Abubakar Malami, the Attorney-General of the federation, today, married Nana Hadiza, daughter of President Muhammadu Buhari at a private ceremony in Aso Rock Villa.\nThe marriage ceremony held at the Presidential Villa mosque on Friday and was attended by both families.\nNana Hadiza, 41, married the attorney-general as his third wifeShe is Buhari’s third daughter with his first wife, Safinatu.\nHadiza was married to Abdulrahman Mamman Kurfi with whom she had six children before their divorce.\nMr Buhari has conducted three previous weddings for his children since he assumed office in 2015, including Zahra Ahmed Indimi, Yusuf Buhari and Aisha Mohammed Sha’aban"
  },
  {
    "headline": "Eid-el-Kabir: Pray for sustainable peace in Osun – Oyetola charges Muslim Ummah",
    "summarized_story": "“On behalf of my family and the government of Osun, I felicitate my Muslim brethren as we mark the 1443 AH Eid-el-Kabir festival.\nLet’s not engage in any act capable of disrupting the unity and peaceful coexistence we currently enjoy in the State.\nWe must understand that the peace and stability of our State does not worth the ambition of any politician.\n“Once again, I congratulate the Muslim Ummah in Nigeria and all over the world on today’s Eid-el-Kabir celebration.\nWishing you and your loved ones a peaceful and joyous Sallah celebration,” Governor Oyetola stated."
  },
  {
    "headline": "Police rescue abducted Chinese national in Kwara",
    "summarized_story": "The Kwara State Police Command says it has rescued a Chinese National abducted at a Quarry in Shao in the Moro Local Government Area of the state by gunmen last week Saturday.\nThe gunmen, who attacked workers at the Quarry, shot dead a Police Inspector and injured another officer, while the Chinese citizen was taken away.\nThe Police in a statement signed by the Command’s spokesperson, SP Ajayi Okasanmi, said the Chinese citizen was rescued from his abductors after they had escaped from the Police tactical teams who closed in on their hideout.\n“The pressure mounted on the kidnappers by the rescue teams became so intense that the criminals could no more stand the heat, forcing them to abandon the victim and escape for their lives.\nPolicemen and the tactical teams deployed for the operation are still in the bushes in an effort to get the criminals arrested to face justice."
  },
  {
    "headline": "Jose Dos Santos, former Angolan president, is dead",
    "summarized_story": "Jose Dos Santos, former president of Angola has died, the embassy of Angola in Nigeria has announced.\nAccording to the embassy, Mr Dos Santos died in the city of Barcelona, Spain due to illness.\nAngola will from midnight July 9 observe five days of national mourning in honour of the late former president.\n“The Embassy of Angola in Abuja, will open from Monday, July 11, a Book of Condolences in honor of the nationalist and patriot Jose Eduardo,” it added.\nOne of Africa’s longest serving leaders, Mr Dos Santos stepped down five years ago."
  },
  {
    "headline": "Tinubu has accepted to pick a Muslim running mate – Ganduje",
    "summarized_story": "Abdullahi Ganduje, Kano State governor, on Friday said Bola Ahmed Tinubu, presidential candidate of the All Progressives Congress, has agreed to pick a Muslim vice-presidential candidate.\nHe made the comment during a gathering of about 100 clerics at the Kano state government house as part of activities to mark Eid El Kabir.\n“We have advised him to pick a Muslim deputy and he has agreed,” Mr Ganduje said.\nIt is not something new in Nigeria.”Mr Ganduje asked the clerics to pray for Tinubu to emerge as Nigeria’s president come 2023.\nHe also urged them to offer prayers for his administration’s peace and progress."
  },
  {
    "headline": "Delisting Nigeria For Turkish e-Visa Temporary, Says Business Council Chair",
    "summarized_story": "The chairman, Nigerian-Turkey Business Council, Dele Oye, has assured Nigerians that the challenge of accessing electronic visa on arrival to Turkey was not peculiar to Nigerians alone but to all African countries, saying that measures have been put in place to resolve the impasse.\nHe, however, cautioned that anyone who has no urgent need to travel should reschedule for a future date.\nA statement made available by the Council on Friday, reads in parts: “We wish to bring to the attention of the members of the Nigeria-Türkiye Business Council of the difficulties in accessing the Republic of Türkiye E-visa/ Visa on arrival platforms by Nigerians (and also in all other African countries), due to temporary technical challenges.\n“Kindly be rest assured that all measures have been put in place to resolve this issue.\n“For those who have no urgent reasons to travel to the Republic of Türkiye, kindly avoid applying for visas directly to the Republic of Turkey to avoid unnecessary delays.”According to the Nigerian-Turkey Business Council, this disclosure puts to rest, rumours that Nigeria was suspended because of the rise in terrorism, especially the recent prison break in Abuja."
  },
  {
    "headline": "Delisting Nigeria For Turkish e-Visa Temporary, Says Business Council Chair",
    "summarized_story": "The chairman, Nigerian-Turkey Business Council, Dele Oye, has assured Nigerians that the challenge of accessing electronic visa on arrival to Turkey was not peculiar to Nigerians alone but to all African countries, saying that measures have been put in place to resolve the impasse.\nHe, however, cautioned that anyone who has no urgent need to travel should reschedule for a future date.\nA statement made available by the Council on Friday, reads in parts: “We wish to bring to the attention of the members of the Nigeria-Türkiye Business Council of the difficulties in accessing the Republic of Türkiye E-visa/ Visa on arrival platforms by Nigerians (and also in all other African countries), due to temporary technical challenges.\n“Kindly be rest assured that all measures have been put in place to resolve this issue.\n“For those who have no urgent reasons to travel to the Republic of Türkiye, kindly avoid applying for visas directly to the Republic of Turkey to avoid unnecessary delays.”According to the Nigerian-Turkey Business Council, this disclosure puts to rest, rumours that Nigeria was suspended because of the rise in terrorism, especially the recent prison break in Abuja."
  },
  {
    "headline": "BREAKING: Elon Musk Ends $44bn Bid For Twitter Acquisition, Alleges Breaches",
    "summarized_story": "World richest person, Elon Musk, is ending his $44bn (£36bn) bid to buy popular microblogging platform, Twitter, alleging multiple breaches of the merger agreement.\nThe announcement could bring to an end a long-running saga after Musk decided to buy Twitter in April.\nHe said he had backed out because Twitter failed to provide sufficient information on the number of spam and fake accounts.\nSpam accounts are designed to spread information to large numbers of people and manipulate the way they interact with the platform.\nOn Thursday, Twitter said it removed around one million spam accounts each day."
  },
  {
    "headline": "BREAKING: Elon Musk Ends $44bn Bid For Twitter Acquisition, Alleges Breaches",
    "summarized_story": "World richest person, Elon Musk, is ending his $44bn (£36bn) bid to buy popular microblogging platform, Twitter, alleging multiple breaches of the merger agreement.\nThe announcement could bring to an end a long-running saga after Musk decided to buy Twitter in April.\nHe said he had backed out because Twitter failed to provide sufficient information on the number of spam and fake accounts.\nSpam accounts are designed to spread information to large numbers of people and manipulate the way they interact with the platform.\nOn Thursday, Twitter said it removed around one million spam accounts each day."
  },
  {
    "headline": "JUST-IN: Police Arrest Suspected Terrorist, Recover Loaded AK-47 In Kaduna",
    "summarized_story": "The Kaduna State Police Command said it has arrested a suspected terrorist with a loaded AK-47 rifle and ammunitions on Thursday, July 7, 2022.\nHe said preliminary investigations revealed the identity of the arrested suspect as Ishaku Habu a.k.a Deta, of the same Mariri village, aged 25.\n“Items recovered from him include One AK47 rifle loaded with twenty nine (29) rounds of 7.62 X 39mm live ammunition and one mobile phone as he confessed to have been a member of kidnapping and cattle rustling syndicate in the area,” the PPRO said.\nHe noted that the Commissioner of Police while reiterating the directive of the IGP, ordered for a meticulous investigation and a bid to arresting other members of the gang as well as recovering their operational logistics for prosecution.\nThe CP equally called on the communities to redouble their current effort in providing actionable and result-oriented intelligence such as this to assist the Command and its sister agencies to minimise the current security challenges in the State."
  },
  {
    "headline": "JUST IN: Tinubu on his way back from France",
    "summarized_story": "JUST IN: Tinubu on his way back from FranceThe APC Presidential candidate, Asiwaju Bola Tinubu is on his way back from France where he had gone for series of meetings.\nThe former governor of Lagos tweeted on his Twitter page that he was on his way back from France.\nTinubu had travelled out of the country to France on June 27 after meeting with President Muhammadu Buhari at the Presidential Villa.\nHe travelled to Paris, France to hold some important meetings, his spokesman, Tunde Rahman had said in a statement.\nOn June 8, Tinubu emerged the Presidential candidate of APC for the February 25, 2023 election at the party’s presidential primaries/national convention held at the Eagle Square, Abuja."
  },
  {
    "headline": "Buhari arrives Daura for Sallah celebration",
    "summarized_story": "President Muhammadu Buhari has arrived his country home in Daura, Katsina State for Eid-el- Kabir celebrations.\nThe President’s plane touched down at the Umaru Musa Yar’Adua Airport in Katsina at 5.15 pm.\nHe was received by Governor Aminu Bello Masari, and other senior State government officials.\nOn arrival in Daura, the President was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other District Heads.\nAccording to a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, after the sallah celebration, the President, who is home with members of his family, will return to Abuja on Thursday, July 14, 2022."
  },
  {
    "headline": "BREAKING: Ex-finance minister Sunak announces bid to succeed Boris Johnson",
    "summarized_story": "A former Minister of Finance has indicated interest to succeed Boris Johnson as Prime Minister of the United Kingdom.\nThis comes after Johnson resigned yesterday.\nBritish Conservative Rishi Sunak declared his candidacy to become the party’s next leader on Friday.\n“Let’s restore trust, rebuild the economy and reunite the country,” the former finance minister said, presenting a slick video about his life story to launch the campaign on social media.\nDetails later…"
  },
  {
    "headline": "JUST IN: Sanwo-Olu, Fayemi, Akeredolu Meet Wike In Port Harcourt",
    "summarized_story": "Three All Progressives Congress (APC) Governors on Friday met Rivers Governor, Nyesom Wike, at his private residence in Port Harcourt behind closed doors.\nThe Governors, who arrived in the afternoon to meet with Wike, were Kayode Fayemi (Ekiti); Babajide Sanwo-Olu (Lagos) and Rotimi Akeredolu (Ondo).\nThe details of the closed-door meeting is not yet known but speculation has it that it my be connected with the 2023 presidential election.\nWike, a chieftain of the Peoples Democratic Party (PDP), is expected to back his party’s candidate, Atiku Abubakar but speculations have emerged that the Rivers State Governor is unhappy after being passed over for the vice presidential ticket.\nThe meeting is ongoing as of the time of filing this report."
  },
  {
    "headline": "Breaking: Elon Musk drops huge announcement on Twitter takeover",
    "summarized_story": "Elon Musk has dramatically announced that he is pulling the plug on his $44 billion acquisition of Twitter.\nIn a letter dropping the bombshell, Musk’s legal team said that Twitter were in material breach of multiple provisions of the agreement.\nOne section of the letter reads: ‘Twitter has not complied with its contractual obligations.\nOn the day of the announcement, Twitter’s shares were down nearly five percent.\nThe news comes days after Musk confirmed that he secretly fathered twins with Neuralink director of operations, Shivon Zilis."
  },
  {
    "headline": "[Breaking] Wimbledon: Novak Djokovic conquers British man in comeback victory, sets up Nick Kyrgios final clash",
    "summarized_story": "Top seed Novak Djokovic set up a blockbuster Wimbledon final against Nick Kyrgios after recovering from a torrid start to overwhelm Britain’s Cameron Norrie 2-6 6-3 6-2 6-4 on Friday.\nFor an hour on a sun-baked Centre Court, inspired ninth seed Norrie outshone the 20-time Grand Slam champion and looked capable of a huge upset in his first major semifinal.\nDjokovic, bidding for a fourth successive Wimbledon title and seventh in all, soon settled down into his usual rhythm though and gradually seized the initiative.\nNorrie battled hard in the fourth set as the crowd found its voice again but ultimately could not resist Djokovic’s march into a men’s record 32nd Grand Slam final.\nAustralian Kyrgios, handed a walkover in the semifinal by injured Spaniard Rafael Nadal, now stands between the 35-year-old Djokovic and a 21st Grand Slam title."
  },
  {
    "headline": "Kuje jail attack: Ensure this doesn’t happen again, Buhari warns security agencies",
    "summarized_story": "The minister assured Nigerians of a full-scale investigation into the attack, as he solicited for their support in fighting all forms of criminality.\n“The President is surprised that what happened in Kuje actually took place in spite of all the security arrangements that have been made to ensure that such an incident does not happen.\n“The following are faces and names of Inmates with Boko Haram/terrorism cases who escaped from Kuje Correctional Centre during the jail attack on July 5, 2022.\nThose declared wanted were: Abdulkareem Musa, Abdusalami Adamu, Abubakar Abdulrahman Habibu, Abubakar Mohammed Sadiq, Abubakar Mohammed, Abubakar Yusuf, Adam Lawal Muhammad, Akibu Musa Danjuma, Amodu Omale Salihu, Bello Haruna, Bilyaminu Usman, Bukar Ali, Ibrahim Mohammed, Ikya Abur, Ismail Idris Abdullahi, Modu Aji, Mohammed Sani, and Musa Abubakar.\nRecently we had the Kuje Prison attack by a terrorist group that freed many terrorists and hardened criminals."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "In 2023, Social Media Will Vote – Datti Baba-Ahmed",
    "summarized_story": "﻿Vice presidential candidate of the Labour party in the 2023 elections, Datti Baba-Ahmed believes social media support will translate into actual votes in the 2023 elections.\n“Go and start looking at the bookings of major European airlines into Nigeria,” Baba-Ahmed said.\nREAD ALSO: Tinubu Has Agreed To Pick A Muslim Deputy – GandujeIn 2023, social media is going to vote.\nOnly one party is on green fertile land, and that is Labour party.\nI am confident that with Dr Yusuf Datti Baba-Ahmed by my side, we shall ensure that in moving Nigeria forward, no state or community will be left behind."
  },
  {
    "headline": "2023: Tinubu Has Agreed To Pick A Muslim Deputy – Ganduje",
    "summarized_story": "﻿Kano State Governor Abdullahi Ganduje on Friday said presidential candidate of the All Progressives Congress, Bola Ahmed Tinubu, has agreed to pick a Muslim vice-presidential candidate.\nHe made the comment during a gathering of about 100 clerics at the Kano state government house as part of activities to mark Eid El Kabir.\n“We have advised him to pick a Muslim deputy and he has agreed,” Mr Ganduje said.\nIt is not something new in Nigeria.”Mr Ganduje asked the clerics to pray for Tinubu to emerge as Nigeria’s president come 2023.\nMr Ganduje asked the clerics to pray for his Deputy Governor, Yusuf Gawuna, who emerged as the APC governorship candidate in Kano State for 2023 elections."
  },
  {
    "headline": "Fayemi, Sanwo-Olu, Akeredolu Visit Wike In Rivers",
    "summarized_story": "﻿Three Governors of the All Progressives Congress on Friday arrived at the private residence of Governor Nyesom Wike of Rivers State for a closed door meeting.\nThe Governors are Kayode Fayemi of Ekiti State, Babajide Sanwo-Olu of Lagos State and Rotimi Akeredolu of Ondo State.\nAlso present at the meeting is former Ekiti State governor, Ayodele Fayose.\nThe details of the closed-door meeting is not yet known but it may not be unconnected with the 2023 presidential election.\nAPC presidential candidate, Bola Ahmed Tinubu, was said to have met with Wike in France last week but the Tinubu media office has denied such a meeting ever took place."
  },
  {
    "headline": "Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases Photos",
    "summarized_story": "The Federal Government has declared all Boko Haram suspects who fled the Medium Security Custodial Centre in Kuje, Abuja, wanted.\n“The following are faces and names of Inmates with Boko Haram/ terrorism cases who escaped from Kuje Correctional Centre during the jail attack on 5th July 2022,” it said.\nWe guarantee to keep your information anonymous.”They include Abdulkareem Musa, Abdusalami Adamu, Abubakar Abdulrahman Habibu, Abubakar Mohammed Sadiq, Abubakar Mohammed, Abubakar Yusuf, Adam Lawal Muhammad, Akibu Musa Danjuma, Amodu Omale Salihu, Bello Haruna, Bilyaminu Usman, Bukar Ali, Ibrahim Mohammed, Ikya Abur, Ismail Idris Abdullahi, Modu Aji, Mohammed Sani, and Musa Abubakar.\nOthers are Mohammed Goni Kyari, Mohammed Guja, Mohammed Saleh Buba, Mohammed Umar, Mukhtar Ussaini Khalidu, Musa Adamu, Musa Umar, Onyemire Asagba, Rabiu Shaibu, Sahabi Ismail, Sani Mohammed, Umar Ahmadu Ladan, Usman Balarebe, Yahaya Adamu Abubakar, Yusuf Yakubu, Abdulazeez Obadaki, Auwal Abubakar, Mansur Mohammed Usman, Mohammed Abubakar, Mohammed Jamiu Eneji Sani, Muazu Abubakar, Muhammed Sani Adamu, Muktar Umar, Nambil Zakari Gambo, Sadiq Garba Abubakar, Yazid Muhammed Usman, Yusuf Ali Yusuf.\nThe fleeing suspects are identified in the photos below:"
  },
  {
    "headline": "US Announces More Himars Precision Rocket Systems For Ukraine",
    "summarized_story": "The United States announced Friday it will send Ukraine more Himars rocket systems and new precision artillery shells, boosting its ability to target Russian arms depots and supply chains.\nWith the Himars system, “Ukraine has now been successfully striking Russian locations within Ukraine, deeper behind the frontlines, and disrupting Russia’s ability to conduct artillery operation,” the official said.\nA senior defense official said the new artillery rounds were both longer range and more precise that what the Pentagon has provided previously.\nSince the first Himars launchers were provided to Ukraine last month, analysts believe Kyiv’s forces may have successfully destroyed a dozen or more Russian ammunition depots far behind the front lines.\nUsing their Himars systems, the Ukrainians in the last week have been able to “significantly disrupt the ability of the Russians to move forward,” the official added."
  },
  {
    "headline": "Three APC Governors visit Nyesom Wike in Port Harcourt",
    "summarized_story": "Rivers State Governor Nyesom Wike held closed door meetin with three governors of the All Progressives Congress in Port Harcourt.\nNyesom Wike received the Governors of Lagos State, Babajide Sanwo-Olu, Ondo State, Rotimi Akeredolu and Ekiti State, Kayode Fayemi at his country home.\nThe visit of the APC governors comes amidst speculations about the political future of Governor Nyesom Wike following the outcome of the PDP Presidential Primaries and the choice of a running mate to the PDP flagbearer, Atiku Abubakar.\nAdvertisementAdvertisementThe crisis worsened after Atiku rejected the recommendation of an ad hoc committee of the party and picked Delta State Governor, Ifeanyi Okowa, as his running mate.\nThe committee was reported to have recommended Mr Wike for the position, although the party later cllaimed that Mr Wike was only one of three nominees recommended by the committee."
  },
  {
    "headline": "Akinlade joins PDP, emerges Adebutu's running mate",
    "summarized_story": "Ladi Adebutu and Hon.\nAdekunle Akinlade are long time allies, who both served at the green chamber from the state in the eighth legislative assembly.\nAkinlade is a strong loyalist of Senator Ibikunle Amosun and had earlier announced his defection from the ruling party, blaming his decision on injustice within the APC."
  },
  {
    "headline": "2023: Labour Party announces Datti Ahmed as Peter Obi's running mate -",
    "summarized_story": "The Labour Party has officially announced Datti Ahmed as Peter Obi’s running mate for the 2023 Presidential Election.\nThis follows the withdrawal of Doyin Okupe from the race in a letter he personally signed and sent to the Independent National Electoral Commission.\nAdvertisement"
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Elon Musk Says He’s Terminating $44bn Twitter Buyout Deal, Board to Fight",
    "summarized_story": "Elon Musk’s tumultuous $44 billion bid to buy Twitter is on the verge of collapse — after the Tesla CEO sent a letter to Twitter’s board Friday saying he is terminating the acquisition.\nOn Thursday, Twitter sought to shed more light on how it counts spam accounts in a briefing with journalists and company executives.\nthe spam accounts represent well below 5% of its active user base each quarter.\nPrivate data, which isn’t available publicly and thus not in the data “firehose” that was given to Musk, includes IP addresses, phone numbers and location.\nTwitter said such private data helps avoid misidentifying real accounts as spam."
  },
  {
    "headline": "Subsidy Is An Economic Issue And Should Not Be Politicised – Adetilewa Adebajo",
    "summarized_story": "Investment Banker and Economist, Adetilewa Adebajo, speaks on the issues of subsidy and the gains of it’s removal to the Nigerian economyRelatedStories No Content Available"
  },
  {
    "headline": "Labour Party’s Peter Obi Unveils Yusuf Datti Baba-Ahmed as Running Mate",
    "summarized_story": "The Labour Party (LP) on Friday, unveiled Senator Yusuf Datti Baba-Ahmed as running mate to its presidential candidate, Peter Obi, ahead of Nigeria’s general elections in February next year.\nBaba-Ahmed, the founder of Baze University, Abuja, was announced the vice-presidential candidate in Abuja on Friday.\nBaba-Ahmed’s announcement was coming barely 24 hours after the Director-General, Peter Obi Campaign Organisation, Doyin Okupe, announced his withdrawal as the vice-presidential candidate of the party.\nThe Labour party had named Okupe as the interim vice presidential candidate of the LP in order to beat the deadline by the Independent National Electoral Commission.\nDetails later"
  },
  {
    "headline": "Blatter and Platini: Former Heads of FIFA and UEFA Cleared of Corruption Charges By Swiss Court",
    "summarized_story": "Former FIFA president Sepp Blatter and former UEFA president Michel Platini were both cleared of corruption charges by a Swiss court on Friday.\nBlatter, who led FIFA for 17 years, was cleared of fraud by the Federal Criminal Court in the southern city of Bellinzona.\nThe two, once among the most powerful figures in world football, had denied the charges against them.\nProsecutors had accused Blatter, a Swiss who led FIFA for 17 years, and Platini of unlawfully arranging for FIFA to pay the Frenchman two million Swiss francs (£1.7m) in 2011.\nPlatini, who also lost his job as UEFA president following the ban, said the affair was a deliberate attempt to thwart his attempt to become FIFA president in 2015."
  },
  {
    "headline": "Former Japanese PM Shinzo Abe Assassinated While Making Election Speech",
    "summarized_story": "Former Japanese Prime Minister Shinzo Abe has died after he was shot on Friday while campaigning in the city of Nara.\nAuthorities have arrested a 42-year-old man who appeared to have shot Abe, media reported.\nAbe served two terms as prime minister to become Japan’s longest-serving premier before stepping down in 2020 citing ill health.\nHis protege, Prime Minister Fumio Kishida, goes into Sunday’s upper house election hoping, analysts say, to emerge from Abe’s shadow and define his premiership.\nAbe first took office in 2006 as Japan’s youngest prime minister since World War Two."
  }
]