[
  {
    "headline": "Rep challenges Buhari to name Kanu, Igboho’s sponsors in N’Assembly",
    "summarized_story": "), on sponsorship of secessionist agitations in Nigeria.\nIgbakpa, during the plenary, said the Ghanaian Government had issued a red alert ever since Buhari said sponsors of the agitations included a member of the National Assembly.\nMr Speaker, it would amaze you what I faced in the hands of Ghanaian officials.\nThey detained me for about four hours; that they were trying to confirm something.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "NIS applies to list fresh charges against Odili on passport seizure",
    "summarized_story": "THE Nigerian Immigration Service on Tuesday applied for the leave of a Federal High Court in Abuja to file fresh evidence against a former governor of Rivers State, Dr Peter Odili, on why his travelling passport was seized.\nThe PUNCH reported that Odili’s passport was on June 20, 2021 seized by operatives of the NIS upon arrival from the United Kingdom and has since been withheld.\nOdili had since taken the NIS and its Comptroller-General before a Federal High Court, asking the court to compel the NIS to release the passport to him.\nAdamu specifically told Justice Inyang Ekwo that the NIS and the CG intend to file a better and further counter affidavit to justify the seizure of the passport.\nThe NIS had also filed counter affidavit to oppose the suit of the former governor and served same on Odili as required by law."
  },
  {
    "headline": "South-East governors move to end IPOB’s ‘sit-at-home’",
    "summarized_story": "IPOB protesterSoutheast governors rose from a meeting in Enugu on Tuesday and declared that they would do everything to end the “sit-at-home’’ order of proscribed Independent Peoples of Biafra (IPOB).\nThe declaration is contained in a communiqué issued at the end of their meeting with stakeholders and made available to newsmen.\nUmahi said the governors were worried by the spate of insecurity in the region and condemned the continued “sit-at-home’’ order.\nUmahi, also Chairman of Southeast Governors Forum said the governors, southeast leaders and security chiefs condemned the spate of killings in the region.\n“The governors and leaders of the southeast condemn killings in the region and have agreed to join hands with security agencies to stop the trend."
  },
  {
    "headline": "Buhari approves N150,000 bursary for varsity students; N100,000 for NCE",
    "summarized_story": "President Muhammadu BuhariBy Joseph Erunke, ABUJATHE Federal Government has announced the reintroduction of bursary in universities and colleges of education across the country, with N150,000 and N100,000 earmarked for each undergraduate in an education programme and NCE student, respectively, per session.\nThe Minister of Education, Malam Adamu Adamu, said this in his keynote address delivered at the 2021 World Teachers Day celebration in Abuja, Tuesday.\nAdamu said the reintroduction of the bursary was part of the resolutions of the National Implementation Committee constituted by the government following President Muhammdu Buhari’s pronouncement in repositioning the nation’s education sector and the teaching profession in particular, during 2020 World Teachers Day celebration.\nHe added that the ministry would liaise with the 36 states’ education ministries, including the FCT Education Board, with a view to effecting the new scheme.\nThey would identify the respective courses of study required by each state, while “beneficiaries must attend public institutions only and sign a bond to serve their state for five years on graduation.”“The fund would be sourced from UBEC, TETFund and managed by the Federal Scholarship Board.”Adamu said his ministry “shall collaborate with agencies like NTI, TRCN, CPN, NUC, NCCE, UBEC, PTDF, TETFund, and non-governmental organisations to organise trainings in pedagogy and information and communication technology for academic and non-academic staff.”He disclosed that “UBEC, TETFund and PTDF would assist in funding the annual training.”“Government would partner with developers/recognised institutions like Federal Mortgage Bank of Nigeria, Federal Government Staff Housing Loans Board, FGSLB, FME Staff Welfare, and NUT to finance affordable homes for teachers on build-operate-and-transfer basis.”Vanguard News Nigeria"
  },
  {
    "headline": "PDP Chairmanship: Coast clears for Mark as Saraki opts for Presidency",
    "summarized_story": "Governors back bidBy Dirisu YakubuDr Bukola SarakiFormer Senate President, David Mark, is leading the race for the office of the national chairman of the Peoples Democratic Party, PDP, ahead of the party’s October 30/31 elective convention.\nThe two ex-heads of the Nigerian Senate had been touted with interest in the chairmanship race but Saraki, Vanguard gathered, has his eyes fixed on the presidential convention billed to hold in the last quarter of 2022.\nA loyalist of Saraki who spoke with Vanguard in confidence said, “the former Senate President did not consider the option of party chairmanship for a second.\nMeanwhile, serving and former governors of the PDP are pushing a consensus arrangement that would see Mark emerged unopposed.\nThe hostilities eventually led to the exit of prominent PDP members including Professors Jerry Gana, Tunde Adeniran, Taofik Adedoja, and Rasheed Ladoja from the party."
  },
  {
    "headline": "Tragedy as dispatch rider burns to death on Third Mainland Bridge",
    "summarized_story": "By Bose AdelajaTragedy struck Tuesday, on Third Mainland Bridge in Lagos State, when a dispatch rider fell off his bike and was burnt to death on the spot.\nThe details of the incident could not be ascertained but eye witnesses’ account said it occurred inward Lagos Island at about Noon.\nAccording to one Mr Makanjuola Bright who was at the scene, the incident involved a Vanagon bus with number plate KSF 465 YA and the bike.\n“Within a twinkle of an eye, the fire raged and burnt the rider to death before help could come.\n“Although the incident drew the attention of law enforcement operatives on the bridge, this was too late as the rider did not survive it."
  },
  {
    "headline": "Death of MOUAU student: Fix Umuahia -Ikot Ekpene fed road now, Sen Orji tasks FG",
    "summarized_story": "By Steve OkoSenator Theodore Orji representing Abia Central senatorial district has called on the federal government to quickly commence the total rehabilitation of the dilapidated Umuahia- Ikot Ekpene federal road.\nOrji who described the current state of the road as ” very horrible” lamented the rising incidents of road crashes on the highway.\n” Right from the eight Senate, motions have been passed by the Senate for the federal government to fix that road but unfortunately nothing substantial has been done.\nIt also leads to a lot of federal institutions – MOUAU; Research Crop Institute, and others.\nWhile appealing for calm, the former governor promised to sustain his pressure on the federal government until the road is rehabilitated to end the ordeals of the road users."
  },
  {
    "headline": "Anambra insecurity: IG appoints Echeng as new Police chief, deploys special forces",
    "summarized_story": "The Inspector-General of Police, Usman Baba has posted CP Echeng Eworo Echeng to Anambra State.\nBaba also ordered the deployment of a detachment of NPF Special Forces to Anambra to complement the peace-building efforts of the Nigeria Police Operation Restore Peace.\nHe directed Echeng to mobilize kinetic and non-kinetic law enforcement and crime-fighting approaches to reverse the negative trend, reclaim public spaces from hoodlums and restore public peace.\nEcheng, until now the Commissioner of Police in Bayelsa, holds a First Degree in History from the University of Maiduguri.\nEcheng also served as a former Police Component Commander, Joint Task Force, Operation Delta Safe, Deputy Commissioner of Police in charge of Zonal CID, Zone-13, Ukpo in Anambra."
  },
  {
    "headline": "180m telephone lines in Nigeria linked to NIN – NCC Boss",
    "summarized_story": "Prof Umar Danbatta, the Executive Vice Chairman of the Nigerian Communications Commission (NCC) has revealed that over 180 million telephone lines are now linked with the National Identity Numbers (NIN).\nDanbatta said this on Tuesday during NCC’s Public Inquiry on three Regulatory Instruments on the Rule Making Process in Abuja.\nAddressing key stakeholders, the EVC further stated that SIM-NIN link-up was made possible following the capturing of over 64 million Nigerians by the National Identity Management Commission (NIMC) in the National Identity Numbers (NIN) database.\nThe EVC said that statistics indicate that the telecommunications industry has bounced back with broadband penetration peaking at 41 percent while active telephone subscribers have increased by over one million.\nHe also said that available statistics indicate that the telecommunications industry has bounced back with broadband penetration peaking at 41 percent while active telephone subscribers have increased by over one million"
  },
  {
    "headline": "Sanwo-Olu signs Lagos Criminal Justice amendment law to protect suspects, victims",
    "summarized_story": "Lagos Governor, Babajide Sanwo-Olu has assented to the Administration of Criminal Justice (Amendment) Law (ACJL) of Lagos State, 2021.\nThe ACJL was first passed in 2007 and amended in 2011 to ensure the fundamental rights of suspects and persons that come in contact with the justice system are protected.\nOnigbanjo said in the Lagos government’s bid to further strengthen the justice system, promote the rights of victims, suspects, and address the issue of delay in the Administration of Criminal Justice, innovative provisions were added to the amended law.\nOther are protective measures for victims and witnesses, the Establishment of a Crime Data Register and the Criminal Justice Sector Reform Committee to monitor the implementation of the ACJL.\nThe Senior Advocate of Nigeria (SAN) assured that the Ministry of Justice, through a collaborative effort with stakeholders in the Administration of Criminal Justice, will ensure the enforcement of the provisions of the law."
  },
  {
    "headline": "Nigerian govt to move teachers retirement age to 65 — Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says efforts are underway to increase the retirement age of teachers in Nigeria’s public service from 60 to 65 years.\nOsinbajo disclosed this on Tuesday while hosting the Presidential Villa, Abuja, Oluwabunmi Anani, Maltina Teacher of the Year, 2020 Winner, as part of the 2021 World Teachers Day celebration.\nAnani was accompanied on the visit to the Presidential Villa by Uzodinma Odenigbo, Head of Public and Government Affairs, Nigerian Breweries Limited(NBL).\nThe vice president said that there were also moves to employ teachers into the public service starting from level 8 as against level 7.\n“For example, there is a policy now, though not a law yet; it is still in the National Assembly about moving the retirement age of teachers in the public service from 60 to 65."
  },
  {
    "headline": "2021 budget amendment: Lagos Assembly approves Sanwo-Olu’s request for N1.25trn",
    "summarized_story": "Lagos State House of Assembly on Tuesday approved the sum of N1.25 trillion as an amendment to the 2021 budget.\nIn September, Sanwo-Olu asked the House to approve the amendment to the 2021 Appropriation Law of N1.164 trillion passed on December 29, 2020.\nHe sought the reordering of N460.58 billion to N496.26 billion for the recurrent expenditure and N702.93 billion to N759.59 billion for the capital expenditure.\nChairman of the House Committee on Budget and Economic Planning, Gbolahan Yishawu, announced the new appropriation law as N1,256,567,592,651 trillion.\nThe sum of N743,224,253,914 billion from the Development Fund was approved for capital expenditure for the year ending December 31, 2021."
  },
  {
    "headline": "Why boosting local capacities will reduce reliance on overseas tests, by firm",
    "summarized_story": "By Moses Emorinken, Abuja- Advertisement -The need to send medical laboratory test samples overseas for diagnosis is fast becoming a thing of the past as local capacities have been developed to fill these gaps by competent laboratories.\nManaging Partner of Abuja-based indigenous medical laboratory, LAB360, Mr. Joseph Erhirhi, stated this during its second anniversary.\n“At LAB360 medical laboratory, we have invested in state-of-the art laboratory equipment, maintain an in-house fully automated chemistry analyser for renal function tests, liver function panel, lipid profile and others.\n“And to mark our second anniversary in Nigeria’s healthcare sector, we are dedicating the month of October to providing health awareness programmes through our various social media platforms.\nSince the inception of LAB360 medical laboratory, we have been committed to putting the health needs of our clientele over and above others."
  },
  {
    "headline": "No going back on Anambra guber election – INEC",
    "summarized_story": "By Okodili Ndidi, Abuja- Advertisement -The November 6 Anambra governorship election will proceed as scheduled despite the deteriorating security situation in the State, the Independent National Electoral Commission (INEC) has vowed.\nINEC Chairman, Professor Mahmood Yakubu, stated this at the emergency meeting of the Inter-Agency Consultative Committee on Election Security (ICCES).\nHe noted that the importance of election security in a governorship election has never been this urgent.\nYakubu however warmed that should INEC again lose vital materials and facilities, the ongoing preparations for the election will be adversely affected.\nThe destroyed buildings have either been completely repaired or are nearing completion and we have fully replaced the materials destroyed."
  },
  {
    "headline": "Olu of Warri disrobes Emami as Ologbotsere",
    "summarized_story": "By Elo Edremoda, Warri- Advertisement -The Olu of Warri His Majesty Ogiame Atuwatse lll has officially announced the disrobing of Chief Ayirimi Emami as Ologbotsere (traditional prime minister) of Warri kingdom.\nThe monarch disclosed this on Tuesday during a meeting reportedly with descendants of the Ologbotsere family at his palace in Warri South council area of Delta State.\nThe monarch reportedly instructed the people of Itsekiri nation, especially the Ologbotsere family, to henceforth cease addressing the embattled Chief as Ologbotsere.\nThe Iyatsere and Uwangue of Warri Kingdom, Chief Johnson Amatserunleghe and Chief Gabriel Awala were present at the meeting.\nEfforts to get a reaction from the spokesman of the Ologbotsere family, Comrade Alex Eyengho, were unsuccessful."
  },
  {
    "headline": "Buhari tripples budget size in 6 years",
    "summarized_story": "From Fred Itua, (Abuja) Merit Ibe and Chinwendu ObienyiPresident Muhammadu Buhari, yesterday, sent a fresh request to the National Assembly, to review the already approved Medium Term Expenditure Framework (MTEF) upwards.\nIn 2015, when President Buhari presented his first budget to a joint session of the National Assembly, his inherited budget was around N4 trillion.\nThe proposed revision is coming barely 48 hours to the presentation of the 2022 budget to a joint session of the National Assembly billed for tomorrow.\nIn the revised budget, Buhari has raised the budget deficit to N6.6 trillion, which is higher than the National Assembly’s approved deficit estimate of N5.62 trillion.\nThe implication is that budget deficit would continue to grow, so will our debt stock."
  },
  {
    "headline": "South East Govs raise concern over Monday sit-at-home",
    "summarized_story": "The South-East Governors and traditional rulers on Tuesday after their meeting, condemned the Indigenous People of Biafra over the every Monday sit-at-home order that has had negative effects on the economy of the region.\nThis was as the governors refused to discuss the incarceration of the IPOB leader, Nnamdi Kanu, in their eight-point communique.\nThe chairman of the South-East Governors’ Forum and Governor of Ebonyi State, David Umahi, who read the resolutions of the leaders, said, “The South-East condemned the killings in the region and have agreed to join hands with security agencies to stop the killings.\n“The meeting condemned the sit-at-home orders, which are mostly issued by our people in diaspora who do not feel the pains.\n“In view of the information that even IPOB had cancelled the sit-at-home, the meeting resolved that governors and all people of the South East do everything within the law to ensure that there is no further sit-at-home in the South East and that people are allowed to freely move about in the zone.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Anambra 2021: INEC, NSA raise fresh alarm over deteriorating security",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) and the National Security Adviser (NSA) have expressed concerns over what it described as the deteriorating security situation in Anambra State ahead of the November 6 governorship election.\n‘You would recall that during our last quarterly meeting held on September 9, 2021, we received briefings and reviewed preparations for the forthcoming Anambra State governorship election.\nFrom the reports we have received, the stated goal of many of the attackers is that the governorship election scheduled for November 6 must not hold.\nThe destroyed buildings have either been completely repaired or are nearing completion and we have fully replaced the materials destroyed.\nWhile expressing more concerns, Prof Mahmood noted: ‘Perhaps, never before in our history has the importance of election security in a governorship election been this urgent."
  },
  {
    "headline": "Buhari to present 2022 budget Thursday Oct 7",
    "summarized_story": "From Fred Itua, AbujaPresident Muhammadu Buhari will on Thursday, October 7, present the 2022 budget to a joint session of the National Assembly.\nDeputy President of the Senate Ovie Omo-Agege, who presided during plenary on Tuesday, made the disclosure.\nThe president has sent a request to the National Assembly to review the recently-approved Medium Term Expenditure Framework (MTEF) downwards, following recent developments in the economy.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "Why Facebook, WhatsApp, Instagram collapsed-Facebook tech engineers",
    "summarized_story": "Facebook has explained the cause of the outage it suffered on Monday after, over its social media platforms, noting that its engineers have nipped it in the bud.\nThe outage happened around 4 p.m. in the Nigeria, and it wasn’t restored until 11pm when Mack Zuckerberg pasted and information on the social media.\nFacebook engineers nine hours after the outage and four hours after restoration—explained the reason behind it.\nAccording to facebook, “Our engineering teams have learned that configuration changes on the backbone routers that coordinate network traffic between our data centers caused issues that interrupted this communication.\nServices for all the social mediums got restored by 6 p.m., but not before an estimated $6 billion in revenue was lost for Facebook CEO Mark Zuckerberg."
  },
  {
    "headline": "Fiscal Federalism: Lagos Demands 1% in Revenue Allocation Formula",
    "summarized_story": "This is against the current revenue allocation formula, which gives the federal government 52.68 per cent, the 36 state governments 26.72 per cent, and the 774 local governments 20.60 per cent.\nThe Lagos State government’s demands were made by Governor Babajide Sanwo-Olu at the opening of a two-day South-west zonal public hearing on review of the revenue allocation formula, organised in Lagos by the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC).\n“Lagos State is, no doubt, the nation’s commercial capital, and population centre.\nIt is, therefore, necessary to give due consideration to all the variables that support our advocacy for a special status.\nIt will be totally unfair for Lagos State to be left alone to bear these huge expenses without assistance from the centre."
  },
  {
    "headline": "Buhari Presents 2022 Budget Thursday, Lays It at FEC Tomorrow",
    "summarized_story": "Blessing IbungeAll things being equal, President Muhammadu Buhari, has been scheduled to present the 2022 budget proposal before the National Assembly this Thursday.\nThis, however, would be after he would have presented same to the Federal Executive Council (FEC) tomorrow, a source in the presidency told THISDAY last night.\nAccording to the source, finishing touches were being put to the budget ahead of the Thursday presentation at the federal legislature.\nA 2022 budget call circular published by the Budget Office and signed by the Minister of Finance, Budget and National Planning, Zainab Ahmed, set out the requirements and instructions that must be satisfied and followed in the preparation of the 2022 budget proposal.\nThese, however, were followed by agriculture and rural development (N83.82 billion); aviation (N69.3 billion); trade and investment (N51.08 billion); science and technology (N48.33 billion); national security adviser (N43.14 billion); power (N40.24 billion); interior (N39.64 billion); police affairs (N32.34 billion); presidency (N25.82 billion), among others."
  },
  {
    "headline": "South-south Governors Resolve to Join VAT Collection Suit",
    "summarized_story": "The governors’ decision to join the suit currently before the Supreme Court was contained in a communiqué presented to newsmen by Delta State Governor Ifeanyi Okowa.\nIn a related development, governors and leaders of the five South-east states scheduled an emergency meeting today to address rising insecurity in the zone.\n“Unequivocally supports the decision for states to collect Value Added Tax (VAT) and resolved to join the suit before the Supreme Court.\nUmahi appealed to the governors and other leaders from the zone to endeavour to be present and not in a representative capacity.\n“We must all be vigilant, circumspect in our utterances and place our hands on the deck for solutions,” he said."
  },
  {
    "headline": "Facebook, WhatsApp, Instagram Experience Global Outage",
    "summarized_story": "Emma OkonjiThe links to all three apps of WhatsApp, Instagram and Facebook, Monday evening, went down globally, making it difficult for its global users, Nigerians inclusive, to access the apps.\nAll three apps, which are owned by Facebook and run on shared infrastructure, stopped working completely Monday before 5pm Nigerian time.\nThe situation has made it extremely difficult for global users of Facebook, WhatsApp and Instagram to access their social media platforms.\nWhen contacted, spokesperson for Facebook Nigeria, said Facebook was aware of the challenge and had issued a statement, while trying to identify and fix what must have triggered the outage.\nPart of the statement issued by Facebook Spokesperson, Andy Stone, reads: “We are aware that some people are having trouble accessing our apps and products."
  },
  {
    "headline": "Army Launches Operation Still Waters, Charges Troops to be Ruthless with Criminals",
    "summarized_story": "At the launch in Lagos, troops deployed for the exercise were charged to be ruthless with criminals disturbing the peace and security of both states.\nHowever, they were mandated to respect the rights of law abiding citizens and adhere to the rules of engagement guiding the field exercise.\nHe said during Operation Still Waters, formerly codenamed Exercise Crocodile Smile, troops were expected to practice what they had learnt in the classrooms to better prepare them on how to tackle criminal elements.\n“If we also have the security agencies on the street conducting exercises it would go a long way at deterring criminal activities in our society.\n“Test unit and sub unit commanders aspect of counter terrorism and counter insurgency operation, and test unit and sub unit commanders on inter service core operation and cooperation with other sister agencies in military operations other than war…” he said."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "BREAKING: Nigerian Government Budgets N100Billion For 2023 Elections",
    "summarized_story": "The Nigerian government has earmarked the sum of N100 billion for the conduct of the general elections in 2023.\nThe government had also increased the national budget for the fiscal year from N13.98 trillion to N16.45 trillion.\nThe letter read: “It is with pleasure that: forward the Revised 2022-2024 Medium Term Fiscal ‘Framework (MTEF) for the kind consideration and approval of the House of Representatives.\n“The PIA establishes a progressive fiscal framework aimed at encouraging investment in the Nigerian petroleum industry.\nThis significantly alters the Oil and Gas fiscal terms and has necessitated changes in the 2022-2024 Medium Term Fiscal Framework."
  },
  {
    "headline": "BREAKING: Nigerian Government Budgets N100Billion For 2023 Elections",
    "summarized_story": "The Nigerian government has earmarked the sum of N100 billion for the conduct of the general elections in 2023.\nThe government had also increased the national budget for the fiscal year from N13.98 trillion to N16.45 trillion.\nThe letter read: “It is with pleasure that: forward the Revised 2022-2024 Medium Term Fiscal ‘Framework (MTEF) for the kind consideration and approval of the House of Representatives.\n“The PIA establishes a progressive fiscal framework aimed at encouraging investment in the Nigerian petroleum industry.\nThis significantly alters the Oil and Gas fiscal terms and has necessitated changes in the 2022-2024 Medium Term Fiscal Framework."
  },
  {
    "headline": "Insecurity: IGP posts new CP to Anambra, orders deployment of special forces",
    "summarized_story": "Usman Baba, inspector-general of police (IGP), has ordered the posting of Eworo Echeng to Anambra as the new commissioner of police for the state.\nAdvertisement“The Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has ordered the immediate posting of a new Commissioner of Police (CP) to Anambra State,” the statement reads.\n“The new CP, Echeng Eworo Echeng, takes over from CP Tony Olofu who has been redeployed to the Force Headquarters, Abuja.\n“The IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State.\nAdvertisement“The IGP has charged the new Police Chief to work with other stakeholders and patriotic forces in Anambra State to restore law and order leveraging on his professional experience."
  },
  {
    "headline": "Insecurity: IGP posts new CP to Anambra, orders deployment of special forces",
    "summarized_story": "Usman Baba, inspector-general of police (IGP), has ordered the posting of Eworo Echeng to Anambra as the new commissioner of police for the state.\nAdvertisement“The Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has ordered the immediate posting of a new Commissioner of Police (CP) to Anambra State,” the statement reads.\n“The new CP, Echeng Eworo Echeng, takes over from CP Tony Olofu who has been redeployed to the Force Headquarters, Abuja.\n“The IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State.\nAdvertisement“The IGP has charged the new Police Chief to work with other stakeholders and patriotic forces in Anambra State to restore law and order leveraging on his professional experience."
  },
  {
    "headline": "South-east governors resolve to put an end to IPOB's sit-at-home orders",
    "summarized_story": "The governors of the states in the south-east say they will take necessary steps to ensure that sit-at-home orders in the region are discouraged.\nAdvertisementThe decision was taken on Tuesday, after a meeting of the governors in Enugu.\n“The meeting condemned the sit-at-home orders, which are mostly issued by our people in the diaspora who do not feel the pains.\n“The meeting agreed to support security agencies to restore peace in the South East.\nAdvertisement“The meeting resolved to support election in Anambra State and directed security agencies to ensure a peaceful election in Anambra State come November 6th, 2021."
  },
  {
    "headline": "South-east governors resolve to put an end to IPOB's sit-at-home orders",
    "summarized_story": "The governors of the states in the south-east say they will take necessary steps to ensure that sit-at-home orders in the region are discouraged.\nAdvertisementThe decision was taken on Tuesday, after a meeting of the governors in Enugu.\n“The meeting condemned the sit-at-home orders, which are mostly issued by our people in the diaspora who do not feel the pains.\n“The meeting agreed to support security agencies to restore peace in the South East.\nAdvertisement“The meeting resolved to support election in Anambra State and directed security agencies to ensure a peaceful election in Anambra State come November 6th, 2021."
  },
  {
    "headline": "INEC: Anambra attacks worrisome -- but we're determined to proceed with guber poll",
    "summarized_story": "The Independent National Electrical Commission (INEC) says in spite of security challenges, it is determined to proceed with the Anambra governorship election as scheduled.\nMahmood Yakubu, INEC chairman, spoke on Tuesday at an emergency meeting of the inter-agency consultative committee on election security (ICCES) in Abuja.\n“We wish to assure the people of Anambra state that the commission is determined to proceed with the election as scheduled.\nThe destroyed buildings have either been completely repaired or are nearing completion and we have fully replaced the materials destroyed,” he said.\n“If we add that to about 26,000 officials that will be deployed for the election, we begin to appreciate the magnitude of the challenge of securing the Anambra governorship election which is only 32 days from today.”"
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "What do current edtech innovations mean for teachers in Africa?",
    "summarized_story": "Away from the problems and given the right conditions, how important is a teacher’s role in education?\nShe believes that a teacher’s role goes beyond the board and marker.\nIn commemoration of World Teachers Day, we look at how technology aids teachers’ jobs and its role in the educational space.\nEdtech in AfricaAs technology innovations have increased in Africa, the education industry has not been left out.\nResponse of teachers to edtechThe issues raised earlier regarding poverty and infrastructural deficits mean it isn’t easy to gauge how well teachers have responded to edtech innovations."
  },
  {
    "headline": "From ‘urgent’ ₦30k to $50m: How Hanu Fejiro Abodje built Patricia from scratch",
    "summarized_story": "Hanu Fejiro Agbodje of Patricia (HFA): I have a journal where I write all my ideas in, no matter how stupid or dumb they seem.\nI was just trying to surviveMM: But what gave you the conviction that Patricia was the right idea to build on?\nAdvertisementHFA: When I had the idea for Patricia is 2015, I was in my grandad’s house.\nI didn’t even know there was a tech community for the first two years of running Patricia.\nI didn’t know what to do with it."
  },
  {
    "headline": "Nigerian telemedicine startup, iWello, is making healthcare available to people living on less than $1 per day",
    "summarized_story": "This, too, could have been taken care of if there had been surgery funding available instead of the embarrassment of begging,” Adejonwo explains.\nThe idea became iWello, a telemedicine startup, and was launched in July 2021 as a Minimum Viable Product (MVP) where users can easily consult with doctors.\nAdvertisementHealthcare for those who live below $1When it comes to healthcare, iWello claims it provides a sense of belonging to low-income people — those who live paycheck to paycheck, have difficulty living above $1 per day and live in slums and rural areas.\nThere are two types of surgery funding: paid and free.\nAnd offers surgery funding, a service Reliance Health Maintenance Organisation (HMO), a telemedicine insurance company, also provides."
  },
  {
    "headline": "Extra allocation to INEC, others see Buhari raise 2022 budget",
    "summarized_story": "Nigerian President Muhammadu Buhari has written to lawmakers seeking a 17.67 percent increase of the Federal Government’s projected expenditure in 2022 to N16.45 trillion from N13.98 trillion.\nThe projected increase in expenditure equates to N2.47 trillion additional spending, which Buhari said was partly due to the N100 billion extra provision to the Independent National Electoral Commission (INEC) to cater for 2023 General Elections.\nThe increase in expenditure was accompanied by a 21 percent rise in projected revenues to N10.13 trillion.\nBuhari stated that it was necessary to revise the MTEF to reflect the new fiscal terms in the recently signed Petroleum Industry Act (PIA) 2021, as well as other critical expenditures in the 2022 Budget.\n76 billion; MDAs internally Generated Revenue by N697.6 billion."
  },
  {
    "headline": "Lack of central database puts Nigeria on UK’s vaccine blacklist",
    "summarized_story": "The Federal Government’s failure to provide a single recognised vaccine database is the major reason the United Kingdom, (UK) has refused to approve Nigeria’s vaccine certificate, BusinessDay’s findings show.\nThe United Kingdom (UK) relaxed its COVID-19 vaccine policy for more than 50 countries but Nigeria is missing on the list.\nSo, while business travel may slow down, travel for studies, visits and holidays are still increasing,” he said.\nApart from having a synchronised database, travel experts also suggest that IATA travel passes are also accepted as an authentic means of vaccine certificate verification.\n“From my communication with the UK Government officials, the vaccines administered in Nigeria are approved by the UK Government."
  },
  {
    "headline": "Nigeria PMI hits 3 month-high despite supply constraints",
    "summarized_story": "Nigeria’s manufacturing Purchasing Managers’ Index (PMI); a gauge for manufacturing sentiments has shown signs of recovery as it achieved 50.3 points in September according to data by FBN Quest and NOI.\nThe index had dropped continuously from 51 points in May to 48 points in July before it picked up in August with 49.6 points.\nDisruptions at the global supply chain have propelled manufacturers to look inwards for local sourcing of raw materials and inputs.\n“The regional value chain can be utilised for creation, design, raw material supply, processing, transportation, storage, marketing and sales,” he said.\nNigeria’s manufacturing sector recorded 3.49 percent growth in the second quarter of 2021 which was also the highest Q2 figure across six years."
  },
  {
    "headline": "Olu Of Warri Derobes Chief Ayirimi Emami As Ologbotsere Of Warri Kingdom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – His Majesty, OGIAME Atuwatse III, Olu of Warri, has officially announced the derobing of the embattled Chief Ayiri Emami as Ologbotsere of Warri.\n“But it suffices I tell you now that, I don’t recognise the Olu as my king because his selection didn’t follow due process.\nI don’t want to say more because the case is still in the court,” Chief Emami noted.\nThe revered monarch also instructed his subjects and people Itsekiri Nation worldwide not to address the prominent chief as Ologbotsere.\nRecall that Chief Ayirimi Emami, was suspended by the Ginuwa 1 Ruling House as the Ologbotsere (Prime Minister) of Warri kingdom on the 30th of March, 2021."
  },
  {
    "headline": "Teacher’s Day: Obaseki on-boards 1000 newly trained EdoSTAR fellows – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, unveiled 1000 newly trained Edo Supporting Teachers To Achieve Results (EdoSTAR) teaching fellows, to strengthen the teaching corps in the state.\nObaseki spoke while addressing teachers at the 2021 World Teacher’s Day celebration, on Tuesday, in Benin City.\n“Today, we are not talking about teachers’ promotion again.\nWe will continue to respect our teachers; we will continue to prioritise payment of your salaries.\nIn his address, the Edo State Chairman of the Nigeria Union of Teachers (NUT), Mr. Pius Okhueleigbe, commended Governor Obaseki for implementing the 2016 to 2019 promotion arrears to affected teachers."
  },
  {
    "headline": "Always Stand On The Truth, Report Responsibly, Olu Of Warri Charges Journalists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – His Majesty, OGIAME ATUWATSE III, Olu of Warri, has charged media practitioners to always stand on the truth and shun irresponsible journalism at all times.\nThe Olu gave the charge today at his palace in Warri, Warri South Council Area of Delta State, when the Executives and members of the Nigerian Union Of Journalists, Warri Correspondents’ Chapel paid him a courtesy call.\nBut as neutral journalists, let’s stand on the truth and say it as it is.\nthe Olu, said.”The royal father there after prayed for the various media houses represented during the visit.\nIncluding,Chief Solomon Areyinka, Chief Johnson Amstseru leghe, Chief Brown Mene, Chief Dr. Roland Oritsejafor, Chief Patrick Iyaladju, Chief Bedi Giwa, Chief Omolubi Newuwumi,Chief Maleghemi Akpeto,Chief Eugene Ikomi,..."
  },
  {
    "headline": "PUWOV apprehends personnel for extortion, urges residents’ support to flush out corrupt officials – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Public Works Volunteers (PUWOV) in Edo State has apprehended one Fidelis Ugbenna, an officer of the scheme for allegedly extorting money from a motorist.\nThe State Coordinator, PUWOV, Mukhtar Yusuf-Osagie, who disclosed this to journalists in Benin City, said the personnel has been handed over to the police for further investigation and prosecution.\nReassuring the scheme’s commitment to curb criminality and ensure peace and orderliness, in partnership with other security agencies in the state, Yusuf-Osagie solicited for residents’ support to maintain discipline and flush out corrupt officers from the schemeAccording to him, “The Edo PUWOV has apprehended one Mr. Fidelis Ugbenna, a PUWOV personnel, who connived with a dismissed PUWOV personnel (Emmanuel Oviawe) to extort a private motorist at Nepa junction on Akpakpava axis of Ring Road in Benin City.”He said the corrupt PUWOV official extorted the sum of N10, 000 from Mr. Chibuzor Nenchi, a road user on the Ring Road axis, adding, “the PUWOV official, Ugbenna Fidelis has been taken to Oba Market Police Division for further investigation and prosecution.\nAlso, an immediate dismissal awaits him after prosecution.”The PUWOV coordinator further stated: “We are reassuring members of the public that the scheme will not relent in upholding its mandate on discipline as such all bad eggs will be flushed out from the scheme.\n“We want to charge members of the public to always use the PUWOV complaints lines on 09150322999 and 08132030846 to report any PUWOV official culpable of the illegal act of extortion.”“Also, members of the public should be observant and mindful of some miscreant on black outfits posing as PUWOV taskforce to extort money from innocent citizens; members of the public should report anyone involved in such illegality,” Yusuf-Osagie added."
  },
  {
    "headline": "Police deploy new commissioner to Anambra after deadly gun attacks",
    "summarized_story": "The Inspector General of Police, Usman Baba, has deployed a new commissioner of police to Anambra State, after a spate of deadly gun attacks in the South-east state.\n“The IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State,” Mr Mba said in the statement.\nMr Echeng, before his deployment to Anambra, was the commissioner of police in Bayelsa State.\nTwo days after the killing, some gunmen launched a deadly attack on a divisional police station in the state.\nMeanwhile, the South-east governors on Tuesday vowed to put an end to IPOB sit-at-home order in the region."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun: Oyetola presents N129.7bn budget for 2022 fiscal year",
    "summarized_story": "The 2022 draft Budget size was higher than the year 2021 budget N109.8bn by over N20bn.\nThe draft Budget, which is christened “Budget of Sustainable Development”, was anchored on the commitment of the Administration to providing conducive living and working environment for the people of Osun.\nOur goal is to achieve inclusive socio-economic growth that is rooted in our 10-Year Osun Development Plan (2019-2028).\nOur plan rests on four developmental pillars: Economic Development, Infrastructure Development, Human Capital Development and Security, and Environmental Sustainability.\n“I wish to commend Governor Oyetola and everyone who took part in the implementation of the 2021 budget for the wonderful job."
  },
  {
    "headline": "Anambra 2021: INEC expresses worry over security threats as gunmen escalate attacks",
    "summarized_story": "INEC Chairman, Prof. Mahmood Yakubu expressed the concern at an emergency meeting of the Inter-Agency Consultative Committee on Election Security (ICCES) in Abuja on Tuesday.\nHe said the concern was raised on how the situation might affect preparations and possibly the conduct of the Anambra election.\nYakubu appreciated the enormous challenges that the security agencies were facing in Anambra which entailed not only securing the electoral process, but also enforcing law and order.\n“This is particularly worrisome because the security agencies have also become prime targets of these mindless attacks.\nIn his remark, the National Security Adviser (NSA) and Co- Chairman of ICCES, Retired Maj.-Gen. Babagana Monguno, said that his office was working with all security agencies in the country to address the security situation in the South East."
  },
  {
    "headline": "Over N13trn pension assets invested in sectors of the economy – Dahir-Umar",
    "summarized_story": "OBINNA EZUGWUThe Director-General National Pension Commission (PenCom), Mrs. Aisha Dahir-Umar, has disclosed that an accumulated pension asset in excess of N13 trillion has been invested in various sectors of the Nigerian economy.\nDahir-Umar who stated this in her goodwill message at the opening ceremony of the two-days sensitization workshop on the “Eradication of Pension Fraud in Nigeria, said the fund is still growing.\nPension assets have continued its growth trajectory monthly, soaring to N12.78 trillion as of July 31, 2021.\nThe Act also established PenCom to regulate and supervise all pension matters in Nigeria, including the licensing of Pension Fund Administrators (PFAs) and Pension Fund Custodians (PFCs).\n“Thus, we have today, an industry that has accumulated pension assets in excess of N13 trillion, invested in various aspects of the economy and still growing."
  },
  {
    "headline": "Insecurity: Igbo leaders condemn IPOB’s sit-at-home, demand end to violence, others",
    "summarized_story": "“The meeting condemned the sit-at-home orders, which are mostly issued by our people in diaspora who do not feel the pains.\nThe communique in full:COMMUNIQUE ARISING FROM THE MEETING OF SOUTH EAST GOVERNORS, SOUTH EAST LEADERS, TRADITIONAL RULERS, NATIONAL ASSEMBLY LEADERS AND THE CLERGY HELD ON TUESDAY, 5TH OCTOBER, 2021 AT THE COUNCIL CHAMBERS, LION BUILDING, GOVERNMENT HOUSE, ENUGU.\nThe Governors and leaders of the South East condemned the killings in the region and have agreed to join hands with security agencies to stop the killings;2.\nThe meeting agreed that the South East Ebubeagu security outfit be launched in all the South East States and laws passed in various South East States before the end of 2021;4.\nThe meeting resolved to support election in Anambra State and directed security agencies to ensure a peaceful election in Anambra State come November 6th, 2021."
  },
  {
    "headline": "Convention: PDP Youths Kick Against Governors’ Move To Hijack Party",
    "summarized_story": "Ahead of the Peoples Democratic Party (PDP) national convention holding on October 30, youths of the party have warned governors elected on the platform of the party to desist from plots to hijack the party.\nThe youths under the auspices of PDP Youth Coalition and Ambassadors of Good Governance, described the recent actions of the PDP governors on the zoning of the party’s national championship seat as being tantamount to autocracy.\nThe PDP youth, specifically warned the PDP governors from the southern part of the country to stop taking position with the All Progressives Congress (APC).\nAsking if other members of the PDP family are incapable and not qualified to handle party assignments, the PDP Youth said that the action of the governors is totally undemocratic.\nWhile they appreciated the governors for funding the party, they however pleaded with them to stop interfering with party processes because they provide funding."
  },
  {
    "headline": "Convention: PDP Youths Kick Against Governors’ Move To Hijack Party",
    "summarized_story": "Ahead of the Peoples Democratic Party (PDP) national convention holding on October 30, youths of the party have warned governors elected on the platform of the party to desist from plots to hijack the party.\nThe youths under the auspices of PDP Youth Coalition and Ambassadors of Good Governance, described the recent actions of the PDP governors on the zoning of the party’s national championship seat as being tantamount to autocracy.\nThe PDP youth, specifically warned the PDP governors from the southern part of the country to stop taking position with the All Progressives Congress (APC).\nAsking if other members of the PDP family are incapable and not qualified to handle party assignments, the PDP Youth said that the action of the governors is totally undemocratic.\nWhile they appreciated the governors for funding the party, they however pleaded with them to stop interfering with party processes because they provide funding."
  },
  {
    "headline": "Terrorism: 8 Lake Chad Basin Governors To Tackle Humanitarian Crisis",
    "summarized_story": "Borno State Governor Babagana Umara Zulum and seven other governors of the Lake Chad Basin have met in Younde, Cameroon to discuss regional security cooperation and improved stability in the region.\nOrganised by the Lake Chad Basin Commission, with technical support from the African Union (AU), the United Nations Development Programme (UNDP) and Crisis Management Initiative, the meeting was hosted by the Cameroonian government in collaboration with the Lake Chad Governors’ Forum.\nEspecially on the shores of Lake Chad.\nIt is necessary to undertake holistic security operations on the shores of Lake Chad in order to clear the insurgents, otherwise, we are not going anywhere”, Zulum noted.\nZulum expressed great concern over the non-utilization of Lake Chad Basin’s shore which he noted, can provide huge economic potential to benefit the people of the region."
  },
  {
    "headline": "Terrorism: 8 Lake Chad Basin Governors To Tackle Humanitarian Crisis",
    "summarized_story": "Borno State Governor Babagana Umara Zulum and seven other governors of the Lake Chad Basin have met in Younde, Cameroon to discuss regional security cooperation and improved stability in the region.\nOrganised by the Lake Chad Basin Commission, with technical support from the African Union (AU), the United Nations Development Programme (UNDP) and Crisis Management Initiative, the meeting was hosted by the Cameroonian government in collaboration with the Lake Chad Governors’ Forum.\nEspecially on the shores of Lake Chad.\nIt is necessary to undertake holistic security operations on the shores of Lake Chad in order to clear the insurgents, otherwise, we are not going anywhere”, Zulum noted.\nZulum expressed great concern over the non-utilization of Lake Chad Basin’s shore which he noted, can provide huge economic potential to benefit the people of the region."
  },
  {
    "headline": "Nigerian Doctors, Among World’s Best Globally – CMD",
    "summarized_story": "The chief medical director of the University of Nigeria Teaching Hospital (UNTH) in Ituku Ozalla, Enugu State, Prof Obinna Onodugo, has rated Nigerian medical doctors among the best in the world.\nSpeaking at a symposium organised by the Enugu branch of the Association of Catholic Medical Doctors in Enugu, yesterday, Prof Onodugo, said Nigerians who travel abroad for medicare do so because of better facilities and not because of the competence of Nigerian doctors and health personnel.\nHe stated that his survey on the performance of medical doctors globally revealed that Nigerians are among the best in the world as healthcare providers in America, Europe, South America, Asia and other parts of Africa continue to recruit them in large numbers.\nWhile warning doctors against greed, Prof Obinna Onodugo submitted that “we have that moral responsibility to practice the profession of medicine as Catholics in accordance with God’s doctrines”.\nHe advised doctors, especially the younger ones, to invest on property and avoid luxury items like cars, stressing that the value goes down the next minute."
  },
  {
    "headline": "Report Reveals How Kebbi Gov, Atiku Bagudu Hid Billions Amassed Through Abacha",
    "summarized_story": "But in 2010, he wanted to terminate the Ridley structure and transfer his assets into another structure, hence the need for Asiaciti’s service in Singapore.\nThe Bagudu Blue structureDocuments showed that Asiaciti helped Bagudu to set up a multi-layered structure with footprints in at least three countries, namely Singapore, Cook Islands, and the United Kingdom.\nThe Blue PTC Pte Ltd is in turn the trustee of two family trusts – Blue Family Trust (1) and Blue Family Trust (2).\nUnder each trust, then, is a Singapore family-owned investment holding company, FHIC, Blue Holdings (1) Pte Limited, and Blue Holdings (2) Pte Limited, respectively.\n“Blue Holdings (2) (81,841,163 euros): Waverton – 23 million euros; James Hambro – 58,841,163 euros,” the report read."
  },
  {
    "headline": "Report Reveals How Kebbi Gov, Atiku Bagudu Hid Billions Amassed Through Abacha",
    "summarized_story": "But in 2010, he wanted to terminate the Ridley structure and transfer his assets into another structure, hence the need for Asiaciti’s service in Singapore.\nThe Bagudu Blue structureDocuments showed that Asiaciti helped Bagudu to set up a multi-layered structure with footprints in at least three countries, namely Singapore, Cook Islands, and the United Kingdom.\nThe Blue PTC Pte Ltd is in turn the trustee of two family trusts – Blue Family Trust (1) and Blue Family Trust (2).\nUnder each trust, then, is a Singapore family-owned investment holding company, FHIC, Blue Holdings (1) Pte Limited, and Blue Holdings (2) Pte Limited, respectively.\n“Blue Holdings (2) (81,841,163 euros): Waverton – 23 million euros; James Hambro – 58,841,163 euros,” the report read."
  },
  {
    "headline": "Death rumours: Olu Jacobs hale and hearty – Joke Silva",
    "summarized_story": "Legendary Nigerian actress, Joke Silva, has debunked rumours of the death of her husband, Olu Jacobs.\nAccording to news making rounds on the internet, the veteran actor was rumoured to be dead.\nHowever, in an exclusive chat with The PUNCH, Joke Silva said her husband was hale and hearty.\nShe said, “Don’t mind them, they’re just talking rubbish; don’t disturb your head.\nHe is hale and hearty.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Death rumours: Olu Jacobs hale and hearty – Joke Silva",
    "summarized_story": "Legendary Nigerian actress, Joke Silva, has debunked rumours of the death of her husband, Olu Jacobs.\nAccording to news making rounds on the internet, the veteran actor was rumoured to be dead.\nHowever, in an exclusive chat with The PUNCH, Joke Silva said her husband was hale and hearty.\nShe said, “Don’t mind them, they’re just talking rubbish; don’t disturb your head.\nHe is hale and hearty.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Police smash 34 deadly kidnappers, others, recover 11 grenades, firearms",
    "summarized_story": "The suspects are: Bashir Sule, 25; Abubakar Haruna, 30; Babangida Bature; Aliyu Idris, 24; Adam Jafar, 26; Usman Idris; Yusuf Idris, 45; Sale Musa, 25 and Umar Sale, 22.\nThey were arrested following investigations by the Police team which uncovered plans by the syndicate to carry out a major abduction of travelers along the Kano-Katsina expressway.\n“Bashir, while driving to the expected destination, stops at an agreed meeting point where his other gang members swoop in, attack, rob and abduct the passengers.\nHe said 15 cars were recovered from the suspects, with two jamming devices which aid the suspects in moving the stolen vehicles undetected.\nEleven (11) high-calibre grenades, eleven (11) sophisticated firearms, fifteen (15) stolen cars, two (2) vehicle jammers, three hundred and eighty-nine (389) AK-47 ammunition, amongst others, were recovered from the suspects."
  },
  {
    "headline": "Adele teases release of new single 'Easy On Me'",
    "summarized_story": "British singer Adele broke the internet Tuesday after teasing on Twitter, Instagram and Facebook, the 15 October release of a new single.\n“Easy On Me – October 15”, she wrote in the caption accompanying a Black and white 21 second video.\nIn the video, the 33 year-old Adele inserts a cassette into a car radio, checks herself in the mirror, then zooms off, with the ensuing sound blasting away all the music sheets in the vehicle.\nIt followed “21” in 2011 and her debut album, “19,” in 2008.\nBut it was on fire on Instagram, with over 10.3million likes in nine hours."
  },
  {
    "headline": "There Is No Peace In South East Despite Our Departure – Miyetti Allah",
    "summarized_story": "Despite their departure from the South-East and the enforcement of the anti-open grazing law, Fulani herdsmen affiliated with the Miyetti Allah Kautal Hore claim the region remains insecure.\nThe Miyetti Allah spokesman said the group would not obey the anti-open grazing law being passed in most parts of the South because open grazing remains a way of life.\nWe will invoke the wrath of God on those opposing the open grazing law,” Alhassan said.\nThe Miyetti Allah spokesman also denied reports that Dr. Chike Akunyili was murdered by herdsmen last week.\nWhen asked why herders are not embracing ranching, the Miyetti Allah spokesman argued that ranching was expensive and could not be done overnight."
  },
  {
    "headline": "Nnamdi Kanu: Yoruba Groups Meet On Sunday To Decide On Joining IPOB’s One-month Sit-at-home",
    "summarized_story": "Maxwell Adeyemi, a spokesperson for the Ilana Omo Oodua, has stated that the organization will meet on Sunday to discuss whether or not to accept the Indigenous People of Biafra’s offer to join the proposed one-month sit-at-home.\nAccording to him, the one-month protest would be subject to the refusal of the Directorate of State Services to bring its leader, Nnamdi Kanu, to court on the said date.\nWe’ll have our meeting on Sunday.”In June, Kanu leader was arrested in Kenya and extradited to Nigeria to face treason charges.\nKanu is facing charges bordering on treasonable felony instituted against him at the court in response to his agitation for the Republic of Biafra.\nThe scheduled trial in July suffered a setback, with the judge adjourning till October 21."
  },
  {
    "headline": "Kogi: Gov Yahaya Bello Swears In Three High Court Judges",
    "summarized_story": "On Tuesday, Kogi State Governor Yahaya Bello administered the oath of office to three newly appointed high court judges.\nTwo of the new judges, Hon.\nJustice Aminu Ali Eri, was a Magistrate with the FCT High Court of Justice.\nClement Kejere as the Chief Registrar of the High Court and Barr.\nMeanwhile, the newly-appointed judges are to be presented to the branch of the Nigerian Bar Association (NBA) in Kogi State tomorrow, 6th October 2021, at the headquarters of the Kogi State judiciary."
  },
  {
    "headline": "Police Arrest Suspected Killers Of Chike Akunyili, Hunt Arsonists In Anambra",
    "summarized_story": "Police Arrest Suspected Killers Of Chike Akunyili, Hunt Arsonists In AnambraThe Anambra State Police Command has arrested two suspects in connection with the murder of Chike Akunyili, husband to late former Minister of Information, Prof Dora Akunyili.\nOn Sunday, gunmen reportedly attacked Igbokwe and Okongwu’s residence in the Nnewi area of the state.\nHe added that CCTV cameras captured the arsonists arriving in a vehicle at his residence in the town.\nDuring the Nnewi attack, two persons were killed including a student of the College of Sciences student at Nnamdi Azikiwe University identified as Chioma.\nOlofu and some senior officers have visited the scene of recent attacks in the state including the DSS Office in Nnewi and the residences of Igbokwe and Okongwu."
  },
  {
    "headline": "2023 Presidency: PDP under pressure to reverse govs’ zoning arrangement",
    "summarized_story": "Ahead of Thursday’s National Executive Committee of the Peoples Democratic Party (PDP), members and leaders of the main opposition party are mounting pressure on the leadership to reject the zoning arrangement as proposed by the Governor Ifeanyi Ugwuanyi-led committee.\nEven when that observation was raised at the meeting, a certain Governor from the South- South bullied everybody to ignore something as fundamental as that,” Salau said.\n“The report is self-serving, ridiculous and embarrassing because the PDP NEC empowered and mandated the committee to recommend zoning of party offices.\n“It is on this note that we humbly demand that the National Executive Committee of our great party reject in its entirety the submissions of the zoning committee.\nCoordinator of the PDP National Youth Wing, Northwest Zone, Hon."
  },
  {
    "headline": "Ahead Thursday presentation, Buhari jerks up 2022 Budget to N16.45trn",
    "summarized_story": "Ahead of presentation this Thursday, President Muhammadu Buhari has increased the total expenditure profile of the projected 2022 budget from N13.98trillion to N16.45trllion.\nWhile the margin of increase in the projected total expenditure profile is N2.47trillion, that of deficit in the proposed budget is N692billion.\n“The revision was necessitated by the need to reflect the new fiscal terms in the Petroleum Industry Act (PIA) 2021, as well as other critical expenditures in the 2022 Budget.\n“Arising from this, and other critical expenditures that should be accommodated in 2022 Budget, the changes to the 2022 Projections in the Fiscal Framework are as follows:“Federation Account Revenue: a.\n“In view of the planned 2022 budget presentation to joint session of the National Assembly by President Muhammadu Buhari this Thursday, I move for suspension of our relevant rules for expeditious consideration of the revised 2022 – 2024 MTEF/ FSP documents ."
  },
  {
    "headline": "Npower batch C employment: Steps to take if you have been rejected by your PPA",
    "summarized_story": "Below are the steps to take if you have been rejected by your PPA.\nNote that the information below is for applicants of the NPower Batch C programmme.\nAfter collecting that, an Npower Batch c applicant should scan the acceptance letter and the rejection letter.\nAn Npower Batch c applicant should go to his or her dashboard under redeployment and upload the rejection letter and the acceptance letter and submit.\nAfter submission on N-Power Batch C applicant should then continue to check daily if it has been approved."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "‘Ebube Agu’ To Take Root Before End Of 2021 – South-East Governors",
    "summarized_story": "The South-East Governors Forum has said that the ‘Ebube Agu’ security outfit will be established in all southeast states before the end of the year.\nThe governors said this as part of their eight-point agenda during a meeting that took place at the Enugu State Government House on Tuesday.\n“The meeting agreed that the South-East Ebube Agu security outfit be launched in all the southeast states and laws passed in various southeast states before the end of 2021,” the communique read.\nThe security outfit was established in April as part of plans to checkmate the rising unrest in the region, stemming from an increase in criminal activities.\nSpeaking about the November 6 Anambra governorship elections, the governors resolved to show their support and also directed security agencies to ensure a peaceful election in the state."
  },
  {
    "headline": "FG To Pay Undergraduates Studying Education N75,000",
    "summarized_story": "The Federal Government has proposed to pay the sum of N75,000 per semester for undergraduates studying education courses in public institutions and N50,000 for those who enroll for a National Certificate In Education (N.C.E.)\nThe Minister of Education, Adamu Adamu, disclosed this on Tuesday during the celebration of this year’s World Teachers’ Day in Abuja as the Federal Government reintroduces bursary awards.\nAccording to Adamu, the fund would be sourced from UBEC, TETFund, and managed by the Federal Scholarship Board.\nConstruction is expected to take off in phases in Kaltungo, Bauchi State: Daura, Katsina State; Monguno, Borno State; Shendam, Plateau State, Wannune, Benue State; Ugep, Cross River State; Ayede, Oyo State; Ohodo, Enugu State; and Orogun in Delta State.\nMeanwhile, the Nigerian Union of Teachers (NUT) says primary and secondary school teachers in states yet to implement the new National Minimum Wage may soon be forced to withdraw their services."
  },
  {
    "headline": "President Buhari To Present 2022 Budget To NASS On Thursday",
    "summarized_story": "President Muhammadu Buhari will present the 2022 Appropriation Bill to a joint session of the Senate and House of Representatives on Thursday.\nHe made the announcement while presiding over the plenary as the Senate President, Ahmad Lawan, was absent.\nBefore the announcement, Senator Omo-Agege informed the lawmakers that President Buhari has submitted the revised 2022-2024 Medium Term Expenditure Framework MTEF and Fiscal Strategy Paper (FSP).\nThe revision, according to President Buhari, will reflect funds for the Independent National Electoral Commission (INEC) to prepare for the 2023 general elections.\nPresident Buhari had presented a proposed 2021 Budget of N13.08 trillion, to the National Assembly on October 8, 2020."
  },
  {
    "headline": "There Are Over 30 Separatist Groups In South-East, Says Abaribe",
    "summarized_story": "﻿Senate Minority Leader, Senator Enyinnaya Abaribe, says there are dozens of separatist groups in the south-east region of the country.\nHe stated this on Channels Television’s Political Paradigm where he lamented that the focus has always been on the Indigenous People of Biafra (IPOB).\n“One of the biggest problems the media has is that they tag everything IPOB,” the lawmaker said on the programme which aired on Tuesday.\nThe lawmaker asked the government to dialogue with them to restore calm and peace in various parts of the country.\nAbaribe, in his response, said, “I would if it falls on me."
  },
  {
    "headline": "Buhari Should Change His Attitude Towards South-East, Says Senator Utazi",
    "summarized_story": "The lawmaker representing Enugu North senatorial district in the National Assembly, Senator Chukwuka Utazi has asked President Muhammadu Buhari to change the way he addresses the people of the south-east region.\nUtazi made the call on Tuesday during an interview on Channels Television’s Politics Today, adding that the President’s language to the Igbos is not good.\nWhile noting that a stable Nigeria is best for the Igbos, Utazi noted that the easterners that make Nigeria home like the Igbos.\nHis attitude, language to the South-East, he has to change it,” the lawmaker said in reaction to the way forward on the agitations in the region.\nThe South-East region has witnessed a high rate of criminality including killings and kidnappings in the last few months."
  },
  {
    "headline": "Saraki expresses hope for 2023 victory as PDP starts LG congress -",
    "summarized_story": "Former Senate president, Senator Bukola Saraki, has said that existing unity and peace in the opposition party in the state would ensure its victory in the next general election.\nSpeaking with journalists in Ilorin on Tuesday after the PDP local government congress and membership e-Registration exercise at his Ajikobi Ward in Ilorin West Local Government Area of Kwara state, Senator Saraki, said that PDP is the only political party that is united and peaceful in the state.\nThe PDP leader, who asked party members to spread the message of hope among people, said that the party is ready to provide political leadership in the state come 2023.\nSaraki, who said that the party has opened more leadership positions for women and youth, added that it is all about bringing greater inclusion.\nHe described the party’s e-registration exercise as transparent and capable of reducing sharp practices."
  },
  {
    "headline": "Leadership has nothing to do with age",
    "summarized_story": "Vice President Yemi Osinbajo says the biggest problem in Nigeria’s politics is money, he says politicians that have money tend to move faster and control the structure of the party.\nThe vice president also called on young Nigerians to make themselves available to serve in lower capacities as they prepare for higher responsibilities.\nProfessor Osinbajo was the special guest at a book presentation titled “Politics that Works- what school and seminars won’t teach you about winning elections” written by Senator Babafemi Ojudu.\nAlso in attendance was the former chairman of the All Progressives Congress Comrade Adams Oshiomhole, he told people in attendance that leadership capacity has nothing to do with age, but Nigerians should give competent leaders a chance to contribute to national growth and development."
  },
  {
    "headline": "Police arrest Microfinance bank staff for planning his own robbery -",
    "summarized_story": "A staff of Abestone Microfinance Bank Abeokuta, Olagoke Dare has been arrested by men of Ogun state police command for planning with another person to rob him of cash sum of 3million naira property of his employer.\nHe stated further that it was the same Dare Olagoke who gave him the toy pistol for the operation.\nBut the lady noticed that the gun did not look Original consequent upon which she dragged the gun with him and raised alarm.\nMeanwhile, the acting commissioner of police, DCP Abiodun Alamutu, has ordered the immediate transfer of the two suspects to state criminal investigation and intelligence department for discreet investigation.\nHe therefore advised that companies should endeavor to always have background checks on their staff before employing them."
  },
  {
    "headline": "South East Governors, Leaders meet in Enugu",
    "summarized_story": "Governors and leaders of the Southeast zone have started arriving the Enugu State Government House for an emergency meeting convened by the leader and Governor of Ebonyi State, Dave Umahi.\nThe meeting is expected to address Sundry issues that relate to social, political, economic and importantly the rising insecurity in some states of the region.\nGovernor Umahi in his memo begged the south East leaders based on the attendance importance of the meeting, to enable them reach some decisions on the issues,Similarly, the wife of former Biafran Leader, Bianca Odumegwu Ojukwu in a statement credited to her, solicits the cooperation of South East leaders to attend and come up with a solution to end insecurity that is crippling the Socio economic wellbeing of the region."
  },
  {
    "headline": "Falana Accuses FG Of Illegally Supporting Herders – Trending With Ojy Okpe – Arise News",
    "summarized_story": "The global outage suffered by Facebook and its Instagram and WhatsApp platforms, plunged the services and businesses of over three billion people who rely on them into chaos for hours on Monday.\nMeanwhile human rights lawyer, Femi Falana, has criticized the Federal Government’s decision to support herders who are planning on challenging the anti-grazing law in court.\nHe says their decision is unconstitutional and described it as political suicide.\nGeneral Farouk Yahaya, flagged off new exercises launched by the Nigerian Army to tackle security challenges in the country.\nThe exercises include; Operation Golden Dawn for the South-east; operation Still Water for the coastal areas and operation Enduring Peace for some states in the North-central and Federal Capital Territory."
  },
  {
    "headline": "Nigeria Army Launches New Military Operations in South-East",
    "summarized_story": "Nigeria’s Chief of Army staff Lt. General Faruk Yahaya has flagged off a New military operation in the country’s southeastern region which he says will curb rising cases of insecurity.\nGeneral Yahaya on Monday in Enugu state launched the military operation codename Exercise Golden Dawn.\nHe says the operation will tackle insurgency, kidnapping and rising banditry in the South-East leading to wanton killings and burning of government facilities.\nThe Army Chief also launched operation Still Water for states in the South South and Southwest region as well as exercise Enduring Peace for the North Central and the Federal Capital Territory."
  },
  {
    "headline": "Justin Bieber Announces Limited-Edition ‘Peaches’ Cannabis Line",
    "summarized_story": "Justin Bieber officially enters the cannabis industry with Peaches, a limited-run weed product that comes in a sleek, stylized preroll joint pack.\nBieber’s viral mention of cannabis in the song “Peaches” off of his latest album Justice is the namesake inspiration for this preroll pack.\nTo work with Justin is really consistent with our mission.”Bieber has used his celebrity status to be candid about his mental health journey.\nThe musician offered an intimate portrait of his struggles with mental health on his YouTube Original docuseries Seasons.\n“With Justin’s help shining the spotlight on these important topics, we hope to inspire others to talk more freely about both mental health and cannabis consumption.”"
  },
  {
    "headline": "Zuckerberg Loses $7bn in Hours as Facebook Plunges",
    "summarized_story": "Mark Zuckerberg’s personal wealth has fallen by nearly $7 billion in a few hours, knocking him down a notch on the list of the world’s richest people, after a whistleblower came forward and outages took Facebook’s flagship products offline.\nA selloff sent the social-media giant’s stock plummeting around 5% on Monday, adding to a drop of about 15% since mid-September.\nThe stock slide on Monday sent Zuckerberg’s worth down to $120.9 billion, dropping him below Bill Gates to No.\n5 on the Bloomberg Billionaires Index.\nHe’s lost about $19 billion of wealth since Sept. 13, when he was worth nearly $140 billion, according to the index."
  },
  {
    "headline": "Facebook Blames ‘Faulty Configuration Change’ for Nearly Six-Hour Global Outage",
    "summarized_story": "Facebook Inc blamed a “faulty configuration change” for a nearly six-hour outage on Monday that prevented the company’s 3.5 billion users from accessing its social media and messaging services such as WhatsApp, Instagram and Messenger.\nThe company in a late Monday blog post did not specify who executed the configuration change and whether it was planned.\n“We want to make clear at this time we believe the root cause of this outage was a faulty configuration change,” Facebook said in the blog.\nThe Facebook outage is the largest ever tracked by web monitoring group Downdetector.\nA similar outage at cloud company Akamai Technologies Inc took down multiple websites in July."
  }
]