[
  {
    "headline": "BREAKING: Akinwonmi set to preside as PDP caucus meeting begins",
    "summarized_story": "In a dramatic twist to the ongoing crisis rocking the Peoples Democratic Party, the Acting National Chairman of the party, Yemi Akinwonmi, is presiding over the ongoing meeting of the party caucus, currently holding at the PDP National Secretariat, Abuja.\nAlthough the National Chairman, Uche Secondus, who, acting on an order issued by a Kebbi State High Court on Thursday, assumed office on Friday, he is not at the meeting.\nAkinwonmi said, “I came here this morning and a letter was served on me.\nCoincidentally, I met the chairman of the BoT and told him and he told me he received a copy of the same letter.\n“I want us to discuss this letter before this meeting starts.”Chairman of the PDP Governors’ Forum, Aminu Tambuwal, said, “I bring the greetings of my colleague governors to this meeting."
  },
  {
    "headline": "BREAKING: Court grants bail to ‘ESN operative’s girlfriend’ detained by IRT for over 70 days",
    "summarized_story": "A High Court sitting in the Federal Capital Territory Abuja on Friday ordered the Nigeria Police Force to charge Gloria Okolie to court on or before August 31, 2021, or be granted bail in the sum of N2m and Level 12 officer as bond and surety.\nThe court ruling is coming after over 70 days since the Intelligence Response Team arrested and detained Okolie for an alleged link to the outlawed Indigenous People of Biafra’s Eastern Security Network.\nHuman rights activist and Director-General, Behind Bars Initiative, Harrison Gwamnishu, confirmed the development to The PUNCH on Friday.\nGwamnishu and other activists had dragged the police to court to respect the fundamental rights to freedom of the 22-year-old detainee.\nThe PUNCH had reported how the young lady was reportedly detained at the IRT office in Owerri, Imo State before she was transferred to Abuja."
  },
  {
    "headline": "Full text of Ikpeazu’s broadcast on 30th anniversary of Abia State",
    "summarized_story": "Governor Okezie IkpeazuSTATE BROADCAST BY OKEZIE VICTOR IKPEAZU, Phd, GOVERNOR, ABIA STATE ON THE OCCASION OF THE 30TH ANNIVERSARY OF ABIA STATE ON FRIDAY, AUGUST 27, 2021MY GOOD PEOPLE OF ABIA STATEIt gives me great pleasure to address you today on the occasion of the 30th anniversary of the creation of our dearly beloved Abia State.\nI will shortly be convening a Summit of the youths of Abia State from all over the world where we will hold a retreat with them to hear from them, their aspirations for Abia State for inclusion in our plans and policy formulations.\nPower belongs to God and when the time comes, God will choose leaders he has predestined for Abia State.\nNo individual or group aspiration is worth more than the unity of Abia State and we will henceforth, decisively deal with any individual or group fanning the embers of disunity and disharmony in Abia State.\nThe future of Abia State is secured in the pantheon of economically and socially progressive states and I am once again, grateful to you all for the privilege of steering the ship of Abia State at this memorable epoch."
  },
  {
    "headline": "BREAKING: Panic in Lagos as petroleum product from broken pipeline spills into communities",
    "summarized_story": "By Evelyn UsmanPipeline vandals at the early hours of today broke the Ikotun section of Atlas Cove pipeline channel, causing the combustive substance to spill into many communities under Alimisho Local Government Area of Lagos State.\nAs at time of writing this report, some residents of the affected areas had fled their abodes to prevent being caught up in any likely inferno.\nConsequently , the Ikotun market was shut as the product was said to be gushing out from some drainages there.\nHowever, the Lagos State Fire and Rescue Service said its men were on ground to contain any like fire outbreak.\nBut it warned residents in the affected areas not to lit fire, so as to avert imminent danger."
  },
  {
    "headline": "How retired Commodore Kunle Olawunmi, one of Navy’s brightests, was denied promotion to Rear Admiral thrice",
    "summarized_story": "“In that regard, Commodore Olawunmi can be counted as one of few privileged officers in the Nigerian Navy at the period when Vice Admiral Adekeye held sway as CNS”.\nA source said,”Before leaving service Commodre Olawunmi, a brilliant officer, never hid his disenchantment with the Nigerian Navy and in the CNS for denying him promotion he felt he deserved”.\nAnother source added, “Retired Commodore Olawunmi allowed his disgruntlement with the Nigerian Navy to boil over.\nConsequently, one can say in sum that Commodore Olawunmi saw both the good and the bad of military service.\n“It is an aberration; you don’t attack the Nigerian Defence Academy and get away with it”."
  },
  {
    "headline": "Ayade’s former aide-turned fugitive dies in gun duel with soldiers",
    "summarized_story": "By Emma Una, CalabarThe decapitated body of Mr Thomas Tawo aka General Iron surfaced on Thursday evening after he was killed in a gun duel with soldiers and local vigilantes.\nA source in the area confirmed to Vanguard that Mr Tawo shortly after his sack went on rampage attacking persons whom he accused of being behind his sack prompting soldiers and local vigilantes to hunt for him.\n“Soldiers combed the Boki forest for close to a week looking for him and could not locate him but few hours after the soldiers left, General Iron and his men emerged from the forest to cause more mayhem by attacking all those he claimed worked with soldiers to hunt for him”.\nOur source who prefers anonymity said.\nHe said soldiers are still searching the Boki forest and palm estate for his loyalists."
  },
  {
    "headline": "Killings: Rep calls on Buhari to declare war on herdsmen, bandits in Benue",
    "summarized_story": "By Tordue Salem, AbujaA member of the House of Representatives, Rep. Benjamin Mzondu, has called on President Muhammadu Buhari, to declare a total war on killer-herdsmen and bandits in Benue State.\nThe lawmaker representing Makurdi and Guma Federal Constituency, made the call following the recent mass killings in Yelwata, Guma Local of Benue State.\nAccording to him, besides Yelwata, almost all council wards in his constituency, were under constant attacks my these groups, since 2018.\n“I urge President Muhammadu Buhari, to be mindful of not leaving a legacy of inaction in the face of this horrible threat to the existence and well-being of Benue and the entire country.\nPresident, may posterity judge you kindly, as you rise up this very moment, without hesitation to stop the bloodletting”."
  },
  {
    "headline": "Abia at 30: We have deepened democracy through impactful motions, sound laws – State Assembly",
    "summarized_story": "DAILY POST also reported that the Abia state government had lined up activities to mark the auspicious anniversary of the creation of the state.\nSuch bills passed into law include the Abia State House of Assembly Service Commission Law, the Abia State Violence Against Persons Prohibition Law, the Abia State Donor Agency Trust Fund Law, The Abia State 2020 Appropriation Law.\nThe Abia State Security Fund (ASSF) Law, the Abians in Diaspora Commission Law, The Abia State Water & Sewage Development Law.\nThe Abia State of Nigeria Supplementary Appropriation Law 2020, the Abia State of Nigeria 2021 Appropriation Law and Abia State Audit Law.\nIt emphasised that Abia State House of Assembly was one of the few states that have passed the State House of Assembly Service Commission Law."
  },
  {
    "headline": "Exam Malpractice: WAEC begins clamp down on Miracle Centres",
    "summarized_story": "The West African Examination Council, WAEC, has said it will do everything possible to stop special centres, also known as ‘Miracle Centres’.\nShe reiterated that WAEC would sanction schools suspected of foul play.\n“We make use of unique continuous assessment of candidates to identify them during exam registration.\nMiracle centres are not the making of WAEC, and we are working seriously to stop it.\nWASSCE: No more late registration – WAEC warns candidates, schools"
  },
  {
    "headline": "DSS ignores release warrant on Sunday Igboho’s aides, holds on to detainees",
    "summarized_story": "Director General of the DSS Yusuf Bichi was said to have blocked lawyers from giving effect to the release warrants since Monday when they were served on him.\nSpeaking in Abuja on Friday, Olajengbesi said his clients had, last week, met the conditions attached to the bail granted them by Justice Obiora Egwuatu of the Federal High Court, Abuja, following which the judge signed their release warrant on Monday.\nOlajengbesi said despite being served with the warrant issued by the court, the DSS has failed to release the detainees, who were arrested during the July 1 raid on Igboho’s Ibadan home by a combined team of men of the DSS and the Nigerian military.\n“It would also amount to surrendering the freedom and rights of all twelve detainees to the whims and caprices of an agency that has gone rogue and thrives in wilful disobedience of court orders.\n“Take notice that we will not fail to exhaust all legal and social remedy available to the detainees in enforcing their rights in this matter and setting the tone against the SSS’ notorious disregard of due process and the rule of law.”Judges available to release Igboho’s aides, Abuja court insists"
  },
  {
    "headline": "DSS denies dispersing doctors attending Saudi Arabian job interview",
    "summarized_story": "The Department of State Services (DSS) has denied dispersing doctors attending a Saudi Arabia-organised job interview.\nThe applicants gathered at the Sheraton Hotel in Abuja on Thursday, days after a similar interview.\nDSS Public Relations Officer, Peter Afunanya, in a statement on Friday, said the agency did not target the civilians.\n“No further evidence was also adduced to prove that the DSS carried out such operation at the hotel.\nIn recent years, hundreds of medical professionals left the country to working in countries with better health system and welfare."
  },
  {
    "headline": "NDA: Nigerians are ungrateful, launching attack to make Buhari look bad – Femi Adesina",
    "summarized_story": "President Muhammadu Buhari’s Special Adviser on Media and Publicity, Femi Adesina has described Nigerians as “ungrateful” for berating his principal over the insecurity situation in the country.\nAdesina said Nigerians are unthankful to Buhari over his efforts in curbing insecurity across Nigeria.\nReacting to the attack on the Nigerian Defence Academy, NDA, the presidential spokesman said the incident was aimed at making Buhari’s government look bad.\n“And when there is a reversal in fortunes, no matter how temporary, as happened with the NDA attack this week, you see the predilections and propensities of the evil-hearts.\nThis is the latest attack among a series of attacks in the Northern part of the country."
  },
  {
    "headline": "BREAKING: Bandits release 92 Tegina Islamiyya pupils",
    "summarized_story": "Bandits have freed 92 of the 136 pupils of Tegina Islamiyya pupils after 88 days in captivity.\nThey however held back 44 students.\nThe freed pupils were brought to Government House, Minna on Friday morning where they are waiting to meet Governor Sani-Bello.\nADVERTISEMENTDetails shortly…"
  },
  {
    "headline": "PHOTOS: Freed Tegina Islamiyya pupils receiving meals in Niger Government House",
    "summarized_story": "Pere has admitted it is difficult to move on in the House without his love interest Maria.\nPere made this..."
  },
  {
    "headline": "Seven things to know about late Victor Olaotan",
    "summarized_story": "Veteran actor Victor Olaotan died on Thursday at 69 after six years of ill health.\nOlaotan became popular for his role as Fred Ade-Williams in MNet’s popular series, Tinsel.\nVictor Olaotan was born on February 17, 1952 in Lagos State.\nOlaotan studied drama at the University of Ibadan, at the Obafemi Awolowo University and at Rockets University, United States3.\nRead Also: Veteran actor Victor Olaotan dies3."
  },
  {
    "headline": "Mercy Johnson, husband celebrate a decade of love",
    "summarized_story": "Nollywood actress, Mercy Johnson Okojie and husband, Prince Okojie, have celebrated a decade of love and marital bliss.\nThe couple shared breathtaking family photos to celebrate their 10th wedding anniversary via their respective Instagram pages.\nCelebrating a decade of love and everything beautiful, the sultry actress wrote; “What more can I ask for Lord, You have done me well Jesus….Happy Wedding Anniversary to us….\nADVERTISEMENTThey welcomed their first child, Purity, in 2012.\nThe couple went to welcome three other kids, Henry in 2014, Angel in 2015 and Divine in 2020."
  },
  {
    "headline": "‘Tinsel’ star, Victor Olaotan is dead",
    "summarized_story": "By Rita OkoyeVeteran Nollywood actor Victor Olaotan, who had a ghastly motor accident nearly four years ago, has died.\nAccording to information available to sunnewsonline.com says Olaotan died on Thursday, August 26.\nBefore his demise, Olaotan for about seven years breathed real life into the character of Fred Ade Williams on the Mnet flagship soap Tinsel.\nVictor Olaotan who was born in Lagos in the early 50’s, studied drama at the University of Ibadan, at the Obafemi Awolowo University and at Rockets University, United States.\nAn accomplished stage and screen actor, Olaotan warmed his way into the consciousness of television viewers, playing the leading role in Tinsel."
  },
  {
    "headline": "Sultan raises the alarm over worsening insecurity",
    "summarized_story": "From Fred Ezeh, AbujaSultan of Sokoto, Sa’ad Abubakar, has raised the alarm that the security situation is worsening and urged President Muhammadu Buhari, to as a matter of urgency, convoke a dialogue meeting to discuss the peace and unity.\nSultan said the dialogue meeting would be attended by traditional, community and religious leaders, opinion leaders, people from political and business communities and other people that matter in the affairs of Nigeria, to deliberate on issues of rising insecurity across Nigeria.\n“Things are getting worse in Nigeria by the day, especially the security situation.\nThe president will continue to give all necessary support to religious and traditional leaders to promote peace and unity in the country.\n“The president is very concerned about the level of insecurity and the high cost of living in Nigeria."
  },
  {
    "headline": "No land for ranching in Ebonyi, Umahi, Ohanaeze youths insist",
    "summarized_story": "From Magnus Eze and Chijioke Agwu, AbakalikiChairman of South East Governors’ Forum and Governor of Ebonyi State, Chief David Umahi, has insisted that the state does not have and would not yield any piece of its land for RUGA, ranching or whatever name it is called.\nHe also denied that his state has received N6billion from the Federal Government for the development of ranching in the area.\nReacting to a statement by Malam Garba Shehu, media aide to President Muhammadu Buhari who said on a television programme that four states including Ebonyi had received N24 billion grant for ranching, the Ebonyi State Government noted that it had been inundated with inquiries for clarification.\n“That should any Ebonyian opt to engage in personal ranching, Ebonyians should see such venture as a personal decision of such person who must use his/her land for the purpose.\n“We don’t want to lose more innocent lives in Igbo land."
  },
  {
    "headline": "More trouble for PDP as court restores Secondus as national chairman",
    "summarized_story": "The crisis in the Peoples Democratic Party (PDP) is far from over as Justice Nusirat.\nI. Umar, vacation Judge of the Kebbi State High Court, yesterday, ordered Prince Uche Secondus to return to his position as the National Chairman.\nThis came just as party accepted the Deputy National Chairman (South), Yemi Akinwonmi, as acting national chairman.\nAkinwonmi and the Deputy National Chairman (North), Suleiman Nazif, had clashed on Tuesday over who is in charge following an order by a Rivers State High Court, that restrained Uche Secondus from functioning as national chairman.\nThe acting chairman reaffirmed that the PDP national convention to elect new NWC members would hold in October."
  },
  {
    "headline": "Hushpuppi: Investigation panel submits report to IGP",
    "summarized_story": "From Molly Kilete, AbujaThe Special Investigation Panel (SIP) set up by the Inspector-General of Police (IGP), Usman Alkali Baba, to investigate the former commander of the Intelligence Response Team (IRT), DCP Abba Kyari, on his indictment by the Federal Bureau of Investigation (FBI) has submitted its report.\nForce Public Relations Officer, Frank Mba, who made the disclosure, said the chairman of the SIP, Deputy Inspector General of Police (DIG), Joseph Egbunike, presented the report to the IGP, at the Force Headquarters, Abuja.\nEgbunike, while presenting the report, told the IGP that it contained the case file of the probe, evidence and findings as well as testimonies from DCP Abba Kyari and other persons and groups linked to the matter.\nHe assured that a careful and expeditious review of the recommendations will be undertaken by the Force Management Team and, thereafter, forwarded to appropriate quarters for necessary action(s).\nHe reiterated the commitment of the Force to justice for all."
  },
  {
    "headline": "Breaking: 93 Tegina Islamiyya School Pupils Arrive Minna",
    "summarized_story": "By Laleye DipoNinety-three pupils of the Salihu Tanko Islamiyya School Tegina in the Rafi Local Government Area of Niger state Kidnapped on May 30 but released by their abductors on Thursday night have arrived in Minna, Niger state capital.\nTHISDAY learnt that the children arrived Minna at about 1am Friday.\nA source close to the children said ” They are intact” indicating that the earlier reported figure of 136 kidnapped children may have been false.\nAll the children have now been taken to a hospital in Minna for medical attention.\n“Many of them are sick, we have taken them to the hospital but not the Minna General hospital”, the source said."
  },
  {
    "headline": "Plateau Violence: Doctors Suspend Strike Due to Overwhelming Emergencies",
    "summarized_story": "On its part, the Nigerian Medical Association (NMA), Plateau State chapter, has also expressed concern over the rising traffic at hospitals’ emergency units and mortuaries in the aftermath of the violence, describing the situation as overwhelming.\nPresident of NARD, JUTH branch, Dr. Nanpon Nalda, said his members, who had been on strike for the past weeks had been recalled to the hospital “on compassionate ground” to enable them attend to emergencies.\n“In view of the current situation, I reached out to the NARD leadership for a compassionate waiver for ARD JUTH to attend to emergencies.\nThe indefatigable NARD President in consultation with other NARD leadership has graciously approved this waiver for our members in JUTH to attend to emergencies arising from the ongoing crisis in Jos.\n“The NMA frowns exceedingly at the unabating and wanton destruction, injury and killings, which are one too many."
  },
  {
    "headline": "Buhari Elated as NNPC Breaks Jinx, Declares N287bn Profit, First in 44 Years",
    "summarized_story": "Buhari stressed that NNPC’s losses were reduced from N803 billion in 2018 to N1.7 billion in 2019.\nBuhari, who doubles as Minister of Petroleum Resources, disclosed that the profit was made possible by the prudent management of the country’s resources.\nBuhari said, “I am pleased to announce the declaration of Profit after Tax of N287 billion in year 2020 by the NNPC.\nNNPC Explains How Feat Was AchievedMeanwhile, the NNPC has attributed the N287 billion profit recorded to its adoption of cost-cutting measures.\nHe listed other similar achievements in the last few months as the passage of the PIA and the historic publication of the NNPC 2018 and 2019 accounts last year."
  },
  {
    "headline": "Again, NNPC Set to Deduct N215bn from September FAAC",
    "summarized_story": "*Raises contribution to joint account in July by N20bnEmmanuel Addeh in AbujaThe Nigerian National Petroleum Corporation (NNPC) is once more set to deduct about N215.3 billion from its contribution to next month’s joint Federation Account.\nThe aforementioned amount is a combination of N175 billion value shortfall or subsidy and N40 billion Joint Venture (JV) cost recovery.\nFurthermore, in January, net revenue to FAAC was N90.8 billion; N64.161 billion in February and N41.184 billion in March.\nAlso, it was zero in April; N38.608 billion in May; N47.162 billion in June and N67.280 billion in July.\nThe July, 2021 value shortfall of N175.317.701.294.80 and outstanding balance of N40,000.000,000.00 will be deductible from the August 2021 proceeds due for sharing at the September, 2021 FAAC meeting,” the NNPC stated."
  },
  {
    "headline": "FG to Pay Arrears of Minimum Wage to Varsity Staff October",
    "summarized_story": "Report of visitation panels ready, says NgigeBy Onyebuchi EzigboThe federal government has given an undertaken to clear the arrears of the consequential adjustment on the new minimum wage owed members of the Senior Staff Association of Nigerian Universities (SSANU) and Non-Academic Staff Union of Educational an Associated Institutions (NASU) by end of October.\nNgige stated that the meeting agreed that the payment of the arrears be fast-tracked between now and the end of October, adding that arrears in salary and promotion had been captured in the 2021 Supplementary Budget.\nOn the issue of the Renegotiation of FGN/SSANU/NASU 2009 Agreement, Ngige stated that the unions and NUC would agree on a date to meet, as the secretariat of the Renegotiation Committee is ready.\nThe spokesperson, Joint Action Committee, Adeyemi Peters, described the meeting as fruitful, stating that their interactions with government is a work in progress, which would continue till the agreements are fully implemented.\nHe said the meeting was essentially to take stock of the implementation of the agreements the unions signed with the federal government on 25th February, 2021."
  },
  {
    "headline": "BREAKING: Bandits Invade Zaria, Abduct Residents, May Strike Ahmadu Bello University, Aviation College",
    "summarized_story": "Bandits on Friday morning stormed the Zango community in Samaru, Zaria town, Kaduna State and kidnapped an unspecified number of persons.\nThere are now fears that the bandits might be heading for the Ahmadu Bello University main campus, the College of Aviation and the Nigerian Institute of Transport Technology located in the same area.\nHe wrote: “Early this morning, bandits stormed Zango area Samaru, Zaria and kidnapped scores of people.\nOn July 5, bandits stormed Bethel Baptist College near Kaduna city, about 80km (50 miles) southwest of Zaria and kidnapped at least 140 schoolchildren.\nAt least eight people were also abducted from the National Tuberculosis and Leprosy Centre in Zaria the previous day."
  },
  {
    "headline": "BREAKING: Bandits Invade Zaria, Abduct Residents, May Strike Ahmadu Bello University, Aviation College",
    "summarized_story": "Bandits on Friday morning stormed the Zango community in Samaru, Zaria town, Kaduna State and kidnapped an unspecified number of persons.\nThere are now fears that the bandits might be heading for the Ahmadu Bello University main campus, the College of Aviation and the Nigerian Institute of Transport Technology located in the same area.\nHe wrote: “Early this morning, bandits stormed Zango area Samaru, Zaria and kidnapped scores of people.\nOn July 5, bandits stormed Bethel Baptist College near Kaduna city, about 80km (50 miles) southwest of Zaria and kidnapped at least 140 schoolchildren.\nAt least eight people were also abducted from the National Tuberculosis and Leprosy Centre in Zaria the previous day."
  },
  {
    "headline": "BREAKING: Unknown Helicopter Shoots Passengers’ Boat In Rivers, Many Feared Dead",
    "summarized_story": "A yet-to-be identified helicopter has reportedly shot at a local passenger boat travelling from Port Harcourt to Bonny in Rivers State.\nAccording to Punch, an eye witnesses at the Bonny-Nembe waterside where the boat took off from in Port Harcourt, told newsmen that there were casualties.\nWhile expressing shock over the incident, he said that the boat conveyed passengers and foodstuff.\n“The local boat that just left here to Bonny, within the Treasure Island area, a chopper or I will call it a flight helicopter, just came behind, went very low and started shooting at the wooden boat.\n“From the information we got from a boat driver, there were passengers in the boat."
  },
  {
    "headline": "BREAKING: Unknown Helicopter Shoots Passengers’ Boat In Rivers, Many Feared Dead",
    "summarized_story": "A yet-to-be identified helicopter has reportedly shot at a local passenger boat travelling from Port Harcourt to Bonny in Rivers State.\nAccording to Punch, an eye witnesses at the Bonny-Nembe waterside where the boat took off from in Port Harcourt, told newsmen that there were casualties.\nWhile expressing shock over the incident, he said that the boat conveyed passengers and foodstuff.\n“The local boat that just left here to Bonny, within the Treasure Island area, a chopper or I will call it a flight helicopter, just came behind, went very low and started shooting at the wooden boat.\n“From the information we got from a boat driver, there were passengers in the boat."
  },
  {
    "headline": "BREAKING: Unknown Helicopter Shoots Passengers’ Boat In Rivers, Many Feared Dead",
    "summarized_story": "A yet-to-be identified helicopter has reportedly shot at a local passenger boat travelling from Port Harcourt to Bonny in Rivers State.\nAccording to Punch, an eye witnesses at the Bonny-Nembe waterside where the boat took off from in Port Harcourt, told newsmen that there were casualties.\nWhile expressing shock over the incident, he said that the boat conveyed passengers and foodstuff.\n“The local boat that just left here to Bonny, within the Treasure Island area, a chopper or I will call it a flight helicopter, just came behind, went very low and started shooting at the wooden boat.\n“From the information we got from a boat driver, there were passengers in the boat."
  },
  {
    "headline": "Court grants Gloria Okolie, suspected IPOB informant, bail",
    "summarized_story": "A high court sitting in the federal capital territory (FCT) has asked the Nigerian Police Force to charge Gloria Okolie to court by August 31 or release her.\nAdvertisementTheCable had reported that the 22-year-old was arrested in Imo state by operatives of the Intelligence Response Team (IRT) on June 17 for being friends with a suspected member of Indigenous People of Biafra (IPOB).\nHer detention stirred public outcry as many Nigerians, including civil society organisations, have called for her release.\nAdvertisementOn Friday, the court ordered that she should be charged to court or be granted bail in the sum of N2 million and a level-12 officer as surety on or before August 31.\nHarrison Gwamnishu, the activist who has been using his social media platforms to call for justice for Okolie, confirmed the development."
  },
  {
    "headline": "Court grants Gloria Okolie, suspected IPOB informant, bail",
    "summarized_story": "A high court sitting in the federal capital territory (FCT) has asked the Nigerian Police Force to charge Gloria Okolie to court by August 31 or release her.\nAdvertisementTheCable had reported that the 22-year-old was arrested in Imo state by operatives of the Intelligence Response Team (IRT) on June 17 for being friends with a suspected member of Indigenous People of Biafra (IPOB).\nHer detention stirred public outcry as many Nigerians, including civil society organisations, have called for her release.\nAdvertisementOn Friday, the court ordered that she should be charged to court or be granted bail in the sum of N2 million and a level-12 officer as surety on or before August 31.\nHarrison Gwamnishu, the activist who has been using his social media platforms to call for justice for Okolie, confirmed the development."
  },
  {
    "headline": "Tax tribunal: Multichoice to deposit with FIRS amount equal to tax paid in preceding assessed year",
    "summarized_story": "The tax appeal tribunal (TAT) sitting in Lagos has ordered Multichoice Nigeria Limited to deposit an amount equal to the tax it paid in the preceding year with the Federal Inland Revenue Service (FIRS) for allegedly evading tax.\nAhmed, the tribunal chairman, gave the directive in accordance with paragraph 15(7) fifth schedule of the FIRS Establishment.\nIn July, the FIRS had appointed some commercial banks as agents to recover N1.8 trillion from accounts of Multichoice Nigeria Limited (MCN) And Multichoice Africa (MCA).\nRULING OF THE TRIBUNALAt the resumed hearing on Tuesday, the tribunal had refused to hear the appeal by Multichoice on grounds of jurisdiction.\nMeanwhile, the tax paid by Multichoice in the previous year of assessment has not been ascertained by TheCable, the company claims that is the lesser amount which it is willing to deposit."
  },
  {
    "headline": "Tax tribunal: Multichoice to deposit with FIRS amount equal to tax paid in preceding assessed year",
    "summarized_story": "The tax appeal tribunal (TAT) sitting in Lagos has ordered Multichoice Nigeria Limited to deposit an amount equal to the tax it paid in the preceding year with the Federal Inland Revenue Service (FIRS) for allegedly evading tax.\nAhmed, the tribunal chairman, gave the directive in accordance with paragraph 15(7) fifth schedule of the FIRS Establishment.\nIn July, the FIRS had appointed some commercial banks as agents to recover N1.8 trillion from accounts of Multichoice Nigeria Limited (MCN) And Multichoice Africa (MCA).\nRULING OF THE TRIBUNALAt the resumed hearing on Tuesday, the tribunal had refused to hear the appeal by Multichoice on grounds of jurisdiction.\nMeanwhile, the tax paid by Multichoice in the previous year of assessment has not been ascertained by TheCable, the company claims that is the lesser amount which it is willing to deposit."
  },
  {
    "headline": "Ebonyi counters Garba Shehu, denies receiving N6bn for ranching",
    "summarized_story": "The Ebonyi state government has denied receiving N6 billion from the federal government for ranching, insisting that the state has no land for such a venture.\nAdvertisementSpeaking on Politics Today, a Channels Television programme, on Wednesday night, Garba Shehu, presidential spokesman, said N24 billion had been given to four states, including Ebonyi, for cattle ranching.\nAccording to him, the Ebonyi state government “is correct in saying that they did not receive N6billion for ranching”.\nBut the source of the fund from which the four states benefited is of course the same.\n“Had the interviewer asked for detail, this clarification will have been given in the course of the discussion.”"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "6 ways to spice up your YouTube Shorts content",
    "summarized_story": "Share this article:In August 2021, YouTube announced that it would start paying YouTube Shorts creators $10,000 monthly as a reward for creating exciting and engaging content.\nYouTube Shorts lets you add music to your content by tapping the Add Music icon at the centre of the top bar.\nOne way to emphasise your points, spice up your videos, or pass your ideas across better is by adding texts to your Shorts content.\nIt’s not just for owambe food and drinks; it can apply to your Shorts content too.\nAdvertisementFor context, YouTube Shorts launched in September 2020, allowing users to make catchy 60-second videos on their mobile phones."
  },
  {
    "headline": "Dyscalculia and assistive technology, YouTube Shorts Fund, pawaPay’s $9m seed",
    "summarized_story": "YouTube Shorts has launched the YouTube Shorts Fund to help Shorts creators earn money and grow their businesses.\nThe YouTube Shorts Fund will be distributed as a monthly bonus payment to thousands of eligible YouTube Shorts creators between 2021 and 2022 as a reward for delivering innovative and engaging content on the platform the previous month.\nWhat about YouTube Shorts?\nYouTube claims that the Shorts Fund is the first step towards developing a revenue model for YouTube Shorts.\nThe round was led by UK-based seed fund and accelerator, 88mph, and MSA Capital, a Chinese VC firm."
  },
  {
    "headline": "Tizeti is testing a next-gen technology that could bring 5G-level speeds to Nigeria",
    "summarized_story": "Ananyi explains that the new speeds will be built on the WiGig infrastructure known as 60 GHz Wi-Fi, next-generation technology on par with 5G technology.\nIn 2013, the WiGig Alliance merged with the Wi-Fi Alliance, but the 60 GHz Wi-Fi retained the name WiGig.\nPer Internet World’s Stats’ December 2020 report, Nigeria has a 73% Internet penetration rate with up to 154 million Internet subscriptions.\nWith a presence in four Nigerian states and Accra, Ghana, Tizeti says it has over 10,000 voice lines and two million Internet users.\nWhile the NCC’s 5G auction seems to be some months away, Tizeti’s next-gen technology might just open the floodgates for more innovators in Nigeria’s Internet space."
  },
  {
    "headline": "OPay: From Telnet to Africa’s biggest unicorn",
    "summarized_story": "Today, Zhou Yahui, the Chinese billionaire owner of Opera, may have the title of founder/CEO of OPay, but the roots of the company trace back to Telnet, a digital transformation company.\nFounded in 1985, Telnet, which occupies a wing of a white duplex located at Kofo Abayomi, Lagos Island, does not have the flashy neon…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria far from local aircraft production",
    "summarized_story": "The Federal Government recently expressed its readiness to partner the Magnus Aircraft Manufacturing industry in Hungary to establish an assembling plant and begin to manufacture in Nigeria from start to finish before the end of the Buhari administration.\nHowever, concerns have been raised as to how ready Nigeria is to commence production of aircraft considering…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria economy yet to heal after highest GDP growth since 2014",
    "summarized_story": "Nigeria economy yet to heal after highest GDP growth since 2014Nigeria’s economy expanded at the fastest pace since 2014 in the second quarter of 2021, but does not count for much given the economy has only profited from the easing of COVID-19 restrictions that curbed economic activity last year.\nFailure to implement long standing reforms that would open the economy to more private capital while…"
  },
  {
    "headline": "Obaseki lauds Nigeria Immigration Service’s contribution to fight against human trafficking, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended the doggedness of the Nigeria Immigration Service (NIS) in the fight against human trafficking, irregular migration and banditry across the nation.\nObaseki gave the commendation while receiving the outgoing Controller of the Nigeria Immigration Service (NIS), Edo State Command, Augustina Adesola Okueyungbo, who was on a courtesy visit at the Government House in Benin City.\nThe governor also commended the outgoing controller for her dedication, commitment and diligence to the service of the state and the country.\nAccording to him, “You are proactive in your assignment and I commend you for the way you manage and handle immigration issues in Edo State.\nWe recognize all the efforts you have put in place in the fight against irregular migration, human trafficking and banditry."
  },
  {
    "headline": "Obaseki, BOI unveil N2bn MSME fund, target over 50,000 businesses – Nigerian Observer",
    "summarized_story": "The initial amount is N2 billion; we are making available N2 billion for MSMEs in Edo State.\n“In addition, we have a N165million fund, as part of the first tranche from the Edo State Government.\n“From this N2 billion fund, we estimate that we can impact as many as 50,000 businesses in Edo State.\n“The MSME fund is aimed at providing business loans to enterprises located within the state, while the second fund is the N165m Edo Production Hub Fund, financed by the Edo State Government.\nThe team also commissioned the new Bank of Industry Building in Benin City, the Edo State capital."
  },
  {
    "headline": "Residents express hope, optimism as Edo celebrates 30th anniversary tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo residents are in a jubilant mood as the state, tomorrow, Friday, August 27, 2021, celebrates the 30th anniversary of the state’s creation after the split of old Bendel State into Edo and Delta states, in 1991.\nThe ceremony, which was significantly scaled down in line with the state’s COVID-19 regulations, will also feature an online celebration by Edo people in Diaspora on Saturday, August 28, 2021.\nA cross section of elated residents, who spoke with journalists in Benin City, noted that the 30th anniversary is a celebration of hope for a better Edo, where all citizens’ lives and security are guaranteed, with assurances for the realization of their fullest potentials.\nIt is my sincere hope that the 30th-anniversary celebration would usher in even more progress, greater prosperity and endearing fulfillment for all our people.”Another resident, Aisosa Igbinovia noted: “The 30th anniversary of Edo State is a worthwhile celebration, considering the much that we have achieved in a short while.\nThough we are yet to get to our desired destination, I want to encourage all Edo people to be hopeful of a better future for the Edo Nation."
  },
  {
    "headline": "COVID-19 3rd wave: Seven unvaccinated persons die, infections rising, as Edo opens more points for vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State is witnessing a sharp rise in the number of COVID-19-related deaths and infections, with unvaccinated persons accounting for 100 percent of fatalities recorded in the state.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nAccording to him, “Edo State, in the last 24 hours, recorded two more COVID-19-related deaths, bringing the total number of deaths recorded in the third wave of the pandemic to 7.\n“While 100 percent of the deaths recorded in the state are unvaccinated persons, 96 percent of infections in the state are people who were never vaccinated against the deadly virus.\nThe vaccines are safe, free and effective,” the Incident Manager noted."
  },
  {
    "headline": "#EndSARS Judicial Panels: 28 states complete assignment — Osinbajo",
    "summarized_story": "ADVERTISEMENTVice President Yemi Osinbajo says all 28 states that established Judicial Panels on EndSARS have completed their assignments, except Lagos State’s panel which will be ready by October.\nNEC had in the wake of violent EndSARS protests against police brutality of 2020, directed states to constitute Judicial Panels of Inquiry to investigate complaints against the Special Anti-Robbery Squads (SARS) and other police units.\nMe Osinbajo’s spokesman, Laolu Akande, in a statement on Thursday, said the vice president presided over a virtual meeting of the National Economic Council (NEC) anchored from the Presidential Villa, Abuja.\n“States should ensure that mandatory isolation is observed; there is an increase in the usage of oxygen,’’ Mr Sanwo-Olu said.\nHe said that the Delta variant had remained the dominant variant in the country recently and was present in eight states."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Catholic Bishops decry Nigeria’s worsening insecurity, demand electronic transmission of election results",
    "summarized_story": "Catholic Bishops in Nigeria under the auspices of Catholic Bishops Conference of Nigeria (CBCN), have lamented the security situation in the country, noting that Nigeria is now one of the most terrorised countries globally.\n“Deaths in the hands of kidnappers, killer herdsmen, bandits, terrorist groups have made Nigeria one of the most terrorized countries in the world.\nThe abductions of school children present us with the prospects of a traumatized generation of young people,” the communique said.\nWe urge the government to ensure a just and fair trial of the arrested key players in the struggles.\nWe call on the National Assembly to reconsider its position in the light of world best practices,” the communique added."
  },
  {
    "headline": "DSS denies dispersing doctors at Saudi Arabia’s recruitment exercise in Abuja",
    "summarized_story": "The Department of State Services (DSS) has denied dispersing doctors attending a recruitment exercise organised by Saudi Arabia Ministry Health at the Sheraton Hotel, Abuja.\nA recruitment exercise for doctors by Saudi Arabia was held in Lagos earlier in the week, with another scheduled for Thursday.\nBut our correspondent had reported that DSS operatives besieged Sheraton Hotels, venue of the recruitment exercise, and dispersed the doctors seeking greener pastures.\nBut in a statement on Friday, Peter Afunanya, spokesman of the DSS, described the reports as false.\nNo further evidence was also adduced to prove that the DSS carried out such operation at the hotel."
  },
  {
    "headline": "JUST IN: Many feared dead as helicopter reportedly shoots passengers’ boat in Rivers",
    "summarized_story": "BY EMEKA EJEREA yet-to-be-identified helicopter has reportedly shot at a local passenger boat travelling from Port Harcourt to Bonny in Rivers State, with many passengers feared killed.\nAccording to The Punch, an eye witnesses at the Bonny-Nembe waterside where the boat took off from in Port Harcourt, told newsmen that there were casualties.\nThe boat which departed Bonny through Treasure Island area was said to be conveying many passengers and foodstuffs.\nHowever, the number of casualties cannot be ascertained as at press time as details of the incident are still sketchy.\nWhen contacted, the Rivers State Police Public Relations Officer, Nnamdi Omoni said, “We can’t verify the report now but we are working on it”."
  },
  {
    "headline": "Bandits free Niger pupils after collecting N68m ransom, six dead",
    "summarized_story": "Bandits on Thursday, released the remaining pupils of the Tanko Salihu Islamiyya School they held for 88 days after they whisked them away from Tegina area of Niger State.\nThe bandits were said to have collected N68million ransom to release the pupils, six of whom died in captivity, while 17 of the initial 136 abductees escaped.\nThe kidnappers had agreed to free the remaining 116 pupils if the ransom reduced from the initial N200million to N50million was paid, Daily Trust reported.\nBesides, the kidnappers also made fresh demand asking the parents to supply six brand new Bajaj motorcycles before the pupils would be released.\nFindings also revealed that they were released after the payment of additional N18million ransom and supply of the additional motorcycles demanded by the bandits."
  },
  {
    "headline": "3 Injured As Military Chopper Opens Fire On Cargo Boat In Rivers",
    "summarized_story": "Three people were on Thursday evening injured when a suspected military helicopter opened fire on a wooden boat conveying passengers and goods to Bonny Island in Rivers State.\nHowever, it could not be ascertained if the helicopter belong to the Nigerian Airforce or the Air Wing of the Nigerian Navy.\nADVERTISEMENTThe source said: “The local boat that just left here (Nembe/Bonny Jetty) for Bonny, on their way within that Dutch Island area, a chopper just come behind and bring itself low down, start shooting the wooden boat.\n“A boat driver said people were in that boat, that boat conveys garri, rice, with other other things and everybody knows that that is the source of quick transporting of foodstuffs to Bonny; the boat left Port Harcourt, making its way to Bonny.\n“It is not hidden, everybody saw it, the chopper fled through this way."
  },
  {
    "headline": "3 Injured As Military Chopper Opens Fire On Cargo Boat In Rivers",
    "summarized_story": "Three people were on Thursday evening injured when a suspected military helicopter opened fire on a wooden boat conveying passengers and goods to Bonny Island in Rivers State.\nHowever, it could not be ascertained if the helicopter belong to the Nigerian Airforce or the Air Wing of the Nigerian Navy.\nADVERTISEMENTThe source said: “The local boat that just left here (Nembe/Bonny Jetty) for Bonny, on their way within that Dutch Island area, a chopper just come behind and bring itself low down, start shooting the wooden boat.\n“A boat driver said people were in that boat, that boat conveys garri, rice, with other other things and everybody knows that that is the source of quick transporting of foodstuffs to Bonny; the boat left Port Harcourt, making its way to Bonny.\n“It is not hidden, everybody saw it, the chopper fled through this way."
  },
  {
    "headline": "DSS Denies Dispersing Job-seeking Doctors At Abuja Hotel",
    "summarized_story": "The Department of State Services (DSS) said its operatives did not at any time disperse doctors attending a Saudi Arabia organised job interview at the Sheraton Hotel in Abuja.\nDSS spokesperson, Dr Peter Afunanya, in a statement on Friday, said: “the attention of the Department of State Services has once again been drawn to a falsehood being circulated in the media that it dispersed doctors attending a Saudi Arabia organised job interview at the Sheraton Hotel, Abuja, yesterday 26th August, 2021.\nADVERTISEMENT“Though this is illogical and does not add up, sections of the media that reported it did not care to verify the news before going to print.\n“No further evidence was also adduced to prove that the DSS carried out such operation at the hotel.\n“Journalists and other media practitioners are enjoined to crosscheck their facts and ensure that they do not use their platforms to mislead the public or undermine national security.”"
  },
  {
    "headline": "DSS Denies Dispersing Job-seeking Doctors At Abuja Hotel",
    "summarized_story": "The Department of State Services (DSS) said its operatives did not at any time disperse doctors attending a Saudi Arabia organised job interview at the Sheraton Hotel in Abuja.\nDSS spokesperson, Dr Peter Afunanya, in a statement on Friday, said: “the attention of the Department of State Services has once again been drawn to a falsehood being circulated in the media that it dispersed doctors attending a Saudi Arabia organised job interview at the Sheraton Hotel, Abuja, yesterday 26th August, 2021.\nADVERTISEMENT“Though this is illogical and does not add up, sections of the media that reported it did not care to verify the news before going to print.\n“No further evidence was also adduced to prove that the DSS carried out such operation at the hotel.\n“Journalists and other media practitioners are enjoined to crosscheck their facts and ensure that they do not use their platforms to mislead the public or undermine national security.”"
  },
  {
    "headline": "APC Govs Laud Zulum’s Commitment To Anti-terror War",
    "summarized_story": "Governors elected on the platform of All Progressives Congress (APC) have applauded the commitment of Borno State Governor Prof.Babagana Zulum, to the Anti-terror war.\nTheir position was contained in a statement signed Thursday by chairman of the group and Kebbi State governor, Abubakar Bagudu.\nThe governors operating under the auspicies of Progressive Governors Forum (PGF) issued the statement to commemorate Zulum’s 52nd birthday.\nADVERTISEMENT“We wish to acknowledge and commend your exemplary leadership, vision and commitment to a united and peaceful Nigeria.\n“Your insightful and resolute passion to mobilise Nigerians towards ending insecurity and managing processes of governance is a source of inspiration."
  },
  {
    "headline": "Reps order aviation college: Increase tuition to N14m now",
    "summarized_story": "The House of Representatives Committee on Finance has demanded an increment in the N7.5m being charged by the Nigerian College of Aviation Technology, Zaria as school fees, to N14m.\nThe committee argued that the fees should be increased considering the fact that its competitor in Ilorin, Kwara State, charges N22.5m.\nThe panel held an interactive session on the Medium Term Expenditure Framework and Fiscal Strategy Paper with the college authorities on Thursday.\nThe Head of Quality Assurance of the College, Ibrahim Hirse, gave a presentation before the committee.\nHe said the college was unable to increase the fees of the college because the government wanted to allow the masses to attend the school."
  },
  {
    "headline": "Reps order aviation college: Increase tuition to N14m now",
    "summarized_story": "The House of Representatives Committee on Finance has demanded an increment in the N7.5m being charged by the Nigerian College of Aviation Technology, Zaria as school fees, to N14m.\nThe committee argued that the fees should be increased considering the fact that its competitor in Ilorin, Kwara State, charges N22.5m.\nThe panel held an interactive session on the Medium Term Expenditure Framework and Fiscal Strategy Paper with the college authorities on Thursday.\nThe Head of Quality Assurance of the College, Ibrahim Hirse, gave a presentation before the committee.\nHe said the college was unable to increase the fees of the college because the government wanted to allow the masses to attend the school."
  },
  {
    "headline": "World Cup qualifiers: Nigeria invite 30 players + Full list",
    "summarized_story": "Super Eagles Technical Adviser, Gernot Rohr has called up a total of 30 players for next month’s opening rounds of the FIFA World Cup Qatar 2022 qualifying campaign, in which Nigeria will host Liberia in Lagos on Friday, 3rd September (Day 1) and tackle Cape Verde in Mindelo on Tuesday, 7th September (Day 2).\nThe situation with UK-based players, who may not be heading to Cape Verde (which is on the red list of the British Government with regards to the global coronavirus pandemic) has enlarged the roster, and should the situation remain unchanged, the eight UK-based players on the list would head back to base after the clash with Liberia at the Teslim Balogun Stadium in Lagos on Friday.\nThere is a return for South Africa-based goalkeeper Daniel Akpeyi, defenders Kenneth Omeruo and Kevin Akpoguma and Greece-based forward Henry Onyekuru.\nFormer junior international Kingsley Michael is also called, as Innocent Bonke from Sweden joins the Nigerian camp for the first time.\nCentral African Republic is the other team in the group, and they will line up for home-and-away encounters with the Super Eagles in October."
  },
  {
    "headline": "World Cup qualifiers: Nigeria invite 30 players + Full list",
    "summarized_story": "Super Eagles Technical Adviser, Gernot Rohr has called up a total of 30 players for next month’s opening rounds of the FIFA World Cup Qatar 2022 qualifying campaign, in which Nigeria will host Liberia in Lagos on Friday, 3rd September (Day 1) and tackle Cape Verde in Mindelo on Tuesday, 7th September (Day 2).\nThe situation with UK-based players, who may not be heading to Cape Verde (which is on the red list of the British Government with regards to the global coronavirus pandemic) has enlarged the roster, and should the situation remain unchanged, the eight UK-based players on the list would head back to base after the clash with Liberia at the Teslim Balogun Stadium in Lagos on Friday.\nThere is a return for South Africa-based goalkeeper Daniel Akpeyi, defenders Kenneth Omeruo and Kevin Akpoguma and Greece-based forward Henry Onyekuru.\nFormer junior international Kingsley Michael is also called, as Innocent Bonke from Sweden joins the Nigerian camp for the first time.\nCentral African Republic is the other team in the group, and they will line up for home-and-away encounters with the Super Eagles in October."
  },
  {
    "headline": "Garba Shehu lied: Ebonyi denies collecting N6bn from Buhari govt.",
    "summarized_story": "The Ebonyi State Government has denied collecting N6 billion from President Muhammadu Buhari-led’s administration for ranching.\nEbonyi made the disclosure after Mr Garba Shehu, Senior Special Assistant to President Muhammadu Buhari on Media and Publicity, in a television interactive programme on Wednesday, cited Ebonyi as one of the states that collected such funds to implement ranching.\nHowever, Ebonyi insisted that the state had no land for such a venture.\n“The government will not receive any money for ranching, because there is no land for such purpose in the state.\nIn the statement, Nwaze maintained that the state government would not renege on its decision not to offer land in the state for such purpose."
  },
  {
    "headline": "El-Zakzaky under house arrest? Passport not released by Buhari govt",
    "summarized_story": "The leader of the Islamic Movement in Nigeria, Sheikh Ibraheem El-Zakzaky, and his wife, Malama Zeenah Ibrahim, appear to be under a house arrest of some sort.\nThe muslim leader wants to travel abroad for medical treatment, but he has not been able to go as his passport and his wife’s have not been released.\nThis has triggered suspicions that some powerful actors in the Buhari presidency are deliberately denying the Shiite leader his rights.\n“That was the basis for the Kaduna state high court granting them medical leave which was later scuttled by the government in 2018.\n“Hence, we call on the international community to prevail on the government to release the passports of Sheikh Zakzaky and his wife."
  },
  {
    "headline": "Bandits Attack Community In Zaria, Abduct Scores Of Residents",
    "summarized_story": "Armed men suspected of being bandits attacked the Zango village in Samaru, Zaria town, and kidnapped an undetermined number of residents.\nThe attackers entered the community with sophisticated weaponry on Friday morning, shooting erratically before whisking the victims away from the scene, according to DAILY POST.\nWhen DAILY POST called the state’s Public Relations Officer, ASP Mohammed Jalige, he stated he would look into it and get back to us.\nThe former lawmaker advised institutions in the impacted area to be proactive in a post on his verified Twitter feed.\nThe tweet reads, “Early this morning, Bandits stormed Zango area Samaru, Zaria & kidnapped scores of people."
  },
  {
    "headline": "BREAKING: Akinwonmi Set To Preside As PDP Caucus Meeting Begins",
    "summarized_story": "In a dramatic twist to the Peoples Democratic Party’s continuing crisis, the party’s Acting National Chairman, Yemi Akinwonmi, is currently presiding over a meeting of the party caucus at the PDP National Secretariat in Abuja.\nDespite the fact that the National Chairman, Uche Secondus, took office on Friday following an order issued by a Kebbi State High Court on Thursday, he is not present at the meeting.\nAkinwonmi said, “I came here this morning and a letter was served on me.\nCoincidentally, I met the chairman of the BoT and told him and he told me he received a copy of the same letter.\n“I want us to discuss this letter before this meeting starts.”Chairman of the PDP Governors’ Forum, Aminu Tambuwal, said, “I bring the greetings of my colleague governors to this meeting."
  },
  {
    "headline": "ODM Publisher And Founder, Bishop Chris Kwakpovwe Loses Mum",
    "summarized_story": "Bishop Chris Kwakpovwe; a Christian minister, trained pharmacist and author who is the founder and senior pastor of Manna Prayer Mountain Ministry Worldwide and also the author of Our Daily Manna, a daily devotional has just lost his mother.\nHis mum, Mrs Theresa Kwakpovwe died a few days ago at the age of 80 after a brief illness.\nMrs Kwakpovwe who hails from Eruemukohwharien village in Ughelli North, Delta State was respected and devoted woman one faith.\nHer death comes a few years after the demise of her husband Mr S.K Kwakpovwe.\nher burial plans will be announced by the family later."
  },
  {
    "headline": "BREAKING: Unknown Helicopter Shoots Passengers’ Boat In Rivers, Many Feared Dead",
    "summarized_story": "A local passenger boat traveling from Port Harcourt to Bonny in Rivers State was purportedly shot at by an unidentified chopper.\nAccording to Punch, newsmen were told that there were casualties at the Bonny-Nembe waterside in Port Harcourt, where the boat took off from.\nWhile expressing his disbelief at the incident, he explained that the boat was transporting passengers and food.\n“From the information we got from a boat driver, there were passengers in the boat.\n“Everyone knows that is the route transporting foodstuff to Bonny."
  },
  {
    "headline": "Updated: Relief as 130 Tegina Islamiyya school children regain freedom after 3 months in captivity",
    "summarized_story": "Over 130 pupils abducted from Tegina Islamiyya School in Rafi Local government area of Niger state have been released by after almost three months in captivity.\nThe head teacher of the school, Alhassan Ahmed, confirmed this on Thursday night, adding that all the children kidnapped on May 30, 2022, have been released.\nHe said all the children were however sick with different ailments.\nAlso the Secretary to the State Government (SSG), Ahmed Matane, has confirmed the release of the kids.\nAs at the time of filing this report, the extent of involvement of the state government in the release of the pupils was not clear, ."
  },
  {
    "headline": "Nigeria’s 5.01% GDP growth: Buhari speaks as non-oil sector rises to 6.74%, ICT 17.92%",
    "summarized_story": "President Muhammadu Buhari has welcomed Thursday’s Q2 2021 report by the Nigerian Bureau of Statistics (NBS) showing a third consecutive quarter of positive growth of Nigeria’s economy, and the highest quarterly growth in GDP since 2014.\nThe reportThe Gross Domestic Product (GDP) grew by 5.01% in Q2 2021 following 0.51% growth in Q1 2021.\nAccording to the report, the growth was an indication of the return of business and economic activity near levels seen prior to the nationwide implementation of COVID-19 related restrictions.\n“The non-oil sector is a significant contributor to the economic performance in Q2 2021 with growth of 6.74% in real terms, the fastest growth in the sector since the third quarter of 2014.\n“The President notes the decline in real growth in the oil sector in Q2 2021, compared to a year ago."
  },
  {
    "headline": "Banditry: Zamfara hosts 184,000 IDPs, 600,000 women, children displaced… Village head, 49 others abducted",
    "summarized_story": "Zamfara state Governor Bello Mohammed Matawalle has opened up on the effects of banditry on people of the state.\nSpecifically, the governor said as at the last count, about 184,000 internally displaced households have been recorded, while another 600,000, mostly women and children were displaced.\nOver 50 abducted in fresh attackAnd in another attack, a group of bandits Thursday stormed Kairu village under Kyaram District of Bukkuyum local government area of Zamfara state, during which they abducted over 50 villagers, including the village head, Malam Ummaru Mahuta Kairu.\nThe statement reads: “The troops of Multinational Joint Taskforce (MNJTF) Sector 4 displayed uncommon acts of gallantry and bravery when their location was attacked.\nExtremely regrettably however, seven gallant MNJTF soldiers paid the supreme sacrifice, while four other soldiers sustained varying degrees of injuries and are being treated in a military hospital."
  },
  {
    "headline": "Flood: NEMA activates emergency operations in affected areas -NigPilot",
    "summarized_story": "Following the flood incidences in many parts of the country, Director General of National Emergency Management Agency NEMA , Mustapha Habib Ahmed has disclosed that the agency was already monitoring the situation to activate Emergency Operations Centres in the affected areas for search and rescue as well as conduct assessment to support the displaced persons.\nThis was disclosed in a statement by the Agency’s head, media, and public relations officer, Manzo Ezekiel.\nThe NEMA DG said the workshop was imperative as one of the expedient steps necessary to collectively prepare for and provide strategies to strengthen flood risk mitigation and effective response among disaster management stakeholders in the country.\nHighlighting the flood situation so far this year, he said there have been reported cases of flooding in 210 Local Government Areas in 32 States and Federal Capital Territory with attendant loss of lives, livelihoods and properties.\nParticipants at the workshop were Executive Secretaries of all the State Emergency Management Agencies SEMAs, representatives of Centres for Disaster Risk Management Studies from six universities and Heads of NEMA zonal, Territorial and Operations Offices."
  },
  {
    "headline": "FRC, NOA collaborate to entrench prudence, accountability in governance -NigPilot",
    "summarized_story": "Fiscal Responsibility Commission, FRC, has been assured of the willingness of the National Orientation Agency, NOA , to collaborate with it to entrench prudence, accountability, transparency and, generally, fiscal responsibility in governance and governments at all tiers of government.\nThe assurance was given by Dr Garba Abari, Director-General of the National Orientation Agency, NOA, while receiving a delegation of F iscal Responsibility Commission, FRC led by the Chairman, Victor Muruako Esq, in his office in Abuja, recently.\nWhile requesting for collaboration with NOA, the FRC Chairman stated his Commission’s recognition of the need for NOA to help the Commission in carrying citizens of the country along.\nHe said that NOA would undertake grassroots sensitisation and advocacy by translating salient points in the Fiscal Responsibility Act into various Nigerian languages.\nNigerian Pilot gathered that the courtesy Visit was part of the strategic engagements of the Fiscal Responsibility Commission towards mainstreaming discussions on fiscal responsibility in communities and at street level."
  },
  {
    "headline": "NSSEC funds meant to improve standard of Senior Secondary education- Abakpa -NigPilot",
    "summarized_story": "Executive Secretary National Senior Secondary Education Commission, NSSEC , Dr. Benjamin Abakpa has clearly stated that accessing the NSSEC fund is not a goldmine, rather it is a commitment towards raising the standard of Senior Secondary Education in the country.\nAbakpa stated this when a group of Development Partners paid him a working visit in his office, Abuja recently, to ascertain the readiness of the Commission in repositioning Senior Secondary Education in the Country, and to seek ways of collaboration with NSSEC.\nHe emphasized the Commission’s commitment to building an accurate database for all the Senior Secondary Schools across the country for effective planning, learning, and proper disbursement of the NSSEC fund.\nAbakpa, however, urged the Development Partners to collaborate with the Commission in addressing challenges confronting Senior Secondary Education in Nigeria.\nAlso speaking, Malala Foundation representative, Femi Aderibigbe expressed sadness in the rise of students drop out of school after the completion of the basic education as a result of the inability to access the Senior Secondary School."
  },
  {
    "headline": "APGA Guber Candidacy: Umeoji posters flood major Anambra, Abuja streets ahead of door-to-door campaign launch -NigPilot",
    "summarized_story": "Chukwuma Umeoji, the candidate of the All Progressives Grand Alliance, APGA , in the November 6 governorship election in Anambra State, has flooded the streets of Anambra and Abuja with his campaign posters.\nCities and towns like Awka, Onitsha, Ekwulobia, Ihiala, Nnewi, and indeed the streets of the Federal Capital Territory, Abuja, have large size posters in strategic places.\nThe flooding of the posters is not unconnected to the imminent formal launch of the Chukwuma Umeoji campaign which the Jude Okeke faction of APGA has vowed will be done in a matter of days.\nUmeoji as the candidate of the party.\nHence they are not prepared to suffer any disadvantage and that the campaigns will commence and run seamlessly and victory assured."
  },
  {
    "headline": "Freed Islamiyya Students Arrive At Niger State House",
    "summarized_story": "The over 100 students of an Islamic seminary who were recently freed after three months in the den of kidnappers have arrived at the Niger State Government House.\nUpon arrival, they were greeted by their parents and government officials, all cheerful for their safety.\nRead Also: Gunmen Free 100 Islamiyya Students Three Months After AbductionThe gunmen had abducted the students from their school in Rafi Local Government Area of Niger State on May 30.\nA few days later, they demanded a ransom of ₦110 million and threatened to kill the victims but 11 of them were released hours later, according to the Niger State Government.\nThe governor of the North-Central state, Sani Bello had earlier ruled out the option of paying a ransom to the abductors."
  },
  {
    "headline": "Unidentified Helicopter Shoots Passenger Boat In Rivers",
    "summarized_story": "At least one person is reportedly in a critical condition after a yet-to-be-identified helicopter shot at a passenger boat along the Port Harcourt – Bonny waterway in Rivers State on Thursday night.\nAn eyewitness told Channels Television that the wooden boat was ferrying traders and their goods from Port Harcourt to Bonny when it was targeted by the unidentified helicopter.\nHe said many were injured, but one person is reported to be in a critical situation after sustaining an injury which is believed to have affected his spinal cord.\nRead Also: 10-Year Memorial For Victims Of UN House Bombing In PicturesOn the possible motive of the attack, the eyewitness who is a boat driver at the Bonny jetty in Port Harcourt, said the helicopter which he thinks was on surveillance duty, may have suspected the boat to be conveying illegally refined petroleum products, which is a common business in the area.\nNo security agency has claimed responsibility and the police are yet to make any comment regarding the incident."
  },
  {
    "headline": "Gunmen Free 100 Islamiyya Students Three Months After Abduction",
    "summarized_story": "Gunmen have freed over 100 pupils kidnapped from an Islamic seminary in Niger State nearly three months ago, the school’s head teacher said on Thursday.\nThe gunmen had abducted the schoolchildren from their school in Rafi Local Government Area of Niger State on May 30th.\nThey demanded a ransom of ₦110 million and threatened to kill the victims but eleven of the students were released later, according to the Niger State Government.\nGunmen who kidnapped more than 100 students from a Baptist high school in Kaduna State released 15 more of those hostages.\nAround 1,000 students have been kidnapped since December after gunmen started to hit schools."
  },
  {
    "headline": "Death Toll In Kabul Airport Blasts Rises To 72 – Former Health Officials",
    "summarized_story": "The death toll from two blasts at Kabul’s airport has risen to 72, two officials who worked in the ministry of health until the Taliban takeover told AFP on Friday.\n“There are many women and children among the victims.\nMost of the wounded people are in trauma and shock,” one of the former officials said, adding the toll only accounted for those taken to city hospitals.\nREAD ALSO: Explosion Outside Kabul Airport, No Word On CasualtiesREAD ALSO: Afghans Race To Flee Taliban After Biden Confirms August 31st Airlift Deadline"
  },
  {
    "headline": "Afghan Evacuation Flights Resume After Deadly Suicide Bombings",
    "summarized_story": "Last-ditch evacuation flights took off from Kabul airport on Friday, a day after twin suicide bombings on crowds trying to flee Taliban-controlled Afghanistan killed at least 85 people, including 13 US servicemen.\nPresident Joe Biden, under enormous pressure over his administration’s handling of the Afghan crisis, vowed to punish those responsible.\nBritain and Spain announced their evacuation operations would end Friday, after Canada and Australia had already stopped their flights.\nWestern allies have repeatedly warned the United States that it is impossible to get all at-risk Afghans out by Tuesday.\nA clearly shaken Biden went before TV cameras to address the American people, describing the killed US troops as heroes."
  },
  {
    "headline": "GOC 8 Division Nigerian Army meets with Zamfara CP on security issues",
    "summarized_story": "The General Officer Commanding Eight Division Nigerian Army Sokoto, Major General Uwem Bassey arrives the headquarters of the Nigerian Police force Zamfara state CommandMajor General Uwem Bassey is also the Commander of the joint task force operation Hadarin Daji northwest zoneHe is on a courtesy visit to the police commandOn arrival, the senior military officer was received by the police commissioner CP Ayuba Elkana and a guard of honor at the premises of the commandThe duo are expected to discuss on issues of security in Zamfara and neighbouring statesAdvertisementZamfara, Sokoto and Kebbi states are experiencing Resurgence of armed Banditry and abduction of persons and students in recent times.\nThe two senior officers are in closed door meeting as at the time of filling this report."
  },
  {
    "headline": "Updated: Gov Bello receives 90 children abducted from Tegina community",
    "summarized_story": "Governor Abubakar Sani Bello has officially received 90 children abducted from Tegina community in Rafi local government area of Niger state.\nThe governor said one of the children died while in captivity and two other persons earlier abducted were also released.\nThe school children spent 88 days in captivity before they were released."
  },
  {
    "headline": "Mimiko, Yinusa, bid Mohammed Fawehinmi farewell",
    "summarized_story": "Former Governor of Ondo state, Olusegun Mimiko was one of the notable Nigerians that graced Mohammed Fawehinmi’s final burial.\nAlso at the burial programme was the national Chairman of the national Conscience party, Tanko Yinusa.\nMr. Mimiko described the late Mohammed as a man who stood firmly against Injustice.\nHe said Mohammed was a chip of the old block who did not allow his disability to weigh him down.\nHe said, “Mohammed resemble Gani Fawehinmi in everything."
  },
  {
    "headline": "We Won’t Forgive, We Won’t Forget, We’ll Hunt You Down,’ Biden Tells Kabul Airport Attackers",
    "summarized_story": "Islamic State Khorasan (ISIS-K), an affiliate of militants who previously battled U.S. forces in Syria and Iraq, claimed responsibility for the attack.\nWe will hunt you down and make you pay,” Biden said in remarks at the White House.\nBiden said he had ordered U.S. military commanders to develop operational plans to strike ISIS-K assets, leadership, and facilities.\nPsaki said the United States also had “an enormous amount of leverage” – including economic leverage – over the Taliban, which are subject to U.S. and U.N. sanctions.\nThe Afghan government has also long relied on transfers of dollars from their central bank assets, many of which are held in the United States."
  },
  {
    "headline": "US Braces for More ISIS Attacks after Over 100 Killed, Including Marines and Children, in Kabul Airport Carnage – Arise News",
    "summarized_story": "Biden said he had ordered the Pentagon to plan how to strike ISIS-K, the Islamic State affiliate that claimed responsibility.\n“That part of the airport is under the direct control of U.S. forces so we weren’t there,” he told Reuters.\nA NATO country diplomat in Kabul said all foreign forces were aiming to evacuate their citizens and embassy employees by Aug. 30.\nSeveral Western countries said the mass airlift of civilians was coming to an end and announced their last troops had left.\nThe American casualties in Thursday’s attack were believed to be the most U.S. troops killed in Afghanistan in a single incident since 30 personnel died when a helicopter was shot down in 2011."
  },
  {
    "headline": "Qatar 2022: Rohr Lists Musa, Ekong, Ndidi, 27 others for Liberia, Cape Verde",
    "summarized_story": "Super Eagles’ Technical Adviser, Gernot Rohr has called up a total of 30 players for next month’s opening rounds of the FIFA World Cup Qatar 2022 qualifying campaign, in which Nigeria will host Liberia in Lagos on Friday, 3rd September (Day 1) and tackle Cape Verde in Mindelo on Tuesday, 7th September (Day 2).\nFranco-German Rohr has stuck largely with his dependables as the race to Qatar begins, with goalkeepers Maduka Okoye and Francis Uzoho, defenders William Ekong, Abdullahi Shehu, Chidozie Awaziem and Leon Balogun, midfielders Wilfred Ndidi and Oghenekaro Etebo, and forwards Ahmed Musa, Alex Iwobi, Moses Simon and Victor Osimhen on the roster.\nThere is a return for South Africa-based goalkeeper Daniel Akpeyi, defenders Kenneth Omeruo and Kevin Akpoguma and Greece-based forward Henry Onyekuru.\nFormer junior international Kingsley Michael is also called, as Innocent Bonke from Sweden joins the Nigerian camp for the first time.\nCentral African Republic is the other team in the group, and they will line up for home-and-away encounters with the Super Eagles in October."
  },
  {
    "headline": "Nigeria: Kebbi Court Restores Uche Secondus as PDP Chairman",
    "summarized_story": "Relief appears to have come the way of sacked national chairman of Nigeria’s opposition People’s Democratic Party (PDP) Uche Secondus, after a Kebbi state high court ordered his return as national chairman on Thursday.\nNusirat Umar, the presiding judge, ordered that the execution of a previous order barring Secondus from parading himself as national chairman be suspended, pending when the suit is heard and concluded.\nHe gave the ruling in a motion ex parte brought in a suit marked KB/AC/M.170/2021.\nA Rivers State High Court had on Monday issued an interim injunction restraining Secondus as a member of the party.\nThe court also restrained Secondus from parading himself as the national chairman of PDP."
  },
  {
    "headline": "Champions League: Messi’s PSG to Face Man City, Champions Chelsea Play Ronaldo’s Juventus",
    "summarized_story": "Manchester City have been drawn against Paris Saint-Germain in group stages of the 2021-22 Champions League, setting up a possible showdown between Lionel Messi and Cristiano Ronaldo.\nWhile reports suggest Man City are closing in on a deal for Ronaldo, Messi will be embarking on his first Champions League campaign away from Barcelona after joining PSG earlier this month.\nMan City beat PSG 4-1 on aggregate to reach last season’s final, which they lost to 1-0 to Chelsea at the Estadio do Dragao in Portugal.\nLiverpool will return to the Wanda Metropolitano Stadium to face Atletico Madrid in Group B, the site where the English side won the Champions League in 2019.\nGROUP A: Manchester City (England), Paris Saint-Germain (France), RB Leipzig (Germany), Club Brugge (Belgium)."
  }
]