[
  {
    "headline": "Soot: Wike declares war on cartel illegally refining oil",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has vowed not to spare anyone involved in illegal bunkering and artisanal refinery activities that have caused a soot pandemic in the state.\nAnd I can tell you with all due respect that we will take this matter very seriously.\nWike directed the Attorney-General of the state and Commissioner for Justice, Prof Zacchaeus Adangor, SAN, to take over the case files of illegal crude oil refinery operators arrested by the police.\nWike said the purpose of confronting the menace was to ensure that the health of Rivers people was not further hampered by illegal refining activities.\nThat is more important to me.”Lloyd noted that the problem of illegal refining activities in the area was beyond the capacity of the council to handle."
  },
  {
    "headline": "Oyo monarch, chiefs raise objection to terrorism charges",
    "summarized_story": "He premised his objection on the validity of the charges, insisting that the three chiefs were victims of a land dispute between Oko and Aagba communities near Ogbomoso in the Surulere Local Government Area of Oyo State.\nWhile informing the court that it was only the Attorney-General of the Federation that could handle terrorism charges, he expressed displeasure that the police coloured a communal land dispute as terrorism act, adding that the chiefs could not take plea on terrorism charges.\nFollowing the objection to the arraignment, Justice Obiora Egwuatu directed the defence counsel to put his objection in writing and serve the same on the prosecution.\nThe Inspector-General of Police had filed the terrorism charges against them through an officer in the Legal Department of the Force Headquarters, Orji Kalu.\nMeanwhile, Justice Egwuatu has February 14 to take the objection of the defendants to the charges."
  },
  {
    "headline": "Fixit45, CFAO partnership ‘ll define Nigeria after-sales market — Porte",
    "summarized_story": "“This partnership is a testament to our enduring legacy in this market.\n“We are encouraged that this partnership will afford consumers the opportunity for better services and affordable products.\n“This is the beginning of a great story that will positively define the Nigerian aftersales market,” he said.\n“We are a team of young people who are committed to delivering and facilitating quality services and automotive products to end-users.\n“In CFAO, we have found a good fit and strategic partner who can help us deliver on our key objectives."
  },
  {
    "headline": "Suzuki dedicates ‘Strongest Comeback Award’ in Nigeria to loyal customers",
    "summarized_story": "By Theodore OparaOWNERS of Suzuki cars in Nigeria will soon have the opportunity to join the Suzuki By CFAO Owners Club and earn rewards for their loyalty.\nAissatou Diouf, general manager, Suzuki By CFAO, disclosed this while reacting to the award received as the ‘Strongest Comeback Car Brand Of The Year’ given to the Japanese automobile franchisee at the last Nigeria Auto Journalists Association, NAJA, awards night held at the Eko Hotels & Suites, Victoria Island, Lagos.\nFielding questions from motoring journalists on how she felt about Suzuki being voted as the strongest comeback brand of the year, Aissatou Diouf, one of the very few female strong players in the country’s automotive industry said, “It is a great honour for the Suzuki team to have been awarded.\n“We are happy Nigerians have warmed up to our brand and it gladdens our hearts to see Suzuki cars on the road across the country.\nThe Japanese brand franchisee is also running a free service promo in January 2022 where all Suzuki owners will enjoy labour free service in any of its service centers across Nigeria."
  },
  {
    "headline": "‘Why we upgraded our alma mater’s Biology lab, donated books and more’",
    "summarized_story": "From left: Lagos Baptist Senior Secondary School Orile-Agege, set of 1979/84 chairman, Dr. Aina Odusola; Leke Mogaji; and the school principal, Mr. Sofolahun Kolawole at the commissioning of some projects to the school on Wednesday.\n“This scholarship is on merit, and will afford the students to study in any university in Nigeria,” the medical practitioner reiterated.\nReceiving the commissioned projects on behalf of the school, the principal, Lagos Baptist Senior Secondary School Orile-Agege, Mr. Sofolahun Kolawole who thanked the alumni, stated that they did not only change the face of the lab, but they equipped it with 40 modern tools, aside other donated projects.\n“We want to thank you, set of 1979/84 for these interventions, especially the scholarship awards to our students.\nWhile the commissioning was done by Leke Mogaji, motivational talks were given to the students by Dr. Bolaji Akinyemi and Mrs. Funsho."
  },
  {
    "headline": "ICT sector contributes 12.45% to Nigeria’s GDP — Danbatta",
    "summarized_story": "Shina Abubakar, OsogboChief Executive Officer, Nigerian Communication Commission, Professor Umar Garba Danbatta on Thursday disclosed that the telecommunications sector contributes 12.45 per cent to the nation’s Gross Domestic Product, GDP.\nDelivering the 10th and 11th Convocation lecture of Fountain University, Osogbo, Osun state on Thursday, titled, “Empowering the Nigerian Youth through Information and Communication Technology (ICT)”, he said the ICT sector has been contributing, consistently, 10 per cent to the nation’s GDP for a decade.\nAccording to him, Nigeria is the largest Africa’s ICT market with 82 per cent of telecommunications subscribers in the continent and 29 per cent of internet subscribers.\n“The ICT sector has been consistently contributing above 10% of Nigeria’s GDP for over 10 years, which as of 4th quarter of 2020, the telecoms sector alone contributed 12.45% to the GDP.\nHe also urged stakeholders in the sector to ensure that telecoms infrastructure challenges, such as vandalism, multiple taxation and regulations are addressed for sustainable development, especially youth empowerment using the ICT."
  },
  {
    "headline": "Resources allocated to FG, States enough to eradicate poverty, says federal revenue commissioner",
    "summarized_story": "Shina Abubakar, OsogboRevenue allocation to both federal and state governments, if diligently utilised, is enough to alleviate suffering among the nation’s teeming populace.\nThis was disclosed by a member of the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC), Mr Oladele Gboyega during a working visit to Osogbo, Osun State capital on Thursday.\nGboyega, who represents Osun State on RMAFC, said that for 2022, a year preceding general elections in 2023, the governments should executive realistic projects and programmes that will directly touch the lives of the citizenry”.\n”From our vantage position in the RMAFC, we know that ALLAH has blessed and endowed Nigeria with adequate resources to make the average Nigerian live a long, happy and prosperous life.\nHe urged tiers of government in the country to exhibit utmost dedication and sincerity in solving the economic problems of Nigerians with their various huge 2022 fiscal budgets."
  },
  {
    "headline": "Lassa Fever: APC guber aspirant, Prof Shija under fire over comment on death of Benue medical doctor, Tagher",
    "summarized_story": "The Benue State Ministry of Health and Human Services has slammed Prof. Terhemba Shija, for politicizing the death of Samuel Tagher.\nTagher, a medical doctor, died a few days ago of Lassa fever in Makurdi, the Benue State capital.\nFollowing his death, Prof. Shija, a chieftain of the All Progressives Congress, had in an entitled: ‘The Land That Devours Its Own; A Dirge For All Fallen Heroes in Benue State,’ Prof Shija, accused the Benue State University Teaching Hospital, BSUTH, Ministry of Health and the State Government of being responsible for the death of Dr Tagher.\n“In his bid to be governor of Benue State in 2023 at all costs, he decided to employ dirty political strategies to endear himself to the people.\nIn the case of Dr Tagher, we did our best for him in line with the demands on us."
  },
  {
    "headline": "NSCDC: Be diligent, rededicate to work – Osun Commandant charges corps",
    "summarized_story": "The Commandant of the Nigeria Security and Civil Defence Corps, Osun State Command, Ocheja Emmanuel, has charged his officers to rededicate themselves to duties and discharge them with due diligence.\nHe gave the charge during a meeting with the management team including the Area Commanders and Divisional Officers at the NSCDC headquarters in Osogbo, the state capital, on Thursday.\nIn a statement made available to newsmen by the Media officer of the Commandant, Atanda Olabisi Commandant Ocheja charged NSCDC officers and men in the state to ensure that they always discharge their duties with due diligence, courage and full confidence.\nHe also charged them to always be polite, civil and objective in dealing with members of the public.\nOcheja further stated that the command will be further strengthened in the area of intelligence gathering, proactive report writing amongst others."
  },
  {
    "headline": "Omicron now dominant COVID-19 variant in Nigeria – WHO",
    "summarized_story": "The World Health Organization (WHO) says Omicron is currently the dominant COVID-19 variant in Nigeria.\nThe Delta variant has been reported in 42 African nations, according to the United Nations (UN) health agency.\n“Omicron sequences in Cabo Verde, Ghana, Nigeria and Senegal are growing.\nOmicron is currently the dominant variant in both Cabo Verde and Nigeria”, it noted.\nNorth and West Africa are seeing a rise in infections; North Africa reported a 121 per cent increase in the last seven days."
  },
  {
    "headline": "Buhari pays condolence visit to late Shonekan’s family in Lagos",
    "summarized_story": "The President and his team were received by the widow of the deceased, Mrs. Margaret Shonekan, including other family members.\nGovernor Abiodun told the family that President Buhari was determined to visit, despite a day that had started at about 7 am.\n“He was in Ogun State, where he commissioned five legacy projects.\nBut due to the regard and respect he had for Chief Shonekan, he is here now.\nGovernor Sanwo-Olu said though he hailed from Ogun State, Lagos was Chief Shonekan’s resident State for over 60 years."
  },
  {
    "headline": "Police raise alarm over plot to cause chaos in Osun community",
    "summarized_story": "The Osun State Police Command, on Thursday, raised the alarm over “underground/nocturnal” plans by some residents of Igbaye to cause mayhem in respect of recent arrests made over the chieftaincy dispute in the community.\nThe police, however, urged members of the community to be tolerant and not jeopardise the peaceful environment currently being enjoyed in the State.\nThe State Commissioner of Police, Wale Olokode stated this in a statement issued by the Command’s Spokesperson, SP Yemisi Opalola, on Thursday.\nThe police boss said the intelligence that availed the command revealed underground/nocturnal plans by some residents of Igbaye to cause mayhem in respect of recent arrests made over the chieftaincy tussle in the area.\nHe, therefore, urged residents of the community to give peace a chance and advised all aggrieved members/parties to toe the path of peace by seeking redress in the court of law."
  },
  {
    "headline": "Govt plans $500m investment in technology for youths",
    "summarized_story": "To encourage creativity among youths, the Federal Government, in partnership with some international organisations, is mobilising $500 million for investment in technology and creativity.\nIt was at the 2021 National Gold Award Presentation, organised by the International Award for Young People (IAYP) at the State House in Abuja.\n- Advertisement -He said: “As part of the requirements for achieving the gold award, they undertook shared purposeful experiences with people who are not their usual companions in a residential setting.\nWe have seen how young Nigerians rallied in the wake of the COVID-19 pandemic and designed various technology solutions to support the government.\n“We’ve seen young Nigerians break new ground and earn global acclaim in innovation, in technology, in sports and the arts and entertainment."
  },
  {
    "headline": "Soludo names Ezekwesili, Chidoka, Utomi, others in transition committee",
    "summarized_story": "Soludo names Ezekwesili, Chidoka, Utomi, others in transition committeeAnambra State governor-elect, Prof Chukwuma Soludo, yesterday appointed former Minister of Education, Dr Oby Ezekwesili, as chairman of his transition committee.\nRenowned economist Prof Pat Utomi, former Minister of Aviation Osita Chidoka, former Nigerian Bar Association (NBA) President Olisa Agbakoba (SAN) and a former governorship candidate in Abia State Dr Alex Otti are among the 80 members.\nThe committee will liaise with a team set up by the state government to ensure a seamless transition from the Willie Obiano administration on March 17.\nThe members will be inaugurated during a three-day programme at the Golden Tulip (Agulu Lake) Hotel in Anambra.\nSoludo’s media aide, Joe Anatune, in a statement, said the members are expected to arrive in the state on January 19."
  },
  {
    "headline": "Fed Govt laments negative impacts of corruption on Nigeria’s image, FDIs",
    "summarized_story": "The Federal Government yesterday lamented that the exportation of corruption by some Nigerians was tainting Nigeria’s international image and depriving it of much-needed foreign investments.\nSecretary to the Government of the Federation Boss Mustapha, stated this during the inauguration of the Governing Board of Economic and Financial Crimes Commission (EFCC) in Abuja.\nMustapha challenged the EFCC to also take up the responsibility of redeeming the nation’s image by extending its activities beyond the shores of Nigeria.\nBecause it does hurt our image as a country, it has deprived us of even direct foreign investments.\nThe closest to that was in 2019 when the EFCC recorded only 1,280 convictions."
  },
  {
    "headline": "2023 president: APC, PDP weigh options on zoning",
    "summarized_story": "There has been no direction yet on where the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) will pick their candidates.\nOlogunagba said on phone: “As I speak with you, the PDP has not zoned its 2023 presidential ticket.\nTwo stalwarts from the South, Asiwaju Bola Tinubu (Southwest) and Ebonyi State Governor Dave Umahi (Southeast), have declared interest.\nAlso, Kogi State Governor Yahaya Bello (Northcentral), has thrown his hat into the ring.\nThe APC National Caretaker Committee said zoning for elective offices has never been accorded recognition by the party."
  },
  {
    "headline": "Buhari opens strategic projects in Ogun",
    "summarized_story": "The 42-kilometre Sagamu Interchange-Abeokuta Road, the 14-kilometre Ijebu-Ode-Mojoda-Epe Expressway and the Gateway City Monument were among key projects inaugurated yesterday in Ogun State by President Muhammadu Buhari.\n“This has made Ogun State one of the safest and most peaceful states in the country and investors’ destination of choice.\n“You (Prince Abiodun) have justified the mandate of the people of Ogun State.\n“I am particularly impressed by the quality and standard of your road projects, and the creative way you have deployed resources to reconstruct and rehabilitate them.\n“It is significant to note that the two road projects being commissioned today are federal roads."
  },
  {
    "headline": "Anambra: Soludo appoints ex-minister Ezekwesili as head of transition team",
    "summarized_story": "From Obinna Odogwu, AwkaAnambra State Governor-Elect Prof Chukwuma Soludo has appointed the former Minister of Education, Oby Ezekwesili, as the head of his transition team ahead of the March 17 handover.\nSoludo, a former Central Bank of Nigeria (CBN) governor, was declared the winner of the November 6, 2021 governorship election in the state.\nHe defeated the candidate of the Peoples Democratic Party (PDP), Chief Valentine Ozigbo, who came second.\nAlthough an Abuja court recently declared that the All Progressives Congress (APC) had no candidate in the poll, INEC had declared that Senator Andy Uba came third on the party’s platform.\nOther members of the transition committee were not yet known at the time of filing this report as the list has not been officially released."
  },
  {
    "headline": "2023 presidency: Pressure mounts on Osinbajo",
    "summarized_story": "The calculation, according to the source, is that religion would play a major role in who succeeds Buhari in 2023.\n“The North, particularly the North West, which has the bulk of northern votes, would not necessarily queue behind a Christian deputy and give him their votes.\nOn account of age, he’s young, and he’s a Christian.”However, a senior party official privy to the matter described the pressure on Osinbajo as “mere speculation.\nThe North, particularly the North West, would not be disposed to having a Christian representing them…”Choice of running mate100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe President is expected is to meet with “APC governors to ‘firmly agree’ on a convention date and the mode of choosing candidates for the NWC.”"
  },
  {
    "headline": "Jubilation as FG lifts Twitter suspension",
    "summarized_story": "Economic watchers say billions of naira has been lost since the ban as most Nigerians use it as a platform to run their businesses.\nThese issues bordering on national security, cohesion and the effects of the abuse of the Twitter platform forced the the Federal Government to suspend the operation of Twitter to address the direct and collateral issues around its operations in Nigeria.\n“The process of resolving this impasse between the FGN and Twitter Inc. has helped lay a foundation for a mutually beneficial future with endless possibilities.\nTwitter is a platform of choice for many Nigerians ranging from young innovators to public sector officials who find it helpful to engage their audience.\nTherefore, our engagement will help Twitter improve and develop more business models to cover a broader area in Nigeria."
  },
  {
    "headline": "Air Peace CEO gifts Super Eagles N10m for win against Egypt",
    "summarized_story": "By Chinelo ObogoChief Executive Officer of Air Peace, Allen Onyema, has gifted the Super Eagles N10 million for winning their first match against Egypt and promised a further N50 million if they lift the AFCON trophy.\nDo us proud and when you come back with the cup, I’m going to give you N50 million,” Onyema said.\nHe used the medium to harp on the uniting power of football, stressing that whenever the Eagles play, Nigerians jettison their ethnic and religious sentiments to forge a united font in support of the team.\nIt can be recalled that during the qualifying stages, the Air Peace helmsman delivered a similar unity-themed and motivational speech to the Super Eagles on board one of the airline’s brand new Embraer 195-E2 aircraft, and gave them a cheque of N20 million.\nThe Falcons of the 1999 squad were also beneficiaries of N10 million from the aviation cognoscente during the 3rd NFF-Aiteo Football Awards last year in Lagos."
  },
  {
    "headline": "National convention: Our priority is to resolve disputes, litigations -APC",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has declared that resolution of various disputes arising from its recently conducted congresses and various litigations against the ruling party remain its major priority rathan than picking a date for national convention.\n“As a focus-driven, process-oriented political party, the APC caretaker committee under the leadership of Governor Mai Mala Buni will not be distracted by self-serving antics of the sponsors of fake news.\n“The APC caretaker committee is already embarking on nationwide consultations with party stakeholders to prepare the ground for a rancour-free national convention.\n“To this end, the sub-committee on budgeting and other substructures will be set up in due course.\n“Finally, the party notes and appreciates the continued support of well-meaning members and leaders as the APC caretaker committee undertakes the immediate task of addressing contestations within the party, litigations, fallouts of recently-conducted congresses and generally reposition the party ahead of the national convention,” he said."
  },
  {
    "headline": "Anambra Governor-elect, Soludo, Appoints Ezekwesili as Head of Transition Committee",
    "summarized_story": "David-Chyddy Eleke in AwkaThe governor-elect of Anambra State, Prof. Chukwuma Soludo, has released a list of people to midwife his swearing-in as governor of Anambra State on 17 March.\nThe list, which was released to THISDAY by Soludo’s media aide, Joe Anatume, comprised 80 members with prominent Nigerians who will play diverse roles.\nThe former Minister of Education, Oby Ezekwesili, will head the committee, while Prof. Benedict Oramah, Prof. Pat Utomi and Mr Osita Chidika are members of the committee.\n“This is to announce the constitution of a Transition Committee which will liaise with a team set up by the government of Anambra State to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\n“Members are expected to arrive on Wednesday, 19th while the inauguration and first plenary sessions start on the 20th."
  },
  {
    "headline": "Buhari: Alao-Akala Served Nigeria, Oyo with Dedication",
    "summarized_story": "Alao-Akala, who was governor of Oyo State between 2007 and 2011, died at his Ogbomoso country home early yesterday at 71.\nOyo State Governor ‘Seyi Makinde, on learning of Alao-Akala’s passing, abruptly ended the 2022 Inter-faith Prayer Service organised by the state’s civil service.\nSanwo-Olu stated, “On behalf of the government and people of Lagos, I commiserate with my brother, the Oyo State Governor, Engr.\n“The passage of Otunba Alao-Akala hurts me, because of the critical role he was playing in Oyo APC before his demise.\n“APC commiserates with party members in Oyo State and diaspora, especially, all Oyo State indigenes on the sad and shocking news."
  },
  {
    "headline": "222 Days After, President Unbans Twitter",
    "summarized_story": "This comes exactly 222 days after the government suspended the Twitter in the country.\nThe NITDA DG said, Pantami in the Memo, updated and requested the president’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nThe Technical Committee engaged and worked directly with the Twitter team,” Abdulahi explained in the statement.\n“We encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Nigeria Lifts Ban on Twitter",
    "summarized_story": "Olawale AjimotokanThe federal government of Nigeria has lifted the ban on Twitter effective from 12 midnight of January 13, 2022.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nThe statement stressed that Twitter has agreed to enroll Nigeria in its Partner Support and Law Enforcement Portals, which provides a direct channel for government officials and Twitter staff to manage prohibited content that violates Twitter community rules.\n“Therefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\n“We encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Breaking: Ex-Oyo Gov, Alao-Akala, Dies at 71",
    "summarized_story": "Kemi Olaitan in IbadanFormer Governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nIt was gathered that the chieftain of the All Progressives Congress (APC) died on Wednesday.\nHowever, the cause of his death is still unknown at the time of filing this report.\nBorn on June 3, 1950, at Ogbomoso in the Ogbomoso North local government area of Oyo State, he had his elementary school at Osupa Baptist Day School, Ogbomoso before proceeding to Kamina Barracks Middle School, 5th Battalion of Infantry in Tamale, Ghana.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "How Pastor In Apostle Suleman’s Church Ordered Members To Brutalise Me, Husband – Nigerian Woman In Austria Recounts Ordeal",
    "summarized_story": "According to her, Jesse had reached out to her to support him with the payment of church rent to avoid eviction.\nIt had also been reported that Pastor Jesse promised to pay back the loan but refused after several years.\nAccording to her, anytime she requested a repayment, the pastor would start blackmailing and threatening to deal with her.\nI recently stopped, to talk to members and the pastor concerning the loans I loaned him which they used to pay the rent for the church.\nSee Also Scandal Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan“I got there with my three kids."
  },
  {
    "headline": "Ex-Lagos Governor, Tinubu Reacts To Lifting Of Twitter Ban, Says Nigerians Sometimes Misuse Platform",
    "summarized_story": "On Wednesday, the Nigerian government lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nTinubu tweeted, “Social media – indeed all media – including Twitter, are a means for us to all communicate, report, share and engage with stories and each other; to enable economic and social empowerment for Nigerians.\nSocial media - indeed all media - including Twitter, are a means for us to all communicate, report, share and engage with stories and each other; to enable economic and social empowerment for Nigerians.\n— Bola Ahmed Tinubu (@AsiwajuTinubu) January 13, 2022“I commend the FG for recognising these aspects and most importantly, concluding negotiations for the safe return of access to Twitter to the millions of Nigerians who use it, daily.\nWelcome back, one and all.”Meanwhile, Tinubu had earlier this week informed President Buhari of his intention to run for the presidency in 2023 claiming it has been his lifelong ambition to rule Nigeria."
  },
  {
    "headline": "Ex-Lagos Governor, Tinubu Reacts To Lifting Of Twitter Ban, Says Nigerians Sometimes Misuse Platform",
    "summarized_story": "On Wednesday, the Nigerian government lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nTinubu tweeted, “Social media – indeed all media – including Twitter, are a means for us to all communicate, report, share and engage with stories and each other; to enable economic and social empowerment for Nigerians.\nSocial media - indeed all media - including Twitter, are a means for us to all communicate, report, share and engage with stories and each other; to enable economic and social empowerment for Nigerians.\n— Bola Ahmed Tinubu (@AsiwajuTinubu) January 13, 2022“I commend the FG for recognising these aspects and most importantly, concluding negotiations for the safe return of access to Twitter to the millions of Nigerians who use it, daily.\nWelcome back, one and all.”Meanwhile, Tinubu had earlier this week informed President Buhari of his intention to run for the presidency in 2023 claiming it has been his lifelong ambition to rule Nigeria."
  },
  {
    "headline": "WHO recommends two new drugs for treatment of COVID-19 patients",
    "summarized_story": "The World Health Organisation (WHO) has recommended two new drugs — baricitinib and sotrovimab — for the treatment of COVID-19 patients.\nIn a statement on Thursday, the global health body said the recommendation is based on new evidence from seven trials involving over 4,000 patients with severe, non-severe, and critical COVID-19 infections.\nAccording to the WHO, baricitinib — also used to treat rheumatoid arthritis — is strongly recommended for patients with severe or critical COVID-19 in combination with corticosteroids.\nIt is not recommended to use both drugs at the same time,” the statement reads.\n“A similar recommendation has been made by WHO for another monoclonal antibody drug (casirivimab-imdevimab),” the statement added."
  },
  {
    "headline": "WHO recommends two new drugs for treatment of COVID-19 patients",
    "summarized_story": "The World Health Organisation (WHO) has recommended two new drugs — baricitinib and sotrovimab — for the treatment of COVID-19 patients.\nIn a statement on Thursday, the global health body said the recommendation is based on new evidence from seven trials involving over 4,000 patients with severe, non-severe, and critical COVID-19 infections.\nAccording to the WHO, baricitinib — also used to treat rheumatoid arthritis — is strongly recommended for patients with severe or critical COVID-19 in combination with corticosteroids.\nIt is not recommended to use both drugs at the same time,” the statement reads.\n“A similar recommendation has been made by WHO for another monoclonal antibody drug (casirivimab-imdevimab),” the statement added."
  },
  {
    "headline": "Nnamdi Kanu: We prefer political solution... others like him got amnesty, says Ohanaeze",
    "summarized_story": "George Obiozor, president-general of Ohanaeze Ndigbo, says the federal government should adopt political solution on the case of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nIn November 2021, south-east traditional and religious leaders had asked President Muhammadu Buhari to grant amnesty to Kanu to deescalate tension in the zone.\nAdvertisementAsked to respond to Buhari’s recent comment on Kanu, Obiozor, in an interview on Channels Television on Thursday, said political solution is possible since militants in the south-south and repentant Boko Haram members have been offered amnesty.\n“We in Igboland have made it categorically clear that we prefer a political solution to it — a dialogue to end it.\nI will use the words ‘political solution’ as the answer."
  },
  {
    "headline": "Nnamdi Kanu: We prefer political solution... others like him got amnesty, says Ohanaeze",
    "summarized_story": "George Obiozor, president-general of Ohanaeze Ndigbo, says the federal government should adopt political solution on the case of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nIn November 2021, south-east traditional and religious leaders had asked President Muhammadu Buhari to grant amnesty to Kanu to deescalate tension in the zone.\nAdvertisementAsked to respond to Buhari’s recent comment on Kanu, Obiozor, in an interview on Channels Television on Thursday, said political solution is possible since militants in the south-south and repentant Boko Haram members have been offered amnesty.\n“We in Igboland have made it categorically clear that we prefer a political solution to it — a dialogue to end it.\nI will use the words ‘political solution’ as the answer."
  },
  {
    "headline": "WHO: Omicron currently the dominant COVID variant in Nigeria",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron is currently the dominant COVID variant in Nigeria.\nAs of December 20, Nigeria had recorded 45 cases of the variant, according to the Nigeria Centre for Disease Control (NCDC).\nIn a statement on Thursday, the WHO said 30 African countries – and at least 142 worldwide – have detected the Omicron variant, while the Delta variant had been reported in 42 African nations.\n“In countries experiencing a surge in cases, the fast-spreading Omicron variant has become the dominant type.\nWhile it took around four weeks for the Delta variant to surpass the previously dominant Beta, Omicron outpaced Delta within two weeks in the worst-hit African countries."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "#Twitterban update: A precedent for future shutdowns?",
    "summarized_story": "We are deeply committed to Nigeria, where Twitter is used by people for commerce, cultural engagement, and civic participation.\nOrdinarily, this does not apply to social media sites because they are not under their jurisdiction.\nFar from over: Possible tales of ‘once again’While China is considered the region with the strictest Internet shutdowns, Africa is often regarded as the most volatile environment for social media.\nEthiopia, for instance, has had 12 Internet shutdowns, and as of 2020, Chad had accumulated almost two and a half years of Internet disruptions within five years.\nWhile circumventing social media censorship with VPNs appears to be the easiest way out, the issue of privacy and free speech are still cause for worry."
  },
  {
    "headline": "Crazily high valuations, investor FOMO, the ripple effects of Y Combinator’s new deal",
    "summarized_story": "Here, we look at the deal and what it means for African founders.\nAccording to the terms of the new deal, Y Combinator will invest $125,000 for 7% of a company as it has always done.\nWith more money flowing into the ecosystem, startups will find it easier to raise money at high valuations.\nFor the most part, African startups at this stage have raised little amounts of capital, usually under $2 million.\nSince it funded the first African startup in 2009, it has only funded 66 African startups."
  },
  {
    "headline": "Twitter ban lifted, cracking YC’s SAFE, SeamlessHR’s $10m funding",
    "summarized_story": "According to The Nation, the federal government of Nigeria has lifted the ban on Twitter with the approval of the President, Muhammadu Buhari.\nAccording to Abdullahi, the ban will be lifted at precisely 12 a.m., Thursday, January 13, 2022.\nI’m writing this newsletter a day before, so I can’t confirm if Twitter will work without a VPN.\nIf you’d like to go down memory lane, here are some articles that examined the effects of the Twitter ban, reactions to it and events that took place after it.\nNigeria-based HR startup, SeamlessHR, has raised a $10 million Series A led by TLcom Capital."
  },
  {
    "headline": "Soft drinks tax: Good for revenue, bad for the poor – Rewane",
    "summarized_story": "The Federal Government’s recently imposed Excise Duty on non-alcoholic drinks will have a positive impact on the country’s revenue, Bismark Rewane, CEO of Financial Derivatives Company Limited, said.\n“It however punishes the poor who are buying cheaper drinks,” Rewane said at the 2022 Economic Outlook event hosted by the Nigerian British Chamber of Commerce, Thursday.\nThe Federal Government introduced an Excise Duty of N10 per litre on all non-alcoholic, carbonated, and sweetened beverages.\nThe new policy, now referred to as ‘Sugar Tax,’ is contained in the Finance Act signed into law by President Muhammadu Buhari on December 31, 2021.\nNigeria’s rising public debt may not be the world’s highest but combined with its rising spending needs and the difficulty in raising extra tax revenue it faces a difficult fiscal policy trilemma."
  },
  {
    "headline": "Global miners Rio Tinto and Barrick Gold looking at Nigeria says Minister",
    "summarized_story": "Global miners Rio Tinto and Barrick Gold looking at Nigeria says MinisterTwo of the world’s biggest miners – Barrick Gold and Rio Tinto could be running operations in Nigeria soon as Africa’s top oil producer seeks to bring its huge minerals deposits out of the ground and onto the market.\nAccording to a Bloomberg report, the two global giants have expressed interest in Nigeria’s largely untapped mining sector.\nThe report quoted the mining minister as having confirmed the interest which could pivotal for Nigeria.\nVancouver-based Thor poured first gold from its mine in southwestern Nigeria in July last year and is targeting output of 85,000 ounces a year.\nBarrick and Rio didn’t immediately respond to emails seeking comment."
  },
  {
    "headline": "Nigeria stocks to watch in 2022",
    "summarized_story": "Notwithstanding imminent risks to equity market rally in 2022, Nigerian stocks are still attractive and should remain resilient in this year.\nThe big question now is: what stocks should investors buy in 2022?\nMeristem analysts target price (TP) for Dangote Cement is N287.81; Vetiva analysts target price for the stock is N280; while United Capital analysts target price is N270.3.\nGoing by these analysts 2022 target price for the cement maker, the stock has upside potential and should be considered a BUY.\nVetiva also rated the stock a BUY with 2022 target price at N796.57."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Osun 2022: PDP Screens Dele Adeleke, 5 others for Osun Governorship Election",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Peoples Democratic Party (PDP) governorship screening committee for Osun state headed by former Attorney General of the Federation and Minister for Justice, Mohammed Adoke on Wednesday screened all the six governorship aspirants that purchased the nomination forms.\nSix of them turned in for the screening and we screened all of them and we are satisfied with the answers they gave us.\n“We ensured that the process was transparent, we ensured that they were given fair hearing and we ensured that we executed the mandate given to us by the party.\n“In fact the national convention screening committee has been made standing committee for the party.\nAlso, another aspirant, Alhaji Abdulateef Akinbade, expressed optimism that he would not be disqualified following the way the screening committee conducted the exercise."
  },
  {
    "headline": "Emmanuel Difom named Guinness Nigeria’s Finance and Strategy Director",
    "summarized_story": "Adebayo ObajemuGuinness Nigeria has appointed Emmanuel Difom as Finance and Strategy DirectorThe brewery giant has given notice to the investing public that the Board of Directors of the Company at its meeting held on 26th October 2021, gave approval to the appointment of Mr. Emmanuel Difom as the Finance and Strategy Director of the Company with effect from 1 st November 2021.\nMr. Difom has fifteen years of experience at top level.\nHe is a an achiever with strong experience in Business Strategy, Finance, and Tax management supported by a solid background in FMCG, Oil and gas and Banking sectors.\nThe Board of Directors is assured that Mr. Difom brings the right skillset to the Board with his level of experience and understanding of the Diageo landscape.\nIn addition to this, the wide experience of Mr. Difom in British American Tobacco (BAT), his knowledge of the business terrain in Nigeria and his good track record were very high points contributing to the Board’s confidence in his appointment as the Finance and Strategy Director."
  },
  {
    "headline": "Nigerian govt lifts Twitter ban after 222 days",
    "summarized_story": "The government of President Muhammadu Buhari has announced lifting of a ban it imposed on Twitter in Nigeria since June 2021.\nThe regime initially insisted that the social media giant must register as a business and open an office in Nigeria, a demand that was rejected by Twitter.\nHowever, Mr Abdullahi who announced the decision said the president only acted on a recommendation to lift the suspension.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\n“In the Memo, the Minister updated and requested the President’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.”"
  },
  {
    "headline": "Sterling Bank Powers Art with Imperium",
    "summarized_story": "Sterling Bank Plc has partnered with the Nike Art Gallery to install solar panels at the gallery via the bank’s Imperium outlet as part of its commitment to a renewable energy powered Nigeria as well as the development of the nation’s tourism sector.\nThis follows recent partnerships with the gallery to drive an appreciation as well as the investment opportunities available in the arts and tourism sectors in Nigeria.\nThe renewable energy sector is one of the five sectors of the economy that the bank is presently concentrating investments in.\nShina Atilola, Divisional Head for Retail and Consumer Banking at Sterling Bank added that the bank attempts to enrich lives and unlock new opportunities in Nigeria’s tourism sector through partnerships with key tourism industry players as well as other sectors where investments are being focused under its HEART’s of Sterling programme.\nHe further urged interested prospects to equally approach officers of the bank for discussions on other products of the bank or visit www.imperiumng.com."
  },
  {
    "headline": "Banditry: We Need Tucano Fighter Jets In Zamfara – Matawalle",
    "summarized_story": "Governor Bello Mohammed of Zamfara State has called for more concerted efforts in fighting banditry to ensure speedy elimination of the menace in the entire North West region and beyond.\nTo hasten the success of the ongoing operations in the state, Governor Matawalle called on the federal government to deploy more interventions in the state including more Armoured Personnel Carriers (APCs) and specifically, the Super Tucano fighter jets in the state.\nThese blackspots are Gando, in Bukkuyum local government area, Munhaye of Tsafe local government area, Bayan Ruwa, in Maradun local government area, Kabaro- Sangeku, of Dansadau and Magami axis.\nADVERTISEMENT“The security challenge in Zamfara State and other states in the North West is unprecedented.\nGovernor Matawalle added."
  },
  {
    "headline": "ISWAP Attacks On The Rise, Governor Zulum Cries Out",
    "summarized_story": "Borno State Governor Babagana Zulum yesterday raised fresh concerns over the increasing activities of the Islamic State of West Africa (ISWAP) terrorists in the core and northern parts of the state.\nADVERTISEMENTZulum said, “ISWAP terrorists are having checkpoints between Damboa and Biu local government areas, collecting taxes from the communities.\nFew days ago, I got security report that ISWAP terrorists are holding a marriage ceremony in one of the communities with the presence of over 300 motorcycles.\nHe, however, called on the troops to check the activities of terrorists in the Borno State and North East region.\n“The breakdown further shows that 61.8 percent of the yearly abduction figures affected the North West region, 21.6 percent in the North Central and 5.5 percent in the North East."
  },
  {
    "headline": "7 Months After, Federal Govt Lifts Ban On Twitter Operations",
    "summarized_story": "The federal government has lifted the suspension slammed on US micro-blogging organisation, Twitter, in Nigeria following a directive from President Muhammadu Buhari to end the ban effective from today.\nLEADERSHIP recalls that the federal government suspended Twitter operations in Nigeria after it pulled down a statement by President Buhari which it considered offensive.\n“Twitter has also agreed to comply with applicable tax obligations on its operations under Nigerian law.\n“Therefore, the federal government lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January, 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "7 Months After, Federal Govt Lifts Ban On Twitter Operations",
    "summarized_story": "The federal government has lifted the suspension slammed on US micro-blogging organisation, Twitter, in Nigeria following a directive from President Muhammadu Buhari to end the ban effective from today.\nLEADERSHIP recalls that the federal government suspended Twitter operations in Nigeria after it pulled down a statement by President Buhari which it considered offensive.\n“Twitter has also agreed to comply with applicable tax obligations on its operations under Nigerian law.\n“Therefore, the federal government lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January, 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Tinubu/Umahi: Other Aspirants Play Down Pressure To Declare Publicly",
    "summarized_story": "The former Lagos State governor who just declared has clearly done his consultations.\nADVERTISEMENTHe said Uzodimma was against him because of his presidential ambition.\nThat actually is not the way a man of Dr. Saraki’s calibre will declare presidential ambition.\nWhen it is time to formally declare his ambition, everybody in the country will know”.\nMeanwhile, former deputy governor of the Central Bank of Nigeria (CBN), Prof Kingsley Moghalu, was the first to openly declare his presidential ambition."
  },
  {
    "headline": "Stanbic IBTC Capital Shines at AIHN 2021 Investment Banking Awards",
    "summarized_story": "By KEN EMORDIStanbic IBTC Capital, a subsidiary of Stanbic IBTC Holdings PLC, has emerged winner in five out of ten award categories at the Association of Issuing Houses of Nigeria’s (AIHN) 2021 Investment Banking Awards ceremony, which held on Tuesday, 24 November 2021.\nStanbic IBTC Capital’s outstanding capabilities were recognised in the following award categories: Best Investment Bank in Nigeria, Best Bond House in Nigeria, Best Commercial Paper House in Nigeria, Best Mergers and Acquisitions House in Nigeria and Best Corporate Bond Deal in Nigeria.\nFunso Akere, Chief Executive, Stanbic IBTC Capital, expressed his excitement at the recognition, stating that the awards affirm that the institution’s hard work and dedication have not gone unnoticed.\nWhile commending the AIHN, Funso also extended his appreciation to clients for their trust in Stanbic IBTC Capital to deliver excellently and reassured them of the continued delivery of quality services.\nIt can be recalled that during the 2020 edition of the awards, Stanbic IBTC Capital clinched several awards including Best Merger and Acquisition House, Best Merger and Acquisition Deal, Best Commercial Paper House and Best Investment Bank."
  },
  {
    "headline": "Stanbic IBTC Capital Shines at AIHN 2021 Investment Banking Awards",
    "summarized_story": "By KEN EMORDIStanbic IBTC Capital, a subsidiary of Stanbic IBTC Holdings PLC, has emerged winner in five out of ten award categories at the Association of Issuing Houses of Nigeria’s (AIHN) 2021 Investment Banking Awards ceremony, which held on Tuesday, 24 November 2021.\nStanbic IBTC Capital’s outstanding capabilities were recognised in the following award categories: Best Investment Bank in Nigeria, Best Bond House in Nigeria, Best Commercial Paper House in Nigeria, Best Mergers and Acquisitions House in Nigeria and Best Corporate Bond Deal in Nigeria.\nFunso Akere, Chief Executive, Stanbic IBTC Capital, expressed his excitement at the recognition, stating that the awards affirm that the institution’s hard work and dedication have not gone unnoticed.\nWhile commending the AIHN, Funso also extended his appreciation to clients for their trust in Stanbic IBTC Capital to deliver excellently and reassured them of the continued delivery of quality services.\nIt can be recalled that during the 2020 edition of the awards, Stanbic IBTC Capital clinched several awards including Best Merger and Acquisition House, Best Merger and Acquisition Deal, Best Commercial Paper House and Best Investment Bank."
  },
  {
    "headline": "Buhari in Lagos, condoles with the Shonekans",
    "summarized_story": "By CHIKA CHIMEZIEPresident Muhammadu Buhari Thursday evening condoled with the family of the late Head of the Interim National Government (ING), Chief Ernest Shonekan, at their Ikoyi, Lagos, home.\nPresident Buhari was accompanied to the Shonekans’ home by Ogun State Governor, Prince Dapo Abiodun, Lagos State Governor, Babajide Sanwo-Olu, and Yobe State Governor, Mai Mala Buni, who is also Chairman, Caretaker and Convention Planning Committee, All Progressives Congress.\n“He was in Ogun State, where he commissioned five legacy projects.\nBut due to the regard and respect he had for Chief Shonekan, he is here now.\nGovernor Sanwo-Olu said though he hailed from Ogun State, Lagos was Chief Shonekan’s resident State for over 60 years."
  },
  {
    "headline": "Buhari in Lagos, condoles with the Shonekans",
    "summarized_story": "By CHIKA CHIMEZIEPresident Muhammadu Buhari Thursday evening condoled with the family of the late Head of the Interim National Government (ING), Chief Ernest Shonekan, at their Ikoyi, Lagos, home.\nPresident Buhari was accompanied to the Shonekans’ home by Ogun State Governor, Prince Dapo Abiodun, Lagos State Governor, Babajide Sanwo-Olu, and Yobe State Governor, Mai Mala Buni, who is also Chairman, Caretaker and Convention Planning Committee, All Progressives Congress.\n“He was in Ogun State, where he commissioned five legacy projects.\nBut due to the regard and respect he had for Chief Shonekan, he is here now.\nGovernor Sanwo-Olu said though he hailed from Ogun State, Lagos was Chief Shonekan’s resident State for over 60 years."
  },
  {
    "headline": "Fake Army General Oluwasegun busted in Lagos: Shocking Photos",
    "summarized_story": "A fake army general Bolarinwa Oluwasegun, has been busted in the Lagos suburb of Alagbado, by operatives of the EFCC.\nThe fake posturing of the military impostor ended, when he made a false representation about his military status to secure a loan of N270m from Kodef Clearing Resources.\nOluwasegun, in his bid to defraud the victim, also allegedly forged several documents and the signature of the President.\nHe was arrested at his house in the Alagbado area of Lagos State on Wednesday, January 12, 2022.\nUpon his arrest, six pump action guns, three cartridge bullets, a swagger stick and several forged documents were recovered from him."
  },
  {
    "headline": "Zamfara attacks: Tinubu donates N50m to victims",
    "summarized_story": "By Shuaib SadiqThe National leader of the All Progressives Congress (APC) and former Lagos State governor, Sen. Bola Tinubu, on Thursday, announced a donation of N50 million to Zamfara communities recently attacked by bandits.\nThe APC national leader called for sustained prayers to overcome the insecurity situation in the state.\n“We believe in President Muhammadu Buhari’s ability to restore law and order and bring back our country to stability and tracks of development,” Tinubu said.\nBello Matawalle, who received the APC leader, said that his visit would further console the bereaved communities and the entire people of the state.\nHe thanked the APC leader for taking time out to visit and commiserate with the government and people of the state."
  },
  {
    "headline": "JUST IN: Arewa Leaders Summon Governors, Others To Meeting Over Issues Affecting The North",
    "summarized_story": "JUST IN: Arewa Leaders Summon Governors, Others To Meeting Over Issues Affecting The NorthNorthern Leaders of Thought, a group of distinguished Nigerians from the north, has called a “general meeting” for Saturday to discuss the status of events in the region.\nAccording to Vanguard, the summit, which is neither party nor religious, would also look into the North’s relationship with the rest of the country.\nThe conference, according to the Northern Leaders of Thought (NLT), would take place on January 15, the 56th anniversary of Nigeria’s first military coup, which claimed the lives of many leading politicians and army officers, particularly from the north.\nThe invitation is entitled, ‘Meeting of Northern Leaders of Thought, 15th January, 2022, at Arewa House, Kaduna.”It reads in part, “The Meeting will be a rare platform to examine the state of the North and its relationship with the rest of Nigeria.\nThe Arewa House accommodates the official residence of the late Sardauna of Sokoto.”Meanwhile, the Northern Leaders of Thought said that a communique reflecting the key decisions taken at the meeting will be released after the parley."
  },
  {
    "headline": "2023 Presidential Aspirant, Tinubu Reacts To Suspension Of Twitter Ban",
    "summarized_story": "Following President Muhammadu Buhari’s consent, the Nigerian government lifted the suspension of Twitter activities in the country on Wednesday.\n“Social media – indeed all media, including Twitter – is a tool for us all to communicate, report, share, and connect with stories and each other; to facilitate economic and social empowerment for Nigerians,” Tinubu tweeted.\nTinubu tweeted, “Social media – indeed all media – including Twitter, are a means for us to all communicate, report, share and engage with stories and each other; to enable economic and social empowerment for Nigerians.\n“I commend the FG for recognising these aspects and most importantly, concluding negotiations for the safe return of access to Twitter to the millions of Nigerians who use it, daily.\nWelcome back, one and all.”Meanwhile, Tinubu had earlier this week informed President Buhari of his intention to run for the presidency in 2023 claiming it has been his lifelong ambition to rule Nigeria."
  },
  {
    "headline": "BREAKING: Security Forces Rescue Three Abducted Ladies In Plateau",
    "summarized_story": "Three ladies bandits kidnapped on Wednesday night in Ban, Barkin Ladi local government area of Plateau have been rescued by police and military operatives.\nThe three girls were kidnapped at 8:15 p.m., according to The Nation.\nThe three girls have regained their freedom, according to military and police officials.\nMilitary Information Officer of The Task Force, Major Ishaku Takwa, in a statement said: “The three kidnapped victims have just been rescued by troops of Operation SAFE HAVEN deployed at Barikin Ladi.\nThe spokesman of Plateau Police Command, ASP Gabriel Ubah, said: “The team of Police and STF deployed to rescue the victims kidnapped yesterday at Ban Village behind the Plateau State Polytechnic have rescued them today 13/1/2022 at about 1430hrs unhurt and are presently with the Police."
  },
  {
    "headline": "BREAKING: President Buhari Pays Family Of Late Shonekan A Visit In Abeokuta",
    "summarized_story": "President Muhammadu Buhari has arrived at the residence of Ernest Shonekan, the late Head of the Interim National Government, who died on Tuesday at the age of 85.\nBuhari, who was in Ogun State on Thursday to launch state government projects, took time out of his itinerary to pay a visit to the late elder statesman’s family in Abeokuta, the state capital, and sympathize with his people.\nHe sympathised with the family over the demise of the former Head of the Interim National Government, who died in Lagos on Tuesday at the age of 85.\nShortly after Shonekan’s death, President Buhari ordered that the Nigerian flag be flown at half mast in his honor.\nShonekan was at the helm of affairs in Nigeria between August 26 and November 17, 1993 after General Babangida stepped aside as military president."
  },
  {
    "headline": "2023 Presidency: Osinbajo, Tinubu’s supporters differ, N/central lawmakers back Bello",
    "summarized_story": "“In 2017, Osinbajo as Acting President signed Executive Order 001: Promotion of Efficiency and Transparency in Business Environments.\nThe legislators also endorsed Kogi state Governor Bello for the 2023 presidency as the only one that had so far demonstrated intention to vie for the nation’s top seat in 2023.\nThey spoke with one voice at the end of a one-day extraordinary meeting of the APC state legislature from the six states of the North Central Zone, held in Abuja Thursday.\n“After due consultations with my family, friends and some stakeholders, I have arrived at the decision to contest the 2023 Presidential election on the platform of our great party, PDP.\n“To be able to discharge the function of office as a president or governor, you need to have a healthy body."
  },
  {
    "headline": "FG: Corruption hurting nation’s image, hindering foreign investments",
    "summarized_story": "Secretary to the Government of the Federation (SGF) Boss Mustapha has inaugurated the 23-member governing board of the Economic and Financial Crimes Commission (EFCC), with a charge to members to put in their best to combat the hydra-headed monster called corruption.\nHe also said financial crimes were hurting the country’s image globally and robbing it of foreign direct investments.\nBecause it does hurt our image as a country, it has deprived us of even direct foreign investment.\nMustapha said: “You are, however, required to put in your best to combat financial and economic crimes in the country.\nBut the EFCC has managed to set a new record in terms of recoveries as well as, you know, convictions."
  },
  {
    "headline": "Breaking: Buhari in Ogun, to commission roads, housing projects",
    "summarized_story": "President Muhammadu Buhari has arrived in Ogun etate on a one day working visit to the state.\nThe President, who arrived the Gateway City Gate Monument, Sagamu Interchange, Sagamu at about 11:35am dressed in Agbada was welcome by governors of Osun, Ondo, Yobe and Ekiti states.\nPresident Buhari is in the state to commission some landmark projects embarked upon by the administration of Governor Dapo Abiodun.\nSome of the projects scheduled for commission includes, Ijebu-Ode/Mojoda/Epe 14km expressway, the Gateway City Gate at Sagamu-Interchange as well as the reconstructed 42km Sagamu-Abeokuta dual carriage road now renamed President Muhammadu Buhari Expressway.\nPresident Buhari will also commission the Workers Estate constructed by the present administration at Kobape."
  },
  {
    "headline": "Ebonyi State Will Never Be Part Of Biafra, Says Dave Umahi",
    "summarized_story": "﻿Governor Dave Umahi of Ebonyi State has said that his state will not take part in the struggle for the actualization of Biafra.\n“First and foremost, I have been saying it, if anybody tells you about Biafra, tell them Ebonyi State will never be part of Biafra.\nHe argued that Igbos have investment everywhere across the country, saying it would be impossible to think of secession when in power.\nAccording to the governor, Ebonyi State is better in a fair and equitable Nigeria because the state has investments everywhere and one cannot set fire to his own house.\n“What we did in Ebonyi State, we can replicate in Nigeria."
  },
  {
    "headline": "Troops Rescue Abducted Polytechnic Students At ‘Abandoned Poultry Farm’",
    "summarized_story": "Three Plateau State Polytechnic students abducted on Wednesday have been rescued unhurt by troops of Operation Safe Haven.\nThe students were kidnapped by gunmen at Barkin Ladi Local Government Area of the state.\nREAD ALSO: FG Lifts Twitter Suspension After Seven MonthsThe search, the military spokesman said, led to the rescue of the abducted students at an abandoned poultry farm.\nThe rescued students have since been reunited with their families while a manhunt is ongoing to apprehend the gunmen behind the kidnapping, the military said.\nChannels Television had earlier reported that the students, two females and one male, were abducted from one of the private hostels known as the ‘Plateau Embassy’ in the polytechnic."
  },
  {
    "headline": "Tinubu Donates N50m To Victims Of Gusau Attack",
    "summarized_story": "Former Governor of Lagos State and Chieftain of the All Progressives Congress (APC), Bola Tinubu, has donated the sum of N50million to families of victims of the recent killings in two Local Government Areas of Zamfara State.\nTinubu made the donation on Thursday when he paid a visit to the state.\nAt least, 58 people were reported killed last week when bandits raided some villages in Bukkuyum and Anka Local Government Areas of the state.\nREAD ALSO: Zamfara Killings: APC Governors Visit MatawalleOthers included the Minister of Police Affairs, Mohammed Dingyadi; the National Security Adviser, Babagana Monguno and the Inspector General of Police, Usman Alkali Baba.\nGovernor Bagudu said despite some positives by the federal and state governments, massive cooperation is vital to combat the threat."
  },
  {
    "headline": "Buhari Inaugurates Five Projects In Ogun, Promises More Infrastructure",
    "summarized_story": "‘‘This has made Ogun State one of the safest and most peaceful States in the country and investors’ destination of choice.\n‘‘You (Prince Abiodun) have justified the mandate of the people of Ogun State.\n‘‘It is significant to note that the two road projects being commissioned today are federal roads.\nIt depicts that something new is happening in Ogun State, a welcoming entrance into the State Capital at the centre point of the State.’’He added that the project is also an ICON depicting the joining of hands for building the future of Ogun State in togetherness.\n“I will leave Ogun State with fond memories and look forward to enjoying the privilege of my honourary indigeneship.”"
  },
  {
    "headline": "Toothless Liverpool Held By 10-Man Arsenal In League Cup Semi",
    "summarized_story": "Arsenal held out for over an hour a man down to leave their League Cup semi-final with Liverpool delicately poised after the first leg ended 0-0 at Anfield on Thursday.\nHowever, Liverpool badly missed the firepower of Mohamed Salah and Sadio Mane as they laboured to even create chances against the 10 men.\nHowever, Liverpool otherwise had a clean bill of health and Jurgen Klopp named the strongest side available to him.\nBut he will miss Sunday’s north London derby against Tottenham and the second leg next Thursday after being sent off for the second time this season.\nArteta responded by sacrificing Eddie Nketiah for an extra centre-back in Rob Holding and the visitors’ back five held up well despite Liverpool dominating possession."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Tinubu visits Zamfara, commiserates Gov Matawalle over killings -",
    "summarized_story": "Former Lagos state Governor and National leader of the All Progressive Congress, Asiwaju Bola Ahmed Tinubu has arrived Zamfara State Government House Gusau.\nThe APC National leader is in Gusau to Commiserate With Governor Bello Matawalle and the people of the state over the recent killings in Anka and Bukuyyum Local Government Areas.\nMr. Tinubu and his entourage were recieved by Zamfara State Governor Bello Matawalle and other top government functionariesHe is currently in a closed door meeting with Governor Bello Matawalle."
  },
  {
    "headline": "Stop playing politics with security, religion, Marafa's APC faction tells Gov. Matawalle -",
    "summarized_story": "The Senator Kabiru Marafa’s faction of the All Progressive Congress in Zamfara state has called on the state government to stop playing politics with Security and religion for the overall interest of the state and the nation at largeThe APC said attaching insecurity and religion for political gain will do the state more harm than goodA statement signed by the spokesperson of the Mafara’s Faction of the APC Bello Bakyasuwa Maradun said, recent happening in Zamfara where the war of words between the state government and the main opposition party the PDP is unnecessary and a development that need to be put under control before it gets out of hand“In Recent times, every week comes with one controversy or the other from the state government accusing leading opposition political figures with a campaign of calumny shrouded in religion and insecurity” Bakyaswa Said.\nThe Marafa’s faction also distance self from a publication that a suspect was arrested while wearing a jersey with the picture of Senator Kabiru Marafa on it during a military strike against banditsThey described the news as a cheap blackmailThe APC Faction also frown at an accusations leveled against Muttaka Rini and Dauda Lawal Dare who are Members of the Ex- Governor Yari’s factionThe Marafa’s faction of the APC says the move to raise public awareness on some of the matters arising in Zamfara is not to Condemn the Government of Governor Bello Matawalle but to join in fixing things right.\n“Our intention is for good so that our collective energy can be invested in building our dear state”“We are also Committed to joining in fighting the common enemy of insecurity caused by banditry and helping hundreds of thousands of Internally Displaced Persons in the state” Bakyaswa assures."
  },
  {
    "headline": "Queen Removes Prince Andrew’s Military Roles and Patronages Over Sexual Abuse Accusations",
    "summarized_story": "Britain’s Prince Andrew has renounced his military affiliations and royal patronages, Buckingham Palace said on Thursday.\nThe move comes after Andrew’s lawyers failed to persuade a U.S. judge to dismiss a civil lawsuit against him that accuses him of sexual abuse.\n“With The Queen’s approval and agreement, The Duke of York’s military affiliations and Royal patronages have been returned to The Queen,” Buckingham Palace said in a statement.\nHe stressed that he wasn’t ruling on the truth of the allegations.\nAndrew’s lawyers have said that the royal never sexually abused or assaulted Giuffre and that he “unequivocally denies Giuffre’s false allegations against him.”Palace officials have declined to comment on the “ongoing legal matter.”"
  },
  {
    "headline": "Nigerians React To Buhari Lifting Twitter Suspension – Trending with Ojy Okpe",
    "summarized_story": "The federal government’s decision to lift the ban on microblogging platform Twitter has generated mixed reactions on social media among many Nigerians.\nIn a statement released on Wednesday, President Muhammadu Buhari approved the lifting of the suspension after Twitter reportedly agreed to meet all conditions set by the federal government.\nThose conditions include managing prohibited publication in line with Nigerian law and addressing issues of operations and tax.\nMeanwhile, the Yobe State Government is urging parents and guardians in the state to allow their daughters join the Nigerian Army.\nFoanally a video showing some men attempting to put out a fire engulfing a train has gone viral."
  },
  {
    "headline": "‘I Am Most Qualified to Be the Next President’, Says Orji Uzor Kalu",
    "summarized_story": "Senate Chief Whip and former Abia State Governor, Orji Uzor Kalu, joins the ranks of presidential hopefuls as he indicates his intention to contest in the 2023 presidential election.\nHe tells us about his bid the top job, his chances of clinching the ticket of the APC; his fixation with Tinubu’s presidential ambition, and the quest for a Nigerian president of Southeast origin."
  },
  {
    "headline": "‘APC Caretaker Committee Will Deliver All Promises’, Says Prof Ussiju Medaner",
    "summarized_story": "Prof Ussiju Medaner, Director of Organisation of the APC and Member of the party’s Caretaker/Extraordinary Convention Planning Committee provides clarity on the apparent tussle for the control of the ruling APC and plans for the party’s national convention."
  },
  {
    "headline": "Senior Tories Urge Boris Johnson to Quit After Party Apology",
    "summarized_story": "Boris Johnson is facing calls from senior Tories to resign after he admitted attending a drinks party during lockdown.\nCabinet members including deputy PM Dominic Raab rallied round Mr Johnson.\nHe said he would write to the 1922 Committee, which organises Conservative leadership contests, to register his lack of confidence in the prime minister.\n27 November 2020A leaving event was held for No 10 aide, Cleo Watson, where people were drinking, and Mr Johnson made a speech, according to sources.\n18 December 2020Downing Street originally denied a report by the Daily Mirror that a party took place in Downing Street."
  }
]