[
  {
    "headline": "Don’t exceed 100km/h on Nigerian road, Fashola urges motorists",
    "summarized_story": "Minister of Works and Housing, Dr Raji Fashola, has urged motorists nationwide to keep speed limits below 100km/h on Nigerian roads.\nThis is as he said the emergence of new roads across the nation has raised drivers’ propensity to speed excessively.\nFashola disclosed this to State House Correspondents on Thursday during a Special Weekly Briefing coordinated by the Presidential Communications Team at the Aso Rock Villa, Abuja.\nHe also decried the sale of Premium Motor Spirit and other petroleum products, saying they deteriorate the roads faster.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Super Eagles arrive in Ghana for World Cup playoff",
    "summarized_story": "The Super Eagles of Nigeria have arrived in Ghana ahead of their World Cup play-off first leg encounter on Friday.\nThe Nigeria contingent departed from the Nnamdi Azikiwe International Airport, Abuja aboard a chartered Air Peace aircraft on Thursday morning.\nThe winner over two legs will earn one of Africa’s five tickets to the 22nd FIFA World Cup finals, scheduled for November 14 to December 18 this year in Qatar.\nIt is a FIFA World Cup ticket at stake, so we must give it our all.\nNigerians don’t want to hear any story; they only want to see the World Cup ticket.”Copyright PUNCH."
  },
  {
    "headline": "Destabilisation plot: Leave DGSS alone; tell your govs to perform — SNM tells Middle Belt youths Forum",
    "summarized_story": "While pleading with the Middlebelt youths to leave the DGSS out of their frustration, SNM, asked the youth forum to allow the DSS to do their job without undue interference in the interest of the nation and its citizens.\nAlso Read:.PDP screens 43 governorship aspirants in South-East – Vice chairmanThe SNM Convener said: “Calling for the sack of the Director of the DSS is shameful.\nInstead of demanding his sack, it is better to address the issues raised by the revelations in the DSS report.\n“The federal government cannot use the DSS to witch-hunt any governor as was alleged in that pointless press statement.\n“May Nigeria succeed and may criminal elements fail ten times,” Save Nigeria Movement concludedVanguard News Nigeria"
  },
  {
    "headline": "2023: A’Ibom NASS caucus adopts; endorse Umo Eno",
    "summarized_story": "Dirisu Yakubu, AbujaThe Akwa Ibom State Caucus in the National Assembly, on Wednesday, adopted and endorsed Pastor Umo Eno as their sole candidate for the May 21, 2023, PDP Governorship primaries and the 2023 Governorship election.\nIn Akwa Ibom State, agriculture will serve as the low hanging fruits that will create quick impact which must be explored”.\nWith your support we will make Akwa Ibom State better”, he assured.\nAddressing the gathering, the DG, Umo Eno Campaign Organisation, Amb.\nAkwa Ibom caucus has done well and would have done more if the country had a PDP government at the centre”, he noted."
  },
  {
    "headline": "2023: Nigerians are tired of APC, PDP misrule, says Olayinka",
    "summarized_story": "By Luminous JannamikeAhead of the 2023, general election, the newly elected Chairman of the New Nigeria People’s Party in Ekiti State Hon.\nOlayinka Dada has issued quit notices to the All Progressives Congress and the People’s Democratic Party, saying Nigerians are tired of their misrule.\nDada described the exercise as smooth, timely and reflective of the desire of Nigerians to reject the two political parties, and chart a new direction.\nHe charged officers of the party elected at Ward, Local Government and State levels to work hard in unseating the political parties he described as predators, the people’s woes- APC and PDP.\nOnly our party, the NNPP can guarantee that hope and that begins with your election as officers of our great party."
  },
  {
    "headline": "Edo govt strengthening response to human trafficking, illegal migration —Obaseki",
    "summarized_story": "Governor Godwin ObasekiBy Gabriel EnogholaseGovernor Godwin Obaseki of Edo State has said his administration was strengthening the state’s response to human trafficking and illegal migration.\nHe spoke, Wednesday, in Benin City, when he received the Italian Ambassador to Nigeria, Stefano De Leo, in his office.\nThis emphasizes the special relationship that Edo State, as a sub-national, and the Italian government enjoys.\nIn the past five years, we have been working with the Italian authorities and have been able to significantly limit and reduce the incidents of irregular migration and human trafficking in Edo.\nThe conversation has started on the new structure for our response to migration; we call it migration 2.0."
  },
  {
    "headline": "2023: Ugwuanyi won’t tinker with zoning arrangement in Enugu — Aide",
    "summarized_story": "By Luminous JannamikeThe Enugu state government has assured that Governor Ifeanyi Ugwuanyi will not tinker with the zoning arrangement in the state, saying those opposed to it merely seek to heat up the polity.\nHe, therefore, said the Governor would not do anything to halt the power-sharing arrangement at this phase of Enugu’s democratic history, stressing that zoning was the making of the founding fathers of the state.\nAccording to him, Governor Ugwuanyi is rather preoccupied with serving the people who give him their mandate, and so will not be distracted from his assignment by overzealous politicians.\n“It is possible that some people want to destabilize the government in Enugu State, but as you can see our peace-loving governor has maintained his focus.\nThe governor’s aide maintained that Governor Ugwuanyi would continue to pursue his inclusive and ecumenist style of leadership, stressing that the approach has endeared him to many people both in Enugu and Nigeria as a whole."
  },
  {
    "headline": "War: We’ll ensure Putin fails in Ukraine – UK imposes more sanctions against Russia",
    "summarized_story": "The United Kingdom’s Foreign Secretary, Liz Truss, has said that the government will ensure that Russian President, Vladimir Putin fails in the ongoing war in Ukraine.\nThe Russian-installed Mayor of Melitopol was also sanctioned.\n“These oligarchs, businesses and hired thugs are complicit in the murder of innocent civilians and it is right that they pay the price.\nPutin should be under no illusions — we are united with our allies and will keep tightening the screw on the Russian economy to help ensure he fails in Ukraine.\nThere will be no let-up,” Truss said."
  },
  {
    "headline": "Illegal refineries: Things can get worse – Dikio warns",
    "summarized_story": "The Interim Administrator of the Presidential Amnesty Programme, Col. Millard Dikio (rtd), has warned that things would only get worse if the Federal Government does not do more to wage a war against the activities of informal operators of modular refineries in the Niger-Delta region.\nDikio pointed out that the domestic refining of crude oil by artisans in host communities had grave health and environmental implications for the country.\nDikio also encouraged all stakeholders to set aside their differences and support efforts to save not only the environment but also the country’s economy.\nAccording to him, “things can get worse” if urgent and systematic steps were not taken to fight the effects of informal crude oil refining.\n“There are problems with artisanal refining,” he explained, noting that these activities of illegal crude refiners have serious health and environmental implications."
  },
  {
    "headline": "Alleged bribe: Absence of witness stalls Shehu Sani’s trial",
    "summarized_story": "The trial of former Senator Shehu Sani was on Thursday stalled in a Federal High Court, Abuja due to the absence of a Prosecution Witness (PW12) who was slated to give evidence.\n“I am not ready for a stand down, so I will give you a fresh date which will be the last adjournment for the prosecution,” the judge said.\nThe judge adjourned the matter until June 22 and June 23 for the prosecution to call its 12th witness.\nThe former senator was earlier arraigned by the Economic and Financial Crimes Commission (EFCC) for alleged bribery, name-dropping and influence peddling.\nThe anti-graft agency alleged that Sani fraudulently obtained $25,000 from the Chairman of ASD Group of Companies, Alhaji Sani Dauda."
  },
  {
    "headline": "Ukraine war: Russia captures Izyum town",
    "summarized_story": "Russian Defence Ministry spokesman, Igor Konashenkov, has claimed that the country’s armed forces have taken full control of the city of Izyum in the Kharkiv region of eastern Ukraine.\n“The Russian armed forces continue to carry out the missions of a special military operation.\nBy the morning of 24 March, units of the Russian army had taken full control of the town of Izyum in the Kharkiv region,” Konashenkov said.\nIzyum is a regional centre in the Kharkiv region with a population of about 50,000 people and an important railway junction.\nThe war between Russia and Ukraine began last month and many causalities have already been recorded."
  },
  {
    "headline": "Malami’s absence in court stalls NBA’s suit against him",
    "summarized_story": "The absence of the Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami (SAN) at the Federal High Court on Thursday in Abuja stalled hearing in a suit instituted against his office by the Nigerian Bar Association (NBA).\nAlthough Malami was served with a hearing notice in the suit marked FHC/ ABJ/ CS/ 77/2022, he neither appeared in court nor was represented by a legal practitioner while no explanation was offered for his absence.\nCounsel to the NBA, Ibrahim Sunday Ameh, SAN, expressed displeasure over the absence of Malami in court in a suit in which he is a sole defendant.\nThe senior lawyer however said that since the matter was for mention, he urged the court to give an adjournment for the defendant to have another opportunity to appear in court.\nNBA, while faulting the rules as being unlawful, is praying the court to void and set it aside in the interest of justice and fairness to practising lawyers in Nigeria."
  },
  {
    "headline": "2023: Saraki to Ondo delegates: I’m your in-law",
    "summarized_story": "Former Senate President and presidential aspirant of the Peoples Democratic Party(PDP) Bukola Saraki has told party delegates in Ondo State to vote for him at the primaries because he is their in-law.\nSaraki, who reminded Ondo delegates that his mother hails from Owo while his wife hails from Ondo town, said the State would benefit from his presidency.\nWe want you to ensure 100 percent of the delegates in Ondo State do the needful and vote for Saraki.\nHe performed creditably well as Senate President and has remained the best Senate President in our recent history.\nOndo PDP Chairman, Adams Fatai, who described Saraki as a son of Ondo State, said delegates from the state have no reason not to support Saraki."
  },
  {
    "headline": "APC Convention: Giadom, Edu, Morka make South-South unity list",
    "summarized_story": "The former Deputy National Secretary at the centre of the leadership crisis that ousted Comrade Adams Oshiomhole-led National Working Committee (NWC), Chief Victor Giadom, will on Saturday find his way back to the committee after the South-South caucus endorsed him as National Vice Chairman South-South.\nHis name was sighted on the “South South National Working Committee/Zonal Executive Committee Unity List” signed by party leaders in the region.\nOmorede Osifo – Edo State for Deputy National Treasurer of the party.\nThe position of National Ex-offio for the zone allotted to Bayelsa State goes to Diriwari Akedewei while Dr. Christopher Akpan of Akwa Ibom state will fill the position of Deputy National Welfare Secretary.\nBlessing Agbonmere – Edo State is the Zonal Organising Secretary."
  },
  {
    "headline": "2022: Fayemi’s aide resigns, backs Oni",
    "summarized_story": "The Senior Special Assistant to Ekiti Governor Kayode Fayemi on Electoral Matters , Mr. Olaiya Kupolati, has resigned and defected to the Social Democratic Party(SDP).\nIn a letter dated 23rd March, 2022 and addressed to the office of the Secretary to the State Government, Kupolati, said his resignation takes effect from March 30, 2022.\nThe letter reads: “I, Kupolati Olaiya, the Senior Special Assistant on Electoral Matters, hereby resigns my position with effect from 30th March, 2022.\nKupolati said: ” I perceive former governor Segun Oni as the best man for Ekiti after Governor Fayemi at this trying time and I am ready to support him.\nKupolati also formally declared his interest for the House of Assembly race to represent Ilejemeje State constituency in the 2023 election."
  },
  {
    "headline": "Soyinka decries protest over OAU VC",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has decried the protests by some Ile Ife indigenes over the appointment of Prof. Adebayo Bamire as Vice Chancellor of the Obafemi Awolowo University (OAU).\nThe protesters expressed anger that an indigene of Ile-Ife was not appointed OAU VC.\nSoyinka spoke at a lecture titled: The Politics of Black Intellection and Creativity, at the University of Pennsylvania, United States on Tuesday.\nAn Ife person wrote me and said, ‘look at these people disgracing us.’ I told him go there and disgrace them.\nYou are an Ife person."
  },
  {
    "headline": "Super Eagles hit Ghana for World Cup play off",
    "summarized_story": "The Super Eagles have landed in Kumasi, the capital of Ashanti region for their Qatar 2022 World Cup Play- Off first leg tie against the Black Stars of Ghana on Friday.\nThe contingent flew into the city on Thursday morning from Abuja on a chartered Air Peace flight.\nThey are expected to stay at Golden Tulip Hotel Kumasi City.\nThe West African giants will clash on Friday at the Baba Yara Stadium by 8:00 pm."
  },
  {
    "headline": "Breaking: APC senate principal officers meet Buhari at 1pm today",
    "summarized_story": "Principal officers of the Senate elected on the platform of the All Progressives Congress (APC) will today at 1pm meet with President Muhammadu Buhari at the Presidential Villa, Abuja.\nIt was gathered that the principal officers are expected to arrive the State House Conference Centre at 11:30 am for a rapid COVID-19 test and to be seated at meeting venue by 12:30 pm."
  },
  {
    "headline": "NNPC: Buhari headship of petroleum ministry responsible for revenue leakages –PDP govs",
    "summarized_story": "From Ndubuisi Orji and Okey SampsonPeoples Democratic Party (PDP) Governors’ Forum has alleged President Muhammadu Buhari’s headship of the Ministry of Petroleum is responsible for revenue leakages in the Nigerian National Petroleum Corporation (NNPC).\nConsequently, the PDP governors called for the immediate separation of the office of the president from that of the minister of petroleum.\n“NNPC in 2021 alone claimed to have paid over N1 trillion as petroleum subsidy.\nIndeed, in March 2022, N220 billion was deducted as oil subsidy with a promise that N328 billion will be deducted in April 2022.\nFurthermore, the PDP governors noted that the All Progressives Congress (APC) does not deserve to be on the ballot for the 2023 general election."
  },
  {
    "headline": "Why APC is afraid of Nigerians -PDP",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP) has said it would not succumb to blackmail over its call on President Muhammadu Buhari to address the fuel crisis plaguing the country.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIt said the Presidency’s reaction to its stance on the fuel crisis was an indication that the Federal Government did not care about the plight of the people.\nThe opposition party said it would not be deterred from fighting for the well being of Nigerians.\n“Why would the APC not be afraid of the people when it opened our nation to terrorists and bandits who it reportedly imported from neighbouring countries in 2015 to help APC muscle and rig the elections, after which APC leaders failed to honour their deal to pay the said mercenaries for the heinous ‘services’ they were contracted to provide against Nigerians by the APC?"
  },
  {
    "headline": "Days of rickety vehicles numbered in Lagos, says Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Mr. Babajide Sanwo-Olu, yesterday, said the era of rickety vehicles and popular commercial buses known as ‘danfo’ would soon be over in the state.\nThe governor stated this at the official launch of 1, 000 brand new vehicles for the taxi scheme known as ‘Lagride’ in Ikeja.\nHe said the state was moving gradually from the era of rickety vehicles used for commercial transportation to safe modern vehicles.\nThe Lagos governor said the taxi scheme would ensure seamless transportation system for the teeming commuting populace in the state.\nThe governor called on private organisations and individuals to join hands with his government to increase the number of vehicles for the scheme."
  },
  {
    "headline": "Electoral Act: NASS shifts battle to A’Court",
    "summarized_story": "Last Friday, Evelyn Anyadike of the Federal High Court, Umuahia, ordered the AGF to delete section 84 (12) of the amended electoral act.\nHe said the Constitution also confers more powers on the National Assembly on any issue regarding the affairs of political parties and effective management of the electoral process by the Independent National Electoral Commission (INEC).\n“The Electoral Act 2022 enacted by the National Assembly followed due process of the provisions of the 1999 Constitution.\nHe said the National Assembly is an interested party but was not joined in the suit.\nHe said the judge should have made an order for the National Assembly to be joined in the suit."
  },
  {
    "headline": "FG Talks Tough, Moves against Oil Thieves as Buhari Deploys Sylva, Kyari, CDS to N’Delta",
    "summarized_story": "He revealed that up to 80 per cent of oil pumped in the country, particularly in the East, is stolen.\nIn his comments, Kyari stated that the government had concluded plans to move against oil bunkering, pipeline vandalism and illegal activities threatening the country’s oil sector.\nThe team which visited various sites where illegal oil refineries were being carried out, he said, was on a mission to ensure that illegal oil refining and theft of crude oil was halted.\nAt Ibaa which is in Emeoha Local Government of the state, Kyari and the team ordered the destruction of several illegal sites.\nSpeaking with journalists at Ibaa, Kyari said the country could no longer afford to see her oil illegally exploited and stolen."
  },
  {
    "headline": "APC Convention: Buhari, Govs Agree on Consensus Candidates",
    "summarized_story": "The party settled for former Nasarawa State Governor, Senator Abdullahi Adamu, as consensus candidate for the post of National Chairman.\nAPC selected 180 delegates to represent the Anambra State chapter of the party at the national convention on Saturday.\nWhile meeting with the APC governors, Buhari stated, “Over the last seven years we have done our best to deliver good governance to the country.\nA source at the Kastina State Governor’s Lodge, venue of the exercise, said the committee would request for time extension.\nMeanwhile, a chieftain of APC, Mr. Longers Anyawu, appealed to delegates to the APC national convention to support Senator Abdullahi Adamu to emerge as National Chairman of the party on Saturday."
  },
  {
    "headline": "For the Sixth Time, Atiku Declares Presidential Bid",
    "summarized_story": "•Saraki intensifies consultation, meets PDP stakeholdersChuks OkochaFormer Vice President Atiku Abubakar declared his presidential aspiration yesterday in Abuja, saying Nigeria is a sinking ship that must be rescued urgently.\nIt was the sixth time Atiku would be bidding for the presidential seat since the inception of the Fourth Republic in 1999.\nThe former vice president said the 2023 presidential election was a referendum for Nigerians to choose between greatness and continued destruction as well as backwardness.\nAtiku’s presidential declaration came as former Senate President, Dr. Bukola Saraki, intensified consultation with Peoples Democratic Party (PDP) stakeholders, including senators and members of the House of Representatives over his presidential bid.\nThe former vice president stressed, “We need a new kind of leadership that will steer us to a positive path."
  },
  {
    "headline": "Just In: PDP Govs Meet in Abia, Say APC Unfit to Contest 2023 General Election",
    "summarized_story": "Should APC insist on contesting the forthcoming general election despite it woeful failure in every aspects of national life, the PDP Governors said that Nigerians should outrightly reject the ruling party at the polls.\n“The Forum urges Nigerians to reject the APC, a party run undemocratically by a Committee contrary to the Constitution (S.228) with Mr. President regularly issuing instructions and dictates.\nThe meeting noted that life was much better in 2015 under the PDP than today under the APC,” the PDP Governors said.\nOn Debt and Debt Servicing, the Forum said:“Domestic Debt of N8.4T and External Debt of USD 7.3bn was incurred between 1999-2015.\n“The PDP Governors once again decried the inability of the NNPC to make its statutory contributions to the Federation Account, inspite of Oil selling at above $110."
  },
  {
    "headline": "News in Photographs: Buhari Meets APC Govs Ahead of National Convention",
    "summarized_story": "President Muhammadu Buhari Wednesday met with governors of the All Progressives Congress ahead of the party’s national convention which holds this weekend.\nThe meeting at the Council Chambers of the State House Abuja was attended by Vice President Yemi Osinbajo.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Petroleum Development Company Awarded $93million Contract To Firm Without Following Due Process",
    "summarized_story": "The Nigerian Petroleum Development Company (NPDC), an upstream subsidiary company of the Nigerian National Petroleum Corporation (NNPC), has awarded a $93million contract to a firm, Verteville Limited without adherence to the nation's Public Procurement Act, which is a violation of extant rules.\nThe OML 119 (formerly OPL 091) is located on the continental shelf approximately 50km from the Nigerian coast in water depths between 60-97 metres.\nSpeaking with SaharaReporters, some NPDC staff members said the contract was done in secret and characterised by fraud.\nThey added that the company awarded the contract, Verteville Limited, could not embark on such a project.\n“Number one, the award of the contract was done in violation of the Public Procurement Act, which is the statutory rule guiding how public contracts and services are awarded,” a staff member told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Petroleum Development Company Awarded $93million Contract To Firm Without Following Due Process",
    "summarized_story": "The Nigerian Petroleum Development Company (NPDC), an upstream subsidiary company of the Nigerian National Petroleum Corporation (NNPC), has awarded a $93million contract to a firm, Verteville Limited without adherence to the nation's Public Procurement Act, which is a violation of extant rules.\nThe OML 119 (formerly OPL 091) is located on the continental shelf approximately 50km from the Nigerian coast in water depths between 60-97 metres.\nSpeaking with SaharaReporters, some NPDC staff members said the contract was done in secret and characterised by fraud.\nThey added that the company awarded the contract, Verteville Limited, could not embark on such a project.\n“Number one, the award of the contract was done in violation of the Public Procurement Act, which is the statutory rule guiding how public contracts and services are awarded,” a staff member told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: New Group in APC Cabal Moves To Bury Tinubu, Emefiele’s 2023 Presidential Ambitions, Adopts Ex-President Jonathan To Be Consensus Candidate",
    "summarized_story": "The new APC group, SaharaReporters further gathered on Wednesday, prefers former President Jonathan to be the party’s candidate in the 2023 presidential election, which will also see the presidential ambition of the Central Bank Governor, Godwin Emefiele, be buried altogether.\n“A new group in the APC cabals has ruined Emefiele’s plans as they asked ex-president Jonathan to contest and that he will be selected by consensus.\nTinubu had hoped to ward off challenge from Osinbajo, Rotimi Amaechi and others to get the APC presidential ticket through direct primaries.\n“Buni is also working to organise national convention to create substantive national executives, all a ploy to ensure a Jonathan candidacy.\nThe most likely candidate for that will be Governor Babagana Zulum of Borno State,” the source had revealed further."
  },
  {
    "headline": "EXCLUSIVE: New Group in APC Cabal Moves To Bury Tinubu, Emefiele’s 2023 Presidential Ambitions, Adopts Ex-President Jonathan To Be Consensus Candidate",
    "summarized_story": "The new APC group, SaharaReporters further gathered on Wednesday, prefers former President Jonathan to be the party’s candidate in the 2023 presidential election, which will also see the presidential ambition of the Central Bank Governor, Godwin Emefiele, be buried altogether.\n“A new group in the APC cabals has ruined Emefiele’s plans as they asked ex-president Jonathan to contest and that he will be selected by consensus.\nTinubu had hoped to ward off challenge from Osinbajo, Rotimi Amaechi and others to get the APC presidential ticket through direct primaries.\n“Buni is also working to organise national convention to create substantive national executives, all a ploy to ensure a Jonathan candidacy.\nThe most likely candidate for that will be Governor Babagana Zulum of Borno State,” the source had revealed further."
  },
  {
    "headline": "EXCLUSIVE: New Group in APC Cabal Moves To Bury Tinubu, Emefiele’s 2023 Presidential Ambitions, Adopts Ex-President Jonathan To Be Consensus Candidate",
    "summarized_story": "The new APC group, SaharaReporters further gathered on Wednesday, prefers former President Jonathan to be the party’s candidate in the 2023 presidential election, which will also see the presidential ambition of the Central Bank Governor, Godwin Emefiele, be buried altogether.\n“A new group in the APC cabals has ruined Emefiele’s plans as they asked ex-president Jonathan to contest and that he will be selected by consensus.\nTinubu had hoped to ward off challenge from Osinbajo, Rotimi Amaechi and others to get the APC presidential ticket through direct primaries.\n“Buni is also working to organise national convention to create substantive national executives, all a ploy to ensure a Jonathan candidacy.\nThe most likely candidate for that will be Governor Babagana Zulum of Borno State,” the source had revealed further."
  },
  {
    "headline": "Ghana cuts salaries of appointees by 30% to mitigate economic hardship",
    "summarized_story": "This is one of the measures introduced by the government to mitigate economic hardship in the country.\nThe presidency disclosed this on Twitter on Wednesday, adding that all measures have been approved by Ghanaian President Nana Akufo-Addo.\nKen Ofori-Atta, Ghana’s finance minister, is expected to address and explain in detail the measures tailored to mitigate the current economic challenges and other issues on Thursday.\nAdvertisementGhana’s council of state has also decided to reduce members’ monthly allowances by 20 percent for the rest of this year.\nNana Otuo Serebour II, chairman of the council of state, said: “This move is our way of contributing our widow’s efforts towards economic recovery.”"
  },
  {
    "headline": "Ghana cuts salaries of appointees by 30% to mitigate economic hardship",
    "summarized_story": "This is one of the measures introduced by the government to mitigate economic hardship in the country.\nThe presidency disclosed this on Twitter on Wednesday, adding that all measures have been approved by Ghanaian President Nana Akufo-Addo.\nKen Ofori-Atta, Ghana’s finance minister, is expected to address and explain in detail the measures tailored to mitigate the current economic challenges and other issues on Thursday.\nAdvertisementGhana’s council of state has also decided to reduce members’ monthly allowances by 20 percent for the rest of this year.\nNana Otuo Serebour II, chairman of the council of state, said: “This move is our way of contributing our widow’s efforts towards economic recovery.”"
  },
  {
    "headline": "World TB Day: How patients suffer stigmatisation while battling the disease",
    "summarized_story": "Tuberculosis (TB), an infection caused by a bacteria called mycobacterium tuberculosis, most often affects the lungs.\nThe disease can be spread when people with lung tuberculosis cough, sneeze, or spit, propelling the tuberculosis germs into the air.\nAdvertisementBut if the TB germs wake up and multiply, the individual will get sick with TB disease.\nThe disease is usually spread through constant exposure to an infected person as opposed to one-time contact.\nAdvertisementAlthough TB can be cured – usually after treatment for six months – for some patients, stigmatisation is an issue they cannot escape."
  },
  {
    "headline": "World TB Day: How patients suffer stigmatisation while battling the disease",
    "summarized_story": "Tuberculosis (TB), an infection caused by a bacteria called mycobacterium tuberculosis, most often affects the lungs.\nThe disease can be spread when people with lung tuberculosis cough, sneeze, or spit, propelling the tuberculosis germs into the air.\nAdvertisementBut if the TB germs wake up and multiply, the individual will get sick with TB disease.\nThe disease is usually spread through constant exposure to an infected person as opposed to one-time contact.\nAdvertisementAlthough TB can be cured – usually after treatment for six months – for some patients, stigmatisation is an issue they cannot escape."
  },
  {
    "headline": "Putin asks 'unfriendly countries' to buy Russian gas in rouble",
    "summarized_story": "Russian President Vladimir Putin says the country will sell its gas to “unfriendly countries” in rouble.\nThe European nations and the United States had imposed heavy sanctions on Russia following its invasion of Ukraine on February 24.\nIn 2021, Russia accounted for about 45 percent of the EU’s gas imports and 40 percent of its gas consumption.\n“Russia will continue, of course, to supply natural gas by volumes and prices … fixed in previously concluded contracts,” Putin said.\nThe United States had banned the importation of coal, gas, and oil from Russia amid the invasion of Ukraine."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\n“We are delighted to support Big Cabal Media at a pivotal moment.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "The untold story of how ThriveAgric survived a turbulent 2020",
    "summarized_story": "He was one out of hundreds of ThriveAgric’s retail investors who hadn’t received the payments.\nThis affected ThriveAgric’s communication with its retail investors as it repeatedly failed to fulfil the promises it made to its retail investors.\nAll through this turbulent phase, the company maintains it didn’t take its retail investors for granted.\nUnexpected support and lessonsDuring the turbulent period, there was a lot of pushback from retail investors but also surprisingly a lot of support from investors, financiers, and friends.\n“Essentially, I ensured that the core business operations ran smoothly and built a system to ensure that the defaulting offtakers paid,” Eje said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Tingo, a Nigerian tech company, is attempting to dominate the fintech market after making inroads into agribusiness",
    "summarized_story": "TingoPay is an all-in-one financial solution application designed to address challenges for Small and Medium Scale Businesses (SMEs) and, by extension, all bank customers with smartphones.\nConsequently, farmers have unlimited access and market information, and their concerns about infrastructural challenges, time and product waste are completely alleviated.\nTingo Mobile plans to work with Motorola to provide new Defy rugged Motorola smartphones to users who do not currently own one.\nThe platform enables farmers to sell large quantities of farm produce to buyers both within and outside of Africa.\nAccording to Ayoade, the new solution will also provide customers with soft loans that are easy to access and repay."
  },
  {
    "headline": "Interswitch showcases its role as an enabler in the fintech ecosystem, and engages the media in an interactive session",
    "summarized_story": "In her opening remark, Cherry Eromosele, Executive Vice President (EVP), Group Marketing & Corporate Communications, Interswitch, welcomed members of the media and discussed the role of Interswitch as an innovative enabler in the African Fintech ecosystem.\nShe said “in support of our mission to inspire Africa to greatness, Interswitch group has continued to push the boundary of innovation to deliver payment solutions that enable commerce thrive across Africa.\nThe immersion session led by Olawale Akanbi, Group Head, Growth Marketing – Merchants & Ecosystem, was titled ‘understanding the Interswitch business: Africa’s Fintech Model Company.’ It showcased the businesses of Interswitch and its position as an enabler in the fintech industry.\nThe Verve Global card is accepted in 185 countries.\nThe Verve global card covers the limitations of the Classic Verve card."
  },
  {
    "headline": "Legalising and regulating crypto",
    "summarized_story": "Share this article:Web3 is perhaps one of the biggest buzzwords frequently used in the crypto world.\nHere’s today’s spread:Legalising and regulating cryptoYouTube’s plan to stream TV shows for freeLegalising and regulating cryptoWhile the crypto market has not seen bull runs that send the entire crypto community in a frenzy since Bitcoin’s all-time high of $65,000, it has not been devoid of significant updates.\nTo know more about Ukraine’s crypto donations and their effect on the market, please read here: Russia-Ukraine War: What $54m in crypto donations could mean for the global crypto marketSome people believe that the executive order on crypto by the US was borne out of fears that Russia might use it to circumvent sanctions.\nPer YouTube’s blog post, more people are opting to watch videos on the big screen, and the move to add TV shows to their options is perfect timing.\nIf you’d like to be paid in crypto apply hereKippa needs someone to head its engineering team."
  },
  {
    "headline": "Nigeria faces slower economic growth in 2022",
    "summarized_story": "The Economist Intelligence Unit (EIU) said on Wednesday it expects Nigeria’s economic growth to slow more than expected in 2022 as power-supply issues, high inflation and expected monetary tightening hurt output.\nFrom an initial forecast of 3.3 percent in February, the EIU now expects real GDP growth to decelerate to 3 percent in 2022 from 3.6 percent in 2021.\nOn Monday, Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), said available data on key macroeconomic indicators suggested a likely subdued output growth for the economy for most of 2022.\nThe EIU expects the CBN to increase rates by 100 basis points over 2022, taking it to 12.5 percent.\nNigeria’s economic growth is, however, expected to pick up to 3.9 percent in 2023 amid changing economic fortunes."
  },
  {
    "headline": "Fiscal deficit to hit 10-year high on dwindling revenue",
    "summarized_story": "Nigeria’s fiscal deficit will widen to a 10-year high this year as high global fuel prices push up petrol subsidy bills while crude oil output remains low, a new report by the Economist Intelligence Unit (EIU) has said.\nA fiscal deficit is the excess of government spending over its revenue.\nNigeria’s rising fiscal deficit is another stark reminder of how the petrol subsidy bills continue to eat into the earnings of the cash-strapped government of President Muhammadu Buhari.\nAccording to the Organization of the Petroleum Exporting Countries, Nigeria’s oil production plunged 10 percent to 1.26 million bpd in February 2022.\nFalling oil prices will then result in a steady widening of the deficit, to 3.1 percent of GDP in 2026,” the EIU added."
  },
  {
    "headline": "Bank loans at risk as businesses struggle",
    "summarized_story": "Banks saw their non-performing loans moderate to 4.84 per cent in February 2022 from 4.90 per cent in December 2021, Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), said on Tuesday.\nNigerian households, banks and other businesses rely on fuel-powered generators for the running of their daily activities or transactions as public power supply remains unreliable.\nHe said, “So, the pressure will begin to show on the ability of customers to service their loans.\nAnd once that begins to happen, it is either bad loans or a reduction in the loan portfolio.\nThe CBN data on money and credit growth show that total credit to the private sector increased by 15.7 percent year-on-year to N35.4 billion."
  },
  {
    "headline": "Obaseki celebrates media icon, Soni Irabor at 70 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated media icon and Chairman of Soni Irabor Media Group, Soni Irabor, on his 70th birthday.\nObaseki, in a statement, noted that the veteran broadcaster has carved a niche for himself, helping to build the capacity of younger media professionals to enrich the profession and create a veritable pool for promoting media literacy.\nHe noted, “It is with great delight that I congratulate a consummate media icon and celebrated Edo son, Soni Irabor, as he attains the landmark age of 70 years.\n“Irabor has led a remarkable, memorable life; growing from humble beginnings in broadcasting to becoming a media colossus with a career that has spanned almost fifty years, across advertising, media management, public relations, film and marketing.\n“It is remarkable that he has carved a niche for himself, helping to build the capacity of younger media professionals to enrich the profession and create a veritable pool for promoting media literacy."
  },
  {
    "headline": "Obaseki meets Italian Ambassador, strengthens response against human trafficking, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, said his administration is strengthening the state’s response to human trafficking and illegal migration.\nObaseki disclosed this when he received the Italian Ambassador to Nigeria, Stefano De Leo, who was on a courtesy visit at the Government House, Benin City.\nThis emphasizes the special relationship that Edo State, as a sub-national, and the Italian government enjoys.\nIn the past five years, we have been working with the Italian authorities and have been able to significantly limit and reduce the incidents of irregular migration and human trafficking in Edo.\n“We are creating the enabling environment for businesses to thrive in Edo State."
  },
  {
    "headline": "Taxpayers Protection Bill Passes Second Reading in Senate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – A bill seeking to enhance the Nation’s revenue generation system through the establishment of a National Tax crimes commission (NTCC) to prevent and combat tax crimes, protect taxpayers rights, amongst others has passed through second reading on the floor of the Nigerian Senate on Wednesday.\nSponsored by the Chief Whip of the Senate, Senator Orji Uzor Kalu the Tax bill titled ” an Act to establish the National Inspector General for Tax Crimes Commission,2022 (SB.\nConcluding his lead debate , Kalu provided the financial implications of the establishment of the Tax Crimes Commission in the twelve first months.\nIn his contribution, Senator Isah Jubrin ( Kogi East) commended Orji Kalu for initiating the bill and moved for the adoption of the bill for second reading.\nThe Senate in a voice vote presided over by the Senate President, Ahmad Lawan voted in favour of the bill to be read for a second time."
  },
  {
    "headline": "TVET: Edo govt plans technical schools in 18 LGAs, advances on formalizing informal sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo Government has disclosed plans to build at least one technical school in each of the 18 local government areas in the state to resuscitate Technical and Vocational Education and Training (TVET).\nCommissioner for Education, Dr. Joan Osa-Oviawe, who disclosed this to journalists in Benin City, said Edo was in the process of formalising the informal skilled sector in the state.\nWe don’t just want to strengthen our TVET schools, we want to mainstream TVET so that from primary school, our pupils are exposed to handiwork.\nWith this, any pupil that wants to go to a TVET school can do so.\n“So, mainstreaming skilled acquisition, technical and vocational is not just in our regular schools, the governor has mandated that we should extend to our Special Needs schools."
  },
  {
    "headline": "Corporate governance in capital market will build trust, spur growth – Popoola, NGX CEO",
    "summarized_story": "The Chief Executive Officer, Nigerian Exchange Limited (NGX), Mr Temi Popoola, has said sound corporate governance will boost transparency, trust and boost growth in the Nigerian capital market.\nHe said this during the launch of the Corporate Governance Triangle, an initiative of the Nigerian Bar Association Section on Business Law (NBA-SBL), Nigerian Exchange Limited and the Institute of Directors, Nigeria (IoD) on Tuesday, March 22, 2022.\nSound corporate governance ultimately brings about greater transparency and trust in the Nigerian capital market and positions the market on a strong pedestal as a leading capital market in the region.”Speaking about the launch of the Corporate Governance Triangle, Mr Popoola expressed delight in the initiative, saying, NGX is delighted to collaborate with Institute of Directors Nigeria (“IoD Nigeria”) and Nigerian Bar Association-Section on Business Law (“NBA-SBL”) on the establishment of the Corporate Governance Triangle.\nWe look forward to working closely with our colleagues in these highly-reputed organisations to formulate and implement initiatives that will further raise the bar on corporate governance standards and practice in Nigeria.”The Corporate Governance Triangle was initiated to foster good corporate governance in Nigeria for members of the business law community, directors and managers of businesses, shareholders and other corporate stakeholders.\nAs key stakeholders in the corporate world, the CCGC, NGX, and IOD are in a position to influence their members, share best practices and develop frameworks that will enhance corporate governance in Nigeria."
  },
  {
    "headline": "PDP names Ortom, Ugwuanyi, Dankwambo, others in zoning com’ttee, to hold inauguration Thur.",
    "summarized_story": "The Peoples Democratic Party (PDP) has named a 37-member committee which will help the it resolve the contentious zoning of presidential ticket.\nDr. Samuel Ortom; (Borno) Sen. Sanusi Daggash; (Cross River) H. E. Liyel Imoke; (Delta) Rt.\nFranklin Nchita Ogbuewu; (Edo) Chief Tom IkimiOthers are (Ekiti) H. E. Dr. Ayodele Fayose; (Enugu) H. E. Rt.\nIfeanyi Ugwuanyi; (Fct/Abuja) Mohammed Abdulrahman; (Gombe) H. E. Dr. Ibrahim Hassan Dankwambo; (Imo) Chief Fidelis Izuchukwu; (Jigawa) H. E. (Dr.) Sule Lamido; (Kaduna) H.E.\nThe party’s national organising secretary of PDP, Hon."
  },
  {
    "headline": "Capital importation into Nigeria drops by 31% to $6.7bn in 2021",
    "summarized_story": "Capital importation into Nigeria fell by 31 percent to to $6.7 billion in 202, from $9.68 billion in 2020, according Capital Importation Report for Fourth Quarter of 2021 (Q4’21) released by the National Bureau of Statistics (NBS) on Wednesday.\nThe report shows that the three components of capital importation recorded a decline in 2021.\nHowever, the NBS report shows an upward trend in Capital Importation in the fourth quarter of 2021, Q4’21.\n“Disaggregated by Sectors, capital importation into tanning had the highest inflow of $645.59 million amounting to 29.51% of total capital imported in the fourth quarter of 2021.\n“Categorization of total capital investment by Bank shows that Eco Bank Plc ranked highest in Q4 2021 with $708.58 million (32.39%) ."
  },
  {
    "headline": "Fintechs, merchants commend Fidelity Bank for new digital payment solution",
    "summarized_story": "Fidelity Bank Plc, has been commended for simplifying digital payments and the customer journey following the recent launch of PayGatePlus, a one-stop solution for payments that caters essentially for all business categories within the financial ecosystem.\nWe enjoyed working with Fidelity Bank because the process was collaborative and smooth.\n“We are hoping that all the other banks will take a cue from Fidelity Bank and ensure the adoption of embedded finance across the financial services industry”, said Emetarom.\nSpeaking at the event, Stanley Amuchie, Executive Director/Chief Operations and Information Officer, Fidelity Bank Plc encouraged customers to use the platform as guaranteed that they would return with positive testimonials.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria with about six million customers who are serviced across its 250 business offices and digital banking channels."
  },
  {
    "headline": "APC Governors Concede To Buhari On Consensus Candidate",
    "summarized_story": "The APC governor yesterday came out from a meeting with Buhari saying they will throw their weight behind whoever the president supports to become national chairman.\nFollowing the development, chairman of the party’s caretaker committee and Yobe State governor, Mai Mala Buni, will meet with the APC Senators today.\nBuhari hosted the national chairmanship aspirants of the governing party to a dinner at the presidential villa.\nThe former lawmaker was among the national chairmanship aspirants screened last night in Abuja.\n“The Forum of Christians and Muslims Youth of Nigeria recommended Senator George Akume without reservations as the best candidate for the APC National Chairmanship based on his competence, experience, and nationalism."
  },
  {
    "headline": "2023: PDP Governors Shun Atiku’s Declaration, Meet In Abia",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) were conspicuously absent at the presidential declaration of former Vice President Atiku Abubakar yesterday.\nInstead, the governors were in Abia State for a meeting to deliberate on the state of the nation.\nGovernor Adamu Fintiri of Adamawa State, Atiku’s home state, was also in Abia but he came from there to attend the presidential declaration in Abuja.\nFormer Kwara State governor and Senate President Bukola Saraki is also in the race for the main opposition party’s presidential ticket.\nMeanwhile, contrary to the expectation of Nigerians, the PDP governors in Abia failed to state their stand on the vexed issue of zoning formula for the 2023 general election."
  },
  {
    "headline": "Former U.S. Secretary Of State, Madeleine Albright, Dies At 84",
    "summarized_story": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died yesterday at the age of 84.\nAlbright served as U.S. ambassador to the United Nations from 1993-1997 in U.S. President Bill Clinton’s administration.\nHe then nominated her to become the first female secretary of state and she served in that role from 1997-2001.\nShe was a tough-talking diplomat in an administration that hesitated to involve itself in the two biggest foreign policy crises of the 1990s – the genocides in Rwanda and Bosnia-Herzegovina.\nADVERTISEMENT“The impact that she has had on this building is felt every single day in just about every single corridor,” State Department spokesman Ned Price said of Albright."
  },
  {
    "headline": "Former U.S. Secretary Of State, Madeleine Albright, Dies At 84",
    "summarized_story": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died yesterday at the age of 84.\nAlbright served as U.S. ambassador to the United Nations from 1993-1997 in U.S. President Bill Clinton’s administration.\nHe then nominated her to become the first female secretary of state and she served in that role from 1997-2001.\nShe was a tough-talking diplomat in an administration that hesitated to involve itself in the two biggest foreign policy crises of the 1990s – the genocides in Rwanda and Bosnia-Herzegovina.\nADVERTISEMENT“The impact that she has had on this building is felt every single day in just about every single corridor,” State Department spokesman Ned Price said of Albright."
  },
  {
    "headline": "Electoral Act: NASS Set For Showdown With Executive Over Abia Court Verdict",
    "summarized_story": "The two chambers of the National Assembly have resolved to appeal last Friday’s judgment by a Federal High Court in Umuahia, Abia State, nullifying the provision of Section 84(12) of the Electoral Act 2022.\nIn the Senate, the motion was sponsored by Senator George Thompson Sekibo (Rivers East) and co-sponsored by 79 other senators.\nADVERTISEMENTSekibo, in his presentation, observed that Section 4(1)(2) and (3) of the 1999 Constitution, as amended, vested the power of lawmaking for the Federal Republic of Nigeria in the National Assembly.\nAnother lawyer, Sylvanus Akpotia, said the judgement may lead the country into chaos in the electoral process.\nTo him, until the judgment is tested at the court of Appeal, it remains the position of the law."
  },
  {
    "headline": "VIDEO: Super Eagles hit Ghana for World Cup play off",
    "summarized_story": "The Super Eagles have landed in Kumasi, the capital of Ashanti region for their Qatar 2022 World Cup Play- Off first leg tie against the Black Stars of Ghana on Friday.\nVIDEO: Super Eagles land in Ghana for World Cup play off#NigeriavsGhana pic.twitter.com/DSyPNtGzqA — The Nation Nigeria (@TheNationNews) March 24, 2022Speaking before their departure, the Nigeria Football Federation president, Amaju Pinnick, described the two-legged encounter against Ghana as “serious business”.\nIt is a FIFA World Cup ticket at stake, so we must give it our all.\nNigerians don’t want to hear any story; they only want to see the World Cup ticket.”The West African giants will clash on Friday at the Baba Yara Stadium by 8:00 pm.\nThe match is scheduled for the Baba Yara Stadium in Kumasi and the kickoff is 8:30 pm Nigeria time."
  },
  {
    "headline": "APC National Convention: Details Of Buhari’s Directives To Governors Revealed",
    "summarized_story": "Ahead of the All Progressives Congress, APC, upcoming national convention, President Muhammadu Buhari, on Wednesday, met with governors of the party.\nDuring the meeting, Buhari urged the APC leadership to refund aspirants who were dropped immediately.\nHe urged them not to allow the Peoples Democratic Party, PDP, to take over power in 2023.\nThe President told the party leadership to be united in appointing executives ahead of the 2023 general elections.\n“We must restore sanity and purpose in the affairs of our party and lead ourselves to victory and safety."
  },
  {
    "headline": "APC Convention: S’South adopts unity list, endorses candidates for NWC",
    "summarized_story": "Stakeholders of the All Progressives Congress (APC) from the South South geo-political zone have adopted a unity list for the National Convention.\nThe list as signed by the stakeholders has former APC Deputy National Secretary, Victor Giadom (National Vice Chairman S/S); Dr. Betty Edu (National Women Leader) and Dr Felix Morka (National Publicity Secretary).\nThe National Vice Chairman South South is zoned to Rivers/Bayelsa states, National Women Leader to Akwa Ibom/Cross River states and National Publicity Secretary to Edo/Delta states.\nFor instance, Mary Ekpere Eta, former Director- General, National Council for Women Development (NCWD) and Mrs Helen Boco Effiom obtained the nomination forms to contest the office of the National Women Leader.\nAlso the former Deputy National Publicity Secretary, Yekini Nabena, obtained form to contest the National Vice Chairman South South."
  },
  {
    "headline": "Details Of Buhari’s Meeting With APC Governors Emerges",
    "summarized_story": "The details of the meeting between President Muhammadu Buhari and Governors elected on the platform of the All Progressives Congress (APC) have emerged.\nNews Direct earlier reported that the President met with the governors at the Presidential Villa ahead of the APC’s national convention slated for Saturday, March 26.\nBagudu added that the governors would support any process that would lead to a consensus in choosing the party officials.\nAccording to Buni, the Progressives Governors Forum are at peace following the directive of President Buhari.\nHe further stated that this person have plans to ignite an unsolicited crisis, just a few days before the party’s national convention."
  },
  {
    "headline": "Electoral Act: FG moves to delete section 84(12), NASS goes on appeal, Katsina senators, 25 others back out – Blueprint Newspapers Limited",
    "summarized_story": "The Deputy Whip of the Senate, Senator Aliyu Sabi Abdullahi (APC Niger North), seconded the motion.\nBut Senate President Ahmad Ibrahim Lawan, in a move to water down the prayer on appeal, suggested that the matter should be forwarded to the Senate Committee on Judiciary, Human Rights and Legal Matters.\nReps too…Also, the House of Representatives Wednesday resolved to appeal the judgement.\nThe House, while condemning the Abia High Court judgement, also faulted attempts at hurriedly deleting the contentious section, even when the National Assembly was not joined in the suit.\nAnd above all, as you rightly stated, the possibility of an appeal is equally there."
  },
  {
    "headline": "Convention: We’ll stand by Buhari’s choice of candidate – APC govs",
    "summarized_story": "The governors were led to the meeting by the Chairman APC Caretaker Extraordinary Convention Planning Committee (CECPC) and Yobe state Governor Mai Mala Buni.\n“That letter led to a series of actions, including meetings between the Secretary to the Government of the Federation, Chairman of the National Caretaker Committee, Acting Chairman, Gov.\n“Indeed, the Chairman of the Caretaker, upon his return, also appreciated what the Caretaker Committee did and the decisions that were taken in his absence.\nThe governors are unanimous in the support of the caretaker committee; we thank the caretaker committee for what they have been doing.\nIn a related development, the APC national convention screening committee has extended screening of aspirants contesting various positions beyond Wednesday, Blueprint has learnt."
  },
  {
    "headline": "Breaking: Protest hits Edo as Obaseki sacks over 500 sports workers",
    "summarized_story": "There was massive protest around the Samuel Ogbemudia Stadium and adjoining streets on Wednesday after Edo state governor reportedly sacked 513 workers of the State Sports Council.\nAccording to reports, the workers were relieved of their jobs with effect from March 21.\nAs at the time of filling this report, the state government was yet to react.\nDetails loading…"
  },
  {
    "headline": "EFCC Releases Ex-Anambra Governor, Willie Obiano",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the immediate past governor of Anambra State, Willie Obiano, on administrative bail.\nHe said the former governor was released on Wednesday and that his passport is still being held by the anti-graft agency as part of bail conditions.\nChannels Television had earlier reported that the EFCC Chairman, Abdulrasheed Bawa explained that Obiano was still in custody because he has yet to meet his bail conditions.\nObiano was arrested last week at the Murtala Muhammed International Airport in Lagos, hours after handing over to Governor Charles Soludo.\nAfter handing over to his successor, Professor Charles Soludo, the former governor was intercepted by EFCC operatives at the Murtala Muhammed International Airport in Lagos on Thursday last week."
  },
  {
    "headline": "‘Reject APC’, PDP Governors Urge Nigerians",
    "summarized_story": "The PDP Governors’ Forum has urged Nigerians to reject the All Progressives Congress (APC), saying it is impossible for a party so “disorganised” to offer good governance to the people of Nigeria.\nAminu Waziri Tambuwal of Sokoto State (Chairman), Governor Okezie Ikpeazu, Abia State (Vice Chairman), Governor Ahmadu Umaru Fintiri of Adamawa State, Governor Udom Emmanuel of Akwa Ibom State, Governor Bala Mohammed of Bauchi State, Governor of Bayelsa State, Sen. Douye Diri, Governor of Benue, Samuel Ortom, Governor of Delta, Dr. Ifeanyi Okowa, Governor of Edo, Godwin Obaseki, Governor of Enugu, Ifeanyi Ugwuanyi, Governor of Oyo, Oluseyi Abiodun Makinde, Governor of Rivers, Nyesom Wike, and Deputy Governor of Taraba State, Hon Haruna Manu.\nN150 to a dollar was the parallel market (patronised by most businessmen and Nigerians) rate in 2015, it is now about N580 to $1 in the parrel market and still rising.\n(c) Nigeria Federation has 49% shareholding in NLNG.\nThe PDP Governors congratulated the host, His Excellency, Governor Okezie Ikpeazu, the PDP Governors’ Forum Vice Chairman, for his generosity and hospitality in the hosting of the meeting."
  },
  {
    "headline": "Nigeria’s Dependence On Imported Products To End Soon, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has declared that Nigeria’s dependence on imported products in the agriculture sector will soon be a thing of the past with the inauguration of Dangote Fertilizer Plant, which has an installed capacity of 3.0 million metric tonnes of Urea per annum.\n‘‘This new plant is a renewed testament to the widely acknowledged patriotism of Alhaji Aliko Dangote and the leadership of Dangote Industries Limited.\n‘‘The Group’s investment in integrated cement plants, spanning the value chain from quarry to ‘bagging, has effectively ended Nigeria’s dependence on imported cement products.\n‘‘Along with the several other subsidiaries, Dangote Industries Limited has created thousands of jobs across Nigeria.\nLauding Dangote for helping to rebrand Nigeria through his mega investments across Africa, President Buhari said:‘‘He has fueled job-led growth and transformation of several African economies."
  },
  {
    "headline": "FEC Approves N92.12bn For Second Abuja Airport Runway Project",
    "summarized_story": "The Federal Executive Council has approved the sum of N92.12billion for the construction of a second runway at the Nnamdi Azikiwe International Airport, Abuja.\nThe approval by the council comes a day after President Muhammadu Buhari inaugurated a new terminal building at the Murtala Mohammed International Airport (MMIA), Lagos.\nAccording to him, the approved fund will be spread over a number of works to be carried out at the airport within a period of 12 months.\nThe approval is a follow-up of President Buhari’s directive to the Minister of Finance, Budget, and National Planning, Mrs Zainab Ahmed, to source special funding for the second runway of the airport.\nAt the event in Lagos on Tuesday, the President asked the aviation minister to fast-track the airport concession programme, to boost aviation practice in the country and make the aviation industry reflect global standards."
  },
  {
    "headline": "Apongbon Market Fire: Lagos Govt Shuts Eko Bridge, Announces Alternative Routes",
    "summarized_story": "Following the fire outbreak at the Apongbon axis of the Eko Bridge in the early hours of Wednesday, the Lagos State Government has shut the bridge.\nAlternative routes have also been announced for diverting traffic and for the safety of motorists.\nHe also advised motorists to use Ebute Ero to link Inner Marina and Third Mainland Bridge to continue their journeys.\nSo, the Eko bridge has been shut down completely,” Mr Farinloye said.\nVehicles parked under the bridge were also reportedly razed by the inferno which enveloped a large section of the bridge."
  },
  {
    "headline": "Former Zamfara Speaker Sanusi Rikiji Declares Intention For Senatorial Seat -",
    "summarized_story": "Former Speaker of the Zamfara State House of Assembly, Rt.\nHe told the state APC executives under the Chairmanship of Hon.\nTukur Umar Danfulani that he wants to occupy the senate seat in order to further contribute his quota to the political and socio-economic growth of the state.\n” I Intend to add quality to the good representation past senators had made at the national assembly as well as to assist and support the efforts of governor Bello Matawalle in the face of security challenges confronting the state while also joining the governor in the making of a new Zamfara” Rikiji SaidWhile commending the leadership of the party,he pledges his continued support and loyalty to the party and its leadership for the growth and development of the stateResponding, the Chairman, Zamfara State Tukur Umar Danfulani express happiness in the way the aspirant followed due process in declaring his intentionDanfulani assures him that as leaders of the party, they will be fair and just to all members and the party will leave its doors wide open for all interested and qualified members to contest for the position.\nHe noted that Zamfara Central Senatorial Zone deserves the best representation and the party will align with the people in ensuring that the best person is supported to ensure his Victory at the polls."
  },
  {
    "headline": "Only Tinubu can sustain Buhari's endearing legacies in 2023",
    "summarized_story": "This, they say is no other person than former governor of Lagos State, Asiwaju Bolas Ahmed Tinubu.\nThe statement reads further:“Why will President Buhari and Vice President Osinbajo be seen as blessings to Nigeria in the face of economic hardship and security challenges?\nRather than complain and blame President Buhari for the current harsh economic situations, we should applaud him and thank God for giving him to us at these trying times.\nYes, there is no alternative to Tinubu in 2023.\n“Consequently, the No Alternative to Buhari-Osinbajo 2019 ( NATBO 2019) will now be known and referred to as No Alternative to Tinubu 2023 (NATT 2023),” the group concluded."
  },
  {
    "headline": "Abdullahi Shinkafi Withdraws From APC National Chairmanship Race -",
    "summarized_story": "With barely three days to the All Progressive Congress National Convention, a frontline national chairmanship aspirant of the party Abdullahi Shinkafi has withdrawn from the raceShinkafi says, the decision to withdraw from the race is to respect the party supremacy and President Muhammadu Buhari’s decision to zone the position to the North CentralAt a press conference in Gusau, Dr. Shinkafi adds that as a party member, he has all it takes to lead and take the ruling party to a greater heights“I have decided to withdraw from the race as a party man who respect the rule of law and the party’s leaders”.\n“The party has taken a position that the position of its national chairman should go to the North Central, meaning it is exclusively zoned to contestants of the Zone” Shinkafi added.\nAbdullahi Shinkafi appeal to all party Members especially Governors and National Assembly members to support Mai Mala Buni in his quest to conduct a free, fair and transperent National Convention that will lead the party to victory in the 2023 General Elections."
  },
  {
    "headline": "COAS commences Senior Command Leadership seminar in Jos",
    "summarized_story": "The COAS stated this on Tuesday while declaring open the Senior Command and Leadership Seminar organised by the Department of Army Training at the Headquarters 3 Division Nigerian Army, Jos.\nThe three-day seminar was designed for Nigerian Army General Officers Commanding (GOC) and Brigade Commanders, both current and prospective.\nGeneral Yahaya thanked President Muhammadu Buhari, the Nigerian Army’s Commander in Chief, for his unwavering support and strategic leadership in carrying out the Nigerian Army’s constitutional responsibilities.\nIn another development, the COAS today commissioned Transit Accommodation and Officers’ Mess facilities undertaken by GOC 3 Division Maj Gen Ibrahim Ali at the Maxwell Khobe Cantonment, Jos.\nAccording to the GOC, the completed projects will serve to alleviate the dearth of accommodation and provide recreational opportunities for personnel in the Cantonment."
  },
  {
    "headline": "Western Leaders Gather In Brussels As Fierce Fighting Rages Across Ukraine",
    "summarized_story": "An extraordinary NATO meeting is under way in Brussels — the first of three exceptional summits scheduled on March 24 by Western leaders to map out the next steps in efforts to stop Russia’s unprovoked invasion of Ukraine as fierce fighting continues in the besieged city of Mariupol and other flash points across the country.\n“At these three summits, we will see who is a friend, who is a partner, and who betrayed us for money.\nSpeaking ahead of the NATO summit, NATO Secretary-General Jens Stoltenberg said Russian President Vladimir Putin made a “big mistake” with his unprovoked invasion of Ukraine.\nThe official, who spoke on condition of anonymity, said in some areas east of Kyiv, Ukrainian troops appear to have pushed the Russians farther away.\nThe UN General Assembly is preparing to meet on March 24 to discuss the war in Ukraine and a draft humanitarian resolution written by Kyiv."
  },
  {
    "headline": "South Korea Fires Multiple Missiles in Response to North Korea’s Rocket Launch",
    "summarized_story": "South Korea has fired multiple missiles in response to North Korea’s earlier intercontinental ballistic missile (ICBM) launch, its military has said.\nJapan’s coast guard earlier said North Korea launched a projectile which landed inside Japan’s exclusive economic zone (EEZ), 170 km (106 miles) west of Aomori prefecture in northern Japan, at 3.44 pm (6.44am GMT).\nThe ICBM launch on Thursday by North Korea is thought to be its largest test ever, militaries in South Korea and Japan said.\nOn Thursday the White House condemned the latest launch and called it a “brazen violation” of multiple UN Security Council resolutions.\nAccording to South Korea’s Joint Chiefs of Staff, the latest North Korean missile was launched from near Sunan, where Pyongyang’s international airport is located."
  },
  {
    "headline": "Nigeria’s Liquefied Natural Gas Export Hits 15-Month High",
    "summarized_story": "Nigeria’s Liquefied Natural Gas (LNG) exports edged up in December 2021, compared with a year earlier and was the highest since September 2020,.\nBut despite all the efforts, there was no marked growth in gas production during the period under review, even though gas utilisation increased in-country marginally.\nBut while total gas production decreased by 1.11 per cent between 2019 and 2020, the country’s total relative gas utilisation of the commodity rose to 3.90 per cent.\nMeanwhile, a number of European countries are pressuring Nigeria to ramp up its gas production and export to Europe, a source in the know told THISDAY yesterday.\nSo, Nigeria is calling on the United States to invest in our gas assets,” the source stated."
  },
  {
    "headline": "Lagos Launches Tech-Driven Taxi Scheme, Rolls Out 1,000 Cars",
    "summarized_story": "Lagos State Governor, Mr. Babajide Sanwo-Olu on Wednesday unveiled the first batch of 1,000 brand-new GAC-branded automobiles for safe, comfortable and modernised taxi scheme in the state ahead of his declaration for a second term.\nTHISDAY last week reported that after months of apprehension and uncertainty, former Lagos State Governor, Mr. Bola Tinubu, had cleared Sanwo-Olu, to run for a second term.\nHowever, the new taxi scheme, codenamed “LAG RIDE”, was launched at a well-attended ceremony held at the State House in Alausa.\nEach car being used in the scheme comes with technology-enabled security features that monitor every journey undertaken.\nHe said: “The need to provide better, dignifying and more rewarding means of transportation and livelihood for unemployed and underemployed population gave birth to the new ‘Lagos State Taxi Scheme’, which will be operated on a lease-to-own basis."
  },
  {
    "headline": "Nigeria: APC Governors Bow to Buhari, Agree on Adamu as Consensus Candidate for Party Chairman",
    "summarized_story": "The party settled for former Nasarawa State Governor, Senator Abdullahi Adamu, as consensus candidate for the post of National Chairman.\nWhile meeting with the APC governors, Buhari stated, “Over the last seven years we have done our best to deliver good governance to the country.\nA source at the Kastina State Governor’s Lodge, venue of the exercise, said the committee would request for time extension.\nMeanwhile, a chieftain of APC, Mr. Longers Anyawu, appealed to delegates to the APC national convention to support Senator Abdullahi Adamu to emerge as National Chairman of the party on Saturday.\nThe delegates were drawn from the 21 local government areas, and their names were announced at the state party secretariat in Awka yesterday evening by the state chairman, Sir Basil Ejidike."
  }
]