[
  {
    "headline": "Atiku group wants ex-VP PDP’s consensus presidential candidate",
    "summarized_story": "THE Atiku Support Organisation, has called on the Peoples Democratic Party, to adopt former Vice-President, Atiku Abubakar, as its consensus candidate for the 2023 presidential election.\nThe group made the call at the inauguration of its state executives in the South-South geopolitical zone, according to a statement issued by the National Director Publicity, El Mo Victor.\nThe statement titled, ‘Adopt Atiku Abubakar as the Consensus Candidate for 2023 Presidential Poll, Atiku Support Organisation Tells PDP,’ was sent to The PUNCH, in Abuja, on Sunday.\nThe statement read in part, “The Atiku Support Organisation, on Friday, June 25th, 2021, held its South-South zonal inauguration of state executives from the six states in the geopolitical zone.\n“The event was well attended by all the executives of the organisation from the zone."
  },
  {
    "headline": "Protest in Kwara community as gunmen kill pregnant woman, kidnap husband",
    "summarized_story": "Gunmen on Saturday killed a pregnant woman, Hawawu, and kidnapped her husband, Lukman Ibrahim, on Ojoku Road, Offa, in the Offa Local Government Area of Kwara State.\nThe couple were said to be on their way home when they were accosted by the hoodlums.\nThe state Police Public Relations Officer, SP Ajayi Okasanmi, who confirmed the incident, said he could not give details of the kidnap.\n“As Lukman was being dragged by the assailants, the wife was shouting for help.\nIt was gathered that the entrepreneur’s car was taken to the police station on Ojoku Road, Offa, while Hawawu’s corpse was taken to the morgue of the General Hospital, Offa."
  },
  {
    "headline": "Troops neutralize scores of bandits in fierce encounter in Zamfara, recover arms, ammunition",
    "summarized_story": "**As Army Chief visits Shehu of Borno, pledges to work with the traditional institutionBy: Kingsley Omonobi – Abuja.\nIn the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nThe troops also recovered one PKT riffle, a large cache of ammunition, and a motorcycle.\nRelatedly, troops have neutralized 5 bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nHe asked the COAS not to be deterred and pledged the support of the Emirate to the Army leadership and Military generally."
  },
  {
    "headline": "BREAKING: Delta Lawmaker, Kenneth Ogba is dead",
    "summarized_story": "…wife hospitalisedBy Festus Ahon, Ochuko Akuopha, ASABAThe member representing Isoko South Constituency 1 in the Delta State House of Assembly, Mr. Kenneth Ogba is dead.\nThe Vanguard, however, gathered that Mr. Kenneth Ogba was suffering from High Blood pressure, adding that he was discussing with friends at a popular hotel in Oleh (names withheld) when he suddenly slumped.\nThe source who pleaded anonymity said the corpse has been deposited in a mortuary in Oleh, lamenting that the wife Mrs. Elizabeth Ogba, has been hospitalised due to shock of her husband’s death.\nThe late Mr. Kenneth Ogba who hails from Oleh, headquarters of the Local Government Area, is the first son of his aged father, Chief Lucky Ogba.\nVanguard News Nigeria"
  },
  {
    "headline": "APC to begin sales of forms for congresses July 1",
    "summarized_story": "The All Progressives Congress (APC) says it plans to begin sales of forms for its congresses on July 1.\nHe said purchase of forms for ward congresses would take place from July 1 to July 7, while inauguration of ward and local government congresses, screening and screening appeals committee would hold on July 10.\nMedaner said that appeals arising from ward congresses would be entertained from July 26 to July 29.\nHe said the sales of forms for state executives positions would take place from Aug. 23 to Aug. 27, while inauguration of screening, screening appeals committee for state executives would hold on Aug. 30.\n“State congresses will hold on Sept. 18 and appeals arising from state congresses will hold from Sept. 19 to Sept. 21."
  },
  {
    "headline": "Panic in Rivers community as herdsman kills 26-yr-old man",
    "summarized_story": "By Davies Iheamnachor, PORT HARCOURTThere is panic in the Egbeda community in Ogba/Egbema/Ndoni Local Government Area of Rivers State following the killing is a 26-year-old man by a herdsman.\nThis was as the residents of the area have lamented continued invasion of their farmlands by suspected Fulani herdsmen.\nIt was gathered a 26-year-old man, Nonye Nwa-Omoku, was shot dead by a herdsman in the community last Thursday without any provocation.\nWe just saw the Fulani man coming towards us.\nIf my people have farmlands of letting me say 200 kilometres, Fulani herdsmen have taken over 107 kilometres."
  },
  {
    "headline": "Ondo CAN member dies in auto crash",
    "summarized_story": "Dayo Johnson AkureA top officer of the Christian Association of Nigeria, CAN, Prophet Christopher Samuel Adelusimo has reportedly died in an auto crash along Ile-Oluji-Itanla- junction, Ondo town, Ondo state.\nAdelusimo, until death was the Public Relations Officer of the association in the State.\nVanguard gathered that the clergyman died on Friday in an accident that occurred along Ile-Oluji-Itanla- junction, Ondo.\nOladapo said that “Prophet Samuel Ifedayo was a loyal and dedicated officer who rendered selfless services to CAN.\nEarlier, the CAN boss and members of his delegation had visited the Celestial Church of Christ, Christ Ambassador, Ondo, founded and pastored by the late Prophet, where he commiserated with the members over the huge loss."
  },
  {
    "headline": "Yobe govt moves to clamp down on private school operating without licence, standards",
    "summarized_story": "Worried by the proliferation of private schools, the Yobe State Government through the Ministry for Basic and Secondary Education has set up a Special Committee to check irregularities in private schools across the state.\nThis is with a view to clampdown on erring operators who turned the important sector into a money-making venture without regard to qualitative education.\nDr. Idriss said any private school operating in the state must follow standard procedures of operation including regards for people’s religion, culture and tradition.\nAccording to the commissioner, his ministry won’t hesitate to shutdown any private school that failed to abide by the established conditions.\nThe governor also appreciated the efforts of those ‘serious private’ school operators in providing sound education to learners in the state."
  },
  {
    "headline": "Biafra, Oduduwa: Yahaya Bello suggests solution to agitations",
    "summarized_story": "Governor Yahaya Bello of Kogi State, has advocated dialogue as a tool in resolving the agitations for Nigeria’s break up.\nBello made the remark emphasizing on the need for Nigeria’s unity.\nHe also called for dialogue as a way to resolving all forms of agitations.\nBello expressed hope that Nigeria will never break up irrespective of ploys by some people to stir problems using religious and ethnic divides.\n“We can have differences, skirmishes here and there which by the grace of God, we shall overcome them and Nigeria will remain together,” Bello said."
  },
  {
    "headline": "NAF bombards Boko Haram, ISWAP leaders, guards during meeting",
    "summarized_story": "Nigerian Air Force (NAF) jets bombarded Boko Haram and Islamic State West African Province members (ISWAP) at the Lake Chad axis.\n“Their leaders, including Ali Chakkar and other top ISWAP commanders, were holding a meeting when the attacks were launched.\n“The precision-guided airstrikes coordinated by the Air Task Force Command resulted in the killing of very large numbers of ISWAP and Boko Haram terrorists.”NAF spokesperson, Air Commodore Edward Gabkwet confirmed the operation.\n“We don’t differentiate between Boko Haram and ISWAP terrorists as we successfully launched the devastating intelligence-led aerial attacks targeting the terrorists in those locations”, he said.\nNigerian military eliminate ISWAP leaders Amir Abu-Rabi, Mohamer Likita"
  },
  {
    "headline": "Kaduna: Troops avert attacks in Zangon Kataf",
    "summarized_story": "Kaduna State Government said troops of Defence Headquarters Operation Safe Haven (OPSH) stationed in the Southern Kaduna general area averted an attack by armed bandits that would have led to loss of lives in Gidan Zaki, Zangon Kataf Local Government Area.\nThe statement noted that a swift response of the troops repelled the attack early on, as the bandits retreated from the area in disarray.\nGovernor Nasir El-Rufai noted the reports with sadness, while thanking the troops for their prompt response which halted the attack and prevented its escalation.\nHe wished the injured resident a speedy recovery, and tasked security agencies with ensuring a thorough investigation.\nKaduna Government confirms killing of one in Zangon Kataf LGA"
  },
  {
    "headline": "God has rejected Obasanjo, Northern crisis'll wipe out Buhari's people",
    "summarized_story": "Prophet Segun Adebayo of Christ Apostolic Church, CAC, has said God has rejected ex-President Olusegun Obasanjo.\nProphet Adebayo said God rejected Obasanjo because he failed to use the opportunity he was given to clean up Nigeria’s mess in 1999.\nAddressing reporters in Lagos, the cleric said Obasanjo was disobedient to God and “the grace has left him”.\nHe also predicted a crisis in the North that would wipe out President Muhammadu Buhari’s people.\nOduduwa Republic: God sent Sunday Igboho, don’t fight him – CAC pastor warns Gani Adams"
  },
  {
    "headline": "Buni, Uzodimma, Yahaya Bello, Sylva storm Abia for Emenike’s mother-in-law’s burial",
    "summarized_story": "Our ReporterSome All Progressives Congress (APC) governors and chieftains at the weekend stormed Abia State for the burial of the late Lady Felicia Olaocha Ohadiugha.\nThe burial ceremony took place at Umule Ohuhu in Umuahia North Local Government Area of Abia State.\nAmong the dignitaries were APC National Caretaker Committee Chairman and Yobe State Governor Mai Mala Buni; Imo State Governor Hope Uzodinma and their Kogi State counterpart, Yahaya Bello.\nDuring the funeral mass at the Holy Trinity Catholic Church, Umule Ohuhu, Rev.\nSylvester Anyanwu urged Nigeria’s political leaders to always put aside their political differences and work for peace across Nigeria."
  },
  {
    "headline": "Nigeria cannot split, Gov Bello assures",
    "summarized_story": "Agency ReporterKogi Governor Yahaya Bello has restated his faith and commitment to the unity of Nigeria, saying the country can never divide.\nGovernor Bello said this at the Abia Government House, Umuahia when he paid a courtesy call on Governor Okezie Ikpeazu.\nHe commended Governor Ikpeazu for the warm reception offered him and his entourage, saying the Abia Governor has been a very good friend.\n“In Kogi State, we don’t emphasise on what divides us but we emphasis more on what unites us.\nResponding, Ikpeazu commended Bello for the visit, describing him as a very good friend and strong ally who has always called him to offer words of encouragement."
  },
  {
    "headline": "I broke my leg for Nigeria but FG neglected me, Siasia laments",
    "summarized_story": "Our ReporterFormer Super Eagles player Samson Siasia has hit out at the Federal Government for abandoning legends in their time of need.\nThe former striker played for the Super Eagles from 1984-1999, making a total of 51 appearances and scoring 16 goals in the process.\nDespite his sacrifices, the now 53-year-old believes he is not getting what he deserves and was neglected by his country.\nADVERTISEMENT“I am a legend, I have played, broke my leg for this country, and also coached,” Siasia said as quoted by AllAfrica.\nOthers are Uche Okafor (Deceased), Thompson Oliha (Deceased), Stephen Keshi (Deceased), Christian Chukwu, Dr Akin Amao, Stephen Edema, Col. A Asielue and B. Aromasodun."
  },
  {
    "headline": "Avengers’ threat to blow oil pipelines unnecessary",
    "summarized_story": "By Chinyere OkoroaforThe Presidency on Sunday described threats by Niger Delta Avengers to resume blow-up of oil pipelines if the substantive board for the Niger Delta Development Commission (NDDC) was not inaugurated among other demands as unnecessary.\nHe said: “The media was Sunday awash with threats and demands by a group, Niger Delta Avengers, to embark on economic sabotage through the bombing of critical oil and gas installations unless certain demands, including the development of the Niger Delta, and restructuring of the Federation, were met.\nI thank you for paying this courtesy visit not too long after your election in April, and swearing-in last May.\n“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "Andy Uba hails Anambra APC on successful primary",
    "summarized_story": "From Magnus Eze, EnuguThe Senator Andy Uba Campaign Organization has congratulated members of the All Progressives Congress (APC) in Anambra State for a successful governorship primary held across the 21 LGAs despite initial logistical issues.\nDirector-General of the campaign organization, Chief Paul Chukwuma in a statement in Awka, praised the doggedness of APC members who remained patient all through the process.\nChukwuma, also berated those aspirants that alleged irregularities in the primary election for raising false alarms.\nHe noted that all the aspirants were given everything they needed by the Primary Election Committee but some were angry that they could not hijack the whole process hence the resort to blackmail and cheap propaganda.\nThe statement called on well-meaning members of the APC to maintain confidence in the Gov."
  },
  {
    "headline": "I like smart, God-fearing men –Jemeriye Adeniji, singer",
    "summarized_story": "Adeniji, whose Ewa Global Initiative showcases the beauty of Africa, in this interview dwells on her kind of man, among other issues.\nWhat is the difference between being an artiste in the US and an artiste in Nigeria?\nIt is not about ‘man know man’ as it is here.\nI don’t want to knock anybody’s hustles because I don’t know what works for you.\nI like a God-fearing man, a man who appreciates and feels confident in his own woman and also in himself."
  },
  {
    "headline": "Anambra guber: How Valentine Ozigbo emerged PDP’s candidate",
    "summarized_story": "From Obinna Odogwu, AwkaFormer Chief Executive Officer of TRANSCORP Plc, Valentine Ozigbo, has emerged the winner of the primary election of the Peoples Democratic Party (PDP) held at Prof. Dora Akunyili Women’s Development Centre, Awka.\nOzigbo secured 62 votes to defeat his closest rival, Dr Obiora Okonkwo, who got 58 votes in the keenly contested election conducted by an electoral committee set up by the national leadership of the party.\nMeanwhile, a factional group in the party led by Chukwudi Umeaba elected Senator Ugochukwu Uba as its standard bearer for the governorship election slated for November 6 this year.\nTheir returning officer, Chief Obidi Ebede, said that Uba got 275 votes to defeat his closest rival, Godwin Ezeemo, who got 114 votes.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Agitations: Nigeria’s break up real –Prophet Olagunju",
    "summarized_story": "By Olakunle OlafioyeThe division among Yoruba leaders over the quest for the independence of Yoruba nation will not affect the realization of the agenda.\nConsidering the agitations by the Yoruba and the Igbo, would you say this has a link to your prophecy?\nProf Banji Akintoye and Pa Ayo Adebanjo who are believed to be the leaders of the Yoruba are not on the same page as far as the agenda for an independent Yoruba nation is concerned.\nDon’t you think this will create confusion which will may make the realization of the Yoruba agenda a tall dream?\nIf Tinubu is truly a Yoruba leader which he claimed to be, he should always be found allying with the Yoruba agenda."
  },
  {
    "headline": "Asaba Accord: Southern governors are broken records –Senator",
    "summarized_story": "In this interview, he indicted state governors for not doing enough to police their domains.\nHe spoke on other national issues: What do you make out of this current situation in the country?\nThere are people from every part of this country in the National Assembly and also in the executive.\nBefore the Asaba Accord, there was a meeting of all the state governors.\nLess than a week of that meeting, some people came out and claimed Southern Governors Forum."
  },
  {
    "headline": "Buhari: Drug Trafficking, Abuse Pose More Threat than Insurgency, Banditry",
    "summarized_story": "•Says drug abuse already stretches across three generationsDeji Elumoye in Abuja and Laleye Dipo in MinnaPresident Muhammadu Buhari, yesterday, identified drug trafficking and abuse as more threatening to the stability of the nation than banditry and insurgency that are prevalent in some parts of Nigeria.\nThe enormity of the danger of drug abuse calls for an urgent need to nip the problem in the bud.\n“Today, it is a glaring fact that Nigerian youths are involved in drug abuse.\nHe said: “And in this campaign, we are tackling the scourge of drug abuse and trafficking on all fronts.\nIn addition to the arrest and prosecution of drug offenders, we have worked out intensive drug abuse awareness and sensitisation programmes targeting different groups, with an emphasis on youths."
  },
  {
    "headline": "Army Chief Orders Destruction of All Boko Haram, ISWAP Enclaves in North-east",
    "summarized_story": "The army chief also declared that traditional institutions were critical to bringing the insurgency war to an end.\nA statement issued by the Nigerian Army Headquarters said the army chief ordered troops of Sector 2 Joint Task Force North-east Operation Hadin Kai to destroy all Boko Haram and Islamic State West Africa Province (ISWAP) enclaves in their various locations.\nAmong the dignitaries, who accompanied the COAS were the Chief of Operations (Army) Major General Ibrahim Yusuf and the Theatre Commander Operation Hadin Kai, Major General Christopher Musa.\nMeanwhile, the army chief said traditional institutions were critical to the success of ongoing operation to end Boko Haram insurgency and terrorism in the North-east.\nMeanwhile, the Nigerian Air Force yesterday denied that the Nigerian Air Force Base, Kaduna, was attacked by Boko Haram."
  },
  {
    "headline": "NEITI: $584m Oil, Gas Deals Sealed in Asset Ownership Changes in 2019",
    "summarized_story": "Besides, Nigerian Petroleum Development Company (NPDC) acquired OML 11, formerly operated by Shell Petroleum Development Company (SPDC), in a contract totalling $456.03 million.\nDuring the year under review, seismic data acquisition was up by 348 per cent, field development plans 65 per cent, well activities 45 per cent, while gas development plan was down by 75 per cent, with six approved for 2019, as opposed to 24 in 2018.\nSeplat was next with 7 million barrels, followed by SNEPCo, with 3.8 million barrels.\nIn addition, NPDC and Neconde suffered losses and subsequent deferment of 3.7 million barrels, Newcross’ was 3.2 million barrels, Aiteo deferred 2.84 million barrels, Energia’s share of deferment was 1.7 million barrels, while APDNL’s loss was 733,000 barrels during the year.\nAll deferred production amounted to 55.2 million barrels while there were 1,387 pipeline breaks, with Mosimi recording the highest with 637 breaks, followed by Port Harcourt, 536, and Warri with 96 breaks."
  },
  {
    "headline": "UK Health Secretary Quits after Breaking Social Distance Guidance",
    "summarized_story": "Tobi SoniyiFollowing pressure on him to quit, United Kingdom Health Secretary Matt Hancock yesterday resigned his appointment after he breached social distancing guidance by kissing a colleague.\nIn a video posted on Twitter, Hancock said: “I have been to see the prime minister to resign as secretary of state for health and social care.\nHe has appointed former chancellor Sajid Javid as the new health secretary.\nAlso yesterday Coladangelo, seen in kissing video, also announced she was leaving the Department of Health and Social Care.\nFellow Tory MPs, as well as Labour and the Covid-19 Bereaved Families for Justice group, had called for the health secretary to be sacked."
  },
  {
    "headline": "PDP Faction Elects Uba as Guber Candidate",
    "summarized_story": "By David-Chyddy ElekeA faction of the Peoples Democratic Party (PDP) in Anambra State has elected Senator Ugochukwu Uba as the standard bearer of the party in the November 6 poll.\nThe returning officer in the election, Chief Obidi Ebede, said Uba got 275 votes to defeat his closest rival, Godwin Ezeemo, with 114, while Senator Uche Ekwunife scored 56 votes to come third.\nHe said there were 665 accredited delegates.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "Obasanjo: Nigeria's population will become liability by 2050 if we don't manage it well",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria’s population growth could become a problem if it is not well managed.\nEarlier this month, United Nations released a report which estimated that Nigeria’s population had risen to 211 million.\nReacting, Obasanjo predicted that if the population explosion is not curbed, Nigeria will become the third-largest country in the world in 2050.\nAdvertisement“If we don’t start getting it right now, we will not get it right by 2050.\nBut if we don’t do what we have to do – which we are not doing now – the population will become a liability."
  },
  {
    "headline": "Obasanjo: Nigeria's population will become liability by 2050 if we don't manage it well",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria’s population growth could become a problem if it is not well managed.\nEarlier this month, United Nations released a report which estimated that Nigeria’s population had risen to 211 million.\nReacting, Obasanjo predicted that if the population explosion is not curbed, Nigeria will become the third-largest country in the world in 2050.\nAdvertisement“If we don’t start getting it right now, we will not get it right by 2050.\nBut if we don’t do what we have to do – which we are not doing now – the population will become a liability."
  },
  {
    "headline": "Fuel scarcity looms as IPMAN threatens to cease operations over 'police harassment'",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has threatened to shut down fuel stations across the country.\nAdvertisementSpeaking with reporters on Sunday in Jos, Plateau state capital, Yakubu Suleiman, IPMAN spokesperson, said the association has instructed its members to shut down operations over alleged harassment by the police.\nHe noted that the some police officers had invaded the association’s national secretariat on Friday over leadership issues among members.\nSC15/2015, and ordered that Mr Chinedu Okoronkwo, is our President and Alhaji Danladi Garba Pasali, as National secretary,” he said.\n“The implications would be there will be a shortage or fuel scarcity in the country."
  },
  {
    "headline": "Fuel scarcity looms as IPMAN threatens to cease operations over 'police harassment'",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has threatened to shut down fuel stations across the country.\nAdvertisementSpeaking with reporters on Sunday in Jos, Plateau state capital, Yakubu Suleiman, IPMAN spokesperson, said the association has instructed its members to shut down operations over alleged harassment by the police.\nHe noted that the some police officers had invaded the association’s national secretariat on Friday over leadership issues among members.\nSC15/2015, and ordered that Mr Chinedu Okoronkwo, is our President and Alhaji Danladi Garba Pasali, as National secretary,” he said.\n“The implications would be there will be a shortage or fuel scarcity in the country."
  },
  {
    "headline": "'We must strike a balance' — Gbaja advocates social media regulation",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says social media must be regulated to protect every citizen of the country against its negative sides.\nThe speaker noted that freedom of speech is not absolute, stressing that there must a balance in the regulation of social media so that the rights of individuals are not infringed upon.\nThat is my position about social media regulation.\nAdvertisement“Many more countries, democracies that we all look up to are already in the mood of regulating social media.\nYou heard of cyberbullying, children nagging themselves, killing themselves because of what is on social media."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "Edo First Lady hosts reception for couple left stranded by Marriage Court Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State First Lady, Mrs. Betsy Obaseki, at the weekend, organised a wedding reception for Mr. and Mrs. Abel Eromosele Ugiagbe, the couple whose marriage ceremony was disrupted by the absence of the Registrar of the Federal Marriage Registry, in Benin City, Edo State.\nMrs. Obaseki said her decision to host the reception for the couple was to ease the pain they went through following the disappointment on their wedding day, adding that the compassionate nature of Mr. Abel Eromosele Ugiagbe who felt bad that the registrar lost his job drew her closer to the couple.\nShe noted, “After I confirmed the report as true, I called my friend and wife of the Minister for Interior, Mrs. Aregbesola who briefed her husband about the development.\nThe Minister apologized to the couple.\nOsaigbovo Iyoha, congratulated the couple on the success of their wedding despite the disappointment they experienced over the failure of the Registrar of the Federal Marriage to show up for the marriage."
  },
  {
    "headline": "God will heal our land – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has dedicated his administration to God Almighty, declaring that God will heal Nigeria and Edo State from all forms of social vices and political backwardness that hinder development.\nCiting the book of Timothy 2:1-2, Obaseki said, “I have the privilege and grace of God to offer prayers and declarations over the sphere of politics and government in Edo State.\nHe declared, “God will heal our land through Godly leaders who make Godly policies and lead with the fear of God.\n“I declare that Jesus Christ is Lord over politics and government in Edo State.\nI declare that the sphere politics in our state is blessed because of our prayers to the Lord."
  },
  {
    "headline": "Ogirrua of Irrua celebrates 50th coronation anniversary – Nigerian Observer",
    "summarized_story": "Chief, Martin Uhumoibhi, immediate past Vice Chancellor of Ambrose Alli University, Prof. Ignatius Onimawo, Dr. Igene Christopher, among others.\nAwards of honour were presented to some personalities such as, current senator representing Edo Central, Senator (Engr) Clifford Odia, Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHe appreciated the efforts of the government and people of Edo State in ensuring that peace prevail in the land, and thanked guests and all that contributed to the success of his 50th Coronation Anniversary.\nOthers in their remarks, including Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHighpoint of the one week celebration was the cutting of the 50th Coronation Anniversary cake by the celebrant, Ogirrua of Irrua and Okaijesan of Esanland, HRH William Momodu amidst cheers."
  },
  {
    "headline": "Edo Modular Refinery ready to begin operations – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Friday, said the Edo Modular Refinery being developed by Edo Refinery and Petrochemical Company Limited (ERPC) with support from the Edo State Government, in Ologbo, Ikpoba – Okha Local Government Area of the state, is ready to commence operations.\n“The plant is ready; it’s ready to receive crude oil; it’s ready to process and it’s ready to deliver products.\nThe governor has this project dear to his heart; not only this project, the power plant is also situated in Ologbo.\nIn his response, the Managing Director of the Edo Modular Refinery, Tim Tian, commended the governor for his contribution in the actualization of the project.\nTian, who attributed the outbreak of the COVID-19 pandemic as a major challenge which affected the project, said the refinery is ready to produce crude oil products."
  },
  {
    "headline": "Buhari responds to Niger Delta Avengers’ threat to attack oil installations",
    "summarized_story": "President Muhammadu Buhari has responded to a fresh threat by a militant group, Niger Delta Avengers, to cause instability in Nigeria’s Niger Delta region.\nThe group also threatened to attack politicians “collaborating” with the Nigerian government to “undermine” the interest of the region.\nThe remarks could be seen also as the president’s response to the latest threat by the Niger Delta Avengers, apparently.\nMr Buhari also said the completion of the East-West Road, which is meant to link together the states in the Niger Delta region, was top on his administration’s agenda.\nThe presidential spokesperson, Mr Adesina, said Mr Buhari’s comment “renders any sabre-rattling rather unnecessary.”ADVERTISEMENT"
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "JUST-IN: Zamfara Gov, Matawalle, Defects To APC Tuesday",
    "summarized_story": "Zamfara State governor, Muhammad Bello Matawalle, will on Tuesday, June 29, 2021 dump the Peoples Democratic Party (PDP) for the ruling All Progressives Congress (APC).\nAdvertisementsLEADERSHIP reports that an aide to President Muhammadu Buhari on Digital and New Media, Bashir Ahmed, had earlier announced Matawalle’s defection to APC on his verified Facebook page on Sunday morning.\nWelcome, Matawalle.”LEADERSHIP can now report that arrangements have been perfected to receive the Zamfara State governor into the APC fold by the national leadership of the governing party.\nAccording to an invitation letter addressed to critical party leaders and stakeholders, a copy of which was sighted by LEADERSHIP, Matawalle alongside his teeming supporters will be formally received into the APC at the Zamfara State Government House in Gusau, the state capital by 2pm on Tuesday.\nWith this development, Matawalle would join the likes of Governor David Umahi of Ebonyi State and Governor Ben Ayade of Cross River State, who had recently dumped the PDP for the ruling APC."
  },
  {
    "headline": "JUST-IN: Zamfara Gov, Matawalle, Defects To APC Tuesday",
    "summarized_story": "Zamfara State governor, Muhammad Bello Matawalle, will on Tuesday, June 29, 2021 dump the Peoples Democratic Party (PDP) for the ruling All Progressives Congress (APC).\nAdvertisementsLEADERSHIP reports that an aide to President Muhammadu Buhari on Digital and New Media, Bashir Ahmed, had earlier announced Matawalle’s defection to APC on his verified Facebook page on Sunday morning.\nWelcome, Matawalle.”LEADERSHIP can now report that arrangements have been perfected to receive the Zamfara State governor into the APC fold by the national leadership of the governing party.\nAccording to an invitation letter addressed to critical party leaders and stakeholders, a copy of which was sighted by LEADERSHIP, Matawalle alongside his teeming supporters will be formally received into the APC at the Zamfara State Government House in Gusau, the state capital by 2pm on Tuesday.\nWith this development, Matawalle would join the likes of Governor David Umahi of Ebonyi State and Governor Ben Ayade of Cross River State, who had recently dumped the PDP for the ruling APC."
  },
  {
    "headline": "Varsity Don Calls For Protection Of Indigenous Languages",
    "summarized_story": "A don, Prof. Imelda Udoh, of the department of Linguistics, University of Uyo in Akwa Ibom State, has called for the protection of all Nigerian indigenous languages to enable the government speak to the people in the languages they understand.\nAdvertisementsProf. Imelda, who made this known at the weekend in Uyo while delivering the University’s 81st Inaugural Lecture with the theme “Nigerian Indigenous Languages As Bricks For A National Identity,” said that protecting indigenous languages will foster national identity and integration.\nShe said multilingualism should be treated as an asset, maintaining that there is need for the indigenous Nigerian languages to be used properly and should be recognised.\n“Nigeria should protect the existence of both the major and minor linguistic groups.\nHe also thanked Prof. Udoh for disclosing the fact that Cross River State has the highest number of languages spoken in South South geopolitical zone of Nigeria."
  },
  {
    "headline": "Varsity Don Calls For Protection Of Indigenous Languages",
    "summarized_story": "A don, Prof. Imelda Udoh, of the department of Linguistics, University of Uyo in Akwa Ibom State, has called for the protection of all Nigerian indigenous languages to enable the government speak to the people in the languages they understand.\nAdvertisementsProf. Imelda, who made this known at the weekend in Uyo while delivering the University’s 81st Inaugural Lecture with the theme “Nigerian Indigenous Languages As Bricks For A National Identity,” said that protecting indigenous languages will foster national identity and integration.\nShe said multilingualism should be treated as an asset, maintaining that there is need for the indigenous Nigerian languages to be used properly and should be recognised.\n“Nigeria should protect the existence of both the major and minor linguistic groups.\nHe also thanked Prof. Udoh for disclosing the fact that Cross River State has the highest number of languages spoken in South South geopolitical zone of Nigeria."
  },
  {
    "headline": "Anambra: Saraki Congratulates Ozigbo, Rallies Stakeholders’ Support",
    "summarized_story": "A former Senate President, Dr. Abubakar Bukola Saraki, has congratulated the winner of the gubernatorial primary election conducted by the Peoples Democratic Party (PDP) in Anambra State at the weekend, Mr. Valentine Ozigbo.\nSaraki noted that Ozigbo emerged from a keenly contested primary election and his emergence will definitely ruffle some feathers in some quarters.\n“Ozigbo must let all his co-aspirants know that there is ‘no victor and no vanquished’ in the just concluded primary election.\nThey are ready to bring all on board and get PDP to reclaim Anambra State.\nAnambra State is naturally a PDP State."
  },
  {
    "headline": "Nigeria standstill as Buhari’s only son, Yusuf marries his sweetheart in Kano",
    "summarized_story": "President Buhari’s son, Yusuf is getting married to, Zara Nasir Ado Bayero, the daughter of Emir of Bichi, Kano.\nSeveral governors, ministers, government officials and VIPs have been flying to Kano state for the wedding.\nThey are being hosted by the current Emir of Kano who is the older brother of the prospective bride’s father, Emir of Bichi.\nThe bride-to-be, Zara, is a 19-year-old graduate of Brighton University, UK.\nREAD ALSO: Nigerian Bishop makes a comprehensive list of…Her father is the fourth child of the late Emir of Kano, Alhaji Ado Bayero."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "Somalia executes 18 al-Shabab terrorists after court sentence",
    "summarized_story": "Eighteen al-Shabab militants were executed on Sunday in Galkayo town of Mudug, the Puntland State of Somalia, after being sentenced to death earlier by the court.\nThe Chairperson of Puntland state court, Mohamud Abdi Mohamed, said that the court proceedings followed through different stages before the execution.\n“Puntland State Court of Armed Forces executed 18 al-Shabab militants this morning.\nAl-Shabab militants termed the execution as a massacre of innocent civilians by the Puntland state.\nPuntland officials have vowed to bring to justice any member of the terrorist group or those who engage in terrorist activities."
  },
  {
    "headline": "Somalia executes 18 al-Shabab terrorists after court sentence",
    "summarized_story": "Eighteen al-Shabab militants were executed on Sunday in Galkayo town of Mudug, the Puntland State of Somalia, after being sentenced to death earlier by the court.\nThe Chairperson of Puntland state court, Mohamud Abdi Mohamed, said that the court proceedings followed through different stages before the execution.\n“Puntland State Court of Armed Forces executed 18 al-Shabab militants this morning.\nAl-Shabab militants termed the execution as a massacre of innocent civilians by the Puntland state.\nPuntland officials have vowed to bring to justice any member of the terrorist group or those who engage in terrorist activities."
  },
  {
    "headline": "Several IPOB, ESN members killed, three camps destroyed in Imo –Police",
    "summarized_story": "The Nigeria Police Force said several members of the Eastern Security Network and Indigenous People of Biafra had been killed during a shootout in Imo State.\nIt also said three more camps linked to the group were destroyed in different parts of the state.\nThe police, in a statement, said stolen cars, explosives, gun powder, charms, IPOB/ESN flags, ammunition and other weapons were recovered.\n“The Commissioner of Police, CP Abutu Yaro, fdc, commended the efforts of the men and urged them to sustain the tempo.\nIn like manner, (he) thanked Imolites for their support and assured them of the command’s commitment in ensuring a crime-free Imo State.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Several IPOB, ESN members killed, three camps destroyed in Imo –Police",
    "summarized_story": "The Nigeria Police Force said several members of the Eastern Security Network and Indigenous People of Biafra had been killed during a shootout in Imo State.\nIt also said three more camps linked to the group were destroyed in different parts of the state.\nThe police, in a statement, said stolen cars, explosives, gun powder, charms, IPOB/ESN flags, ammunition and other weapons were recovered.\n“The Commissioner of Police, CP Abutu Yaro, fdc, commended the efforts of the men and urged them to sustain the tempo.\nIn like manner, (he) thanked Imolites for their support and assured them of the command’s commitment in ensuring a crime-free Imo State.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Oyedepo: I spent seven hours with cobra in a room unhurt",
    "summarized_story": "Presiding Bishop, Living Faith Church Worldwide, David Oyedepo has recounted how he spent seven hours with a cobra in the same room unhurt.\nAccording to him, God knew he loved him, and that all the devils knew he love God and that God proved perpetually and unending that he truly loved him.\n“I was in my office and a cobra was found in my wardrobe, the third floor of the building and I worked in that floor seven hours in the previous night and the morning when they were cleaning, there was a cobra and it stood up.\nOyedepo said when one becomes a lover of God, the enemy would leave him alone, because every attempt on one’s life would bounce back on him.\nSo, to bring the hand of God to bear on your finances, whatever God says to you to do regarding your finances, do it.”"
  },
  {
    "headline": "McGregor sponsors Irish amateur MMA team to Bulgaria",
    "summarized_story": "UFC star, Conor McGregor has earned the accolades of his compatriots after he donated the cash to pay for the entire Irish amateur MMA team to compete at the Youth World Championships in July.\nAccording to Irish Post.com, McGregor’s donation will pay for Ireland’s 27-man squad along with a staff of 20 coaches to travel to Sofia in Bulgaria.\nThe team will compete in the IMMAF 2021 tournament from July 29 to August 1.\nThe Irish UFC star, who was recently named as Forbes highest-paid athlete, has sent his best wishes to the team ahead of the competition.\nHe said: “Wishing the Irish squad the very best of luck in their quest at the world championships this year!"
  },
  {
    "headline": "Delta Assembly lawmaker Kenneth Ogba in sudden death",
    "summarized_story": "By Jethro IbilekeThe member representing Isoko South Constituency 1, in the Delta State House of Assembly, Kenneth Ogba is dead.\nHis death is coming barely six months after the former Majority Leader of the Delta Assembly, Hon.\nIt was gathered that Ogba died on Sunday evening, at Oleh in Isoko South Local Government Area of the State, after attending a function in the area in the afternoon.\nThe lawmaker was said to have been rushed to a hospital in the town where doctors pronounced him dead.\nSome of his political allies in Isoko confirmed the passage of Ogba to journalists on Sunday night."
  },
  {
    "headline": "Military Bombs Boko Haram, ISWAP Commanders During Meeting",
    "summarized_story": "During a conference around the Lake Chad axis, the Nigerian military bombed Boko Haram and Islamic State West African Province (ISWAP) commanders and leaders.\nBoko Haram and ISWAP camps were hit by Nigerian Air Force jets in Sabon Tumbu, Jibularam, and Kwalaram, according to news reports.\n“Their leaders, including Ali Chakkar and other top ISWAP commanders, were holding a meeting when the attacks were launched.\n“The precision-guided airstrikes coordinated by the Air Task Force Command resulted in the killing of very large numbers of ISWAP and Boko Haram terrorists,” the source said.\n“We don’t differentiate between Boko Haram and ISWAP terrorists as we successfully launched the devastating intelligence-led aerial attacks targeting the terrorists in those locations”, he said."
  },
  {
    "headline": "Aisha Buhari, Children Move To London Ahead Of Buhari’s Medical Trip",
    "summarized_story": "Prior to President Buhari’s medical vacation, Aisha Buhari is anticipated to go out of Nigeria to London, United Kingdom.\nAisha Buhari is expected to join some of her children who have fled Nigeria, according to SaharaReporters.\nPresident Buhari is expected to travel to London with his wife and children on an unspecified date.\n“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nBuhari had previously indicated that his medical trip to London, which had been scheduled for Friday, would be postponed."
  },
  {
    "headline": "What Yorubas, Hausas, Igbos Did When Abuja-Kaduna Train Broke Down – Shehu Sani",
    "summarized_story": "Former federal lawmaker Shehu Sani has described what happened on Saturday when the Abuja-Kaduna train broke down on the way.\nThe train broke down Friday night at Jere village, according to the former lawmaker who represented Kaduna Central Senatorial District.\nAccording to him, the heinous occurrence brought the Igbos, Yorubas, and Hausas together as brothers and sisters, forgetting their differences.\n“Yesterday, our Kaduna-Abuja train broke down at night for many hours near Jere village.\nSani recently chastised Northern organizations for putting a bounty on the head of the Indigenous People of Biafra, Nnamdi Kanu (IPOB)."
  },
  {
    "headline": "BREAKING: Governors, Ministers, Others Storm Emir Of Kano’s Palace For Buhari Son’s Wedding",
    "summarized_story": "Some governors and ministers, as well as other key political figures, are currently meeting at the Emir of Kano’s palace to finalize plans for President Muhammadu Buhari’s son Yusuf’s wedding.\nThe president’s son is marrying Zara Nasir Ado Bayero, the Emir of Bichi’s daughter.\nThe Jigawa State Governor, Abubakar Badaru of Jigawa, led the group to the palace.\nThe present Emir of Kano, who is the older brother of the potential bride’s father, the Emir of Bichi, is hosting them.\nHer father is the fourth child of the late Emir of Kano, Alhaji Ado Bayero."
  },
  {
    "headline": "Insecurity in FCT: UniAbuja, Veritas varsity, COED Zuba, 5 others on red alert",
    "summarized_story": "“As you can see in the school, students are going about their normal businesses without tension, there is calm because there is reasonable security.\nVeritas UniversityAt Veritas University, a privately owned institution, the institution scaled down academic activities, including vacating the students on campus.\nBut the situation at the College of Education, Zuba is almost similar to the UniAbuja as the school’s permanent site is entirely without front and back perimeter fence.\n“We have perimeter fence around the temporary site and also around the permanent site,” a senior staff insisted.\nFrom behind it shares a boundary with the thick bush adjacent to the CCECC, International Cancer Centre along the Lugbe Expressway but with a near nonexistent perimeter fence."
  },
  {
    "headline": "Pictures: Pandomonium as hoodlums attack Enyimba players in Jos after Aba-based club picked point vs Plateau United",
    "summarized_story": "NextInvestors participation in stock market drops in May"
  },
  {
    "headline": "Breaking: 4-star Naija Ratels pick top flight Nigeria Women Football League ticket",
    "summarized_story": "Before even playing their last match versus Adamawa Queens, Naija Ratels FC have already gained promotion to the top flight Nigeria Women Football League (NWFL) after demolishing Gallant Queens 4-0 on Sunday during the playoff championship on matchday three.\nPlayers Yetunde Balogun, Josephine Dzer, Aminat Bello and Adeola Omowodun all got on the score for Naija Ratels.\nPaul Edeh now have nine uninterrupted points.\nThey had won six maximum points after their first two matches against Heartland Queens and Kwara Ladies.\nWith nine points, Ratels are topping the Championship table while Adamawa Queens are trailing with seven points."
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Kumuyi urges Nigerians to connect with God for divine intervention -NigPilot",
    "summarized_story": "…begins 6 days crusade in Abuja, othersAmidst daunting challenges the country grapples with, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi , yesterday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin”, he said."
  },
  {
    "headline": "Population Explosion: If We Don’t Get It Right Now, We Won’t By 2050 – Obasanjo",
    "summarized_story": "Chief Olusegun Obasanjo has asked Nigerian leaders to begin at this moment in the nation’s history, to prepare for and against population explosion.\nSpeaking further about the situation which he says has slowed down national development, Obasanjo expressed worry over the management of the population of the nation.\n“What are we going to do to handle that, how are we going to handle that population?\n“What we need to do is education about population management.\nSome people don’t like saying family planning, but whatever you do, you must manage your population to the benefit of all that is living within your nation,” Obasanjo stated."
  },
  {
    "headline": "Niger Delta Avengers’ Sabre-Rattling Rather Unnecessary, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has said that the threat issued by the Niger Delta Avengers on Saturday is rather unnecessary.\nMr. Adesina said when the Niger Delta and Ijaw National Congress visited the president, issues such as the call for restructuring and the inauguration of a board for the Niger Delta Development Commission (NDDC) were addressed.\nThey said the south-south remains the most underdeveloped region in the country, with their needs and interests “undermined by the failed Nigerian State”.\nHowever, as you know, the process of granting licenses is guided by laid-down rules and regulations, most of which even favour local content and local contractors.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "How FG Will Tax Profits Made By Global Tech Giants In Nigeria – Osinbajo",
    "summarized_story": "Nigeria is set to utilise its legal provisions that empower the Federal Government to collect taxes on profits made in the country by global technology and digital firms not based in the country, but with a significant economic presence here.\n“I think the most important thing is that we must widen our tax net so that more people who are eligible to pay tax are paying.\n“The Finance Act has shown that we are very prepared to ensure that these big technology companies do not escape without paying their fair share of taxation in Nigeria.\nMany of them do incredible volumes here in Nigeria and in several other parts of the region.\nAlso CIT for companies with revenues between N25 and N100m (described in the Act as “medium-sized” companies) has been reduced from 30% to 20%."
  },
  {
    "headline": "SERAP Asks African Commission To Order FG, NASS To Withdraw Bills To Gag Media",
    "summarized_story": "The bills are reportedly sponsored by Chairman, House Committee on Information, Mr Segun Odebunmi (PDP, Oyo State).\nThere are no effective or sufficient local remedies available to the Complainant.”“Nigerian courts do not entertain cases on the legality of anti-media and anti-human rights bills.\nAlso, one of the lawmakers pushing the bills Mr Odebunmi Olusegun has reportedly boasted that ‘No court will stop us from passing the bills.\nThe Nigerian authorities should also give assurances that they will fully implement the resolutions and declarations on freedom of expression, access to information and media freedom in the country.\n4.Undertake a prompt review of Nigerian legal framework and administrative practices on freedom of expression, access to information, and media freedom to ensure their consistency and compatibility with the African Charter, and resolutions and declarations by the African Commission."
  },
  {
    "headline": "NPFL 21: Katsina Utd End Akwa Utd Unbeaten Run, Dakkada Record 3rd Away Win",
    "summarized_story": "Before the matchday 29 fixture at the Muhammadu Dikko Stadium in Katsina, Akwa United were unbeaten in 18 league matches.\nUnbeaten run over for Akwa United but coach Kennedy Boboye’s team still maintained the top position in the league.\nGoing against an unpredictable FC Ifeanyi Ubah team, Coach Ibrahim Musa’s team erased all forms of complacency to get the job done.\nDakkada FC recorded their third away win of the season with a 1-0 victory over Abia Warriors at the Okigwe Township Stadium.\nCoach Imama Amapakabo’s team have now lost 10 times this season while Dakkada FC recorded their 12th win of the season."
  },
  {
    "headline": "UK Health Secretary Matt Hancock resigns over alleged affair with Senior aide",
    "summarized_story": "UK Health Secretary Matt Hancock, has resigned following reports of a secret romance with a Senior aide Gina Coladangelo.\nThe Sun UK published a photo of Hancock purportedly “kissing and embracing Gina Coladangelo” at the Department of Health’s London headquarters.\nHe also admitted that he broke covid-19 guidelines as such, he had to take the lead and stay away from his office.\n“I am writing to resign as Secretary of State for Health and Social Care.\nBBC reports that UK Prime Minister, Boris Johnson felt “sorry” upon receiving Hancock’s resignation letter."
  },
  {
    "headline": "Synagogue Church releases funeral details of T.B Joshua",
    "summarized_story": "The funeral details for Prophet T.B.\nJoshua, the founder of the Synagogue Church of All Nations, who died on June 5 have been released.\nThe Church had announced that the funeral would be completed in a week from July 5 to 11.\nThe church had previously stated that Joshua would be buried at the church, despite the requests of the traditional authorities in Arigidi Akoko, Ondo, where the prophet was born.\nAdvertisementIt also assured its members that worship will not stop at the church following shutdown since Joshua’s demise."
  },
  {
    "headline": "Buhari reacts to demands by Niger Delta Avengers, says sabre-rattling rather unnecessary",
    "summarized_story": "President Muhammadu Buhari has reacted to the Niger Delta Avengers, who recently emerged and threatened to blow critical oil and gas installations in the region unless specific demands were met.\nThe statement reads: “The media was Sunday awash with threats and demands by a group, Niger Delta Avengers, to embark on economic sabotage through bombing of critical oil and gas installations unless certain demands, including development of the Niger Delta, and restructuring of the Federation, were met.\nI thank you for paying this courtesy visit not too long after your election in April, and swearing-in last May.\nAdvertisement“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "Czechs Stun 10-man Netherlands 2-0, Breeze Into Euro 2020 Quarterfinals",
    "summarized_story": "Czech Republic produced an impressive 2-0 victory over Netherlands to make the Euro 2020 quarterfinals on Sunday.\nTomas Holes and Patrik Schick scored in the second half to set up a clash with Denmark in Baku next Saturday for a place in the semifinals.\nNetherlands faced an uphill battle after Matthijs de Ligt was shown a straight red card early in the second half for denying a goalscoring opportunity.\nThe Czechs progress into the last eight of the competition for the first time since Euro 2012.\nWith 10 minutes remaining, the Czechs produced a counter attack and Holes set up Schick to convert from inside the box."
  },
  {
    "headline": "UK Bans Binance in Latest Cryptocurrency Crackdown",
    "summarized_story": "Britain’s financial regulator has ordered Binance, one of the world’s largest cryptocurrency exchanges, to stop all regulated activity and issued a warning to consumers about the platform which is coming under growing scrutiny globally.\nWhile trading of cryptocurrencies is not directly regulated in Britain, offering services such as trading in cryptocurrency derivatives does require authorisation.\nThe FCA has told Binance that by June 30 it must display a notice stating “BINANCE MARKETS LIMITED IS NOT PERMITTED TO UNDERTAKE ANY REGULATED ACTIVITY IN THE UK” on its website and social media channels.\nJapan’s regulator said on June 25 that Binance was operating in the country illegally, a notice posted on Japan’s Financial Services Agency website showed.\nIn April, Germany’s financial regulator BaFin warned the exchange risked being fined for offering digital tokens without an investor prospectus."
  },
  {
    "headline": "Euro 2020: Lukaku vs Ronaldo as Belgium Face Portugal in Spain for Quarter-final Spot",
    "summarized_story": "The world’s number-one ranked side Belgium take on holders Portugal in a standout Euro 2020 tie in Spain for a place in the quarter-finals.\nAll eyes will be on Belgium forward Romelu Lukaku and Portugal captain Cristiano Ronaldo, who have scored eight goals between them at Euro 2020.\nDespite being top of Fifa’s world rankings, Belgium have yet to win a major tournament.\nEuro 2016 winners Portugal made it through to the last 16 as one of the best four third-placed teams.\nPortugal have conceded six goals in three games at Euro 2020 so far, already one more than they did at Euro 2016 when they went on to lift the trophy."
  },
  {
    "headline": "Trump Returns to Rally Stage in Ohio, Urges Votes for Republicans",
    "summarized_story": "Trump has pledged to back those who challenge the 10 legislators in the upcoming Republican primaries.\nSo far, nine of the 10 House Republicans who voted for Trump’s impeachment have drawn primary challengers.\nWe won that election in a landslide.”The crowd chanted “Trump won” and “four more years!\nThe former president also used the Ohio rally to lambast Biden, calling him a “catastrophe” and focusing on the rising number of immigrants crossing over the US southern border – an issue Republicans have zeroed in on to rally their voters.\nRepublican strategist Matt Dole said both Trump and those vying to stay close to him benefited from the public bonhomie on display at the Ohio event."
  },
  {
    "headline": "Covid: Several Countries Reintroduce Restrictions Amid Struggle to Contain Delta Variant",
    "summarized_story": "“There is currently a lot of concern about the Delta variant,” World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus told a Friday news briefing.\nMeanwhile, Russia’s Euro 2020 host Saint Petersburg on Saturday reported the country’s highest daily COVID-19 death toll for a city since the start of the pandemic.\nThis came as Russia has seen an explosion of new cases since mid-June, driven by the Delta variant.\nIn neighbouring Finland, health officials said they had detected a spike in coronavirus infections that was traced to football fans returning from Saint Petersburg.\nIn South Africa, the continent’s worst-hit country, scientists said on Saturday the Delta variant appeared to be dominating new infections."
  }
]