[
  {
    "headline": "Electoral Act: Buhari’s signature won’t change anything, says Galadima",
    "summarized_story": "A member of the Board of Trustees of All Progressives Congress and former ally of the President, Major-General Muhammadu Buhari (retd.\n), Buba Galadima, has expressed distrust in the much-awaited presidential assent to the amended electoral bill.\nHe explained that the president’s assent to the bill won’t change anything should he sign it with reservation and not in whole.\nAccording to him, if Buhari signs any electoral bill with reservations, it means he has not signed the electoral bill.\n“For you, he has assented to the amended 2010 Electoral Act but in the real sense of it, he will take whatever gains the people had put into the electoral act,” Galadima said."
  },
  {
    "headline": "Ukraine: US imposes sanctions on Russia’s natural gas pipeline",
    "summarized_story": "President Joe Biden announced on Wednesday that the United States will join Germany in imposing sanctions on the Russian Nord Stream 2 natural gas pipeline project in retaliation for Moscow’s mounting military pressure against Ukraine.\nThe targeting of Nord Stream 2 — one of energy-rich Russia’s highest-profile geostrategic initiatives — adds to Western sanctions announced by the United States and European allies this week against two Russian banks, several oligarchs and other measures.\nBuilt to funnel Russian natural gas to Germany under the Baltic sea — bypassing the current overland route which traverses Ukraine — Nord Stream 2 has long been controversial.\n“I have directed my administration to impose sanctions on Nord Stream 2 AG and its corporate officers,” Biden said in a statement after Germany announced it was halting the project on Tuesday.\nComing on top of Germany’s earlier decision to block legal certification, the US sanctions doom the project, according to Washington."
  },
  {
    "headline": "First Lady, Aisha Buhari observes plenary as Reps lay constitution review report",
    "summarized_story": "First Lady, Aisha BuhariBy Levinus Nwabughiogu-AbujaThe First Lady of Nigeria, Mrs. Aisha Buhari, Wednesday, observed the laying of 1999 constitution review report at the House of Representatives.\nREAD ALSOIGP procures, orders distribution of uniforms, kits, says welfare of police personnel paramountVanguard leart that beyond the observation, Mrs. Buhari’s subtle august coming to the national assembly was to lobby for more positions for Nigerian women in political hemispheres.\nDetails later"
  },
  {
    "headline": "Nigeria to host 2022 World Toilet Summit in November",
    "summarized_story": "Nigeria has been named as the official host of the 2022 World Toilet Summit, slated for November 2022.\nIn his remarks, the Minister of Water Resources, Suleiman Adamu, noted that the selection of Nigeria as the host country for 2022 World Toilet Summit was a welcome development.\nShe advised that joint commitment towards achieving the World Toilet Summit would take Nigeria to the next level.\nThe private sector, Development Partners and Stakeholders all commended the initiative and pledged their support to host a successful summit.\nThe World Toilet Organization is a global non-profit organization committed to improving toilet and sanitation conditions worldwide."
  },
  {
    "headline": "Russia may invade Ukraine in 48 hours",
    "summarized_story": "U.S. President Joe Biden has warned the Ukrainian government there will be a full-scale Russian invasion of their country in the next 48 hours.\nBiden warned Ukrainian President Volodymyr Zelensky of an ‘imminent’ attack by Vladimir Putin’s troops, just hours after Ukraine was hit by a ‘massive’ cyberattack targeting its government and banks.\nU.S. intelligence chiefs fear Kharkiv, Ukraine’s second-largest city, is at particular risk of being targeted in a Russian invasion as it is close to the Ukrainian-Russian border.\n‘The President of Ukraine has been warned Russia will highly likely begin an invasion within 48 hours based on U.S. intelligence,’ a White House official told Newsweek.\nMeanwhile, the websites of Ukraine’s Ministry of Foreign Affairs, the Ministry of Defence, Ministry of Internal Affairs, the Security Service, and Cabinet of Ministers were all out of action Wednesday afternoon after a cyberattack."
  },
  {
    "headline": "UK to help Ukraine mitigate Russia’s aggression with $500m",
    "summarized_story": "The United Kingdom (UK) Foreign Ministry announced on Wednesday that London was ready to offer Ukraine 500 million dollars loans to support Kiev and help “mitigate economic effects of Russian aggression.”This is contained in a statement by Foreign Secretary Liz Truss.\n“We are putting our money where our mouth is and using Britain’s economic expertise and strength to support the people of Ukraine.\n“These guarantees can help inject vital capital into Ukraine and help its economy weather the storm of Russian aggression,” Truss said.\nThe guarantees of Multilateral Development Bank lending will support economic stability and vital reforms such as tackling corruption.\nThe offer comes on top of increased support for military equipment from the UK ministry of defense and enhanced support to the humanitarian system in Ukraine."
  },
  {
    "headline": "ELECTORAL ACT: Buhari ‘ll sign bill into law before Friday – Sen Abe",
    "summarized_story": "By Olayinka AjayiChieftain of the All Progressive Congress, APC, Senator Magnus Abe, has said he’s optimistic that President Muhamadu Buhari would sign the resubmitted electoral act into Law before Friday.\nAbe, who was fielding questions in a monitored interview on Channels Television, ‘Politics Today’ said: “The clamour of the electoral act is coming into effect based on the reality of what is happening in this country.\n“Whether you like it or not Nigeria’s politics and democracy is evolving, the citizens are getting more aware.\n“This new awareness is what is driving the clamour for the electoral act.\nHe had serially been a victim of a lousy, fraudulent electoral process."
  },
  {
    "headline": "NEMA receives 159 Nigerians from Libya, cautions against ‘greener pastures’",
    "summarized_story": "The National Emergency Management Agency (NEMA), on Wednesday, received 159 Nigerians stranded from Libya.\nNEMA Director-General, Habib Mustapha, represented by the Acting Coordinator, Lagos Territorial Office, Ibrahim Farinloye spoke to the News Agency of Nigeria (NAN).\n“It is normal in life to struggle for better and improved livelihoods but in the struggle, we must avoid endangering our lives.\n“Nigeria is well endowed far more than most countries that young Nigerians are travelling to in seeking greener pastures that are no longer there,” he said.\nThe Nigeria Immigration Service (NIS), Refugee Commission, Federal Airport Authority of Nigeria (FAAN) and the Police also received the returnees."
  },
  {
    "headline": "Without Buhari, Nigeria wouldn’t have been peaceful – Chris Ngige",
    "summarized_story": "Sen. Chris Ngige, the Minister of Labour and Employment, says without President Muhammadu Buhari’s leadership style, the experience of Nigeria would have been like some nations in severe crises.\nNgige, therefore, described leadership as very critical to the survival of any human society.\nNgige made this known in a statement by Mr Charles Akpan, the Deputy Director, Press and Public Relations in the ministry.\nAccording to him, a good leader must be visionary, see things others are not seeing and things that can be projected futuristically and bring them out for implementation.\n“A good leader must be an implementation man; he should be knowledgeable because, after the vision, he will dissect and crystalize them; he should be a jack of all trade and master of all."
  },
  {
    "headline": "Declare suspected terrorists’ leaders wanted – Senate tells FG",
    "summarized_story": "The Senate has urged the Federal Government to declare all suspected leaders of terrorists in the country wanted.\nThis followed the adoption of a motion by Sen. Bala Ibn Na’Allah (APC-Kebbi) and co-sponsored by 12 other senators during plenary on Wednesday.\nPresenting the motion, Na’Allah said that it was no longer news that the bandits were moving in hundreds in the areas terrorizing the people.\n“Apart from calling on security agencies to intensify efforts in the fight against insecurity, leaders should fear God,” he said.\n“There is a limit to what we can do, but we must do what we are supposed to do well."
  },
  {
    "headline": "Independent Observers describe Enugu LG Elections as peaceful, transparent, commend Gov. Ugwuanyi, ENSIEC",
    "summarized_story": "A coalition of accredited independent observers for the 2022 Local Government Elections held in Enugu State, on Wednesday, expressed utmost satisfaction with the conduct of the exercise in the state, describing it as “peaceful, transparent, free and fair”.\nThey commended Governor Ifeanyi Ugwuanyi of Enugu State for his consistency in conducting council elections in the State, describing the Governor as “a true democrat who had effectively ended the use of caretaker chairmen in running the affairs of the local government areas in Enugu State”.\n“It was a peaceful election, so we are happy to see this kind of election in Enugu State.\n“We also want to say here that some states in Nigeria should replicate what we have seen in Enugu State.\nThis is because there are some states in Nigeria that have not conducted LGA elections for the past ten (10) years."
  },
  {
    "headline": "Oando Plc, Duke Oil appear before Reps Committee, clear air on importation of adulterated fuel",
    "summarized_story": "Oil companies, Duke Oil and Oando Plc have denied involvement in the importation of adulterated fuel, which hit the country recently.\n“Duke Oil is engaged in petrol and crude oil products.\n“And then, some remedial actions were taken immediately, Mr Chairman, to conclude the report and give an assurance to this hon.\n“We understand the hardship and inconveniences that resulted from the issue as mentioned earlier, Duke Oil had already taken necessary steps by creating additional layers.\nThanks, Mr. Chairman”."
  },
  {
    "headline": "Youths warn sacked CoS against blackmailing Emmanuel",
    "summarized_story": "Youth leaders from Akwa Ibom South (Eket) Senatorial District have warned the sacked Chief of Staff (CoS) to Governor Udom Emmanuel, Mr. Ephraim Inyang-eyen, to desist from blackmailing the governor.\nThey accused Inyang-eyen of maligning Emmanuel because of the governor’s insistence that the Senate seat of Akwa Ibom South (Eket) must go to Ikot Abasi Federal Constituency.\nInyang-eyen, a former commissioner for Works from Eket Federal Constituency, had indicated his interest to vie for the Senate seat despite it being zoned to Ikot Abasi Federal Constituency.\nThe rift between Emmanuel and his former CoS, Inyang-eyen, deepened yesterday.\nThe governor on Tuesday relieved Inyang-eyen of his duties as the CoS, through a letter signed by the Secretary to the State Government (SSG), Emmanuel Ekuwuem."
  },
  {
    "headline": "Court annuls APC congresses in Anambra",
    "summarized_story": "Anambra State High Court sitting in Awka yesterday nullified wards, local governments and state congresses held by the All Progressives Congress (APC).\nThe party last month conducted congresses, which produced Mr.\nBut delivering judgment in a matter before him, Justice Ike Ogu of High Court four Awka ruled that the exercise contravened initial interlocutory injunction earlier issued by his court.\nThe court said the tenure of wards, local governments and states executives elected during 2018 congresses in Anambra subsisted.\nOgu noted that whatever congress conducted by APC and its representatives in the state while the tenure of the 2018 elected executives subsisted, contravened the order of the court."
  },
  {
    "headline": "Enugu council poll: Two policemen, six others killed as gunmen attack polling units",
    "summarized_story": "Enugu council poll: Two policemen, six others killed as gunmen attack polling unitsAt least two policemen guarding the member representing Nkanu West and Nkanu East Federal Constituency, Nnoli Nnaji, were killed yesterday during the local government elections in Enugu State.\nSix other persons, including three unidentified persons suspected to the hoodlums, were also killed.\nHowever, sources told our correspondent that the policemen were attacked at the home of the lawmaker at Akpugo in Nkanu West Council where they were shot dead.\nThe gunmen, who also attacked polling units at Amagunze in Nkanu East Local Government, had earlier attacked a team of journalists covering the election with a vehicle belonging to the Enugu State Broadcasting Service (ESBS), and snatched the vehicle.\nBesides the attack on the polling units, the election was generally peaceful across the state, with impressive turnout of voters across the 17 local governments."
  },
  {
    "headline": "PHOTOS: First Lady Aisha Buhari leads women to observe proceedings at National Assembly",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "FEC okays N58.427b for roads, agric projects",
    "summarized_story": "The Federal Executive Council (FEC) has approved contracts worth N58.427 billion for road and agricultural emergency intervention projects.\nAddressing State House correspondents after the weekly virtual FEC meeting presided over by President Muhammadu Buhari at the Presidential Villa in Abuja, Works and Housing Minister Babatunde Fashola (SAN) said his ministry obtained an approval for a contract worth N56.175 billion.\nThe minister said the Council also approved the revision of the contract for Afo-Apoto-Oyo boundary road in Kwara State by N251,530,000 – from N3,060,000,000 to N3,311,000,000.\n“The second memorandum was for the revision of the contract for the Apoto-Alfa/Oyo boundary road in Kwara State.\nThe revision was by N251,530,000, which revised the contract sum from N3,060,000,000 to N3,311,000,000,” he said."
  },
  {
    "headline": "Two killed as PDP ward congress turns violence in Osun",
    "summarized_story": "From Lateef Dada, OsogboThe ward congress of the Peoples Democratic Party (PDP) held in Osun State on Wednesday was marred by violence as one Toheeb Agoro and Aremo Olamide, were killed during the exercise.\nIt was gathered that the victims were killed in Iwo and Ipetumodu during the election to select delegates for the governorship primary of the party.\nFindings showed that Agoro was killed at ward 14, Oke Oba 1, Agberire, Iwo, in the morning while Olamide was shot at Ipetumodu and later died in the hospital.\nThe Command’s Public Relations Officer, Assistant Superintendent of Corps (ASC II) Atanda Olabisi, urged residents to go about their duties without fear.\nThe Police Public Relations Officer in the state, SP Yemisi Opalola, also confirmed that one person was killed."
  },
  {
    "headline": "Breaking: LASU governing council reinstates 5 sacked ASUU leaders",
    "summarized_story": "By Gabriel DikeThe Governing Council of Lagos State University (LASU) on Wednesday approved the reinstatement of five sacked union leaders of the Academic Staff Union of Universities (ASUU).\nThe five ASUU-LASU leaders were sacked by the Prof. Adebayo Ninalowo-led governing council under the Vice Chancellor, Prof. Olanrewaju Fagbohun on September 7th, 2017 and September 12th, 2019.\nAt the meeting held on Wednesday, the Sir David Sunmoni-led governing council accepted the recommendations of the Appeal Committee and approved the reinstatement of the five ASUU-LASU leaders.\nThe five reinstated ASUU-LASU leaders are expected to receive their letters next week.\nLoyal ASUU-LASU members yesterday jubilated the reinstatement of their leaders as the news spread round the campus after the governing council meeting."
  },
  {
    "headline": "Gunmen abduct medical doctor in A’Ibom Hospital",
    "summarized_story": "JOE EFFIONG, UYOAs electioneering for 2023 elections gets underway, kidnappers, who for some time now appear to have been disbanded, have suddenly resurfaced with their activities in Akwa Ibom State.\nThe latest incident which happened on Tuesday, has resulted in the kidnap of Dr Felix Ekpo, a senior medical officer attached to Ikot Ekpaw cottage hospital in Mkpat Enin Local Council, who was abducted by unknown gunmen on his duty post.\nSecretary of Nigeria Medical Association in the state, Dr. Ekem Emmanuel John who announced this in a statement in Uyo on Wednesday confirmed that Ekpo was on duty when he was kidnapped .\nThe state reads; “It is with deep anguish that we inform you of the sad kidnap of our dear colleague and Hippocratic brother, Dr. Felix Ekpo.\nenvironment of Akwa Ibom State- which has made him stay back to medically serve our country inspite of the lure of greener pastures made available by the UK, the USA, Saudi Arabia , UAE, Oman, Kuwait etc."
  },
  {
    "headline": "NNPC releases distribution details of 387.5 million litres of petrol to solve scarcity",
    "summarized_story": "As the scarcity caused by the withdrawal of methanol-blended petrol into the country eases off, the Nigerian National Petroleum Company Ltd has released details of how it distributed a total of 387.59 million litres of Premium Motor Spirit in one week to bridge the gap.\nAccording to NNPC, the petrol distributed through retail filling stations from February 14 to 20, 2022, represents an average daily distribution of 55.4 million litres.\nThe NNPC said the top 20 high loading depots used are Pinnacle-Lekki which evacuated the highest volume of 70.8 million litres; NIPCO (22.6 million litres), AITEO (22.3 million litres), Swift (16 million litres), 11 PLC (15.9 million litres), Bovas Bulk (15 million litres) and Frado (14.6 million litres).\nOthers are Keonamex (13.7 million litres), MRS Ltd (11.9 million litres), Rainoil (11.6 million litres), AYM Shafa (11.2 million litres), TSL (11.2 million litres), Rainoil Lagos (11.2 million litres), and Matrix (10 million litres), Conoil Lagos (9.7 million litres), AA Rano (8.8 million litres), Bluefin (8.4 million litres), HOGL (8.2 million litres), Ibafon Calabar (8 million litres) and Mainland (7.5 million litres).\nThe product was purchased from International Trader, LITASCO and delivered through the LITASCO loading port terminal in Antwerp in Belgium."
  },
  {
    "headline": "BREAKING: Court orders forfeiture of 10 properties, funds linked to ex-Zamfara governor",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court in Abuja has ordered the interim forfeiture of about 10 properties and funds in banks allegedly owned by a former governor of Zamfara State, Abdulaziz Yari.\nJustice Obiora Egwuatu gave the order while ruling in an ex-parte application by a lawyer to the Independent Corrupt Practices and other related offences Commission (ICPC), Osuobeni Ekoi Akponimisingha.\nRegular individuals can earn as low as $300 daily Find out how it works.\nJustice Egwuatu said the interim order granted would last for 60 days to enable the ICPC to conclude its investigation, following which the commission could apply for final forfeiture.\nSome of the properties, according to the ICPC, are in Maryland (USA), Abuja, Kaduna, among others."
  },
  {
    "headline": "Just in: Mutawalle Picks Senator Nasiha as Zamfara Deputy Governor",
    "summarized_story": "By Onuminya InnocentFollowing the impeachment of Zamfara State Deputy Governor, Barrister Mahdi Aliyu Gusau, Senator Hassan Nasiha representing Zamfara Central in the National Assembly has been confirmed by the Zamfara State House of Assembly as the deputy governor designate of the State.\nThe nominee, who was nominated by Governor Bello Mutawalle, was asked to take a bow and leave in line with the tradition of the house.\nThe 20 State’s lawmakers unanimously resolved to confirm the deputy Governor nominee, senator Hassan Nasiha given his track records as a politician, seasoned administrator and his wealth of knowledge in public service.\nThe deputy governor designate wil be sworn -in later today (Wednesday) as the new Deputy Governor of Zamfara State.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Zamfara Assembly Impeaches Deputy Governor Gusau",
    "summarized_story": "By Onuminya InnocentThe Zamfara state House of Assembly on Wednesday impeached the embattled Deputy Governor, Barrister Mahdi Aliyu Gusau.\nReceiving the report the speaker of the House of Assembly Nasiru Muazu said the House would expedite action on the report.\nAfter some hours, the House conducted the impeachnent proceedings against the Deputy Governor .\nAt the time of filing this report, no reaction come from the camp of the deputy governor nor the Peoples Democratic party.\nHe had since been having a running battle with Govenor Bello, who is believed to have intigated the impeachment proceedings in the Assembly."
  },
  {
    "headline": "Breaking: Aisha Buhari Witnesses Submission of Constitution Review Report in Senate",
    "summarized_story": "Sunday Aborisade, AbujaFirst Lady of Nigeria, Mrs Aisha Buhari, was welcomed into the chamber of the Senate at exactly 11.58am on Wednesday.\nShe was in the Red Chamber to witness the laying of the report on 1999 Constitution Review.\nIt was envisaged that one of the provisions in the amendment was on women political empowerment.\nSenate President, Ahmad Lawan, welcomed the First Lady and her entourage.\nOn her entourage were the Women Affairs Minister, Mrs. Pauline Tallen, and the Minister of Finance, Zainab Ahmad, among othersDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Citing Emergence of Previous Chairmen, Buhari Okays Consensus for APC Convention",
    "summarized_story": "And we have in the past done them with national convention, but nothing again in the constitution stops them from being done outside the national convention.\nOther positions zoned to the North-central are National Vice Chairman (NC), Deputy National Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader and Zonal Special (Persons with Disability- PWD) Leader.\nFor the North-west, the positions given are National Vice Chairman (NW), National Legal Adviser, National Organising Secretary, National Financial Secretary, Deputy National Youth Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, zonal Women Leader, and Zonal Special (Persons with Disability – PWD) Leader, among others.\nNorth-east would produce Deputy National Chairman (N), National Auditor, National Vice Chairman (NW), Deputy National Financial Secretary, Deputy National Women Leader, Zonal Secretary, Zonal Youth Leader, among others.\nDeputy National Youth Leader6."
  },
  {
    "headline": "News in Photographs: Buhari, APC Govs Meet",
    "summarized_story": "President Muhammadu Buhari Tuesday met with governors elected on the platform of the All Progressives Congress at the State House Abuja.\nThe meeting held in the Council Chamber was also attended by Vice President Yemi Osinbajo.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: 2023: Central Bank Governor, Emefiele Brings In Three Airplanes For Presidential Campaign, Asked To Resign By Buhari Government Cabal",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr Godwin Emefiele, who is preparing for the 2023 presidential race has brought in three aircraft for his campaign, SaharaReporters can authoritatively report.\nSaharaReporters learnt that Emefiele had also been asked by the cabal in the Muhammadu Buhari presidency supporting his infamous ambition to tender his resignation and focus on his presidential campaign.\nIndeed, it started with the recent FCT mega rice pyramid, an initiative under the RIFAN/CBN anchor borrowers’ programme, but used to sell the candidacy of the CBN governor.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others."
  },
  {
    "headline": "EXCLUSIVE: 2023: Central Bank Governor, Emefiele Brings In Three Airplanes For Presidential Campaign, Asked To Resign By Buhari Government Cabal",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr Godwin Emefiele, who is preparing for the 2023 presidential race has brought in three aircraft for his campaign, SaharaReporters can authoritatively report.\nSaharaReporters learnt that Emefiele had also been asked by the cabal in the Muhammadu Buhari presidency supporting his infamous ambition to tender his resignation and focus on his presidential campaign.\nIndeed, it started with the recent FCT mega rice pyramid, an initiative under the RIFAN/CBN anchor borrowers’ programme, but used to sell the candidacy of the CBN governor.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others."
  },
  {
    "headline": "Leaked Audio: Brother Of Nigerian Navy Admiral Wanted For N2billion Fraud Narrates How Judge Sought Bribe, Anti-graft Agency, EFCC Official Paid N3million",
    "summarized_story": "In an audio recording exclusively obtained by SaharaReporters, Abdulbar, a banker was heard telling Yusuf that the judge was not paid any money.\nThen, when they met with the EFCC Head of Legal before everything, all payment made to him (Head of Legal) was N3 million while he was to be paid N5 million.\nUntil now, they have not paid the balance of the money that was supposed to be paid to him.\n“So, the judge (Justice Ijeoma Ojukwu) was given nothing, because the lawyer said even the judge approached him.\nSo, that is the thing we are also going after now because we were told she is the wife of Ojukwu (Justice Ijeoma Ojukwu) and she do (sic) collect bribe."
  },
  {
    "headline": "Leaked Audio: Brother Of Nigerian Navy Admiral Wanted For N2billion Fraud Narrates How Judge Sought Bribe, Anti-graft Agency, EFCC Official Paid N3million",
    "summarized_story": "In an audio recording exclusively obtained by SaharaReporters, Abdulbar, a banker was heard telling Yusuf that the judge was not paid any money.\nThen, when they met with the EFCC Head of Legal before everything, all payment made to him (Head of Legal) was N3 million while he was to be paid N5 million.\nUntil now, they have not paid the balance of the money that was supposed to be paid to him.\n“So, the judge (Justice Ijeoma Ojukwu) was given nothing, because the lawyer said even the judge approached him.\nSo, that is the thing we are also going after now because we were told she is the wife of Ojukwu (Justice Ijeoma Ojukwu) and she do (sic) collect bribe."
  },
  {
    "headline": "Supreme Court Bars Ex-Attorney General, Aondoakaa For Life From Holding Public Office In Nigeria",
    "summarized_story": "A former Attorney-General of the Federation and Minister of Justice, Michael Aondoakaa, a Senior Advocate of Nigeria, has been barred from holding public office in the country for life.\nIn the Court of Appeal’s judgement on June 1, 2010, Justice A.F.A.\nPublic office is a sacred trust and an Attorney General should epitomize all that is good and noble in the legal profession.\nThat office should never again be occupied by individuals of such poor quality as the appellant.\nNotwithstanding Aondoakaa’s letter, the President of the Court of Appeal went ahead by setting up a new panel of judges in compliance with the order of the court."
  },
  {
    "headline": "Emefiele opens Twitter account, denies buying jets for presidential campaign",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), has denied purchasing aircraft to support a campaign for him to contest the presidency in 2023.\nOnline reports had surfaced earlier on Wednesday indicating that the CBN governor had bought “three airplanes” for his presidential campaign, and that he had also been asked to resign from his position.\nHowever, the CBN governor, who opened a Twitter account on Wednesday, denied the claim.\nAdvertisementThe development comes days after the CBN governor spoke on the calls for him to contest the presidency in 2023.\nAdvertisement“And given that it’s God that anoints leaders, he will leave his faith (sic) firmly in the hands of God.”"
  },
  {
    "headline": "Emefiele opens Twitter account, denies buying jets for presidential campaign",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), has denied purchasing aircraft to support a campaign for him to contest the presidency in 2023.\nOnline reports had surfaced earlier on Wednesday indicating that the CBN governor had bought “three airplanes” for his presidential campaign, and that he had also been asked to resign from his position.\nHowever, the CBN governor, who opened a Twitter account on Wednesday, denied the claim.\nAdvertisementThe development comes days after the CBN governor spoke on the calls for him to contest the presidency in 2023.\nAdvertisement“And given that it’s God that anoints leaders, he will leave his faith (sic) firmly in the hands of God.”"
  },
  {
    "headline": "Each state should control its resources, says Akinwumi Adesina on restructuring",
    "summarized_story": "Akinwumi Adesina, president of the African Development Bank (AfDB), says restructuring Nigeria should be focused on ensuring economic viability of states.\nAccording to Adesina, restructuring shouldn’t be done on the basis of sentiments or political inclinations.\nRestructuring should not be driven by political expediency, but by economic and financial viability — the necessary and sufficient conditions for political viability,” he said.\nIt allowed graduates from tertiary institutions to have one year of national service, largely (ideally) outside of their places of origin,” he said.\n“The real test, however, of ‘national service’ is that it often revealed the lack of inclusiveness."
  },
  {
    "headline": "Each state should control its resources, says Akinwumi Adesina on restructuring",
    "summarized_story": "Akinwumi Adesina, president of the African Development Bank (AfDB), says restructuring Nigeria should be focused on ensuring economic viability of states.\nAccording to Adesina, restructuring shouldn’t be done on the basis of sentiments or political inclinations.\nRestructuring should not be driven by political expediency, but by economic and financial viability — the necessary and sufficient conditions for political viability,” he said.\nIt allowed graduates from tertiary institutions to have one year of national service, largely (ideally) outside of their places of origin,” he said.\n“The real test, however, of ‘national service’ is that it often revealed the lack of inclusiveness."
  },
  {
    "headline": "Ngige: Nigeria would be in crisis like Venezuela without strong leader like Buhari",
    "summarized_story": "Chris Ngige, minister of labour, says Nigerians would have become refugees in Cameroon and Niger but for the “strong leadership” of President Muhammadu Buhari.\nNgige spoke on Wednesday after his induction as an honorary fellow of the Institute of Leadership, Entrepreneurship and Corporate Governance (INSLEC) in Abuja.\nThe minister also said without Buhari’s leadership qualities, the country would be in a crisis like Venezuela.\nVenezuela has been grappling with political instability and economic crisis for the past few years.\nI know that if we don’t have the kind of leader that we have who is strong like President Muhammadu Bihari, the experience of Nigeria would have been like that of Venezuela."
  },
  {
    "headline": "Polygon’s $450 million raise will enable it build developer ecosystems across the globe",
    "summarized_story": "Last month, Polygon raised $450 million, to expand its portfolio of ethereum scaling solutions and footprints in the developer ecosystem.\nAs of today, it has processed 3.4 billion transactions and last month claims its 3 million transactions per day volume is double that of ethereum.\nSandeep Nailwal, Polygon co-founder has said that its $450 million funding is to help Polygon build larger developer ecosystems in several markets.\nOne of the developer ecosystem expansion strategies is to establish Polygon Guilds, a structure that will help educate “Web2 developers” and onboard them to Web3.\nEarlier this month, Polygon created the Polygon Academy, which intends to be a comprehensive guide for anybody that wants to understand Web3."
  },
  {
    "headline": "Solving Africa’s tech talent problem: All hands on deck",
    "summarized_story": "“In the past 6 weeks, we’ve been hiring for 15 roles and have only been able to fill 4.\nBuilding on lessons from Andela and companies like Decagon and Semicolon involved in training African tech talents, Adewale Yusuf decided to co-found TalentQL in 2020.\nThis led to the creation of a training programme called Pipeline, a 6-month coaching programme focused on technical and soft skills.\nAltSchool Africa’s maiden edition has over 9,000 applicants from over 17 countries, with the top countries represented being Nigeria, Ghana, Kenya, and Uganda.\nI share a few thoughts, alight and slowly walk away, thinking about how there are others like Josephs out there."
  },
  {
    "headline": "TradeDepot acquires Accra-based Green Lion as African tech M&A heats up",
    "summarized_story": "TradeDepot, a leading B2B e-commerce and embedded finance platform in Africa, on Wednesday said it has acquired Green Lion, a competitor which it describes as the biggest and fastest-growing B2B e-commerce platform in Ghana.\nThe move is meant to help TradeDepot accelerate the delivery of its services across the West African country.\nFounded in 2018, Green Lion enables digital commerce for neighbourhood retailers in Ghana.\nTradeDepot will take on all existing Green Lion Africa relationships and assets in Ghana, the company said.\nThe TradeDepot-Green Lion deal is the latest in a string of acquisition deals the African tech landscape has witnessed since the year began."
  },
  {
    "headline": "Quick Fire🔥with Fu’ad Lawal",
    "summarized_story": "Fu’ad Lawal is the Growth Lead at Eden Life.\nNa God dey give customer, but na person dey go find am.\n[God gives us customers but we still need to find them]What’s the best advice you’ve ever received in your career?\nWhat’s the oddest job you’ve ever done?\nA genie gives you one wish for the African tech ecosystem, what would yours be?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Digitising informal retail in Africa",
    "summarized_story": "Share this article:Hello there,Since inception, we at Techpoint Africa have contributed to the growth of the African tech ecosystem.\nWe’re discussing how to spot NFT scams and MarketForce’s $40 million war chest.\nFortunately, our reporter, Bolu Abiodun has some tips on identifying NFT scams, and you can read all about it in Wash trading scams and money laundering; why NFT traders should be careful.\nMarketForce is not the only startup digitising the informal retail experience, with TradeDepot, SokoWatch, Omnibiz, and Alerzo doing the same.\nWhat else I’m readingHere’s what actually happens to all your online shopping returnsThe moral calculations of a billionaireOpportunitiesAltSchool Africa is hiring."
  },
  {
    "headline": "Wash trading scams and money laundering; why NFT traders should be careful",
    "summarized_story": "What is NFT wash trading?\nHow to spot NFT wash tradingEtherscan screenshot that shows a completed wash trade.\nSource: ChainalysisKnowing how blockchain works is required to spot or track NFT wash trading.\nAdvertisementInterestingly, Chainalysis tracked wash trading activities with blockchain analysis, which revealed how sellers go about their wash trading activities.\nNFT wash trading is sort of like a WhatsApp vendor sending you money to buy their products to make it seem like they’re making sales."
  },
  {
    "headline": "Techpoint Pitch Friday is back!",
    "summarized_story": "Share this article:After a long hiatus, Techpoint Pitch Friday is back.\nPitch Friday takes place on the second Friday of every month and provides an avenue for aspiring and existing entrepreneurs to share their businesses or ideas with an audience.\nSome of them include Kelvin Umechukwu of Bumpa, Abolarinwa Adegunloye of Arteasy, winner of the Most Outstanding Marketplace award at Techpoint Awards 2021, and Femi Aiki of Foodlocker, a Techpoint Pitchstorm alumnus.\nFor example, say you’re looking to raise from investors, you could get feedback that could help you refine your pitch.\nAll you have to do is register to pitch your startup here or as a part of the audience here, then save the date in your calendar."
  },
  {
    "headline": "What we now know about Nigeria’s dirty fuel saga",
    "summarized_story": "What we now know about Nigeria’s dirty fuel sagaThe current dirty fuel saga has raised tension across major cities in Nigeria on account of high methanol in the petrol distributed in the country.\nThe process of recalling the tainted batch led to fuel scarcity and the consequent hike in prices and distrust from the public.\nThe Nigerian National Petroleum Company (NNPC) Limited has recognized four firms as being guilty of importing the tainted gasoline into the country.\nWhile noting this, on Thursday, February 17, Nigerian National Petroleum Company (NNPC) Limited affirmed that five Nigeria-bound petrol-laden vessels from Belgium were turned back.\nHe warned that if the same error had occurred with aviation fuel, the results would have been disastrous."
  },
  {
    "headline": "Nigeria suspends planned $4bn Eurobond sale",
    "summarized_story": "A $4 billion Eurobond sale by the Nigerian government has been delayed due unfavourable market conditions, sources familiar with the matter told Business Day.\nThe sale which was scheduled for today was supposed to help ease a crunching dollar shortage in Africa’s largest economy and finance the government’s spending plans for 2022.\nRising interest rates in developed markets has dampened appetite of foreign investors for risky emerging and frontier market assets.\nIn Nigeria’s case, rising oil prices should have been enough to sway investor sentiment in favour of Africa’s top oil producer, but an expensive petrol subsidy practice has wiped out the gains of the highest oil price since 2014.\nRead also: For first time, investors dump Nigeria Eurobonds despite oil rallyYields on Nigeria’s existing Eurobonds are rising despite Brent crude being only a short crawl away from $100 per barrel, at $97."
  },
  {
    "headline": "Electoral Bill: Buhari meets Lawan, Gbajabiamila, Yakubu, swears in new INEC commissioners",
    "summarized_story": "President Muhammadu Buhari on Wednesday met with top members of the National Assembly led by Senate President Ahmad Lawan and Femi Gbajaboamila, speaker of the House of Representative over the Electoral amendment Bill, 2022.\nRecall that the Presidency had on Monday revealed that the President was yet to sign the Electoral amendment Bill, as he was still consulting stakeholders.\nThe President however proceeded to swear in the newly approved INEC Commissioner without making any statement on the Electoral amendment Bill.\nRead also: Democracy in jeopardy as Buhari sits on Electoral BillThe bill which was passed recently was sent to the President for his assent on the 31st of January.\nIssues addressed in the new Bill include the controversy over direct and indirect primary election methods."
  },
  {
    "headline": "Obaseki sends criminal law, disability rights bills, three others to Edo Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…bans external candidates from writing exams in EdoThe Edo State Governor, Mr. Godwin Obaseki, has sent five bills to the Edo State House of Assembly, including the Disability Rights Bill which seeks to end all forms of discrimination against persons with disabilities.\nHe also sent the Electricity Commission and Agency Bill that aims to increase access to electricity to all Edo residents.\nThe Edo State Commissioner for Communication and Orientation, Mr. Andrew Emwanta, disclosed this to journalists after the weekly Edo State Executive Council (EXCO) meeting presided over by Governor Godwin Obaseki, at the Government House, Benin City.\nOther bills are the Edo Property Development Agency (EDPA) Bill, the Criminal Law Bill of Edo State, and the Justice Reform Bill.\n“This affects West African Examinations Council (WAEC) and National Examination Council (NECO), Junior Secondary school as well as primary six exams."
  },
  {
    "headline": "Obaseki boosts emergency services, takes delivery of ultra-modern fire trucks from NPDC …recruits, trains more firemen in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Wednesday, took delivery of an additional ultra-modern industrial-sized fire truck from the Nigerian Petroleum Development Company Limited (NPDC) to boost the state’s response to fire emergencies.\nHe said the state has recruited and is training more firemen with the support of the Federal Fire Service to enhance their capacity for first responder services.\nObaseki noted, “Today, we have received an ultra-modern fire truck donated by the NPDC.\n“More importantly, we are re-training our firemen and NPDC has gladly accepted to provide additional training aside from the provision of a fire truck.\nBefore now, we all knew what was going on in the state regarding fire, and we are also aware that NPDC is a partner to the Edo State Government."
  },
  {
    "headline": "Relocation of Loading Point: Edo Community gives Seplat 90 days ultimatum – Nigerian Observer",
    "summarized_story": "“We are still asking that the gas loading point that the Seplat is taking to Mosogar should be returned; you cannot be exploring gas in Oben and then take the loading point to Mosogar; we will not allow that.\n” They should come and build the loading point in Oben and if the road is the problem, they can as well do a dua carriage way for us.\nOmokaro also alleged that the multinational firm has constantly marginalized its host communities in various ways and therefore called for a reversal of such trend.\nWe have about 68 oil wells head and a gas oil field as well.\n“We have a flow station; we have a compression station; we have a gas plant as well."
  },
  {
    "headline": "How Edo inventors developed 5,000 litres per day locally-made modular refinery …seek investors to commercialise products – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe ongoing Edo Technology and Innovation Expo has continued to showcase the innovative potentials of researchers in Edo State, with inventors thrilling participants with their ingenious innovations aimed at proffering solutions to societal problems.\nSome of the inventions at the five-day expo include an automatic fingerprint machine; a 5,000 litre/per day locally-made modular refinery capable of producing engine oil, kerosene, fuel and gas; a one-ton truck, and a pyrolyzer, among others.\nThe modular refinery developed by the Edo State University, Uzairue, according to the inventors, has the capacity of refining 5,000 litres of crude into engine oil, kerosene, fuel and gas.\nA spokesperson for the Edo State University developers, Mr. Prosper Ikhazuangbe noted, “It took us about a year and two months to come up with this setup.\nAs it is now, it can produce engine oil, kerosene, fuel and cooking gas."
  },
  {
    "headline": "LG Election: Gunmen unleash mayhem in Enugu, kill five",
    "summarized_story": "About five persons were feared killed when gunmen attacked two polling units.\nThe gunmen who stormed Amagu Obeagu Polling Unit in Enugu South Local Government and killed three individuals while also setting vehicles ablaze.\nThey subsequently proceeded to The gunmen to another polling unit at Akpugo in Nkanu West Local Government Area and attacked voters.\nIn all about five persons were killed by the gunmen who disrupted the voting exercise by destroying electoral materials after chasing away voters.\nFrom there they went to another polling unit and killed many people.”The news crew of the Enugu State Broadcasting Service (ESBS) was also attacked at Obeagu."
  },
  {
    "headline": "Zamfara gov appoints Muhammad Nasiha as new deputy governor",
    "summarized_story": "Governor of Zamfara State, Bello Mohammed Matawalle, has nominated Senator Hassan Muhammad Nasiha as new Deputy Governor of the state.\nThis follows the impeachment of Barrister Mahdi Aliyu Gusau on Wednesday by the state House of Assembly.\nThe governor sent a letter to the state Assembly, seeking the screening of Nasiha.\nSpeaker of the House, Honourable Nasiru Muazu Magarya, read the governor’s letter at plenary on Wednesday.\nFirst elected a senator in 2007, Nasiha currently represents Zamfara Central in the National Assembly."
  },
  {
    "headline": "Engage in ritual killings, face full wrath of the law – Abiodun warns Ogun people",
    "summarized_story": "Ogun State governor, Prince Dapo Abiodun, has warned the people of the state against engaging in ritual killings, noting that anyone caught in the practice would face the full weight of the law.\nRitual killings have become prevalent in the country in recent years with Ogun being one of the worst affected states.\nAbiodun who took to his twitter account @dabiodunMFR to issue the warning on Wednesday, said, “Let me warn again, for the umpteenth time that anybody caught engaging in ritual killings and other crimes will be made to face the wrath of the law.”"
  },
  {
    "headline": "BREAKING: Zamfara Deputy Governor, Gusau Impeached",
    "summarized_story": "The Zamfara state House of Assembly has voted for the impeachment of the state Deputy Governor Barrister Mahdi Aliyu Gusau.\nAt Wednesday’s plenary, 20 out 24 members voted for the impeachment of the Deputy Governor after the report submitted by the judicial panel of investigation found him guilty of the allegations levelled against him.\nThe report was read by the Speaker of the Assembly Honorable Nasiru Muazu Magarya.\nThe impeachment comes amid rift between the deputy governor and the state governor, Bello Matawalle over the former’s refusal to join the All Progressive Congress from the People’s Democratic Party with the latter.\nMore subsequently…"
  },
  {
    "headline": "PDP Ward Congresses Turn Bloody In Osun As 2 Die, Others Injured",
    "summarized_story": "The Osun State Police Command, on Wednesday, confirmed the death of one Toheeb Mutalib of Ward 14, Iwo local government area of Osun State during the ward congresses of the Peoples Democratic Party (PDP) in the state.\nBesides, another person was reportedly killed during the same exercise at Ipetumodu in Ife North local government area of the state.\nThe two factions of the party led by Hon.\nSunday Bisi and Barrister Wale Ojo had locked horns in battle of supremacy across all the 332 wards in the state before the congresses fixed for Wednesday.\nMeanwhile, Opalola disclosed that no fewer than three people were in police net in connection with the killings."
  },
  {
    "headline": "Fani-Kayode’s Medical Report Is Fake, Abuja Hospital Tells Court",
    "summarized_story": "Kubwa General Hospital, Abuja, on Wednesday, told a Lagos State Special Offences Court sitting in Lagos that a medical report presented in court by a former Minister of Aviation, Femi Fani-Kayode, was not issued by it.\nAt the resumed hearing of the matter on Wednesday, Amah claimed that the doctor that purportedly signed the medical report is not a medical doctor at Kubwa General Hospital.\nHe replied “He is a staff of Kubwa General Hospital.\nHas your facility issued any other medical report about this defendant?\n“The name is not even found there.”The witness also said,’’ the doctor that signed the medical report is not our doctor."
  },
  {
    "headline": "Lawmaker Rescues 17 Ebonyi Children Trafficked To Ogun",
    "summarized_story": "The Member respresenting Ikwo/Ezza federal constituency of Ebonyi State in the House of Representatives, Comrade Chinedu Ogah, has rescued 17 teenagers of Ebonyi origin, who were trafficked to Ogun State for menial jobs and prostitution.\nThe trafficked teenage victims hail from different villages in Ikwo and Ezza South local government areas of Ebonyi State.\n“I got the news of child trafficking of Ebonyians in Ogun State, and when I learned of it, I alerted the Ikwo Town Union in Lagos State.\nThey abandoned their businesses and mobilised to Ogun State which they spent up to two weeks to locate the children.\n“These children are from Ikwo, Ezza South, and other parts of Ebonyi State."
  },
  {
    "headline": "Nigerian Youths Begin Campaign Against Ritual Killing",
    "summarized_story": "Nigerian youths, under the auspices of Nigerian Youths Congress (NYC), have began a campaign against ritual killing among youths in the country.\nLaunching the campaign in Asaba, Delta State on Wednesday, the director of youth sensitisation and rehabilitation affairs of the congress, Lucky Udu, noted that ritual killing is a crime against humanity.\nUdu, who is also, the president of Lucky Udu Foundation, stated that ritual killing was never common amongst Nigerian youths even as he expressed shock as to where the good and hard-working Nigerians have got this “make-it-quick” syndrome.\nAccording to him, “Honestly, it is worrisome and challenging to see our youths, known for hardwork, engage in ritual activities.\nHe also advised youths to believe in themselves and to have confidence about the future, assuring them of a better Nigeria in the nearest future.OkayADVERTISEMENT"
  },
  {
    "headline": "Court Orders Interim Forfeiture Of Ex-Governor Yari’s Properties",
    "summarized_story": "Justice Obiora Egwuatu of a Federal High Court in Abuja, has ordered the interim forfeiture of about 10 properties and funds in banks allegedly owned by a former Zamfara State governor, Abdulaziz Yari.\nThe court gave the order in his ruling on an ex-parte application by a lawyer to the Independent Corrupt Practices and other related offences Commission (ICPC), Osuobeni Ekoi Akponimisingha.\nJustice Egwuatu said the interim order granted would last for 60 days to enable the ICPC to conclude its investigation, following which the commission could apply for final forfeiture.\nThe judge ordered the ICPC to publicise the order for any person or persons with interest in the affected properties to show cause within 14 days why they should not be permanently forfeited to the Federal Government.\nSome of the properties, which allegedly belong to Yari, according to the ICPC, are in Maryland (USA), Abuja, Kaduna, among others."
  },
  {
    "headline": "Without Buhari Nigeria would have been in crisis– Ngige",
    "summarized_story": "By Joan NwagwuSen. Chris Ngige, the Minister of Labour and Employment said if not because of President Muhammadu Buhari’s leadership style, Nigeria would have been in severe crises.\nNgige said this after his induction as a Distinguished Honorary Fellow of the Institute of Leadership, Entrepreneurship and Corporate Governance (INSLEC) on Wednesday in Abuja.\nNgige said Nigeria is passing through hard times not because of the current government, but as a result of poor planning over the years.\nNgige said that the citizens of Nigeria would have spilled into the Cameroons, Niger and other places as refugees.\n“So, we have to be grateful to the government and our leader, President Muhammadu Buhari, for standing firm that we will not import food anymore here."
  },
  {
    "headline": "Ex-governor Wada denies dumping PDP for TNM",
    "summarized_story": "Former Kogi State governor, Alhaji Idris Ichalla Wada has denied media report that he has dumped the Peoples Democratic Party, PDP, for the newly launched political group, The National Movement, TNM, founded by Senator Musa Rabiu Kwankwaso from Kano State.\nWada attended the launch of the group in Abuja on Tuesday, fueling speculations about his membership.\nWada, who lost second term governorship bid to the late Prince Abubakar Audu in November, 2015 election said he remains a strong member of the PDP.\nAlfred Bello was also quoted to have said, “it was a good development for the PDP”, while he boasted that the party remains unshaken.\nPDP in Kogi State called on all members to disregard the mention of H.E Capt."
  },
  {
    "headline": "VIDEO: Gov. Matawalle Swears In New Zamfara Deputy Governor, Senator Hassan",
    "summarized_story": "Governor of Zamfara State, Hon Bello Mohammed Matawalle, has sworn in the new Deputy Governor of the state, Senator Hassan Mohammed Gusau.\nDelivering his speech at the Councils Chamber, Government House, Gusau on Wednesday, the Governor said following the impeachment of the immediate past Deputy Governor by the State House of Assembly, it became imperative to fill the vacancy as provided for by section 191, subsection 3 of the 1999 Constitution.\nAccording to him, the person who should occupy the position of Deputy Governor should be an able lieutenant, loyal, credible and politically astute and relevant.\n“This is the reason why after a wide range of consultation across the broad political spectrum, it was agreed that distinguished Senator Hassan Mohammed Gusau should be nominated for the position of Deputy Governor of Zamfara State, to which he was just sworn in following the confirmation of the State House of Assembly,” Governor Matawalle said.\nAs you know, the most formidable challenge before us is that of more than a decade-old banditry."
  },
  {
    "headline": "BREAKING: Five Feared Killed As Gunmen Attack Polling Units In Enugu",
    "summarized_story": "Gunmen razed one of the vehicles in Enugu on Wednesday.\nDuring separate attacks at two polling units in Enugu South and Agbani council areas of Enugu State, unidentified gunmen are said to have killed five people, injured several more, and set fire to vehicles.\nAlthough, the election which was marred by apathy, was largely peaceful except in Aninri, Awgu, Nkanu West and Enugu South where hoodlums reportedly rained terror.\nSources told PUNCH Metro that the gunmen invaded the polling units at Obeagu ward III in Enugu South Local Government Area and another polling unit at Akpugo in Nkanu West LGA, and disrupted the exercise.\nThey also burnt two vehicles belonging to community members who came to exercise their suffrage, the source added."
  },
  {
    "headline": "Breaking: Nigeria Super Falcons Beat Lady Elephants 1-0, Qualify For AWCON",
    "summarized_story": "Nigeria’s Super Falcons scored a late goal to win 1-0 and earn a spot in this year’s Africa Women Cup of Nations in Morocco.\nFollowing the victory in Abuja last Friday, the Super Falcons stunned the Ivorians with an 88th minute strike at the Stade Robert Champroux in Abidjan to win 3-o on aggregate, thanks to resolute defending and goalkeeper Chiamaka Nnadozie keeping out a spot kick."
  },
  {
    "headline": "2023: Bauchi Gov, Mohammed Visits Obasanjo, Says PDP Not Threatened By APC’s Zoning",
    "summarized_story": "Bauchi State Governor, Bala Mohammed, visited former President Olusegun Obasanjo in Abeokuta, the Ogun State capital, on Wednesday.\nMohammed, who met Obasanjo behind closed doors, spoke with newsmen after the meeting.\nAccording to him, the decision of the ruling All Progressives Congress (APC) to zone the presidency to the south ahead of the 2023 elections did not pose a threat to the Peoples Democratic Party (PDP).\nMohammed said the PDP would continue to strategize to rescue Nigeria from the present situation it found itself in.\n“Moreover, leadership recruitment should be based on merit, should be based on making sure that we bring everybody on board."
  },
  {
    "headline": "Affirmative action: Aisha Buhari storms parliament, NASS reserves 111 seats for women, 37 in Senate, 74 Reps – Blueprint Newspapers Limited",
    "summarized_story": "Wife of the President, Hajiya Aisha Buhari, Wednesday, led a delegation of women into the National Assembly as part of the advocacy for the proposed special seats for women in both the federal and state legislatures.\nIn the team were Minister of Finance, Budget and National Planning, Hajiya Zainab Ahmed, her women affairs counterpart, Dame Paulin Talen and a delegation of Nigerian women.\n“As a man, I am intimidated,” he said, a joke that drew some laughter from among his colleagues.\nThe proposal which had been ratified by the Ad-hoc committees on Constitution review of both chambers was let out of the bag Wednesday during plenary.\n“Therefore, what we are trying to do (Amendment of the Constitution) will go through voting later to complete the process in the National Assembly,” Lawan said."
  },
  {
    "headline": "Buhari to assent to Electoral Act Amendment Bill March 25 – Presidency source",
    "summarized_story": "President Muhammadu Buhari would sign the long-awaited Electoral Act Amendment Bill 2021 on Friday, February 25, 2022.\nPresidency source confirmed that the President would be performing his duty of assenting to the bill around 12pm.\nI believe he has taken his time so that the Act can be as unassailable as much as possible,” the source said.\nThere has been a growing concern in the last couple of weeks over the President’s delay in assenting to the re-amended bill.\nThe National Assembly transmitted the Electoral Act Amendment Bill 2021 to President Buhari on January 31, a second time, having revised the bill, which the President withheld assent to citing the cost of conducting direct primary elections, security challenges, and possible manipulation of electoral processes by political players as part of the reasons for his decision."
  },
  {
    "headline": "Breaking: Medical doctor kidnapped, NMA threatens to suspend services in Akwa Ibom",
    "summarized_story": "Unidentified gunmen on Wednesday morning invaded the premises of the Cottage hospital, Ikot Ekpaw, Mkpat Enin local government of Akwa Ibom state and whisked away Dr Felix Ekpo, a senior medical doctor in the hospital at his duty post .\n“We had to call in another Medical doctor to complete the operations to save life.\nIt therefore urged the state government to deploy security machinery and ensure prompt and unconditional release of the kidnapped doctor .\n“In view of this unfortunate circumstance, we therefore call on all members of the NMA to remain calm and alert in their various places of work as the leadership of NMA Akwa Ibom state has been in constant communication with relevant security agencies.\n“As it stands, the Akwa Ibom Medical Community is in a state of shock and palpable fear."
  },
  {
    "headline": "Matawalle Swears In New Zamfara Deputy Governor, Senator Hassan",
    "summarized_story": "﻿Governor Of Zamfara State, Hon Bello Mohammed Matawalle, has sworn in the new Deputy Governor of the state, Senator Hassan Mohammed Gusau.\nAccording to him, the person who should occupy the position of Deputy Governor should be an able lieutenant, loyal, credible and politically astute and relevant.\n“This is the reason why after a wide range of consultation across the broad political spectrum, it was agreed that distinguished Senator Hassan Mohammed Gusau should be nominated for the position of Deputy Governor of Zamfara State, to which he was just sworn in following the confirmation of the State House of Assembly,” Governor Matawalle said.\n“As a Deputy Governor, your role as defined by the constitution is to assist the Governor in discharging his functions.\n“I call on the good people of our dear State to extend their usual prayers, support and cooperation to the just sworn-in Deputy Governor for him to perform as expected."
  },
  {
    "headline": "Signing Of Electoral Act Amendment Bill Postponed Till Friday",
    "summarized_story": "President Muhammadu Buhari will now sign the re-worked Electoral Act Amendment Bill on Friday, February 25.\nThis comes at a time when President Buhari presides over the Federal Executive Council meeting held at the State House in Abuja.\nThe harmonised version was received by President Buhari a week later, as confirmed by his Senior Special Assistant on NASS Matters (Senate), Senator Babajide Omoworare.\nThe House had re-amended the bill to include the direct and indirect primary options while the Senate re-adjusted it to include the direct, indirect, and consensus modes of selecting political parties’ candidates.\nBoth chambers later passed the harmonised version – the final agreed version of the amendment to Clause 84 which included the direct, indirect, and consensus primary modes."
  },
  {
    "headline": "Aisha Buhari Attends Plenary At National Assembly",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, on Wednesday attended plenary sessions in both chambers of the Senate and the House of Representatives.\nMrs Buhari was at the National Assembly to support an item for amendment in the 1999 Constitution which seeks specific seats to be created for female legislators in the country.\nShe was accompanied to the Senate Chamber by the Minister of Women Affairs, Pauline Tallen; and the Minister of Finance, Budget, and National Planning, Mrs Zainab Ahmed.\n﻿The Senate President, Ahmad Lawan, in a short remark after the report was laid by Deputy Senate President, Ovie Omo-Agege, said the First Lady’s visit was to show support for a bill to have more female parliamentarians at the federal and state legislatures.\nFirst Lady, Mrs Aisha @MBuhari, visits, admitted into House of Representatives Chamber."
  },
  {
    "headline": "Russia ‘Highly Likely’ To Attack Kyiv – UK",
    "summarized_story": "Russian President Vladimir Putin is highly likely to launch a full-scale invasion of Ukraine and attack Kyiv, UK foreign minister Liz Truss said Wednesday.\nThe UK and US have repeatedly over the last weeks cited intelligence as indicating that Russia is planning an invasion of Ukraine.\n“We think it’s highly likely that he (Putin) will follow through on his plan for a full-scale invasion of Ukraine”, Truss told Sky News.\nPrime Minister Boris Johnson on Tuesday announced the first tranche of UK sanctions targeting five Russian banks and three billionaire oligarchs.\nTruss said Wednesday that the UK needed to “retain some sanctions in the locker” and had “more individuals that we will target in the event of a full-scale invasion”."
  },
  {
    "headline": "Elanga Rescue Man Utd Against Atletico Madrid In Champions League Last 16 Tie",
    "summarized_story": "Substitute Anthony Elanga rescued Manchester United a 1-1 draw at Atletico Madrid in their Champions League last-16 first leg on Wednesday.\nDiego Simeone’s Atletico led for the majority of the match through Joao Felix’s fine diving header in the seventh minute.\nBut three-time European champions United ensured the tie would be level heading into the second leg at Old Trafford on March 15, as Elanga stroked home with 10 minutes remaining."
  },
  {
    "headline": "Zamfara State House of Assembly impeaches Deputy Governor Mahdi Gusau -",
    "summarized_story": "Zamfara state House of Assembly has Impeached the state Deputy Governor Mahdi Aliyu GusauTwenty out of the twenty one member’s of the House voted in favour of the motionAdvertisementAdvertisementThis is coming three hours after the seven man panel of Investigation submits it’s Report to the House"
  },
  {
    "headline": "Zamfara Impeachment Panel submits report on deputy Governor to Assembly -",
    "summarized_story": "The seven man investigative panel set up by the Zamfara State Chief Judge Kulu Aliyu to investigate allegations leveled against the state Deputy Governor Mahadi Aliyu Gusau has submitted it’s report to the state House of Assembly amidst tight SecurityAdvertisementAdvertisementSeven witnesses from the Complainant testified before the panel during it’s two days public hearing, though the deputy Governor did not appear before the fact finding CommitteeAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of bridge of the Constitution, Misappropriation of funds, gross misconduct and abuse of officeSubmitting its report to the principal officers of the Zamfara State House of Assembly, Chairman of the panel retired Justice Halidu Tanko Soba says the panel has done justice to all allegations tendered before itAdvertisementRepresented by Oladipo Okpeseyi, the Chairman says only two copies of the report was Produced by the panelHe urge the House to keep the report as secret as possible to the HouseAdvertisementResponding, the Speaker Zamfara State House of Assembly Nasiru Magarya assures the panel that the House will ensure fairness while considering the reportThe Speaker adds that the report will be treated according to the provisions of the Nigerian Constitution as amendedAdvertisementSubmission of the report is coming less than twenty four hours after the panel Concludes it’s public hearing with assurances that it will be fair to all partiesThe Deputy Governor had a few days ago at a press conference in Abuja says he has no confidence in the panel and any move to Impeach him remains illegalAdvertisementThe Panel has the following as MembersJustice Halidu Tanko Sabo (rtd) Oladipo Okpeseyi (SAN) , Abdul Atadoga Ibrahim (SAN) , Hussaini Zakariya’u (SAN) others are Amina Tanimu Marafa, Sani Mande and Ahmad Buhari Rabah while Barrister Ashiru Tsafe serves as the Secretary."
  },
  {
    "headline": "7 Man panel concludes sitting on Zamfara Deputy Governor, Mahdi Gusau -",
    "summarized_story": "A Public hearing on the allegations levelled against the Zamfara State Deputy Governor Mahdi Aliyu Gusau by the Seven Man Panel of Investigation set up by the state Chief Judge has endedThe panel says they are aware that the deputy Governor was notified to appear before it via email, watsapp, hard copies of the letter and other electronic meansAdvertisementThe panel also insisted that it was not served nor made aware of any restraining order preventing it from carrying out the exerciseThe Zamfara State House of Assembly is accusing deputy Governor Mahdai Aliyu Gusau of Misappropriation of funds, breach of the Constitution, Gross misconduct and abuse of OfficeAdvertisementIt has according kick-started the process of Impeaching the Deputy GovernorAdvertisementAdvertisementThe lawmakers had earlier this month requested the state chief judge Kulu Aliyu to set up a panel to Investigate the deputy Governor on allegations against himA few days later, the Chief Judge set up a seven man fact finding panelAdvertisementAdvertisementAt the first day of the public hearing, Seven Witnesses from the Complainant testified before the panel but no representative came from the respondentAdvertisementAbdul Ibrahim a Senior Advocate of Nigeria who is also a member of the Panel while addressing Newsmen at the end of the public hearing said the panel will be fair to all partiesHe adds that the panel is saddled with the responsibility to Investigate the allegations on the Deputy Governor and not declare anyone guilty of any offenceAdvertisementThe panel insists that the deputy Governor was duly served a notice to appear before it through available meansCounsel to the Zamfara State House of Assembly Nasiru Jangebe expressed Confidence in the panelAdvertisementThe Zamfara State Deputy Governor Mahdi Aliyu recently at a press conference described the impeachment exercise as illegal because a competent court of law had restrained any moves being made to Impeach himBut, the Panel says they are yet to be served with such an order from any Court of LawAdvertisementThe panel has three months to Submit it’s Report to the Zamfara State House of Assembly."
  },
  {
    "headline": "APC zones 2023 Presidency to Southern Nigeria",
    "summarized_story": "The All Progressives Congress will most likely choose its National chairman by consensus rather than by the ballot.\nThis was disclosed by the chairman of the progressives governors forum after a closed door meeting between the 22 APC governors and president Muhammadu Buhari in the presidential villa.\nAdvertisementAtiku Bagudu says Mr. President is disposed to the emergence of a consensus candidate and believes this will be in the interest of the party, but also says other aspirants who have indicated interest in the contest are also competent and qualified to occupy the office of national chairman.\nThe governors have unanimously agreed that zoning and consensus should be incorporated as part of arrangements for the national convention.\nAdvertisementGovernor of Kaduna state Nasir El-Rufai also revealed that the party has agreed on a zoning formula for all six geopolitical zones and the positions occupied by the northern zones in the last eight years will be swapped with the southern zones."
  },
  {
    "headline": "Auwal Rafsanjani: Nigerians Have the Right to Demand that Buhari Signs the Electoral Bill",
    "summarized_story": "25 civil society organisations in Nigeria converge in Abuja to protest the delay by President Muhammadu Buhari to assent to the Electoral Act Amendment Bill.\nIn a tweet, Atedo Peterside, Chairman of the ANAP Foundation, urges Buhari to sign the Electoral Bill so that Nigerians can give him the credit for having done something tangible in the area of electoral reforms.\nThe President’s seeming reluctance to assent to the bill heightens concerns that he is not favourably disposed to electoral reforms and the conduct of credible elections.\nSince 2018, Buhari has rejected the legislation three times.\nTo present their concerns over the delay in the approval of the Electoral Act (Amendment) Bill and if they can pressurize the legislature to override the president in the event he rejects the legislation for the fourth time, is Auwal Musa Rafsanjani, the Executive Director of Civil Society Legislative Advocacy Centre."
  },
  {
    "headline": "Buhari Says He Has Saved Nigerians From Trekking- Trending With Ojy Okpe",
    "summarized_story": "Some Nigerians have reacted to President Muhammadu Buhahi who on Tuesday said that without his rail and road projects, people will be trekking from Lagos to Ibadan, the Oyo state capital.\nThe senate on Tuesday asked the federal government to declare a state of emergency on federal roads to improve on alternative means of transportation in the country.\nThe resolution of the senate follows a recent hike in airfares.\nThe upper legislative chamber also asked the Federal government to pay the debt allegedly owed to the Federal Road Maintenance Agency.\nA federal high court in Abuja has dismissed a suit by the Nigerian Bar Association seeking to invalidate some provisions in the Nigeria Police Force Regulations which forbids unmarried female police officers from getting pregnant."
  },
  {
    "headline": "ECOWAS Rejects Mali’s Five-year Transition Proposal",
    "summarized_story": "He spoke on Tuesday in Lagos during a press conference at the end of a two-day strategic retreat of the ECOWAS Council of the Wise.\nJonathan stressed that the proposal for a five-year transition period for the military regime by the Malian parliament was unacceptable because the time was not only too long, but also untenable.\nThe president stated, “If the parliament approves that, I don’t believe ECOWAS will accept it.\nECOWAS Authority of Heads of State will discuss it, but I believe ECOWAS may not accept it.\nThey are not elected members of the parliament and that is why ECOWAS parliament won’t even accept them to meet with the ECOWAS parliament."
  },
  {
    "headline": "Nigeria: Citing Emergence of Previous Chairmen, Buhari Okays Consensus for APC Convention",
    "summarized_story": "And we have in the past done them with national convention, but nothing again in the constitution stops them from being done outside the national convention.\nOther positions zoned to the North-central are National Vice Chairman (NC), Deputy National Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader and Zonal Special (Persons with Disability- PWD) Leader.\nFor the North-west, the positions given are National Vice Chairman (NW), National Legal Adviser, National Organising Secretary, National Financial Secretary, Deputy National Youth Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, zonal Women Leader, and Zonal Special (Persons with Disability – PWD) Leader, among others.\nNorth-east would produce Deputy National Chairman (N), National Auditor, National Vice Chairman (NW), Deputy National Financial Secretary, Deputy National Women Leader, Zonal Secretary, Zonal Youth Leader, among others.\nDeputy National Youth Leader6."
  },
  {
    "headline": "Nigeria, Iraq Kick Against Hike in OPEC Oil Output as Prices Surge Towards $100",
    "summarized_story": "Nigeria and Iraq have said the strategy employed by the Organisation of Petroleum Exporting Countries (OPEC) and its allies, OPEC+, to gradually raise oil production is enough to balance the market.\nThe country should meet its quota for February of around 4.3 million barrels a day, he noted.\nMeanwhile, the Chief Executive of Vitol, one of the world’s biggest oil traders, expects oil prices to climb to $100 and remain at that level for an extended period of time.\nThis bullish prediction, he said, was driven by a belief that global demand would surge in the second half of the year and could surpass 100 million barrels per day.\nOil prices will go higher, and they would stay there for an extended period of time, said the chief executive of Vitol, Russell Hardy."
  }
]