[
  {
    "headline": "No amount of gang-up’ll stop Oyetola’s re-election, Bashiru tells aspirants",
    "summarized_story": "The spokesman of the Senate, Senator Ajibola Bashiru, has urged those planning to contest the governorship ticket of the All Progressives Congress for Osun 2022 election against the incumbent governor, Adegboyega Oyetola, to be civil.\nBasiru, who is the lawmaker representing Osun Central in the Senate, spoke in Igbajo, during the inauguration of Ada-Igbajo road.\nAlready, ex-secretary to the state governor, Moshood Adeoti, ex Deputy Speaker, House of Representatives, Yusuf Lasun, and ex Speaker, Osun state House of Assembly, Najeem Salaam, had already signified intention to vie for APC governorship ticket.\nBut Basiru, who said no amount of gang-up would stop Oyetola’s re-election, volunteered to lend money to any of the those planning to contest APC governorship ticket against Oyetola, but did not have enough money.\nHe said, “We are not saying no one should contest against Governor Oyetola at the primary."
  },
  {
    "headline": "FCT Minister tests positive for COVID-19, goes into isolation",
    "summarized_story": "The Federal Capital Territory Minister, Muhammad Bello, has tested positive for COVID-19.\nThe statement reads in part, “The Federal Capital Territory Minister, Muhammad Bello, has tested positive to COVID-19.\n“The minister, who remains in high spirit, is isolating and receiving treatment at home and is currently doing fine.\n“Bello said the medical personnel attending to him informed him that his case was mild because he had taken two shots of the COVID-19 vaccine.\n“Bello while appealing to those who are yet to get vaccinated against COVID-19 to do so, commended all medical personnel in the FCT and beyond for their front line role in the containment of the virus.”Copyright PUNCH."
  },
  {
    "headline": "Bauchi: Police confirm civil unrest in Bogoro over Gonto’s memorial",
    "summarized_story": "The Bauchi State Police Command on Friday confirmed the protest that broke out against the 21st memorial anniversary of Sayawa nation crusader, Baba Peter Gonto, in Bogoro, the headquarters of Bogoro Local Government Area of the State.\nDAILY POST had reported that some irate youths stormed the venue of the memorial anniversary held at Government Day Secondary School, Bogoro, where they destroyed and set ablaze items put in place for the main memorial event.\nThey subsequently set some houses in the town ablaze, destroying property worth millions of Naira in the process.\nThe police spokesman further informed that the event centre was torched, while windscreens of vehicles were damaged.\nSome other people insisted that the anniversary must go on as scheduled, claiming that the event was meant to unite the Sayawa people."
  },
  {
    "headline": "Adamawa: Fintiri signs N163.6bn 2022 ‘Budget of Sustainable Hope’ into law",
    "summarized_story": "Governor Ahmadu Fintiri of Adamawa State has assented to the 2022 state budget passed by the House of Assembly.\nThe budget has N98.8 billion, representing 60 per cent as recurrent expenditure while N64.7 billion, representing four percent, is allocated to capital expenditure.\nOfficials at the budget signing ceremony included the Speaker of the Adamawa State House of Assembly, Aminu Iya Abbas, some members of the Assembly, and Secretary to the State Government (SSG), Malam Bashiru Ahmad.\nIn his remark after signing the budget, Governor Fintiri thanked members of the State House of Assembly for speedy passage of the budget.\nHe also thanked members of his Economic Team as well as the media for being supportive to his administration."
  },
  {
    "headline": "Danladi Hassan, Colonel forcefully retired in 2016 defeat Nigerian Army at Appeal Court",
    "summarized_story": "The Nigerian Army (NA) has lost its bid to reverse a judgment in favour of Colonel Danladi Ribah Hassan.\nIn January 2019, the National Industrial Court (NIC) ordered the reabsorption of Hassan, one of the 38 officers compulsorily retired without strong reasons.\nThe appeal marked CA/A/299/2019 was filed by the Nigerian Army Council, Armed Forces Council, Chief of Defence Staff, ex-Defence Minister, Brig.\nA letter was issued to that effect, reinstating him into the Nigerian Army with all rights and privileges.\nSo, there is nothing that is perverse by the findings of the lower court."
  },
  {
    "headline": "Buhari reacts to deaths of Datti Ahmed, Ado Gwaram",
    "summarized_story": "On the late Ado Gwaram, the President described him as an extraordinary civil servant who “was at the forefront of many community service initiatives.\nOn account of these, he rightfully enjoyed the respect and patronage of every administration, military and civilian in the old and new Kano State.\nThe delegation was received in Kano by the Secretary to the State Government, Usman Alhaji, who received the President’s letter of condolence to the government and people of Kano State.\nOn behalf of the Governor, who was away, the SSG thanked the President for identifying with the state in their moment of grief.\nSpeaking through Aminu Babba Dan Agundi, Sarkin Dawaki Babba,the family of Ado Gwaram thanked the President for honoring them with the visit."
  },
  {
    "headline": "2022: Approach New Year with renewed hope, faith – Oyetola charges Nigerians",
    "summarized_story": "Governor Gboyega Oyetola of Osun has asked Nigerians, particularly residents of the state to approach the New YNear with renewed hope, faith and maintain the undying spirit.\nIn his New Year message, Oyetola while acknowledging that 2022 is an election year for the state, assured the people that governance will not go on holiday.\nThe governor, in a statement by his Chief Press Secretary, Ismail Omipidan, on the eve of the New Year, expressed optimism that Year 2022 will be more prosperous for both the State and Nigeria.\n“As we have proved in the last three years that it is not our style to mix politics with governance, we will continue to deliver on our camping promises.”Oyetola said he is hopeful that 2022 will be a year of recovery and sustainable development saying he will continue to be resilient and consolidate on financial ingenuity to survive any inclement economic climate and continue to deliver on all promises made whatever economic challenges.\n“As I wish you all the very best that this year will bring, I promise to rededicate myself to the social contract with you, the good people of Osun,” Oyetola said."
  },
  {
    "headline": "EPL stars headline Africa Cup of Nations",
    "summarized_story": "PREMIER League trio Mohamed Salah, Sadio Mane and Riyad Mahrez will be star attractions in Cameroon at the Africa Cup of Nations, which promises to be “exceptional” according to the top football official in the continent.\nChampions Algeria top a 24-team cast that includes former title-holders Cameroon, Egypt, Ethiopia, Ghana, Cote d’Ivoire, Morocco, Nigeria, Sudan and Tunisia.\nWhile record seven-time winners Egypt will be making an unrivalled 25th appearance at the African football showpiece, Comoros and Gambia are debutants.\nIt will be the most successful AFCON (Cup of Nations),” he said during a visit to Yaounde.\n“The world will witness the best of African football and hospitality."
  },
  {
    "headline": "I want to be a professor – Faith Ihediwa, Miss Blind Nigeria",
    "summarized_story": "At first I never believed that a visually impaired person can enjoy something as good as going into the university.\nHow did you get to win the Miss Blind Nigeria pageant?\nThe Miss blind Nigeria pageant took place in 2019 and I have been carrying out my duties as the queen.\nBut as time went on, they adjusted gradually and got to understand that a blind person can still be relevant to the society.\nThis is Mr Blind Nigeria and we are all enthusiastic about what we are experiencing today, we look forward to the coming year with a lot of expectations."
  },
  {
    "headline": "2021: And all that we cannot leave behind (1)",
    "summarized_story": "What a year 2021 turned out to be!\nThe restructuring music continued to shake the country into some level of renewed consciousness.\nWith Governor Rotimi Akeredolu playing the strings like some Jimmy Hendrix.\nBala Mohammed did not only justify the rights of Fulani Herdsmen to illegally bear arms, he also conferred a global citizenship status on the Fulani Herdsmen and their rights to move wherever they liked even on the ancestral lands of other ethnic groups who are obviously denied such global or national citizenship.\nHe proclaimed with blood curdling glee that the Forest Reserves belonged to no one, and that all land belonged to Nigerians, thus allowing the Fulani Herdsmen to reside wherever they wanted."
  },
  {
    "headline": "P-Square: Untold story of how twin brothers had always disagreed",
    "summarized_story": "PETER and Paul Okoye, the duo of P-Square have reunited to become a musical band again after almost five years of the split.\n- Advertisement -Speaking ahead of their reunion concert, Paul went live on Instagram to tell his critics that he’s more than a singer but a professional dancer.\nThe Nation’s source divulged that both Peter and Paul Okoye grew up disagreeing over almost everything.\nThe twin brothers, who recently buried their hatches made this statement during a live session with fans.\nPeter and Paul staged a reunion concert tagged:’ Psquare Reactivated’ to officially announce their comeback."
  },
  {
    "headline": "Sanwo-Olu swears in 14 High Court judges",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu on Friday swore in 14 High Court judges.\nSanwo-Olu urged the judges to not only be efficient and fair, but be seen to be so.\n“You must not only be efficient and fair, but you must also be seen to be efficient and fair by all.\nHe described the Lagos judiciary as the bench of excellence in Nigeria.\nThe Chief Judge who welcomed the new judges to the ‘family of discipline and integrity’, admonished them not to disappoint."
  },
  {
    "headline": "We remain resolute, insecurity will not halt our programmes, plans – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has said that notwithstanding the threat of insecurity in the country, his administration remains resolute to continue with its programmes and plans.\nPresident Buhari noted that to win the war on insecurity, the hearts and minds of the affected citizens must be won.\nWe equally remember and commiserate with Nigerians who have lost loved ones as a result of insecurity in different parts of the country.\nWe remain fully committed to upholding the constitutional provisions that protect all Nigerians from any form of internal and external aggression.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014."
  },
  {
    "headline": "Australia, China first countries to enter 2022",
    "summarized_story": "Australia is already five hours into the year 2022, as the country celebrated its entry into the new year when it was 2pm Nigerian time.\nBut after a tumultuous 2021 the prime minister, Scott Morrison, said Australians had much to be thankful for.\n“Despite the pandemic, despite the floods, the fires, continuing drought in some areas, the cyclones, the lockdowns, even mice plagues, Australia is stronger today than we were a year ago.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nSimilarly, China has welcomed the year 2022 , just at 5pm Nigerian time with President Xi Jinping vowing to tackle risks that could disrupt his nation’s march toward development, as he entered a pivotal political year facing a host of economic challenges made worse by the pandemic."
  },
  {
    "headline": "No guber poll will hold in Yorubaland in 2022 – Akintoye",
    "summarized_story": "From Seye OjoLeader, Ilana Omo Oodua Worldwide, Prof Banji Akintoye, has said no governorship poll will hold in Yorubaland in 2022.\nInstances have increased dramatically of Human Rights abuses committed against our people.\nAnd from among the millions who are praying and fasting, countless messages of blessing are coming forth for the whole Yoruba nation.\n“Second, the Yoruba people will soon be blessed with their Yoruba Nation State, the greatest desire of their hearts.\nMay God make 2022 the year of great destiny for the Yoruba nation."
  },
  {
    "headline": "UK pledges £105m to assist Nigeria, others tackle Omicron",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom has pledged £105 million to help tackle Omicron in Nigeria and other African countries.\n“The UK Foreign Secretary, Liz Truss, has pledged up to £105 million of UK emergency aid to help vulnerable countries tackle the Omicron COVID-19 variant, with a particular focus on Africa.\n“Doses donated by the UK have reached four continents and provided vital protection from COVID-19 in countries, including Nigeria, Angola, the Democratic Republic of Congo, Ethiopia, Ghana and Rwanda.\nThe UK has so far donated to Nigeria over 1.2 million doses of Oxford-AstraZeneca vaccines through COVAX in 2021.\nI am proud we have already delivered over 30 million vaccines to our friends abroad."
  },
  {
    "headline": "Lives lost under Buhari govt worrisome, says Kukah",
    "summarized_story": "From Tunde Omolehin, SokotoBishop of the Catholic Diocese of Sokoto, Matthew Kukah, has expressed worries over the rising numbers of deaths under the President Muhammadu Buhari.\nSpeaking at an interactive session with journalists in Sokoto, yesterday, the cleric reiterated that the president owed Nigerians explanations on the rising kidnappings and killings.\nRemember that I have said similar things about previous governments, depending on their wickedness or wrongdoings as at that time.\nBut the most important thing is for anyone who wants to counter my criticism to first come with valid and superior arguments.\nI realised that we are indifferent to learning how to disagree with each other for the purpose of agreeing with ourselves.”"
  },
  {
    "headline": "Brown Ebewele is Dead",
    "summarized_story": "A former Nigerian athlete and administrator, Brown Ebewele is dead.\nEbewele fondly called ‘Juju Man’ died on Friday afternoon at a private hospital in Warri, Delta State after a surgery.\nThe success of Team Nigeria at the 2003 African Games hosted by Nigeria in Abuja was partly due to the efforts of Ebewele.\nAt various times, he led such states as Delta, Kano, Borno and Edo to decent outings at the National Sports Festival.\nHis last outing was helping Team Edo to finish as runners up at the much postponed NSF which held last April in Benin City."
  },
  {
    "headline": "Breaking: FCT Minister Tests Positive for COVID-19",
    "summarized_story": "Olawale Ajimotokan in AbujaFCT Minister Muhammed Musa Bello has tested positive for COVID-19.\nThe minister said he decided to do a COVID-19 test on Thursday morning after feeling unwell from December 28.\nHe disclosed the test came out positive on Friday morning.\n“After feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nHe also urged all those who have not been vaccinated against COVID-19 to do so."
  },
  {
    "headline": "FG Outlines Administration’s 100 Achievements in 2021",
    "summarized_story": "Olawale Ajimotokan in AbujaThe federal government, yesterday, presented the scorecard of President Muhammadu Buhari, citing 100 core achievements of his administration in 2021.\nMohammed, who addressed the media in Lagos, said government’s economic recovery plan remained on a steady path throughout 2021.\nMohammed stressed that under the Buhari administration, the rate of inflation had continued to decline on a year-on-year basis since April 2021.\nAccording to Mohammed, “The recovery of the economy remained on a steady path throughout the year 2021.\nThe minister disclosed that non- oil export grew by 21.17 per cent, from N1.19 trillion to N1.44 trillion over the same period."
  },
  {
    "headline": "NDDC: We Shall Recover Every Stolen Kobo, Vows Buhari",
    "summarized_story": "*Restates few people squandered region’s fund in over two decadesDeji Elumoye in Abuja and Okon Bassey in UyoPresident Muhammadu Buhari has vowed to recover all misappropriated funds of the Niger Delta Development Commission (NDDC).\nBuhari also emphasised the readiness of his administration to prosecute all culprits indicted in the NDDC forensic report currently being reviewed by the federal government.\nThe president stated, “The Niger Delta Development Commission needs to demonstrate that it can achieve the objectives it was conceived for and make its impact felt all over the Niger Delta Region.\nHe added, “President Buhari is focused on development of Nigeria and the Niger Delta.\nSpeaking also, Sole Administrator of NDDC, Mr. Effiong Akwa, thanked the president for honouring the institution by commissioning three projects in a year."
  },
  {
    "headline": "Report: At 55 Years, Every Lagos Resident Would’ve Spent Over Six Years in Traffic",
    "summarized_story": "FDC, led by Nigerian economist, Mr. Bismarck Rewane, also highlighted in its latest report published this month the economic outlook for 2022.\nThe Lagos-based research and investment firm stated that while Lagos residents spent 1,080 hours in traffic a year, residents of London, which is said to have the highest congestion in the world, spent about 148 hours.\nThe report stated, “Lagosians are spending approximately 1,080 hours a year in traffic, compared to 148 hours in London, the city with the worst traffic jams in the world (excluding Nigeria and Egypt).\nIn other issues, the FDC report stated that economic policy vagueness and “regulatory autocracy” plagued the Nigerian economy for most part of 2021.\nHowever, the FDC stated that high debt servicing costs, large public wage bill and security expenses would keep government spending elevated throughout the period."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "Buhari’s Minister Tests Positive For COVID-19 As Virus Wave Spreads In President's Circle",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello, has tested positive for COVID-19.\nHe said; “I have tested positive for COVID-19.\nActivities at the Aso Rock Villa, Abuja have also been grounded following the outbreak of the virus at Nigeria’s seat of power.\nIn the past few days, Nigeria has been reporting a steady increase in COVID-19 infections, in what has been confirmed as the fourth wave of the pandemic by the Nigeria Centre for Disease Control (NCDC).\nHe said on his Facebook page, \"I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "Buhari’s Minister Tests Positive For COVID-19 As Virus Wave Spreads In President's Circle",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello, has tested positive for COVID-19.\nHe said; “I have tested positive for COVID-19.\nActivities at the Aso Rock Villa, Abuja have also been grounded following the outbreak of the virus at Nigeria’s seat of power.\nIn the past few days, Nigeria has been reporting a steady increase in COVID-19 infections, in what has been confirmed as the fourth wave of the pandemic by the Nigeria Centre for Disease Control (NCDC).\nHe said on his Facebook page, \"I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "FULL TEXT: Buhari's New Year speech",
    "summarized_story": "There is no doubt that the issue of Security remains at the front burner of priority areas that this Administration has given utmost attention to.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues.\nAs it is said, the past is but a story told, the future will still be written in gold.\nLet us be united in our fight to keep our Nation united against all odds and with gratitude, celebrate life in this new epoch."
  },
  {
    "headline": "FULL TEXT: Buhari's New Year speech",
    "summarized_story": "There is no doubt that the issue of Security remains at the front burner of priority areas that this Administration has given utmost attention to.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues.\nAs it is said, the past is but a story told, the future will still be written in gold.\nLet us be united in our fight to keep our Nation united against all odds and with gratitude, celebrate life in this new epoch."
  },
  {
    "headline": "Buhari: Every life lost to insecurity gives me concern... we'll do more to protect Nigerians",
    "summarized_story": "President Muhammadu says his administration remains committed to protecting Nigerians by addressing insecurity.\nTo this end, the president said his administration is working with international partners and neighbouring countries, and they would “deploy multi-faceted solutions that will be targeted at addressing human security at the grassroots, before it leads to insecurity”.\nBuhari also paid tribute to security agents and other citizens who have lost their lives as a result of security challenges.\n“We equally remember and commiserate with Nigerians who have lost loved ones as a result of insecurity in different parts of the country.\n“There is no doubt that the issue of security remains at the front burner of priority areas that this administration has given utmost attention to."
  },
  {
    "headline": "Buhari: Every life lost to insecurity gives me concern... we'll do more to protect Nigerians",
    "summarized_story": "President Muhammadu says his administration remains committed to protecting Nigerians by addressing insecurity.\nTo this end, the president said his administration is working with international partners and neighbouring countries, and they would “deploy multi-faceted solutions that will be targeted at addressing human security at the grassroots, before it leads to insecurity”.\nBuhari also paid tribute to security agents and other citizens who have lost their lives as a result of security challenges.\n“We equally remember and commiserate with Nigerians who have lost loved ones as a result of insecurity in different parts of the country.\n“There is no doubt that the issue of security remains at the front burner of priority areas that this administration has given utmost attention to."
  },
  {
    "headline": "Enter 2022 with hope that things will be better, Tinubu tells Nigerians",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), has advised Nigerians to remain hopeful that the country will overcome its challenges.\nThe former governor of Lagos also urged citizens to remain united in the belief that collective effort can lead to growth.\nSo I enjoin you to enter 2022 with hope and with the unyielding determination that our hope and collective toil will succeed in bringing forth a more prosperous and just nation.\nHope that things will be better.”According to him, the President Muhammadu Buhari administration is doing its best to tackle insecurity, and it is up to the citizens to show support.\nFor in achieving these things, we achieve a better Nigeria for us all."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Reviewing Nigerian fintech in 2021: Local investors are stepping up",
    "summarized_story": "Share this article:Between January and September 2021, African fintechs raised up to $1.4 billion, signalling an increasing investor appetite for Africa’s growing fintech space, and Nigeria has taken centre stage.\nAccording to data gathered by Intelligence by Techpoint, Nigerian fintech startups raised almost $800 million in 2021.\nBut, so far, there’ve been massive improvements in the fintech space beyond smartphone apps.\nIn January 2021, Olowe made some interesting predictions which, in the real sense, are educated guesses based on the trends from past years, and we created a little analysis.\n“I must admit that MTN would find it really tough to play in the financial space."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "For the Record: Text of President Muhammadu Buhari’s New Year Speech",
    "summarized_story": "There is no doubt that the issue of Security remains at the front burner of priority areas that this Administration has given utmost attention to.\nWe remain fully committed to upholding the constitutional provisions that protect all Nigerians from any form of internal and external aggression.\nOn the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterized our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nLet us be united in our fight to keep our Nation united against all odds and with gratitude, celebrate life in this new epoch."
  },
  {
    "headline": "CBN adjusts forex rate, naira slides down to N435/$1 at official market",
    "summarized_story": "In what appears to be another devaluation of the naira, the Central Bank of Nigeria (CBN) on Friday, adjusted the country’s exchange rate on its website to N413.49/$1, causing the naira to tumble to N435 against the dollar at the official market.\nThe CBN had in May, devalued the naira from N379 to N411/$1 by adopting the (I&E) window.\nThe naira was quoted as high as N445.50 per dollar during the intra-day trading.\nThe apex bank has devalued the exchange rate multiple times since March 2020 as it tries to bridge the disparity between the official and parallel market rates.\nAt the parallel market, the local currency stabled at N570 to a dollar."
  },
  {
    "headline": "Oyetola urges Osun people to approach New Year with renewed hope, faith",
    "summarized_story": "He urged the people of the state to approach the new year with renewed hope and faith, just as he appreciated them for their patience, support, cooperation and construtive criticism, shown to his government.\nOyetola further said: “2022 is no doubt an election year for us in Osun.\n“Our goal is to achieve inclusive socio-economic growth that is rooted in our 10-Year Osun Development Plan (2019-2028).\nOur plan rests on four developmental pillars: Economic Development, Infrastructure Development, Human Capital Development and Security, and Environmental Sustainability.\nHowever, I enjoin our people to maintain the undying spirit and enter 2022 with renewed hope and faith."
  },
  {
    "headline": "Osun PDP Ilode Ward 1, Ife East refutes purported suspension of Wale Oladipo",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe executive members of Ilode ward 1, Ife East Local Government of People’s Democratic Party, PDP, in Osun State, has refuted the purported suspension of the erstwhile national secretary of the party, Prof. Wale Oladipo by some “unscrupulous elements” who, according them, are not known to the executive members of the party in the ward.\nThe executive members dismissed the alleged suspension as baseless, unfounded and far from the truth.\nThis was contained in a release issued and signed by the current PDP Chairman of the ward, Prince Omotosho Lawrence and authenticated by all members of the Ward Exco after their weekly meeting on Friday.\nThey are warned in their own interest to desist from such act henceforth, otherwise they will face the wrath of Law”It would be recall that a self styled executive committee of the Peoples Democratic Party (PDP) in ward 002, Ilode 1, Ile-Ife, allegedly suspended former National Secretary of the party, Prof Wale Oladipo over what they described as anti-party activities.\nBut the executive members of the party in Ilode ward 1 promptly met to serve a final warning to all impersonators masquerading as Party exco in order to truncate the chances of the Party in 2022."
  },
  {
    "headline": "Uba Sani, Worthy Ambassador Of Kaduna In 9th NASS – Zailani",
    "summarized_story": "The Speaker of the Kaduna State House of Assembly, Rt.\nYusuf Ibrahim Zailani, has described Senator representing Kaduna Central in the 9th National Assembly, Uba Sani, as a shinning light and a worthy ambassador of the state.\nZailani, Hon.\n“Kaduna State is worthy to have a reliable and hardworking Senator like you representing it.\nZailani explained that the progress being made in the Kaduna State Urban Renewal projects across the Kaduna metropolis, Kafanchan and Zaria has Uba Sani’s inputs."
  },
  {
    "headline": "Why I Conceived ‘My Heritage Africa’ – Lady Chinor",
    "summarized_story": "The founder of ‘My Heritage Africa 2063’, Lady Chinor Irene Emeka, has said she started the organisation to improve educational opportunities through leadership values, skill acquisition programmes, entrepreneurship and agricultural practices within the African Context.\nShe said the organisation started as a thought and progressed into a desire where it became a reality, hence by grooming young Nigerians under the Miss Heritage Beauty Pageant and appreciating Heritage distinguished individuals and institutions through the National Heritage Awards.\nAccording to her, it aimed to answer the questions; “How can we achieve a United Africa and program our diverse Cultures into a common African Heritage with the Capacity for Wealth Creation to make the African Child the most Innovate?.\nADVERTISEMENT“How can we achieve an Africa which Development is People-driven particularly by Women and Youths?\n“Miss Heritage Nigeria Beauty Pageant is not only a platform to re-direct our Youths to embrace our Heritage but also to harness its virtues, while contributing to National Development,” she added.I"
  },
  {
    "headline": "Tragedy As 2 Teenagers Drown In Kwara River",
    "summarized_story": "Tragedy struck on the eve of the New Year as two teenagers simply identified as Damilare, aged 12 and Kamaldeen, aged 14 drowned in Asa River along Mubo street axis, Maraba, Ilorin, Kwara State on Friday.\nThe dead bodies of the victims were recovered from the river by men of the Kwara State Fire Service.\nADVERTISEMENTAdekunle said: “The Kwara State Fire Service has again evacuated two boys namely Damilare, 12 years old and Kamaldeen 14 years old from Asa River ‘Laola Salasi – Mubo area Ilorin on 31st of December, 2021.\n“However, it was so unfortunate that the two victims (Kamaldeen and Damilare) were recovered dead from the river by the firemen.\nThey went with their colleagues to swim in Asa River before they were eventually drowned in the river."
  },
  {
    "headline": "Convention: APC Chairmanship Aspirant Urges Party Members To Be United",
    "summarized_story": "“As we journey into the new year, and particularly, the national convention of our party, I appeal to every party member and supporter to seek above everything else the unity and peace of this great party.\nThe party must remain a strong political entity before, during and after the convention”, he stated in a new year message he personally signed.\nNevertheless, the fourth quarter 2020 recorded a slight improvement of 0.11 percent, ushering in positive growth rates in the three quarters of 2021.\n“This economic performance in 2021 shows a steady improvement in growth over the last three quarters of 2020.\nThe Buhari-led administration has continued to support them and has assured us the raging insecurity will soon be nipped in the bud."
  },
  {
    "headline": "FCT Minister Tests Positive For COVID-19, Urges Vaccination",
    "summarized_story": "Minister of the Federal Capital Territory (FCT), Malam Muhammad Musa Bello, has announced that he has tested positive for COVID-19.\nBello disclosed this in a post on Facebook on Friday, urging unvaccinated people to make themselves available for COVID-19 vaccination.\nAccording to the Minister, “I have tested positive for COVID-19.\nI pray for the quick recovery of all of us currently afflicted with COVID-19.\n“I have been informed by the experts that my case is mild because I took two shots of the COVID-19 vaccine."
  },
  {
    "headline": "2022: First 10 countries to celebrate new year",
    "summarized_story": "As Nigerians wait to celebrate the New Year, some countries around the world are already in 2022.\nThe different time zones across the globe mean that some countries around the world will get into the new year hours before others.\nWhile many might think countries like Australia and New Zealand would be the first to celebrate the New Year, smaller island nations are actually the first to welcome the New Year.\nHere is a list of some countries that celebrated 2022 before the rest of the world and the time equivalent in Nigeria;Sorry, the video player failed to load.\nJapan, North Korea, South Korea, IndonesiaWhen it is 4 pm in Nigeria, countries in East Asia and Oceania such as Japan, North Korea, South Korea, Indonesia celebrate the New Year."
  },
  {
    "headline": "2022: First 10 countries to celebrate new year",
    "summarized_story": "As Nigerians wait to celebrate the New Year, some countries around the world are already in 2022.\nThe different time zones across the globe mean that some countries around the world will get into the new year hours before others.\nWhile many might think countries like Australia and New Zealand would be the first to celebrate the New Year, smaller island nations are actually the first to welcome the New Year.\nHere is a list of some countries that celebrated 2022 before the rest of the world and the time equivalent in Nigeria;Sorry, the video player failed to load.\nJapan, North Korea, South Korea, IndonesiaWhen it is 4 pm in Nigeria, countries in East Asia and Oceania such as Japan, North Korea, South Korea, Indonesia celebrate the New Year."
  },
  {
    "headline": "Lagos: Sanwo-Olu signs N1.758 trillions 2022 budget into law",
    "summarized_story": "By GBENGA ADEOLALagos State Governor, Mr. Babajide Sanwo-Olu on Friday signed the 2022 Appropriation Bill of N1.758 trillion christened ‘Budget of Consolidation’ into law.\nSpeaking after signing the 2022 Appropriation bill, Governor Sanwo-Olu said the budget is to consolidate infrastructural development across the state in line with his administration’s T.H.E.M.E.S.\n“In addition, this 2022 Appropriation Bill recognises several other already-funded project transactions that are now being accounted for as corporate transactions.\nObasa, who was represented by the Chairman of the Lagos State House of Assembly Committee on Appropriation, Hon.\nAlso speaking, Commissioner for Economic Planning and Budget, Sam Egube, commended the Lagos State House of Assembly for the speedy passage of the 2022 Appropriation Bill."
  },
  {
    "headline": "Lagos: Sanwo-Olu signs N1.758 trillions 2022 budget into law",
    "summarized_story": "By GBENGA ADEOLALagos State Governor, Mr. Babajide Sanwo-Olu on Friday signed the 2022 Appropriation Bill of N1.758 trillion christened ‘Budget of Consolidation’ into law.\nSpeaking after signing the 2022 Appropriation bill, Governor Sanwo-Olu said the budget is to consolidate infrastructural development across the state in line with his administration’s T.H.E.M.E.S.\n“In addition, this 2022 Appropriation Bill recognises several other already-funded project transactions that are now being accounted for as corporate transactions.\nObasa, who was represented by the Chairman of the Lagos State House of Assembly Committee on Appropriation, Hon.\nAlso speaking, Commissioner for Economic Planning and Budget, Sam Egube, commended the Lagos State House of Assembly for the speedy passage of the 2022 Appropriation Bill."
  },
  {
    "headline": "After signing, Buhari accuses National Assembly of padding 2022 budget",
    "summarized_story": "The President noted that he approved the increase of the budget proposal by N186.53 billion to cover expected expenditure on additional critical expenditures and he consequently authorized the Minister of Finance, Budget and National Planning to forward the request for the increase to the National Assembly.\nAccording to him, the National Assembly reduced allocations for as many as 10,733 projects in the 2022 budget, while 6,576 new projects were introduced into the budget by the National Assembly.\nThe President noted that the lawmakers reduced provisions for many strategic capital projects in favour of their own ‘Empowerment’ projects to the detriment of the nation.\n“The cuts in the provisions for several of these projects by the National Assembly may render the projects unimplementable or set back their completion, especially some of this Administration’s strategic capital projects.\nBuhari also lamented that while the National Assembly increased projected revenue by N609.27 billion, the additional Executive request of N186.53 billion for critical expenditure items could not be accommodated without increasing the deficit, while the sum of N550.59 billion from the projected incremental revenues was allocated at the discretion of National Assembly."
  },
  {
    "headline": "Gov. Lalong to prioritize legacy projects in 2022",
    "summarized_story": "By Martha AgasPlateau State Governor, Simon Lalong said that his administration would prioritise the completion of physical infrastructure projects and human capital development in 2022.\nHe said that he would continue with his ongoing “Lalong Legacy Projects” across the 17 local governments in the state, while work on the British-America flyover bridge would be carried out.\nLalong added that the government needed the support of Nigerians to address critical issues militating against the peace, unity and progress of the country.\n“Nigeria is tremendously blessed and endowed with not only natural resources but good people who want to live in peace and pursue legitimate endeavours in peace, unity and tranquillity.\nThereafter, he wished Nigerians a prosperous 2022 while imploring them to continue showing mutual respect, love to one another."
  },
  {
    "headline": "President Buhari Reacts To Deaths Of Datti Ahmed, Ado Gwaram.",
    "summarized_story": "On the late Ado Gwaram, the President described him as an extraordinary civil servant who “was at the forefront of many community service initiatives.\nOn account of these, he rightfully enjoyed the respect and patronage of every administration, military and civilian in the old and new Kano State.\nperfect-dating.comThe delegation was received in Kano by the Secretary to the State Government, Usman Alhaji, who received the President’s letter of condolence to the government and people of Kano State.\nOn behalf of the Governor, who was away, the SSG thanked the President for identifying with the state in their moment of grief.\nSpeaking through Aminu Babba Dan Agundi, Sarkin Dawaki Babba,the family of Ado Gwaram thanked the President for honoring them with the visit."
  },
  {
    "headline": "BREAKING: FCT Minister Tests Positive For COVID-19",
    "summarized_story": "Malam Muhammad Musa Bello, Minister of the Federal Capital Territory (FCT), has tested positive for the COVID-19 virus.\n“I tested positive for COVID-19,” he stated.\nAfter feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nI pray for the quick recovery of all of us currently afflicted with COVID-19.\n“I have been informed by the experts that my case is mild because I took two shots of the COVID-19 vaccine."
  },
  {
    "headline": "BREAKING: FCT Minister Tests Positive For COVID-19",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello has tested positive for the COVID-19 virus.\nHe said; “I have tested positive for COVID-19.\nAfter feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nI pray for the quick recovery of all of us currently afflicted with COVID-19.\n“I have been informed by the experts that my case is mild because I took two shots of the COVID-19 vaccine."
  },
  {
    "headline": "JUST IN: Lagos Announces Second Term Resumption Date For Schools",
    "summarized_story": "The Lagos State Government has stated that on Tuesday, January 4, 2022, all public and private schools in the state below the tertiary level will reopen for the second term of the 2021/2022 academic year.\nMrs. Abiola Seriki-Ayeni, Director-General, Office of Education Quality Assurance, said this on Friday in a statement headed, ‘Lagos public and private schools reopen Tuesday, January 4, 2022, for second term’.\n“School leaders should also note that the Mid-Term break for the second term is Thursday 17th and Friday 18th of February, 2022 while school closes on Friday 8th April, 2022,” the statement added.\nIn order to prepare for academic activities, Seriki-Ayeni advised boarding students to return on Monday, January 3, 2022.\nThe Office of Education Quality Assurance will monitor compliance with the resume date in the Lagos State Unified Academic Calendar, as well as supervise the teaching and learning process in schools, she added."
  },
  {
    "headline": "Nigerians still groan into 2022 despite govt’s efforts",
    "summarized_story": "The killings and abductions of citizens were recorded in the country’s 36 states and the Federal Capital Territory (FCT), Abuja.\nIt indicated further that 1, 153 civilians were killed followed by bandits at 675 and terrorists at 170.\nIn total, no fewer than 176 security personnel lost their lives to attacks in different parts of the country.\nPlateau state recorded 138 killings; Benue at 113 and Katsina at 107.\nFurthermore, according to data gathered by the Nigeria Security Tracker (NST) 725 were killed across Nigeria in October alone due to dire security situations."
  },
  {
    "headline": "Revealed! What Buhari told government officials moment he signed 2022 budget into law",
    "summarized_story": "‘‘Reduction in the provisions for many strategic capital projects to introduce ‘Empowerment’ projects.\n‘‘I signed the 2022 Appropriation Bill into law to enable its implementation to commence on 1st January 2022.\nTo achieve the laudable objectives of the 2022 Budget, the President pledged that the federal government would further intensify revenue mobilisation efforts.\n‘‘However, being a deficit budget, the specific Borrowing Plan will be forwarded to the National Assembly shortly.\n‘‘I count on the cooperation of the National Assembly for a quick consideration and approval of the Plan when submitted."
  },
  {
    "headline": "Breaking: As enrollment hits 71 million, FG extends NIN-SIM verification to March 2022",
    "summarized_story": "The federal government on Friday announced extension of the ongoing National Identification Number (NIN) verification, being mandatory aspect for existing and new Subscriber Identity Module (SIM) cards.\nThe existing verification exercise is meant to expire on December 31, 2021.\nAs of 30th December 2021, the National Identity Management Commission (NIMC) has issued over seventy-one million (71m) NINs with over fourteen thousand (14,000) enrolment centres set up across the country.\n“Furthermore, the National Identity Management Commission (NIMC) has also set up enrolment centres in over thirty-one (31) countries to cater for Nigerians in the Diaspora.\nThey also applaud the efforts of the respective staff in ensuring a seamless NIN-SIM linkage and urge citizens and legal residents to complete the process of enrolment, verification, and SIM linkage on or before 31st March 2022”."
  },
  {
    "headline": "Expect Continued Progress Against Our Challenges In New Year, Buhari Tells Nigerians",
    "summarized_story": "President Muhammadu Buhari has asked Nigerians to envision a year of continued progress against the nation’s combined challenges arising from security and socio-economic issues.\nHe gave the charge on Friday in his New Year message to Nigerians to usher in the year 2022.\nThe President also used the occasion to highlight some of the efforts made so far by his administration, and what Nigerians should expect in the areas of security, economy, and anti-corruption fight, among others.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues."
  },
  {
    "headline": "The Sickle Cell ‘Warriors’ Battling A Silent Killer",
    "summarized_story": "Early detection is key because most sickle cell patients die during the first five years of life.\nWe are capable of living.”Controversial movesIn September, the Nigerian Senate passed a bill seeking to improve the prevention and management of sickle cell disease.\nAnd sickle cell is getting better and better treated globally; we were just talking about clinical trials for new drugs.\n“Sickle cell disease can be easily treated if newborn babies are tested early and are placed on medication.” She gave an example of two babies who tested positive for sickle cell disease at the beginning of the CONSA programme last year.\nShe hopes the government makes testing mandatory for all newborns and ramps up sensitisation about sickle cell disease across the country."
  },
  {
    "headline": "Pray For God’s Mercy, CAN Tells Nigerians In New Year Message",
    "summarized_story": "The Christian Association of Nigeria has called on Nigerians to pray for God’s mercy in 2022.\n“I call on all Nigerians, irrespective of their religious affiliations, to rise up and cry for the mercy of God that can preserve us and bring an end to all these pains.\n“Except for the mercy of God to intervene divinely and miraculously, we would be like Sodom and Gomorrah.\n“For the Lord, our God is a merciful God.\nThat same God will surely have mercy on our country in Jesus’ name,” he said."
  },
  {
    "headline": "Buhari Signs 2022 Budget, Decries Changes Made By NASS",
    "summarized_story": "President Muhammadu Buhari has signed the 2022 Appropriation Bill of N17.126 trillion into law.\nHe was, however, displeased with some changes as well as major additions and reductions made by the National Assembly in critical projects ‘without justification’.\nIn his response, the Senate President told State House correspondents that the lawmakers were right in their decisions.\nThe National Assembly raised the total 2022 budget figure from the proposed N16.391 trillion to N17.126 trillion.\nChannels Television had also obtained a communication addressed to the Presidency by the Clerk to the National Assembly, Mr Ojo Amos, indicating that the bill had been transmitted by the National Assembly."
  },
  {
    "headline": "Lagos Govt Identifies 6,500 Inbound Passengers Suspected To Have Flouted COVID Guidelines",
    "summarized_story": "The Lagos State Government says it has identified and started communicating with about 6,500 inbound passengers who are suspected to have breached COVID-19 travel guidelines.\nThis was disclosed in a statement signed by the Commissioner for Health, Prof. Akin Abayomi on Friday.\n“We have commenced communicating with 6,500 inbound passengers who are suspected of not being compliant with our guidelines established to protect the community, lives and our economy,” a statement by the Commissioner for Health, Professor Akin Abayomi said on Friday.\n“Many more positive inbound travellers were identified, and many more persons observed the isolation protocols resulting in better control of importation and spread into and within the community.\n“As a government, we are determined to halt the alarming trend of defaulters whose actions were responsible for previous waves of the pandemic in Lagos State,” the statement added."
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Buhari Signs Nigeria’s 2022 Budget, to Seek Amendment Due to ‘Worrisome Changes’ By Parliament",
    "summarized_story": "President Buhari also expressed strong reservations on the ‘‘worrisome changes’’ made by the National Assembly to the 2022 Executive Budget proposal.\n‘‘It is in this regard that I must express my reservations about many of the changes that the National Assembly has made to the 2022 Executive Budget proposal.\n‘‘Reduction in the provisions for many strategic capital projects to introduce ‘Empowerment’ projects.\n‘‘However, being a deficit budget, the specific Borrowing Plan will be forwarded to the National Assembly shortly.\n‘‘I count on the cooperation of the National Assembly for a quick consideration and approval of the Plan when submitted."
  },
  {
    "headline": "Tens of Thousands Flee as Colorado Fires Burn Hundreds of Homes",
    "summarized_story": "Hundreds of homes have been destroyed and tens of thousands evacuated in Colorado, United States, after wildfires driven by high winds engulfed two towns near the state capital, Denver.\nThe neighbouring towns are roughly 32km (20 miles) northwest of Denver, a city of more than 715,000 people.\nAccording to the Denver Post, the fire is the most destructive in Colorado’s history in terms of the number of homes destroyed.\nThe National Weather Service (NWS) said in a social media post that smaller fires were also reported in at least two areas.\nThe extent of property losses was not immediately known, but a news station aired footage of homes engulfed in flames near Louisville."
  },
  {
    "headline": "South Korea’s Ex-President Park Freed after Nearly 5 Years in Prison",
    "summarized_story": "Former South Korean President Park Geun-hye was released from prison on Friday nearly five years after being convicted of corruption, fuelling debate over whether she would play any role ahead of a March presidential election.\nBroadcasters showed Park leaving a Seoul hospital, where she had stayed since last month for medical treatment, after correction officials delivered a letter of pardon at midnight.\nPark’s release comes as her old party, the main opposition conservative People Power Party, and Moon’s Democratic Party are in a tight presidential race.\nAbout 200 people held a protest in downtown Seoul against her release, the Yonhap news agency reported.\nPeople Power’s presidential candidate Yoon Suk-yeol, who investigated the Park scandal as prosecutor-general, said on Friday he had done his job as a public servant, adding he would like to visit Park when her health improved."
  },
  {
    "headline": "Putin Warns Biden Against Major Sanctions Over Ukraine",
    "summarized_story": "Russian President Vladimir Putin has told his United States counterpart Joe Biden that any sanctions over Ukraine would be a big mistake, an aide to the Kremlin said on Thursday, after the two leaders spoke by phone ahead of lower-level talks next month.\nIt was the second time Putin and Biden held direct talks this month, as the Russian military buildup near Ukraine continues to heighten fears that Russia may be preparing for an imminent invasion of its neighbour.\nIn a statement describing Thursday’s talks, the White House said Biden urged Putin to “de-escalate” the simmering tensions and “made clear that the United States and its allies and partners will respond decisively if Russia further invades Ukraine”.\nThose discussions in Geneva are set to take place on January 10, while Moscow and NATO representatives are expected to meet on January 12.\nPutin has said Russia is not looking for war with its neighbour but wanted an “immediate” response from the US and its allies to its demand for security guarantees."
  },
  {
    "headline": "Sudanese Security Forces Kill Four Anti-Coup Protesters",
    "summarized_story": "Sudanese security forces have shot four people dead during nationwide protests, a doctors’ group said, as tens of thousands of people marched against military rule.\nSecurity forces fired tear gas and stun grenades as protesters marched through Khartoum and the neighbouring cities of Omdurman and Bahri towards the presidential palace on Thursday.\nThe Central Committee of Sudanese Doctors (CCSD) said four protesters were shot dead by security forces, three of them in Omdurman.\nReporting from Khartoum, Al Jazeera’s Mohamed Vall said the situation in Omdurman had developed into a serious confrontation between the security forces and anti-coup protesters.\nEarlier on Thursday, Security forces confronted protesters about 2km (1.2 miles) from the palace in the centre of the capital, Reuters news agency reported, adding that there was a heavy security presence in the area."
  }
]