[
  {
    "headline": "Road construction cause of Ikeja gas leakage — Eyewitnesses",
    "summarized_story": "Some eyewitnesses at the Ikeja gas leakage have revealed that the cause of the incident is due to the ongoing road rehabilitation in the area.\nIt was gathered that the government plans to expand the road, hence the gas leakage this morning.\nAn eyewitness Adekunle Raji, whose mother sells her ware at the spot where the gas leakage occurred affirmed to The PUNCH that the ongoing road project caused the gas leakage.\nThe leakage has affected our business immensely.”Another eyewitness who simply identified himself as Jeremiah Kuffrey, stated, “The leakage was due to the ongoing road project.\n“As you can see, it is a gas leakage, we received the call past 7 am this morning."
  },
  {
    "headline": "Adesina, Anyim, Sanwo-Olu, others for Zik Leadership Award Nov 7",
    "summarized_story": "The President of the African Development Bank, Dr Akinwunmi Adesina; a former Secretary to the Government of the Federation, Senator Anyim Pius Anyim and Governor of Lagos State, Babajide Sanwo-Olu, will on Sunday, November 7, 2021 receive the 2020 Zik Prize for Leadership and Public Service.\nThe Chairman, Selection Committee, Board of Public Policy Research and Analysis Centre, Prof. Pat Utomi, in a statement, said the Zik Prize had become Africa’s most respected award schemes, since 1995.\nAccording to Utomi, “I am delighted to inform you that since 1995 when the Zik Prize in Leadership Award scheme started, it has held consistently annually and has now evolved to become one of Africa’s most respected award schemes.\n“A cursory look across our continent shows that leadership remains a critical challenge in our body politic.\nThey either lack the character or the competence as well as the courage that true leadership entails.”The PUNCH reports that the 2020 award, is the 26th edition of the Zik Prize for Leadership."
  },
  {
    "headline": "Vigilante kills 3 over herbalist performing sacrifice with newborn in Rivers",
    "summarized_story": "By Davies Iheamnachor, PORT HARCOURTMEMBERS of a local vigilante group, Ahoada Security Planning Advisory Committee, ASPAC, have allegedly killed three persons for attempting to lynch their witch doctor caught conducting sacrifice with remains of a three-months-old baby Rivers State.\nThe incident was reported to have taken place at Edeoha community in Ahoada East Local Government Area of the state, yesterday.\nIt was learned that the suspected native doctor, called Dr Mike Indian, hails from Delta State, but resides in Edeoha, where he carries out his activities.\nA woman in the area claimed to have witnessed the incident, but did not want to be mentioned.\nShe alleged that the vigilante group on getting the hint of the development attacked and killed three persons they suspected to have been involved in the attack on the herbalist."
  },
  {
    "headline": "Ogun housewife connives with 3 men to kidnap husband",
    "summarized_story": "By James Ogunnaike, ABEOKUTAA housewife, Memunat Salaudeen, was Monday arrested by operatives of Ogun State police command for planning with three others to kidnap her husband.\nOyeyemi said: “The team accosted three young men namely, Olayinka Lawal, Asungba Nura and Usman Oluwatoyin, whose looks were highly suspicious on a motorcycle and stopped them for search.\n“While searching them, a cutlass and a new rope were recovered from them.\n“They further informed the police that the woman told them that was the only way she can get money from her husband, who she accused of being very stingy even though he has money.\n“The woman was, subsequently, brought to the scene, and on seeing the arrested suspects, she admitted being the brain behind the whole thing."
  },
  {
    "headline": "N270,000 Bill: Family abandons 17-yr-old mother of twins at Delta hospital",
    "summarized_story": "By Paul OlayemiA 17-year-old girl, Wehinmi Samson, has been abandoned at a private hospital in Sapele, Delta State over N270,000 unpaid bills, one month after she gave birth to twins at the hospital.\nWehinmi told Vanguard, yesterday, in Sapele that the boy, who impregnated her, absconded when he learned that she had twins October 4.\n“He has not come to see me since I gave birth though he has been coming around.\n“I have been in the hospital since October without being discharged by the management of the hospital.\n“The hospital bill keeps increasing every day and I don’t have alternative means to offset the hospital bills.”Mr Ashe Okon, a cleaner at the hospital, confirmed that the woman had been abandoned by her family."
  },
  {
    "headline": "VIDEO: Massive pipeline leakage in Ikeja",
    "summarized_story": "Massive pipeline linkage in IkejaAs NEMA issues safety warningBy Bose AdelajaMassive leakage of gas pipeline in Ikeja areas of Lagos State is reportedly ongoing.\nNEMA Acting Coordinator, Lagos State Territory, Ibrahim Farinloye confirmed the development on Wednesday just as he urged residents around Computer Village /Underbridge, Awolowo Way and Oba Akran axis, Anifowoshe street and Medical Road to avoid contacts with naked fire.\nHe said the agency received distress alerts about the incident some minutes ago.\nThe Acting Coordinator advised shops and business centers to be under lock and key pending when normalcy will return.\n“Distress alerts just received indicate massive leakage of gas pipeline around these areas."
  },
  {
    "headline": "COP 26: Buhari tells international partners to finance projects in Nigeria through gas",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAPRESIDENT Muhammadu Buhari has told international partners to finance projects using transition fuels such as gas in Nigeria.\n“For Nigeria, climate change is not about the perils of tomorrow but what is happening today.\nNigeria is committed to net zero by 2060.”Making a case for gas-based energy transition in Nigeria, President Buhari requested international partners to finance projects using transition fuels such as gas in Nigeria.\n“Consequently, I am requesting for financing of projects using transition fuels, such as gas.\nHe also told the COP26 Leaders’ Summit that Nigeria had developed a detailed energy transition plan and roadmap based on data and evidence."
  },
  {
    "headline": "Ibadan-based publisher, Bello dies after sustaining injuries in tricycle accident",
    "summarized_story": "Our correspondent gathered that Bello boarded a tricycle going to Apata on Monday evening before it was knocked down by a car along the road.\nOur correspondent gathered that Bello was until his death Publisher of CityHillNews, an online newspaper in Ibadan.\nHe previously worked as a reporter with the Nigerian Tribune newspaper.\nA former Editor of Nigerian Tribune, Dr. Abiodun Raufu described Bello’s death as shocking.\nOnce Marufh got to know that I was the editor of Nigerian Tribune, he told me that he was interested in becoming a journalist,” he said."
  },
  {
    "headline": "Delta: Suspected armed robber killed in gun duel with police",
    "summarized_story": "A suspected armed robber has reportedly died after he sustained serious injuries during an exchange of gunfire with a combined team of policemen and vigilantes from Ekpan Division, Uvwie Local Government Area in Delta State.\nThe suspect died in a hospital where he was rushed to for medical attention, DAILY POST can report.\nThe police also recovered a locally-made pistol, an expended cartridge, a live cartridge, 26 live 5.56mm ammunition and one empty AK-47 magazine from the suspect.\nIt was learnt that the police, while on routine patrol at Aka Avenue of Jakpa road, sighted unidentified armed men suspected to be armed robbers.\nWhile noting that the suspect died in the hospital where he was rushed to for medical treatments, the police image maker said,”Investigation is ongoing.”Suspected armed robber dies after gun duel with Police in Delta"
  },
  {
    "headline": "How gunmen kidnapped 66 worshippers from Kaduna church – Member",
    "summarized_story": "A member of Emmanuel Baptist Church, Kakkau Daji in Chikun Local Government Area of Kaduna State, Mr. Joshua Alamageni, has narrated how suspected gunmen numbering about 50 stormed the church in broad daylight, and kidnapped 66 members during service.\nDAILY POST recalls that suspected kidnappers had stormed the church on October 31, 2021, and kidnapped the worshippers.\nHe said the church was filled to capacity and members were singing praises and worshipping God when suddenly, they heard gunshots.\n“Everywhere was quiet as members’ praises to God came to an abrupt end.\n“The pastor of the church hid under the church table, as that wasn’t enough, he jumped through the window and ran into the bush."
  },
  {
    "headline": "Anambra election: We didn’t ask personnel to pay N10,000 as transport fare – Kogi CP",
    "summarized_story": "The Kogi State Commissioner of Police, Kogi State Commissioner of Police, Idrisu Dauda Dabban, has debunked an online media report that the command asked its personnel to pay the sum of N10,000 as transport fare to convey officers for the Anambra election this Saturday.\n“The Command did not request for any amount of money as transport fare from Officers deployed for the assignment.\n“The Commissioner of Police, while addressing the Officers deployed for the election stated that, the police authority is responsible for the transportation of it’s personnel to and fro to Anambra State.\nThe Command is surprised at the false and unfounded report on social media.\nDAILY POST reports that the Anambra election is slated for November 6th 2021."
  },
  {
    "headline": "DPR warns against fuel price hike",
    "summarized_story": "The Department of Petroleum Resources (DPR) in Bauchi State has cautioned petroleum marketers against unauthorised hike in pump price and hoarding of the product.\nHis warning came against the backdrop of long queues in some fuel servicing stations in parts of the state.\nHe said that the official pump price remains between N162 and N165 per litre.\n“Reports indicated that some filling stations outside Bauchi metropolis were dispensing fuel at N170 per liter.\nSuleiman said that the initial product cost at the depots was N148.26k but now rose to N157.50k hence the hike in price."
  },
  {
    "headline": "Anambra 2021: Visitors lament non availability of hotel accomodations",
    "summarized_story": "With barely three days to the Nov. 6 governorship election in Anambra visitors to the state are lamenting the difficulty in securing hotel accommodations.\nShe however said they would keep searching or resort to finding a hotel accommodation outside Awka town.\ncanvassing votes for APCSome newsmen accredited to cover the elections, who arrived in Awka since Tuesday also had challenges in getting hotel accommodation.\nA hotelier, Mr Uche Egwuibe, who works with a hotel at Agu-Awka GRA, said the hotel had been booked up till Nov. 10.\n“Many of our guests booked ahead of time and they have started arriving."
  },
  {
    "headline": "Panic on Abuja-Keffi road as Army mounts roadblock",
    "summarized_story": "Thousands of civil servants and artisans were stranded on the ever-busy Abuja-Keffi road as military officers mounted roadblocks against commercial and private commuters.\nWorkers, who left homes as early as 5 am for their respective working places, were stranded inside their vehicles in the early hours of Wednesday.\n- Advertisement -Finding revealed that the road was blocked at the Kugbo Mechanic village section of the Abuja axis.\nNo reason has yet been offered for the return of the roadblock against traffic that was suspended for more than two years now.\nMost of the commercial drivers lamented the sudden return of the military on the road and pleaded with government authorities to look into their plights."
  },
  {
    "headline": "Art Master Africa contest winners emerge",
    "summarized_story": "BIC has announced the winners of its flaship ‘Art Master Africa’ competition.\n- Advertisement -The ‘Art Master Africa’ winners included one continent-wide winner as well as 11 winners from countries within the region.\n- Advertisement -Continent wide, Ugandan artist Gayi Eric was named the 2021 BIC Art Master of Africa.\nI am grateful for BIC for running the Art Master Africa competition which allows talent across the region to express themselves through art and creativity.\nHuman expression and creativity are core values of BIC, and the inception of the Art Master Africa competition is testament to that."
  },
  {
    "headline": "UPDATED: Gunmen kill two policemen in Rivers, snatch AK47 rifle",
    "summarized_story": "Gunmen have killed two policemen on a stop-and-search duty at Diobu axis of Port Harcourt, Rivers State.\nRead Also: Gunmen abduct two Edo pupilsThe Police Public Relations Officer, Nnamdi Omoni, confirmed the attack and said the hoodlums snatched the AK47 rifle of one of the victims.\n- Advertisement -He said: “I can confirm the attack on our men posted to Okija street on stop and Search by unknown gunmen last night.\nOne Toyota COROLLA with Reg.no Rivers ABU 380 AW used by the attackers was abandoned.\nOne AK47 Rifle belonging to one of the Officers carted away”."
  },
  {
    "headline": "BREAKING: Troops on high alert in Abuja over reports of planned attack on capital",
    "summarized_story": "From Molly Kilete, AbujaThere is palpable tension in Abuja, FCT, following security reports of a planned attack on the Nigerian capital by bandits and terrorists.\nSecurity reports obtained by the military late Tuesday night indicated that attackers were planning to enter the FCT through the Abuja-Keffi expressway and other entry points.\nTroops have been placed on high alert and are deployed to strategic locations where they are mounting security checkpoints to monitor, prevent and arrest any potential attackers.\nSome residents told Daily Sun that they left their homes as early as 6:30 am but are yet to arrive at their places of work.\nWhen contacted, the Commander of the Guards Brigade confirmed the security measures at checkpoints by soldiers."
  },
  {
    "headline": "BREAKING: NEMA issues alert over gas leak in Ikeja area",
    "summarized_story": "The National Emergency Management Agency (NEMA) has issued alert to Lagosians residing around Computer Village /Ikeja Under bridge, Awolowo Way and Oba Akran axis, up to Onifowose Street, and Medical Road about massive gas leak in the area.\nNEMA is statement by spokesman Ibrahim Farinloye said these residents must not open shops or use open naked fire for safety reason.\nThe statement said distressed alert just received indicates massive leakage of gas from a broken pipeline around these areas.\nDetails soon…100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "Death toll in Lagos building collapse hits 20",
    "summarized_story": "As part of investigation of the remote and immediate causes of the incident, Governor Babajide Sanwo-Olu has ordered indefinite suspension of Mr. Oki.\nThe investigation is not part of the internal probe already being conducted by the government.”Sanwo-Olu assured that government would find out what went wrong and punish those indicted.\nThe Lagos State Bricklayer Association of Nigeria has called for inclusion of its members in the independent panel set up by the state government to probe the collapsed building.\n•Tinubu reactsFormer Lagos State governor and All Progressives Congress National Leader, Asiwaju Bola Tinubu, has backed Governor Sanwo-olu on the probe.\n“We have mobilised immediate rescue operations through the NEMA Team from the Lagos Territorial Office to team up with the state SEMA."
  },
  {
    "headline": "Gunmen attack residence of Yoruba self-determination leader, Akintoye",
    "summarized_story": "From Oluseye Ojo, IbadanGunmen have attacked the residence of a Second Republic Senator and leader of the apex Yoruba self-determination group, Ilana Omo Oodua (IOO), Prof Banji Akintoye.\nThe gunmen were said to have fired into Akintoye’s house and premises after they climbed with a chair outside the gate.\nA source said Akintoye was not around at the time the gunmen struck and nobody was hurt during the attack.\nBut bullets suspected to be from AK-47 rifles were recovered.\nThe bullets were suspected to have dropped from the ceiling onto the floor of the house."
  },
  {
    "headline": "Odili: Invasion impunity taken too far, Supreme Court fumes",
    "summarized_story": "From Godwin Tsa, Abuja, Abuja and Christopher OjiThe Supreme Court has described the raid on the Abuja residence of Justice Mary Odili by security operatives as an impunity taken too far.\nSpeaking with journalists after the meeting, Awomolo said the group also plans to meet with the Chief Justice of Nigeria (CJN) on the issues.\nJustice Mary Peter Odili on Friday 29” October, 2021 in a Gestapo manner.\n“We wish to make it abundantly clear that the Nigerian Judiciary is the third arm of the government of the Federal Republic of Nigeria and should be respected and treated as such.\n“The Nigerian Judiciary cannot only bark, but can also bite."
  },
  {
    "headline": "Anambra Poll: Capacity to Mobilise Voters Despite Security Challenges May Be the Decider",
    "summarized_story": "Soludo, a former governor of the Central Bank of Nigeria (CBN), was believed to have put up a good showing and expectedly big on data, given his background.\nAt the debate, therefore, Uba was of the opinion that the agitation for secession had only become pronounced because of growing unemployment.\n“The governor is the chief security officer of the state.\nYet, many people believed the debate had inadvertently exposed Uba’s poor intellectual capacity as his answers were said to have shown lack of substance, in addition to his seeming bland personae.\nAbove all, some also believed Ozigbo was not street smart, at least from his demeanor and answers."
  },
  {
    "headline": "Raid on Justice Odili’s House Impunity Taken Too Far, Says Supreme Court",
    "summarized_story": "It was the first reaction of the Supreme Court to the incident, which occurred on Friday.\nOver 50 security operatives, comprising personnel of the Nigeria Police and the Economic and Financial Crimes Commission (EFCC), had invaded Odili’s house situated at 7 Imo River Street, Maitama, Abuja.\nThe apex court described the action of the security operatives as uncivilised and a shameful show of primitive force on an innocent judicial officer.\nThe statement said, “We are alarmed with the news of the unwarranted and despicable raid on the official residence of one of our senior justices in the Supreme Court, Hon.\n“It is clear that the attack on Justice Odili is part of a renewed script by the APC."
  },
  {
    "headline": "Furious Sanwo-Olu Visits Ikoyi Building Collapse Scene, Suspends LASBCA GM",
    "summarized_story": "He had earlier ordered the indefinite suspension of General Manager of the Lagos State Building Control Agency (LASBCA), Mr. Gbolahan Oki.\nThe death toll from the building collapse rose to 19 on Tuesday, though nine persons were pulled out alive from the rubble.\nThe Inspector-General of Police (IGP), Mr. Usman Baba, visited the scene of the building collapse on Tuesday.\nFemi Gbajabiamila, also expressed his sympathies to the government and families of victims of the building collapse.\nThe nine persons rescued from the debris of the Ikoyi building collapse on Tuesday – all men – were taken to the hospital for treatment."
  },
  {
    "headline": "Supreme Court: Raid on Justice Odili’s House Appeared Like Mission to Kill, Maim",
    "summarized_story": "*Says raid on apex court justice’s residence is impunity taken too farAlex Enumah in AbujaThe Supreme Court of Nigera, the apex court in the land on Tuesday said that the raid on the Abuja residence of Justice Mary Peter-Odili, the next in line to the Chief Justice of Nigeria (CJN) is “an impunity taken too far”.\nSecurity operatives claiming to be investigating alleged act of illegal activities had invaded the house of Justice Mary Odili situated at number 7 Imo River Street, Maitama, Abuja.\nThe apex court which said it was saddened by the development described the action of the security operatives as uncivilized and shameful show of primitive force on innocent judicial officer.\nThe statement read in part, “We are alarmed with the news of the unwarranted and despicable raid on the official residence of one of our senior justices in the Supreme Court, Hon.\nThe statement disclosed that the apex court has commenced a full-scale independent investigation to unravel the true masquerades behind the mystery as well as the real motives behind the whole imbroglio."
  },
  {
    "headline": "Breaking: Lagos Sets up Probe Panel, Suspends Building Control GM",
    "summarized_story": "Segun JamesThe Lagos State Government is setting up an independent panel to probe the collapse of the 21-storey high-rise building on Gerrard Road, Ikoyi.\nThis is as Governor Babajide Sanwo-Olu has ordered the indefinite suspension of the General Manager of the Lagos State Building Control Agency (LASBCA), Mr. Gbolahan Oki.\nAlso nine more persons have been rescued from under the rubles of the building even as the death toll has risen to 14.\nThe statement however said that the investigation is not part of the internal probe already being conducted by the government.\nHe left the site for the Lagos Island General Hospital to see the survivors."
  },
  {
    "headline": "Court Fixes January 9 For Ruling On Suit Challenging SaharaReporters' Story On Corrupt Lifestyle Of Attorney-General, Malami",
    "summarized_story": "The group had on July 20, 2020 in a suit marked FHC/ABJ/CS/816/2020 dragged Sahara Reporters, Vanguard Media Limited and two others before the court demanding N2billion from them over alleged defamatory publications.\nSee Also Sahara Reporters REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son UncoveredMalami also bought a house in 2020 worth N150million in the Gwarimpa area of Abuja.\nSee Also Exclusive #MalamiGate: Multi-billion Naira Properties Of Nigeria's Attorney-General Abubakar Malami's Family Acquired After He Got Appointed As The Minister Of JusticeThe trial judge therefore adjourned the matter to January 9, 2022 for ruling.\nRecall that in January, the suit suffered a setback due to the absence of the judge handling the matter.\nThe matter could not hold as scheduled as the trial judge was said to have gone for a seminar."
  },
  {
    "headline": "Court Fixes January 9 For Ruling On Suit Challenging SaharaReporters' Story On Corrupt Lifestyle Of Attorney-General, Malami",
    "summarized_story": "The group had on July 20, 2020 in a suit marked FHC/ABJ/CS/816/2020 dragged Sahara Reporters, Vanguard Media Limited and two others before the court demanding N2billion from them over alleged defamatory publications.\nSee Also Sahara Reporters REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son UncoveredMalami also bought a house in 2020 worth N150million in the Gwarimpa area of Abuja.\nSee Also Exclusive #MalamiGate: Multi-billion Naira Properties Of Nigeria's Attorney-General Abubakar Malami's Family Acquired After He Got Appointed As The Minister Of JusticeThe trial judge therefore adjourned the matter to January 9, 2022 for ruling.\nRecall that in January, the suit suffered a setback due to the absence of the judge handling the matter.\nThe matter could not hold as scheduled as the trial judge was said to have gone for a seminar."
  },
  {
    "headline": "‘Enough Is Enough, We Can Bite’ – Nigeria’s Supreme Court Sends Warning To Buhari Government Over Raid On Justice Odili’s Home",
    "summarized_story": "The Supreme Court has sternly condemned the invasion of the residence of one of its own, Justice Mary Odili by security operatives last Friday.\nThe apex court said the security operatives seemed to have been on a mission to “kill and maim” her.\nSee Also Legal Security Operatives Raid Supreme Court Judge, Odili’s Residence In AbujaJustice Odili is the wife of a former Governor of Rivers State, Peter Odili.\nIt, therefore, sent a message to the Muhammadu Buhari-led executive arm of government, which controls security operatives, saying “enough is enough”.\nSee Also Exclusive EXCLUSIVE: How Police Commander Under Attorney-General Malami’s Ministry Manipulated Abuja Magistrate For Warrant To Raid Justice Odili’s ResidenceThe statement read, “We are alarmed with the news of the unwarranted and despicable raid on the official residence of one of our senior justices in the Supreme Court, Hon."
  },
  {
    "headline": "‘Enough Is Enough, We Can Bite’ – Nigeria’s Supreme Court Sends Warning To Buhari Government Over Raid On Justice Odili’s Home",
    "summarized_story": "The Supreme Court has sternly condemned the invasion of the residence of one of its own, Justice Mary Odili by security operatives last Friday.\nThe apex court said the security operatives seemed to have been on a mission to “kill and maim” her.\nSee Also Legal Security Operatives Raid Supreme Court Judge, Odili’s Residence In AbujaJustice Odili is the wife of a former Governor of Rivers State, Peter Odili.\nIt, therefore, sent a message to the Muhammadu Buhari-led executive arm of government, which controls security operatives, saying “enough is enough”.\nSee Also Exclusive EXCLUSIVE: How Police Commander Under Attorney-General Malami’s Ministry Manipulated Abuja Magistrate For Warrant To Raid Justice Odili’s ResidenceThe statement read, “We are alarmed with the news of the unwarranted and despicable raid on the official residence of one of our senior justices in the Supreme Court, Hon."
  },
  {
    "headline": "‘Enough Is Enough, We Can Bite’ – Nigeria’s Supreme Court Sends Warning To Buhari Government Over Raid On Justice Odili’s Home",
    "summarized_story": "The Supreme Court has sternly condemned the invasion of the residence of one of its own, Justice Mary Odili by security operatives last Friday.\nThe apex court said the security operatives seemed to have been on a mission to “kill and maim” her.\nSee Also Legal Security Operatives Raid Supreme Court Judge, Odili’s Residence In AbujaJustice Odili is the wife of a former Governor of Rivers State, Peter Odili.\nIt, therefore, sent a message to the Muhammadu Buhari-led executive arm of government, which controls security operatives, saying “enough is enough”.\nSee Also Exclusive EXCLUSIVE: How Police Commander Under Attorney-General Malami’s Ministry Manipulated Abuja Magistrate For Warrant To Raid Justice Odili’s ResidenceThe statement read, “We are alarmed with the news of the unwarranted and despicable raid on the official residence of one of our senior justices in the Supreme Court, Hon."
  },
  {
    "headline": "Gunmen kill two police officers in Rivers",
    "summarized_story": "Gunmen have killed two police officers in Port Harcourt, Rivers state capital.\nThe police officers were reportedly killed on Okija street on Tuesday.\nThe gunmen were said to have been in a vehicle when they shot at the officers who were on duty.\nAdvertisementThe officers reportedly died on the spot.\nIn May, gunmen killed seven police officers at two police stations and at a checkpoint."
  },
  {
    "headline": "Gunmen kill two police officers in Rivers",
    "summarized_story": "Gunmen have killed two police officers in Port Harcourt, Rivers state capital.\nThe police officers were reportedly killed on Okija street on Tuesday.\nThe gunmen were said to have been in a vehicle when they shot at the officers who were on duty.\nAdvertisementThe officers reportedly died on the spot.\nIn May, gunmen killed seven police officers at two police stations and at a checkpoint."
  },
  {
    "headline": "NEMA asks residents to avoid open fire after major gas leak in Lagos",
    "summarized_story": "The National Emergency Management Agency (NEMA) has asked residents of Ikeja in Lagos state to avoid open fire owing to a gas pipeline leakage in the area.\nAdvertisementThe affected areas include Computer Village, Ikeja Underbridge end of Awolowo Way, Oba Akran axis, Anifowose Street, and Medical Road.\nIn a statement issued by Ibrahim Farinloye, the spokesperson for NEMA (south-west), on Wednesday, the agency asked residents to take safety precautions to prevent any form of disaster as a result of the gas leakage.\n“Residents around Computer Village, Underbridge Awolowo Way, and Oba Akran axis, Anifowose Street, Medical Road must not open shops or use open naked fire for safety reasons,” he said.\nAdvertisement“Distressed alert just received indicates massive leakage of gas pipeline around these areas.”"
  },
  {
    "headline": "NEMA asks residents to avoid open fire after major gas leak in Lagos",
    "summarized_story": "The National Emergency Management Agency (NEMA) has asked residents of Ikeja in Lagos state to avoid open fire owing to a gas pipeline leakage in the area.\nAdvertisementThe affected areas include Computer Village, Ikeja Underbridge end of Awolowo Way, Oba Akran axis, Anifowose Street, and Medical Road.\nIn a statement issued by Ibrahim Farinloye, the spokesperson for NEMA (south-west), on Wednesday, the agency asked residents to take safety precautions to prevent any form of disaster as a result of the gas leakage.\n“Residents around Computer Village, Underbridge Awolowo Way, and Oba Akran axis, Anifowose Street, Medical Road must not open shops or use open naked fire for safety reasons,” he said.\nAdvertisement“Distressed alert just received indicates massive leakage of gas pipeline around these areas.”"
  },
  {
    "headline": "NBET: Why Nigeria sells electricity to neighbouring countries",
    "summarized_story": "The Nigerian Bulk Electricity Trading (NBET) says the country sells electricity to neighbouring countries for strategic reasons.\nEwelukwa was responding to questions of why Nigeria sells electricity to other nations when the country does not have enough for its populace.\nAdvertisementHe said the federal government is working on structures that will enhance power distribution in the country.\n“The Central Bank of Nigeria (CBN) is currently supporting the funding of interface projects between transmission and distribution companies.\nAdvertisement“The sector regulator, Nigeria Electricity Regulatory Commission (NERC), has also concluded performance improvement plans for each of the distribution companies."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "Nigeria’s E-Settlement acquires Côte d’Ivoire’s QuickCash to increase financial inclusion across Africa",
    "summarized_story": "E-Settlement (E-SL), a Nigerian fintech group of companies, has acquired QuickCash, an Ivorian electronic payment and money transfer company, to expand and boost last-mile access to financial services in Francophone African countries like Côte d’Ivoire, Burkina Faso, Niger, Togo and more.\n“QuickCash is deepening access for agricultural-dominated areas, rural populations, the underbanked and unbanked: the disproportionately financially excluded.\n“At E-SL, we want to empower all by accelerating access to payments, financial services, and jobs.\nPatricia Zoundi Yao, CEO at QuickCash believes that E-SL has the “right vision and deep expertise” to drive QuickCash’s geographic expansion and next stage of growth.\n“E-SL is a leading payment services provider with a strong position in Nigeria’s fintech ecosystem."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "Nigerian eCommerce platform, MallforAfrica, has shut down operations, possible rebranding could be imminent",
    "summarized_story": "Share this article:Africa-focused eCommerce platform, MallforAfrica seems to have suspended operations in Nigeria.\nHowever, MallforAfrica seems to have followed the likes of Dealdey and Gloo in shutting down its eCommerce operations.\nAnd on the same day, the company announced the termination of Poole’s directorship.\nOn March 8, 2019, the company announced that it was terminating Temitope Folayan’s (co-founding brother) appointment as director.\nOn February 13, 2020, the company announced Temitope Lawani, a Managing Partner at Helios Investment as a director."
  },
  {
    "headline": "Dangote Cement, MTN, Airtel set to beat 2021 revenue target",
    "summarized_story": "Thanks to higher demand for cement, Nigeria’s largest producer of building material recorded N1.02 trillion in revenue in the first nine months of 2021.\nThat is less than 0.5 percent of the N340 billion average quarterly revenue the company has reported this year.\nThe cement maker’s profit jumped 33.6 percent to N278 billion in the said period from N208 billion last year.\nAny improvement on the revenue made in 2020 will be enough to see the telecom giant surpass its target for 2021.\nThere was double-digit growth across all the regions Airtel Africa operates in the first half of 2021 ended September (Airtel has a unique calendar)."
  },
  {
    "headline": "Why some retirees can’t access pension",
    "summarized_story": "Access to pensions at the point of retirement is a key objective of Nigeria’s Contributory Pension Scheme (CPS), but unfortunately some retirees still have difficulty achieving this when they leave employment.\nFor instance, some of the account holders are discovered to have registered with more than one PFA, meaning they have more than one Retirement Savings Account (RSA) PIN Number.\nRead Also: Contributory Pension Scheme: Retirees now access monthly pay with easePenCom in an advertorial said, “The Federal Government of Nigeria has made it mandatory that every Nigerian must have a National Identification Number (NIN).\nThe ECRS is an electronic platform designed by the Commission for PFAs to carry out bio-data updates and edits of their clients’ information on the National Databank maintained by the National Pension Commission.\n“We are required to link your NIN to your RSA account to eliminate duplicates and ensure compliance with the National minimum bio-data requirements."
  },
  {
    "headline": "DMO to issue N250bn sovereign Sukuk, appoints transaction advisers",
    "summarized_story": "The Debt Management Office (DMO) has announced plans to issue fresh Sovereign Sukuk worth between N200 and N250 billion before year end to finance critical road projects across the country.\nThis is the highest sum that the Nigerian government would be raising from a single sukuk issuance.\nFor three straight years now, the Nigerian government, through the DMO has raised a total of N362.577 billion from sovereign sukuk, in oversubscribed issuance deals.\nIn a statement, the DMO said it has already appointed transaction parties for the upcoming issuance through the Open Competitive Bidding Process for the issuance of the fourth Sovereign Sukuk.\nThe transaction parties and their respective roles include, Stanbic IBTC Capital Limited, Greenwich Merchant Bank Limited and Vetiva Capital Management Limited are the Issuing Houses; BURAQ Capital Limited are the Financial Adviser; FBNQuest Trustees Limited and APEL Capital & Trust Limited are the Trustees; while Abdulai, Taiwo & Co. Solicitors and Tsedaqah Attorneys were appointed as Legal Advisers."
  },
  {
    "headline": "Alaghodaro 2021: Dangote, Okomu, Presco eye Edo investment opportunities as summit nears – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – As Edo readies for the Alaghodaro Summit 2021, big ticket investors including the Dangote Group, Okomu Plc and Presco Plc have declared interest to wholly participate in the summit, leveraging the platform to tap into the investment opportunities created by the business-friendly disposition of the Governor Godwin Obaseki-led state government.\nThe summit, in its fifth edition, is scheduled to take place between November 12 and 14, 2021, with the theme, “Edo of Our Dreams: Building a Sustainable Future.”The annual summit, to mark the governor’s anniversary in office, showcases investment opportunities in the state and the numerous achievements, reforms and initiatives by the administration to improve the living standard of the people.\nAccording to him, “This year’s summit promises to be even more exciting, as it will showcase a number of the transformative policies and programmes by the state government targeted at further easing up the space for private investment and building a productive, efficient and result-driven civil and public service.\n“While Okomu and Presco are poised to expand their plantation, Dangote is planning to accelerate its investment in the solid mineral sector, especially with its cement manufacturing plant, which is already operational in the state.\n“Governor Obaseki has continued to prioritise inflow of investment into the state with bold and investor-friendly policies, which has resulted in the setting up of a number of industrial plants, including modular refineries, gas processing plants, energy parks, an inland dry port, among others,” Osagie noted."
  },
  {
    "headline": "State Govts. Urged to review the Childs right law to Provide quality care for vulnerable children in Nigeria – Nigerian Observer",
    "summarized_story": "This appeal was made during a two-day media engagement and capacity building workshop organized by the SOS Children’s Villages in Lagos recently.\nAccording to him, “the SOS Children’s Villages have been active since 1973 and offers a number of services, alternative care for children, family strengthening and partnership for quality care.\nAs part of the alternative care we offer direct care to children without parental care, using our family care option and we do this in Lagos, Ogun state, FCT and in Plateau state.\nAlready, we are supporting the federal government of Nigeria to develop a National guideline on alternative care for children.\nIn Lagos state, the alternative care guideline has been developed and validated by the state government through the support of SOS children’s Villages and other partners."
  },
  {
    "headline": "Ikoyi building collapse: Obaseki commiserates with Sanwo-Olu, victims’ families – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commiserated with his Lagos State counterpart, Babajide Sanwo-Olu, the families of victims and the people of Lagos State over the building collapse at Ikoyi, Lagos State, which has reportedly claimed the lives of at least 10 persons.\nThe governor, who expressed sadness over the incident, urged the authorities to beef up emergency operations to ensure the rescue of those still trapped under the rubble.\nAccording to him, “We are deeply saddened by the news of the collapse of a 21-storey building in Ikoyi, Lagos.\nOur hearts are with the Government and people of Lagos State, especially the families who lost their loved ones in this incident.\n“On behalf of the government and good people of Edo State, I offer my deepest condolences to Governor Babajide Sanwo-Olu, the people of Lagos State and the affected families over this painful incident.”..."
  },
  {
    "headline": "Obaseki launches EdoSTEP to enhance, transform Edo civil, public service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, inaugurated the Edo State Civil/Public Service Transformation and Enhancement Programme (EdoSTEP), a new initiative to improve efficiency and service delivery in the state’s civil and public service.\nAccording to him, “As you can see, we are no longer going to employ people into the civil and public service on the basis of ‘man know man’ in Edo.\nWe must position the civil service to be the best employer of labour.\nCivil service cannot just be only for old people; it should also be attractive to young people.\nWe want Edo State civil and public service to be an employer of choice,” the governor added."
  },
  {
    "headline": "UK firm trains Nigerian senators on optimising nation-building potentials",
    "summarized_story": "A leading UK firm, TEXEM UK, has completed a five-day training for Nigerian senators on optimising their legislative functions for nation-building.\nThe statement affirmed that the senators of the ninth Nigerian Assembly had a very engaging and insightful time during the Legislative Development Programme organised by TEXEM from October 11 to October 15 at Birmingham, UK.\nA faculty, Ms Laline, also spoke on the Nigerian senators.\nSenators Kwari and Odebiyi delivered the vote of thanks at the end of the deliberations, according to the statement.\nTEXEM is a leading consulting firm that is passionate about educating senior executives and African leaders."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Unilever Nigeria records N58.7bn turnover in Q3 unaudited results",
    "summarized_story": "Unilever Nigeria Plc has recorded turnover of N58.7 billion in the third quarter of 2021, which represents 31% topline growth compared to N44.7 billion turnover recorded in the corresponding period in 2020.\nThis is according to the company’s released unaudited interim report for the period ended 30th September 2021.\nThe result showed that the company recorded a gross profit of N15.9 billion for the period ended 30th September 2021 which is 61% up versus N9.9 billion reported for same period last year.\nOverall, Unilever recorded profit after tax of N1.08 billion for the period ended 30th September 2021 compared to a loss after tax of N2.06 billion reported for the corresponding period in 2020.\nSpeaking on the results, the Corporate Affairs and Sustainable Business Director, Soromidayo George said that, while the organisation remains focused on its strategy to deliver sustainable growth, Unilever is pleased with its performance, riding on the pillars of operational efficiency, cost optimization, purposeful brands and increasing market share across key categories,“Unilever Nigeria will continue to monitor the business environment and respond appropriately to the challenges in the operating environment as well as disruptions from the Covid-19 pandemic,” she added"
  },
  {
    "headline": "Fourteen dead, owner missing in Lagos building collapse",
    "summarized_story": "Fourteen bodies have so far been recovered from the rubble of a collapsed 21-storey building in Ikoyi area of Lagos, as rescue effort enters day three, even as the owner of the building, Femi Osibona, is reported to have also died.\nThe high-rise, which was still under construction collapsed on Monday afternoon, with over 50 persons reportedly still trapped under the ruins.\nOsibona, owner of Fourscore Homes, the developing company in charge of the building, was said to have been trapped in the rubble.\nOn Monday evening, a witness had said Osibona was in the building when it collapsed.\nThere were indications on Wednesday morning that he may have died in the rubble."
  },
  {
    "headline": "Sanwo-Olu suspends Lagos building agency boss, Gbolahan Oki over building collapse",
    "summarized_story": "Lagos State governor, Mr. Babajide Sanwo-Olu, has suspended the general manager of the Lagos State Building Control Agency (LASBCA), Gbolahan Oki following the collapse of a 21-storey building in the Ikoyi area of the state.\n“The Lagos State Government is setting up an independent panel to probe the collapse of the 21-storey building on Gerrard Road, Ikoyi.\n“Governor Babajide Sanwo-Olu has said the government will surely find out what went wrong and punish those indicted.\nThe Governor, as a first step, has directed that the General Manager of the Lagos State Building Control Agency (LASBCA), Mr. Gbolahan Oki, an architect, be suspended from work immediately.\n“These tests, particularly the borehole acidic level, is important for the entire Gerrard Road and adjoining areas,” the commissioner said."
  },
  {
    "headline": "EFCC detains Obi Cubana for second night",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), detained socialite and businessman, Obinna Iyiegbu, popularly called Obi Cubana, for a second night spent the second night on Tuesday.\nCubana was invited by the commission on Monday, and is being interrogated by the anti-corruption agency for alleged money laundering and tax fraud.\nSo, again, why is Obi with EFCC and not Tinubu or Kyari?\n‘’I don’t know whether he will be released this night (Tuesday night), but as I am talking to you, he is still with us,’’ he said.\nObi Cubana had made headlines in July when he hosted a lavish burial for his mother in Oba, Anambra State."
  },
  {
    "headline": "Unknown Gunmen Kill 2 Policemen In Rivers",
    "summarized_story": "Unknown gunmen on Tuesday night opened fire on a police checkpoint in Port Harcourt, the Rivers State capital, killing no fewer than two policemen.\nLEADERSHIP gathered that the slain policemen were among those conducting ‘Stop and Search’ along Okija Street in Mile 2 area of Diobu, Port Harcourt when the incident happened.\nThe eyewitness stated that the gunmen, who were inside a vehicle, swooped on the Policemen and shot at the them at close range.\nHe said: “I can confirm the attack on our men posted to Okija street on stop and Search by unknown gunmen last night.\nOne Toyota Corolla with Reg.No Rivers ABU 380 AW, used by the attackers was abandoned."
  },
  {
    "headline": "Unknown Gunmen Kill 2 Policemen In Rivers",
    "summarized_story": "Unknown gunmen on Tuesday night opened fire on a police checkpoint in Port Harcourt, the Rivers State capital, killing no fewer than two policemen.\nLEADERSHIP gathered that the slain policemen were among those conducting ‘Stop and Search’ along Okija Street in Mile 2 area of Diobu, Port Harcourt when the incident happened.\nThe eyewitness stated that the gunmen, who were inside a vehicle, swooped on the Policemen and shot at the them at close range.\nHe said: “I can confirm the attack on our men posted to Okija street on stop and Search by unknown gunmen last night.\nOne Toyota Corolla with Reg.No Rivers ABU 380 AW, used by the attackers was abandoned."
  },
  {
    "headline": "2023: Northern Youths Kick Against Zoning, Say Nigeria Must Get It Right",
    "summarized_story": "As debate on which region should produce the next president in 2023 continues, a Northern youth group has kicked against zoning.\nIf we get it right in 2023, Nigeria can begin the process of recovery.\nNigeria needs a President who is development-minded.\nNigeria needs a visionary leader who will take our country to a higher pedestal and reclaim our pride of place in Africa and the developing world.\nWe need a Pan-Nigerian who believes in Nigeria and prepared to make the necessary sacrifices to pull Nigerians together.”"
  },
  {
    "headline": "2023: Northern Youths Kick Against Zoning, Say Nigeria Must Get It Right",
    "summarized_story": "As debate on which region should produce the next president in 2023 continues, a Northern youth group has kicked against zoning.\nIf we get it right in 2023, Nigeria can begin the process of recovery.\nNigeria needs a President who is development-minded.\nNigeria needs a visionary leader who will take our country to a higher pedestal and reclaim our pride of place in Africa and the developing world.\nWe need a Pan-Nigerian who believes in Nigeria and prepared to make the necessary sacrifices to pull Nigerians together.”"
  },
  {
    "headline": "COP26: Kogi Woos Investors On Green Economy",
    "summarized_story": "In a bid to woo investors on the green economy, the Kogi State government has held meetings at the ongoing United Nations Framework Convention on Climate Change Conference of Parties (COP26).\nAccording to him, the PPP initiative was to allow the people to buy into the state cleaning process.\nOmofaiye stated that the government will through the agency continue to tackle ecological problems in the state.\nADVERTISEMENTThe Commissioner said that ecological problems in the state capital, Lokoja, and the majority of the local government areas had received the intervention of the state government.\nKogi is one of the states that has received a commendation for the success of NEWMAP activities in the state."
  },
  {
    "headline": "Botched show: Burna Boy, mum accused of extortion, promoter demands N28m refund",
    "summarized_story": "Nigerian singer and songwriter, Burna Boy and manager mum, Bose Ogulu have been accused of extortion by United States-based show promoter Emmanuel Chinyere Uzoh.\nUzoh, who is the CEO of Gold Moola Entertainment, made the allegation against Burna Boy and his mum on the company’s official Instagram handle on Tuesday.\nHe claims the singer refused to perform at a scheduled show despite being paid in full and how Burna Boy’s mom extorted him of $10,000.\nI asked for the $15k balance that was paid on the night and they refused to return the money.\nBe a stand-up guy and kindly return my money @burnaboygram.”There have been no comments or responses from Burna Boy, his mum and his management regarding the allegations."
  },
  {
    "headline": "Botched show: Burna Boy, mum accused of extortion, promoter demands N28m refund",
    "summarized_story": "Nigerian singer and songwriter, Burna Boy and manager mum, Bose Ogulu have been accused of extortion by United States-based show promoter Emmanuel Chinyere Uzoh.\nUzoh, who is the CEO of Gold Moola Entertainment, made the allegation against Burna Boy and his mum on the company’s official Instagram handle on Tuesday.\nHe claims the singer refused to perform at a scheduled show despite being paid in full and how Burna Boy’s mom extorted him of $10,000.\nI asked for the $15k balance that was paid on the night and they refused to return the money.\nBe a stand-up guy and kindly return my money @burnaboygram.”There have been no comments or responses from Burna Boy, his mum and his management regarding the allegations."
  },
  {
    "headline": "Delayed flight: Reps, others drag Azman Air to court, demand N5 billion",
    "summarized_story": "Some members of the house of representatives and four other persons have instituted a N5 billion suit against Azman Air Services Limited over alleged breach of contract.\nTheCable had reported how the lawmakers and other passengers were stranded at the Aminu Kano international airport in Kano state on September 22 on their way to Abuja.\nThe flight was reportedly delayed from 12:30pm till 2:30pm, then till 6pm, and again till 9:45pm.\nThey are seeking an order of court directing the defendant to pay the sum of N5 billion as general damages.\nThe claimants also asked the court to order the defendant to publish a written public apology on three national dailies — The Sun newspaper, ThisDay and The Guardian."
  },
  {
    "headline": "Delayed flight: Reps, others drag Azman Air to court, demand N5 billion",
    "summarized_story": "Some members of the house of representatives and four other persons have instituted a N5 billion suit against Azman Air Services Limited over alleged breach of contract.\nTheCable had reported how the lawmakers and other passengers were stranded at the Aminu Kano international airport in Kano state on September 22 on their way to Abuja.\nThe flight was reportedly delayed from 12:30pm till 2:30pm, then till 6pm, and again till 9:45pm.\nThey are seeking an order of court directing the defendant to pay the sum of N5 billion as general damages.\nThe claimants also asked the court to order the defendant to publish a written public apology on three national dailies — The Sun newspaper, ThisDay and The Guardian."
  },
  {
    "headline": "President Buhari Sends Message To Sultan Of Sokoto Over His 15 Years On Throne.",
    "summarized_story": "On the occasion of the Sultan of Sokoto’s 15th year as the leader of the Muslim Ummah and Chairman of the Sokoto State Council of Traditional Rulers, President Muhammadu Buhari sent him a greeting on Tuesday.\nBuhari’s message to the monarch was conveyed in a statement to report and signed by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nBuhari described the Sultan as a “peacebuilder and a true embodiment of commitment to service,” adding that he’s a leader who dedicated his life to the welfare of the people.\nThe statement read, “Greetings to His Eminence, the Sultan in his 15th year on the throne of his fathers.\n“It’s very reassuring to have such leadership at these challenging times.”Buhari also prayed Allah to grant the Sultan long and healthy life."
  },
  {
    "headline": "We’ve Evidence Of Tinubu’s Corruption, Arrest Him And Leave Obi Cubana – Reno Tells EFCC.",
    "summarized_story": "Reno Omokri, a former presidential aide, has petitioned the Economic and Financial Crimes Commission (EFCC) to release billionaire businessman Obi Cubana and arrest APC national leader Bola Tinubu.\nIn a post on his verified Facebook page on Wednesday, Reno accused the EFCC of being selective in their operations.\nThe post reads, “Why are EFCC after Obi Cubana and not Bola Tinubu?\nWe provided evidence of Tinubu’s corruption to the EFCC, including photos of bullion vans going into his home on Election Day, contrary to the Money Laundering Act.\n“Where is the evidence against Obi Cubana?"
  },
  {
    "headline": "Facebook To Delete One Billion Users’ Facial Recognition Profiles",
    "summarized_story": "Following its public declaration that it would be shutting down its face recognition system due to concerns and criticism regarding the technology used, this announcement was made.\n“We’re shutting down the Face Recognition system on Facebook.\nPeople who’ve opted in will no longer be automatically recognised in photos and videos, and we will delete more than a billion people’s individual facial recognition templates,” Meta said in a blog post.\nFacebook had introduced facial recognition in 2010, enabling photographs uploaded by users to be automatically tagged with names.\nIn 2012, a Facebook application to introduce facial recognition in the European Union was withdrawn because there was no provision to gain user consent."
  },
  {
    "headline": "BREAKING: Massive Pipeline Leakage In Ikeja [PHOTOS]",
    "summarized_story": "The National Emergency Management Agency (NEMA) has raised an alarm following a report of a gas pipeline leakage in some parts of Ikeja, Lagos State Capital.\nAccording to the southwest coordinator of NEMA, Mr Ibrahim Fariloye, the affected parts of Ikeja are Computer Village /Underbridge Awolowo Way and Oba Akran.\nOther areas affected include Onifowose Street, Medical Road.\nHe strongly advised occupants of computer village “not open shops or use open naked fire”.\n“Distressed alert just received indicates massive leakage of gas pipeline around these areas,” he told News Direct."
  },
  {
    "headline": "Ni ce mace ta farko da aka fara ba wa shugabar jam’iya a Katsina – Mariya Abdullahi",
    "summarized_story": "Manhaja ta tattauna da Hajiya Mariya Abdullahi akan batutuwan da suka haɗa da aikin gwamnati, siyasa, abubuwan da suka shafi mata da kuma ƙalubale da nasarori da ta samu a rayuwarta:Hajiya masu karatu za su so su ji taƙaitaccen tarihinki?\nAn tura ni don inyi kwasa-kwasai a wasu jihohin Nijeriya kamar Lagos da kuma ƙasashen waje don mu ƙara gogewa a kan aikin mu.\nDon haka ko na tsaya takara ko ban tsaya ba ina tare da shugabannin siyasa kuma su kan nemi shawarata.\nDuk macen da ta san bata da ilimin da za ya taimaka mata don ta cimma burinta na rayuwa ya kamata ta dage ta nemi ilimin, ba a girma da neman ilimi saboda sai da ilimi ake gudanar da rayuwa.\nIna kuma ba mata shawara da su dage su nemi sana’a koda mace ta yi karatun boko ba lallai ba ne ta samu aikin gwamnati ba a yanzu, saboda abin ya yi yawa, don haka ya kamata ta tashi ta nemi sana’a don taimakawa kanta ko ‘ya’yan ta da ma mai gidanta."
  },
  {
    "headline": "Ruftawar bene: Mutane 10 sun rasa rayukansu a Legas",
    "summarized_story": ""
  },
  {
    "headline": "Kotun Ƙoli ta yi magana kan mamaye gidan Mai Shari’a Odili",
    "summarized_story": ""
  },
  {
    "headline": "An cafke mamallakin benen da ya ruguje a Legas saboda saɓa ƙa’ida",
    "summarized_story": ""
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Bandits strike in Abuja. Abduct varsity lecturers, family members -NigPilot",
    "summarized_story": "At least four varsity lecturers, family members have been kidnapped by yet to be identified gunmen suspected to be bandits following an attack on the Junior Staff Quarters of the University of Abuja in the Giri area of the nation’s capital Abuja.\nKidnapped victims include:, Comrades, Prof Obansa and his son, Prof Oboscolo, Son and daughters and Mall Sambo Mohammed and Dr Tobins.\nThe Vice-Chancellor University of Abuja, Professor Abdulrasheed Na’Allah in his word said, “On staff abduction my dear university community, they brought their devastation to our Giri Quarters and we are pursuing them with all it takes to recover our dearest ones they kidnapped.\n“Our nation is definitely bleeding and this is too close home for u.\nHe assured that the perpetrators would be arrested and brought to book."
  },
  {
    "headline": "You Can’t Win with Propaganda, Group Tells Soludo -NigPilot",
    "summarized_story": "A political pressure group Coalition for True Democracy (CTD) has told the candidate of the All Progressives Grand Alliance (APGA), Prof. Chukwuma Soludo, to reach out to the people with issues of governance instead of spreading empty propaganda against his opponents.\nThe group’s coordinator, Mr. Samuel Okolo stated this while reacting to a statement credited to Soludo, where he accused the candidate of the All Progressives Congress, APC, Senator Andy Uba of the kidnap of a sitting governor.\nHe said “It is obvious that Soludo has short memories, let us remind Soludo and his failed stakeholders of APGA that Sen. Andy Uba is a peace-loving man who detests violence.\nThere was a White Paper that came out during that period that cleared him from that allegation”.\nOkolo further stated when the event happened Sen. Any Uba was not even in the country."
  },
  {
    "headline": "Arewa youths lauds emergence of 25 years Suleiman as PDP national youth leader",
    "summarized_story": "Acting Coordinator of the Coalition of Arewa Youths group , Garkuwan Matasan Arewa, Amb.\nIsaac David, have commended a 25-year northern youth Hon Mohammed Kadade Suleiman that emerged as national youth leader of the People Democratic Party PDP.\n“It a clear fact that the energy and brightness of the minds of youths act as torchbearer for national development.\nSo, how come the youth leader of the most political party in Africa is above 50 years?\n“The youths are agents of change and the change we desire in others must start from us."
  },
  {
    "headline": "MURIC supports reconstitution of Arabic Education Board in Kwara -NigPilot",
    "summarized_story": "The committee had in its report recommended the regulation of Arabic and Islamic schools and also advised the government to immediately reconstitute the Arabic Education Board in the state.\nThe Justice Haroon-led committee recommended the regulation of Arabic and Islamic schools in the state and the reconstitution of the Arabic Education Board“MURIC commends the committee for treating the matter with military dispatch and for addressing the core issues involved.\nThe state government should also note that the success of its implementation depends on its sincerity and commitment to the cause of Arabic education.\n“It is equally important to point out the immense benefits which the state government stands to reap from paying adequate attention to Arabic and Islamic education.\n“Indeed, in those three Muslim public officials alone the Kwara State Government stands a good chance of setting up stainless models for young Muslims in Kwara State.”"
  },
  {
    "headline": "Ikoyi Building Collapse: Death Toll Rises To 22",
    "summarized_story": "Emergency workers have recovered two more bodies from the rubble of the collapsed building in Ikoyi, Lagos.\nThe recovery of more bodies, two days after the building collapsed, takes the death toll to 22, with search and rescue operations ongoing.\nIt remains unclear the total number of people in the building at the time of the collapse.\nRELATEDIkoyi Building Collapse: Sanwo-Olu Suspends GM Of Lagos Building AgencyPanic, Shock As High-Rise Building Collapses In Ikoyi, LagosRescue operation so far has accounted for 31 people – nine alive and 22 dead.\nOn Tuesday, a day after the collapse, Governor Babajide Sanwo-Olu suspended the General Manager of the Lagos State Building Control Agency (LASBCA), Gbolahan Oki, indefinitely."
  },
  {
    "headline": "Gas Leakage: NEMA Asks Residents To Avoid Open Fire In Parts Of Ikeja",
    "summarized_story": "The National Emergency Management Agency (NEMA) has raised an alarm following a report of a gas pipeline leakage in some parts of Ikeja, Lagos State Capital.\nThe affected areas include Computer Village, Ikeja Underbridge end of Awolowo Way, Oba Akran axis, Anifowose Street, and Medical Road.\nTo avoid any fire outbreak, the spokesperson for NEMA (South West), Ibrahim Farinloye, asked residents to avoid open fire in the affected areas.\nResidents are advised to take safety precautions to prevent any form of disaster.”Following the report, Farinloye, in another statement, said the gas leakage has been brought under control.\nWhile he asked residents to go about their daily routine without any worry, officials have continued to divert traffic around the affected areas."
  },
  {
    "headline": "COP26: Nigeria To Reach Net-Zero Emissions By 2060, Says Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday pledged that Nigeria will cut its emissions to net zero by 2060.\n‘‘For Nigeria, climate change is not about the perils of tomorrow but what is happening today.\nNigeria is committed to net zero by 2060.’’Making a case for gas-based energy transition in Nigeria, President Buhari requested international partners to finance projects using transition fuels such as gas in Nigeria.\n‘‘Parties to the Paris Agreement are expected to transit from fossil fuel to clean energy and reach a Net Zero ambition for greenhouse gases emission.\nPresident Buhari also told the COP26 Leaders’ Summit that Nigeria has developed a detailed energy transition plan and roadmap based on data and evidence."
  },
  {
    "headline": "Ikoyi Building Collapse: Sanwo-Olu Suspends GM Of Lagos Building Agency",
    "summarized_story": "﻿Lagos State Governor, Babajide Sanwo-Olu, on Tuesday directed the indefinite suspension of the General Manager of the Lagos State Building Control Agency, Mr. Gbolahan Oki.\nHis suspension comes about 24 hours after a high-rise building collapsed in the Ikoyi area of the state.\nThe Governor, in a statement signed by Commissioner for Information, Gbenga Omotoso, described the suspension as a “first step” towards finding out “what went wrong” to cause the building collapse.\nHamzat left the site for the Lagos Island General Hospital to see the survivors.\n“The government will embark on further foundation and borehole acidic level tests to ascertain the impact on the collapsed building."
  },
  {
    "headline": "Bus Plunges Into Ditch, Kills 20 In Pakistan",
    "summarized_story": "At least 20 people including children were killed on Wednesday when a bus plunged into a ravine in Pakistan-administered Kashmir, officials said.\nHe blamed speeding for the accident and said “authorities are trying to retrieve bodies and injured from the wreckage”.\nThe accident took place in the remote area some 160 kilometers (95 miles) east of Muzaffarabad, the capital of Pakistan-administered Kashmir.\nAnother local administration official also confirmed the accident and put the toll at 23.\nPakistan has an appalling record of fatal road and rail accidents due to poor roads badly maintained vehicles and reckless driving."
  },
  {
    "headline": "Nigeria needs $1.5trn in 10yrs to bridge infrastructure gap",
    "summarized_story": "‘‘There is a nexus between infrastructural development and the overall economic development of a nation.\n‘‘My administration identified this early enough as a major enabler of sustainable economic development and the realization of other continental and global development aspirations particularly the 2030 Agenda for Sustainable Development Goals.\n‘‘We introduced the revised National Integrated Infrastructure Master Plan – a policy document that ensures our infrastructure expansion projects is cross-sectorally integrated and environmentally friendly, ’’ he said.\n‘‘Quality infrastructure investment also needs to be tailored to individual country conditions and consistent with local laws and regulations.\nThe President also called for the environmental impact of infrastructure investment to be made transparent to all stakeholders, noting that this will enhance the appreciation of sustainable infrastructure projects and increase awareness of related risks."
  },
  {
    "headline": "Tinubu commiserates with Gov Lalong, Din family over Captain Din's death",
    "summarized_story": "Former Lagos governor and All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Plateau State Governor Simon Lalong and Joseph Din’s family over the passing of the retired army captain.\nHe was also Chairman of the All Progressives Congress Elders’ Advisory Council in Plateau State.\nIn the condolence letter to the family of late captain, the former Lagos governor said: “By way of this letter, please accept my deepest condolences over the death on Saturday of your husband and patriarch of the family, Captain Joseph Din, at 84.\n“Captain Din was an elder statesman, prominent leader and excellent human being who related well with everyone who came in contact with him.\nMay He also grant the soul of Captain Din eternal rest,” the former Lagos governor wrote."
  },
  {
    "headline": "EFCC releases billionaire businessman, Obi Cubana",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, has released billionaire businessman, Obi Cubana hours after grilling him in its custody on allegations bordering on tax fraud and money laundering.\nThe Anambra-born business tycoon was invited and detained last night by the anti-graft agency.\nIt was however gathered that the release of Obi Cubana from EFCC custody was made known by Lucky Luciano, the Executive Director Cubana Group and a friend to Obi Cubana, in a post shared on Instagram.\nThe close associate of Obi Cubana in the social media post, expressed excitement, stating that who the son of man has set free is free indeed."
  },
  {
    "headline": "Imo Assembly impeaches deputy Speaker, Amarachi Iwuanyanwu",
    "summarized_story": "The deputy Speaker of the Imo State House of Assembly, Amarachi Iwuanyanwu has been impeached.\nThe impeachment was signed by eighteen lawmakersThe house also recalled six members suspended six months ago"
  },
  {
    "headline": "Ikoyi Death Toll Rises to 21 on Wednesday Morning as Search and Rescue Continues",
    "summarized_story": "The death toll following the collapse of a 21-storey building in the Ikoyi area of Lagos has risen to at least 21 as at Wednesday morning.\nWhile there have been more survivors found on the second day of searching (9 confirmed), there are still dozens of people believed to be trapped in the rubble.\nARISE Correspondent Adefemi Akinsanya was on ground at the scene of the collapse in Ikoyi and sent this report."
  },
  {
    "headline": "Trump Claims Credit as Republicans Capture Virginia Governorship, Dealing Blow to Biden",
    "summarized_story": "Glenn Youngkin, a former private equity executive who surged in the polls in the Virginia campaign’s final weeks, beat Democratic former Governor Terry McAuliffe, CNN and NBC projected.\nIn New Jersey’s closer-than-expected governor race, Republican challenger Jack Ciattarelli and incumbent Democrat Phil Murphy were locked in a virtual draw, even though registered Democratic voters outnumber Republicans by more than 1 million.\nWhite women voters, who favored Biden over Trump by one point in 2020, preferred Youngkin by 57% to 43% over McAuliffe, according to NBC’s exit polls.\nUnder Virginia state law, governors cannot serve consecutive terms.\nMINNEAPOLIS POLICEMurphy, 64, was seeking to become the first Democratic governor to win re-election in New Jersey in four decades."
  },
  {
    "headline": "Nigeria: Obi Cubana Spends Second Day in EFCC’s Custody",
    "summarized_story": "Popular socialite and businessman, Mr. Obinna Iyiegbu aka Obi Cubana, has spent his second day in detention.\nSpokesman of the EFCC, Mr Wilson Uwujaren, told THISDAY that the owner of popular Ibizza night club chain remained in the custody of the anti-graft agency.\nTHISDAY, gathered that Iyiegbu was granted bail but was yet to perfect the bail conditions.\n“He was granted bail.\nObi Cubana recently caught media attention and has trended on social media, following the recent lavish burial ceremony of his mother in Oba, Idemili South Local Government Area of Anambra State."
  },
  {
    "headline": "PDP Condemns Bandits’ Attack on UniAbuja ‘Under Buhari’s Security Precincts’",
    "summarized_story": "The Peoples Democratic Party (PDP) has condemned Tuesday’s attack on the University of Abuja by bandits, who abducted four members of staff and some children in the institution, saying the fact that such a development could happen under President Muhammadu Buhari’s security precincts was shocking.\nThe party, however, described the attack as cowardly and demanded an unconditional release of the victims to reunite with their families members.\nMinister of the Federal Capital Territory, Malam Muhammad Musa Bello, while frowning at the abduction during a pre-dawn raid on the University staff quarters at Giri, Gwagwalada Area Council, however, assured the people that rescue would come soon.\nOn his part, Minister of Interior, Ogbeni Rauf Aregbesola, has lamented that criminals operating in the country were modernised unlike the nation’s security agencies, whom he said much changed their archaic mode of operations and modernise too.\nCharging the security agencies not to relent in the face of the failures of the Buhari administration but rise up to the occasion, track down the bandits and rescue the victims, the party lamented the persistent insecurity in the nation and urged all the citizens to be at alert and assist security agencies in their genuine efforts to secure the country under an incompetent administration."
  },
  {
    "headline": "Fuel Queues Lengthen in Abuja as NNPC Cautions against Panic Buying",
    "summarized_story": "Several filling stations in Abuja had long queues to deal with on Tuesday, just as the Nigerian National Petroleum Corporation (NNPC) has dispelled fear of scarcity of petroleum products, particularly petrol.\nOando filling station, opposite the Nigerian National Petroleum Corporation (NNPC) headquarters in Abuja had several motorists jostling to be served at about 1.30pm when THISDAY visited the area.\nMeanwhile, NNPC has declared that there’s no need to buy fuel in panic, stating that it has enough products to serve Nigeria beyond the Christmas and New Year celebrations.\nAdesanya said the discovery of oil and gas resources in other areas apart from the Niger Delta was a welcomed development which should be pursued with vigour by the country.\nHe, however called for the appointment of competent personnel to manage the sector, noting that this was the only way Nigerians could benefit from the country’s abundant oil and gas resources."
  }
]