[
  {
    "headline": "YABATECH emerges best polytechnic in Nigeria for third time",
    "summarized_story": "The Yaba College of Technology has emerged best polytechnic in Nigeria for the third consecutive time in the Webometrics ranking released in January 2022.\nThe Deputy Registrar, YABATECH, Mr Joe Ejiofor, disclosed this in an interview with the News Agency of Nigeria on Monday in Lagos.\nHe noted that the primary objective of the ranking web was to promote open access to the knowledge generated by institutions.\n“We were ranked eighth position before Omokungbe assumed office and he promised to make YABATECH number one.\nNAN reports that the ranking web which started in 2004 was currently in its 19th year of publication."
  },
  {
    "headline": "Projects: Reps quiz minister over order to restrict Nigerian missions",
    "summarized_story": "The leadership of the House of Representatives on Monday grilled the Minister of Foreign Affairs, Geoffrey Onyeama, over an order to Nigerian embassies, High Commissions and other foreign missions not to implement a clause in the 2022 Appropriation Act that allows them to spend their revenue on capital projects.\nThe Speaker of the House of Representatives, Femi Gbajabiamila, chaired the closed-door meeting where the minister was grilled.\nGbajabiamila had invited the minister over an order by the ministry to Nigerian foreign missions not to implement the clause and revert to the headquarters for funding.\nBut we cannot in the name of saying they would breach the law allow Nigeria and Nigerians to suffer.\nThat is our guiding principle and philosophy and that is what we would do to the best of our ability."
  },
  {
    "headline": "Foundation donates school supplies to Imo indigent students",
    "summarized_story": "By Esther OnyegbulaIn a bid to give hope to the less privileged students, a Non-Governmental Organization, The Ifunanyachukwu Foundation, has given out educational materials to secondary school indigent students in Nekede Secondary School Umuerim Nekede, Owerri, Imo State.\nSpeaking to Vanguard, the organisers of the event, Miss Obi Vivian Ifunanyachukwu revealed that the event part of its activities to celebrate the International Day of Education 2022, and encourage young persons in our environment on the importance of education.\nShe said,“The importance of education of young persons irrespective of gender is paramount for the development of a country and for curbing societal vices.”She noted that the the educational materials and additional literature books would help the students develop healthy reading culture”.\nThe highlight of the event was the interactive session where, convener of the event Vivian Ifunanyachukw lectured the students on the importance of reading as young people and peer pressure.\nVanguard News"
  },
  {
    "headline": "Afforestation: FG forests over 6 million hectares of land through green bond project – Ikeazor",
    "summarized_story": "By Joseph ErunkeABUJA– THE federal government said it has successfully forested 6,191,363 hectares of land through the green bond project implemented by the Forest Research Institute of Nigeria,FRIN, National NAGGW, Departmen Desertification of the government, and other organisations.\n“The national afforestation programme under the green bond project has successfully forested 6,191,363 hectares of land through the green bond project implemented by; Forest Research Institute of Nigeria,FRIN, National Agency for Great Green Wall,NAGGW, Department of Desertification, land degradation and drought Management, National Parks Service (NPS), NGOs, state governments, private planters, and international stakeholders.\n“The ministry since inception executed over 2,000 erosion and flood control projects and other smart climate-related ecological interventions in various states,” she said.\nNEWMAP is a World Bank-funded project that adopts the Integrated Watershed Management Approach, aimed at addressing the menace of gully erosion and other forms of land degradation with the objective to reduce vulnerability to soil erosion.\n“The Federal Ministry of Environment installed Flood Early Warning Systems (FEWS) geared towards effective environmental governance for adequate nationwide flood forecasting and to provide flood warning in advance to reduce flood disaster impact and ensure prompt response to impending floods."
  },
  {
    "headline": "photo News: ANAN elects new executive",
    "summarized_story": "From left: Mrs Adebanjo Adefunke, CNA – PRO, Mr Ajape Mathew, CNA – Assistant Secretary ,Mr Oludayo Taiwo, FCNA – Vice Chairman ,Mrs Oluwanishola Ibironke, FCNA – Treasurer,Hon.\nOni Olubode, FCNA – First Branch Chairman,Alhaji Binuyo Taofeek, FCNA – Newly elected Branch Chairman, Mr Makut Ibrahim, FCNA – Chairman Branches and Benevolent Committee of ANAN, Mrs Eniola Yetunde, FCNA – Secretary,Alhaji Ishola- Lemomu T A – Immediate past Branch Chairman, Dr Anselem Chiamogu, FCNA – Member, Branches and Benevolent Committee of ANAN,Deacon Oyebanji Ezekiel, FCNA – Former Branch Chairman ,Mrs Ikoyo-Eweto Yvonne, CNA – Immediate past Assistant Secretary,Alhaja (Mrs) Alabi Kafilat, FCNA – Ex-Officio IIRELATED NEWS"
  },
  {
    "headline": "Gov. Sule provides own phone number platform to interface with citizens",
    "summarized_story": "By Abel DanielGovernor Abdullahi Sule of Nasarawa state has created a social media platform with his hotline mobile phone number to enable him interact and respond duly with citizens.\nAddra appealed to citizens to take advantage of the magnanimity of the the governor’s gesture send SMS or Whatsapp messages to dedicated phone numbers.\n“Governor Abdullahi Sule wishes to assure the people of the state that their inputs will be treated in a confidential manner and with all the seriousness it deserves.\nHe however appealed to prospective callers not to abuse the platform but contribute responsibly noting that ” “together, we can build the Nasarawa state of collective dreams”.\nChief called on all to send SMS or whatsapp messages to 09126901727, 09154503073 or 08149539963."
  },
  {
    "headline": "Buhari promises to handover to his successor stable democracy, revamped security",
    "summarized_story": "–Says Nigeria has passed through military ruleBy Johnbosco AgbakwuruABUJA—PRESIDENT Muhammadu Buhari last night in Abuja pledged his commitment to hand over a strong repositioned agriculture-led, diversified home-grown economy, stable democracy and revamped armed and security forces to the next Administration.\n”I take this initiative to mean that you all intend to collaborate with this administration in that direction.\n”The question that should be uppermost always is: How do we leverage our business endowment for the greater good of our country?\nThe President lauded the group for rising above all ethnic and religious divides for the common good, describing the feat as ‘‘fantastic’’.\n“What the Committee has tried to do is to develop an elite consensus on security and economy, ” he said."
  },
  {
    "headline": "UNICEF welcomes release of four girls kidnapped from Chibok",
    "summarized_story": "The United Nations Children Educational Fund (UNICEF) has welcomed the release of four girls abducted by armed groups in Borno State.\nThe organisation called for the immediate release of all conflict-affected children held in captivity across the region.\nThe released girls and others still in captivity were abducted from the Kautikari community earlier this month in the Chibok Local Government Area of the state.\nAbout 173 of the Chibok girls are still missing.\n“UNICEF is very relieved for the released girls and their families,’’ said Peter Hawkins, UNICEF Representative in Nigeria."
  },
  {
    "headline": "Bunkering: NSCDC rejigs Rivers Command, forms new unit after Wike’s demand",
    "summarized_story": "Nigeria Security and Civil Defence Corps (NSCDC) Commandant-General, Ahmed Audi, has ordered the rejig of the Rivers State Command.\nThe CG also on Monday declared war against petroleum pipeline vandals and oil bunkerers in the state.\nAudi had removed Head of the Anti-Vandal Unit, State Commandant and Zonal Commander.\nThe CG disbanded the unit after Governor Nyesom Wike accused the NSCDC of aiding bunkering.\nWike’s Chief Security Officer (CSO) stormed the location with a police contingent and disarmed the NSCDC team leader."
  },
  {
    "headline": "Ex-Oyo Governor, Alao-Akala to be buried February 18",
    "summarized_story": "The remains of a former Governor of Oyo State, Chief Christopher Adebayo Alao-Akala, will be committed to mother earth on Friday 18th February.\nThe burial committee set up to supervise the burial made this disclosure on Monday.\nHe was Oyo State Governor between 2007 and 2011.\nHe said, “Christian Wake Keep and Service of songs at Ogbomoso High School Open Field Ogbomoso, Oyo State.\nTime: 11:00am“Interment follows immediately at his residence, Opadoyin Akala Lodge, Randa, Ogbomoso, Oyo State”."
  },
  {
    "headline": "Dass Emirate describes attack on Emirs as barbaric, provocative",
    "summarized_story": "The Dass Emirate on Monday condemned in totality the recent attacks on the convoys of the Emirs of Bauchi and Dass, describing it as barbaric, provocative and misleading.\nIt however commended the Bauchi State Government for taking necessary measures to avert future occurrence of the sad episode.\nIt, however, took the intervention of Alhaji Othman himself to prevent the demonstration from turning violent.\n“The Emir condemned in strong terms the unfortunate attack on the vehicles of Emir of Bauchi, Dr Rilwanu Suleiman Adamu and his official vehicle by some hoodlums in Tafawa Balewa on their way to attend the occasion.\nHe then called on people of the Emirate to always live in peace with one another and to desist from spreading rumours that would be of negative impact in the community."
  },
  {
    "headline": "Scammers using fake social media accounts to defraud people – Ikpeazu’s wife",
    "summarized_story": "The Office of the Wife of the Governor of Abia State has said that some scammers are using social media handles with the image of Dr Mrs Nkechi Ikpeazu to defraud unsuspecting individuals.\nIn a statement by Chika Ojiegbe, the Chief Press Secretary to the Wife of Abia Governor and issued to newsmen in Umuahia, the Abia state capital on Monday, the office found that the operators of the dubious accounts are offering preposterous employment favours and social welfare assistance to their targets with the intent of duping them of huge sums of money in most of the attempts.\nThe office also uncovered that some of the dubious offers include bitcoin transactions and job placements at customs, immigration, the state civil service and others.\nIt further disclosed that security agencies have been alerted about the development.\nIt warned members of public to be wary of mouthwatering offers on social media."
  },
  {
    "headline": "Father’s absence stalls Coroner inquest into Oromoni’s death",
    "summarized_story": "The coroner inquest to unravel the circumstances surrounding the death of Sylvester Omoroni, a student of Dowen College, Lekki, Lagos, was stalled yesterday in Ikeja.\nThe development followed the failure of two witnesses, including the deceased’s father, Mr Sylvester Oromoni (Snr.)\nCounsel to the Oromonis, Andrew Efole ascribed their failure to appear before the Coroner to ill health.\n“We are not saying we will not call our witnesses… other witnesses, we are taking is coming tomorrow,” he said.\nThe judge declared the convict as “lacking in compassion” for having sexual activity with a nine-year-old girl."
  },
  {
    "headline": "EFCC returns 11 houses to Arthur Eze in Enugu",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has said it recovered and returned 11 houses to Arthur Eze, a businessman.\nIn a statement yesterday, Wilson Uwujaren, EFCC spokesperson, said the houses were recovered in Enugu from Olisaebuka Eze and Onyeka Eze, who worked as administrative and finance managers for the businessman.\n“The Economic and Financial Crimes Commission, EFCC, Enugu Zonal Command, on January 28, returned 11 houses recovered in different parts of Enugu to Chief Arthur Eze,” the statement said.\n“The properties were recovered by the EFCC from Olisaebuka Okechukwu Eze and Onyeka Nnadozie Eze, administration and finance manager in Arthur Eze’s firm, accused of criminal breach of trust and diversion of funds belonging to the business mogul.\n- Advertisement -“The investigation established that the duo, who is also nephews of Chief Eze, used proceeds of their alleged criminal activities to acquire choice properties in Enugu and other parts of the Southeast."
  },
  {
    "headline": "Agency detains Medview Airline MD Bankole",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) yesterday detained the Managing Director of Medview Airline, Mr. Muneer Bankole.\nBankole is expected to account for over $900,000 linked to Hajj operations.\nThe transactions between him and the National Hajj Commission of Nigeria (NAHCON) took place in 2019.\nAccording to a fact-sheet available to The Nation, Bankole, was at the commission’s Abuja office yesterday on the invitation of the EFCC.\n- Advertisement -“He allegedly received the funds as mobilization but did not execute the contract.”When contacted, the Head of Media and Publicity of EFCC, Mr. Wilson Uwujaren, confirmed the arrest."
  },
  {
    "headline": "EFCC slams N2.9b fraud charges against Okorocha, six others",
    "summarized_story": "EFCC slams N2.9b fraud charges against Okorocha, six othersThe Economic and Financial Crimes Commission (EFCC) has filed a 17-count charge against former Imo State Governor Rochas Okorocha and six others.\nOkorocha, now a serving senator representing Imo West Senatorial District, was alleged to have conspired with others to steal and launder about N2.9 billion.\nThe anti-graft agency also claimed that the funds belonged to Imo State and its local government areas.\nIt further claimed that the defendants allegedly diverted the funds between October 2014 and February 2016 from the Imo State Government House Account and Imo State Joint Local Government Project Account.\nHe said: “I can confirm that a charge has been filed today at the Federal High Court, Abuja against Senator Rochas Okorocha and others."
  },
  {
    "headline": "Council destroys 82 illegal refining sites",
    "summarized_story": "The Chairman of Ahoada West Local Government Area of Rivers Mr Hope Ikiriko, said no fewer than 82 illegal crude oil refineries across communities within the area have been destroyed.\nThe raid on the illegal refineries followed Governor Nyesom Wike’s order to the 23 local government areas chairmen in the state to identify and destroy all illegal crude oil bunkering and artisanal refining sites in their areas.\nThe Ahoada West counciCouncil destroys 82 illegal refining sitesl chairman said the local government embarked on the raid with a view to eradicating crude oil theft in the area.\n“During the exercise, 19 illegal refining points were destroyed in Idu-Ekpeye and three in Ebrass communities while drilling machines and other local equipment used for the illegal crude trade were impounded.\n- Advertisement -“Four camps were destroyed in Ukpeliede, a community which harboured 28 illegal crude refining points including Ula-Okobo, Oshika, Akala-Olu, Akiogbologbo and Okarki, among others were destroyed during the raid,” he said."
  },
  {
    "headline": "Insecurity ‘ll not affect successful conduct of 2023 general elections, says INEC",
    "summarized_story": "From Desmond Mgboh, KanoThe Independent National Electoral Commission (INEC) has expressed hope that the present insecurity in some parts of Nigeria would not affect the successfully conduct of the 2023 general elections.\nAccording to him, “We are not looking at a substantial disruption of the electoral process.\nHe however expressed grave displeasure over the failure of political parties to adhere to their approved timetable for the conduct of their primaries and nomination of their candidates.\nOkoye, similarly, indicted political parties for the same delayed conduct of primaries in Akure North/ Akure South federal Constituency, Ogoja/Yala federal Constituency, Akpabuyu State Constituency of Cross River State,Jos North/Bassa Federal Constituency of Plateau State and Ngor Okpala State Constituency of Imo State.\n“Once the moment for the conduct of primaries elapses, we will not monitor such primaries."
  },
  {
    "headline": "2023: Okorocha declares for President in Abuja",
    "summarized_story": "From Fred Itua, AbujaFormer governor of Imo State, Rochas Okorocha, on Monday, declared for the office of the President in Abuja, where he outlined how he will salvage the country if elected.\nOkorocha who is a a serving senator, is the first aspirants to openly declare ahead of 2023.\nHe’s running on the platform of the ruling All Progressives Congress (APC).\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHe listed infrastructure, rule of law, among others, as key areas he will focus on if elected."
  },
  {
    "headline": "Niger: Terrorists on rampage, kill 7 top JTF commanders, others",
    "summarized_story": "The gunmen were said to have launched the attack on the task force’s camp in Galadiman, Kogo community, on Saturday afternoon, at about 3:00pm.\nAlso killed during the attack were four members of the newly recruited local vigilance group meant to reinforce the operations of the task force in communities.\nIn all, no fewer than 11 security officials were killed, while several other members of the Joint Security Task Force were seriously injured and are in government facilities in Minna, the state capital, receiving treatment.\nThe entire Galadiman Kogo has been deserted as hundreds of residents have fled to nearby Zumba community for refuge.\nThey came through Galape and Kudodo, where they confiscated a vehicle and asked the driver to bring them to Galadiman Kogo."
  },
  {
    "headline": "APC convention: Feb. 26 date threatened as CECPC mulls March option",
    "summarized_story": "The source further argued that the ideal date for the convention would have been March, but expressed the fear that the Caretaker Committee could come under severe attacks for the change of date.\nWe are aware that our failure to stick to the constitutional stipulation will heighten speculation over our readiness to conduct the convention.\nAll you should understand is that the Caretaker Committee has limited powers because we are taking orders from above.\nAs far as the Caretaker Committee is concerned, the convention will hold as planned unless we receive a counter order from Mr. President, the Governors, and other major stakeholders.\nSo, even if the date clashes, it will not pose any challenge to the commission conducting its bye-elections,” Okoye said."
  },
  {
    "headline": "2023: Disquiet in Akwa Ibom as Udom presents Umo Eno as ‘God anointed’ candidate",
    "summarized_story": "It was however surprising to many when former governor Victor Attah presented Eno as the endorsed candidate of stakeholders of the party at the meeting.\nWhen asked if there were some dissenting voices at the meeting concerning the sudden endorsement, Udo said he wasn’t away of any.\n“I went to Attah and told him ‘why didn’t you talk to all of us who are in this race?\nI respect Obong Victor Attah and the opinion of the elders of the state.\nI didn’t know the agenda of the meeting but I had to respect the governor and attend the meeting at the lodge on his invitation.”"
  },
  {
    "headline": "Sokoto PDP Stakeholders Call on Tambuwal to Contest for President, Gov Says He Will Begin Consultation",
    "summarized_story": "*To make his intention known end of FebruaryBy Onuminya InnocentStakeholders of Sokoto Peoples Democratic Party have called on Governor Aminu Waziri Tambuwal to contest for President in 2023.\nTambuwal, in his response, said he would begin consultations across the country.\nRising from a stakeholders meeting at the party Secretariat in the state capital, leaders of PDP expressed confidence in the leadership of Tambuwal and called on him to contest for the topmost position in Nigeria to rescue the country.\nIn his remarks, a former Minister of Power, Engineer Bello Suleiman, said governor Tambuwal was the most qualified candidate for the job.\nHe said in terms of experience in governance, former Vice President, Atiku Abubakar, who is also eyeing the PDP ticket, did not have as much experience as Tambuwal in governance."
  },
  {
    "headline": "Buni: We Have Reconciled Aggrieved APC Members in Kwara, Ogun Gombe, Others",
    "summarized_story": "He said the committee was very important to the collective zeal of recovering, repositioning and rejuvenating the party to have a strong, stable and united APC.\nBuni added: “The submission of this report is coming at a crucial period as we approach the National convention and the 2023 general election.\nTherefore, the findings of the committee would contribute in no small measure to a successful convention and the general election.\nBuni noted that with this numerical strength, APC remained the party that can confidently win elections with landslide victory in all the national elections.\nBuni urged support for the caretaker committee of the party to organize a very successful National Convention that would be a stepping stone to the party’s success in the 2023 general election."
  },
  {
    "headline": "2022: Nigerian Women in Tech Break New Grounds",
    "summarized_story": "By Nosa AlekhuogieWith the curtain down on 2021, Nigerian women operating in the tech industry have closed mouth-watering deals worth hundreds of millions of dollars, started new ventures and promoted the cause of gender equality.\nIn sub-Saharan Africa, women constitute only 30 per cent of professionals in the tech sector.\nThe industry has experienced a high influx of women breaking grounds and leveraging financial technology (Fintech).\nAlthough not having a fair share in the tech industry, Nigerian women are making genuine impact globally.\nIbukun AkinolaPiggyVestIbukun Akinola is an entrepreneur and finance lead with over seven years of experience in the Nigerian tech space."
  },
  {
    "headline": "95 Days after Launch, eNaira Wallets’ Download Near 700,000",
    "summarized_story": "President Muhammadu Buhari launched the digital currency on October 25, 2021.\nHe had stressed that Nigeria was the first country in Africa and one of the first in the world to introduce digital currency.\nEmefiele had added, “Therefore, the eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical naira.\nIt noted that although the digital currency was expected to increase financial inclusion and facilitate remittances, CBN should be prepared to manage the potential risk associated with managing a digital currency.\nIt stated that eNaira was the second central bank-backed digital currency fully open to the public after that of the Bahamas."
  },
  {
    "headline": "NNPC Pays $452.5m Cash Call Arrears to IOCs in One Year",
    "summarized_story": "Aside from Mobil and Chevron, other oil majors that are being owed arrears by the NNPC include Shell Petroleum Development Company (SPDC), Total Energies and Nigerian Agip Oil Company (NAOC).\nFurthermore, with an initial debt of $774.6 million owed NAOC, payment to date made to the oil company was $522.6 million, with an outstanding of $252 million.\nThe NNPC, in 2016, signed a cash call repayment agreement with its JV partners to defray cash-call arrears within five years after many years of its indebtedness to its partners.\n“NNPC has fully repaid its cash call arrears to MPN and all incremental barrels have reverted to base,” the company said.\n“When we were elected into office in 2015, the industry was in a very dire situation worsened by a backlog of Joint Venture (JV) Cash Call arrears."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "BREAKING: I'd run for president if PDP zones ticket to the south, say Peter Obi",
    "summarized_story": "Peter Obi, former governor of Anambra state, says he will be running for president if his party zones the ticket to the south.\nObi, who joined the Peoples Democratic Party (PDP) presidential ticker in 2019 as Atiku Abubakar’s running mate, disclosed this via a tweet on Tuesday.\n“Yes, I will step into the field to contest for the opportunity to serve this great country as President if my party, the PDP, zones the ticket to the south,” he wrote on Twitter.\n“But if it is thrown open, Nigerians will also hear from me”.\nMore to follow…"
  },
  {
    "headline": "BREAKING: I'd run for president if PDP zones ticket to the south, say Peter Obi",
    "summarized_story": "Peter Obi, former governor of Anambra state, says he will be running for president if his party zones the ticket to the south.\nObi, who joined the Peoples Democratic Party (PDP) presidential ticker in 2019 as Atiku Abubakar’s running mate, disclosed this via a tweet on Tuesday.\n“Yes, I will step into the field to contest for the opportunity to serve this great country as President if my party, the PDP, zones the ticket to the south,” he wrote on Twitter.\n“But if it is thrown open, Nigerians will also hear from me”.\nMore to follow…"
  },
  {
    "headline": "2023: Edwin Clark asks Atiku, Saraki, Tambuwal to back southern presidential aspirant",
    "summarized_story": "Edwin Clark, an Ijaw national leader, has asked presidential aspirants from the north to reconsider their ambition.\nNeither the former vice-president nor Saraki have officially declared their intention to contest the presidency, but there have been calls for both politicians to run for the position.\nBut Tambuwal had, on Monday, said he would soon begin consultations on whether to contest the presidency.\n“They subsequently walked out of the Parliament, went back to the north, and swore never to return to Lagos again.\nAdvertisement“Is it no longer not a negation of the ‘zoning agreement,’ for which former President Goodluck Jonathan was castigated?"
  },
  {
    "headline": "2023: Edwin Clark asks Atiku, Saraki, Tambuwal to back southern presidential aspirant",
    "summarized_story": "Edwin Clark, an Ijaw national leader, has asked presidential aspirants from the north to reconsider their ambition.\nNeither the former vice-president nor Saraki have officially declared their intention to contest the presidency, but there have been calls for both politicians to run for the position.\nBut Tambuwal had, on Monday, said he would soon begin consultations on whether to contest the presidency.\n“They subsequently walked out of the Parliament, went back to the north, and swore never to return to Lagos again.\nAdvertisement“Is it no longer not a negation of the ‘zoning agreement,’ for which former President Goodluck Jonathan was castigated?"
  },
  {
    "headline": "US lifts suspension on 'drop box' visa applications in Nigeria -- after 32 months",
    "summarized_story": "The United States embassy in Nigeria has lifted the restriction on drop box service or interview waiver for those renewing visas in the country.\nThe interview waiver was suspended for Nigerian applicants in May 2019.\nBut according to checks by TheCable on Monday, the suspension on the interview waiver has been lifted.\nIf applying as a group or family, all members must fulfill all criteria to qualify for interview waiver,” the embassy said.\n“For B1/B2 or C1/D visa holders: the applicant must possess a full-validity B1/B2 or C1/D visa that expired within the past 24 months or will expire in the next three months."
  },
  {
    "headline": "Why did Binance block over 200 accounts in Nigeria?",
    "summarized_story": "The tweet picked up momentum due to how the supposed Binance representative handled the situation—with cluelessness and threats.\nSince there was no response yet from Binance throughout Wednesday, people began to conjure different reasons as to why accounts are getting blocked.\nAt 11 a.m. on Friday, the session, hosted by Dami Odufuwa, head of public relations at Binance Africa, alongside the Binance Africa community manager Nsikan Benjamin and the company’s Africa Director Emmanuel Babalola, started and lasted for about an hour.\nNot just countries, banks are also restricting access for crypto exchange as well.\nTransactions can also be tracked on the blockchain by collaborating and discussing with other centralised exchanges,” Binance Africa told TechCabal."
  },
  {
    "headline": "Tiger Global and Greycroft lead $15m Series A round in Nigeria’s Bamboo",
    "summarized_story": "We plan to add other products and tools that offer greater access and make global investing simpler from Africa,” Bassey said.\nFor instance, nearly 75% of Bamboo users have never traded stocks before.\nIn 2021, repeat depositors made up 85% of deposits on the platform, an indication that Bamboo users are rapidly gaining confidence in trading US stocks.\nBut with the US equities market experiencing its worst January in well over a decade—since 2009—how are Bamboo users reacting to the downturn?\n“Even though they are new to stock investing, Bamboo users tend to handle their emotions like more seasoned investors,” Bassey said."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "He built TikTok's strategy in Africa, now he's building Kippa",
    "summarized_story": "Kennedy Ekezie-Joseph who helped lead TikTok’s entry into Africa, was no longer with the company for that moment of triumph.\nEkezie-Joseph’s startup, Kippa, is a bookkeeping and finance app that he founded with Duke Ekezie (his brother) and Jephthah Uche in February 2021.\n“My dad had a small business around when I was born, which he lost.\nWhen he launched Kippa, Ekezie-Joseph knew from personal experience that he was addressing an existential threat to businesses.\nBeyond the early conversion of bookkeepers and small business owners, Ekezie-Joseph is the first to admit that there are plenty of hurdles ahead."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "How Sidebrief is making continental and global expansion a breeze for African startups",
    "summarized_story": "Source: SuppliedUp until the last decade, continental and international expansion wasn’t a thing among African startups.\n“There was no single platform where you could get information about access into the African market.\nMeanwhile, there are tax registration requirements to be fulfilled, business-specific certifications to acquire, and industry licences/permits to get.\nEntity Incorporation, Tax Registration and IP Registration are just the basics.\nIn addition to that, technological adoption is a general problem with the African market because regulatory parastatals have only a few automated processes."
  },
  {
    "headline": "Agency banking with NIPOST, crypto beyond trading, Periculum’s credit analytics tool",
    "summarized_story": "Share this article:Hi there,Today I’m discussing:NIPOST’s banking ambitionsOther use cases for cryptoCreditworthiness in the African contextNIPOST’s new agency banking platformOn Friday, January 28, 2022, the Nigerian Postal Services (NIPOST) launched its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nBecause the card relies heavily on the user’s biometric information — like fingerprints — it would work both online and offline.\nBut as I’ve heard so many times in the last year, there’s more to crypto than trading.\nWhen giving out loans, banks — and any other financial institution really — need information about the loan applicant.\n“I realised that even in Canada, there’s a pretty significant number of people that are underserved by the financial system."
  },
  {
    "headline": "roHealth officially launches in Nigeria, provides free Health Insurance for SMBs",
    "summarized_story": "Share this article:Nigeria-based healthtech, roHealth has rolled out a free health coverage plan for Small and Medium-scale Businesses in Nigeria.\n“We are a platform that gives employees greater decision-making control over their health insurance with cashback when it is not used.\nEmployees can then choose from over 100 Health Plans from top HMOs in Nigeria” Olude told Techpoint at the event.\n“roHealth is on a mission to increase access to healthcare in Nigerians by providing free health insurance for a limited period.\nSince its inception 6 months ago, over 500 businesses and 10000 lives actively use roHealth to make their health coverage decisions."
  },
  {
    "headline": "Obaseki harps on bye-laws to improve traffic mgt, as EDSTMA trains over 1,200 drivers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will introduce bye-laws and other measures to check recklessness among drivers.\nThe governor disclosed this after inspecting facilities of the Edo State Traffic Control and Management Agency (EDSTMA), including the Drivers Training Academy and Manpower Development Centre.\nWe are working very hard with experts on what to do to ease traffic congestion in the state.\nThe leading causes of traffic congestion are unwholesome practices among drivers, particularly commercial drivers and people who refuse to obey traffic signs.\nThe Managing Director, EDSTMA, Mr. Dennis Oloriegbe, said that the agency has trained over 1,200 drivers, comprising drivers apprehended for serious traffic offences and others within the civil service at the academy."
  },
  {
    "headline": "Obaseki, FG in talks over kick-off of academic activities at Ekiadolor Federal College of Education – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… says govt won’t be blackmailed by ex-staff of defunct COEBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured the National Commission for Colleges of Education (NCCE) of the state government’s support for the kick-off of academic activities at the Federal College of Education in Ekiadolor.\nObaseki, who noted that workers of the defunct Edo State College of Education, Ekiadolor, are not owed salaries or any entitlements, said the government will not give in to blackmails by the dissident staff of the former state-owned college of education.\n“We are trying to retool the educational system of this country and Edo State.\n“They are claiming what they didn’t work for because we have set up our own state college of education.\nWe’ve gone round the site of the college and discovered a lot of good things and we must appreciate your efforts.”."
  },
  {
    "headline": "Edo advances on smart waste mgt technology to tackle trash problems in communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State has intensified the deployment of its newly launched smart waste management technology to address the waste crisis across the 18 local government areas in the state.\nThe mobile application, according to the Coordinator of Edo NEWMAP, Dr. Tom Obaseki, is aimed at curbing indiscriminate waste disposal, especially plastic, aluminum, and other non-degradable materials.\nThe project is rallying and sensitizing stakeholders and Community Interest Groups (CIGs) on the usage of the smart plastic waste recycling scheme to tackle trash problems in the state.\nAccording to Obaseki, “The Edo NEWMAP has continued to explore more efficient effective means to solve the problem of flood and erosion across Edo communities.\n“On the back of this, we recently launched a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats across communities in Edo State."
  },
  {
    "headline": "Edo to set up investment desks in Lagos, Abuja, Nigerian embassies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has unveiled plans to set up investment desks in Lagos and Abuja as well as Nigerian embassies overseas to attract investments to the state’s industrial, agriculture, retail, tourism and power sectors.\nAccording to him, “We have to set up investment desks in Lagos and Abuja.\nThis will increase visibility of the opportunities for investment in our state.\n“The state has a 40MW power facility for investors in the industrial park provided by Ossiomo Power.\n“We want to create the investment desk so that we can advertise the opportunities available in the state to investors and get them to come and invest in our state,” he added."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Troops Kill 5 Terrorists, Capture Weapons In Borno, Yobe",
    "summarized_story": "The Nigerian Army has said its troops conducting Operation Hadin Kai in the North-East killed five Islamic State West Africa Province ISWAP (ISWAP) terrorists during encounters in Yobe and Borno States.\nHe said the troops in conjunction with members of the Civilian Joint Task Force (CJTF) carried out a clearance operation code-named “Operation DOMINANCE I” along the insurgents’ route of manouvre at Ngirbua village, neutralised two BH/ISWAP terrorists while others retreated in disarray.\nThe troops recovered one AK 47 rifle, one FN rifle and a motorcycle.\nADVERTISEMENTIn a related development, troops of Sector 3, Operation HADIN KAI deployed at Forward Operating Base Magumeri on January 30, 2022 engaged Boko Haram and Islamic State West Africa Province Terrorists in Borno State while on a fighting patrol around Mallumti general area.\nDuring the firefight, three terrorists fell to troops firepower while three AK47 Rifles, one magazine, 23 quantity of 7.62mm special ammunition, one pick-up truck, two solar panels, seven mobile phones, foodstuff and provisions, among others, were recovered."
  },
  {
    "headline": "ACJHR Lauds CBN’s Decision To Reduce ATM, Withdrawal Charges",
    "summarized_story": "The African Centre for Justice and Human Rights (ACJHR) has lauded the Central Bank of Nigeria (CBN) for reducing ATM withdrawal charges and inter-bank transfer fees in its revised guidelines on charges by banks, other financial institutions, and non-bank financial institutions.\nIn a statement by the group’s coordinator, Nduka Edede Chinomso, the ACJHR also noted the downward review of charges for electronic banking transactions and described the development as people’s interest-driven.\nParticularly, the group commended the CBN Governor, Godwin Emefiele, and members of his management team for always coming up with programmes and policies of government meant at making life meaningful for Nigerians.\nADVERTISEMENT“We make bold to say that this downward review of fees is another step in the right direction.\n“We, therefore, urge the CBN to remain focused on its fundamental objectives of repositioning the economy and making lives meaningful for the citizens.”ADVERTISEMENT"
  },
  {
    "headline": "Singapore Migrant Workers Labour Under Curbs",
    "summarized_story": "A temporary grey wall conceals the compound, which sits in the northwest of Singapore island, making it almost impossible for anyone in the many passing cars to catch a glimpse of what is inside.\nBut once cases began to emerge among migrant workers, the virus tore through their cramped accommodation.\n“When the pandemic hit in the first year, migrant workers had accounted for almost 90 percent of the confirmed cases in Singapore.\nWorkers were instructed to stay in their dorms and warned against mixing with other workers in common areas.\nMigrant workers are almost entirely cut off from the general public."
  },
  {
    "headline": "Singapore Migrant Workers Labour Under Curbs",
    "summarized_story": "A temporary grey wall conceals the compound, which sits in the northwest of Singapore island, making it almost impossible for anyone in the many passing cars to catch a glimpse of what is inside.\nBut once cases began to emerge among migrant workers, the virus tore through their cramped accommodation.\n“When the pandemic hit in the first year, migrant workers had accounted for almost 90 percent of the confirmed cases in Singapore.\nWorkers were instructed to stay in their dorms and warned against mixing with other workers in common areas.\nMigrant workers are almost entirely cut off from the general public."
  },
  {
    "headline": "Don’t Lose Hope In Nigeria, Ositelu Tells Nigerians",
    "summarized_story": "A Presidential candidate in the 2019 general election, Isaac Babatunde Ositelu, has admonished Nigerians not to lose hope in the transformation of the country to a greater Republic.\nSpeaking against the backdrop of the current economic doldrums, pervasive insecurity, religious strife and political upheavals, he assured that Nigeria will surely evolve out of the ashes of the current travails ravaging the nation and its citizens.\nOsitelu, a Project Manager/Businessman, urged Nigerians to put behind them the disappointments of their recent political experiences and get prepared for the transition in 2023.\nHe said that the citizens themselves have pivotal roles to play in getting Nigeria back on track as a nation to earn global respect and honour.\nThe astute political tactician called on the Youths and Women to take their pride of place in the political terrain by making their numbers count."
  },
  {
    "headline": "Rihanna’s pregnancy for A$AP Rocky: Love struck Don Jazzy heartbroken",
    "summarized_story": "Mavin Records Chief Executive Officer, Don Jazzy has reacted to pregnancy news of singer Rihanna.\nHe however gave up on any possible relationship with the Fenty boss when the news of her dating American rapper A$AP Rocky went viral on social media in 2020.\nDon Jazzy, in a tweet on December 21, 2020, said he needed a new bae because it was evident the ‘Umbrella’ singer will get pregnant soon.\nReacting to the news of her pregnancy for her boy, Asap Rocky, he shared the same photo of the duo on his Instagram and Twitter handle with different accompanying captions.\nInstagram’s caption reads: “It is finished.”While Twitter reads: “Afternoon breakfast.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Rihanna’s pregnancy for A$AP Rocky: Love struck Don Jazzy heartbroken",
    "summarized_story": "Mavin Records Chief Executive Officer, Don Jazzy has reacted to pregnancy news of singer Rihanna.\nHe however gave up on any possible relationship with the Fenty boss when the news of her dating American rapper A$AP Rocky went viral on social media in 2020.\nDon Jazzy, in a tweet on December 21, 2020, said he needed a new bae because it was evident the ‘Umbrella’ singer will get pregnant soon.\nReacting to the news of her pregnancy for her boy, Asap Rocky, he shared the same photo of the duo on his Instagram and Twitter handle with different accompanying captions.\nInstagram’s caption reads: “It is finished.”While Twitter reads: “Afternoon breakfast.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Cheating hubby, Sammie Okposo returns to social media, sets Instagram to private",
    "summarized_story": "Nigerian Gospel artiste, Sammie Okposo, has returned to social media after a brief absence, on Monday.\nOkposo who returned to social media set his Instagram page @SammieOkposo, to private.\nIt was earlier reported by The PUNCH that Okposo received online backlashes last week Tuesday, when he publicly confessed to cheating on his wife, with a US-based Nigerian woman.\nIn the heat of the public conversation on the alleged infidelity, he removed himself from public spaces by deactivating his social media platforms on Wednesday.\nHowever, checks by our correspondent showed that the Wellu Wellu master, as he is fondly called, have returned to Instagram."
  },
  {
    "headline": "Cheating hubby, Sammie Okposo returns to social media, sets Instagram to private",
    "summarized_story": "Nigerian Gospel artiste, Sammie Okposo, has returned to social media after a brief absence, on Monday.\nOkposo who returned to social media set his Instagram page @SammieOkposo, to private.\nIt was earlier reported by The PUNCH that Okposo received online backlashes last week Tuesday, when he publicly confessed to cheating on his wife, with a US-based Nigerian woman.\nIn the heat of the public conversation on the alleged infidelity, he removed himself from public spaces by deactivating his social media platforms on Wednesday.\nHowever, checks by our correspondent showed that the Wellu Wellu master, as he is fondly called, have returned to Instagram."
  },
  {
    "headline": "At last Ese Brume decorates Oyedepo with Olympics Bronze Medal (Photos)",
    "summarized_story": "Nigerian Long Jump sensation, Ese Brume has fulfilled her promise to visit Canaanland to wear her Olympics Bronze Medal on Bishop David Oyedepo.\nBrume won a Long Jump Bronze medal at the Tokyo 2020 Olympics in August.\nBrume had promised to go to Canaanland and wear the medal on Oyedepo, who is the founder of Living Faith Church Worldwide.\nBut on Sunday during the service, Church Gist reports that Brume got the opportunity to fulfil her dream of decorating Oyedepo with her medal.\nAfter receiving the medal, Oyedepo prayed for Brume and her coach, Kayode: “I have never won a gold medal and here she came and offered it to her father."
  },
  {
    "headline": "YABATECH ranked No.1 for third consecutive time",
    "summarized_story": "By Millicent IfeanyichukwuThe Yaba College of Technology (YABATECH) has emerged best polytechnic in Nigeria for the third consecutive time in the Webometrics ranking released in January 2022.\nThe Deputy Registrar, YABATECH, Mr Joe Ejiofor attributed the success to the institution’s improvement in web contents and researchable academic papers.\nHe noted that the primary objective of the ranking web was to promote open access to the knowledge generated by institutions.\n“We were ranked eighth position before Omokungbe assumed office and he promised to make YABATECH number one.\nThe web ranking started in 2004."
  },
  {
    "headline": "Hajj Scam: EFCC Detains Medview Airline Managing Director, Bankole",
    "summarized_story": "Mr Muneer Bankole, the Managing Director of Medview Airline, has been arrested by the Economic and Financial Crimes Commission.\nHe was reportedly apprehended this afternoon at the EFCC’s offices in Jabi, Abuja.\nBankole, who arrived at the EFCC complex at 11:00 a.m. on Monday, January 31, 2022, was summoned by the anti-graft agency over an alleged diversion of 50% of funds paid to him by the National Hajj Commission, as well as an additional $900,000 for the airlift of pilgrims in 2019, according to a source familiar with the case.\nHe allegedly received the payments as part of a mobilization package but failed to complete the job.\nWilson Uwujaren, a spokesman for the EFCC, confirmed the arrest when contacted."
  },
  {
    "headline": "BREAKING: Governor Tambuwal Formally Declares For Presidency",
    "summarized_story": "Aminu Tambuwal, the Sokoto state governor, has declared his intention to run for the highest political office in Nigeria come 2023.\nThe former Speaker of the House of Representatives made this known this evening after a high-level stakeholder meeting in Sokoto.\nHe said he has distinguished himself not only as governor but as a Speaker of the House of Reps without any blemish or corruption tag.\nMr Tambuwal joins other PDP presidential aspirants including a journalist, Dele Momodu, Gov Mohammed Bala who have declared their presidential ambition.\nRecall that Governor Tambuwal came second to former vice-President Atiku Abubakar at the PDP Presidential primary in 2018."
  },
  {
    "headline": "JUST IN: Gov Ganduje’s Critic, Mu’azu Magaji Sent To Prison",
    "summarized_story": "JUST IN: Gov Ganduje’s Critic, Mu’azu Magaji Sent To PrisonMu’azu Magaji, the former Kano State Commissioner for Works and Infrastructure, has been remanded in a state prison.\nMu’azu Magaji was arrested in Abuja shortly after granting a live interview on Trust TV where he criticized the government of Ganduje.\nThe former Commissioner is facing a four-count charge, bordering on defamation of character, intentional insult, injurious falsehood and inciting disturbance against the state governor."
  },
  {
    "headline": "BREAKING: EFCC Charges Okorocha With N2.9 Billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission has charged Nigerian senator and former governor of Imo State, Rochas Okorocha, with allegations he conspired with others, including an APC politician and five companies, to steal N2.9 billion public coffers.\nEFCC filed the charges, totalling 17, on Monday, at the Federal High Court, Abuja, court documents exclusively obtained by PREMIUM TIMES show.\nIn addition to Mr Okorocha, other defendants are Anyim Nyerere Chinenye, Naphtali International Limited, Perfect Finish Multi Projects Limited, Consolid Projects Consulting Limited, Pramif International Limited, and Legend World Concepts Limited.\nThe charges were filed about the same time Mr Okorocha was declaring his intention to run for the office of the president in 2023.\nMore to follow…"
  },
  {
    "headline": "Pictures: Minister Nwajiuba visits IBB in Minna",
    "summarized_story": "Minister of State Education, Hon Chukwuemeka Nwajiuba, Monday, paid a courtesy visit to former President Gen. Ibrahim Babangida (Rtd) at his Hilltop Mansion in Minna.\nBlueprint reports that the Minister who was on an official visit to Niger state used the occasion to the visit the former Head of State and elder Statesman to discuss the State of the nation and and how to chart a way forward.\nDescribing the Minister as quite, unassuming but brilliant young man, Gen. Babangida appreciated Hon.\nNwajiuba for the visit.\nHe expressed excitement at the great ideas and thoughts coming from the Minister on how to surmount the various challenges facing the country and build a more harmonious prosperous nation."
  },
  {
    "headline": "Breaking: Again, Buhari receives new Electoral Act Amendment Bill",
    "summarized_story": "The National Assembly (NASS) Monday transmitted the authenticated copies of the new Electoral Act (Amendment) Bill 2022 to President Muhammadu Buhari, Senior Special Assistant to the President on NASS (Senate) Senator Babajide Omoworare has said.\nOmoworare said this in a statement issued in Abuja.The statement reads: “The Clerk to the National Assembly Mr. Olatunde Amos Ojo has transmitted the authenticated copies of the Electoral Bill 2022 to the President of the Federal Republic of Nigeria Muhammadu Buhari GCFR on 31st January 2022.\n“This was done in accordance with the provisions of Section 58 (3) of the 1999 Constitution of the Federal Republic of Nigeria (as amended) and the Acts Authentication Act Cap.\nPresident had withheld assent to the Electoral Bill 2021 transmitted to him on 19th November 2021.\nThe Electoral Bill was thereafter reworked by the National Assembly and both the Senate and the House of Representatives passed same on 25th January 2022.”"
  },
  {
    "headline": "Revealed! Ex-beauty pageant who jumped from 60 storey building",
    "summarized_story": "A former Miss USA Cheslie Kryst has been identified as the woman who leaped to her death from a Midtown high-rise Sunday, law-enforcement has revealed.\n“In devastation and great sorrow, we share the passing of our beloved Cheslie,” the former beauty queen’s family said in a statement Sunday.\n“Cheslie embodied love and served others, whether through her work as an attorney fighting for social justice, as Miss USA and as a host on EXTRA,” her family said.\nSources said Kryst left behind a note saying she wanted to leave everything to her mother, a former pageant competitor herself who was crowned Mrs. North Carolina in 2002.\nI know that I’m getting up and I’m starting my day."
  },
  {
    "headline": "NASS Transmits Re-Amended Electoral Bill To Buhari For Assent",
    "summarized_story": "The National Assembly has transmitted the re-amended Electoral Act Amendment Bill to President Muhammadu Buhari for assent.\nOmoworare stated that the Clerk to the National Assembly, Olatunde Ojo, transmitted the authenticated copies of the bill to the President on Monday.\nPresident had withheld assent to the Electoral Bill 2021 transmitted to him on 19th November 2021.\nOn Tuesday last week, lawmakers in the two chambers passed the harmonised version of the Electoral Act Amendment Bill – the final agreed version of the amendment to Clause 84 of the bill.\nThis bill included the direct, indirect, and consensus primary modes of nominating candidates by political parties for elections."
  },
  {
    "headline": "Alleged N2.9bn Fraud: EFCC Files 17 Charges Against Rochas Okorocha",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has filed a 17-count charge to the tune of N2.9 billion against a former governor of Imo State, Senator Rochas Okorocha.\nOkorocha, in the charges filed on Monday at the Federal High Court in Abuja, was accused of conspiring with others, including a member of the All Progressives Congress (APC) and five companies to steal from public coffers.\nOthers listed as respondents to the suit are Anyim Nyerere Chinenye, Naphtali International Limited, Perfect Finish Multi Projects Limited, Consolid Projects Consulting Limited, Pramif International Limited, and Legend World Concepts Limited.\nThe charges were filed about the same time Senator Okorocha was declaring his intention to run for the office of the president in 2023.\nThe charges claimed that the stolen funds were diverted between October 2014 and February 2016 from the Imo State Government House’s account and Imo State Joint Local Government Project’s account."
  },
  {
    "headline": "Over 12 Persons Killed As Gunmen Attack Repentant Bandits In Katsina",
    "summarized_story": "Over 12 persons were killed after a group of gunmen attacked repentant bandits in Illela village, Safana Local Government Area of Katsina State.\nAccording to the residents, the gunmen came on a mission to attack a repentant bandit popularly known as Mani Turwa, who was said to be protecting the community.\nThey were, however, overpowered by Turwa’s team and several rustled domestic animals were recovered from them.\nThe bandits were displeased by Turwa’s action, and they returned in reprisal destroying houses and killing innocent residents.\nRepentant TurwaIn April 2021, Mani Turwa, one of the most notorious bandits in the Safana – Danmusa – Batsari axis, surrendered his arms to the police."
  },
  {
    "headline": "Work Permit Row: Nigerian Professionals In UAE Embark On Narrative-Changing Campaign",
    "summarized_story": "Nigeria professionals living in the United Arab Emirates (UAE) have commenced a narrative campaign online to appeal the work permit restriction by the country.\nPresident of the group, Professional Nigerians in UAE, Kayode Ogungbohun is leading the campaign.\nHe added that the campaign which commenced 14 days ago is helping to project Nigerians and how Nigerian professionals contribute to UAE’s economy.\nRELATED: ‘We Are Starving Here,’ Nigerians In UAE Lament Work Permit RestrictionsShe also explained how the permit restriction has left her stranded.\nA work visa is the most common route to getting residency in the Middle East country, so all those caught in the web of the lingering work permit restrictions row have also lost their residency status."
  },
  {
    "headline": "Mali Junta Expels French Ambassador In Fresh Bout Of Tension",
    "summarized_story": "Mali on Monday said it was expelling the French ambassador in the light of “hostile” comments, a move likely to ratchet up tensions with its former colonial ruler and ally following a military coup.\nThe French foreign ministry issued a brief statement saying it “takes note” of the announcement and expressed “solidarity with its European partners” — its allies in the anti-jihadist mission.\nLast week, French Foreign Minister Jean-Yves Le Drian told reporters that Mali’s junta was “illegitimate” and its decisions “irresponsible”.\nMonday’s statement in Bamako said remarks had been made that were “hostile and outrageous”, and had been uttered “despite repeated protests” by Mali.\nFrench pullbackAs friction worsened last year, France started scaling back 5,100-man Barkhane Sahel operation and pulling out of some bases in northern Mali."
  },
  {
    "headline": "NASS clerk transmits authenticated copies of Electoral Bill 2022 to Buhari -",
    "summarized_story": "The Clerk to the National Assembly Mr. Olatunde Amos Ojo has transmitted the authenticated copies of the Electoral Bill 2022 to the President of the Federal Republic of Nigeria Muhammadu Buhari GCFR on 31st January 2022.\nThis was done in accordance with the provisions of Section 58 (3) of the 1999 Constitution of the Federal Republic of Nigeria (as amended) and the Acts Authentication Act Cap.\nA2 LFN 2004.\nAdvertisementMr. President had withheld assent to the Electoral Bill 2021 transmitted to him on 19th November 2021.\nThe Electoral Bill was thereafter reworked by the National Assembly and both the Senate and the House of Representatives passed same on 25th January 2022."
  },
  {
    "headline": "Police parade 98 political thugs arrested on eve of primary elections in Ekiti -",
    "summarized_story": "The Ekiti State Police Command has paraded 98 suspected thugs arrested by the military in the build up to the just concluded Governorship Primary of the two major Political parties in the State.\nThe Public Relations Officer of the Ekiti State Police Command, Sunday Abutu while parading the suspects did not reveal the identity of the Sponsor of the Criminals, even though the command is aware of the SponsorAdvertisementThe Police Spokesperson further revealed that investigation is still ongoing into the matter and the Suspects will be charged to Court for Possible ProsecutionIt would be recalled that the suspected armed thugs were arrested on the eve of the PDP primary election, by military at Itawure checkpoint armed with dangerous weapons, and taken to Akure for Questioning before being released to the Police on SaturdayAdvertisement"
  },
  {
    "headline": "Former Imo governor, Rochas Okorocha officially declares for 2023 Presidency -",
    "summarized_story": "Former Governor of Imo State and Senator representing Imo West, Senator Rochas Okorocha has officially declared his intention to contest 2023 Presidency.\nSenator Rochas made this announcement at a World Press Conference in Abuja on Monday.\nAdvertisementThe Imo State Lawmaker said if elected his priority will be to reunite Nigeria which he believes is the root cause of the many troubles the country currently deals with.\nAdvertisementHe again has promised that if elected president, access to education will be free and compulsory from basic to the secondary level.\nSenator Okorocha believes there’s hope for a new Nigeria and he has the capacity to guide the country through the path of economic growth and prosperity."
  },
  {
    "headline": "Video: Babajide Otitoju gives assessment on Ekiti Governorship Primaries -",
    "summarized_story": "The just concluded governorship primaries of the governing All Progressives Congress and the People’s Democratic Party has thrown up different issues about party politics and their internal mechanisms.\nIn this interview, Babajide Kolade-Otitoju, a veteran Journalist and Public Affairs Analyst, shares his views on the matters arising from the governorship primaries.in Ekiti State.\nAdvertisement"
  },
  {
    "headline": "African Union Suspends Burkina Faso Over Military Coup",
    "summarized_story": "The African Union (AU) has suspended Burkina Faso’s membership following last week’s coup that ousted the democratically-elected President Roch Marc Christian Kabore.\nThe AU said the suspension of the West African country would be effective until constitutional order is restored in the country.\n“Council decides in line with the relevant AU instruments to suspend the participation of Burkina Faso in all AU activities until the effective restoration of constitutional order in the country,” AU said in a tweet on Monday.\nThe Economic Community of West African States (ECOWAS) has earlier suspended Burkina Faso and demanded the immediate release of President Roch Marc Kabore who was ousted and detained by the military junta.\nThe latest coup in Burkina Faso takes the toll to fourth in the West African region in 18 months."
  },
  {
    "headline": "Stepsons Demolish Home of 98 Year-old Widow – What’s Trending",
    "summarized_story": "98 year-old widow finds home demolished by family members as they refute her right to own anything left behind by late husband.\nA photo goes viral on Twitter showing the Bayelsa State Waterboard building with a wheelbarrow full of water kegs parked in front of it.\nNigerian social media found it comedic as the photo suggests that the state waterboard was being supplied with water themselves, in water kegs.\nGovernor of Bauchi State, Bala Mohommed insists that the presidency be zoned to the North-east of Nigeria.\nBauchi Governor also confirms that he belongs to the PDP and claims the APC, its opposition party, is the one that has zoning controversies."
  },
  {
    "headline": "2023 Presidency: PDP Under Pressure Over Zoning",
    "summarized_story": "Despite its role as the originator of rotational presidency in Nigeria, the Peoples Democratic Party may be seriously considering setting aside zoning in the 2023 election and opening up the contest for its presidential ticket to contenders from all six geopolitical zones.\nBut this has not gone done well with many socio-cultural groups such as the Middle Belt Form, the Pan Niger Delta Forum, PANDEF, and Ohanaeze Ndigbo, which have traditionally been supporters of the main opposition party.\nTheir agitation is coming against the backdrop of PDP presidential hopefuls such as former Vice President Atiku Abubakar and former Senate President Bukola Saraki who have been pressurising the party to jettison the zoning arrangement.\nTo discuss the clamour for an open contest among presidential aspirants from the six geo-political zones and how the PDP intends to manage the contending forces against it, are Chief Bode George, former Deputy National Chairman, South of the PDP, and Emmanuel Ogidi, former Vice Chairman, South South of the PDP."
  },
  {
    "headline": "RISE.TV HEADLINES 31-01-22",
    "summarized_story": ""
  },
  {
    "headline": "Moderna Launches Clinical Trials for HIV Vaccine",
    "summarized_story": "Human clinical trials have started for an experimental HIV vaccine that uses the same kind of mRNA technology found in Moderna’s successful COVID-19 vaccine, the drug company has announced.\nA booster shot to work with the HIV vaccine was also being studied.\nThe release stated that 56 healthy HIV-negative adults took part in the clinical trial, with 48 getting one or two doses of the mRNA vaccine and 32 also getting the booster.\nThe World Health Organisation says 37.7 million people in the world had HIV in 2020.\n“The search for an HIV vaccine has been long and challenging, and having new tools in terms of immunogens and platforms could be the key to making rapid progress toward an urgently needed, effective HIV vaccine.”"
  }
]