[
  {
    "headline": "Cancer: Experts highlight dangers of wrong diagnosis",
    "summarized_story": "A consultant clinical oncologist and lecturer at the College of Medicine, University of Lagos, Dr. Omolola Salako, has advised cancer patients to seek specialists’ attention for treatment of their ailment rather than embracing medications from quack doctors, spiritualists and non-specialists.\nAccording to her, cancer patients die due to wrong diagnosis and treatment methods, adding that treatment of cancer is ‘super-specialised’ and required the effort of experts to handle because cancer was not a death sentence.\nShe spoke during the 2nd Annual Memorial Cancer Awareness Lecture, organised by Ellen Adeyinka Anjorin Cancer Foundation with the theme, ‘Cancer treatment with special reference to Chemotherapy: pros and cons’, held in Lagos.\n“Cancer in women occurs usually as breast or cervical cancer while in men, it’s either prostate or kidney cancer.\nAccording to him, he discovered that financial implications, treatment pattern and education are paramount issues of concern in cancer management."
  },
  {
    "headline": "CSO wants budget violation criminalised in Nigeria",
    "summarized_story": "A Civil Society Organisation, Niger Delta Budget Monitoring Group, in collaboration with a non-governmental organisation, OXFAM, has canvassed criminalisation of budget violation and indiscipline to be criminalised in Nigeria.\nThe group’s position is contained in a communique issued at the end of a two-day advocacy roundtable on civic inclusion, budget monitoring, transparency, accountability, gender inclusion and alliance building held in Uyo, the Akwa, Ibom State capital.\n“Fiscal entities should begin to synergise with CSOs and communities for inclusive and effective monitoring of project implementations.\nRead Also“Since budget document is an Act of Parliament, violation of its contents should attract serious sanctions, while budget indiscipline should be criminalised.\n“The executive should publish and share, on a quarterly basis, budget performance reports, as well as list of contracts to be awarded, giving its contents, locations, and other relevant information on each project’s performance to enhance transparency."
  },
  {
    "headline": "Domestication of UN CRPD Article 4 will end insecurity in Nigeria — JONAPWD",
    "summarized_story": "“The resilient group continued to push for the process even under the leadership of the Late President Umaru Musa Yar’Adua as well as his successor, President Goodluck Jonathan,” The JONAPWD submitted.\n“On 24th August, 2020, HE President Muhammadu Buhari, established the National Commission for Persons with Disabilities.\n“On 3rd December, 2020, the Honorable Speaker of the House of Representatives, established, House Standing Committee on Disability.\nYou were the best in protecting and promoting our Constitutional, Social, disability and Human Rights.\n“Once again, we wish the American people and government through the staff of the American Mission in Nigeria, a Happy 250th Year Independence Day Anniversary”, the JONAPWD Board of Trustees Secretary wrote."
  },
  {
    "headline": "Victimization: Abuja court fixes July 23rd to arraign OGFZA officials",
    "summarized_story": "The court chose to give the order in a letter titled, “Reference of Direct Criminal Complaint by 1.\nSlenju Angofa,” after counsel to the nominal complainant, Nkereuwem Akpan, informed the court that both officials of the OGFZA, who are the accused persons, had evaded service of court processes despite several attempts.\nWith the same breath, he has sought for the order of the court to direct OGFZA to pay all his outstanding salaries, benefitsand entitlements since the year 2011 when he was suspended from the office.\nOmosule has also asked the court to award exemplary and general damages up to the sum of N50 million to him.\nThe notice of hearing of the case that was slated for Court 2 of the FCT High Court at Wuse Zone 2, Abuja was dated the 24th of June 2021, under the stamp and signature of the Registrar of the court"
  },
  {
    "headline": "Attack: FG commiserates Adamawa community",
    "summarized_story": "The Federal Government on Saturday commiserated the Dabna community in Hong Local Government Area of Adamawa over the Boko Haram insurgents’ attack in the area.\nMustapha said the visit was in line with the directives of President Muhammadu Buhari to sympathise with the community.\n“The devastating and very sad attack unleashed on peace-loving and farming community of Dabna is disheartening.\n“What happened in Dabna community is something that no one wished it to happen anywhere,” he said and urged them to be calm.\nAlso speaking, Mr Simon Yakubu, District Head of Dugwaba, thanked President Buhari for the quick response and for sending a delegation to identify with them."
  },
  {
    "headline": "NEMA commence routine food distribution for Borno IDPs",
    "summarized_story": "By Ndahi Marama, MaiduguriThe National Emergency Management Agency (NEMA) has began routine food distribution for Internally Displaced persons, IDPs in various resettlement camps, host/ liberated communities in Borno state.\nThis was disclosed in a press statement signed by the Zonal Principal Information Officer, Abdulkadir Ibrahim, which was made available to our Correspondent on Saturday.\nThe statement said, “Millions of IDPs in Borno State, have been receiving food items provided by NEMA as support for victims of insurgency.\n“The food items were approved for distribution by the Director General NEMA, Alhaji Mustapha Habib Ahmed as part of the Federal Government’s efforts to support the Borno State Government, under the leadership of Governor, Professor Babagana Umara Zulum in easing the hardship of IDPs displaced by insurgency.\n“Each household will get a ration consisting of food items which includes a bag of beans, rice, maize and condiments like seasoning, such as salt, tomato paste and cooking oil among others”."
  },
  {
    "headline": "LEDAP, Malala Fund embark on awareness campaign to address school drop-out, others",
    "summarized_story": "By Bashir Bello, KanoWorried by the high rate of out of school children, a Non-Governmental Organization, Legal Defence and Assistance Project (LEDAP) in partnership with Malala Fund says it is embarking on an awareness campaign to address the trend.\nMaryam Ahmad further decried the high rate of out of school children in the country which stands at 13.5 million.\nCrisis, insecurity, cultural and religious dispositions and poor funding have been limiting factors to quality education in these states.\n“The emergence of the novel COVID-19 pandemic has further put a strain on child education.\n“Against this backdrop, LEDAP in conjunction with Malala Fund is raising awareness on the right to free, compulsory and quality basic education in Nigeria."
  },
  {
    "headline": "Nnamdi Kanu won't die in prison",
    "summarized_story": "The leader of INRI Evangelical Spiritual Church, Primate Ayodele, has reacted to claims that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, will die in detention.\nPrimate Ayodele assured that Kanu will not die in prison despite his current travail.\nAccording to Ayodele: “Nnamdi Kanu will not die in prison, much later he will be granted bail.”In 2017 Kanu was first arrested and later charged before an Abuja Federal High Court-led by Justice Binta Nyako.\nUpon his rearrest, the IPOB leader was repatriated back to Nigeria and re-arraigned before Justice Nyako again.\nMeanwhile, Kanu’s lawyer, Ifeanyi Ejiofor had disclosed that the IPOB leader would soon be released."
  },
  {
    "headline": "PIB: Stakeholders, Ondo communities kick, reject 3% oil revenue",
    "summarized_story": "Stakeholders in Ondo State have described the proposal by the National Assembly to give only three percent share from oil and gas revenue to host communities as unfair and unacceptable.\nReacting to the proposal spelt out in the Petroleum Industry Bill, PIB, the stakeholders said it was insensitive to allocate such paltry share to host communities that had their environment exposed to health hazards.\nDuring the week, the southern governors at the meeting held in Lagos faulted the proposed share of the three percent.\nWhile applauding the Southern Governors on their stance over the development, Dr. Tunji Abayomi, said resolutions of the governors focused on the issues at hand and their advancement.\nFormer Chairman of the Social Democratic Party, SDP, in Ondo State, Chief Korede Duyile said “It is quite commendable that they could stand on their feet to defend their people."
  },
  {
    "headline": "Shehu Sani reacts as bandits kill 40 people in Zamfara",
    "summarized_story": "Former Senator, Shehu Sani has described as another tragedy the reported killings of about 40 people in Zamfara State.\nSani, who took to his personal Facebook page to react to the tragedy, also urged the federal government to rise to the dangers beyond its current efforts and confront what he termed as monsters.\n“The reported killing of about 40 people in Zamfara by Bandits is another tragedy.\n“This is what has become of the North West.The FG must rise to this danger beyond its current efforts and confront these monsters.\nStrike: Bandits living better than Kaduna workers – Shehu Sani"
  },
  {
    "headline": "I inherited substandard govt hospitals, fake doctors in 2015",
    "summarized_story": "Niger State Governor, Abubakar Sani Bello, says he inherited many challenges from the state government hospitals ion assumption of office.\nHe also lamented the activities of quack Doctors in both government and private hospitals, especially those operating in rural areas of the state.\n”The governor explained that the ethics of the medical profession was being abused by doctors in government-owned hospitals who are in the habit of referring patients to private hospitals owned by their friends.\n“I inherited a lot of problems and challenges at the health sector in 2015 when my administration came on board.\n“The problem of quack Doctors and hospitals carrying out functions that is beyond their powers with attendant loss of lives was another biggest challenge."
  },
  {
    "headline": "Nnamdi Kanu's British passport still in Kenya",
    "summarized_story": "Kingsley Kanu, a brother to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, has claimed the secessionist’s British passport is still in Kenya.\nKingsley said he spoke with Nnamdi while he was in Kenya, before “he went missing.”He claims the IPOB leader was taking a walk when he was arrested and taken away without his documents.\nHis associates said he went out, he didn’t take his documents with him; so he wasn’t planning on going anywhere.\nThe report also said evidence at its disposal proves Kanu entered Kenya this year on his British passport on a visa expiring in June, adding “His UK passport remains in Kenya.”Kanu does not have a Nigerian passport according to his family, who insists he renounced Nigerian citizenship in his broadcasts.\nReps ask immigration to review MoU on passport production"
  },
  {
    "headline": "Court ruling has vindicated me, says ex-Finance Minister Adeosun",
    "summarized_story": "A former Minister of Finance Mrs. Kemi Adeosun said she has been vindicated by a Federal High Court in Abuja.\nShe said the judgement of Justice Taiwo Taiwo was not only a personal victory for her but for all Nigerians in the Diaspora.\nThe court on Wednesday said the ex-Minister ought not to present herself for NYSC scheme in the first instance.\nJustice Taiwo Taiwo said NYSC certificate was not relevant to her appointment as a minister.\nHe said her appointment was not illegal or not unconstitutional without NYSC certificate."
  },
  {
    "headline": "We did not arrest ‘Buhari–Must-Go’ protesters – Dunamis",
    "summarized_story": "Dunamis International Gospel Centre has disproved claims it handed over five ‘Buhari-Must-Go’ protesters to the Department of State Service (DSS) during last Sunday’s church service.\nThe protesters were arrested last Sunday at the Dunamis church’s glorious doom along the Airport road, Abuja.\nDunamis said the protesters were arrested outside the church, adding that they had no hand in the arrest of the youths.\n“The live-streaming had the caption, “Buhari-Must-Go protest hits Dunamis Church in Abuja.”The statement condemned the protesters by stating the church was not a protest ground.\n“The church has no right to arrest and detain people and has no detention custody."
  },
  {
    "headline": "PHOTOS: Actress Rosy Meurer shares moments of bonding with son.",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: Nick Canon says he had his kids on purpose",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Female dognappers arrested in Texas, puppy worth $10,000",
    "summarized_story": "Two dognappers have been arrested by police after trying to steal a very expensive puppy.\nThe women were arrested on Monday, July 5, after allegedly stealing a French bulldog puppy worth $10,000 from a Texas pet store.\n“French bulldogs are very highly sought after and, as a result, it is what people are attempting to steal.”This is not the first time in recent memory that French bulldogs have been kidnapped.\nIn February this year, robbers shot a dog walker working for Lady Gaga and took two of the singer’s French bulldogs in Los Angeles.\nRyan Fischer, the dog walker, has since recovered."
  },
  {
    "headline": "I’m open to marriage despite having 2 kids –Uche Ogbodo",
    "summarized_story": "Despite being a single mum of two, Nollywood actress, producer and model, Uche Ogbodo is still open to marriage.\nIn an encounter with Saturday Sun, Ogbodo, who recently welcomed her second child with her younger lover, Bobby Maris, opens up on her fears for marriage including conditions for venturing into matrimony.\n“I have never criticized good marriages, I always condemn bad marriages; the ones full of abuse – mental, physical and spiritual.\nSo, I haven’t closed the chapter of marriage in my life but I am not too desperate for marriage.\nEverybody deserves to be happy, married and with a loved one.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "How I met and married TB Joshua, by wife, Evelyn",
    "summarized_story": "You know, things like that.\nHe told me a lot of things about myself, the ones I know and the ones I didn’t know.\nI think the last place I worked before I met him was at Nigerian Distilleries in Ota, Ogun State.\nAnd, the fact that he proposed to me the first time that we met without waiting to know some things about me.\nI saw a kind-hearted man, a man of one purpose; a man with a sole aim: to please God at all times, with every other thing being secondary."
  },
  {
    "headline": "Deadly trap: How evangelist, others slaughtered building contractor",
    "summarized_story": "They were able to track down the supposed priest, Samuel Aloko who turned out to be one of the assassins.\n“He is a contractor and has many sites where he is building houses.\n“Sometime in April, Samuel called me and two others that there was a job for us and N25 million was involved.\nWe took him to a site called Project in Lafia.\nI made a lot of money and it was during some of our operations that I met Samuel and Agwale."
  },
  {
    "headline": "Amidst tears, eulogies, TB Joshua journeys home",
    "summarized_story": "By Job Osazuwa and Vera Wisdom-BasseyThe remains of the late Prophet TB Joshua, Founder of Synagogue Church of All Nations (SCOAN), were laid to rest yesterday at his church in Ikotun-Egbe area of Lagos.\nOndo State Government House Choir gave a soul-lifting rendition.\nHe said TB Joshua was a special creature right from childhood, and started performing miracles even as a young man while in school.\n“He also paid electricity bills for four local government areas in Ondo State.\n“By all standard, TB Joshua led a Christ-like life."
  },
  {
    "headline": "Detained protesters: Call police to order, rights groups, lawyers tell Sanwo-Olu",
    "summarized_story": "The police had on July 5 taken the detainees to the State Magistrates’ Court to secure an order to further detained them in its custody pending investigation.\nDifferent rights groups and lawyers have also called on Governor Babajide Sanwo-Olu and the state Attorney General and Commissioner for Justice, Mr. Moyosore Onigbanjo SAN, to call the police to order and not to undermine the constitution of the country.\nKunle Adegoke, SAN, was among the lawyers who condemned the detention of the protesters, saying the action of the police amounted to violation of human rights and breach of the constitutional right of the protesters.\nA Yoruba self-determination group, Yoruba Ko’ya Liberation Movement (YKLM), also shared same view with various stakeholders who condemned the action of the police.\nThe group, in a statement issued by its Director of Media and Publicity, Mr. Femi Oluwajuyitan, also called for the release of the detained protesters."
  },
  {
    "headline": "Buhari: We Are Employing New Tactics to Contain Security Challenges",
    "summarized_story": "Kingsley Nwezeh in AbujaPresident Muhammadu Buhari said yesterday that the federal government was deploying new tactics and state power to contain security challenges and promote peace in the country.\nPresident Buhari made the declaration in a message to the graduation ceremony of the 43rd Course participants of the Armed Forces Command and Staff College (AFCSC), Jaji, Kaduna State.\nA statement issued by the minister’s office last night said the president while reflecting on the national security challenges facing the nation, said his administration “is employing new tactics and deploying state powers to promote peace and tranquillity in the country”.\nThe president reminded them that graduation was a clarion call to taking up higher duty in service to their fatherland.\nHe lauded what he called “milestone achievements and pivotal roles, the esteemed military institution is playing in raising the bar of robust professional competences of the armed forces of the various nations”."
  },
  {
    "headline": "Bandits Invade Gov Matawalle’s Local Government, Kill 42",
    "summarized_story": "Francis Sardauna in KatsinaBandits killed 42 farmers on Thursday evening in five communities in Faru, Maradun Local Government Area of Zamfara State.\nHe said: “Yesterday (Thursday) at about 4:30pm bandits armed with sophisticated weapons attacked Faru Village when some of us were still working on our farms.\nThey (bandits) killed 39 people on their farms and injured many others.\n“They (bandits) attacked the village because last Wednesday, Yan’sakai arrested and killed two bandits along Mafara- Faru road who were nabbed with two AK-47 riffles.\nMuhammad Shehu, while confirming the incident, said 35 people lost their lives as a result of the attack by the bandits in the village."
  },
  {
    "headline": "Osinbajo: Taming Poverty with Common Sense",
    "summarized_story": "Festus Akanbi and Deji ElumoyeVice-President Yemi Osinbajo yesterday said the President Muhammadu Buhari administration plans to rely on a common-sense strategy to lift 100 million Nigerians out of poverty within a time frame of 10 years.\n“I want us to look beyond all of what we are going to be doing, there is going to be a considerable amount of paperwork, but a lot of common sense is what grows economies.\nAccording to him, “countries that have managed to get out of poverty have created a lot of jobs through industries, and they have developed intentional strategies.\n“We must look at what others have done, the smart things that other people have done, and adopt.\nOsinbajo explained that the National Poverty Reduction with Growth Strategy is meant to be a national strategy, not just a federal effort and it is aimed at taking 100 million people, nationally, out of poverty within a target time-frame of 10 years."
  },
  {
    "headline": "Oba of Benin, Obaseki Set for Showdown over Looted Artefacts",
    "summarized_story": "However, Obaseki told THISDAY that he was working on a tripartite arrangement, involving the federal and state governments, the Oba of Benin and a private trust that would manage the artefacts on behalf of the palace and the people.\nHis plan, it is gathered, is to have the private trust build a museum of West African Arts in Benin, the state capital, where the artefacts would be kept and curated.\nLegacy Restoration Trust, a private entity, THISDAY learnt, has since emerged, parading itself as the authorised custodian of the artefacts.\n“That they are known as Benin Bronzes is already a confirmation of their source of origin (which is Benin),” Mohammed said.\nHe thanked Germany for taking the leadin the global efforts to repatriate all artefacts looted from Nigeria and the African continent."
  },
  {
    "headline": "Customs Collect N1tn Revenue in Six Months",
    "summarized_story": "James Emejo in AbujaThe Nigeria Customs Service (NCS) yesterday said it collected over N1 trillion between January and June 2021 as revenue for the federation.\nThe Customs Public Relations Officer (PRO), Mr. Joseph Attah, while addressing journalists in Abuja, said: “Hitting the trillion-naira mark within six months is unprecedented in the service”.\nHe stated that the agency will always be willing to break its records and to generate more revenue above the target under a favourable environment.\nOn its enforcement duties, Attah said the agency seized a total number of 2,333 assorted items, with duty paid value of N4.42 billion.\nHe said given the level of compliance, the deadline for the verification process had been further extended by 14 day."
  },
  {
    "headline": "REVEALED: Identities Of Nine EndSARS Protesters Still Wallowing In Police Detention In Lagos",
    "summarized_story": "No fewer than nine peaceful protesters who participated in the October EndSARS protests in Lagos State are languishing in police detention, SaharaReporters has learnt.\n“The court date is July 26; these are the remaining names of EndSARS protesters; Oloto Ramon, Kehinde Aromire, Shina Johnson, Yussuf Olatunji, Osuolale Kabiru, Adeshina Riliwan, Adebayo Abisoye, Ahmmed Lawal, Michel Immanuel.\nSaharaReporters had learnt that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\nOn June 5, Obafunwa, the consultant pathologist to the Lagos State government, had first revealed that out of a total of 99 bodies examined for autopsy after the #EndSARS protests, three were from Lekki.\nHe said out of the 99 bodies received, three were brought in from Lekki."
  },
  {
    "headline": "REVEALED: Identities Of Nine EndSARS Protesters Still Wallowing In Police Detention In Lagos",
    "summarized_story": "No fewer than nine peaceful protesters who participated in the October EndSARS protests in Lagos State are languishing in police detention, SaharaReporters has learnt.\n“The court date is July 26; these are the remaining names of EndSARS protesters; Oloto Ramon, Kehinde Aromire, Shina Johnson, Yussuf Olatunji, Osuolale Kabiru, Adeshina Riliwan, Adebayo Abisoye, Ahmmed Lawal, Michel Immanuel.\nSaharaReporters had learnt that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\nOn June 5, Obafunwa, the consultant pathologist to the Lagos State government, had first revealed that out of a total of 99 bodies examined for autopsy after the #EndSARS protests, three were from Lekki.\nHe said out of the 99 bodies received, three were brought in from Lekki."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "APC Senator’s Wife Defrauds House Seekers In Abuja, Gets Court Notice",
    "summarized_story": "Lawal GumauDocuments showed that Amina disguised as the house owner and issued a tenancy agreement to new house seekers on a property she rented.\nA concerned resident had alerted the owner, Madam Ndokwa Ofili, who stays in Garki, Abuja, from whom Hajia Amina rented the house, that the Senator’s wife was suspiciously defrauding people with the house.\nSpeaking with SaharaReporters, Ofili’s lawyer, Barrister Geoffrey Ugwuayi, stated that the bubble burst when they wrote to the Senator’s wife to renew her rent but was not forthcoming.\nHe sent a copy of the letter “Notice for Rent Renewal” given to the Senator’s wife, dated March 2, 2021, and another one, March 22, 2021.\nReplying through her lawyer, M.A Ajara, the Senator’s wife, has April 30, 2021, for payment but still had not done so at the time of filing this report, thereby necessitating a court notice."
  },
  {
    "headline": "PHOTOS: Chibok girl graduates from AUN -- seven years after Boko Haram ordeal",
    "summarized_story": "Mary Katambi, one of the Chibok girls who escaped Boko Haram captivity in 2014, has graduated from the American University of Nigeria (AUN) with an accounting degree.\nAdvertisementAtiku Abubakar, former vice-president and founder of AUN, took to his social media platforms to share photos from the commencement ceremony which held on Saturday in Yola, Adamawa state capital.\n“Mary Katambi, I’m proud that seven years after your release from Boko Haram captivity, you’ve beaten the odds to graduate with a degree in accounting from American University of Nigeria.\nAdvertisementMary was one of the 276 girls kidnapped from Government Girls Secondary School (GGSS), Chibok in Borno state, by the Boko Haram terror group in 2014.\nTheCable had earlier reported that Joy Bishara and Lydia Pogu, ex-students of GGSS Chibok who also escaped from Boko Haram in 2014, have graduated from Southeastern University in the United States."
  },
  {
    "headline": "PHOTOS: Chibok girl graduates from AUN -- seven years after Boko Haram ordeal",
    "summarized_story": "Mary Katambi, one of the Chibok girls who escaped Boko Haram captivity in 2014, has graduated from the American University of Nigeria (AUN) with an accounting degree.\nAdvertisementAtiku Abubakar, former vice-president and founder of AUN, took to his social media platforms to share photos from the commencement ceremony which held on Saturday in Yola, Adamawa state capital.\n“Mary Katambi, I’m proud that seven years after your release from Boko Haram captivity, you’ve beaten the odds to graduate with a degree in accounting from American University of Nigeria.\nAdvertisementMary was one of the 276 girls kidnapped from Government Girls Secondary School (GGSS), Chibok in Borno state, by the Boko Haram terror group in 2014.\nTheCable had earlier reported that Joy Bishara and Lydia Pogu, ex-students of GGSS Chibok who also escaped from Boko Haram in 2014, have graduated from Southeastern University in the United States."
  },
  {
    "headline": "FG rejects Flour Mills, Flutterwave's tax holiday applications",
    "summarized_story": "The federal government has declined applications from 10 companies seeking pioneer status under the industrial development income tax relief Act (IDITRA).\nAdvertisementThis is according to the Nigerian Investment Promotion Commission (NIPC) report on pioneer status incentive (PSI) applications for the first quarter of 2021 (Q1 2021).\nOthers are Royal Foam Products Nigeria (mattress), ENGIE Fenix Nigeria (solar), Flour Mills of Nigeria (grain products), Envoy Hotel (hotel), and Flutterwave Technology Solutions (online payment).\nAdvertisementRoyal Foam and Flour Mills applications were rejected because it was not eligible under IDITRA (expansion project); and Fountain Manufacturing and Super Packaging Limited was because its activities are not in the PSI list.\nThe report further disclosed that there are 33 current PSI beneficiaries, including Dangote Sinotrucks West Africa and Honeywell Flour Mills; while the applications of 132 companies are pending."
  },
  {
    "headline": "FG rejects Flour Mills, Flutterwave's tax holiday applications",
    "summarized_story": "The federal government has declined applications from 10 companies seeking pioneer status under the industrial development income tax relief Act (IDITRA).\nAdvertisementThis is according to the Nigerian Investment Promotion Commission (NIPC) report on pioneer status incentive (PSI) applications for the first quarter of 2021 (Q1 2021).\nOthers are Royal Foam Products Nigeria (mattress), ENGIE Fenix Nigeria (solar), Flour Mills of Nigeria (grain products), Envoy Hotel (hotel), and Flutterwave Technology Solutions (online payment).\nAdvertisementRoyal Foam and Flour Mills applications were rejected because it was not eligible under IDITRA (expansion project); and Fountain Manufacturing and Super Packaging Limited was because its activities are not in the PSI list.\nThe report further disclosed that there are 33 current PSI beneficiaries, including Dangote Sinotrucks West Africa and Honeywell Flour Mills; while the applications of 132 companies are pending."
  },
  {
    "headline": "Buhari goes to bed thinking of Nigerians, says Jigawa governor",
    "summarized_story": "Muhammadu Badaru, governor of Jigawa state, says President Muhammadu Buhari is honest, transparent and “sleeps with Nigerians at heart”.\nAdvertisementHe said the president has done well for Nigerians in ensuring infrastructural development to fast-track sustainable social and economic development in the country.\nThe governor praised Buhari on his economic policies, particularly the implementation of the agriculture transformation and National Social Investment Programme (NSIP).\nAdvertisementThe Jigawa governor said the Buhari administration had made giant strides towards improving road, rail, aviation and power infrastructure as well as various interventions designed to address social, economic and security challenges in the country.\n“Buhari is honest, transparent and sleeps with Nigerians at heart,” he said."
  },
  {
    "headline": "Overworked staff, mass exits: The inside story of GTBank’s mobile app and USSD transaction failures",
    "summarized_story": "His orange branded Guaranty Trust Bank (GTB) app had not launched as he tried severally to make a transfer from his current account to the empty savings account linked to the debit card on his Uber app.\nI have not been able to access my GT Mobile App for days now.\nJust ask any GTB customer.\nToday, other banks have adopted it and an estimated 40 million Nigerians use USSD services for mobile banking.\nIts mobile app also has over a million downloads on the Google play store alone."
  },
  {
    "headline": "Peter Njonjo wants to change the way food moves in Africa",
    "summarized_story": "Peter Njonjo started his first business in high school.\nHis name is Peter Njonjo and this is his life in tech.\nHe chose to attend the United States International University Africa (USIUA), a private university in Nairobi.\nThree years later, he would be in charge of Coca-Cola’s operations in six countries across East Africa: Kenya, Uganda, Tanzania, Ethiopia, Eritrea, and Mozambique.\nI’m the firstborn of four children.”That is how Peter Njonjo starts his story on our call."
  },
  {
    "headline": "MultiChoice’s bank accounts blocked in Nigeria over alleged ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) on Thursday said it has directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA), in an attempt to recover ₦1.8 trillion in taxes from the companies.\nMultiChoice Group is a South African entertainment giant and owner of the popular DStv and GOtv services.\nParticularly, [MultiChoice Nigeria Limited] has avoided giving the FIRS accurate information on the number of its subscribers and income,” he said.\nAccording to the FIRS chair, Nigeria contributed 34% of total revenue for the group and the bulk of revenue for MultiChoice Africa.\nMultiChoice is the latest South African firm involved in a huge tax scandal in Nigeria."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Smile Identity’s $7m Series A, Safaricom increases cost of airtime, MarketForce’s $2m pre-Series A, Nigeria attempts blocking MultiChoice accounts",
    "summarized_story": "Safaricom increases the cost of airtimeKenyan President, Uhuru Kenyatta, has accepted the Kenyan Parliamentary Committee’s additional taxes proposal.\nKenyan B2B retail platform, MarketForce, has raised $2 million pre-Series A to focus on its business-to-business (B2B) retail marketplace, RajeRaje.\nNigeria to block MultiChoice Nigeria and MultiChoice Africa’s accountsDStv dish.\nYesterday, Thursday, July 8, 2021, Nigeria’s Federal Inland Revenue Service (FIRS) announced that it had directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) and MultiChoice Africa (MCA) in an attempt to recover ₦1.8 trillion in taxes from the companies.\nSo, the banks that handle business for MultiChoice Africa and MultiChoice Nigeria were instructed to perform a balanced search on their accounts before undertaking any other transaction on their behalf."
  },
  {
    "headline": "Nigeria’s tax authority queries Multichoice over possible ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) has directed some commercial banks to freeze and recover ₦1.8 trillion ($4.4 billion) from MultiChoice Nigeria (MCN) and MultiChoice Africa’s accounts.\nThe firms are subsidiaries of South Africa-based MultiChoice Group, which provides television and other entertainment services across Africa like DStv, GOtv, and video-on-demand platform, Showmax.\nIn the statement, FIRS said that it discovered that the companies have persistently breached all agreements and undertakings with the Service.\nIt also added that the group’s performance did not reflect in their tax obligations and compliance level in the country.\nAccording to Reuters, MultiChoice Group makes a third of its business elsewhere on the continent outside South Africa."
  },
  {
    "headline": "Kenyan B2B retail platform, MarketForce, raises $2m pre-Series A to scale its B2B e-commerce marketplace for merchants",
    "summarized_story": "End-to-end retail distribution platform, MarketForce, was founded in 2018 by Tesh Mbaabu and Mesongo Sibuti, Chief Executive Officer (CEO) and Chief Technology Officer (CTO), respectively.\nThese stores also help customers access various forms of financial services such as payments, savings, remittances, and insurance.\nPer TechCrunch, the retail startup got into Y Combinator because they utilise FMCG distribution networks.\nRejaReja model, a B2B e-commerce marketplace for merchants, was launched in 2020 to assist informal retail merchants purchase and sell FMCGs and digital financial services.\nAlthough retail distribution is a core business, the CEO stated that finding the right talent and individuals willing to innovate and revolutionise the space has been an interesting challenge."
  },
  {
    "headline": "No worries about Nigeria’s FX reserves decline",
    "summarized_story": "The persistent decline in Nigeria’s foreign (FX) exchange reserves should not cause much worries as sources of accumulation have been identified.\nData from the Central Bank of Nigeria (CBN) show that gross official reserves declined by $910 million to $33.32 billion in June.\nExternal reserves stood at $33.14 billion as of July 8, 2020, the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "NLNG Board appoints Philip Mshelbila as CEO",
    "summarized_story": "The board of Nigeria LNG (NLNG) has announced the appointment of Philip Mshelbila as the successor of the firm’s current managing director and chief executive officer, Tony Attah.\nMshelbila is currently rounding up his tenure as CEO, Atlantic LNG Company of Trinidad & Tobago.\nHe was previously the general manager of gas for Shell Nigeria and a director of Shell Petroleum Development Co. (SPDC).\nRead Also: Buhari flags off NLNG Train 7 projectHe was also a former regional communications manager for Shell in West Africa and general manager for community relations at Shell Nigeria.\nRonald Adams, who comes from Shell Trinidad and Tobago, will replace Mshelbila at Atlantic LNG."
  },
  {
    "headline": "Why rising oil price fails to boost Nigeria’s foreign reserves",
    "summarized_story": "The recent spat between Saudi Arabia and UAE which pushed oil prices to historic heights is having little or no effects on Nigeria’s external reserves, a development that questions the various Central Bank of Nigeria (CBN) interventions to stabilise the exchange rate.\nIntrinsically, one might think that the recent rally in crude oil prices of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt, FG distribute gadgets, engagement letters to NSIP independent monitors in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Federal Government has distributed engagement letters and monitoring devices to independent monitors to track the success of its National Social Investment Programme (NSIP) in Edo.\nMinister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiiya Farouq distributed the engagement letters and tablets to the beneficiaries in Benin City, the Edo State capital.\nAccording to the Minister, “the application, which we call the Social Investment Management Information System (SIMIS), is a mobile and web-based application designed for monitoring the National Social Investment Programme (NSIP).\n“Using this application, the ministry sees real-time reports of activities of the Independent Monitors on the field.\nIn her contribution, the Focal Person of the Social Investment Programme in Edo, Osayuwamen Aladeselu, urged the monitors to assist the government to achieve its vision of improving the lives of the people in Edo."
  },
  {
    "headline": "Edo Inland Dry Port’ll fast track Nigerian export – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the Edo Inland Dry Port will create a new vista to boost Nigeria’s export.\nThe governor made the submission at the Public-Private Dialogue on Inland Dry Port Operations in Nigeria organised by the Abuja Chamber of Commerce and Industry (ACCI) in partnership with German Development Agency (GIZ) and the European Union (EU).\nThe governor, who was represented by the Managing Director, Edo State Investment Promotion Office, Kelvin Uwaibi, said the inland dry port has now become a multifunctional economic value to the state and the country at large.\nHe noted: “The commencement of the African Continental Free Trade Area has made it expedient for Nigeria to strengthen its inland dry ports for easier access to exporters wanting to export goods out of the country.\n“Edo State is thinking long-term, thus the infrastructural design of the road takes into consideration future activities of the inland dry port”."
  },
  {
    "headline": "Petrol Tanker Crushes 10 School Children To Death In Delta – Nigerian Observer",
    "summarized_story": "Although, as at press time actual number of the dead was not yet certain, but efforts were on to ascertain the number of bodies trapped beneath the tanker which fell down on its side .\nDPO had to order the evacuation of the dead students to nearby mortuary while efforts to salvage the tanker continued as part of an effort to rescue the victims or recover more bodies.\nPolice Public Relations Officer (PPRO) DSP Edafe Bright, said do far the police can only confirmed that six students that died have been taking to mortuary.\nHe however did not rule out the possibility of having more dead bodies trapped under the fallen tanker.\nHe said the police still making efforts to track down the driver of the tanker who ran away immediately the incident occurred."
  },
  {
    "headline": "Edo govt, GIZ SEDIN train over 350 entrepreneurs in Edo South, Central on business digitalization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Skills Development Agency (EdoJobs) and the Edo State Investment Promotion Office (ESIPO), in collaboration with the German Development Office-Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ SEDIN) have completed training for over 350 business owners on digital marketing.\nManaging Director, Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, said the training was held at the Edo Innovates Hub, in Benin City and Uromi.\nShe said similar training will also be organized for business owners in Edo North, noting “The business digitalization programme at Edo South and Central witnessed huge numbers of testimonies from entrepreneurs that participated in the programme.\n“The success stories of beneficiaries from Edo South and Central fast-tracked the need to extend the training to entrepreneurs in Edo North.\nThe training in Edo North targets 50 entrepreneurs.”According to her, “the business digitalization programme is an intensive three (3) days digital marketing training session aimed at enlightening business owners on the importance of acquiring digital skills to boost online presence and improve sales."
  },
  {
    "headline": "AUN honours AfDB President, Akinwumi Adesina, with honorary doctorate as 475 graduate",
    "summarized_story": "The American University of Nigeria (AUN) on Saturday honoured the President of the African Development Bank, Akinwumi Adesina, with an honorary Doctorate of Humane Letters.\nThe university bestowed the honour on Mr Adesina at its 12th joint commencement (graduation) ceremony for its classes of 2020 and 2021.\n“In many ways, he stands for what AUN stands for as Africa’s development university,” Ms Ensign said.\n“We are honoured to honour a truly Nigerian and African hero.”An elated Mr Adesina described the award as an additional responsibility on him to do more for humanity.\nAmong the candidates was Mohammad Nasiru Yakubu, who became the first-ever doctorate degree graduate to be produced by the 17-year old university."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Onyeali-Ikpe’s Seven Point Agenda: Building A Future-Ready Fidelity Bank",
    "summarized_story": "Overview and timelineFidelity Bank’s seven-point agenda focuses on brand architecture, brand building and refresh, talent development and transformation, product and service delivery, agility and performance discipline, digital transformation, and regulatory compliance.\nBrand refresh with the aim to increase top-of-mind awareness of the Fidelity brand by external and internal stakeholders.\nSo far, the commencement of capacity building training for staff and senior management training are some of the initiatives implemented.\nIn line with this, the bank has launched a novel digital service —Pay Yourself —which revolutionized payday for salary earners and SMEs.\nWith this seven pronged agenda, Fidelity Bank is well on its way to leading the sector while revolutionizing Nigeria’s financial landscape."
  },
  {
    "headline": "Muda Yusuf worries about Nigeria’s excess borrowing amid dwindling revenue",
    "summarized_story": "Dr. Muda Yusuf, the immediate past Director-General of the Lagos Chamber of Commerce and Industry (LCCI), has expressed worry about excess borrowing by the Nigeria’s Federal Government in the midst of dwindling revenue.\nOn foreign exchange volatility, the immediate past LCCI boss noted that the foreign exchange market faced liquidity constraints in the first half of 2021, and that forex was inadequate to meet rising demand.\nThe rate premium between the Nigerian Autonomous Foreign Exchange Rate (NAFEX) and the parallel market rate averaged around 20 percent.\n“With the deceleration in inflation rate, monetary policymakers would be further encouraged to keep policy parameters at current levels.\nRelative stability is anticipated in the foreign exchange market as CBN sustains its intervention efforts,” he said."
  },
  {
    "headline": "Igboho: Illegal invasion, arrest of citizens by FG ungodly – Osun cleric",
    "summarized_story": "By Sunday Oguntuyi, OsogboA cleric in Osun State, Evangelist Paul Olusegun Oyeniran, has called on federal government to desist from unwarranted arrest and intimidation of citizens of the country, as according to him, such act is ungodly and inimical to the scripture.\nEvangelist Oyediran who is the General overseer of the Ambassador of Christ Teaching and Evangelical Ministries (ACTEM), stated this while speaking with newsmen at Ode Omu in Ayedaade local government area of the state over the weekend.\nAccording to the man of God, the present administration of President Mohammadu Buhari started well but need to take caution in the area of unwarranted invasion of the citizens which may cause spontaneous reaction from the people in the country.\nOyediran cited invasion of Sunday Igboho at Soka in Ibadan by the men of Department of State Service (DSS), as an example, noting that the action has been generating a lots of reactions.\nOyeniran admonished the government to toe the line of peace and not allow segregation in the country which may occure as a result of its actions."
  },
  {
    "headline": "NLNG Board appoints Philip Mshelbila CEO as Tony Attah ends tenure in August",
    "summarized_story": "The Nigeria LNG Limited (NLNG) board has announced the appointment of Dr. Philip Mshelbila as new Managing Director and Chief Executive Officer to succeed Engr.\nTony Attah.\nAttah who was appointed Chief Executive Officer by the NLNG Board in July 2016, will return to his parent company, Shell, on August 30, 2021, at the expiration of his five-year tenure at the helm of affairs.\nDr. Mshelbila, who is rounding up his tenure as Chief Executive Officer, Atlantic LNG Company of Trinidad & Tobago, will be taking over from Engr.\nAttah on 31st August 2021, the NLNG announced on Friday."
  },
  {
    "headline": "Court Convicts Four Cyber Criminals in Cross River",
    "summarized_story": "By TONY ADAMSThe Economic and Financial Crimes Commission EFCC, Uyo Zonal Office, on Tuesday July 6, 2021 secured the conviction of four internet fraudsters before Justice I. L. Ojukwu of the Federal High Court sitting in Calabar, Cross River state.\nThey were arrested at different locations within Calabar, Cross River state, by operatives of the Commission, following intelligence on their criminal activities.\nBut the defence counsel, A. Cyprian, I. G. Akiki and Innocent O. Eze prayed the court for leniency.\nGodbless Olulu was sentenced to three months imprisonment with the option of Three Hundred Thousand Naira (N300, 000) fine.\nGoodluck Alabo Yebiboh was sentenced to three months imprisonment with option of One Hundred Thousand Naira (N100, 000) fine."
  },
  {
    "headline": "Court Convicts Four Cyber Criminals in Cross River",
    "summarized_story": "By TONY ADAMSThe Economic and Financial Crimes Commission EFCC, Uyo Zonal Office, on Tuesday July 6, 2021 secured the conviction of four internet fraudsters before Justice I. L. Ojukwu of the Federal High Court sitting in Calabar, Cross River state.\nThey were arrested at different locations within Calabar, Cross River state, by operatives of the Commission, following intelligence on their criminal activities.\nBut the defence counsel, A. Cyprian, I. G. Akiki and Innocent O. Eze prayed the court for leniency.\nGodbless Olulu was sentenced to three months imprisonment with the option of Three Hundred Thousand Naira (N300, 000) fine.\nGoodluck Alabo Yebiboh was sentenced to three months imprisonment with option of One Hundred Thousand Naira (N100, 000) fine."
  },
  {
    "headline": "Billie Eilish hints second studio album will be ‘unexpected’",
    "summarized_story": "Billie Eilish says it was “fun” stepping out of her “comfort zone” on her latest single, ‘NDA’.\nThe Grammy-winner released the track from her eagerly-awaited second studio album ‘Happier Than Ever’ this week, and she has admitted the aim was to create something “unexpected” for fans.\nSpeaking to Zane Lowe on Apple Music 1, she said: “I really wanted it to be unexpected, almost.\nI talk through things in therapy that I don’t even think about in my life.\nThat’s really interesting.’“And it’s really helpful, it brings it out of you and it’s really necessary.”Billie went through a lot of “self-reflection” on the new album."
  },
  {
    "headline": "Billie Eilish hints second studio album will be ‘unexpected’",
    "summarized_story": "Billie Eilish says it was “fun” stepping out of her “comfort zone” on her latest single, ‘NDA’.\nThe Grammy-winner released the track from her eagerly-awaited second studio album ‘Happier Than Ever’ this week, and she has admitted the aim was to create something “unexpected” for fans.\nSpeaking to Zane Lowe on Apple Music 1, she said: “I really wanted it to be unexpected, almost.\nI talk through things in therapy that I don’t even think about in my life.\nThat’s really interesting.’“And it’s really helpful, it brings it out of you and it’s really necessary.”Billie went through a lot of “self-reflection” on the new album."
  },
  {
    "headline": "Akinwumi Adesina: Nigerians deserve wealth, not poverty",
    "summarized_story": "President of African Development Bank, Dr Akinwumi Adesina said Nigerians should not be poor with the abundant natural resources that Nigeria is endowed with.\n“Nigerians deserve wealth, not poverty”, he said at a convocation lecture at American University of Nigeria(AUN) in Yola, Adamawa state..“For all the abundant wealth of natural resources, Nigeria’s poverty situation is unacceptable”, Adesina said.\n“There is poverty of health, and yet we know that health is wealth.\n“The COVID-19 pandemic has further revealed the weaknesses of Nigeria’s health care systems.\nFrom diagnostic and testing centers, access to vaccines, and hospital infrastructure, the health care systems were overwhelmed."
  },
  {
    "headline": "Yomi Fabiyi challenges TAMPAN to produce his membership form",
    "summarized_story": "By Kazeem UgbodagaNollywood actor, Yomi Fabiyi has challenged the Theatre Arts and Motion Picture Practitioner Association of Nigerian (​TAMPAN) to produce any form he filled to be member of the organisation.\nFabiyi was suspended indefinitely by TAMPAN over his recent controversial movie, ‘Oko Iyabo.’He has said he was never a member of the organisation.\nIn an Instagram post on Saturday, Fabiyi said he had sent TAMPAN’s letter back to them as he was never their member.\n“OKO IYABO is a good movie and you have no right to review my movie the way your letter did.\n“I will discuss with few elders and members I so much respect in TAMPAN before I take my next step."
  },
  {
    "headline": "ICYMI: Shame on Northern Nigerians",
    "summarized_story": "It is no way to bring up our future leaders.\nStill, northern political leaders, the great men of the moment, cannot be counted on the side of the children and their parents.\nOur political leaders, great winners of paid awards for good governance, must have some problems with the sacred responsibilities of governance.\nPerhaps, the federal and the state governments in northern Nigeria should pause now and give some serious thoughts to their gallant development efforts and re-examine their objectives.\nWhat is the use of building primary and secondary schools and planting universities if the federal and state governments cannot guarantee the safety of the pupils and the students?"
  },
  {
    "headline": "Crush All Bandits Now – Buhari Orders Military",
    "summarized_story": "President Muhammadu Buhari has denounced the repeated attacks and deaths carried out by bandits in Zamfara, Kaduna, and other northern states.\nIn a statement signed by Garba Shehu, the President’s Senior Special Assistant on Media and Publicity, the military was asked to crush the offenders.\nBuhari wants the military to respond to the bandits in a language that the bandits understand.\nHe also avers that the nation, its military and the entire population needs to summon the courage required to defeat the bandits and terrorists.\nRecall that some politicians such as Olusegun Bamgbose had given Buhari seven days to secure the release of the 348 students held hostage by the bandits."
  },
  {
    "headline": "JUST IN: Another Top Politician Dumps PDP For APC",
    "summarized_story": "Mr Hillary Ugochukwu, a chieftain of the Peoples Democratic Party (PDP) in Imo, has defected to the All Progressives Congress (APC).\nUgochukwu, a former senatorial aspirant of the party, announced his defection at a reception organised in his honour by the state leaders of the APC in Owerri on Saturday.\nHope Uzodimma on his achievements in office and expressed willingness to work with him towards taking the state to greater height.\nHope Uzodimma,“ he said.\nSpeaking at the reception in APC secretariat in Owerri, Mr Lemmy Akakem, a chieftain of the party, described Ugochukwu’s choice of working with the state governor as an indication that the administration was one to beat."
  },
  {
    "headline": "Reps Seeks To Overturn The President’s And Governors’ Immunity Clauses.",
    "summarized_story": "The President, Vice President, Governors, and Deputy Governors of Nigeria may lose their immunity from prosecution.\nThe House of Representatives is debating whether or not they should lose their immunity clause.\nA bill that would allow them to face criminal and civil charges will be read for the second time in the Green Chamber soon.\nSubsections 1(a), (b), and (c) apply to people who occupy the offices of president or vice president, governor or deputy governor; (2) and (3).\n“In effect, judicial procedures for persons holding these offices are restricted by this constitutional provision under Subsections 1 and 2, Section 308, CRFN,” Kwewum stated."
  },
  {
    "headline": "This Is First Time Baptist School Pupils Are Abducted In 166 Years — Nigerian Baptist Slams Buhari Government",
    "summarized_story": "The Nigerian Baptist Convention has condemned President Muhammadu Buhari’s government, claiming that this is the first time a Baptist school has been attacked by robbers and kids kidnapped in its 166-year history.\nThe President, Nigerian Baptist Convention, Rev Israel Akanji, said this in an interview with PUNCH on Friday, which he said was the last day of the Baptist World Alliance.\nThe clergy said the 127 countries that make up the Baptist World Alliance were informed of the abduction of students of the Bethel Baptist High School.\nFor 166 years now, the Nigerian Baptist Convention has been providing education.\nThe Baptist Boys High School in Abeokuta, Ogun State, produced Chief Olusegun Obasanjo and the late Chief MKO Abiola."
  },
  {
    "headline": "Breaking: 10-man Raja Casablanca conquer JS Kabylie, lift another CAF Confederation Cup in 4 years",
    "summarized_story": "Raja Casablanca won the Caf Confederation Cup with a 2-1 victory over JS Kabylie on Saturday evening.\nFirst-half goals from Soufiane Rahimi and Ben Malango Ngita were all the Green Eagles needed to emerge as winners inside Cotonou’s Stade de l’Amitie.\nThe Moroccans came into the game with low morale – having failed to win any of their last three games in all competitions.\nDespite profiting from a numerical advantage, JS Kabylie were unable to launch a comeback as they paid for their wastefulness.\nThanks to their triumph, the Moroccans will play either Al Ahly or Kaizer Chiefs in the Caf Super Cup."
  },
  {
    "headline": "Tears, testimonies as Akeredolu, Sanwo-Olu, others attend Prophet T.B Joshua’s final burial",
    "summarized_story": "Ondo state Governor, Rotimi Akeredolu, and his Lagos counterpart Babajide Sanwo-Olu on Friday attended the final burial of the founder of the Synagogue Church of All Nations Prophet T.B Joshua held in Lagos state.\nSanwoolu in his speech said Joshua lived with the common man and played the role of a father to many orphans.\nThe Lagos governor urged others to emulate the late Prophet’s style.\nThe governor said his impact is worldwide saying it explained why a “world congregation” had come to witness his burial.\n“Pastor TB Joshua when I won election within hours drove to Owo my hometown, and something went wrong with his vehicles in Akure."
  },
  {
    "headline": "Gale of defections: Thin hope for PDP as fortunes plummet",
    "summarized_story": "ABDULRAHMAN ZAKARIYAU and BODE OLAGOKE in this report x-ray the party’s National Working Committee (NWC) and the dark clouds over the leading opposition party.\nNot long ago, the senator representing Delta North Federal Constituency, Peter Nwaoboshi, defected from the leading opposition party to the APC.\nIn Cross River state, thousands of PDP members in Abi local government area, which is the constituency of former Governor Liyel Imoke, defected to the APC.\nI have never seen where you have an economic crisis, insecurity crisis, then the ruling party poaching governors.\n“Today, there is a twist in the narration as opposition members of the PDP are moving massively into the fold of the ruling APC."
  },
  {
    "headline": "Why police officers now fight over cases -NigPilot",
    "summarized_story": "My experience with the police has been very bad since they see cases reported to them as opportunities to make wealth from them.\nI thank God for the success made so far, knowing how difficult and expensive it is to get justice in this country.\nThis same issue was reported to the National Human Rights Commission’s office in Abuja, but nothing reasonable was done to ensure that justice is served.\nHuman Rights exist only by name, and so other agencies of government because they are not doing anything reasonable, they collect money from the government.\nIf these agencies of government are working, can people be calling an ordinary person to report cases to him?"
  },
  {
    "headline": "Why police officers now fight over cases -NigPilot",
    "summarized_story": "My experience with the police has been very bad since they see cases reported to them as opportunities to make wealth from them.\nI thank God for the success made so far, knowing how difficult and expensive it is to get justice in this country.\nThis same issue was reported to the National Human Rights Commission’s office in Abuja, but nothing reasonable was done to ensure that justice is served.\nHuman Rights exist only by name, and so other agencies of government because they are not doing anything reasonable, they collect money from the government.\nIf these agencies of government are working, can people be calling an ordinary person to report cases to him?"
  },
  {
    "headline": "Judge denies Britney Spears request to remove father as conservator -NigPilot",
    "summarized_story": "In court filings, Ms. Spears said she wanted private wealth management firm the Bessemer Trust appointed as “sole conservator”.\nEarlier, Mr. Spears, 68, filed court documents of his own, denying he was responsible for the restrictions apparently placed on his daughter’s private life.\nMr. Spears was replaced as conservator of Ms. Spears’s person on a temporary basis by Jodi Montgomery, the singer’s caregiver.\nIn a court filing, lawyers for Mr. Spears said he was “concerned” by Mr. Ingham’s request to make Ms. Montgomery’s position permanent.\nIt said:“Based on her statements to the court, Mr. Spears is concerned that the petition to appoint Jodi Montgomery filed by Ms. Spears’ court-appointed counsel Samuel D Ingham III does not reflect her wishes."
  },
  {
    "headline": "Judge denies Britney Spears request to remove father as conservator -NigPilot",
    "summarized_story": "In court filings, Ms. Spears said she wanted private wealth management firm the Bessemer Trust appointed as “sole conservator”.\nEarlier, Mr. Spears, 68, filed court documents of his own, denying he was responsible for the restrictions apparently placed on his daughter’s private life.\nMr. Spears was replaced as conservator of Ms. Spears’s person on a temporary basis by Jodi Montgomery, the singer’s caregiver.\nIn a court filing, lawyers for Mr. Spears said he was “concerned” by Mr. Ingham’s request to make Ms. Montgomery’s position permanent.\nIt said:“Based on her statements to the court, Mr. Spears is concerned that the petition to appoint Jodi Montgomery filed by Ms. Spears’ court-appointed counsel Samuel D Ingham III does not reflect her wishes."
  },
  {
    "headline": "Iyabo Ojo tenders apology to TAMPAN -NigPilot",
    "summarized_story": "Nollywood actress, Iyabo Ojo has in the latest post, tendered a public apology to the Theater Arts and Motion Picture Producers Association of Nigeria TAMPAN, an association in Nollywood.\nIn her latest statement, via her official Instagram page, Iyabo Ojo wrote; “I would like to say a very big thank you to @esabodofficialpage … God bless you ma, Agba yin a dale … I so much appreciate you, mama, & Love you… First & foremost I want to say a very BIG thank you to my God almighty, all mercifully, I love you Lord & I thank you for your constant protection, provision, and guidance over me & my family.\nI’m forever grateful… I will also want to use this opportunity to say a very BIG thank you to all my darling fans and loved ones for your constant love & support … Honestly, I’m so overwhelmed & humbled, I will never take it for granted.\n“To an able & ever-humble president of Tampan… @mrlatin1510 thank you very much, sir… “Our big daddies @adebayo.salami @princejidekosoko @realyinkaquadri on behalf of @nkechiblessingsunday my darling aburo & my humble self, we apologize to you sir we’re sorry for getting you upset, you’re our elders & leaders, we respect you, we’re humbled before you, we will forever appreciate you & honor you… it’s all Peace & Love.”Recall that TAMPAN, in a statement, had blacklisted Iyabo Ojo and her colleague, Nkechi Blessing, and had threatened to work against them for dragging the name of the association in the mud over issues that had to do with allegations made against actor Baba Ijesha"
  },
  {
    "headline": "Lagos Panel Admits Autopsy Reports Of 99 Corpses Recovered On October 2020",
    "summarized_story": "The Lagos Judicial Panel on Restitution for Victims of SARS and other related abuses has admitted in evidence post mortem results and Compact Discs of all 99 corpses deposited at the Lagos morgue between the 20th and the 27th of October 2020.\nThere was no objection from other parties before the panel.\nEarlier at the June 5 sitting of the panel, the Chairman, Justice Okuwobi had ordered Professor Obafunwa to bring before the panel the post mortem reports conducted on all 99 bodies said to have been picked from different parts of Lagos between the 20th and 27th of Oct, 2020.\nThe Chairman of the panel made the order after the pathologist testified that the coroner’s office conducted post mortem autopsies on 99 bodies during the period.\nHe had also testified that of the 99, only three bodies were labelled as #EndSARS Lekki."
  },
  {
    "headline": "Buhari Demands ‘Crushing Response’ Against Bandits",
    "summarized_story": "President Muhammadu Buhari on Saturday demanded a crushing response against bandits after repeated killings in Zamfara and Kaduna states.\nAt least 35 persons were killed after bandits attacked five communities in Maradun Local Government Area of Zamfara State on Thursday.\nBandits have also continued to terrorise Kaduna state, launching several attacks, including the abduction of 121 students of Bethel Baptist Secondary school in Chikun local government area on Monday.\nAccording to Mr Shehu, the President urged the nation’s military to respond to the “worrying situation” in a language that the bandits understand.\n“He also avers that the nation, its military and the entire population needs to summon the courage required to defeat the bandits and terrorists."
  },
  {
    "headline": "School Abduction: Bandits Demand Foodstuffs From Parents",
    "summarized_story": "Chimezie Enyiocha, KadunaThe abductors of the 121 students of Bethel Baptist Secondary school in Chikun local government area of Kaduna state have demanded for food items from their parents to enable them feed the children.\nThe bandits warned that failure to do so will expose the children to impending starvation.\nThe parents disclosed this on Saturday during their daily prayer sessions to seek for God’s intervention for the release of their children.\nREAD ALSO: Parents Hold Prayers For Release Of ChildrenThey added that the kidnappers are yet to make any demand for ransom.\nThe PDP Governorship candidate in the 2019 election in Kaduna state, Isah Ashiru, who paid a sympathy visit to the school, said the security challenges in the state requires that politics should be set aside for all stakeholders to come together and find how best to tackle the problem."
  },
  {
    "headline": "Over 300 Houses Flooded In Taraba As ‘Cameroon Opens Dam’",
    "summarized_story": "Nwangoro Nnaemeka, JalingoOver 300 buildings have been submerged in a flood that ravaged several communities in Jalingo, the Taraba state capital.\nThey also pointed fingers at the release of water from Labdo dam in Cameroon.\nNo life has been reported lost but residents watched helplessly as business centres, vehicles, worship centres and schools were submerged by the flood.\nRed cross officials have arrived the flooded areas to provide emergency help for affected residents.\nMeanwhile, Chairman of Jalingo local government, Nasiru Boboji, appealed to the Federal Government to collaborate with Cameroon, in order to intimate residents whenever the Labdo dam will be opened to avoid such casualties."
  },
  {
    "headline": "Prime Minister Abiy Hails ‘Historic’ Ethiopia Election After Landslide Win",
    "summarized_story": "But the poll was held in the midst of the gruelling conflict in Tigray region that has battered Abiy’s global reputation and raised fears of widespread famine.\nThe announcement of final results was also later than expected because of delayed counts and complaints by political parties.\nCampaigning was muted even in some areas where voting did take place, with opposition parties complaining of a tilted playing field.\n“A lot of our observers were beaten and chased down by militias of the ruling party,” senior party member Dessalegn Chanie told AFP.\nThe official results showed opposition parties and independent candidates winning a small number of seats."
  },
  {
    "headline": "Bandits abduct Woman, 3 Children in Kaduna",
    "summarized_story": "Bandits suspected to be kidnappers have abducted a woman and her three children in the Milgoma area of Zaria, in Kaduna State.\nThe bandits reportedly stormed the community located opposite the Ahmadu Bello University Teaching Hospital (ABUTH) and took the woman and her three children away.\nThe Police authorities are yet to confirm the incident but eyewitnesses said the bandits came through a village called ‘Nasarawan Buhari’ and later went away with the four victims through another village called ‘Biye’.\nThe woman’s husband, a lecturer at the Federal University Dutsima in Katsina State, was not around when the incident happened.\nBut a source from the community said some members of a local vigilante were able to prevent the bandits from taking away more people."
  },
  {
    "headline": "Former Senator, Grace Bent, Defects to APC from PDP",
    "summarized_story": "Senator Grace Bent, a prominent member of the Peoples Democratic Party (PDP), has formally defected to the All Progressives Congress (APC).\nBent, who represented Adamawa South between 2007 and 2011 under the PDP, said she had had enough of the party during a ceremony where she was received into the APC in Yola on Saturday.\nKogi Governor Yahaya Bello was represented by his deputy, Edward Onoja.\nAdvertisementFormer Senate President, Ken Nnamani, performed the formal ushering in of Grace Bent on behalf of APC caretaker Chairman, Mai Mala Buni.\nNnamani congratulated Bent for choosing a new political life in the APC and assured her of freedom and fair playing ground to pursue her political ambitions under the party."
  },
  {
    "headline": "Ash Barty wins Wimbledon Open beating Pliskova",
    "summarized_story": "Top-ranked Ash Barty won her first Wimbledon title by beating Karolina Pliskova in three sets.\nThe eighth-seeded Pliskova didn’t win a single point in the first three games and then double-faulted on break point to hand Barty a 4-0 lead.\nBarty served for the match at 6-5 in the second set but made several forehand errors to let Pliskova back in the match.\nIt is Barty’s second Grand Slam title.\nAdvertisementIt was Pliskova’s second Grand Slam final."
  },
  {
    "headline": "Biden Vows US Action Over Russian Cyberattacks",
    "summarized_story": "President Joe Biden has told President Vladimir Putin the US will take “any necessary action” to stop cyber-attacks from Russia, the White House says.\nFriday’s call between Mr Putin and Mr Biden follows their meeting last month in Geneva.\nMr Biden said on Friday that the call came as part of a new, “more direct means of communication”.\nThe new connection, Mr Biden said, allows each side to “communicate to one another when each of us thinks something’s happening in the other country.\nThe hacking placed increased pressure on Mr Biden to do something to counter the threats."
  },
  {
    "headline": "‘We Need Help’: Haiti’s Interim Leader Requests US Troops",
    "summarized_story": "Haiti’s interim government said it asked the U.S. to deploy troops to protect key infrastructure as it tries to stabilize the country and prepare the way for elections in the aftermath of President Jovenel Moïse’s assassination.\n“We definitely need assistance and we’ve asked our international partners for help,” Interim Prime Minister Claude Joseph told The Associated Press in a phone interview late Friday.\nOn Friday, a group of lawmakers declared loyalty and recognized Joseph Lambert, the head of Haiti’s dismantled senate, as provisional president in a direct challenge to the interim government’s authority.\n“I’m not interested in a power struggle,” said Joseph, who assumed leadership with the backing of police and the military.\nProsecutors also want to interrogate members of Moïse’s security detail, including the president’s security coordinator, Jean Laguel Civil, and Dimitri Hérard, the head of the General Security Unit of the National Palace."
  },
  {
    "headline": "Nigeria Sets 2022 Deadline for Return of All Looted Benin Bronzes in Germany",
    "summarized_story": "Nigeria’s federal government has set August 2022 deadline for the German government to ensure full return of hundreds of artefacts looted from the Bini Kingdom in 1897.\n”For us, the most important issue in the road map is the signing of the agreement and the date of return.\nWe won’t move forward if we don’t have a clear date on signing and return,” he told participants at the round-table.\nThe minister said Nigerians were eagerly awaiting the return of the 1,130 Benin Bronzes, which are being held by various museums in Germany.\nThe German government is coordinating the return of the Benin Bronzes, which are mostly held by state and private museums."
  },
  {
    "headline": "‘We Won’t Hand Over Our Artefacts’: Oba of Benin Says No To Third Parties Using Benin Bronzes for Financial Gain",
    "summarized_story": "As the nation awaits the return of hundreds of artefacts looted from the Bini Kingdom in 1897 from Germany, the Oba of Benin, Oba Ewuare II, on Friday alleged that some unscrupulous people were moving to hand over the artefacts to unauthorised private entities or third parties and that it would be resisted.\nBut Oba Ewuare II, who addressed a press conference on Friday said he had agreed with the Edo State Governor, Godwin Obaseki to house the artefacts in a palace museum and that the controversy around it was absolutely unnecessary.\nHe said: “I had a discussion with the governor about the need to return them to the palace.\nHe added that the federal government should take custody of the artefacts and not to hand it over to a private company or the state government, until the Benin Royal Palace Museum was built.\nThe Oba of Benin’s press conference was in reaction to a report yesterday by THISDAY that hinted at a possible showdown between him and the Edo State governor on the final destination of the looted artefacts."
  },
  {
    "headline": "Nigeria: Bandits Kill 42 Farmers in Zamfara Governor Matawalle’s Local Government",
    "summarized_story": "Bandits killed 42 farmers on Thursday evening in five communities in Faru, Maradun Local Government Area of Zamfara State.\nHe said: “Yesterday (Thursday) at about 4:30pm bandits armed with sophisticated weapons attacked Faru Village when some of us were still working on our farms.\nThey (bandits) killed 39 people on their farms and injured many others.\n“They (bandits) attacked the village because last Wednesday, Yan’sakai arrested and killed two bandits along Mafara- Faru road who were nabbed with two AK-47 riffles.\nMuhammad Shehu, while confirming the incident, said 35 people lost their lives as a result of the attack by the bandits in the village."
  }
]