[
  {
    "headline": "US CDC investigating case of Monkeypox in traveller from Nigeria",
    "summarized_story": "Lara AdejoroThe United states Centers for Disease Control and Prevention and the Maryland Department of Health and other health partners are investigating a case of monkeypox in a traveller who returned to the United States from Nigeria.\nCDC laboratory scientists confirmed the patient had monkeypox on Tuesday and that the infection matches the strain that has been re-emerging in Nigeria since 2017.\nMonkeypox re-emerged in Nigeria in 2017 after more than 40 years with no reported cases.\nSince 2017, 218 cases have been confirmed in Nigeria and eight cases have been reported in international travellers from Nigeria, including a case in Texas in July 2021 and the current case,” CDC said.\nAccording to the epidemiological report of the viral illness by the Nigeria Centre for Disease, Nigeria has continued to report sporadic cases of monkeypox since 2017."
  },
  {
    "headline": "US CDC investigating case of Monkeypox in traveller from Nigeria",
    "summarized_story": "Lara AdejoroThe United states Centers for Disease Control and Prevention and the Maryland Department of Health and other health partners are investigating a case of monkeypox in a traveller who returned to the United States from Nigeria.\nCDC laboratory scientists confirmed the patient had monkeypox on Tuesday and that the infection matches the strain that has been re-emerging in Nigeria since 2017.\nMonkeypox re-emerged in Nigeria in 2017 after more than 40 years with no reported cases.\nSince 2017, 218 cases have been confirmed in Nigeria and eight cases have been reported in international travellers from Nigeria, including a case in Texas in July 2021 and the current case,” CDC said.\nAccording to the epidemiological report of the viral illness by the Nigeria Centre for Disease, Nigeria has continued to report sporadic cases of monkeypox since 2017."
  },
  {
    "headline": "Expert wants HPV vaccine incorporated into national immunisation scheme",
    "summarized_story": "Amarachi OkehA member of the World Health Organisation Expert Advisory Group for Cervical Cancer Elimination, Dr. Cyril Dim, has urged the Federal Government to incorporate the HPV vaccine into the National Immunisation Scheme.\nHe noted that cervical cancer is the second most common cancer and cause of cancer deaths of women in Nigeria.\nAccording to the WHO, 16 African countries have incorporated the HPV vaccine into their national routine immunization scheme while three countries Rwanda, Ethiopia and Mauritius have reached 80 per ecent coverage of girls aged 15 and above.\nThe HPV vaccine is targeted at girls between the ages of 9 to 14 who are not yet sexually exposed.\nBut, when it becomes part of the National Immunisation Programme, awareness creation will start during antenatal care and continue during immunisation visits."
  },
  {
    "headline": "Expert wants HPV vaccine incorporated into national immunisation scheme",
    "summarized_story": "Amarachi OkehA member of the World Health Organisation Expert Advisory Group for Cervical Cancer Elimination, Dr. Cyril Dim, has urged the Federal Government to incorporate the HPV vaccine into the National Immunisation Scheme.\nHe noted that cervical cancer is the second most common cancer and cause of cancer deaths of women in Nigeria.\nAccording to the WHO, 16 African countries have incorporated the HPV vaccine into their national routine immunization scheme while three countries Rwanda, Ethiopia and Mauritius have reached 80 per ecent coverage of girls aged 15 and above.\nThe HPV vaccine is targeted at girls between the ages of 9 to 14 who are not yet sexually exposed.\nBut, when it becomes part of the National Immunisation Programme, awareness creation will start during antenatal care and continue during immunisation visits."
  },
  {
    "headline": "FG plans 100% growth in crude oil output",
    "summarized_story": "The government also indicated its commitment to the realisation of 40 billion barrels oil reserves, despite missing the December 2020 date for the targeted reserve.\nGbenga Komolafe, said the targets were hindered by some problems, including oil theft, insecurity and aging facilities.\nA more aggressive policy on routine Asset Integrity Management to cub crude leakages and spills caused by aging facilities will be adopted”.\nSpeaking also, a retired Geologist and Energy Consultant, Dr. Kenny Ladipo, stated that a buffer should be in place as a strategy to address the funding challenges facing indigenous oil and gas investors.\nHe stated that major oil and gas assets and resources will be stranded if urgent provisions through funding and incentives are not made available for indigenous players to develop the country’s vast reserves of oil and gas."
  },
  {
    "headline": "ENDSARS protest: Resign or be sacked, Reps minority caucus tell Lai Mohammed",
    "summarized_story": "Recall that Mohammed had said that no one was killed describing the development as a “massacre without bodies”.\nBut relying on the report, the caucus said Mohammed lied, stressing that other officials of the government also have many questions to answer.\n“The report of the Lagos panel shows that no matter how lies and falsehood try to prevail, the truth will always triumph at the end.\n“The Minority caucus therefore calls on the APC-led administration to come clean on the killings as well as the furtive moves to cover up the vicious act.\nAlso, giving the findings of the Lagos panel, the Minister of Information and Culture, Alhaji Lai Mohammed is expected to resign immediately or be fired by President Muhammadu Buhari."
  },
  {
    "headline": "No longer army of anything goes – Femi Adesina",
    "summarized_story": "What Babangida started was consummated by Sani Abacha, and Olusegun Obasanjo, two other Generals of the Nigerian Army.\nThe Nigerian Navy and Air Force would have their days, but let us focus on the Nigerian Army today.\nThe result today is that the Nigerian Army has never been better positioned to discharge its duties.\nHe said: “The armed forces of Nigeria is a professional armed forces, we are peopled by Nigerians, and remain committed to constitutional mandates.\nIt’s “an army of anything goes.” True."
  },
  {
    "headline": "National Housing Programme: 7, 315 applications received within 6 days — Fashola",
    "summarized_story": "Babatunde Fashola*** As 20 States yet to key into programmeBy Henry UmoruMINISTER of Works and Housing, Babatunde Fashola, SAN told the Senate Thursday that a total of 7, 315 applications from prospective House owners have been received within six days after the launch of the National Housing Programme.\nFashola said, ”The applications received so far from prospective House owners are about 2, 315 higher than the available 5,000 housing units available for now.\n” This is even as applications have not been received from Nigerian workers in about 20 States “According to him, the current National Housing Programme is a pilot or demonstration scheme meant, among others, to galvanize private sector participation.\nOn Housing Housing deficit, Fashola who told the Commitee that solution to it is not just on building of houses but marketing the empty ones, said that the National Housing Programme had not succeeded in the past and some of the houses built then still remain emptyy!\ndue to cultural or financial factors."
  },
  {
    "headline": "Farmers in Enugu say anti-open grazing law has no impact",
    "summarized_story": "Chairman of the Enugu State chapter of All Farmers Association of Nigeria (AFAN), Mr Romanus Eze, on Thursday decried the continued destruction of crops in the state by herders.\nEze told the News Agency of Nigeria (NAN) in Enugu that farmers were yet to feel the impact of the anti-open grazing law signed by Gov.\nUgwuanyi signed the Prohibition of Open Grazing and Cattle Ranching Law of Enugu State following the decision by governors of the 17 states in the south of Nigeria in May to ban open grazing in their states.\n“Herders are destroying most of the farms in Enugu State, especially those in large clusters inside the bush.\nThe AFAN chairman noted that several written complaints to forest guards, the Department of State Services and the Enugu State Commissioner of Police yielded no result."
  },
  {
    "headline": "Ogun Speaker, lawmakers visit ex-Gov Segun Osoba after surgery in UK",
    "summarized_story": "Ogun State House of Assembly Speaker, Olakunle Oluomo visited former Governor Segun Osoba on Thursday.\nThe All Progressives Congress (APC) chieftain is recuperating in the United Kingdom after a knee surgery.\nAdeyemi Ademuyiwa (Abeokuta South 2), Musefiu Lamidi (Ado-Odo-Ota 2) and Yusuf Adejojo (Abeokuta South 1) were other lawmakers on the delegation.\nOluomo expressed optimism that Baba Osoba, as fondly called, would return to Nigeria soon.\nUnlike ex-Lagos Governor, Bola Tinubu, who underwent surgery and hosted scores of well-wishers, Osoba has received only a few."
  },
  {
    "headline": "We will tackle soot in Rivers – FG",
    "summarized_story": "The Federal Government has promised to take decisive action against the ravaging soot in Rivers State.\nThe Minister of States for Petroleum Resources, Timipre Sylva, made the promise on Thursday while delivering his speech at the 6th National Council on Hydrocarbon held in Port Harcourt.\nThe minister, who was represented at the event by the Permanent Secretary at the Federal Ministry of Petroleum Resources Nasir Gwazor, said he was deeply concerned about the soot, adding that his ministry will work with the federal ministry of environment to tackle the issue.\n“My good people of Port Harcourt, the soot is unacceptable.\nAt the end of the summit, 38 memoranda from various groups and agencies were approved by the council for onward consideration and possible action."
  },
  {
    "headline": "Legalization of cannabis will take Nigeria to dark days – NDLEA",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday said legalization of consumption of cannabis will take Nigeria back to it’s dark days.\nBut Marwa said that legalising cannabis would truncate its ongoing fight against drug abuse, stressing that such a move would also take Nigeria back to its dark days.\nHe revealed that 10.6 Nigerians were currently consuming cannabis, adding that legalising it would further destroy the nation.\n“NDLEA will not accept that; we in NDLEA reject the move in totality,” he noted.\nThe NDLEA boss admonished security agencies and other stakeholders to support the agency in its bid to curb the tide of drug abuse in the nation"
  },
  {
    "headline": "Ogun: Gov Abiodun appoints new Attorney General",
    "summarized_story": "Governor Dapo Abiodun of Ogun State Governor has nominated Oluwasina Olanrewaju Ogungbade as the State’s new Attorney General and Commissioner for Justice in the State.\nOgungbade’s appointment followed the resignation of Akingbolahan Adeniran as the State’s Attorney General.\nAdeniran had said he resigned his appointment from Abiodun’s cabinet based on personal reasons, debunking allegations of massive corruption in the present government.\nSomorin said the newly nominated Attorney General is currently a Deputy Managing Partner at Afe Babalola and Co and comes with vast litigation, advocacy and commercial law experience garnered over two decades with leading law firms like GOK Ajayi & Co and Ebun Adegboruwa & Co, among others.\n“The Commissioner Designate will soon appear before the State House of Assembly for the statutory screening and confirmation,” the statement concluded."
  },
  {
    "headline": "FCT Minister meets teachers as union begins strike over security",
    "summarized_story": "The Federal Capital Territory, FCT Minister, Malam Muhammad Musa Bello on Thursday, met with the Nigeria Union of Teachers, Abuja chapter over the five days warning strike embarked upon by the union.\nDAILY POST reports that the union on Thursday, began the warning strike to demand better security in schools across the territory and payment of arrears of promotion benefits for teachers.\nThe security heads assured the union that they are ready to improve the security situation in all schools in the nation’s capital.\nThe NUT Chairman assured the Minister that the union would return to class without waste of time following the fruitful meeting.\nHe also pleaded with the FCT Minister to intervene in the payment of arrears of LEA teachers under the administration of the Area Councils."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "VIDEO: Pandemonium as petrol tanker explodes in Ibadan",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "UPDATED: Pandemonium as petrol tanker explodes in Ibadan",
    "summarized_story": "A petrol-laden tanker has exploded along NTA operation burst road before UCH area of Ibadan in Oyo State.\n- Advertisement -It said: “There’s a gas explosion around NTA operation burst road before UCH, Ibadan.\nThree feared injured in Lagos-Ibadan gas explosion – https://thenationonlineng.net/breaking-three-feared-injured-in-lagos-ibadan-gas-explosion/ – Three men were reportedly injured in a gas tanker explosion on KM 38 of the Lagos-Ibadan expressway.\nThe fire was said to involve a Liquefied Petroleum gas tanker moving towards Sagamu Interchange on the outward Lagos section of the expressway.\nThe explosion caused villagers in Ebekpi and other surrounding communities to scamper following the gas leakage, which occurred for over five hours."
  },
  {
    "headline": "CBN: Why eNaira, other interventions are important",
    "summarized_story": "The Central Bank Digital Currency (CBDC), otherwise known as eNaira, initiated by the Central Bank of Nigeria (CBN), will enhance multi-layered security encryption of the digital currency.\nReporters, who attended the ” Master Class” with the theme: Central Bank of Nigeria interventions as fulcrum for economic diversification,” lauded the interventions.\n- Advertisement -CBN interventions span healthcare, agriculture, creative industry, infrastructure and other aspects of human endeavour.\nNwanisobi who traced the evolution of interventions by the CBN from 1979, said the global financial crisis of 2008/2009 threw up multiple interventions by the CBN which also reflected the responses in other countries.\nHe argued that but for the CBN interventions, the economy would not have grown post-global crisis era."
  },
  {
    "headline": "Sokoto killings: Death toll hits 43",
    "summarized_story": "From Rose Ejembi, MakurdiGovernor of Sokoto, Aminu Tambuwal, has confirmed the killing of 43 persons in an attack on Illela Local Government Area (LGA) of the State.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe bandits attacked the town and some villages around it, on Monday, killing 13 people in the first instance.\n“At the time of the governor’s visit, on Wednesday, the death toll had risen to 43,’’ he saidBello said the village head of Kalmalo, one of the five villages affected in the attack, was wounded.\nMeanwhile, Benue State Governor, Samuel Ortom, yesterday, condoled with Tambuwal, the government and people of Sokoto state over the massacre of 43 people in Goronyo and Illela LGA, on Sunday and Monday, by bandits terrorising the country."
  },
  {
    "headline": "Reps okay bill to free CCT from executive control",
    "summarized_story": "From Ndubuisi Orji, AbujaHouse of Representatives, yesterday, passed for second reading a bill seeking to remove the Code of Conduct Tribunal (CCT) from the control of the executive arm of government.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nBob, in his lead debate, said the CCT is a judicial body, with the responsibility of trying offences under the Code of Conduct Bureau (CCB) and should not be under the control of the executive arm of government.\n“The CCT – the focal point of this Bill – is undoubtedly a judicial body created by paragraph 15 of the 5th schedule to the constitution and section 20 of CCB and Tribunal Act.\nIt is a statutory body saddled with the responsibility of trying offences under the CCB Act,” the lawmaker said."
  },
  {
    "headline": "65 Nigerian monuments qualify for world heritage sites –NCMM",
    "summarized_story": "The National Commission for Museums and Monuments (NCMM) says not less than 65 monuments across the country are qualified to be listed as UNESCO World Heritage sites.\n“We have a number of heritage sites that we want to propose for enlistment into the world heritage sites.\nAs you know, the process of enlistment into the world heritage site is cumbersome and requires financial wherewithal.\nTijani said Nigeria had only two UNESCO enlisted world heritage sites at the moment – the Osun Osogbo Cultural groove in Osun and the Sukur Cultural Landscape in Adamawa.\nHe said efforts were being made by Nigeria in getting the cultural heritage that were stolen from the country."
  },
  {
    "headline": "Removal from religious freedom blacklist excites FG",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government has commended the United States for removing Nigeria from its list of countries with religious freedom concerns.\nMinister of Information and Culture, Alhaji Lai Mohammed, in a statement said the decision was fair and just.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMohammed who is in Paris, France, for the 41st UNESCO General Conference, reiterated his position that Nigeria did not engage in religious freedom violation nor had a policy of religious persecution.\nMohammed said Nigeria jealously protected religious freedom as enshrined in the constitution and took seriously, any infringements in that regard."
  },
  {
    "headline": "Buhari finally speaks on #EndSARS Panel Report",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has finally spoken on ENDSARS report, where the Lagos panel in its findings said security operatives “killed unarmed protesters” who had gathered at the Lekki tollgate.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“We at the Federal have to wait for the steps taken by the states, and we have to allow the system to work.\n“It’s helping us to stabilize the situation in the Northeast, and we’ve made a lot of progress since 2015,” he said.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Buhari Meets Blinken, Says FG Awaits EndSARS Probe Panel Reports from States",
    "summarized_story": "*Thanks US for removing Nigeria from religious freedom watchlist*Insists no one is discriminated against on the basis of faithPresident Muhammadu Buhari Thursday met with the United States Secretary of State, Mr Antony Blinken, at the State House Abuja.\nDuring the meeting with the American top official, Buhari said the Federal Government awaita pronouncements from state governments which set up panels to probe police brutality in the country.\n“It’s helping us to stabilize the situation in the Northeast, and we’ve made a lot of progress since 2015,” he said.\n“We are doing a lot on security, and the people involved appreciate our efforts.”On development of democratic ethos, President Buhari said Nigeria had adopted the American model, “hook, line, and sinker, with its term limits.\n“That is why the youths defy the Sahara Desert and the Mediterranean to attempt emigrating to Europe."
  },
  {
    "headline": "Bandits Kill 213, Kidnap 676 Persons in Four Months in Katsina",
    "summarized_story": "Francis Sardauna in KatsinaThe Katsina State Government on Thursday, said bandits have killed 213 persons and kidnapped 676 others across the frontline local government areas of the state between July and October 2021.\nThe government added that 724 suspected bandits and other criminals terrorising communities in the state were arrested by security agencies within the period under review.\nThe Secretary to the State Government, Dr. Mustapha Inuwa, stated this while briefing journalists on the progress of the security challenges containment orders recently signed by Governor Aminu Bello Masari to tackle banditry in the state.\nHe further explained that 296 suspects were under prosecution and 75 others were under investigation by different security agencies in the state.\n“For instance, for the period of July/August 2021, there were a total of 173 reported kidnap incidents affecting 475 persons; whereas for September/October 2021, 61 kidnap incidents occurred with 201 victims."
  },
  {
    "headline": "GDP Slows to 4.03% in Q3",
    "summarized_story": "James Emejo in AbujaNigeria’s Gross Domestic Product (GDP) growth rate slowed to 4.03 per cent in the third quarter of the year (Q3 2021) compared to 5.\n01 per cent in the preceding quarter, the National Bureau of Statistics (NBS) said Thursday.\nThe GDP measures the country’s economic performance from time to time.\nStatistician General/Chief Executive, National Bureau of Statistics,Dr. Simon Harry, at a media briefing said the negative impact of the COVID-19 pandemic continued to impact economic performance.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Kyari: Financing Major Impediment to Success of Global Energy Transition",
    "summarized_story": "Emmanuel AddehThe Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari, yesterday said getting appropriate financing for major projects remains key challenge in the global transition to renewable sources of energy.\n“I think the key challenge of the energy transition is financing what we need to do today, to produce gas and consume gas in the best possible manner and you can’t produce hydrogen without properly doing it.\nThe key challenges is financing and also realising that different countries have different circumstances, that jurisdictions are different and that we can’t move at the same pace,” he stated.\nHe urged proponents of the energy transition to appreciate the basic fact that the circumstances of every nation is peculiar and take it into consideration.\nOn the application of technology in the transition process, he added: “Artificial intelligence is the way to go in the future."
  },
  {
    "headline": "Buhari Sends Delegation to Sani Dangote’s Burial, Says Late Entrepreneur was Honest in Business, Exemplary",
    "summarized_story": "Buhari had earlier commiserated with the Dangote family in Kano on the demise of Sani.\nKano State Governor Abdullaahi Umar Ganduje also received the delegation and thanked the president for sending such a powerful delegation to the burial.\nIn his condolence message, Ganduje said, “We received the information about the passing away of this gentleman, Alhaji Sani Dangote, with shock.\nKano State, our dear country, Nigeria, and the business community have lost an illustrious son.\n“But to all of us, particularly those from Kano State, we lost a rare gem in the business community."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Embassy In Ireland Extorts Over N47,000 From Each Passport Applicant For Staff Members To Share",
    "summarized_story": "The Nigerian Embassy in Dublin, Ireland is collecting illegal €100 (approximately N47,000) postal orders from Nigerians applying for passports which are shared and monetised by staff members for personal gains, SaharaReporters has learnt.\nIf you bring a postal order addressed to the Nigerian Embassy, they will reject it.\n\"They are not giving people their passports except they bring blank postal orders which they will go claim.\n\"They gave express warning that it should not be addressed to the Nigerian Embassy but should be left blank,” one of the sources said.\n“The passport fast-track services are only on Thursdays and Fridays from 10.00am to 1.00pm.”"
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Embassy In Ireland Extorts Over N47,000 From Each Passport Applicant For Staff Members To Share",
    "summarized_story": "The Nigerian Embassy in Dublin, Ireland is collecting illegal €100 (approximately N47,000) postal orders from Nigerians applying for passports which are shared and monetised by staff members for personal gains, SaharaReporters has learnt.\nIf you bring a postal order addressed to the Nigerian Embassy, they will reject it.\n\"They are not giving people their passports except they bring blank postal orders which they will go claim.\n\"They gave express warning that it should not be addressed to the Nigerian Embassy but should be left blank,” one of the sources said.\n“The passport fast-track services are only on Thursdays and Fridays from 10.00am to 1.00pm.”"
  },
  {
    "headline": "'Each gets N18.2bn, two-year moratorium' -- FG explains N656bn fresh loan for states",
    "summarized_story": "The federal government has approved N656 billion as fresh loan for the 36 states of the country.\nIn a statement issued by Laolu Akande, spokesperson to the vice-president, the loan is to support states and will be released in six tranches over a six-month period.\n“In a bid to help state governments meet financial obligations, especially the previous budget support facility due for repayment, President Muhammadu Buhari has approved a fresh N656billion Bridge Financing Facility to the 36 States.\n“The approved Bridge facility of N656.112billion will be disbursed in six tranches over a period of six months to the States.\nAdvertisementIn July , the Central Bank of Nigeria (CBN) and state governors agreed to start deductions of the budget support facility."
  },
  {
    "headline": "'Each gets N18.2bn, two-year moratorium' -- FG explains N656bn fresh loan for states",
    "summarized_story": "The federal government has approved N656 billion as fresh loan for the 36 states of the country.\nIn a statement issued by Laolu Akande, spokesperson to the vice-president, the loan is to support states and will be released in six tranches over a six-month period.\n“In a bid to help state governments meet financial obligations, especially the previous budget support facility due for repayment, President Muhammadu Buhari has approved a fresh N656billion Bridge Financing Facility to the 36 States.\n“The approved Bridge facility of N656.112billion will be disbursed in six tranches over a period of six months to the States.\nAdvertisementIn July , the Central Bank of Nigeria (CBN) and state governors agreed to start deductions of the budget support facility."
  },
  {
    "headline": "NYSC won’t be scrapped, says DG",
    "summarized_story": "Shuaibu Ibrahim, director-general of the National Youth Service Corps (NYSC), has played down concerns in some quarters that the scheme could be scrapped.\nIn the past few months, however, arguments over whether to do away with the scheme or not have intensified among Nigerians.\nBut speaking in Abuja on Thursday, the NYSC DG dismissed fears that the scheme risks being scrapped.\nIbrahim said the NYSC is crucial in the course of building a united country.\nAdvertisement“I heard there are efforts for the scrapping of the NYSC scheme."
  },
  {
    "headline": "NYSC won’t be scrapped, says DG",
    "summarized_story": "Shuaibu Ibrahim, director-general of the National Youth Service Corps (NYSC), has played down concerns in some quarters that the scheme could be scrapped.\nIn the past few months, however, arguments over whether to do away with the scheme or not have intensified among Nigerians.\nBut speaking in Abuja on Thursday, the NYSC DG dismissed fears that the scheme risks being scrapped.\nIbrahim said the NYSC is crucial in the course of building a united country.\nAdvertisement“I heard there are efforts for the scrapping of the NYSC scheme."
  },
  {
    "headline": "Despite FG’s efforts, Emirates Airline extends flights suspension till Nov 30",
    "summarized_story": "Emirates Airline says it has suspended the resumption of flight operations between the United Arab Emirates (UAE) and Nigeria to November 30.\nAdvertisementThis is despite the efforts of the federal government to resolve differences with Emirates Airline over COVID-19 guidelines.\nIn February, Emirates had suspended flights into Nigeria after the Nigerian government debarred the airline for conducting rapid Covid-19 tests before departure for travellers flying inbound UAE at the Lagos and Abuja airports.\nAdvertisementThe ban was briefly lifted after the airline agreed to discontinue the rapid antigen tests for Nigerian travellers.\n“Customers who have been to or connected through Nigeria in the last 14 days will not be permitted on any Emirates flights bound for Dubai,” Emirates said."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Early Access: Interview with Mr Eazi; artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\n“I think Mr Eazi is a laid back musician.\nThe Nigeria-born musician later relocated to Ghana for his undergraduate studies before starting his music career in London.\nHe believes Africa is experiencing its best years in the global music industry, with many of its music genres being embraced globally.\nMotivation and obsessionOluwatosin Ajibade (Mr Eazi)."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "The Kredi Money story, Ozow’s $48m Series B, and blockchain skills with Bitmama",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:The Kredi Money storyOzow’s $48m Series BGetting blockchain skills with BitmamaThe Kredi Money storyKredi Money Co-founders, Afolabi Abimbola and Samuel OrjiFintech remains one of the biggest movers in Nigeria’s startup ecosystem.\nAdvertisementAnother fintech startup, Kredi Money, has joined the Nigerian fintech space combining several fintech offerings into one.\nEmmanuel Paul has that answer and more here: Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services.\nOzow’s $48m Series BThomas Pays, CEO and Co-Founder of OzowSouth African fintech startup, Ozow has closed a $48 million Series B to ease online payments for South Africans.\n: According to 101 Blockchains, the need for blockchain talent is fueled by the advantages of blockchain, such as security, transparency, and traceability."
  },
  {
    "headline": "Mo Abudu’s business becomes Harvard case study",
    "summarized_story": "For the first time in history, a case study about a female African media entrepreneur titled: ‘The Harvard Business School – EbonyLife Case Study,’ will be taught at Harvard Business School (HBS) to over 1,000 MBA students.\nCase study A chronicles the journey of EbonyLife Media from inception to December 2020, while case study B provides a summary of what has occurred between January and October 2021.\nHaving read case study A, the students will have to consider the choices told in the HBS case study abstract and give their analysis.\nShe oversees the EbonyLife Group, which includes all EbonyLife Media assets and EbonyLife Place, Nigeria’s first luxury entertainment resort.\nShe has spoken at the Wharton School of Business, Cambridge University Judge School of Business, NYU, Oxford University and Harvard University."
  },
  {
    "headline": "Reps move to remove Code of Conduct Tribunal from executive control",
    "summarized_story": "The House of Representatives on Thursday took steps to remove the Code of Conduct Tribunal (CCT) from the control of the executive arm of the Nigerian Government and domicile it in the Judiciary – an independent arm of the Government.\n“The Code of Conduct Tribunal – the focal point of this Bill – is undoubtedly a judicial body created by paragraph 15 of the 5th schedule to the constitution and section 20 of the Code of Conduct Bureau and Tribunal Act.\nIt is a statutory body saddled with the responsibility of trying offences under the Code of Conduct Bureau Act.\n“Furthermore, the offices of the chairman and members of the Code of Conduct Tribunal are clearly omitted in the judicial oath contained in the 7th schedule to the constitution.\n“Honourable Colleagues, under a presidential democracy, one single arm of government ought not exercise executive and judicial powers such as is the case presently."
  },
  {
    "headline": "Aba-bound shoe materials, spare parts stuck in Onne Port",
    "summarized_story": "According to port users, imported containers now dwell for an average of 35 days at Onne Port due to the inefficiency of the Nigeria Customs Service (NCS) and other government agencies involved in cargo clearing.\nI know of many footwear industries that bring in their raw materials from Onne Port,” Tony Anakebe, managing director of Gold-Link Investment, a clearing and forwarding company, said in an interview with BusinessDay.\nRead also: Stakeholders seek end to extortion, harassment on Nigeria roadsAccording to Anakebe, all the Eastern markets including Onitsha Main Market, Ariaria International Market, and Nkwo Nnewi depend on Onne Port to bring in their goods.\nAnakebe, who noted that the major problem in Onne Port was the bad state of the access road, which has become a thorn in the flesh for port users, said there were other bottlenecks to the timely delivery of goods at the port.\nNoah Sheriff, commercial manager of the West African Container Terminal (WACT), told newsmen at the Onne Port in Rivers State recently that the 35-day long dwell time for containers was hampering efficiency at the Onne Port."
  },
  {
    "headline": "FG train, empowers 227 persons in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – No fewer than 227 persons in Orhionmwon/Uhunmwode federal constituency in Edo state have benefited from a 3-day empowerment training organized by National Productivity Centre (NPC).\nThe training programme which was facilitated by the member representing the constituency at the House of Representatives, Hon Patrick Aisowieren held simultaneously at Abudu and Eyaen communities from Tuesday 16th to Thursday 18th 2021.\nThe participants who were drawn from across the various wards in the federal constituency were trained in liquid soap, bleach, perfume making and catering.\nThe participants who were later awarded certificates, starter packs and N50,000 each expressed appreciation to the facilitator of the training.\n“I learnt a lot; when i get back home i should be able to put into practice all I’ve learnt”, a participant from Orogho community in Ugu ward, Osariemen Courage told The Nigerian OBSERVER."
  },
  {
    "headline": "Edo govt restates commitment to workers’ welfare, transformation of civil, public service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has reaffirmed its commitment to the transformation of the state’s civil and public service, ensuring that every worker is adequately equipped to function optimally and deliver quality service to Edo people.\nThe Edo State Head of Service, Anthony Okungbowa Esq.\ngave the assurance when he received the executives and members of the Senior Staff Association of Civil Servants, who were on a courtesy visit to his office at the Government House in Benin City.\nOkungbowa explained that working with unions to make sure public and civil servants abide by the work ethics is very crucial in moving the state forward.\nHe further charged the visiting union on the need to collaborate and support the Governor in the reformation of the state’s civil and public service."
  },
  {
    "headline": "Obaseki swears-in 73 new appointees, urges diligence – Nigerian Observer",
    "summarized_story": "The appointees include Princess Mrs. Philomena Ihenyen who was appointed Political Adviser (Edo Central) as well as 21 Senior Special Assistants (SSAs) and 51 Special Assistants (SAs).\nThe structure is that Special Assistants must report to my office weekly through your Senior Special Assistants to give me an update on your activities from the constituencies and wards that you serve.\n“One of the Senior Special Assistants each shall be assigned to work with security agencies such as the Police, State Security Services and Civil Defence.\nThe appointees include Princess Mrs. Philomena Ihenyen who was appointed Political Adviser (Edo Central) as well as 21 Senior Special Assistants (SSAs) and 51 Special Assistants (SAs).\n“One of the Senior Special Assistants each shall be assigned to work with security agencies such as the Police, State Security Services and Civil Defence."
  },
  {
    "headline": "Alaghodaro 2021: Obaseki committed to ending poverty, achieving sustainable economic growth – Alufohai – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Focal Person of the Edo State Sustainable Development Goals (SDGs) Office, Mrs. Eire Ifueko Alufohai, has said the just concluded Alaghodaro 2021 has strengthened the efforts of the Governor Godwin Obaseki-led administration at ending poverty and achieving sustainable economic growth and development for the state.\nSpeaking to journalists at the Edo State SDGs office in Benin City, Alufohai said Governor Obaseki remains committed to achieving the Sustainable Development Goals One and Eight, which are ‘No Poverty’ and ‘Decent Work and Economic Growth’ respectively.\nAll these efforts are to make life better for citizens of the state.”She continued, “It is important to mention that the International poverty line currently is at $1.90 a day.\nThis line helps measure the number of people living in extreme poverty and helps compare poverty levels between countries.\n“Also understand that economic growth is the economic prosperity of a nation and its people, but for economic prosperity to happen there must be economic productivity."
  },
  {
    "headline": "Buhari approves N656bn fresh ‘budget support’ facility for states",
    "summarized_story": "The National Economic Council (NEC) says President Muhammadu Buhari has approved a fresh N656 billion Bridge Financing Facility for the 36 states.\nThe minister said the support was to help state governments to meet their financial obligations, especially the previous budget support facility due for repayment.\nShe said that the bridge facility was being processed by the Central Bank of Nigeria (CBN).\n“The approved bridge facility of N656.112 billion will be disbursed in six tranches over a period of six months to the states.\nOn July 15, the council had received updates on the budget support facility to states."
  },
  {
    "headline": "Buhari signs Climate Change, AMCON Bills into law",
    "summarized_story": "President Muhammadu Buhari has signed Climate Change and Asset Management Corporation of Nigeria (Amendment) bills passed by the National Assembly into law.\nThe Climate Change bill, sponsored by a member of the House of Representatives, Sam Onuigbo, provides for the mainstreaming of climate change actions and the establishment of a National Council on Climate Change.\nThe bill also paves the way for environmental and economic accounting and a push for a net-zero emission deadline plan in the country.\nThe Asset Management Corporation of Nigeria (Amendment) Act, on the other hand, amends the AMCON Act No.4, 2010.\nIt provides for the extension of the tenor of the Resolution Cost Fund and grants access to the Special Tribunal established by the Banks and other Financial Institutions Act 2020, which confers on the corporation the power “to take possession, manage, foreclose or sell, transfer, assign or otherwise deal with the asset or property used as security for eligible bank assets and related matters.’’The act will assist AMCON to make recoveries and for debtors to fulfil their commitments to banks."
  },
  {
    "headline": "Gunmen disrupt meeting of APC caucus loyal to Aregbesola in Osun",
    "summarized_story": "He wondered why the governor’s camp would be after the lives of fellow party members because of their assiduous efforts at revitalising the party in the state.\nThe former APC Chairman stated: “The thugs believed to have been sent by the Governor Adegboyega Oyetola’s led IleriOluwa faction of the party invaded the weekly meeting of TOP around 2:10pm today.\nWhy will the government be using thugs to attack members of the same party openly in the afternoon?\n“Two days ago, they attacked some of our members in Ipetumodu, Ife North Local Government during their meeting.\nWe call on President Muhammadu Buhari and the Inspector General of Police to come and see what is happening in Osun.”"
  },
  {
    "headline": "I had good relationship with GTBank when Tayo Aderinokun was CEO – Innoson",
    "summarized_story": "OBINNA EZUGWUFounder of Innoson Vehicle Manufacturing (IVM), Innocent Chukwuma, has said he had a very cordial relationship with Guaranty Trust Bank when the late Olutayo Aderinokun, was the Managing Director, but his successor started fighting him.\n“I was GTBANK’s best customer in the south-east when Tayo, the former MD, was alive.\nI am not certain about this but I think the reason he (GTB) is fighting is because of tribe.\nSo, I am waiting for the interest to be above their capacity so I can take over,” Chukuma said.\nI am assuring all the customers of GTB that if I take over, I would still run it well."
  },
  {
    "headline": "Buhari tells US govt he will wait for states to submit reports of EndSARS panels before taking decisions",
    "summarized_story": "The President spoke Thursday at State House, Abuja, while receiving in audience Mr Antony Blinken, United States Secretary of State, a statement from his media aide, Femi Adesina, said.\n“So many state governments are involved, and have given different terms of reference to the probe panels.\nWe at the Federal have to wait for the steps taken by the states, and we have to allow the system to work.\nFederal Government has to wait for the reaction of the states,” the statement quoted Buhari to have said.\n“We are doing a lot on security, and the people involved appreciate our efforts.”On development of democratic ethos, President Buhari said Nigeria has adopted the American model, “hook."
  },
  {
    "headline": "Why Federal Govt Should Declare Bandits As Terrorists – Cleric",
    "summarized_story": "The President and General Overseer of the United Apostolic Church of Christ, Dr James Bayo Owoyemi, has asked President Muhammadu Buhari to declare bandits terrorising the northern part of the country as terrorists.\nOwoyemi said any organisation responsible for the killing of innocent people and displacing millions of Nigerians is terrorist group, even if the Federal Government has not declared them as such.\nSpeaking in Akure, the Ondo State capital at the annual convention of the church, the cleric said the duty of the government at all levels is to protect its citizens.\nAccording to him, if some people are making that job difficult, the government should not fail to invoke the law to punish the offenders.\nPointedly, he said Christian leaders would not allow the association to be politicised."
  },
  {
    "headline": "Zenith Bank/Delta Headmaster Cup: Valley Stream British School Emerges Champions",
    "summarized_story": "Valley Stream British School Sapele on Thursday emerged Champions of the 2021 edition of the Delta Headmasters’ Cup football competition sponsored by Zenith Bank.In a highly contested game played at the Stephen Keshi Stadium, Asaba on Thursday, Valley Stream defeated Ogbe Primary School, Effurun 2-1The official kickoff of the final game was taken by Delta State Governor His Excellency Senator Ifeanyi Okowa.\nThe fourth place team was also compensated with N300.000.\nDestiny Primary School Ughelli was third while Royal Foundation School was fourth.\n“As a responsible corporate citizen, giving back to the communities where we carry out business is an integral part of our overall strategy.\nSo I congratulate the Valley Stream British School for winning this prestigious trophy.”In the third place match, Destiny Group of Schools Ughelli defeated Royal Foundation School Ogwa Shi Uku, on penalties after the game ended 1-1."
  },
  {
    "headline": "HDAN Hails Senate On Passage of Real Estate Regulatory Bill",
    "summarized_story": "An advocacy group, Housing Development Advocacy Network (HDAN), has commended the Senate on the recent passage of the Real Estate Regulatory Council bill.\nHDAN President made a particular reference to Professor Akin Mabogunje whom he credited for advocating housing development regulations in Nigeria.\nEven if you don’t have money you can go into the real estate and be scamming people.\n“There is today an agency that regulates the flow of transactions and activities in Lagos real estate sector.\nThe Housing Development Advocacy Network,(HDAN) is an NGO at the forefront of promoting and championing the development of Housing / construction industry and affordable housing in Nigeria."
  },
  {
    "headline": "Flight Delay, Cancellation Imminent As NiMet Predicts Low Visibility",
    "summarized_story": "There are indications that flights to northern parts of the country will be delayed or cancelled totally on November 20, 2021 as a result of anticipated poor weather condition and low visibility.\nThis follows the prediction by the Nigerian Meteorological Agency (NiMet), that there will be low weather visibility of below a thousand over some parts of the northern region on November 20.\nNiMet spokesperson, Muntari Yusuf Ibrahim, said the value scale of significant visibility deterioration over the northern cities on November 20 as stated above would range from 2000-5000 metres with isolated cases of visibility below 1000 metres.\nADVERTISEMENT“More attention is expected especially during the early morning period when horizontal visibility is mostly impaired.\n“The expected reduction in visibility may disrupt flight operations through cancellation and delay of flights; this is for the safety of air travellers.”"
  },
  {
    "headline": "NDDC Contractors Vow To Change Status Quo Of Contracts",
    "summarized_story": "The new Board of Contractors Association of the Niger Delta Development Commission (NDDC), has promised to change the wrong status quo of unpaid contracts executed in the Niger Delta region.\nThe contractors urged President Muhammadu Buhari, Minister of Niger Delta Affairs, Godswill Akpabio and the NDDC under the leadership of Effiong Akwa to mobilise payment for contracts executed by its members in the region.\nThey lamented that the NDDC under the purview of the Ministry of Niger Delta Affairs has failed to respond to its plights despite several letters, complaints and engagements.\n“Explore all legal options available to us to see that all our contractors are paid.\nWhile drawing the attention of President Buhari to the plight of NDDC contractors who have suffered for years to contribute their quota towards the development of the Niger Delta region without honour, the contractors regretted that its members have remained in poverty and servitude."
  },
  {
    "headline": "Nnamdi kanu cries: My health worsening in DSS custody",
    "summarized_story": "The detained Leader of the Indigenous People of Biafra, IPOB, Mazi Nnamdi kanu has cried out that his condition has worsened under the custody of the Department of State Services, DSS, as the agency declined his request for an independent medical examination.\n“Our Client, Mazi Nnamdi Kanu, has instructed us to make the following information public.\nThat he is solitarily confined to a very tiny cell 23 hours of the day without access to sunlight and any social interactions whatsoever.\nBecause of this, detainees have resorted to avoiding him and exchanging salutations with him, not to talk of any other form of social interactions.\n“Mazi Nnamdi Kanu, who witnessed the detention before being led away was very distressed and alarmed by this incident and he considers it a brazen act of intimidation of his Counsel."
  },
  {
    "headline": "Nnamdi kanu cries: My health worsening in DSS custody",
    "summarized_story": "The detained Leader of the Indigenous People of Biafra, IPOB, Mazi Nnamdi kanu has cried out that his condition has worsened under the custody of the Department of State Services, DSS, as the agency declined his request for an independent medical examination.\n“Our Client, Mazi Nnamdi Kanu, has instructed us to make the following information public.\nThat he is solitarily confined to a very tiny cell 23 hours of the day without access to sunlight and any social interactions whatsoever.\nBecause of this, detainees have resorted to avoiding him and exchanging salutations with him, not to talk of any other form of social interactions.\n“Mazi Nnamdi Kanu, who witnessed the detention before being led away was very distressed and alarmed by this incident and he considers it a brazen act of intimidation of his Counsel."
  },
  {
    "headline": "Anxiety as ex-Boko Haram fighters protest in Borno camp",
    "summarized_story": "Former Boko Haram fighters who have surrendered to the Nigerian government and are kept at various camps within Maiduguri are protesting their long stay in the camps.\nThe protesting ex-fighters are those kept at the Maiduguri transit camp within the metropolis.\nThis protest, according to sources is the fourth time the ex-fighters are protesting on their prolonged stay in confinement.\nThe former Boko Haram fighters said they have been kept in the camp for about four months without doing anything.\nDuring the protest, the surrendered terrorists destroyed public infrastructures in the camp, a source disclosed to The PUNCH on Thursday."
  },
  {
    "headline": "Anxiety as ex-Boko Haram fighters protest in Borno camp",
    "summarized_story": "Former Boko Haram fighters who have surrendered to the Nigerian government and are kept at various camps within Maiduguri are protesting their long stay in the camps.\nThe protesting ex-fighters are those kept at the Maiduguri transit camp within the metropolis.\nThis protest, according to sources is the fourth time the ex-fighters are protesting on their prolonged stay in confinement.\nThe former Boko Haram fighters said they have been kept in the camp for about four months without doing anything.\nDuring the protest, the surrendered terrorists destroyed public infrastructures in the camp, a source disclosed to The PUNCH on Thursday."
  },
  {
    "headline": "Buhari Finally Reacts To EndSARS Panel Report",
    "summarized_story": "President Muhammadu Buhari stated on Monday that before acting on the report of the Lagos judicial panel of investigation into police brutality, he will wait to see what states do.\nBuhari, who revealed this during a meeting with US Secretary of State Antony Blinken, claimed that numerous state governments are involved and that the probe panels have varied terms of reference.\nIn its recently leaked report on the Lekki Toll Gate incident, the Lagos State Panel of Investigation found that police and officers of the Nigerian Army purposefully killed and injured armless youngsters protesting unlawful killings by Nigerian police.\n“It’s helping us to stabilize the situation in the Northeast, and we’ve made a lot of progress since 2015.\n“We are doing a lot on security, and the people involved appreciate our efforts.”"
  },
  {
    "headline": "FG Reacts As US Removes Nigeria From Religious Freedom Blacklist",
    "summarized_story": "Nigeria has been removed from the United States’ list of countries with religious freedom concerns, according to the Federal Government.\nRecall that the US removed Nigeria from its list of religious violators on Wednesday.\nHe also stated that Nigeria does not violate religious freedom or have a policy of religious persecution, as he had previously stated.\nNigeria, he said, carefully guards religious freedom, which is established in the country’s constitution, and takes any violations seriously.\nThe Minister also praised religious leaders across the country for their efforts to promote religious unity."
  },
  {
    "headline": "BREAKING: US Secretary Of State Meets Buhari At Presidential Villa",
    "summarized_story": "President Muhammadu Buhari and Secretary of State Antony Blinken of the United States of America are currently meeting at the Presidential Villa in Abuja.\nAs of press time, the meeting’s agenda was still a work in progress.\nHe will also meet with Vice President Yemi Osinbajo to sign an agreement between the United States and the Nigerian government.\nBefore leaving the Presidential Villa, the Secretary of State will have a joint press conference with Minister of Foreign Affairs, Geoffrey Onyeama, following his meeting with Osinbajo.\nSee photos below:"
  },
  {
    "headline": "BREAKING: Hoodlums Attack APC Factional Meeting In Osogbo",
    "summarized_story": "Hoodlums on Thursday afternoon attacked members of the All Progressives Congress party (APC) at Oranmiyan House, Osogbo.\nThe members who were attacked are those who belong to The Osun Progressives (TOP) faction under the leadership of Adelowo Adebiyi.\nThe hoodlums arrived at the venue of the TOP meeting in a black Sienna minivan and began shooting sporadically.\nReports say the hoodlums gained access into the compound because the personnel of the Nigerian Security and Civil Defence Corps who maintained security at the premises were not on ground at the time of the attack."
  },
  {
    "headline": "With telecoms shutdown: Bandits now use walkie talkie in Katsina – SSG",
    "summarized_story": "Amidst continued shutdown of telecoms services in Katsina state, bandits have resorted to use of Radio Frequency Walkie Talkie Transceivers, Secretary to the State Government (SSG) Mustapha Inuwa has said.\nAt the parley were Commissioner of Police in the state, Sanusi Buba and the Special Adviser to the Governor on Security, Muhammad Ibrahim Katsina.\nThere were also outcries from some stakeholders who believed the shutdown had worsened the security situation of the people.\nFor instance, the state legislature recently tasked the Masari administration to up its game, saying the telecoms shutdown had left the people at the mercy of the bandits.\nSSG speaks in the contrarySpeaking to the contrary, however, SSG Inuwa said the telecoms ban had achieved the desired results in the state."
  },
  {
    "headline": "VIDEO: Watch as Psquare brothers end 5-year feud with warm embrace",
    "summarized_story": "Following an intense five year long family feud, popular singing duo, Peter and Paul, were seen in a viral video embracing after years of rancour that made their band, P-Square, split.\nIn the video, their elder brother and manager to the defunct group, P-Square, was also seen warmly greeting his twin brothers.\nIn the video shared by popular Nollywood actor, Mike Ezuruonye, the brothers seemed happy to be in each other’s company while those around were glad that the Okoye brothers shared a warm embrace.\nThis development comes barely after four days that the brothers began to follow themselves back on Instagram.\nRelatedNo tags for this post."
  },
  {
    "headline": "Breaking: NFF move to sack Super Eagles coach, Gernot Rohr",
    "summarized_story": "Super Eagles coach Gernot Rohr is most likely to get the axe any moment soon.\nThe decision to sack the Franco-German gaffer was reportedly taken after a company associated with the senior National team of Nigeria agreed to pay the termination clause in the contract of the coach.\nAccording to sources at the nation’s football house, the Nigeria football Federation (NFF) have communicated the decision to the former Niger and Burkina Faso coach.\nAlready, the country’s football body has started the search for a new coach who will pilot the affairs of the team for the 2022 World Cup Play offs and also the Africa Cup of Nations in Cameroon next year.\nThe German trainer has been in charge since August 2016 and led the team to a 3rd place in 2019 AFCON."
  },
  {
    "headline": "EndSARS: We Await Reports From State Govts, Buhari Tells Blinken",
    "summarized_story": "President Muhammadu Buhari says the Federal Government will allow the system to exhaust itself, and will, therefore, wait for pronouncements from state governments that set up panels to probe police brutality in the country.\nThe president spoke Thursday at State House, Abuja, while receiving in audience Mr Antony Blinken, the US Secretary of State.\n﻿“So many state governments are involved, and have given different terms of reference to the probe panels,” spokesman, Femi Adesina quoted the president as saying.\n“We at the Federal have to wait for the steps taken by the states, and we have to allow the system to work.\n“We are doing a lot on security, and the people involved appreciate our efforts.”On the development of democratic ethos, President Buhari said Nigeria has adopted the American model, “hook, line, and sinker, with its term limits."
  },
  {
    "headline": "Taraba Ambazonia Attack: All Governors In Nigeria Are Helpless In Tackling Insecurity – Ishaku",
    "summarized_story": "﻿Taraba State Governor, Darius Ishaku, says the 36 governors in Nigeria are helpless when it comes to tackling insecurity.\nThe soldiers are said to have stormed Manga village in Takum Local Government Area of Taraba State on Wednesday, killing 11 people including a traditional ruler.\nTakum Local Government Area is a border community between Taraba State and the Republic of Cameroon.\nAll the governors are helpless, not only Darius Ishaku that is helpless; not only Taraba State that is helpless.\nIn forging a way forward, Governor Ishaku called for the military to help man Taraba’s ‘long-stretch’ border with Cameroon."
  },
  {
    "headline": "Railway Workers Begin Three-Day Nationwide Warning Strike",
    "summarized_story": "Railway workers in the country have commenced a three-day warning strike, grounding rail services nationwide.\nThe workers commenced the strike on Thursday and shut down passenger and cargo train services of the Nigerian Railway Corporation (NRC).\nAt the Mobolaji Johnson Train Station in Ebute-Metta in Lagos, aggrieved workers were also seen with placards, lamenting poor welfare and poor salary.\nTrain service at the Professor Wole Soyinka railway station in Abeokuta, Ogun State capital was also paralysed because of the industrial action.\nThe NRC employees under the aegis of the Nigerian Union of Railway Workers earlier on Wednesday vowed to halt train operations nationwide including services on the popular Lagos-Ibadan, Abuja-Kaduna, and Warri-Itakpe routes."
  },
  {
    "headline": "Reps Minority Caucus Reviews Lagos EndSARS Report, Says FG Has Questions to Answer",
    "summarized_story": "The Minority Caucus in the House of Representatives has said it has reviewed the Lagos EndSARS report and observed that the Federal Government has questions to answer.\nThe lawmakers in a statement signed by Minority Leader, Ndudi Elumelu on Thursday said the report has confirmed that there was indeed a massacre at Lekki Toll Gate on October 20, 2020, despite the earlier denial of killings.\n“The Minority Caucus in the House of Representatives, after a thorough review of the report of the Lagos State EndSARS judicial panel, holds that the attempt by officials of the All Progressives Congress (APC)-led Federal Government to cover up the now confirmed massacre of Nigerians youths by security forces at the Lekki Tollgate suggests a high-level state-backed conspiracy against Nigerians.\nREAD ALSO: Lagos Govt Urges ‘Restraint’ Over #EndSARS Panel Report“The confirmation by the Lagos Panel that there was indeed a massacre at the Lekki Tollgate during the 2020 EndSARS protests in Lagos and that APC government-controlled security forces carted away bodies and mopped up evidence, places a huge burden on the Federal Government which had vehemently denied any killings,” the statement read in part.\n“Our caucus is however shocked that the administration can lie in a matter that has to do with the gruesome killing of citizens, particularly our youths, and even attempt to provide official cover to the culprits."
  },
  {
    "headline": "Buhari Approves N656.11bn Fresh Bailout For 36 States",
    "summarized_story": "President Muhammadu Buhari has approved a fresh N656.112 billion Bridge Financing Facility to the 36 States.\nThis was disclosed Thursday at the National Economic Council (NEC) meeting presided over by Vice President Yemi Osinbajo.\nThe approved Bridge facility of N656.112 billion will be disbursed in six tranches over a period of six months to the States.\nIt would be recalled that on 15th of July, 2021, the Council had received updates on the Budget Support Facility to States.\nSubsequently, the States sought further support leading to the idea of bridge financing."
  },
  {
    "headline": "Military, Police and other security agencies are not rivals",
    "summarized_story": "The Commissioner of Police, Lagos State, Hakeem Odumosu has said that the military, the Police and other security agencies in the country are not rivals but members of the same big family pursuing the same goal in the interest of the nation.\nCP Odumosu made the statement while presenting a paper entitled: ‘Contribution of the Nigeria Police to the Enhancement of National Security in Lagos State and Nigeria as a whole’ during the study tour of delegates of the Senior Course 44 of the Armed Forces Command and Staff College, Jaji, to the Lagos State Police Command on 16th November, 2021.\nSpeaking further, the Commissioner of Police opined that the visit ‘will afford the course participants to get thorough knowledge of the strategies being adopted by the police to secure the citizens, business entities, private and government facilities and other critical infrastructures of national interest in the state’.\nThe strategies, the CP emphasized, include but not limited to ‘proactive and intelligence driven security strategies, to tackle the menace (of crimes and criminality) head-on and ensure a secured environment’Head of the delegates, Commodore KJ Odubanjo, mni, in his response thanked the Commissioner of Police for the warm reception given to the delegates as well as the brilliant presentation which according to him, would be of tremendous benefits to the course participants."
  },
  {
    "headline": "Nigeria cannot afford another round of strike in public universities",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, said Nigeria cannot afford another round of strike in public universities.\nHe appealed to the Academic Staff Union of Universities to withdraw the three-week deadline issued to the federal government.\nHe says the union does not like going on strike but compelled in the face of government’s inability to implement agreements.\nAmong the eight issues in conflict are funding for the revitalisation of universities, earned academic allowance, renegotiation of agreement, withheld salaries due to IPPIS problems and proliferation of state universities without adequate funding.\nThe Minister of State for Education, Chukwuemeka Nwajuba, said the Earned Academic allowance will be paid from Monday."
  },
  {
    "headline": "Scores killed as Bandits attack Sabon Birni",
    "summarized_story": "Suspected armed bandits operating in Sabon Birni area in the Eastern Senatorial District of Sokoto state have allegedly killed twenty one persons at different locations within the local government area.\nMr. Gobi said, the bandits killed eight persons in Sangirawa village and four in Sabindawa and three were killed n Garin Gado village.\nkilled in Gaje village as well as another three in Gaju village and three others in Garin Zago and several others were also injured.\nEffort to speak with Sokoto state police command to confirm the attack was unsuccessful as the police public relations officer or the command failed to answer calls to his mobile line.\nOther sources in the local government had earlier confirmed to TVCNEWS that fourteen persons were killed in the two day attack on the village by the suspected bandits."
  },
  {
    "headline": "Afreximbank signs $1.04bn deal with NNPC",
    "summarized_story": "The African Export-Import Bank (Afreximbank) has signed a $US1.04 billion loan agreement with the Nigerian National Petroleum Corporation (NNPC) to fund petroleum exploration.\nThe agreement was signed in Durban on Wednesday as part of the second intra-Africa trade fair, which began on November 15 and will end on November 21.\nThe transaction consists of a Pre-Export/Shipment Finance Facility backed by a Forward Sale Agreement (FSA) and Offtake Contracts from the Nigerian National Petroleum Corporation, which acts as both the borrower and the seller.\nThe NNPC will sign a forward sales agreement (FSA) under which it will deliver 35,000 barrels of crude oil per day.\nAfreximbank is a Pan-African multilateral financial institution tasked with financing and promoting intra- and extra-African trade."
  },
  {
    "headline": "Nigeria Railway Workers Shutdown Train Services Over Staff Welfare",
    "summarized_story": "Nigerian Railway Corporation workers have shut down train stations in Abuja.\nAccording to the managers, it is part of measures to protect railway assets.\nThe three-day warning strike by the railway workers began this morning over staff welfare.\nHowever, to avert the strike, the Minister of Transportation, Rotimi Amaechi invited the labor unions to a meeting at the weekend, but it ended in a deadlock.\nARISE Correspondent in Abuja, Tunji Olanipekun gives an update."
  },
  {
    "headline": "U.S. Removes Nigeria from Religious Freedom Violators List – Trending With Ojy Okpe",
    "summarized_story": "Afrobeats super star Davido On Wednesday, set social media abuzz after he took to Twitter and Instagram to solicit funds; to clear his Rolls Royce vehicle from the ports.\nThe musician shared his account number online for his fans to make payments and within a few minutes of the announcement; N26 million Naira was raised and donations went up to 40 million within the hour.\nWith a target of N100 million set for the supposed clearance of his Rolls Royce, the singer amassed over the target; and as at this morning, the amount raised is over N150M.\nAmong those who donated are billionaire Businessman Femi Otedola, Mornach Saheed Eluegushi, socialite Obi Cubana and a handful of entertainers.\nReactions trail the United States’ decision to remove Nigeria from the list of countries blacklisted for engaging in violation of religious freedom."
  },
  {
    "headline": "Travis Scott and Astroworld Organisers Sued for $750m",
    "summarized_story": "More than 125 people who were caught up in the deadly Astroworld music festival crush have sued rapper Travis Scott and other organisers for $750m (£556m).\nThe family of Axel Acosta, 21, one of the 10 victims, are among those bringing the legal case in the US.\nIt claims Scott and guest star Drake kept performing despite accounts of “lifeless bodies being passed through the crowd in full view of the stage”.\n“Certainly, neither Travis Scott nor his handlers, entourage, managers, agents, hangers on, promoters, organizers or sponsors cared enough about Axel to make even a minimal effort to keep him and the others at the concert safe,” it said.\nAfter the concert, Scott said on Instagram that he “could just never imagine the severity of the situation” while he was performing."
  },
  {
    "headline": "Edouard Mendy Criticises Media Outlets Over Use of His Image in Stories About Benjamin Mendy",
    "summarized_story": "Chelsea goalkeeper Edouard Mendy has criticised media outlets for mistakenly using his image in stories about Manchester City’s Benjamin Mendy.\nCity and France full-back Benjamin Mendy has been charged with six counts of rape and one of sexual assault, and remains in custody.\nPhotos of Edouard Mendy and his cousin, Real Madrid’s Ferland Mendy, have been used to illustrate articles.\nEdouard Mendy said their use was “highly symbolic”.\nOn Wednesday, the 27-year-old appeared in court to face two further charges of rape, related to alleged attacks in Macclesfield in July and August."
  },
  {
    "headline": "Greece Begins Espionage Trial of 24 Aid Workers",
    "summarized_story": "More than two dozen aid workers will go on trial over their role in helping migrants reach Greece between 2016 and 2018 on Thursday.\nThe defendants face a raft of charges, including espionage, forgery and the unlawful use of radio frequencies.\nHuman rights groups have condemned the trial as being politically motivated and Amnesty International has called the charges “farcical”.\nProsecutors allege that the aid workers, who were affiliated with a search and rescue group, monitored the Greek Coast Guard’s radio channels and used a vehicle with a fake military licence plates to enter restricted areas on Lesbos.\nLast year it introduced tougher rules for the operation of dozens international aid groups, which critics say makes it harder to operate in the country."
  }
]