[
  {
    "headline": "Terrorists bombed, opened fire on Kaduna-Abuja train on Wednesday -Shehu Sani",
    "summarized_story": "The former senator representing Kaduna Central, Shehu Sani, has said he escaped terrorist explosives while on the Abuja-Kaduna rail line.\nSani stated this in a tweet via his verified handle on Thursday, saying that it “took a miracle” for him and other passengers on the train to escape.\nHe also claimed that terrorists shot at the train on Wednesday in a separate attack.\nSani tweeted, “Yesterday, terrorists attacked the Kaduna Abuja railway with an explosive & opened fire on the train, targeting the Engine Driver & the Tank,”“This morning, I was on board when our train ran over another explosive [and it] damaged [the] rail.\nIt took a miracle for us to escape.”PUNCH, however, has not been able to confirm the senator’s version of the event of Wednesday."
  },
  {
    "headline": "Nnamdi Kanu pleads not guilty, trial adjourned till November 10",
    "summarized_story": "The leader of the Indigenous People of Biafra, Nnamdi Kanu, has pleaded not guilty to the amended charges against him by the Federal Government.\nHe was today arraigned at the Federal High Court in Abuja over charges of treasonable felony and terrorism which the Federal Government amended last week to amount to a seven-count charge.\nShortly after pleading not guilty today, the judge ordered that he remains in the custody of the Department of State Services after failing to grant his request to be transferred to a correctional centre.\nThe case was then adjourned till November 10, 2021.\nDetails later…"
  },
  {
    "headline": "Ex-TUC president urges FG to borrow for capital projects, not consumption",
    "summarized_story": "President Muhammadu BuhariMr Peter Esele, former President, Trade Union Congress (TUC) has requested the Federal Government to borrow for capital project, rather than for consumption.\nHe noted that from the proposed budget, it was evident that the country was borrowing for consumption rather than for capital projects.\nThis, he said, was evident in the comparison between the proposed allocations for recurrent and capital expenditure.\nPresident Buhari had on Oct. 7, presented a proposed budget of N16.39 trillion before the National Assembly for 2022, fiscal year.\nA breakdown of the budget had shown that N6.83 trillion would be spent on recurrent expenditure while N5.35 trillion would be spent on capital expenditure."
  },
  {
    "headline": "Breaking: Kanu pleads not guilty to FG’s amended charge",
    "summarized_story": "As DSS block media coverage, lock out journalistsBy Ikechukwu Nnochiri – AbujaDetained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has pleaded not guilty to the seven-count amended charge the Federal Government preferred against him.\nHis re-arraingment came on day the Department of State Services, DSS, blatantly refused to allow even a single journalist inside the courtroom.\nThey made it clear that no Journalist would be allowed to enter the courtroom till the end of the proceedings.\nMeanwhile, a source inside the courtroom, notified Vanguard that the embattled IPOB leader took his fresh to the amended charge at about 10:45am.\nStern looking DSS operatives had specifically threatened to deal with any journalist recording or taking pictures of the unfolding drama."
  },
  {
    "headline": "BREAKING: Kanu pleads not guilty to FG’s amended charge",
    "summarized_story": "As DSS blocks media coverage, lockouts journalistsBy Ikechukwu NnochiriDetained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has pleaded not guilty to the seven-count amended charge the Federal Government preferred against him.\nHis re-arraignment came on day the Department of State Services, DSS, blatantly refused to allow even a single journalist inside the courtroom.\nThey made it clear that no journalist would be allowed to enter the courtroom till the end of the proceedings.\nMeanwhile, a source inside the courtroom, notified Vanguard that the embattled IPOB leader took his fresh plea to the amended charge at about 10:45 am.\nStern-looking DSS operatives had specifically threatened to deal with any journalist recording or taking pictures of the unfolding drama."
  },
  {
    "headline": "Nnamdi Kanu trial: Former Anambra gov, Ezeife, barred from entering court premises",
    "summarized_story": ""
  },
  {
    "headline": "Amaechi demands professionalism in ports control, ship inspections",
    "summarized_story": "By Dirisu Yakubu – AbujaMinister of Transportation, Rotimi Amaechi has urged Port State Control Officers, PSCOs, to display high level of professionalism in carrying out their duties of inspecting foreign ships at national ports.\nAmaechi spoke at the 11th Port State Control Committee, PSC, meeting of the Memorandum of Understanding on PSC for West and Central Africa Region also known as Abuja MoU, Wednesday in Lagos.\nHowever, this cannot be achieved without the commitment, financial and otherwise of every Member State.\nAmaechi however thanked Member states for ensuring that the Abuja MoU performed well in the face of COVID-19 and urged them not to relent in their commitments to inspections, trainings and overall contributions.\nKwaku Ofori Asiamah, in his opening speech said “Port State Control acts as an important safety-net to eliminate the operation of sub-standard ships to ensure the needed safety."
  },
  {
    "headline": "Cooking gas: Consumers lament rising cost, fear reduction not in sight",
    "summarized_story": "“It had to be so because kerosene became more expensive than cooking gas and since gas was cheaper then, many households opted for cooking gas until conditions made it impossible to continue.\n“Now, Nigeria is not in recession but the price of cooking gas is becoming outrageously expensive.\nCooking gas was selling for between N300 to N350 per kilogramme but now it’s N650 per kilogramme with the possibility of even increasing before the year ends,” he said.\nOyewale explained that it was no secret that the government had increased the tax on the importation of cooking gas to 7.5 per cent.\nIndustry watchers are indicating that there is the possibility that the cost of cooking gas may increase further by the year’s ending."
  },
  {
    "headline": "NYG: Heads may roll as Bauchi govt orders investigation of Ilorin protest",
    "summarized_story": "Heads may roll over Wednesday’s protest by drivers and officers of the Bauchi State contingent to the just concluded National Youths Games in Ilorin, Kwara State, over non-payment of allowances.\nReports have it that the contingent, comprising athletes, coaches, and officials, was delayed from departing Ilorin on time as a result of the protest.\nReacting to the development, the state Commissioner for Youths and Sports, Honorable Adamu Manu Soro, in a statement made available to journalists in Bauchi, stated that the ministry was unaware of the development.\nAccording to Manu Soro, the Bauchi State Government has an irrevocable commitment to ensuring the welfare of its athletes with a view to motivating them to perform optimally during sports competitions and tournaments.\nThe commissioner then solicited the continued support of critical stakeholders in the state’s sports sector in order to achieve the desired objectives."
  },
  {
    "headline": "Criminals connive with traditional rulers, security agents in Bauchi – Gov Mohammed alleges",
    "summarized_story": "Bauchi State governor, Senator Bala Abdulkadir Mohammed, has alleged that criminals, including bandits, connive with some traditional rulers and security agents to perpetrate criminal activities in the state.\nThe governor stated this while addressing the State Executive Council (SEC) members at the Government House, Bauchi.\nMohammed disclosed that some bad elements within security agencies also collaborate with criminals to foment troubles in some communities in the state.\nAccording to him, his administration is having sleepless nights over renewed criminal activities in the state.\n“Because of security, we are having sleepless nights."
  },
  {
    "headline": "Court sends Nnamdi Kanu back to DSS custody, adjourns till November",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, on Thursday lost his bid to be moved to the Kuje Correctional Centre.\nKanu’s request to be moved from the Kuje Correctional Centre from the Department of State Service, DSS, facility was rejected by Justice Binta Nyako of the Abuja Federal High Court.\nHis counsel, Ifeanyi Ejiofor, prayed the court to transfer the pro-Biafra agitator from the DSS custody to Kuje prison.\nBut the trial judge, Justice Nyako, rejected Ejiofor’s application.\nJustice Nyako consequently adjourned the matter till November 10."
  },
  {
    "headline": "End SARS: Ban on protests violates court judgment – Lawyer lectures police",
    "summarized_story": "Human rights lawyer, Adeola Oyinlade has condemned the Nigeria Police Force for its continued refusal to allow peaceful protests, including End SARS gatherings.\nOyinlade said they are relying on the Public Order Act of 1979, thereby justifying clamping down on demonstrators across the country.\n“This position is an unlawful and flagrant breach of the fundamental human rights of persons in Nigeria”, he declared in a statement.\nOyinlade recently won the 2021 American Bar Association (ABA) International Human Rights Laureate.\nHe was named International Bar Association (IBA) Human Rights Lawyer of the Year in 2018."
  },
  {
    "headline": "VIDEO: Security operatives leave Court premises with IPOB’s Kanu",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "VIDEO: Hoodlums beat up Sowore in Court premises during Kanu’s trial",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "JUST IN: Buhari presides over security meeting",
    "summarized_story": "President Muhammadu Buhari is meeting with security and intelligence chiefs in the Presidential Villa, Abuja.\nThough no official details had been provided yet as at the time of filing this report, sources informed that it is for a review of recent security developments across the country.\nAmong those at the meeting are Vice President Yemi Osinbajo; Attorney-General and Minister of Justice, Abubakar Malami; Minister of Defense, Major General Bashir Magashi (Rtd); Minister of Foreign Affairs, Geoffrey Onyeama; the Chief of Staff to the President, Professor Ibrahim Gambari; and the National Security Adviser, Major General Babagana Monguno (Rtd).\nOthers are the Chief of Defense Staff, General Lucky Irabor; Chief of Army Staff, Lt. General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo; Chief of Air Staff, Air Marshal Isiaka Oladayo Amao; Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA),Ahmed Rufai Abubakar.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "BBNaija’s Angel celebrates paying for first apartment",
    "summarized_story": "21-year-old reality TV star Angel Smith has taken to social media to celebrate securing and paying for her first apartment.\nThe former BBNaija “Shine Ya Eye” finalist via a post on social media revealed she just secured and paid for a four-bedroom apartment.\nThe ecstatic Angel said: “I don’t know if now is a good time but I wanted to share my win with y’all and tell y’all that I just paid rent for my first permanent apartment.\nAnd it’s a 4 bedroom apartment y’all.\nI have my own space.”Reacting to the news, her fans and some others have congratulated her on her latest feat and wished her, even more, greater achievements in the future."
  },
  {
    "headline": "I am not guilty, Nnamdi Kanu tells court",
    "summarized_story": "The leader of the Indigenous People of Biafra (IPOB) Mazi Nnamdi Kanu, has been re-arraigned at a federal high court in Abuja on terrorism charges.\nHe pleaded not guilty.\nWhen the charges were read to him, the IPOB leader pleaded not guilty.\nAdvertisementHe has been in the custody of the Department of State Services (DSS) since his arrest.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Breaking: Kanu pleads not guilty to FG’s amended charge",
    "summarized_story": "From Godwin Tsa, AbujaDetained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, on Thursday entered a plea of not guilty to the seven-count amended charge preferred against him by the Federal Government.\nSpeaking from the dock before before trial Justice Binta Nyako, Kanu said he was innocent of all the allegations Federal Government filed against him, after the charge was read to him in the open court.\nHis re-arraingment came on day the Department of State Services, DSS, blatantly refused to allow even a single journalist inside the courtroom.\nThey made it clear that no Journalist would be allowed to enter the courtroom till the end of the proceedings.\nMeanwhile, a source inside the courtroom, notified Daily Sun that the embattled IPOB leader took his fresh to the amended charge at about 10:45am."
  },
  {
    "headline": "Photos: Kanu in court with his legal team",
    "summarized_story": "From Okey Sampson, Umuahia Abia state was totally locked down today as residents observe the Indigenous People..."
  },
  {
    "headline": "Breaking: Enugu stands still for Nnamdi Kanu",
    "summarized_story": "From Geoffrey Anyanwu, EnuguResidents of Enugu this morning remained indoors in total compliance to the sit-at-home order by the Indigenous People of Biafra (IPOB) in solidarity with their leader, Nnamdi Kanu who is suppose to appear in court in Abuja today.\nToday’s sit-at-home seem to have been obeyed more than the previous ones apparently because it is to show solidarity with Kanu.\nUSA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\nIPOB had while withdrawing the order for Mondays sit-at-home, said that sit-at-home will be only on the days Kanu will be in court.\nMeanwhile, there is unconfirmed information that a vehicle carrying loads and shop were burnt around Eke-Obinagu along Enugu-Abakaliki Road."
  },
  {
    "headline": "Tight security at Federal High Court ahead of Nnamdi Kanu’s trial",
    "summarized_story": "There is tight security at the Federal High Court Abuja as the court sets to continue the trial of the leader of the proscribed Indigenous People of Biafra (IPOB),Nnamdi Kanu.\nA large number of security personnel were deployed to the court premises and it’s surrounding to forestall any breakdown of law and order.\nThe News Agency of Nigeria (NAN) reports that at about 8:02am, a heavily fortified security convoy arrived the court premises, which appeared to be carrying Kanu.\nAs at the time of filing this report, journalists, lawyers and litigants were standing outside the court premises as they were denied entrance.\nNAN reports that on June 28,Justice Binta Nyako gave the order that he be remanded in DSS custody."
  },
  {
    "headline": "Breaking: Nnamdi Kanu in Court as Trial Commences",
    "summarized_story": "By Alex EnumahThe leader of the Indegenious People of Biafra (IPOB), Nnamdi Kanu, is present in court as his trial over alleged terrorism and treasonable felony commence Thursday morning in Abuja.\nThe federal government, last week, filed an amended seven-count criminal charge against Kanu, upon which he is to be re-arraigned before Justice Binta Nyako of the Federal High Court, Abuja.\nKanu and four others were arraigned in 2016 on a six-count criminal charge but abandoned his trial in 2017 after his family’s house was attacked.\nHe was however re-arrested and brought to the country to continue his trial in June, this year.\nMeanwhile, as the trial gets underway, journalists covering the court, although allowed entry into the court premises, were however prevented from entering the court room."
  },
  {
    "headline": "Breaking: Nnamdi Kanu Arrives Court Premises, Amidst Tight Security",
    "summarized_story": "By Alex EnumahDetained leader of the Indigenous People of Biafra (IPOB), Mr Nnamdi Kanu has arrived the Abuja Division of the Federal High Court, venue of his trial over allegations of terrorism and treasonable felony.\nBefore his arrival, security operatives including DSS, Nigerian Army, Police and the NSCDC had condoned off all enterances leading to the headquarters of the Federal High Court, Abuja.\nEven staff of the Federal High Court had to alight from their staff bus to be screened before they were allowed to go in.\nNnamdi Kanu was arraigned alongside four others on six count criminal trial charge bordering on alleged terrorism and treasonable felony in 2016.\nFollowing the jumping of his bail, trial judge, Justice Binta Nyako had voided the bail and issued a warrant for his arrest."
  },
  {
    "headline": "Security, Trade Take Centre Stage in Nigeria, Turkey Agreements",
    "summarized_story": "“During the visit, we had very useful discussions on a number of bilateral issues, aimed at strengthening this cordial relationship between Nigeria and Turkey.\nThus, Nigeria became our most outstanding and the biggest trade partner in the sub-Saharan Africa for the Republic of Turkey.\nOn the beneficial ties between Turkey and Africa, especially Nigeria, President Erdogan said, “we’ll keep on converging with the African continent as Republic of Turkey on every dimension possible.\nHe added: “As Turkey, we have been closely monitoring the developments unfolding in Nigeria, our brotherly and friendly nation.\nI hope and pray that our Nigerian brothers will forge a closer solidarity in this field with us, the Republic of Turkey."
  },
  {
    "headline": "The Economist: Kidnappers, Zealots, Rebels Making Nigeria Ungovernable",
    "summarized_story": "•Says President Buhari has allowed the rot to deepen•Warns country sliding into failed statePeter Uzoho with agency reportThe Economist has expressed concerns about how kidnappers, zealots and rebels are making Nigeria ungovernable, highlighting the rising incidence of insecurity across the country.\nAccording to the report, the country was growing ever harder to live or work in.\n“Security [in Nigeria] is at its worst since the civil war,” it quoted Cheta Nwanze of SBM Intelligence, a consultancy in Lagos, to have said.\nLagos, the commercial capital, is home to vigorous banks, a hip technology scene and a flourishing film industry, Nollywood,” The Economist stated.\nA force of mercenaries, reinforced by Nigeria’s army, pushed them back into isolated swamps and forests,” it explained."
  },
  {
    "headline": "#EndSARS: NEC Directs Govs to Prosecute Indicted Persons",
    "summarized_story": "This was despite warnings by the Nigeria Police that marches to mark the one year anniversary of the #EndSARs protest would not be condoned.\nIn Lagos State, youths gathered at the Lekki tollgate to mark the EndSARs anniversary.\nOn Monday, the Judicial Panel of Inquiry that was set up by the Lagos State Government after the #EndSARS protest wrapped up its sitting.\nLagos State Commissioner of Police, Hakeem Odumosu, got those wrongfully arrested freed, just as he tendered public apology to those who were brutalised.\nThe Lagos State Police Commissioner reports directly to the Inspector General of Police in Abuja and not to the Lagos State government."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "正在播放《花背景图高清 》第80679集-晟通网",
    "summarized_story": ""
  },
  {
    "headline": "正在播放《花背景图高清 》第80679集-晟通网",
    "summarized_story": ""
  },
  {
    "headline": "Sahara Reporters",
    "summarized_story": "When the SARS operatives finally arrived at the scene, they handcuffed Reuben.\nAt that time, Chibuike was still breathing, but the SARS operatives refused to take him to the hospital.\nWhile Reuben was taken to the police station, Chibuike was taken to the University of Port Harcourt (UPTH) mortuary.\nThe SARS operatives had apparently dumped Chibuike’s corpse and registered him under the name Daniel Anambra, a 30-year-old accident victim.\nChibuike, Dominic reveals, was in a group that already had an album to their credit."
  },
  {
    "headline": "Nnamdi Kanu's trial: Lawyers protest after DSS, police bar them from court",
    "summarized_story": "Lawyers in their numbers protested in front of the federal high court in Abuja after being locked out by security agents on Thursday.\nSome of the lawyers locked out claimed to be in Kanu’s legal team, while others said they were in court to handle cases of other litigants.\nAdvertisementAloy Ejimakor, one of Kanu’s counsel, said the government had plans to isolate him in court.\nRepresentatives of Ohanaeze Ndigbo, an Igbo socio-cultural group, were in court to witness the trial.\nChukwuemeka Ezeife, former governor of Anambra state, was one of the representatives of Ohanaeze Ndigbo."
  },
  {
    "headline": "Nnamdi Kanu's trial: Lawyers protest after DSS, police bar them from court",
    "summarized_story": "Lawyers in their numbers protested in front of the federal high court in Abuja after being locked out by security agents on Thursday.\nSome of the lawyers locked out claimed to be in Kanu’s legal team, while others said they were in court to handle cases of other litigants.\nAdvertisementAloy Ejimakor, one of Kanu’s counsel, said the government had plans to isolate him in court.\nRepresentatives of Ohanaeze Ndigbo, an Igbo socio-cultural group, were in court to witness the trial.\nChukwuemeka Ezeife, former governor of Anambra state, was one of the representatives of Ohanaeze Ndigbo."
  },
  {
    "headline": "Shehu Sani: Abuja-Kaduna train I boarded was attacked with explosives",
    "summarized_story": "Shehu Sani, former senator representing Kaduna central, says the Abuja-Kaduna train he boarded was attacked with explosives.\nAdvertisementIn a tweet on Thursday, Sani said it “took a miracle” for him and other passengers on the train to escape.\n“Yesterday, terrorists attacked the Kaduna Abuja railway with an explosive & opened fire on the train, targeting the Engine Driver & the Tank,” he tweeted.\npic.twitter.com/QAJVnLdOaw — Senator Shehu Sani (@ShehuSani) October 21, 2021 AdvertisementHowever, Sani’s account is a different from reports on Wednesday’s incident.\nAdvertisementA backup train reportedly got to the passengers around 12:15 am and safely took all on board to Kaduna."
  },
  {
    "headline": "Shehu Sani: Abuja-Kaduna train I boarded was attacked with explosives",
    "summarized_story": "Shehu Sani, former senator representing Kaduna central, says the Abuja-Kaduna train he boarded was attacked with explosives.\nAdvertisementIn a tweet on Thursday, Sani said it “took a miracle” for him and other passengers on the train to escape.\n“Yesterday, terrorists attacked the Kaduna Abuja railway with an explosive & opened fire on the train, targeting the Engine Driver & the Tank,” he tweeted.\npic.twitter.com/QAJVnLdOaw — Senator Shehu Sani (@ShehuSani) October 21, 2021 AdvertisementHowever, Sani’s account is a different from reports on Wednesday’s incident.\nAdvertisementA backup train reportedly got to the passengers around 12:15 am and safely took all on board to Kaduna."
  },
  {
    "headline": "Nnamdi Kanu pleads 'not guilty' to seven-count charge of terrorism",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has been re-arraigned at a federal high court in Abuja on terrorism charges.\nAdvertisementThe federal government recently amended the charges against him raising them to seven counts as against the five counts he was previously answering to, bordering on treasonable felony and terrorism.\nThe court session on Thursday commenced at 10 am.\nWhen the charges were read to him, the IPOB leader pleaded not guilty.\nAdvertisementHe has been in the custody of the Department of State Services (DSS) since his arrest."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Yes, you have rights over your data, but only to an extent",
    "summarized_story": "The issuesUnder the Nigeria Data Protection Regulation 2019, a data subject has several rights over the use of their personal data.\nThis is in breach of the Nigerian Data Protection Regulations which protects the right of a data subject to rectification and erasure of their personal data.\nThe laws don’t say the right to rectification of data by the data subject must be done on the platform by the individual, or it must be achieved immediately.\nThe NDPR provides for situations that might be regarded as the lawful processing of a data subject’s data.\nBut what I do know is that it has prompted a very important discussion on data rights and how they can be abrogated."
  },
  {
    "headline": "Nigeria’s TalentQL launches AltSchool Africa to train entry level tech talent for free",
    "summarized_story": "Share this article:Nigerian tech talent startup, TalentQL, has today, October 21, 2021, launched AltSchool Africa.\nAs Africa’s tech ecosystem has grown, a number of organizations have sprung up to supply tech talent for startups.\nThis is the problem that TalentQL is trying to solve with AltSchool Africa.\nThis presents both a unique challenge and opportunity for developing tech talents in Africa.\nWhile speaking to Yusuf, you get the feeling that AltSchool Africa is not just another attempt at entrepreneurship for him but a mission."
  },
  {
    "headline": "Techpoint Awards 2021: Nominate your favourite startups, influencers, and investors",
    "summarized_story": "So, Techpoint will be hosting its second award ceremony to celebrate startups, entrepreneurs, investors, and innovation in Nigeria.\nTechpoint Awards 2021: EligibilityThe second edition of the Techpoint Awards will be held on January 22 2022, in Lagos, Nigeria.\nMost Outstanding Logistics Startup 2021Nominate a startup that did the most excellent job addressing logistics challenges in Nigeria between January 2021 and now.\nMost Outstanding Electronic Payments Startup 2021Nominate a startup that did the most excellent job making electronic payments seamless for Nigerians between January 2021 and now.\nMost Outstanding Healthcare Startup 2021Nominate a startup that has done an excellent job addressing challenges in Nigeria’s healthcare space between January 2021 and now."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "El-Rufai backs National Assembly on declaration of bandits as terrorists",
    "summarized_story": "Kaduna State Governor Nasir El-Rufai has hailed the motion by the National Assembly urging the federal government to declare bandits operating in the North West and North Central regions of Nigeria as terrorists.\n“We in the Kaduna State Government, have always aligned with the declaration of bandits as insurgents and terrorists.\nHe described the third-quarter security report as sobering, saying it shows the situation has not improved despite the government’s efforts.\nThis reflects the limitations that personnel and other resource deficits have imposed on the federal security agencies.\nWe in the Kaduna State Government, have always aligned with the declaration of bandits as insurgents and terrorists."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Household Consumption Expenditure grew by 48.16% in Q2 2021 – NBS",
    "summarized_story": "Adebayo ObajemuRecent report published by the National Bureau of Statistics revealed that Household Consumption Expenditure, in Q1 and Q2 2021 grew by 43.72% and 48.16% in real terms, year on year.\nFor 2020, the annual growth rate in real household consumption expenditure stood at 1.56% compared to -1.06% in 2019.\nGovernment Consumption Expenditure recorded growth rates at -4.57% and -53.56% in Q1 and Q2 2021 respectively, year on year, while annual growth rate stood at 61.58% in 2020 compared to 8.78% in 2019.\nIn the first quarter of 2021, Nigeria’s real GDP at basic prices grew by 0.51% on a year on year basis showing a steady improvement in the economy following 2020 Q4 GDP rate of 0.11%.\nGrowth however, improved further in second quarter 2021 with positive GDP growth rate of 5.01%."
  },
  {
    "headline": "Market extends weekly gain by N329bn amidst renewed investors’ optimism, returns",
    "summarized_story": "The All Share Index appreciated by 1.39% week on week to close at 41,438.15 points from the previous close of 40,868.36 points.\nThe Market Capitalisation grew by 1.54% week on week, to close at N21.625 trillion from the previous close of N21.296 trillion, thereby gaining N329 billion.\nTop 10 GainersChampion Breweries led other gainers with 49.52% growth to close at N3.14 from the previous close of N2.1.\nTop 10 LosersLearn Africa led other price decliners as it sheds 18.71% of its share price to close at N1.26 from the previous close of N1.55.\nOther top ten price decliners include: Nigerian Breweries (-3.23%), Northern Nigerian Flour Mills (-2.44%), Japaul Gold (-2.08%), Guinness (-1.86%) and Linkage Assurance (-1.72%) respectively."
  },
  {
    "headline": "BREAKING: Court adjourns Nnamdi Kanu’s trial till November 10",
    "summarized_story": "Federal High Court sitting in Abuja, has adjourned the trial of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) till November 10.\nThe IPOB leader was presented in court Thursday by the Department of State Services (DSS), for the continuation of his trial, amid tight security.\nBREAKING: Court adjourns Nnamdi Kanu’s trial till November 10Federal High Court sitting in Abuja, has adjourned the trial of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) till November 10.\nThe IPOB leader was presented in court Thursday by the Department of State Services (DSS), for the continuation of his trial, amid tight security.\nIfeanyi Ejiofor, his lead counsel, asked the court to transfer him from the custody of the DSS to Kuje prison."
  },
  {
    "headline": "Mondia Digital, Mondia Pay join Vodacom’s VodaPay Super App offering",
    "summarized_story": "Mondia Digital has integrated all of its technology, content and services into the easy-to-use VodaPay Super App environment.\nMondia Digital has also co-created many of Vodacom’s key branded services on the Super App platform.\nIn addition to content integration, Mondia Pay has rolled out the provision of its seamless, contactless Direct Carrier Billing (DCB) payment service to the VodaPay Super App.\nThe future of digital content consumption is going to be driven by innovative partnerships that offer compelling and convenient consumer solutions.\nThe VodaPay Super App is set to be rolled out in other international Vodacom markets."
  },
  {
    "headline": "Prospective Corps Member Goes Missing On Her Way To Kebbi Camp",
    "summarized_story": "The National Youth Service Corps (NYSC), on Thursday, said they it had begun investigation into the alleged kidnap of a prospective corps member, Iorliam Jennifer, on her way to NYSC orientation camp in Kebbi State on Tuesday.\nAccording to her, “Prospective corps members and staff are aware of COVID-19 rules and safety protocols.\nIn addition, every PCM and camp official would be tested at the camp gate and only those who test negative will gain access into the camp.\nNCDC officials are present in the 37 orientation camps.\n“All camps have been fumigated and decontaminated in readiness to receive prospective Corps Members."
  },
  {
    "headline": "Prospective Corps Member Goes Missing On Her Way To Kebbi Camp",
    "summarized_story": "The National Youth Service Corps (NYSC), on Thursday, said they it had begun investigation into the alleged kidnap of a prospective corps member, Iorliam Jennifer, on her way to NYSC orientation camp in Kebbi State on Tuesday.\nAccording to her, “Prospective corps members and staff are aware of COVID-19 rules and safety protocols.\nIn addition, every PCM and camp official would be tested at the camp gate and only those who test negative will gain access into the camp.\nNCDC officials are present in the 37 orientation camps.\n“All camps have been fumigated and decontaminated in readiness to receive prospective Corps Members."
  },
  {
    "headline": "Convention: PDP Screening Committee Pledges Fairness",
    "summarized_story": "The screening committee of the Peoples Democratic Party (PDP) has pledged to be fair to all aspirants, ahead of the Oct. 30 national convention of the party.\nThe chairman of the committee, Mr Mohammed Adoke, gave the assurance while addressing newsmen at the beginning of the screening yesterday in Abuja.\nAdoke described the assignment as crucial to the success of the party, as it was the beginning of the process for electing credible Nigerians to steer the affairs of the party.\n“Nigerians have been yearning for the kind of leadership and governance that our party has provided for the country.\n“The screening process for the election of the national officers of our party marks the beginning of our collective efforts to once more, bestow credible and effective leadership for the country at all levels."
  },
  {
    "headline": "Convention: PDP Screening Committee Pledges Fairness",
    "summarized_story": "The screening committee of the Peoples Democratic Party (PDP) has pledged to be fair to all aspirants, ahead of the Oct. 30 national convention of the party.\nThe chairman of the committee, Mr Mohammed Adoke, gave the assurance while addressing newsmen at the beginning of the screening yesterday in Abuja.\nAdoke described the assignment as crucial to the success of the party, as it was the beginning of the process for electing credible Nigerians to steer the affairs of the party.\n“Nigerians have been yearning for the kind of leadership and governance that our party has provided for the country.\n“The screening process for the election of the national officers of our party marks the beginning of our collective efforts to once more, bestow credible and effective leadership for the country at all levels."
  },
  {
    "headline": "APC National Secretariat Has Endorsed Our Congress, Says Ganduje",
    "summarized_story": "Kano State governor Abdullahi Umar Ganduje has said the national secretariat of the All Progressives Congress (APC) under the leadership of Yobe State governor Mai Mala Buni has accepted the state congress which produced Abdullahi Abbas as the new chairman of APC in the state.\nGanduje said that the national headquarters of the party rated and recognised the election of Abbas as the most credible and acceptable.\nThe governor made the disclosure prior to the commencement of the State Executive Council meeting, held yesterday in Kano.\nHe said the “party headquarters has recognised our election of Abdullahi Abbas as the state chairman of our party.”The governor however posited that there are moves to reconcile with others who were not satisfied with the outcome of the congress.\nWhile commending all commissioners and other members of the council, he said, “You performed wonderfully well by discharging the onerous responsibility bestowed on your shoulders.”ADVERTISEMENTHe described the sacrifices made by all the appointed committees to ensure the success of the election as commendable and called on them to come forward when next they are invited to serve their party."
  },
  {
    "headline": "Court Jails Three Oil Thieves in Rivers",
    "summarized_story": "By TONY ADAMSJustices S. D. Pam and A. T. Mohammed of the Federal High Court sitting in Port Harcourt, Rivers State, convicted and sentenced three oil thieves to three months Community Service for illegal dealing in petroleum products.\nIn view of their pleas, prosecution counsel, N. A. Dodo, prayed the court to convict and sentence the defendants accordingly.\nIn the same vein, Justice Mohammed convicted and sentenced Idris and Bello to the same three (3) months Community Service with an option of fine of Fifty Thousand Naira (N50,000) each.\nBoth Judges ordered that the illegally- refined Automotive Gas Oil( AGO) stored in 23 jerry cans be sold by the court in conjunction with EFCC officials and the proceeds paid into the Consolidated Revenue Account of the Federal Government.\nAdditionally, the court required the convicts to depose to affidavits of good behaviour henceforth."
  },
  {
    "headline": "Court Jails Three Oil Thieves in Rivers",
    "summarized_story": "By TONY ADAMSJustices S. D. Pam and A. T. Mohammed of the Federal High Court sitting in Port Harcourt, Rivers State, convicted and sentenced three oil thieves to three months Community Service for illegal dealing in petroleum products.\nIn view of their pleas, prosecution counsel, N. A. Dodo, prayed the court to convict and sentence the defendants accordingly.\nIn the same vein, Justice Mohammed convicted and sentenced Idris and Bello to the same three (3) months Community Service with an option of fine of Fifty Thousand Naira (N50,000) each.\nBoth Judges ordered that the illegally- refined Automotive Gas Oil( AGO) stored in 23 jerry cans be sold by the court in conjunction with EFCC officials and the proceeds paid into the Consolidated Revenue Account of the Federal Government.\nAdditionally, the court required the convicts to depose to affidavits of good behaviour henceforth."
  },
  {
    "headline": "Kaduna insecurity: 830 kidnapped, 343 killed, 210 injured in three months",
    "summarized_story": "From July to September 2021 in Kaduna State, 343 persons died due to banditry and other violent attacks,while 830 people were kidnapped.\nThe state commissioner of Internal Security and Home Affairs, Samuel Aruwan stated this on Wednesday while presenting the third quarter of 2021 Security report to Governor Nasir Ahmad El-Rufai.\nHe said within the period under review,69 bandits were killed by security agencies, 210 citizens were injured across the state, while 10 victims were raped,while 101 persons were rescued by troops during patrols and operations.\nAccording to him,the state government’s strategies to address the security challenges affecting the state have been sustained through the third quarter of 2021.\nHe said the assault were on going with scores of bandits killed so far,and many camps destroyed via air interdiction."
  },
  {
    "headline": "Kaduna insecurity: 830 kidnapped, 343 killed, 210 injured in three months",
    "summarized_story": "From July to September 2021 in Kaduna State, 343 persons died due to banditry and other violent attacks,while 830 people were kidnapped.\nThe state commissioner of Internal Security and Home Affairs, Samuel Aruwan stated this on Wednesday while presenting the third quarter of 2021 Security report to Governor Nasir Ahmad El-Rufai.\nHe said within the period under review,69 bandits were killed by security agencies, 210 citizens were injured across the state, while 10 victims were raped,while 101 persons were rescued by troops during patrols and operations.\nAccording to him,the state government’s strategies to address the security challenges affecting the state have been sustained through the third quarter of 2021.\nHe said the assault were on going with scores of bandits killed so far,and many camps destroyed via air interdiction."
  },
  {
    "headline": "BREAKING: Bandits Bomb Abuja-Kaduna Train [PHOTOS]",
    "summarized_story": "Armed bandits on Wednesday reportedly bombed a train travelling between Abuja and Kaduna, inflicting technical damages on the country’s major rail infrastructure.\nFormer Senator Shehu Sani said a train he rode between Kaduna and Abuja on Thursday morning nearly derailed because of an explosive that damaged a section of the tracks.\nIn a tweet on Thursday, Sani said it “took a miracle” for him and other passengers on the train to escape.\nThe former senator said bandits opened fire on the train on Wednesday night in another attack.\npic.twitter.com/QAJVnLdOaw — Senator Shehu Sani (@ShehuSani) October 21, 2021A backup train reportedly got to the passengers around 12:15 am and safely took all on board to Kaduna."
  },
  {
    "headline": "BREAKING: Kanu Pleads Not Guilty To FG’s Amended Charge",
    "summarized_story": "Detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has pleaded not guilty to the seven-count amended charge the Federal Government preferred against him.\nHis re-arraingment came on day the Department of State Services, DSS, blatantly refused to allow even a single journalist inside the courtroom.\nThey made it clear that no Journalist would be allowed to enter the courtroom till the end of the proceedings.\nMeanwhile, a source inside the courtroom, notified Vanguard that the embattled IPOB leader took his fresh to the amended charge at about 10:45am.\nIt said the action amounted to an offence contrary to and punishable under 1(2) (b) of the Terrorism Prevention Amendment Act, 2013."
  },
  {
    "headline": "#EndSARS: CNN, Amnesty, DJ Switch Should Apologise To Buhari Regime, Lai Mohammed Demands",
    "summarized_story": "Amnesty International, CNN, and DJ Switch have all been asked to apologize by the Buhari administration for allegedly misled the public about a massacre at the Lekki Toll Gate on October 20, 2020.\nDJ Switch whose given name is Obianuju Udeh is a Nigerian disc jockey who is on exile over the 2020 EndSARS protest and the Lekki toll gate incidence.\n“CNN acted unprofessionally by relying on unverified, and possibly-doctored social media videos, as well as other open-source information to conclude that a massacre took place at the toll gate.\n“On its part, CNN went from 38 people killed to two to just one, after a supposed global exclusive even when the network had no reporter on ground at the Lekki Toll Gate on October 20, 2020.\n“During the sitting, CNN was summoned but it never showed up, thus missing a great opportunity to prove its allegation of a massacre at the toll gate."
  },
  {
    "headline": "VIDEO: Nnamdi Kanu trial: Security Operatives Bar Sowore From Courtroom",
    "summarized_story": "Security operatives have barred activist Omoyele Sowore from accessing the courtroom to witness the trial of Nnamdi Kanu.\n“Also I am here to witness the trial of my friend, Nnamdi Kanu, the court is a public space and the public should not be barred from accessing the courtroom.\n“Security operatives have consistently failed to do their jobs and now you see them harassing journalists and lawyers.\nNews Direct reports that journalists and lawyers who were present at the High Court in Abuja were barred from the court premises by security operatives.\nVIDEO: Thugs attack Sowore outside Abuja court as DSS, police look on pic.twitter.com/sFIV3arba8 — TheCable (@thecableng) October 21, 2021Video credit – The Cable"
  },
  {
    "headline": "Breaking: I’m not guilty, Nnamdi Kanu responds to FG’s amended charges",
    "summarized_story": "Detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, has pleaded not guilty to the seven-count amended charge the Federal Government preferred against him.\nKanu, who was docked before trial Justice Binta Nyako, said he was innocent of all the allegations levelled against him, after the charge was read to him in the open court.\nHis re-arraingment came on the day the Department of State Services (DSS) refused to allow Journalists inside the courtroom despite repeated assurance from the directorate.\nThey made it clear that no Journalist would be allowed to enter the courtroom till the end of the proceedings.\n“You people can go to your press center and wait till the end of the matter, after then, you will receive briefing on what happened”, one of the hooded operatives stated."
  },
  {
    "headline": "Happening now: Nnamdi Kanu, Lawyers in Court (PICTURES)",
    "summarized_story": "Nnamdi Kanu, the leader of Indigenous People of Biafra (IPOB) was on Thursday brought to the Federal High Court in Abuja where his trial is expected to resume amidst tight security.\nAccording to reports, Kanu was brought to the Court on a black Sports Utility Vehicles at about 8am, although sitting had yet to commence as of the time of this report.\nFrom Transcorp Hilton through the Ministry of Justice and Abia House, security was beefed up with the presence of a combined team of Police, Army, Department of State Services operatives."
  },
  {
    "headline": "Breaking: Journalists, Lawyer barred as Nnamdi Kanu breezes into court",
    "summarized_story": "Nnamdi Kanu, the leader of Indigenous People of Biafra (IPOB) was on Thursday brought to the Federal High Court in Abuja where his trial is expected to resume amidst tight security.\nAhead of the trial of Kanu, heavy security has been deployed to forestall any breakdown of law and order.\nAll entrances leading to the court premises were barricaded by a combination of gun-weilding DSS operatives and men of the Nigerian Police.\nAt exactly 8:02am, a heavily fortified security convoy arrived and zoomed into the court premises, which many believed was the arrival of Kanu.\nAs at the time of filing this report, journalists and lawyers including Kanu’s lawyer have not been allowed to enter the court premises."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG To Roll Out Fresh Policy On Road Transportation, Mass Transit -NigPilot",
    "summarized_story": "Barring any unforeseen circumstances, the Federal Government will in a matter of weeks, take steps to regulate road transportation and mass transit vehicles operations in the country, Senator Gbemisola Saraki , Minister of State Transportation has disclosed.\n“This afternoon I was in a meeting that the Vice President Chaired and we are looking at how best to tackle the issue of road transportation.\nAnd with the fact that ACFTA is coming soon, in order for us to compete properly, we need to have a regulated road transportation system for commercial operators, which now comes to the manufacturers.\nI know that Lome and Cotonou have complained that the vehicles in Nigeria are below standard.\nAccording to Agwu, policy inconsistency is one problem that have cost the auto sector a whole lot of money."
  },
  {
    "headline": "Gov.Bello, Emir of Biu, Sanusi, others receive ‘Peace Achievers Awards’ -NigPilot",
    "summarized_story": "Governor of Kogi State, Yahaya Bello , Emir of Biu in Borno State, Mai Mustapha Umar Mustapha II and others, have received the 2021 Peace Achievers International Awards.\nThe award ceremony of the 10th edition of the annual award and peace summit was held at Nigerian Air Force Conference Centre in Abuja.\nof Kogi state bagged the ‘Governor of the Year on Peace and Security Award, while that of Akwa-Ibom clinched the award of ‘The Best Performing Governor: Industrialization and Peace Building.\n“The Peace Achievers International Awards is a private initiative of peace Ambassador Agency to recognize individuals and organisations in Africa who have demonstrated strong commitment in serving their communities.\nThe 10th edition of the Peace Achievers International Awards is supported through partnerships with the University of Benin,Cotonou, Chartered Institute of Management and leadership and the American Heritage University Southern California, USA."
  },
  {
    "headline": "NCPWD, Stakeholders begin development of curriculum, inclusive education -NigPilotNCPWD, Stakeholders begin development of curriculum, inclusive education",
    "summarized_story": "In a bid to eliminate discrimination against Persons with Disabilities, PWDs, The National Commission for Persons with Disabilities, NCPWD, has said it is working closely with the Ministry of Education, and other relevant Agencies to develop curriculum on disability and inclusive development.\nAcknowledging the huge task before the Commission, Lalu stressed,” How can we bring back out of school children with disabilities to school?\nWe have about 3.1million out of school children with disabilities that do not want to go to school.\nWhile speaking on the effort made so far, Lalu said NCPWD is working with the Education Ministry to ensure that every federal school is open for free education for PWDs.\nAlso, the National President, Association of the blind, Ishika Adamu said the curriculum will help close the gap in accessing Tertiary education for PWDs."
  },
  {
    "headline": "NYSC DG bags Sun award for Public Service -NigPilot",
    "summarized_story": "In a short video aired before the Award presentation, Management of the SUN Newspapers said General Ibrahim was considered for the award because of the unprecedented changes he has brought to the National Youth Service Corps as the 18th Chief Executive of the organisation.\nHis collaboration with several agencies and financial institutions that seek to empower members of the corps were also presented as attributes that make B rigadier General Ibrahim an exceptional leader deserving of the award.\nTwenty individuals were given awards for Public Service, Philanthropy, Business and Technology at the well-attended ceremony.\nBrigadier General Shuaibu was accompanied by his wife, Mrs Martina Ibrahim and some Directors to accept the Award at the 18th Sun Awards 2020.\nAnother winner in the same category was the Chairman of the National Drug Law Enforcement Agency (NDLEA), Brigadier General Buba Marwa rtd."
  },
  {
    "headline": "Nnamdi Kanu Pleads Not Guilty To FG’s Amended Charges",
    "summarized_story": "The embattled leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, has pleaded not guilty to the seven amended charges preferred against him by the Federal Government.\nKanu, who was re-arraigned at the Federal High Court in Abuja on Thursday, said he was innocent of all the allegations levelled against him.\nThe Federal Government recently amended the charges against him raising them to seven counts as against the five counts he was previously being tried for.\nREAD ALSO: Nnamdi Kanu Brought To Court For Trial Amid Heavy SecurityJournalists were denied entry into the courtroom where Kanu’s case was heard.\nMeanwhile, a source inside the courtroom, notified court reporters that the embattled IPOB leader took his fresh plea to the seven amended charges at about 10:45 am."
  },
  {
    "headline": "DSS Bars Journalists From Courtroom As Nnamdi Kanu Trial Resumes",
    "summarized_story": "The trial of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, resumed on a controversial note on Thursday with the Department of State Security (DSS) barring journalists and some court officials and lawyers from gaining access to the courtroom.\nNnamdi Kanu’s Special Counsel, Alloy Ejimakor while addressing journalists said the lawyers who accompanied him were denied access.\nNnamdi Kanu is facing charges bordering on terrorism and treasonable felony charges brought against him by the Federal Government.\nThe Federal Government had filed seven amended charges bordering on treasonable felony and acts of terrorism against Kanu on Monday.\nSubsequently, the trial judge fixed today, October 21, for hearing and insisted that the trial will not go on in his absence."
  },
  {
    "headline": "Court Watches Video Of 14-Year-Old Girl Allegedly Defiled by Baba Ijesha",
    "summarized_story": "The Lagos State Sexual Offences Court sitting in Ikeja has watched the video of the 14-year-old girl allegedly defiled by Nollywood actor James Olanrewaju, popularly known as Baba Ijesha.\nThe video showed the victim seated on a sofa and talking to the child expert, about how Baba Ijesha allegedly defiled her at her home and later inside his car.\nShe recalled that 7 years ago, Baba Ijesha was a regular visitor to her house.\nAfter this, she said Baba Ijesha used a handkerchief to clean himself while she went to the bathroom and used water, soap, and a towel to clean herself.\nShe said after this incident, she did not ṣee Baba Ijesha again for about seven years until April 19 this year when he suddenly appeared again ìn their new house."
  },
  {
    "headline": "Gunmen Kidnap Over 30 Passengers In Niger",
    "summarized_story": "Gunmen have abducted 30 passengers at Garin Gabas in Rafi Local Government Area of Niger State.\nChannels Television gathered that the victims were kidnapped on Wednesday in three separate vehicles comprising an eighteen-seater bus and two other vehicles.\nThe bandits in their large number carrying dangerous weapons stormed Zungeru Garin Gabas highway shooting sporadically to scare villagers before kidnapping the passengers to an unknown destination.\nWhen contacted, the Police Public Relations Officer in the state, DSP Wasiu Abiodun promised to get a call back to our reporters.\nThe gangs have been increasingly targeting schools, kidnapping students to squeeze ransom from authorities and parents."
  },
  {
    "headline": "Lawmakers In Benin Republic Vote To Legalise Abortion",
    "summarized_story": "Parliamentarians in Benin have voted to legalise abortion in the West African country, where it was already authorised under restricted conditions.\nPreviously, abortion was authorised if pursing the pregnancy “threatened the life of the mother”, was “the result of a rape or incest” or when “the unborn child has a particularly severe affection”.\nAfter a heated debate in parliament, with some lawmakers strongly opposed to legalising abortion further, the amendment finally passed.\n“In Benin, nearly 200 women die each year as the result of abortion complications,” said the health minister Benjamin Hounkpatin in a statement Thursday.\nThe influential Episcopal Conference of Benin said in a statement that it was “highly preoccupied by the proposed law to legalise abortions”AFP"
  },
  {
    "headline": "Baba Ijesha: Forensic video interview of alleged molested victim viewed in court",
    "summarized_story": "The third witness for the prosecution in the sexual assault trial of actor, Olanrewaju James has concluded her testimony.\nThe trial which started in June this year was heard before Justice Oluwatoyin Taiwo of the Lagos state Sexual and Special Offences Court in Ikeja.\nAnike Ajayi-Kayode of the Cece Yara Child Advocacy Centre told the court at the last hearing in September that she interviewed the alleged 14-year old victim who gave “a free recall” of the alleged acts of defilement by the defendant.\nOn Wednesday, the court viewed the recording of the forensic interview session of the witness and the child in question, whose names are withheld due to being underaged.\nThe minor was seen in the video being given two male and female dummies to demonstrate the alleged acts, which she did."
  },
  {
    "headline": "Gov Okowa congratulates Team Delta on winning 6th National Youth Games for sixth time",
    "summarized_story": "Governor of Delta State, Ifeanyi Okowa, has congratulated Team Delta on their outstanding achievement of winning the just-concluded 6th National Youth Games for the sixth time.\nHe praised the squad for its dedication and perseverance, which resulted in its historic dominance of the games, with the team winning all six editions since its inception.\nHe congratulated the athletes, their coaches and the management of Delta State Sports Commission on the great record, describing it as “stunning and unprecedented“.\nLagos State emerged second with a total of 72 medals comprised of 19 gold, 25 silver and 28 bronze.\nEdo finished third, winning 40 medals – 18 gold, 10 silver and 12 bronze."
  },
  {
    "headline": "830 persons kidnapped, 343 persons killed from July to September- Kaduna Govt",
    "summarized_story": "According to a security report presented to Kaduna State Governor Nasir El-rufai, 343 people were killed in the state owing to banditry and other violent attacks in the third quarter of 2021, that is from 1st July to 30th September this year.\nThis brings the number of persons killed by banditry and other violent attacks to 888 in the last nine months.\nAccording to the report, 69 bandits were killed by security operatives and 101 Kidnapped victims were also rescued within the period under review.\nSenior government officials, heads of security agencies, traditional leaders gathered at Council Chamber of Sir Kashim Ibrahim House in Kaduna State where the security report was presented.\nGovernor of Kaduna State, Nasir El-rufai said his administration is in support of the motion by the National Assembly for the declaration of bandits as terrorist."
  },
  {
    "headline": "EndSARS Anniversary: PDP remembers slain victims, condemns renewed brutalisation",
    "summarized_story": "The Peoples Democratic Party (PDP) joined Nigerians throughout the country on Wednesday in commemorating the dead victims of the 2020 “EndSARS” rallies against citizen brutality and terrible governance under the All Progressives Congress (APC) and President Muhammadu Buhari.\nThe PDP strongly condemned the ongoing brutalization of Nigerians by APC-controlled security forces, notably the violent assault on innocent youths in many areas of the nation during Wednesday’s EndSARS commemoration parade.\nEndSARS, according to the PDP, has become an epitaph of the APC’s and its administration’s evident cruelty, terrible brutality, torture, unlawful imprisonment, senseless extrajudicial executions, gagging, and repression of Nigerians during the previous six years.\n“It is shocking that, despite the promises to stop brutality and restore good governance, Nigerians who came out to march in remembrance of the victims of last year’s brutality were made to face the same trauma, if not worse brutality in the hands of security operatives.\nThe PDP expressed its condolences to the victims of the #EndSARS demonstrations in 2020 and 2021, and encouraged Nigerians to stay calm as they rally on the PDP’s platform to save the country and restore it to a path of justice, national cohesion, and economic success."
  },
  {
    "headline": "South Korea Joins Space Race with Launch of First Homegrown Rocket",
    "summarized_story": "South Korea has conducted the first test launch of its domestically built rocket, joining the ranks of advanced space-faring nations.\nOverseen by the Korea Aerospace Research Institute (KARI), NURI rocket was moved to its launch pad on Wednesday and raised into position.\nSpace launches have long been a sensitive issue on the Korean Peninsula, where North Korea faces sanctions over its nuclear-armed ballistic missile programme.\n“In the next few years, South Korea plans to develop and start operating a series of space launch vehicles from the NARO Space Centre, and these launch vehicles will be putting small vehicles into lower orbit, further increasing South Korea’s space defence capabilities,” he added.\n“Rockets are the only means available to mankind to go out into space,” Lee Sang-ryul, the director of the Korea Aerospace Research Institute, told South Korean newspaper Chosun Biz."
  },
  {
    "headline": "Anthony Joshua Trains with Mike Tyson’s Former Coach in America",
    "summarized_story": "Anthony Joshua has met with several American-based trainers as he considers a shake-up to his coaching set-up following his defeat by Oleksandr Usyk.\n“I guess he didn’t feel it was the right [gameplan against Usyk] so he wanted to make a change,” said Shields.\nJoshua has close ties within Hunter’s camp with British fighter Joshua Buatsi also training under the veteran coach.\nJermall Charlo works under Shields and posted several videos on his Instagram of Joshua speaking with his coach and doing some light training.\nJoshua was completely outclassed by Usyk and convincingly beaten after deciding to try and outbox the former undisputed cruiserweight champion."
  },
  {
    "headline": "Chelsea Pair Lukaku, Werner Out for ‘Some Matches’",
    "summarized_story": "Chelsea striker Romelu Lukaku and Timo Werner will both miss a few matches after being injured in the 4-0 Champions League win over Malmo, confirmed boss Thomas Tuchel.\nLukaku twisted his ankle in a tackle which led to a penalty and Werner hurt his hamstring while running – both in the first half.\nRecord signing Lukaku, 28, has not scored for Chelsea in seven games after four goals in his first four matches.\nGerman Werner, 25, has only scored twice in 10 games this season.\n“We have won games before without Werner and Lukaku, we don’t want these problems too often but it happens during a season.”"
  },
  {
    "headline": "Why Separatists in Cameroon and Nigeria Have United: BBC",
    "summarized_story": "Cameroon’s five-year conflict could be taking a significant new turn with reports that its English-speaking separatist groups are getting help from an armed group in neighbouring Nigeria.\nA woman walks into Nigeria from Cameroon at a checkpoint in Mfum, in Nigeria’s Cross Rivers State, in 2018.\nWeapons bound for the Anglophone region of Cameroon have often been seized by the Nigerian authorities.\nAt independence, its citizens were given a choice of joining either Nigeria or Cameroon.\nSouthern Cameroonians opted to unite with Cameroon, while Northern Cameroon joined Nigeria."
  },
  {
    "headline": "Covid Pandemic Will Drag on Deep into 2022 Because Poorer Nations Not Getting Vaccines: WHO",
    "summarized_story": "The Covid pandemic will “go on for a year longer than it needs to” because poorer countries are not getting the vaccines they need, the World Health Organization (WHO) says.\nDr Bruce Aylward, senior leader at the WHO, said it meant the Covid crisis could “easily drag on deep into 2022”.\nThe vast majority of Covid vaccines overall have been used in high-income or upper middle-income countries.\nHe said wealthy countries needed to “stocktake” where they were with their donation commitments made at summits such as the G7 meeting in St Ives this summer.\nThe Canadian government was keen to stress that it had now ceased to use Covax vaccines."
  }
]