[
  {
    "headline": "Niger Delta pleased to have a dynamic king, Jonathan hails Olu of Warri",
    "summarized_story": "Former President Goodluck Jonathan has congratulated the 21st Olu of Warri, Atuwatse 111 on his ascension to the throne of Warri kingdom.\nJonathan gave the congratulatory message when he visited the Olu at his palace on Saturday in Warri.\nSo I said I should come to pay my respects to the Olu of Warri.\n“I have been close to the palace and I appreciate what the Olu of Warri stands for in the leadership system.\nWe are pleased to have a dynamic king in the Niger Delta."
  },
  {
    "headline": "Fresh Kabul airport attack likely within 36 hours, Biden warns",
    "summarized_story": "US military commanders believe that another terror attack like the deadly suicide bombing at Kabul airport is “highly likely in the next 24-36 hours,” President Joe Biden warned Saturday.\nOur commanders informed me that an attack is highly likely in the next 24-36 hours,” Biden said.\nUS troops have been scrambling in dangerous and chaotic conditions to complete a massive evacuation operation from the Kabul airport by an August 31 deadline.\nHe said Saturday that the drone attack would not be the last.\n“Whenever anyone seeks to harm the United States or attack our troops, we will respond."
  },
  {
    "headline": "Abiodun congratulates Obasanjo on his appointment as AU’s High Representative",
    "summarized_story": "By James OgunnaikeOgun State Governor, Prince Dapo Abiodun has congratulated Nigeria’s former President, Chief Olusegun Obasanjo, on his appointment as the High Representative of the African Union in the Horn of Africa.\nThe Horn of Africa region covers countries in the eastern region of Africa – Djibouti, Eritrea, Ethiopia, Somalia, Kenya, Sudan, South Sudan and Uganda are countries covered in this region.\nMahamat explained that the appointment is to ensure peace, security and political dialogue across the Africa region.\nAbiodun noted that the appointment did not come to him as surprise, given the various interventions and engagements of Obasanjo in several African countries to ensure peace and stability.\nHe, however, prayed God to give Obasanjo good health and wherewithal to excel in his appointment as High Representative of the AU."
  },
  {
    "headline": "Katsina receives 21,040 doses of AstraZeneca vaccine – Official",
    "summarized_story": "Katsina State Government says it has recieved 21,040 doses of AstraZeneca COVID-19 vaccines for the second phase vaccination exercise across the 34 Local Government Areas of the state.\nYahaya recalled that the state government in March received 107,504 doses of the AstraZeneca vaccine for the first phase of the vaccination exercise.\n“Katsina State Government on Saturday Aug. 28 received 21,040 doses of AstraZeneca COVID-19 vaccine.\n”Under the first phase of the vaccination exercise, AstraZeneca vaccine was administered to the frontline health workers and strategic leaders,” he said.\nYahaya said the state government on Aug. 20 equally received 92,370 doses of Moderna vaccine allocated to the state by the Federal Government."
  },
  {
    "headline": "Ortom: Soyinka blasts NBC over query to Channels TV",
    "summarized_story": "By Olasunkanmi AkoniNobel laureate, Prof. Wole Soyinka, has expressed surprise over the query issued by the National Broadcasting Commission to Channels Television following an interview where Benue State Governor Samuel Ortom criticised President Muhammadu Buhari.\n“I think all of you have seen the letter sent by the National Broadcasting Corporation to Channels TV.\nReading a part of the letter the NBC sent to Channels TV, which says “the broadcaster shall ensure that its presenter shall handle with professionalism and sound judgement,” Soyinka expressed dismay over the over-zealousness of officials of the NBC.\n“Professionalism and sound judgement?\nIs the National Broadcasting Commission the mass communication fora?"
  },
  {
    "headline": "PDP calls for investigation into alleged Rivers boat shooting",
    "summarized_story": "The Peoples Democratic Party (PDP) has condemned the alleged shooting of a civilian market boat ferrying foodstuffs and other household goods in Dutch Island area of Rivers.\nThe party stated this in a statement issued by its National Publicity Secretary, Mr Kola Ologbondiyan, in Abuja on Saturday also called for investigation into the incident.\nThat party said it was alarmed by reports of how military helicopter allegedly shot at civilians, who were ferrying foodstuffs and household items from Nembe-Bille jetty.\nPDP called for an immediate and comprehensive investigation into what he described as a “terrifying incident” .\nThe party also called for calm as the authorities unravel the circumstances surrounding the incident."
  },
  {
    "headline": "Buhari mourns legendary music artist, Sir Victor Uwaifo",
    "summarized_story": "By Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari has condoled with family, friends and associates of legendary musician and multi-talented artiste, Sir Victor Uwaifo, who passed on Saturday, leaving a legacy of successes in many areas of life, including academia and administration.\nPresident Buhari said he believes the renowned musician, with global appeal and recognitions, lived for many firsts, which include invitation to the State House by four presidents and Heads of State, and winner of a gold disc in Africa for his song, “Joromi’’, released in 1965 at the age of 24.\nThe President noted the glory that Sir Uwaifo brought to Nigeria through his international tours, and the active role he played in national development, returning to school to get a first degree at age 54 with first class honours, masters degree at 56, and a doctorate at 77.\nPresident Buhari prayed for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecturer, knowing the entire country, particularly the music industry, will sorely miss him.\nVanguard News Nigeria"
  },
  {
    "headline": "Flood: FG announces partial closure of Kano – Jigawa road",
    "summarized_story": "The Federal Government has announced the immediate partial closure of Kano-Jigawa road due to bridge collapse.\nThis was contained in a press statement by the Ministry of Works and Housing issued to newsmen.\nIt said the Federal Government will close the road to traffic on Monday 30th August, 2021, for the repair of the bridge damaged by flood recently.\nDAILY POST reported that about twenty one person died after the bridge collapsed along Bauchi-Gwaram road, in Jigawa State.\nIt urged the road users to cooperate with contractors, as the blockage of the road will give an opportunity to complete the work within short time."
  },
  {
    "headline": "Channels Tv: Why we invited ex-Navy Commodore, Olawummi – DHQ",
    "summarized_story": "The Defence Headquarters has debunked reports that Commodore Kunle Olawunmi (rtd) was declared wanted by the Defence Intelligence Agency over anti-Buhari interview.\nThe Director Defence Information Major General Benjamin Sawyerr, in a statement on Saturday, said Olawunmi was only invited via a text message to share intelligence with the Armed Forces in order to fight terrorism and banditry.\nThere is a Sahara reporters online news that The DIA has ordered for the arrest of Cdre Olawunmi rtd.\n“Also recall that the CDS has just concluded his tour of the 6 Geo-Political Zones where he solicited for the support and cooperation of retired military officers.\n“We are issuing a statement soon,” the statement added."
  },
  {
    "headline": "KWASU confirms rescue of abducted 300-level female student",
    "summarized_story": "The Vice-Chancellor of the Kwara State University, Malete, Professor Mohammed Mustapha Akanbi, SAN, has expressed gratitude over the successful rescue of the abducted 300-level female student of the institution, Isiaq Khadeejah.\nKwara: Gunmen kidnap KWASU female student in MaleteIt further stated that “the Dean of Students’ Affairs, Professor Moshood Jimba and some staff of the University were at the state police headquarters to take possession of the released victim and subsequently reunited her with her family.”The Vice-Chancellor received the rescued student in his official lodge in Ilorin shortly after her handover to the University authorities by the police.\nHe appealed to the staff and students within and outside the campus to remain calm and go about their lawful activities with caution as the management would not relent in ensuring safety of lives and properties on the campus.\nDAILY POST recalls that the state police command through the spokesman, Okasanmi Ajayi, first broke the news about the release of the kidnapped student through the combined efforts of the IGP team, local hunters, vigilantes and the university authorities.\nThe image maker also revealed that six suspects are now in police net in connection with the kidnap incident, while categories of weapons were recovered from them."
  },
  {
    "headline": "Insecurity: Nigerians know who is promoting genocide – Ortom blows hot",
    "summarized_story": "Benue State Governor, Samuel Ortom says the narrative by the presidency that his position on the state of the nation amounts to preaching genocide in the country does not hold water.\nThe Governor said rather, the Federal Government through the presidency is promoting genocide by deliberately nicknaming Fulani Militia killers across the country as bandits in order to hide their identity, stressing that doing so would only aggravate killings and food insecurity.\nGovernor Ortom spoke on Saturday in Gboko during the closing ceremony of prayer, praises and thanksgiving for God to address the challenges confronting the Tiv nation and Nigeria at large.\nThe Governor said the one week prayers, praises and thanksgiving to God would not go in vain as God would cause a remarkable thing to happen in Tiv land, Benue and Nigeria at large.\nHe, however, charged the Tiv nation to persevere in prayers and increase their faith in God but garnish same with works as faith without works is dead."
  },
  {
    "headline": "Insecurity: Insincerity of government, security agencies behind worsening situation – Sen. Gyang",
    "summarized_story": "The Senator representing Plateau North, Istifanus Gyang has attributed the inability to tackle the myriad of security challenges bedeviling the country to lack of sincerity of purpose on the part of government and security agencies.\nHe pointed out that the killings in his constituency and other parts of the country was a demonstration of the failure of governance.\n“It is not an issue of two fightings, it is not.\nGyang implored President Muhammadu Buhari and other relevant security operatives to take the interview granted the Channel TV by a retired Naval Officer very serious and work on the statement to change the narratives of insecurity in the country.\n“All he said are known to everybody in the intelligence and government circle that it is lack of sincerity of purpose that has been the bane of the inability of our armed forces to tackle terrorism”, he stressed."
  },
  {
    "headline": "NMA, Resident Doctors, others threaten indefinite strike by Sept. 18",
    "summarized_story": "“The crux of the matter was the Nigeria Association of Resident Doctors’ strike, and the memorandum of understanding (MoU) signed with the NMA.\n“However, the highlight of the meeting was item number 6, which was the NARD strike.\n“If the government does not resolve all pending issues before those 21 days, the NMA will be left with nothing than to join the doctors – NARD, MDCAN, MEDSABAM, in a total indefinite strike.\n“All hope was that the meeting of last week where all the affiliates of the Nigerian Medical Association (NMA) except NARD signed the MOU would resolve the strike.\n“Our plan was to meet first with the NMA, NARD and the Ministry of Health before coming to you."
  },
  {
    "headline": "Of death and Captain ‘Hosa’s transfiguration",
    "summarized_story": "The transfiguration of my big brother, Captain Idahosa Wells Okunbo, in the morning of Sunday, August 8, 2021 was triumphalist.\n‘Hosa (aka Cappi) only laughed death to scorn in transcendence, knowing full well that he lives in hearts.\nHe would occasionally add: “My brother Ojeifo is a brilliant journalist and writer.” I thank Cappi for the monumental confidence he reposed in me.\nI love Cappi with the love of God.\nAnd, this applies to every mortal being….”Cappi had already demonstrated his readiness to laugh death to scorn."
  },
  {
    "headline": "DisCos get NERC approval to increase tariff September 1",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has directed the 11 Electricity Distribution Companies (DisCos) to increase their tariff effect from 1st September, 2021.\nThe commission in a letter titled ‘Tariff Increase Notification’ gave the energy distributors the leverage to charge a service based tariff.\nAbuja Electricity Distribution Company (AEDC), General Manager, Corporate Services, Mr. Oyebode Fadipe, also did not respond to our correspondent’s call and text message at press time.\nEko Electricity Distribution Plc, has however denied sending out information regarding hiking its tariff.\nEko Electricity Distribution Plc would like to inform the general public to disregard all such reports not emanating from the management or the company’s website – www.ekedp.com."
  },
  {
    "headline": "Zulum: Borno in ‘Catch-22 situation’ over Boko Haram’s surrender",
    "summarized_story": "With the latest offensive on Boko Haram insurgents and bandits in Borno and it’s environ from its earlier defensive position, the Nigerian military hot chase iS yielding dividends.\nIn the address: “Borno is in “CATCH-22 OVER BOKO HARAM’S SURRENDER,” Governor Zulum stated that Boko Haram fighters had left Borno in two extreme difficult situations in the ongoing surrender of some of its members.\n“”We (in Borno) are in a very difficult situation over the ongoing surrender by insurgents.\nReacting to Zulum’s address in its Editorial of Friday, August, 20, 2021, The Nation Newspaper pointed out that the surrendered Boko Haram cadres must face justice.\n“No one can question Governor Zulum’s bona fides, on the destruction Boko Haram wrought in Borno."
  },
  {
    "headline": "Men run after me because of my plus-size – Mary John, actress",
    "summarized_story": "By Rita OkoyeBeautiful plus-size actress-cum-social media influencer, Mary John, has opened up on her sojourn in Nollywood, her love life, unique selling points and other issues.\nAs a plus size TV star, what are the issues you encounter on and off set?\nWhat are the main difficulties people of plus size encounter?\nIn Nollywood, Funke Akindele because she’s a strong woman with a funny character.\nI am a plus size model, an interior decorator and social media influencer."
  },
  {
    "headline": "PDP governors joining APC signal we’ll retain power in 2023 – Senator Osita Izunaso",
    "summarized_story": "Why should I entertain any fear when the governors of the PDP are joining us, the APC, on their own?\nSo, what is wrong in attending the meeting as major stakeholders of Imo State?\nIt is a misinterpretation of what is going on in the Imo APC.\nThe most popular person to govern Imo State is no longer alive, yet people still talk about him.\nAs a member of the Campaign Committee for Anambra governorship election, are you comfortable with the aftermath of the state party primaries?"
  },
  {
    "headline": "Highlife maestro, Sir Victor Uwaifo, dies at 80",
    "summarized_story": "From‎ Tony Osauzo, BeninOne of Nigeria’s music legends and highlife maestro, Sir Victor Uwaifo, is dead.\nOne of his children, Uwaifo Peter de Rock, broke the news of the demise of the Professor of Visual Arts, University of Benin, on his Facebook page, yesterday evening.\nDid you leave us now Prof Sir Victor Uwaifo has gone to rest.\n“One week now after collaborating with me”, the distraught younger Uwaifo added.\nSir Victor Uwaifo played the guitar with dexterity and displayed kinetic dancing steps in his heydays."
  },
  {
    "headline": "Reasons we formed Pentecostal Ministers Forum –Bishop Jerry Anthony",
    "summarized_story": "The President of Pentecostal Ministers Forum (PMF) expressed concern over the level of decay in Nigeria and called on Church leaders to unite to save the country from collapse.\nAs a pentecostal bishop, it is expected that you should belong to the Pentecostal Fellowship of Nigeria (PFN) and Christian Association of Nigeria (CAN), why then did you form PMF that looks like a parallel group?\nHow are the faith fathers the cause of what the church is going through in Nigeria?\nIs PFN and CAN’s non-participation at late T B. Joshua’s burial, part of the problems church leaders you are taking about?\nJoshua was a wizard, I wish I will know where the wizard is, so that I can join."
  },
  {
    "headline": "Military declares retired Naval Officer wanted",
    "summarized_story": "If you go to Defence Headquarters, I served at the Defence Headquarters as the Deputy Director, Defence Administration, between 2015 and 2017, throughout my two years at Defence Headquarters, I received visitors twice because of the strict security architecture there but every Friday, the gate of the Defence Headquarters is thrown wide open for everybody to come in and observe Juma’at.\nI have served the military intelligence for the past 35 years.\n“I told them that the centre of gravity of Boko Haram in Nigeria is the sponsors of the programme.\n“Recently, 400 people were gathered as sponsors of Boko Haram, why is it that the Buhari government has refused to try them?\n“You remember this Boko Haram issue started in 2012 and I was in the military intelligence at that time."
  },
  {
    "headline": "From Kabul to Kaduna",
    "summarized_story": "For the Taliban, the terrorist attack at Kabul airport poses an instant credibility problem of immense proportions.\nLike the Taliban, Boko Haram subscribes to a medieval version of Islam which abhors western education and modernization.\nThere is a contrary belief that sees the so-called bandits as the roving department of the larger Boko Haram jihadist movement.\nThe most intense theatre of bandit interest seems to be Kaduna state and Kaduna city.\nThe highway between Abuja and Kaduna has become a favourite operational thoroughfare and playground of all manner of bandits and gunmen."
  },
  {
    "headline": "Legendary Nigerian Musician, Victor Uwaifo, Dies at 80",
    "summarized_story": "By Vanessa ObiohaLegendary musician, Sir Victor Uwaifo, who was the first Commissioner for Arts, Culture and Tourism in Nigeria, is dead.\nUwaifo was born in Benin City, Edo State, Nigeria and obtained his secondary school education at the Western Boys’ High School Benin and St Gregory’s College, Lagos, from 1957 to 1961.\nWhile in St Gregory’s College, he played music and was among the leading Lagos high school bandleaders.\n“Victor Uwaifo was one of a kind, a true renaissance man who effortlessly wore multiple hats be it as a musician, sculptor, inventor, politician or educator.\nSir Victor Uwaifo, the ‘Guitar Boy’ was a force of nature, his charm and charisma were infectious and disarming.”Interestingly, in a career that spanned over 60 years, he amazingly kept a clean slate and was scandal-free."
  },
  {
    "headline": "Fake Digital Edition of THISDAY Friday, 27 August 2021 in Circulation on Social Media",
    "summarized_story": "PRESS STATEMENTFake Digital Edition of THISDAY Friday, 27 August 2021 in Circulation on Social MediaThe attention of the Management of THISDAY has been drawn to a fake version of our digital edition making the rounds on some social media platforms.\nWith the headline: “Shocking: Uzodinma declares Free Marriage Between Fulani Settlers and Imo Ladies”, this fake version of our digital edition is being circulated on WhatsApp, Facebook and other social media platforms.\nOur lead story on Friday, August 27 was, “Buhari Elated as NNPC Breaks Jinx, Declares N287bn Profit, First in 44 Years”.\nSadly, these merchants of fake news have chosen to leverage on the credibility and integrity of THISDAY to ply their trade.\nFor the avoidance of doubt, readers can easily verify our Friday publication from the print edition, or online (www.thisdaylive.com)."
  },
  {
    "headline": "FAKE NEWS ALERT!",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Secondus Complies With New Court Order, Asks Akinwonmi to Preside over PDP’s NEC Meeting",
    "summarized_story": "By Chuks OkochaIn compliance with the second court order that restrained him from presiding over the National Executive Committee (NEC) meeting, National Chairman of the Peoples Democratic Party, Prince Uche Secondus, has asked his deputy(South), Elder Yemi Akinwonmi, to preside over the NEC meeting.\n￼The injunction granted by a Cross River High Court also barred the PDP from allowing Secondus to function as national chairman or preside over the NEC meeting of the party.\nSecondus had obtained a Kebbi High Court order to reinstate him as national chairman last Thursday following an earlier injunction obtained against him from a Rivers State High Court.\nHe was also specifically barred from the NEC meeting holding on Saturday.\nThe NEC meeting is expected to end the Secondus era with the affirmation of plans for the National Convention now agreed to hold in October."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING Defence Intelligence Agency Declares Retired Commodore Olawunmi Wanted Over Channels TV’s Anti-Buhari’s Interview, May Seize International Passport",
    "summarized_story": "The Defence Intelligence Agency is the primary military intelligence agency of Nigeria.\n“The agency has declared retired Navy Commodore Kunle Olawunmi wanted for spilling the beans over Boko Haram sponsors in the Buhari regime.\nIf you go to Defence Headquarters, I served at the Defence Headquarters as the Deputy Director, Defence Administration, between 2015 and 2017, throughout my two years at Defence Headquarters, I received visitors twice because of the strict security architecture there but every Friday, the gate of the Defence Headquarters is thrown wide open for everybody to come in and observe Juma’at.\nI have served the military intelligence for the past 35 years.\n“You remember this Boko Haram issue started in 2012 and I was in the military intelligence at that time."
  },
  {
    "headline": "BREAKING Defence Intelligence Agency Declares Retired Commodore Olawunmi Wanted Over Channels TV’s Anti-Buhari’s Interview, May Seize International Passport",
    "summarized_story": "The Defence Intelligence Agency is the primary military intelligence agency of Nigeria.\n“The agency has declared retired Navy Commodore Kunle Olawunmi wanted for spilling the beans over Boko Haram sponsors in the Buhari regime.\nIf you go to Defence Headquarters, I served at the Defence Headquarters as the Deputy Director, Defence Administration, between 2015 and 2017, throughout my two years at Defence Headquarters, I received visitors twice because of the strict security architecture there but every Friday, the gate of the Defence Headquarters is thrown wide open for everybody to come in and observe Juma’at.\nI have served the military intelligence for the past 35 years.\n“You remember this Boko Haram issue started in 2012 and I was in the military intelligence at that time."
  },
  {
    "headline": "Any South-Easterner Who Becomes President Will Fail Under Present Conditions – Bishop Mike Okonkwo",
    "summarized_story": "Mike Okonkwo, the presiding Bishop of The Redeemed Evangelical Mission (TREM), has said the South-East should not produce a presidency on the grounds of pity.\nHe pointed out that the South-East should not allow themselves to produce a president so they can be appeased.\nComrade Igboayaka Igboayaka, the National President Ohaneze Youth Council, OYC, said an Igbo presidency would favour Nigerians more.\nMeanwhile, Governor Nasir El-Rufai of Kaduna State said the country’s Southern part should be allowed to produce Nigeria’s next president.\nHowever, Northerners have insisted that the North still has four years at the end of President Muhammadu Buhari’s second tenure."
  },
  {
    "headline": "Kano teenager convicted of killing husband gets pardon -- seven years after sentencing",
    "summarized_story": "Rahma Hussein, a 23-year-old woman, has been pardoned seven years after she was convicted for killing her husband.\nAdvertisementIn 2014, Hussein, then a 16-year-old, was arrested and charged to a high court in Kano for stabbing her husband to death a day after their wedding.\nSpeaking in tears after her pardon, Hussein thanked the committee, Ganduje and officials of the correctional centre for facilitating her freedom.\nThe officials of the correctional centres, who recommended me to be beneficiary of this gesture, may Allah reward you abundantly,” she said.\n“I’m also grateful to governor Ganduje for his mercy on me."
  },
  {
    "headline": "Kano teenager convicted of killing husband gets pardon -- seven years after sentencing",
    "summarized_story": "Rahma Hussein, a 23-year-old woman, has been pardoned seven years after she was convicted for killing her husband.\nAdvertisementIn 2014, Hussein, then a 16-year-old, was arrested and charged to a high court in Kano for stabbing her husband to death a day after their wedding.\nSpeaking in tears after her pardon, Hussein thanked the committee, Ganduje and officials of the correctional centre for facilitating her freedom.\nThe officials of the correctional centres, who recommended me to be beneficiary of this gesture, may Allah reward you abundantly,” she said.\n“I’m also grateful to governor Ganduje for his mercy on me."
  },
  {
    "headline": "PDP NEC silent on Secondus, to decide on zoning for NWC positions Sept 9",
    "summarized_story": "The Peoples Democratic Party (PDP) says zonal positions for the national working committee (NWC) will be decided on September 9.\nAdvertisementKola Ologbondiyan, spokesperson of the PDP, disclosed this on Saturday after a closed-door meeting of the national executive committee (NEC) in Abuja.\nAdvertisementThe PDP spokesperson was, however, silent on the decision of the NEC on Uche Secondus, the embattled national chairman of the party.\n“NEC has resolved that Abuja will be the venue of the PDP national convention slated for October 31, 2021.\nBut on Friday, a high court sitting in Cross River state barred Secondus from resuming office as the national chairman of the PDP."
  },
  {
    "headline": "PDP NEC silent on Secondus, to decide on zoning for NWC positions Sept 9",
    "summarized_story": "The Peoples Democratic Party (PDP) says zonal positions for the national working committee (NWC) will be decided on September 9.\nAdvertisementKola Ologbondiyan, spokesperson of the PDP, disclosed this on Saturday after a closed-door meeting of the national executive committee (NEC) in Abuja.\nAdvertisementThe PDP spokesperson was, however, silent on the decision of the NEC on Uche Secondus, the embattled national chairman of the party.\n“NEC has resolved that Abuja will be the venue of the PDP national convention slated for October 31, 2021.\nBut on Friday, a high court sitting in Cross River state barred Secondus from resuming office as the national chairman of the PDP."
  },
  {
    "headline": "Atiku: PDP crisis management more efficient than APC government",
    "summarized_story": "Atiku Abubakar, former vice-president, says the crisis management process in the Peoples Democratic Party (PDP) is “more efficient” than the government of the All Progressives Congress (APC).\nAdvertisementAbubakar spoke on Saturday before the national executive committee (NEC) meeting of the PDP in Abuja.\nThe former presidential candidate of the PDP, who was commenting on the crisis in the opposition party, said the PDP has always overcome its challenges because the party has the “most competent” individuals.\n“Don’t be surprised that we always try to overcome our internal crisis because if you look at PDP, it has the most experienced people in this country.\nAdvertisement“Therefore, PDP’s internal crisis management is far efficient and far better than APC and even the APC government itself."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "PDP national convention to hold in Abuja – NEC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The National Executive Council of the Peoples Democratic Party (PDP) has approved Abuja as venue for the party’s elective national convention scheduled for Oct. 30 and Oct. 31.\nThe Party National Publicity Secretary, Mr Kola Ologbondiyan, disclosed this while reading the resolutions of the party’s 92nd NEC meeting held on Saturday in Abuja.\n“NEC has resolved that Abuja will be the venue of the PDP national elective convention slated for Oct. 30.\n“NEC will meet on Sept. 9, to approve the various nominations into the respective national convention committees.\n“I am sure that a new government of our party can return our nation to the path of peace stability and progress.”At the meeting were PDP governors, NEC members, BoT members, National Assembly caucus and states chairmen."
  },
  {
    "headline": "Obaseki mourns death of legendary musician, Prof. Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of legendary musician and art teacher, Prof. Victor Uwaifo, whose death was reported Saturday evening.\nThe governor, in a statement, expressed shock and sadness over the news of the passing of Prof. Uwaifo, noting that his death was a loss to Edo State, Nigeria and the Black Race.\nAccording to him, “I received the news of the loss of legendary musician and art teacher, Prof. Victor Uwaifo, with shock and sadness.\n“He was talented, phenomenal and an illustrious son of Edo State who wowed the world with his array of skills, notably his music talent.\n“An all-round artist, Prof. Uwaifo was an enigma, who made music for all, bringing the contemporary Benin culture to the world stage and providing vicarious experience of the peculiarities of our art and culture to a global audience.”The governor prayed that God will grant the Uwaifo family, friends, associates and well wishers the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Edo Poly, ISPON set up Centre for Safety Studies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, and the Institute of Safety Professionals of Nigeria (ISPON) have set up a Centre for Safety Studies at the polytechnic to offer top-of-the-range training in Health, Safety and Environment (HSE).\nThe Rector of the Polytechnic, Prof. Abiodun Falodun, in a chat with journalists in Benin City, said the development is in line with the institution’s plan to become a go-to-place for technical education.\nAccording to him, “We have entered a partnership for the joint establishment of a Centre for Occupational Health, Safety, Security and Environmental Studies with the aim of jointly providing safety and allied training and certification for final year students of the Edo State Polytechnic to enhance their utilization in the public and private sectors upon their graduation.\nThis agreement also covers part-time students that may be admitted from time to time.”He added that the nature of education at the center includes trainings, lectures, seminars and workshops for basic health, Safety, Security and Environment (HSE), adding that the new centre adds to the wide array of professional education offered by the institution to contribute to the development and growth of the state and the country at large.\nProf. Falodun said the institution will continue to pursue similar partnerships to expand the scope of professional training at the polytechnic and provide a path for career growth for upwardly mobile professionals."
  },
  {
    "headline": "Edo, Delta to set up Bendel Commission to foster mutual cooperation on security, economy, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing discussions with the Delta State Government to establish a Bendel Commission to foster mutual cooperation and collaboration in economic, security, cultural and environmental matters between the two states.\nObaseki disclosed this during a live broadcast to commemorate the 30th anniversary of Edo State.\nTo achieve our mission of MEGA comprehensively, we must involve our kit and kin in Delta State.\n“We are therefore commencing discussions to establish a Bendel Commission to foster mutual cooperation and collaboration in economic, security, cultural and environmental matters between Edo and Delta States,” he noted.\nWe have continued to invest in our youth through various programs spearheaded by the Edo Skills Development Agency (EdoJobs), which has given birth to numerous enterprises in the Edo Production Centres, Edo Tech Hub and Edo Creative Hub."
  },
  {
    "headline": "Buhari mourns Uwaifo",
    "summarized_story": "ADVERTISEMENTPresident Muhammadu Buhari has condoled with family, friends and associates of legendary musician and multi-talented artiste, Victor Uwaifo, who passed on Saturday.\nThe president in a condolence message by his Special Adviser on Media and Publicity, Femi Adesina, on Saturday in Abuja, noted that the deceased left a legacy of successes in many areas of life, including academia and administration.\nMr Buhari joined the Nigerian music industry and performing artistes, home and abroad, in mourning the former first Commissioner for Arts, Culture and Tourism (Edo), who was also the first musician and instrumentalist to be given National Honours Merit, Member of the Order of the Niger (MON) in 1983.\nThe president believed the renowned musician, with global appeal and recognitions, lived for many firsts, which include invitation to the State House by four presidents and Heads of State, and winner of a gold disc in Africa for his song, “Joromi’’, released in 1965 at the age of 24.\nHe noted the glory that Mr Uwaifo brought to Nigeria through his international tours “and the active role he played in national development, returning to school to get a first degree at age 54 with first class honours, masters degree at 56, and a doctorate at 77.’’Mr Buhari prayed for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecturer, knowing the entire country, particularly the music industry, would sorely miss him."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Eligible customer regulation is still in force on eligible customer transactions – NERC",
    "summarized_story": "ON SEEKING ELIGIBLE CUSTOMER STATUSThe Eligible Customer Regulations was designed to provide a very simple process for securing eligibility status from the Commission for customer whose consumption is in excess of the minimum threshold of 2MWh/h over a period of one month.\n– The supplier (GenCo OR trading licensee) to the potential eligible customer should possess an unencumbered generation capacity to sell to other customers.\nThis is to ensure a continuity of supply to the eligible customer, in the event of a disruption by the contracted GenCo.\nOther reasons constraining the grant of eligible customer status to some major consumers of electricity include various litigations and/or objections to applications filed with the Commission.\nWe are committed to granting timely approvals to all applicants who have met the conditions for eligibility status as provided in the eligible customer regulations."
  },
  {
    "headline": "Legendary Nigerian musician Victor Uwaifo dies at 80",
    "summarized_story": "Celebrated Nigerian highlife musician, Sir Victor Uwaifo has died, aged 80.\nUwaifo died on Saturday in Benin, capital of Edo State, South-South, Nigeria, one of his children, Uwaifo Peter de Rock, said on his social media page on Saturday evening.\nProf sir Victor UWAIFO has gone to rest.\nThe late musician was Professor of Visual Arts at the University of Benin.\nSir Victor Uwaifo played the guitar with dexterity and he is known for his dancing steps."
  },
  {
    "headline": "U.S. residents indicted for attempts to illegally export arms to Nigeria",
    "summarized_story": "Three residents of Maryland, United States, face indictment for attempting to illegally export arms and ammunition to Nigeria.\nThe Department of Justice, U.S. Attorney’s Office, District of Maryland said the suspects allegedly exported arms and ammunition without obtaining export licenses, in violation of the Arms Export Control Act and the Export Reform Control Act.\nThe announcement, release on Friday, states:A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria.\nFinally, the indictment alleges that the defendants transported 28 firearms with obliterated serial numbers, including 18 rifles.\nActing United States Attorney Jonathan F. Lenzner commended HSI and the ATF for their work in the investigation."
  },
  {
    "headline": "Zenith Bank proposes N9.42bn interim dividend for half year 2021",
    "summarized_story": "Zenith Bank Plc has proposed to pay the total sum of N9.42 billion as interim dividends to its shareholders for the half year period ended 30th of June, 2021.\nThe interim dividend will be paid electronically to shareholders on the 20th of September, 2021, subject to appropriate withholding tax.\nShareholders must have completed the e-dividend registration and must have mandated the Registrar (Veritas Registrar Limited) to pay their dividends directly into their bank accounts.\nTo facilitate the payment, the financial giant noted that its register of shareholders will be closed on 13th of September, 2021.\nZenith had declared a half year profit of N106.12 billion in HY 2021, indicating a slight increase of about 2.2% YoY."
  },
  {
    "headline": "Buhari pays tribute to Grillo, veteran artist",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari extends heartfelt condolences to the Grillo family, friends, associates and art lovers on the passing of Professor Yusuf Adebayo Cameron Grillo, the pioneer Head of the Department of Art and Printing, Yaba College of Technology.\nFrom his stained glass paintings, to showcasing the rich Yoruba culture and heritage in his works, the President believes that the legendary artist and founding President of the Society of Nigeria Artists (SNA) was a master in promoting creativity and raising awareness on the beauty in indigenous traditions.\nThe President affirms that one of the greatest legacies of Grillo was his devotion to educating and mentoring a younger generation, who, expectedly, through the power of the visual arts will continue to promote dialogue, understanding and appreciation of the uniqueness of the Nigerian society.\nThe President prays for the repose of the soul of the departed and comfort for his many fans that will sorely miss him.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari pays tribute to Grillo, veteran artist",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari extends heartfelt condolences to the Grillo family, friends, associates and art lovers on the passing of Professor Yusuf Adebayo Cameron Grillo, the pioneer Head of the Department of Art and Printing, Yaba College of Technology.\nFrom his stained glass paintings, to showcasing the rich Yoruba culture and heritage in his works, the President believes that the legendary artist and founding President of the Society of Nigeria Artists (SNA) was a master in promoting creativity and raising awareness on the beauty in indigenous traditions.\nThe President affirms that one of the greatest legacies of Grillo was his devotion to educating and mentoring a younger generation, who, expectedly, through the power of the visual arts will continue to promote dialogue, understanding and appreciation of the uniqueness of the Nigerian society.\nThe President prays for the repose of the soul of the departed and comfort for his many fans that will sorely miss him.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Three American indicted for attempts to illegally export arms to Nigeria",
    "summarized_story": "Three residents of Maryland, United States of America, face indictment for attempting to illegally export arms and ammunition to Nigeria.\nAccording to the Department of Justice, U.S. Attorney’s Office, District of Maryland, the suspects allegedly exported arms and ammunition without obtaining export licenses, in violation of the Arms Export Control Act and the Export Reform Control Act.\nThe announcement, release on Friday, states:A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria.\nFinally, the indictment alleges that the defendants transported 28 firearms with obliterated serial numbers, including 18 rifles.\nActing United States Attorney Jonathan F. Lenzner commended HSI and the ATF for their work in the investigation."
  },
  {
    "headline": "Three American indicted for attempts to illegally export arms to Nigeria",
    "summarized_story": "Three residents of Maryland, United States of America, face indictment for attempting to illegally export arms and ammunition to Nigeria.\nAccording to the Department of Justice, U.S. Attorney’s Office, District of Maryland, the suspects allegedly exported arms and ammunition without obtaining export licenses, in violation of the Arms Export Control Act and the Export Reform Control Act.\nThe announcement, release on Friday, states:A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria.\nFinally, the indictment alleges that the defendants transported 28 firearms with obliterated serial numbers, including 18 rifles.\nActing United States Attorney Jonathan F. Lenzner commended HSI and the ATF for their work in the investigation."
  },
  {
    "headline": "Oyedepo makes noise, I'm not envious of him: Tunde Bakare",
    "summarized_story": "Tunde Bakare said he has no problem with David Oyedepo, the founder of Winners’ Chapel, but admitted they share different doctrines and beliefs.\n“Oyedepo was born in August 1954, and I was born in September.\nWhen asked whether the incident was before Mr Oyedepo acquired his private jet, Mr Bakare said;“By the way, when he makes noise about his private jet of a thing, do you know that I once acquired a 1707 with the logo of our church on it?\nMr Bakare also referenced an incident where he tore a book written by Mr Oyedepo in the open and when he was confronted, he said the book was full of errors.\nThey are my fathers,” he said, speaking of Mr Adeboye and William Kumuyi of the Deeper Life Bible Church."
  },
  {
    "headline": "100m African children vaccinated against polio",
    "summarized_story": "By Cecilia OlogunagbaNo fewer than 100 million African children have been vaccinated against polio in the past one year, the World Health Organisation (WHO) has said.\nWHO Regional Director for Africa, Dr Matshidiso Moeti said that although COVID-19 had threatened the success of polio vaccination, it was possible to overcome the final hurdles.\nAccording to WHO, African states overseen by the African Regional Office of WHO remained committed to ending all remaining forms of polio.\nHowever, outbreaks of a vaccine-derived poliovirus (cVDPV) is spreading in African communities where too few children have received the polio vaccine.\nAccording to WHO, cases increased in 2020 partly because of disruptions to polio vaccination campaigns caused by the outbreak of COVID-19 pandemic."
  },
  {
    "headline": "Promote APC First Before Campaigning For Osinbajo – Masari Tells Support Group",
    "summarized_story": "Aminu Bello Masari, the governor of Katsina State, has encouraged the Progressive Consolidation Group (PCG), a faction of the All Progressives Congress (APC), to focus on promoting the party’s accomplishments and achievements before selling its candidate, Vice President Yemi Osinbajo.\nHe urged the APC party stalwarts to go back to their locality and ensure that they have credible people that would do the right thing for the country at the helms of affairs.\nWhy APC should be elected again in 2023, then who benefits comes second, because, there has to be APC.\nThe PCG group leader, Alhaji Ahmed Mohammed, had said their membership cut across all sectors in the country, including serving and past Governors, current and former members of the National Assembly.\n“Prof Yemi Osinbajo is very ably qualified to continue the policies and programmes of President Buhari, beyond 2023."
  },
  {
    "headline": "Journalists Not Our Problem – IPOB Debunks Claims Of Attacking South",
    "summarized_story": "In a statement acquired by SaharaReporters on Saturday, IPOB spokesperson Emma Powerful hailed journalists as “partners in progress.\n“IPOB can never resort to attacking NUJ in South East because journalists are not our problem; rather they are partners in progress.\nThe fabricated and fallacious statement from Petrus Obi against IPOB should be ignored and disregarded.\n“Petrus Obi has been in loggerheads with his people in the village as well as NUJ.\nHe now was to get cheaper popularity by attacking IPOB but we will not dignify him with a response."
  },
  {
    "headline": "BREAKING: Sir Victor Uwaifo Is Dead",
    "summarized_story": "Legendary singer and guitarist, Sir Victor Uwaifo is dead.\nA close source to the family confirmed this to The Nation on Saturday.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was also the first Commissioner for Arts, Culture and Tourism in Nigeria."
  },
  {
    "headline": "Breaking : Dele Momodu Becomes Aare Tayese of Iwoland",
    "summarized_story": "Dele Momodu a Nigerian journalist/publisher, businessman, and motivational speaker has been confirmed as the Aare Tayese of Iwoland.\nOn 28th of August, Dele Momodu took to his official Twitter to announce his new chieftaincy title.\nHe also thanked the Oluwo of IWO OBA ABDUL-RASHEED ADEWALE AKANBI and The OLUWO in Council, He Wrote;Our sincerest gratitude to His Imperial Majesty The OLUWO of IWO OBA ABDUL-RASHEED ADEWALE AKANBI and The OLUWO in Council for this great honor… Long live the King…"
  },
  {
    "headline": "Breaking: Veteran musician, ‘Guitar Boy’, is dead",
    "summarized_story": "Nigerian-born iconic singer, Victor Iwaifo has passed on.\nAccording to a family source,The ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was also the first Commissioner for Arts, Culture and Tourism in Nigeria."
  },
  {
    "headline": "Breaking: Abuja to host PDP convention as party rolls out committees in September, Secondus surrenders",
    "summarized_story": "The Peoples Democratic Party (PDP) has picked the Federal Capital Territory, Abuja, as the venue for its National Convention slated for October 30 and 31, 2021.\nPDP National Publicity Secretary, Kola Ologbondiyan, Saturday, also told newsmen after the party’s 92nd National Executive Committee (NEC) meeting in Abuja that the party shall announce convention planning and zoning committees next month.\n“NEC commends all party members for their various involvements in resolving issues that have recently occurred in our party.\n“NEC condemns the harassment and intimidation of media outfits in a desperate ploy by the APC to stifle free speech.\n“NEC has resolved that Abuja will be the venue of the PDP National Elective Convention slated for October 31, 2021."
  },
  {
    "headline": "Breaking: Nigerians to pay more for electricity as NERC rolls out new tariff plan Sept 1",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has reportedly directed the 11 Electricity Distribution Companies (DisCos) to increase their tariff effect from September 1, 2021.\nAccording to a document, the NERC has given the energy distributors the leverage to charge a service-based tariff.\nThe new directive is contained in its letter titled “Tariff Increase Notification”.\nDetails coming…"
  },
  {
    "headline": "FG digital payment of Conditional cash Transfer in FCT -NigPilot",
    "summarized_story": "In the FCT, payment recommences for a total of 23,893 beneficiaries across 3 Area Councils, Abaji, Kuje and Kwali.\n“With this development, beneficiaries can access or control their accounts through the use of Personal Identification Numbers PIN, perform all transactions like withdrawals, bank transfers and bill payments etc.\nIn her address, the Coordinator of the Conditional Cash Transfer Programme Hajiya Halima Shehu thanked the minister for the recommencement of the programme which has now been upgraded for transparency and equity.\nThe Honourable minister must be commended for her relentless efforts in transforming theConditional Cash Transfer Programme from the one that brings beneficiaries’ stipends through virtual accounts to the one that is now transactional with features for savings, withdrawals and transfer of funds.\nThis will enable the beneficiaries to have sustainable transactional accounts to meet the current economic realities”, Shehu said."
  },
  {
    "headline": "Stella Oduah dumps PDP, joins APC -NigPilot",
    "summarized_story": "Former Minister of Aviation in the administration of President Goodluck Ebele Jonathan and a serving Senator, Princess Stella Oduah-Ogiemwonyi , has dumped the People’s Democratic Party (PDP) and joined the ruling All Progressives Congress (APC) in Abuja.\nThe APC governorship candidate in the November 2021 election, Senator Andy Uba was at the occasion.\nShe is the latest of high profile members of the former ruling party who joined the APC recently.\n“You will enjoy the privileges enjoyed by all members of the party because you will have a waiver,” Bunu said.\nShe said during the occasion that she joined the APC family as part of the process of the changing political narrative in the South East, and assured that she joined the APC along with her multitude of supporters who have been jubilating in Anambra State."
  },
  {
    "headline": "Digitalization: APC set to go ‘paperless’ – Buni -NigPilot",
    "summarized_story": "The ruling All Progressives Congress, APC, is set for serious digitization and digital transformation of its operations.\nThings are changing and digital technology is becoming a source of inspiration for us to do what we do better.\n” We can use technology to enhance our processes, services and also to deliver our traditional services more efficiently and transparently.\nLikewise, we can use technology to bring new things to our party.\nZainab Marwa, Charles Nkata, Imaan Sulaiman-Ibrahim, OWOLABI Olusegun Awosan, Nasiru Danu, Princess Nse Ekpo and Osayi Ejiga"
  },
  {
    "headline": "Anambra Guber: Collapse your structure for APC, Okechukwu tells APGA -NigPilot",
    "summarized_story": "Therefore, I implore you to kindly consider the fruit in APGA joining APC to win the Anambra governorship.\nIn 2017, President Muhammadu Buhari restored Governor Obiano’s security details on the APC governorship campaign ground.\nIn 2019, Obiano led APGA to reciprocate the grand political gesture of understanding by Mr. President.\n“Gentlemen, would it not make for a greater political impact and success, if APGA consummates what its leaders started right from 2014 by embracing APC in a closer embrace?\nThey should show patriotism and respect for the campaign for Nigeria President of Igbo extraction by joining the mainstream, which APC’s victory in the governorship poll will enhance,” Okechukwu contended."
  },
  {
    "headline": "Two Children ‘Abducted’ From Lagos By Nanny Rescued In Benin-City",
    "summarized_story": "﻿Two siblings based in Lagos have been rescued following their abduction allegedly by a nanny simply identified by Precious.\nPrecious was said to have absconded with the minors – a four-year-old boy and two-year-old girl – on Monday and brought them to Benin City to a couple based abroad who were on a visit to Nigeria.\nREAD ALSO: Three Killed As Gunmen Attack Zangon Kataf Again“Operatives of the Anti-Kidnapping and Cybercrime Unit on 26 at about 15:35 hours arrested some suspects for the abduction of children from Lagos down to Benin City,” he said.\nHe added that the armed men whom he said belonged to some unknown vigilante group took two other children the police had rescued from the premises along with them.\n“The children were rescued alongside two other children in the compound that we cannot establish who the parents are."
  },
  {
    "headline": "Legendary Musician Sir Victor Uwaifo Is Dead",
    "summarized_story": "Veteran musician Victor Uwaifo has died at the age of 80.\nHe was the first professional musician to be awarded the National Merit Honours of Member of the Order of the Niger (MON).\nBuhari mournsMeanwhile, President Muhammadu Buhari has condoled with the family and friends of the legendary musician.\n“President Muhammadu Buhari condoles with family, friends and associates of legendary musician and multi-talented artiste, Sir Victor Uwaifo, who passed on Saturday, leaving a legacy of successes in many areas of life, including academia and administration,” the statement said.\n“President Buhari prays for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecturer, knowing the entire country, particularly the music industry, will sorely miss him.”"
  },
  {
    "headline": "PDP Choose Abuja As Venue For National Convention",
    "summarized_story": "The Peoples Democratic Party has chosen Abuja as the venue for its national convention.\nThe decision was reached at the party’s 92nd National Executive Committee meeting held on Saturday.\nThe acting National Chairman, Elder Yemi Akinwonmi, presided over the meeting.\nREAD ALSO: Secondus Absent As Akinwonmi Presides Over PDP NEC MeetingMain opposition party PDP has recently been hit by multiple defections as some embittered members call for the resignation of Uche Secondus as National Chairman.\nNEC meetingAt the meeting, Akinwonmi said consultations within the party are yielding desired results."
  },
  {
    "headline": "Zamfara Govt Restricts Fuel Sales, Announces New Measures To Tackle Banditry",
    "summarized_story": "The Zamfara State government has announced a set of new measures aimed at tackling the growing activities of bandits.\nThis includes the restriction of fuel sales to the state capital and the headquarters of the local government areas of the state.\n“Henceforth, all filling stations in the state are banned from selling fuel except in Gusau and the 14 local Government headquarters,” the statement said.\n“In addition, no eligible filling station is allowed to sell fuel of more than N10,000 to a single customer.\nSimilarly, the governor suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "160,000 Protest In France Against Covid Rules",
    "summarized_story": "A total of 160,000 people protested across France on Saturday, the interior ministry said, angered at the country’s Covid health pass system which they say unfairly restricts the unvaccinated.\nBy early evening the authorities had logged 222 separate protest actions, including 14,500 people who turned out in Paris.\nSixteen people were arrested and three police officers slightly injured in what was the seventh consecutive weekend of Covid protests.\nUnder the Covid pass system, introduced progressively since mid-July, anyone wishing to enter a restaurant, theatre, cinema, long-distance train, or large shopping centre must show proof of vaccination or a negative test.\nThe protest movement has brought together conspiracy theorists, anti-vaxxers, former members of the “Yellow Vest” anti-government movement, as well as people concerned that the current system unfairly creates a two-tier society."
  },
  {
    "headline": "Music Legend, Sir Victor Uwaifo, dies at 80",
    "summarized_story": "Music legend, Sir Victor Uwaifo is dead.\nHis son, Uwaifo Peter de Rock broke the news on his Facebook page.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nAdvertisementSir Victor Uwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger.\nHe was also the first Commissioner for Arts, Culture and Tourism in Nigeria."
  },
  {
    "headline": "16 Victims of Plateau violence buried in Yelwa Zangam",
    "summarized_story": "Some of the people killed in the recent upsurge of violence in Yelwa Zangam, Plateau State, have been buried in a sombre atmosphere and outpouring of emotions in Jos.\nTheir bodies were taken from the Jos University teaching hospital, JUTH on Saturday Morning to Yelwa Zangam amidst tight security.\nA total of 16 bodies were conveyed in two trucks.\nOne after the other, the remains of the victims were brought down from the truck as survivors wailed and cursed those who were behind their pain.\nBy the time the casket bearing 16 of them was conveyed to the burial ground it was apparent that the emotions and grief for some were too much to bear as they lost consciousnesses and had to be revived."
  },
  {
    "headline": "Police Rescue kidnapped Kwara State University Student",
    "summarized_story": "The police in Kwara state have rescued the 300 level mass communication undergraduate of Kwara State University, Malete, Khadija Isiaq from her abductors.\nKhadija Isiaq a 300 level Kwara State University Student was kidnapped almost a week ago.\nA statement issued by the Police Public Relations Officer, Kwara state command, SP Ajayi Okasanmi added that six suspects in connection with the kidnap were also arrested with some weapons.\nHe disclosed that the suspects will soon be charged to court."
  },
  {
    "headline": "Legendary Nigerian Guitarist Victor Uwaifo Dies at 80",
    "summarized_story": "Legendary Nigerian musician and guitarist, Sir Victor Uwaifo has died.\nOne of his children, Uwaifo Peter de Rock, broke the news of the demise of his father, a professor of Visual Arts, University of Benin (UNIBEN), on his Facebook page, on Saturday evening.\n“Professor (Sir) Victor Uwaifo has gone to rest.\nA First Class graduate of Visual Arts.\nSir Victor Uwaifo played the guitar, flute, keyboards with dexterity and had highly ambulant kinetic dancing steps."
  },
  {
    "headline": "Liverpool 1-1 Chelsea: Resilient 10-man Blues Secure Draw at Anfield",
    "summarized_story": "Ten-man Chelsea survived a strong second half from Liverpool to leave Anfield with a point on Saturday, securing a 1-1 draw despite Reece James being sent off.\nKai Havertz had opened the scoring for Thomas Tuchel’s side before Mohamed Salah converted a penalty towards the end of the first half.\nJames whipped a corner into the Liverpool box on 22 minutes which Havertz flicked into the net for the match’s opening goal.\nReferee Anthony Taylor consulted VAR and the 21-year-old was sent off for preventing a goal chance with his arm.\nLiverpool dominated possession in the second half but couldn’t find a winning goal."
  },
  {
    "headline": "Canada Election: Trudeau Rally Cancelled Following Angry Protests in Second Week of Campaign",
    "summarized_story": "The Liberal campaign cancelled an early evening rally Friday after an unruly group of demonstrators denouncing Justin Trudeau and pandemic policies set off security concerns, with Trudeau himself saying that going ahead with the event would have put people at risk.\nDozens of local Liberal supporters, some with young children and dogs, gathered in a hotel parking lot in Bolton, Ont., northwest of Toronto, to hear Trudeau speak.\nDozens of protesters followed the Liberal campaign to the rally.\nSpeaking in neighbouring Brampton on Friday night, Trudeau said the campaign couldn’t guarantee the safety of the people in attendance, and would have put at risk volunteers and others.\nIt was the third such incident Friday where Trudeau was confronted by angry demonstrators upset with his government’s push on vaccine passports and vaccine mandates for travellers."
  },
  {
    "headline": "Nigeria: Secondus Complies With Latest Court Ruling, Asks Akinwonmi to Preside Over PDP NEC meeting",
    "summarized_story": "National Chairman of the People’s Democratic Party (PDP) Uche Secondus has complied with the latest court ruling restraining him from resuming as the chairman of the party.\nIn his stead, Yemi Akinwonmi, on Saturday resumed as the acting national chairman of the party and presided over a meeting of the national executive committee (NEC) at the party’s headquarters in Abuja, the Nigerian capital.\nMr Secondus in a short statement asked Akinwonmi to preside over the meeting following the ruling of a high court in Cross River state.\n“I hereby request you to preside over the National Executive Committee meeting of the Party, taking place today, 28th August, 2021@ 12 noon, in my absence,” Secondus said in a statement on Saturday.\nThose attending the NEC meeting include a former Nigerian Vice President, Atiku Abubakar, former secretary to the government of the federation, Anyim Pius Anyim, PDP governors, former and current lawmakers, among others."
  },
  {
    "headline": "Man City 5-0 Arsenal: Cityzens Crush Hapless 10-man Gunners",
    "summarized_story": "Manchester City put a difficult week behind them by cruising to a 5-0 victory over 10-man Arsenal on Saturday.\nRodri made it four on 52 minutes and Torres netted a fifth on 84 minutes to complete the rout.\nThere was some cheer for the home supporters prior to kickoff, with the club unveiling two statues for Manchester City legends Vincent Kompany and David Silva outside the Etihad.\nBut Arsenal soon fell behind.\nJesus’ cross found Gundogan at the back post and he nodded past Bernd Leno to put the home side in front."
  }
]