[
  {
    "headline": "EFCC picks up Fani-Kayode for alleged forgery, document manipulation",
    "summarized_story": "A former Minister of Aviation, Femi Fani-Kayode, has been arrested by the Economic and Financial Crimes Commission in Lagos.\nFani-Kayode was said to be under investigation for alleged forgery and manipulation of documents.\nThe details of the allegations against him were sketchy but the EFCC spokesman, Wilson Uwujaren, confirmed Fani-Kayode’s arrest by operatives.\nFani-Kayode had been having a running battle with the EFCC for some time and he was once remanded for 67 days in 2016 alongside a former minister of finance, Nevada Usman.\nThe duo and two others were facing a 17-count of criminal conspiracy, fraud and money laundering to the tune of N4.9 billion."
  },
  {
    "headline": "Kano emir begs subjects to rise up against street begging",
    "summarized_story": "The Emir of Karaye in Kano State, Alhaji Ibrahim Abubakar, has directed heads of districts, villages and wards in his domain to support the state Tasks Force Committee on Evacuation and Repatriation of beggars to end street begging.\nThis is contained in a statement on Tuesday by Sani Yola, a committee member, representing Kano State Ministry of Information.\nAccording to Yola, the monarch gave the directive when members of the committee paid him a courtesy visit on Tuesday.\nAbubakar was quoted to have said, “All heads of districts, villages and wards in this domain support the Kano State Task Force Committee on Evacuation and Repatriation of beggars to end street begging.\nSpeaking, the Emir, Kabiru Inuwa said the committee came at the right time when the problem of begging was becoming worrisome.."
  },
  {
    "headline": "21st century educator: SPRIMA Educational Club trains teachers for improved proficiency in digital world",
    "summarized_story": "In its bid to enhance self development for Nigerian teachers, Sprima Educational Fun Club held its maiden edition of #TeachersHangout in Lagos at the weekend.\nThe event themed ‘The 21st century Educator’ was held on the 20th of November, 2021 at AJ Diamond Bar and Lounge in Ikotun area of Lagos State.\nMrs. Odigi’s words ‘We want educators to have fun, unwind and most importantly get professional trainings on creating digital lessons ( by Nethub IT Academy ) , Elocution training by ( OJ’s diction hub & sparks diction).\nCertificate of participation were also presented to participants at the end of the event.\nIn an interview with some participants, they all expressed their joy as the event surpassed their expectations, They are all looking forward to the next edition of Teachers hang out."
  },
  {
    "headline": "Anambra: Ifeanyi Okoye congratulates Prof Soludo on election victory",
    "summarized_story": "By Idowu BankoleIfeanyi Okoye, the founder of the youth for change initiative and media consultant, has facilitated professor Charles Soludo over his election victory at the just concluded governorship election where he emerged victorious as the Governor-elect of Anambra state.\nRecall VANGUARD had reported how Prof Charles Soludo beat other contestants from PDP, APC and other parties to emerge the winner of the Anambra governorship poll.\nIn his congratulatory message, Ifeanyi noted that “Though prior to the election there was a lot of fear as regards truncating the process, in the end, the voice and will of the people spoke louder.”“The victory is a new dawn for a greater Anambra which we believe will usher us all into rapid infrastructural growth, increase patronage of services and goods within the state, youth empowerment and capacity development which will also arrest the restiveness among the youths, also increase revenue for the state and promote competitiveness among state Craft there is no doubt that the victory of prof Soludo is significant to positioning the south East for greater economic prosperity, being an economist with a global reputation.”“I’m very optimistic that prof Soludo would work for the good of all in respective of party affliction.\n“Lastly I must congratulate everyone and the team in one way or the other who have made sacrifices for the actualization of this mandate.”Meanwhile, APC candidate in the election, Andy Uba, has rejected the outcome of the result saying “depleted APGA was too weak to have won the election."
  },
  {
    "headline": "Thousands of orphans roaming Lagos streets ― ASOHON",
    "summarized_story": "Says they need accommodationBy Funmi AjumobiLagos has been advised to accommodate thousands of orphans roaming the streets in order to redirect their brains aright so as to avert future disaster.\nREAD ALSO: Davido redeems N50m pledge to Orphanage homes“Orphans outside there are more than those kept in orphanage homes.\nAccording to him, government should have a yearly budget especially for registered orphanages in the state as NGOs are limited in finance to shelter and feed them successfully.\nHe commended the association for partnering Lagos State to alleviate the suffering of orphans and vulnerable children.\nWe need money to take care of them, I have two of them for surgical correction but I don’t have the money to do it”, she said."
  },
  {
    "headline": "Police rescue kidnapped students, others in Zamfara",
    "summarized_story": "The Police Command in Zamfara, says it has rescued 24 persons, including five students, kidnapped while writing their Senior Secondary School Certificate Examination (SSCE) in Shinkafi Local Government Area of the state.\nThe Commissioner of Police in the state, Mr Ayuba Elkanah, stated this while handing over the rescued victims to state government on Tuesday in Gusau.\nElkanah said that the police operatives deployed to various locations in the state succeeded in rescuing the kidnapped victims.\n“On Nov. 22, at about 1900hrs, Police Tactical Operatives deployed on Shinkafi axis, while on search and rescue operations, with regard to abduction of the students and other victims, acted on intelligence and rescued the students, along with eight others.\nElkanah, however, stated that all the rescued travellers had been debriefed and reunited with their families."
  },
  {
    "headline": "APC Reconciliation Committee receives 35 petitions from aggrieved members",
    "summarized_story": "The All Progressives Congress (APC) National Reconciliation Committee, has so far received 35 petitions from aggrieved members across the country.\nHe added that the committee had analised the petitions received, saying that it was developing a timeline for meeting the petitioners and other people involved.\nMai Mala Buni, Chairman APC Caretaker and Extra-ordinary Convention Planning Committee had said the party’s national reconciliation committee was critical to its planned national convention.\nBuni also the governor of Yobe said the outcome of the committe would determine the conduct of the party’s national convention.\nThe APC National Reconciliation Committee was constituted on Oct. 11, 2021 to reconcile members of the party, especially those who were aggrieved by the outcome of the party’s Congresses from its various state chapters."
  },
  {
    "headline": "Igbo youths condemn killings in Orlu zone, tasks Uzodimma to fish out culprits",
    "summarized_story": "On its part, the Orluzurumee Youths, decried the wanton destruction of lives and properties in Awo-Omamma, charging the government to fish out the perpetrators and bring them to justice.\nThe youths regretted that nothing had been done to curtail the recurring mayhems in the Orlu zone.\n“We will not play politics with the lives and properties of the people of imo state and Orlu zone in particular.\n“He should also convene a holistic stakeholder meeting in Orlu zone so as to nip this hydra-headed bug in the head”.\n“Let us state unequivocally and once more that Orlu Zone will not be made a mocking zone by our very own son due to his style of governance."
  },
  {
    "headline": "How Nigeria can survive, tackle insecurity, unemployment, others – Gov. Tambuwal",
    "summarized_story": "The Chairman, Peoples Democratic Party Governors Forum (PDP-GF), Aminu Tambuwal, has said Nigeria must embrace restructuring to survive.\nTambuwal, who is also the governor of Sokoto State, added that Nigeria must also embrace technology to tackle insecurity, unemployment and other problems confronting the country.\nHe stated this in his remarks at a two-day PDP National Retreat with the theme: “It’s time to rescue Nigeria”, held on Tuesday in Abuja.\nTechnology will solve the youth unemployment time bomb.\nHe added that PDP remained the only credible alternative to the All Progressives Congress (APC) and could not afford to fail Nigerians."
  },
  {
    "headline": "Fani-Kayode clears air on arrest by EFCC",
    "summarized_story": "Femi Fani-Kayode, a former Minister of Aviation, has denied reports that operatives of the Economic and Financial Crimes Commission, EFCC arrested him on Tuesday.\nRecall that DAILY POST had reported that Fani Kayode was nabbed over alleged manipulation and forgery.\nThe EFCC Spokesman Wilson Uwujaren had confirmed to DAILY POST that he was indeed arrested even though he did not give details.\nBut Fani-Kayode on his Twitter page said, he was only invited by the commission and has since been granted bail.\nI was never arrested by the EFCC."
  },
  {
    "headline": "‘It is a scam’ – NCC warns Nigerians against Davido airtime, data giveaway",
    "summarized_story": "The Nigerian-American music star, songwriter and producer recently announced he would donate 250 million naira to various orphanage homes across Nigeria.\nExploiting Davido’s benevolence, a group of scammers rolled out an advertorial titled “Davido Airtime and Data Giveaway”, which went viral, claiming that Davido is “giving out free 5K Airtime and 10GB Internet data of All Networks” to celebrate his birthday.\n”The NCC wishes to advise our teeming telecom consumers to have nothing to do with the advert or any similar bogus enticements.\n”For clarity, the MSISDN is simply the full phone number of a cellphone, in addition to other protocol information.\n”The NCC, therefore, reiterates its earlier warning to telecom consumers to be cautious and not to let their guards down."
  },
  {
    "headline": "Kidnapped government secondary school students, others rescue in Zamfara",
    "summarized_story": "The Police Command in Zamfara State says it has rescued 24 persons, including five students, kidnapped while writing their Senior Secondary School Certificate Examination (SSCE) in the Shinkafi Local Government Area of the state.\nThe Commissioner of Police in the state, Mr Ayuba Elkanah, stated this while handing over the rescued victims to the state government on Tuesday in Gusau.\nElkanah said police operatives deployed to various locations in the state succeeded in rescuing the kidnapped victims.\nAmong those rescued, he said, were four students of Government Secondary School, Birnin Yero, who were writing their SSCE examination and one other student of Federal Polytechnic, Kaura Namoda.\nElkanah, however, said all the rescued travellers had been debriefed and reunited with their families."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Petrol to sell for N340 per litre next year, says Kyari",
    "summarized_story": "Petrol to sell for N340 per litre next year, says KyariBy Bunmi Ogunmodede, News Editor and Frank Ikpefan, AbujaLabour cautions govt against unilateral actionN5,000 monthly stipend for 40m NigeriansGoing by the words of Nigerian National Petroleum Company Limited (NNPCL) Group Managing Director/ Chief Executive Officer (GMD/CEO) Mele Kyari, petrol will sell for between N320 and N340 per liter from February, next year.\nThe organised labour warned that removing subsidy without meeting labour’s demands will be met with stiff resistance.\nTUC warns against unilateral removal of subsidyThe Trade Union Congress yesterday warned the Federal Government against ‘unilateral removal of petrol subsidy next year without organised Labour’s input.\nThe tripartite committee on petrol last met in February this year with the government side demanding for more time to consult on the demands of Labour.\nAny unilateral removal of subsidy without meeting labour demand will be resisted.”"
  },
  {
    "headline": "Fed Govt rejects Lagos EndSARS panel report",
    "summarized_story": "By Yusuf Alli, Onyedi Ojiabor, Abuja, and Robert Egbe, LagosThe Federal Government yesterday rejected the report of the Lagos State Judicial Panel of Inquiry into #EndSARS protest in the state.\nYet another wondered how a judicial panel could use the words ‘massacre in context’ and equates such to a massacre.\nHe said: “The CNN has been celebrating the leaked report of the Lagos State Judicial Panel of Inquiry.\nThe Peoples Democratic Party (PDP) in Lagos State decried Mohammed’s comment on the report.\nThe PDP said the minister’s reaction was capable of causing more damage to federal and Lagos State governments’ good intention to for once address the grievances of Nigerians."
  },
  {
    "headline": "Fed Govt launches enhanced passport in UK",
    "summarized_story": "The Federal Government yesterday restated its commitment to improve passport application process for Nigerians at home and in diaspora, as it launches the new enhanced passport.\nAregbesola, who said the passport is the highest affirmation of Nigerian citizenship, noted that it is the responsibility of government to provide the passport without any stress, within a reasonable period.\nThe Nigerian passport is the highest affirmation of Nigerian citizenship.\nSo, we are going to solve all the problems associated with passport administration and we are already succeeding,” the minister declared.\nRevealing the features of the new enhanced passport, Aregbesola stated that it is a huge improvement from the standard passport that was introduced in 2007."
  },
  {
    "headline": "Igboho sues CBN, DSS, AGF for failing to pay N20.5b judgment cost",
    "summarized_story": "Two persons were killed during the invasion and Adeyemo’s valuable belongings were allegedly taken away by the DSS operatives.\nInstead of paying the huge sum, however, the DSS filed an application for stay of execution and an appeal against the judgment.\nRead Also: Uncertainty as Igboho spends ‘over 120 days’ in Benin Republic detentionAlliyu argued that neither the appeal nor stay of execution application affects an application for garnishee.\nHe also noted that the Office of the National Security Adviser under which the DSS operates gets N136 billion budget annually, which makes it very possible to pay only N20.5 billion.\nIgboho is currently held in Cotonou, Benin Republic on the order of the Nigerian government for the purpose of extradition."
  },
  {
    "headline": "Buhari suspends inauguration of new NNPC board indefinitely",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company (NNPC) Limited.\n“President Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC) scheduled for Wednesday 24th November, 2021 until further notice.\n“A new date for the inauguration of the Board will be announced in due course.\nRecall that President Buhari had on September 19, 2021, constituted the Board, to be chaired by Senate Ifeanyi Ararume following the signing into law of the Petroleum Industry Act (PIA).\n“By the power vested in him under Section 59(2) of the PIA 2021, President Buhari has approved the appointment of the Board and Management of the NNPC Limited, with effect from the date of incorporation of the Company."
  },
  {
    "headline": "BREAKING: FG rejects Lagos’ EndSARS report",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaFor the umpteenth time, the Federal Government insisted in Abuja, yesterday, that there was no massacre at Lekki tollgate on October 20, 2020.\nTo prove the authenticity of any killing at the tollgate at Lekki tollgate, in Lagos, when some Nigerians protested against police brutality, government has asked any affected family to come forward with details.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMinister of Information, National Orientation and Culture, Alhaji Lai Mohammed, said these at a press conference in Abuja, yesterday.\nClick Here to Apply ."
  },
  {
    "headline": "APC govs meet Buhari over zoning, national convention",
    "summarized_story": "This is as President Buhari has endorsed February 2022 as new date for the national convention.\nGovernor Abubakar Bagudu of Kebbi and Chairman of the PGF, who briefed newsmen, said he did not know when the party’s national convention would hold.\n“We agreed as a forum to seek an appointment to meet with President Buhari and discuss the on-coming national convention of the party.\nThe PGF chairman said the forum would keep the public informed on its decision on zoning of elective offices after its meeting with President Buhari.\nHe said the forum passed a vote of confidence on the party’s Governor Mai Mala Buni-led Caretaker Committee and Extra-ordinary Convention Planning Committee."
  },
  {
    "headline": "Osinbajo, govs, Ooni, Alaafin, others launch Yoruba World Centre",
    "summarized_story": "From Oluseye Ojo, IbadanVice President Yemi Osinbajo will today lead prominent Yoruba monarchs, including the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, and Ooni of Ife, Oba Enitan Ogunwusi, to launch Yoruba World Centre in Ibadan, the Oyo State capital.\nAdedayo, who stated that the project is a brainchild of the International Centre for Yoruba Arts and Culture (INCEYAC), explained that the project signposts a new chapter in the advancement of Yoruba culture, history, tradition and values.\nHe added that launch would feature opening of the centre’s temporary abode, the presentation of a full documentary on the Yoruba World Centre, and the laying of the foundation at the permanent site by the vice president.\n“When completed, the Yoruba World Centre will have a standard library, an archive, a museum, a recreation, reconstruction and digital centre, broadcasting and film village, and an artificial forest (zoo).\nIn addition to providing a good ambience for researchers, the Yoruba World Centre, as a knowledge centre, will help Nigeria and Nigerians in the onerous task of nation building.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Ikoyi collapsed building: Panel digs for facts, visits hospital, site",
    "summarized_story": "The chairman of the panel set up on the incident, Toyin Ayinde, made the call yesterday, while giving an update on their activities.\nHe disclosed that the panel had already visited the site of the incident and hospital to get information from some of the victims of the incident.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIt will be recalled that Governor Babajide Sanwo-Olu, on November 4, inaugurated the Tribunal of Inquiry into the collapse of the 21-storey building on No.\nGiving an update, yesterday, Ayinde urged members of the public with credible information of direct bearing to the collapsed building incident to send such to [email protected] on or before Wednesday, November 24, 2021."
  },
  {
    "headline": "Breaking: Femi Kuti, Wizkid, Burna Boy Nominated for Grammy Awards",
    "summarized_story": "By Vanessa ObiohaThe Recording Academy has announced Nigerian music stars Afrobeat maestro, Femi Kuti, and his son Made, Wizkid, Burna Boy among the nominees in the 64th Grammy Awards.\nThe musicians are nominated in the Best Global Music Performance and Best Global Music Album.\nBurna Boy fetched a nomination in the Best Global Music Performance for his collaboration with Angelique Kidjo.Femi Kuti’s ‘Pa Pa Pa’ and Wizkid and Tems song ‘Essence’ are also nominated in this category.\nMade shares the spotlight with his father as their collaborative album ‘Legacy +’ receives a nod in the Best Global Music Album .\nBurna Boy and Wizkid were among the winners last year."
  },
  {
    "headline": "FG to Raplace Fuel Subsidy with Monthly N5,000 Transport Grant to 40m Poor Nigerians",
    "summarized_story": "Ndubuisi Francis in AbujaThe federal government disclosed Tuesday that it was planning the payment of a monthly N5,000 transport grant to between 30 million and 40 million poor Nigerians as it prepares to remove subsidy on petroleum motor spirit (PMS), otherwise known as fuel, next year.\nThe Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, made the disclosure in Abuja at the launch of the World Bank’s Nigeria Development Update (NDU).\nAccording to her, the available resources after the removal of fuel subsidy will determine the number of beneficiaries, regretting that fuel subsidy is no longer sustainable as government spends trillions of naira yearly on payment of subsidy on petroleum products.\nThe minister stated that the N5, 000 transport subsidy would be by way of conditional cash transfer.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "UNICEF: 1,440 Students Abducted in 25 Attacks on Nigerian Schools in 11 Months",
    "summarized_story": "By Michael Olugbode in AbujaUnited Nations Children’s Fund (UNICEF) has said there have been 25 attacks on Nigerian schools this year, with 1,440 students abducted.\nMore than 3,500 children were abducted and more than 1,500 incidents of attacks on schools and hospitals were recorded.\nUNICEF, while lamenting that in Nigeria, there have been 25 attacks on schools so far this year, with 1,440 students abducted, said Nigerian children continue to suffer the impact of crisis.\nThat can only happen if they are protected from violence and the worst impacts of conflict.”Major humanitarian crises continue to unfold across West and Central Africa.\nUNICEF also called on all parties to conflict in the region to prevent and end grave violations against children, and to ensure perpetrators are held accountable."
  },
  {
    "headline": "MTN Secures SEC’s Approval for Sale of 575m Shares, Launches Equity Bookbuild to Investors Ahead of Retail Offer",
    "summarized_story": "Emma OkonjiMTN Nigeria Communications Plc (MTN Nigeria) says Securities and Exchange Commission (SEC) has approved an offer for sale of up to 575 million ordinary shares in MTN Nigeria held by MTN International (Mauritius) Limited, by way of a bookbuild to qualified investors, also known as Institutional Offer and a fixed price to retail investors (Retail Offer).\nMTN disclosed this in a statement it issued Tuesday, which was signed by the Company’s Secretary, Uto Ukpanah.\nAccording to the statement, the Institutional Offer opened at 12.00 noon on 23 November 2021and would close at 2.00pm on 26 November 2021, after which a fixed price will be determined for the Retail Offer.\nThe Retail Offer is proposed to open after the Institutional Offer, and MTN promised to make further announcement and publish same after obtaining clearance from the SEC.\nMTN Nigeria is one of Africa’s largest providers of communications services, connecting approximately 68 million people in communities across the country with each other and the world."
  },
  {
    "headline": "CBN Retains MPR at 11.5%",
    "summarized_story": "James Emejo in AbujaThe Central Bank of Nigeria (CBN) Tuesday resolved to leave all monetary policy parameters unchanged, retaining the Monetary Policy Rate (MPR), otherwise known as interest rate at 11.5 per cent, with the assymetric corridor of +100/-700 basis points around the MPR.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nAddressing journalists at the end of the 2-day meeting of the Monetary Policy Committee (MPC), in Abuja, the CBN Governor, Mr. Godwin Emefiele, said the committee also voted to retain the Cash Reserve Ratio (CRR) at 27.5 per cent as well as the Liquidity Ratio at 30 per cent.\nHe said existing policy stance had so far supported growth and recovery.\nEmefiele expressed satisfaction at the moderation in inflation rate which had declined for six consecutive months."
  },
  {
    "headline": "BREAKING: Pandemonium As Fire Guts Nyanya Market In Abuja",
    "summarized_story": "Barely three weeks after a fire outbreak at Kubwa Ultra-Modern Market in the Federal Capital Territory (FCT), Abuja where many people lost their lives, another market located in Nyanya went up in flames on Tuesday night.\nThe incident caused pandemonium in the market as traders and passers-by scampered for safety.\nThe cause of the fire which started around 8 pm could not be ascertained as of the time of filing this report.\nHowever, FCT firefighters are currently battling to put out the raging fire.\nWATCH: Pandemonium As Fire Guts Nyanya Market In Abuja pic.twitter.com/QLibwoN3yO — Sahara Reporters (@SaharaReporters) November 23, 2021Some residents of the area have also joined the firefighters to put the fire under control."
  },
  {
    "headline": "BREAKING: Pandemonium As Fire Guts Nyanya Market In Abuja",
    "summarized_story": "Barely three weeks after a fire outbreak at Kubwa Ultra-Modern Market in the Federal Capital Territory (FCT), Abuja where many people lost their lives, another market located in Nyanya went up in flames on Tuesday night.\nThe incident caused pandemonium in the market as traders and passers-by scampered for safety.\nThe cause of the fire which started around 8 pm could not be ascertained as of the time of filing this report.\nHowever, FCT firefighters are currently battling to put out the raging fire.\nWATCH: Pandemonium As Fire Guts Nyanya Market In Abuja pic.twitter.com/QLibwoN3yO — Sahara Reporters (@SaharaReporters) November 23, 2021Some residents of the area have also joined the firefighters to put the fire under control."
  },
  {
    "headline": "BREAKING: Angry Youths Protest, Demand Justice For Colleague Killed By Policeman Over N50 Bribe In Taraba",
    "summarized_story": "Some youths have taken over the streets to protest against the killing of a young man identified as Oliver Ezra allegedly shot and killed by a policeman.\nThe youths are demanding justice for Ezra who was killed in Jalingo, the capital city of Taraba State.\nSaharaReporters gathered that Ezra was shot after he refused to pay N50 bribe to the yet-to-be-identified police officer.\nThe protesting youths blocked the roads with tyres and planks of wood, preventing motorists from plying the roads.\nOne of the angry youths, Gusto Solomon Daniels, said on his Facebook page, \"Let justice be done even if Heavens fall.\""
  },
  {
    "headline": "BREAKING: Angry Youths Protest, Demand Justice For Colleague Killed By Policeman Over N50 Bribe In Taraba",
    "summarized_story": "Some youths have taken over the streets to protest against the killing of a young man identified as Oliver Ezra allegedly shot and killed by a policeman.\nThe youths are demanding justice for Ezra who was killed in Jalingo, the capital city of Taraba State.\nSaharaReporters gathered that Ezra was shot after he refused to pay N50 bribe to the yet-to-be-identified police officer.\nThe protesting youths blocked the roads with tyres and planks of wood, preventing motorists from plying the roads.\nOne of the angry youths, Gusto Solomon Daniels, said on his Facebook page, \"Let justice be done even if Heavens fall.\""
  },
  {
    "headline": "Nigerian Artistes Femi Kuti; Son, Made, Wizkid, Burna Boy Nominated For Grammy Awards",
    "summarized_story": "Afrobeat legend, Femi Kuti and his son, Made have been named among nominees for the 2022 edition of the Grammy Awards.\nFellow Nigerian singers Wizkid and Burna Boy are also among the nominees in the 64th Grammy Awards.\nThe musicians got nominations in the Best Global Music Performance and Best Global Music Album.\nOne-time Grammy Award winner, Burna Boy fetched a nomination in the Best Global Music Performance for his collaboration with Angelique Kidjo.\nFemi Kuti’s ‘Pa Pa Pa’ and Wizkid and Tems song ‘Essence’ were also nominated in this category."
  },
  {
    "headline": "White House: US will release 50m barrels of oil from reserves to lower prices",
    "summarized_story": "The United States says it will release 50 million barrels of oil from reserves to lower energy costs amid a spike in gasoline prices and soaring inflation.\nThis development follows repeated calls of Joe Biden-led US government to the Organisation of the Petroleum Exporting Countries and its allies, known as OPEC+, to pump more oil in hopes it would lower gas prices.\nBut the oil cartel declined to ramp up production, sticking to its plan to increase the global oil supply by 400,000 barrels per day till December.\nAdvertisementLast week, Biden asked the federal trade commission (FTC) to investigate what he described as “anti-consumer” behavior by oil and gas companies and whether it could have led to increased gas prices.\nAdvertisementAn additional 18 million barrels that Congress authorised for sale will be released in the coming months."
  },
  {
    "headline": "White House: US will release 50m barrels of oil from reserves to lower prices",
    "summarized_story": "The United States says it will release 50 million barrels of oil from reserves to lower energy costs amid a spike in gasoline prices and soaring inflation.\nThis development follows repeated calls of Joe Biden-led US government to the Organisation of the Petroleum Exporting Countries and its allies, known as OPEC+, to pump more oil in hopes it would lower gas prices.\nBut the oil cartel declined to ramp up production, sticking to its plan to increase the global oil supply by 400,000 barrels per day till December.\nAdvertisementLast week, Biden asked the federal trade commission (FTC) to investigate what he described as “anti-consumer” behavior by oil and gas companies and whether it could have led to increased gas prices.\nAdvertisementAn additional 18 million barrels that Congress authorised for sale will be released in the coming months."
  },
  {
    "headline": "FULL LIST: CJN swears in 22 new FCT judges",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), on Tuesday.\nswore in 22 new high court judges of the federal capital territory (FCT).\nAdvertisementThe judges were nominated by the National Judicial Council (NJC) in April 2020.\nThe newly appointed judges are:Madugu Mohammed Alhaji (Oyo) Agunloye Kayode (Ondo) Enenche Eleojo (Kogi) Aminu Mohammad Abdullahi (Kano) Nwecheonwu Chinyere Elewe (Rivers) Ibrahim Mohammed (Jigawa) Sadiya Mu’azu Mayana (Zamfara) Kanyip Rosemary Indinya (Taraba) Aliyu Yunusa Shafa (Nasarawa) Mohammed Zubairu (Kaduna) Oluyemisi I. Adelaja (Osun) Fatima Abubakar Aliyu (Gombe) Agashieze Cyprian Odinaka (Enugu) Aliyu Halilu Ahmed (Adamawa) Hafsat Lawan Abba-Aliyu (Yobe) Olufolake Olufolashade Oshin (Ogun) Nwabulu Ngozika Chineze (Anambra) Mimi Anne Katsina Alu-Apena (Benue) Binta Dogonyaro (Jigawa) Muhammad Mustapha Adamu (Kebbi) Jadesola Oludare Adeyemi-Ajayi (Ogun) Njideka Nwosu-Iheme (Rivers)"
  },
  {
    "headline": "FULL LIST: CJN swears in 22 new FCT judges",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), on Tuesday.\nswore in 22 new high court judges of the federal capital territory (FCT).\nAdvertisementThe judges were nominated by the National Judicial Council (NJC) in April 2020.\nThe newly appointed judges are:Madugu Mohammed Alhaji (Oyo) Agunloye Kayode (Ondo) Enenche Eleojo (Kogi) Aminu Mohammad Abdullahi (Kano) Nwecheonwu Chinyere Elewe (Rivers) Ibrahim Mohammed (Jigawa) Sadiya Mu’azu Mayana (Zamfara) Kanyip Rosemary Indinya (Taraba) Aliyu Yunusa Shafa (Nasarawa) Mohammed Zubairu (Kaduna) Oluyemisi I. Adelaja (Osun) Fatima Abubakar Aliyu (Gombe) Agashieze Cyprian Odinaka (Enugu) Aliyu Halilu Ahmed (Adamawa) Hafsat Lawan Abba-Aliyu (Yobe) Olufolake Olufolashade Oshin (Ogun) Nwabulu Ngozika Chineze (Anambra) Mimi Anne Katsina Alu-Apena (Benue) Binta Dogonyaro (Jigawa) Muhammad Mustapha Adamu (Kebbi) Jadesola Oludare Adeyemi-Ajayi (Ogun) Njideka Nwosu-Iheme (Rivers)"
  },
  {
    "headline": "UNICEF: 25 Nigerian schools attacked, 1,440 students abducted in 2021",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) says 25 schools in Nigeria have been attacked, while 1,440 students have been abducted since January 2021.\nAdvertisementThis was contained in a report released on Tuesday titled, ‘Children in West and Central Africa among those Who Suffer Highest Rates of Grave Violations in Armed Conflict’.\nThe organisation said over the past five years, the West and Central Africa regions have consistently had some of the highest numbers of UN-verified “grave violations” against children in armed conflict.\nAdvertisement“More than 3,500 children were abducted and more than 1,500 incidents of attacks on schools and hospitals were recorded,” the report reads.\n“In Nigeria, there have been 25 attacks on schools so far this year, with 1,440 students abducted."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "The NFT artist who captured the global lockdown with 700 portraits",
    "summarized_story": "Optimising this process, coupled with the overwhelmingly positive feedback he received from his 80 selected muses, encouraged him to create more portraits.\nIn the end, Adekola created 700 portraits, but there are only 40 portraits with striking designs and a collage of all 700 portraits on display at the exhibition halls of the gallery.\nNow titled Lockdown Portraits, his project would go on to form a part of his exhibition titled, Dislocation &… alongside Anthology of an African Wedding and Diaspora Axis.\nAdekola has evolved his art using Photoshop for over 20 years, creating over 20,000 texture designs that he used to create Anthology of an African Wedding.\nAnthology of an African Wedding, which also sells as an NFT on OpenSea, consists of 18 art pieces—9 showing traditional wedding scenes and 9 white wedding ones."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "After bootstrapping for almost 3 years, Nigerian crypto exchange, Busha raises $4.2m seed for Africa-wide expansion",
    "summarized_story": "Moyo Sodipo, Co-Founder and CPO of crypto exchange, Busha, also has one such story to tell.\nHis experience saw him team up with Micheal Adeyeri (CEO) to build Busha for people to learn about crypto without getting their fingers burnt.\nIt started at JumiaL-R (Busha Co-Founders) Micheal Adeyeri, CEO & Moyo Sodipo CPOSodipo and Adeyeri were part of Jumia Nigeria’s pioneer employees in 2012.\nUnder the leadership of Sodipo and Adeyeri, Busha has done well without any external funding.\nEven though everyone seems to be clamouring for Bitcoin and crypto, we’re still at the very early stages of crypto."
  },
  {
    "headline": "Backed by Flutterwave, Thepeer wants to help businesses share data seamlessly using its API",
    "summarized_story": "So far, the fintech industry is leading the way with the presence of API startups such as Mono, OnePipe, and Okra.\nUsing an API provided by these startups, businesses can access users’ financial data across several platforms.\nAs mentioned earlier, API fintech startups are solving this problem for financial institutions, but what if you need this infrastructure and are not in the fintech industry?\nBy providing these businesses with an API that they integrate on their platforms, Thepeer can give context to transactions that occur between businesses.\nWhile they currently work with fintech startups, they are not a fintech startup, and this could present a problem."
  },
  {
    "headline": "Interview with Mr Eazi — Artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\nMr Eazi also has an obsession, and you get no prizes for guessing that it is linked to the creative.\nThe longer we spoke, the more difficult it was to distinguish between Mr Eazi, the artiste, the startup founder/CEO, and the investor.\nMr Eazi and his friends also run Zadagat Capital, a syndicate fund that invests in the African tech space.\nIt’s more like an alternative merch for my fans.”There are other investment ventures associated with the Mr Eazi brand."
  },
  {
    "headline": "Rising food price and wellbeing of Nigerians",
    "summarized_story": "The welfare of Nigerians is deteriorating every day due to rising prices, especially that of food items in the market.\nLikewise, the average price of 1kg tomatoes increased year-on-year by 19.28 percent, while a 1kg of white Garri, the popular poor man food, experienced a year-on-year 27.91 percent increase.\nThe percentage of adults who skipped food, ran out of food and went the whole day without food in Nigeria were 27.3 percent, 25.1 percent, and 6.4 percent, respectively.\nThe expert also noted a high probability that food prices will double by the end of 2021.\nThere is a high level of poverty experienced, especially among rural dwellers and specifically women."
  },
  {
    "headline": "All On, partners launch new $10m solar equipment facilities in Nigeria",
    "summarized_story": "The All On-managed finance facility will provide debt funding for solar companies already approved by the Rural Electrification Agency (REA) for the Nigeria Electrification Programme to purchase lower-cost solar equipment through the DART.\n“We are particularly excited about this deal which will inject much needed capital into the renewable energy sector in Nigeria,” said All On CEO, Wiebe Boer.\nThey will manage the global platform to standardise equipment, process solar company orders, manage supplier relationships, and link developers with finance partners.\nAccording to a 2020 Sustainable Energy for All (SEforAll) report on the solar sector in Nigeria commissioned by All On, aggregated procurement and logistics for solar equipment can significantly lower costs and unlock bottlenecks in the supply chain.\n“This could be a breakthrough in bridging the finance gap that hinders the growth of small and medium sized enterprises in the nascent renewable energy sector in Nigeria.”"
  },
  {
    "headline": "CBN holds interest rate for 8th straight time on slowing inflation",
    "summarized_story": "The Central Bank of Nigeria (CBN) on Tuesday retained its benchmark interest rate at 11.5 percent on slowing inflation, in line with analysts’ expectations.\nOther policy parameters were also held constant.\nThe CBN has kept the MPR at 11.5 percent since September 2020.\nNigeria’s inflation rate slowed for the seventh consecutive month to 15.99 percent in October as prices of food and non-food items declined, the National Bureau of Statistics has said.\nUnlike Nigeria, other African countries like Ghana and South Africa hiked their interest rates on the back of rising inflation."
  },
  {
    "headline": "Contributory Pension Scheme: Edo sensitises first batch of beneficiaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Tuesday, kicked off a three-day workshop to sensitise the first batch of intending retirees to benefit from the Contributory Pension Scheme introduced by the Governor Godwin Obaseki-led administration in 2017.\nFunctioning Permanent Secretary/Chairman, Edo State Pension Bureau, Abbe Osaro Washington, said the workshop is to prepare the workers ahead of their migration into the scheme by 2022.\n“These intending retirees would be the first to benefit from the new Contributory Pension Scheme introduced by Edo State Government in January 2017.”He continued: “This is the first set of retirees, to be migrated two months from now.\nThese are the first set of intending retirees that will be migrating into the contributory pension scheme.”Addressing the intending retirees, the guest speaker, Mr. Adebola Bello, who spoke on ‘Retirement Benefits Under the Contributory Pension Scheme,’ said the scheme came with modalities, which include transparency and uniform regulation.\nReturns on investment give value to the Contributory Pension Scheme,” he added."
  },
  {
    "headline": "Obaseki assures of support for new UNIBEN Chancellor – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the new Chancellor who was on a courtesy visit at the Government House in Benin City.\nAccording to him, “University education in the post-COVID-19 world requires a rethinking of the system, and how it is organised.\n“The strategy used two or three decades ago for our university education might not be applicable today.\nHopefully, you will lead that stage of helping us rethink university education in Nigeria in the post-COVID-19 era.”“For the future university, we will be quite reliant and dependent on technology.\n“I have been in the university system for some four decades and will use that experience and exposure, and make it available for the development of UNIBEN.”..."
  },
  {
    "headline": "Obaseki inaugurates c’ttee for devt of science, technology, innovation in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated Prof. Kessington Obahiagbon as the Chairman of the Edo State Science, Technology and Innovation Committee, charged with the responsibility of developing a strategy that will make the state a hub for science, technology and innovation in the country.\nThe COVID-19 era has shown that technology is important for any state that wishes to survive the dislocations brought by the pandemic.\n“We are lucky, blessed, and fortunate to be affiliated with experts and leaders in the area of proliferating science and technology.\nHe further stated, “The Committee should also assist the state in developing a strategy to improve the awareness of science, technology and innovation at the grassroots.\n“They should assist in developing a strategy that will make Edo State the hub of science, technology and innovation within and outside the country."
  },
  {
    "headline": "Edo Govt Seeks Collaboration with NTA on MEGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government has called for the support of the Nigerian Television Authority (NTA) in driving the administration’s agenda of Making Edo Great Again popularly known as MEGA.\nWhile making his welcome address, the Commissioner reinstated the commitment of Edo government under Mr. Obaseki to economic revolution and institutional reforms of Edo state which are driven by the MEGA agenda.\nHe appealed to NTA to key into the vision by informing and sensitizing the people about the programmes of Edo government.\nEarlier, the zonal director of NTA Benin Network Centre, Mrs. Pauline Igbanor congratulated Hon.\nSolomon Imohiensen and other staff members of the Edo Ministry of Communication and Orientation."
  },
  {
    "headline": "Buhari suspends inauguration of NNPC board",
    "summarized_story": "President Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted board of the Nigerian National Petroleum Company Limited (NNPC), an official has said.\nPresident Buhari had in September named the new board members of the NNPC.\nThe president appointed a former senator, Ifeanyi Ararume, as the Chairman of the Board, with Umar Ajiya being the Chief Financial Officer.\nOther appointed board members are Tajudeen Umar (North East), Lami Ahmed (North Central), Mohammed Lawal (North West), Margaret Chuba Okadigbo (South East), Constance Marshal (South South), and Pius Akinyelure (South West).\nThe president also appointed the Group Managing Director of the NNPC, Mele Kyari, as the Chief Executive Officer and a member of the new board."
  },
  {
    "headline": "CBN says First Bank too big to fail, expresses satisfaction with investors’ tussle for share ownership",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN), has said that First Bank of Nigeria is a big part of the the country’s banking system and cannot be under any threat of failure.\nMr. Godwin Emefiele, the apex bank’s governor who stated this at the Monetary Policy Committee meeting held today, Tuesday, said he is pleased that investors are showing interest in First Bank’s shares.\n“Remember that First Bank was established in 1894 and is the oldest bank in Nigeria.\nNow, the last time I looked at First Bank’s share price, it was N11.55kobo over the weekend.\nI am pleased to see that they are competing for First Bank shares."
  },
  {
    "headline": "Air traffic controllers threaten strike amid fears of flight delays",
    "summarized_story": "BY EMEKA EJEREAir travellers in Nigeria may soon begin to suffer flight delays as the Nigerian Air Traffic Controllers’ Association lamented poor working conditions and threatened industrial action following the death of their colleague, Aniekan Effiong Inuk, at the Nnamdi Azikiwe International Airport, Abuja.\nThe three-hour flow control means flights will be delayed with many passengers stranded across the airports from today.\n“Nigerian Air Traffic Controllers’ Association (NATCA) rose from an emergency meeting conveyed over the tragic, painful, and avoidable exit of one of our diligent and dedicated colleague, Mr. Aniekan Effiong Inuk in the early hours of Monday November 22, 2021.\n“The death of Mr. Aniekan Effiong Inuk on active duty at Abuja airport whose sad event is not unconnected with the unavailability of an operational vehicle to move him to a hospital in record time amongst others is one too many.\nThe Association demands that NAMA management and relevant authorities should immediately do the following:"
  },
  {
    "headline": "Again, CBN retains lending rate at 11.5%",
    "summarized_story": "BY EMEKA EJEREThe monetary policy committee of the Central Bank of Nigeria (CBN) has voted to retain the monetary policy rate (MPR), at 11.5 percent, CBN Governor, Godwin Emefiele, has disclosed.\nMPR is the baseline interest rate in an economy, which influences every other interest rate used within an economy.\n“Therefore by unanimous vote, the MPC voted as follows, one, retain MPR at 11.5 per cent; retain the asymmetric corridor of +100/-700 basis points around the MPR; retain the CRR at 27.5 per cent; and retain the Liquidity Ratio at 30 per cent.\nThe committee also reiterated the need to remain cautious and called on the fiscal authority to sustain interventions that would normalise the country’s economy in the short to medium term.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "MTN Nigeria launches equity book-build to qualified investors",
    "summarized_story": "Telecom giant, MTN Nigeria, has launched an equity book-build to qualified investors ahead of its planned sales of 575 million ordinary shares of the company to the public.\nBook building is the de facto mechanism by which companies price their IPOs and is highly recommended as one of the most efficient ways to price securities.\nThe launch comes after the company had obtained regulatory approval from the Securities and Exchange Commission (SEC) to proceed with the offer for sale of N575 million shares in MTN Nigeria.\n“MTN Nigeria Communications Plc (MTN Nigeria) is pleased to announce that the Securities and Exchange Commission (SEC) has approved an offer for sale of up to 575 million ordinary shares in MTN Nigeria held by MTN International (Mauritius) Limited, by way of a book-build to qualified investors (Institutional Offer) and a fixed price to retail investors (Retail Offer),” the statement said.\nThe retail offer is proposed to open after the institutional offer."
  },
  {
    "headline": "Group Cautions Buhari Against Release Of IPOB Leader, Kanu",
    "summarized_story": "Tiv Youth Council Worldwide (TYCW) has asked President Muhammadu Buhari to be mindful of pressure seeking for the release of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu, adding that his release could be an invitation for more treasonable acts.\nThe group was reacting to request made by a group under the aegis of Highly Respected Igbo Greats, led by First Republic parliamentarian and Minister of Aviation, Chief Mbazulike Amaechi to grant unconditional release to Nnamdi Kanu who is currently standing trial.\n“We receive the request by the revered elder statesmen from the south east with mix feeling.\nIf Kanu is released unconditionally, what become of other persons standing trial for same or similar crimes?\nWe insist that releasing Nnamdi Kanu will be setting bad precedence”, the statement noted."
  },
  {
    "headline": "Group Cautions Buhari Against Release Of IPOB Leader, Kanu",
    "summarized_story": "Tiv Youth Council Worldwide (TYCW) has asked President Muhammadu Buhari to be mindful of pressure seeking for the release of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu, adding that his release could be an invitation for more treasonable acts.\nThe group was reacting to request made by a group under the aegis of Highly Respected Igbo Greats, led by First Republic parliamentarian and Minister of Aviation, Chief Mbazulike Amaechi to grant unconditional release to Nnamdi Kanu who is currently standing trial.\n“We receive the request by the revered elder statesmen from the south east with mix feeling.\nIf Kanu is released unconditionally, what become of other persons standing trial for same or similar crimes?\nWe insist that releasing Nnamdi Kanu will be setting bad precedence”, the statement noted."
  },
  {
    "headline": "BREAKING: Buhari Suspends Inauguration Of NNPC Board",
    "summarized_story": "President Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC) scheduled for Wednesday November 24, 2021 until further notice.\nAccording to a statement by the Secretary to the Government of the federation, Boss Mustapha, a new date for the inauguration of the Board will be announced in due course.\nRecall that President Buhari, in his capacity as Minister of Petroleum Resources, in September had directed the incorporation of the Nigerian National Petroleum Company Limited.\nThe Group Managing Director of the NNPC, Mr Mele Kolo Kyari, has, therefore, been directed to take necessary steps to ensure that the incorporation of the NNPC Limited is consistent with the provisions of the PIA 2021.\nOther Board Members are; Dr Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Senator Margaret Chuba Okadigbo (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure (South West)."
  },
  {
    "headline": "BREAKING: Buhari Suspends Inauguration Of NNPC Board",
    "summarized_story": "President Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC) scheduled for Wednesday November 24, 2021 until further notice.\nAccording to a statement by the Secretary to the Government of the federation, Boss Mustapha, a new date for the inauguration of the Board will be announced in due course.\nRecall that President Buhari, in his capacity as Minister of Petroleum Resources, in September had directed the incorporation of the Nigerian National Petroleum Company Limited.\nThe Group Managing Director of the NNPC, Mr Mele Kolo Kyari, has, therefore, been directed to take necessary steps to ensure that the incorporation of the NNPC Limited is consistent with the provisions of the PIA 2021.\nOther Board Members are; Dr Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Senator Margaret Chuba Okadigbo (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure (South West)."
  },
  {
    "headline": "Terrorism: 25 Schools Attacked, 1,440 Students Abducted In 2021 – UNICEF",
    "summarized_story": "The is even as it further disclosed thatin Nigeria, there have been 25 attacks on schools so far this year, with 1,440 students abducted.\n“In Nigeria, there have been 25 attacks on schools so far this year, with 1,440 students abducted.\n“Since 2005, 1 out of 4 United Nations verified grave violations in the world was committed in West and Central Africa.\nMajor humanitarian crises continue to unfold across West and Central Africa.\nUNICEF also called on all parties to conflict in the region to prevent and end grave violations against children, and to ensure perpetrators are held accountable."
  },
  {
    "headline": "So sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to wedding",
    "summarized_story": "So sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to weddingSo sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to weddingA lady by the name Amaka Enekwe has died three weeks after her younger sister, Onyinye, died in the Ikoyi building collapse on November 1, 2021.\nThis was revealed by a Facebook user named Blessed Nasa Eriamah, on Tuesday, who shared the news of Amaka’s death.\nEriamah stated that Amaka was recovering from an illness only to die on Monday, November 22, three weeks after her sister.\n“Exactly three weeks after the death of your younger sister at the Ikoyi building collapse, you followed her.\nLosing two daughters in a space of three weeks is a pain to terrible for a mother to bear,” Eriamah wrote."
  },
  {
    "headline": "So sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to wedding",
    "summarized_story": "So sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to weddingSo sad: Lady dies three weeks after sister was killed in Ikoyi building collapse month to weddingA lady by the name Amaka Enekwe has died three weeks after her younger sister, Onyinye, died in the Ikoyi building collapse on November 1, 2021.\nThis was revealed by a Facebook user named Blessed Nasa Eriamah, on Tuesday, who shared the news of Amaka’s death.\nEriamah stated that Amaka was recovering from an illness only to die on Monday, November 22, three weeks after her sister.\n“Exactly three weeks after the death of your younger sister at the Ikoyi building collapse, you followed her.\nLosing two daughters in a space of three weeks is a pain to terrible for a mother to bear,” Eriamah wrote."
  },
  {
    "headline": "DSS: Igboho undergoing process of extradition back to Nigeria",
    "summarized_story": "The Department of State Services (DSS) has told an Oyo State High Court sitting at Ibadan, that the Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho is currently undergoing the process of extradition back to Nigeria.\nHowever, the Yoruba Nation agitator’s counsel, Yomi Alliyu, SAN, filed a N20.5 billion suit against the DSS on Igboho’s behalf at the High Court in Ibadan.\nAkintola, the court had ordered DSS to pay Igboho the sum of N20.5 billion naira as exemplary damages.\nIt said: “That it is a fact that the applicant Chief Sunday Igboho has been declared a fugitive by the Nigerian Police Force sometime in the month of June 2021.\n“That it is a fact that the applicant was arrested on July 19, 2021, and he is currently in custody of the Beninese security agents, undergoing extradition procedure to come back to Nigeria."
  },
  {
    "headline": "DSS: Igboho undergoing process of extradition back to Nigeria",
    "summarized_story": "The Department of State Services (DSS) has told an Oyo State High Court sitting at Ibadan, that the Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho is currently undergoing the process of extradition back to Nigeria.\nHowever, the Yoruba Nation agitator’s counsel, Yomi Alliyu, SAN, filed a N20.5 billion suit against the DSS on Igboho’s behalf at the High Court in Ibadan.\nAkintola, the court had ordered DSS to pay Igboho the sum of N20.5 billion naira as exemplary damages.\nIt said: “That it is a fact that the applicant Chief Sunday Igboho has been declared a fugitive by the Nigerian Police Force sometime in the month of June 2021.\n“That it is a fact that the applicant was arrested on July 19, 2021, and he is currently in custody of the Beninese security agents, undergoing extradition procedure to come back to Nigeria."
  },
  {
    "headline": "Confirmed: Femi Fani-Kayode arrested for forgery",
    "summarized_story": "Femi Fani-Kayode, a former Minister of Aviation, has been arrested by the Economic and Financial Crimes Commission in Lagos.\nEFCC spokesman, Wilson Uwujaren, confirmed the development to PM News.\nHe confirmed that the former minister, who rejoined the All Progressives Congress in September, was brought to the Lagos Zonal Office of the anti-graft agency on Tuesday.\nHe said Fani-Kayode was arrested for forgery and manipulation of documents.\nUwujaren said: “Yes it’s true."
  },
  {
    "headline": "Why most women are cheats",
    "summarized_story": "Self-acclaimed relationship expert and social media personality Adejoro Olumofin has revealed most women have at one point or the other cheated on their partners.\nThe self-acclaimed ‘love doctor’ explained that when a woman drops her account number for any other man other than her boyfriend or husband, it is tantamount to cheating.\nAccording to Olumofin, a good wife or potential wife must seek the consent of her partner before giving another man her account number.\nHe wrote: “95% of Nigerian women have cheated on their husbands/BF.\n“Ladies love dropping Account numbers for anyone in the name of “My Helper”."
  },
  {
    "headline": "Buhari And Sanwo Should Resign Now – EndSARS Groups",
    "summarized_story": "On Monday, the New Nigeria Network, in collaboration with #EndSARSUnited, a coalition of #EndSARS groups, demanded President Muhammadu Buhari and Governor Babajide Sanwo-Olu of Lagos State resign for the killings at the Lekki tollgate on October 20, 2020.\nSanwo-Olu was asked to resign for his indictment in the EndSARS report by the panel.\nThey hummed on the decision of Governor Sanwo-Olu to include the Attorney General of Lagos State and Commissioner of Justice, Moyosore Onigbanjo.\n“To what extent, if any, does the Governor still have the moral authority to appoint and set up a White Paper Committee?\n“While Lagos State Government is calling for restraints, it cannot set loose its hunting dogs."
  },
  {
    "headline": "BREAKING: Gunmen Set Police Station On Fire, Kill Officer In Imo",
    "summarized_story": "A police station in Arondizuogu, Ideato Local Government Area, Imo State, was razed by unknown gunmen thought to be members of the Indigenous People of Biafra, IPOB.\nNEWS DIRECT learned that the incident, which occurred on Tuesday morning, led to the death of a police officer.\nThe state’s Police Public Relations Officer, Michael Abattam, confirmed the attack to DAILY POST but was unable to give details.\nDetails shortly…m"
  },
  {
    "headline": "BREAKING: Gunmen Raze Imo Police Station, Kill Cop",
    "summarized_story": "Gunmen have attacked and burnt a police Divisional headquarters in Arondizuogu in Ideato Local Government Area of Imo state.\nThe attack which happened around 2:00 am on Tuesday left one of the police officers on duty dead.\nSources in the community disclosed that the attack left the Divisional Police Officer of the Division with a broken head after he was attacked by the invaders.\nAlso, a Sienna vehicle attached to the division and DPO’s personal vehicles were vandalized by the gunmen.\nThey gave him matchet cuts and vandalized his Jeep and a police sienna vehicle belonging to the division,” a source who pleaded anonymity told Punch Newspapers."
  },
  {
    "headline": "BREAKING: Lagos EndSARS Report Not Reliable — Lai Mohammed",
    "summarized_story": "The report of the Lagos State judicial panel on the shooting at the Lekki toll gate has been dismissed by the Federal Government.\nIn a news conference in Abuja, Minister of Information and Culture, Lai Mohammed, criticized the study, saying it could not change the government’s position about the massacre.\n‘Tales by moonlight,’ the minister said of the Lagos judicial panel’s report.\n“There’s absolutely nothing in the report that is circulating to make us change our minds that there was a massacre in Lekki on October 20, 2020,” he said.\nYou’re welcome.”"
  },
  {
    "headline": "Breaking: Fire outbreak wrecks havoc at Nyanya Abuja market (VIDEO)",
    "summarized_story": "Fire on Tuesday night gutted popular Nyanya market located within Abuja Municipal Area Council (AMAC).\nThe cause of the fire outbreak was yet unknown as at the time of filling this report.\nHowever, men of the FCT fire service has immediately arrived the scene and are battling to completely quench the inferno.\nDetails coming…RelatedNo tags for this post."
  },
  {
    "headline": "Breaking: Fresh hurdles for Fani-Kayode as EFCC reopens ‘forgery’ case",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is at the moment grilling a former Minister of Aviation, Femi Fani-Kayode.\nThe former minister was invited to answer questions relating to the forgery of a medical report which he allegedly procured to evade his trial before a Federal High Court in Lagos, Channels TV is reporting.\nFani-Kayode was said to have arrived at the Lagos Office of the commission in the company of his lawyer at about 1pm, according to EFCC officials.\nHe is still answering questions from the EFCC investigators as at the time of this report.\nDetails loading…"
  },
  {
    "headline": "Pictures: Burial plans for late Baba Suwe revealed",
    "summarized_story": "Veteran actor, Babatunde Omidina alias Baba Suwe, who died on Monday will be buried in his residence in Elepe, Ikorodu in Lagos on Thursday.\nRelatedNo tags for this post."
  },
  {
    "headline": "Buhari Suspends Inauguration Of NNPC Limited Board Indefinitely",
    "summarized_story": "President Muhammadu Buhari has suspended the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC).\n“President Muhammadu Buhari has directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC) scheduled for Wednesday 24th November 2021 until further notice,” said Mustapha.\nNNPC Group Managing Director, Mr Mele Kyari, was directed to take necessary steps to ensure that the incorporation of the NNPC Limited was consistent with the provisions of the PIA.\nIn line with the provisions of Section 59(2) of the PIA 2021, President Buhari also approved the appointment of the Board and Management of the NNPC Limited, with effect from the date of incorporation of the company.\nOther members included Dr Tajudeen Umar (North East), Mrs Lami Ahmed (North Central), Mr Mohammed Lawal (North West), Senator Margaret Okadigbo (South East), Mr Constance Marshal (South South), and Mr Pius Akinyelure (South West)."
  },
  {
    "headline": "UPDATED: EFCC Questions Femi Fani-Kayode",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Tuesday interrogated a former Minister of Aviation, Femi Fani-Kayode.\nFani-Kayode was said to have arrived at the Lagos Office of the commission in the company of his lawyer at about 1pm.\nHe is still answering questions from the EFCC investigators as of the time of this report.\nThe EFCC had charged him alongside a former Minister of Finance, Nenadi Usman, and two others on 17 counts of conspiracy, money laundering, and fraud.\n“From my records, the second defendant had written the court five times excusing his trial on medical grounds."
  },
  {
    "headline": "Terrorists Plotting To Establish Camp In Niger, Govt Raises Alarm",
    "summarized_story": "Islamic State of West Africa Province (ISWAP) and Boko Haram terrorists are planning to establish a camp in Niger State, authorities have said.\nThe Secretary to the State Government (SSG), Ahmed Matane, raised the alarm on Tuesday while briefing reporters in Minna, the state capital.\nHe stated that the insurgents, said to be spotted in communities bordering Nigeria and Benin Republic, have started going around to indoctrinate the people.\n“ISWAP is trying to establish a camp at National Park at Babana in Borgu Local government Area of Niger State,” Matane said.\nThey have assured us that they are ‘God sent’ to establish an Islamic caliphate."
  },
  {
    "headline": "Lagos #EndSARS Report Riddled With Errors, Inconsistencies – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Alhaji Lai Mohammed, has said that the #EndSARS report by the Lagos State Judicial Panel of Inquiry was riddled with so many errors and inconsistencies.\nHis comments come a week after the judicial panel probing allegations of police brutality in Lagos State submitted its findings to Governor Babajide Sanwo-Olu.\nYet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\nCNN AND OTHERSThe CNN has been celebrating the leaked report of the Lagos State Judicial Panel of Inquiry.\nSecondly, CNN rushed to the air to celebrate an unsigned and unverified report that is riddled with inconsistencies, errors, discrepancies, innuendoes."
  },
  {
    "headline": "Police Rescue Five Students, 19 Others Abducted By Bandits In Zamfara",
    "summarized_story": "Police authorities in Zamfara say they have rescued 24 people abducted by bandits in Shinkafi and Tsafe Local Government Areas of the state.\nHe explained that among those rescued by the security operatives were five students, including a student of the Federal Polytechnic, Kaura Namoda.\nAccording to him, police tactical operatives rescued the abducted victims from different locations in the state.\nThe Commissioner for Information in Zamfara, Ibrahim Dosara, received the abducted victims from the police on behalf of the state government.\nDosara gave an assurance that the state government would ensure security around schools to protect the students in the state."
  },
  {
    "headline": "Concerned APC Stakeholders welcome Buhari's approval of APC Convention in Feb -",
    "summarized_story": "The Concerned APC Stakeholders has welcomed President Muhammadu Buhari’s approval of February as the Convention date.\non the 6th of October, 2021, the Group wrote a letter to President Muhammadu Buhari calling on him to intervene in some urgent matters posing existential threat to the party.\nThey commend the President as the leader of the party for demonstrating an obvious willingness to listen to all party men and women without any iota of prejudice.\nThey called on the Caretaker/Extra-Ordinary Convention Planning Committee ( CECPC) to take the presidential mandate further by immediately commencing the process that will give APC a befitting and transparent convention that all members would be proud of.\nApart from showing the seriousness it attach to the approval by the president, the Caretaker Committee they say, must not only announce a specific date for the convention, it must put all the necessary machineries for the conduct of the convention in place without further delay."
  },
  {
    "headline": "We are only mandated to relate with political parties",
    "summarized_story": "The Independent National Electoral Commission says it has been mandated to only relate with all political parties and not factional group or groups in the country.\nThe Oyo state Resident Electoral Commissioner of Australia INEC Mutiu Agboke disclosed this at a meeting held with parties stakeholders held in Ibadan.\nAgboke said this is in a bid avoid the commission been accused of serving the interest of other individuals or factions of a political party.\nAccording to him, However, let it also be on record that INEC has a mandate relate with all political parties and not factional group or groups as recently experienced with a particular political party.\nAgboke said the commission would also supports the Electoral Amendment bill that allows political parties to choose their candidates through direct primaries if assented toAgboke disclosed that over four hundred thousand registered voters are still yet to receive their Permanent Voters Cards out of the over two million registered voters in the state."
  },
  {
    "headline": "Breaking: Akeredolu imposes curfew on Ikare",
    "summarized_story": "The Ondo State Government has ordered the imposition of a twenty-four hour curfew on Ikare town, headquarters of Akoko North East Local Government Area of the State with immediate effect.\nThis is coming on the heels of security reports and credible intelligence arising from the situation in Ikare.\nSpecifically, some deaths have been recorded as a result of sporadic gunshots that have pervaded the ancient town in the last 12 hours.\nSecurity agencies, especially the Police and Amotekun have already been directed to ensure full compliance and enforcement of the curfew imposed.\nAll Traditional Rulers, Opinion and Religious Leaders are enjoined to give maximum support to this order just as they are to rein in their subjects and wards."
  },
  {
    "headline": "Akeredolu, Security heads celebrate retiring Commissioner of Police, Bolaji Salami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has described the retiring Commissioner of Police in the state, Bolaji Salami, as a gentleman who is dedicated to duty.\nGovernor Akeredolu saluted him for being a reliable officer, describing him as a team player.\nAt a brief valedictory session held in his honor during the State Security Council Meeting on Monday, Governor Akeredolu commended the manner the Commissioner of Police handled the #Endsars crisis in the state, describing it as impressive.\nGovernor Akeredolu also applauded the retiring officer for his collaboration with other security agencies in the state, saying he is a bold man.\nI cherish coming here to work with you and I will say that I enjoyed everything in this state,” the retiring CP added."
  },
  {
    "headline": "Nigeria Must Take Its Place Internationally For The Sake of Black Population – Prof Bolaji Akinyemi",
    "summarized_story": "At the beginning of 2015, then U.S. President Barack Obama invoked the Leahy Laws against Nigeria by allocating a mere $700,000 and blocked the sale of Cobra helicopters to the West African country.\nHowever, the Obama administration thought otherwise because of what it termed gross human rights violations by the Nigerian military in the war against Boko Haram.\nThe Leahy Laws or Leahy Amendments are human rights laws that prohibit the U.S.\nDepartments of State and Defence from providing military assistance to foreign security force units that violate human rights with impunity.\nProf. Bolaji Akinyemi, former Foreign Affairs Minister and former Director General of the Nigerian Institute of International Affairs, discusses the recent threat by U.S. Secretary of State, Antony Blinken, to apply the Leahy Laws against Nigeria if allegations of rights violations are found to be credible"
  },
  {
    "headline": "#EndSARS Witness Attacked as Lawyer Alleges Threat to His Life – Trending With Ojy Okpe",
    "summarized_story": "Ebun-Olu Adegboruwa, Senior Advocate of Nigeria, alleged on Monday that there is a threat to his life over the report of the Lagos state judicial panel on police brutality and the Lekki tollgate investigation.\nMeanwhile Kamsi Ochuko, one of the witnesses who testified before the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and other matters, in a video that is now making the rounds on social media narrated how she was attacked by unknown men for testifying before the panel."
  },
  {
    "headline": "Nigeria Will Replace Fuel Subsidy with N5,000 Transport Grant for Poorest Citizens",
    "summarized_story": "Zainab Ahmed, Nigeria’s minister of finance, budget and national planning, says Nigeria will remove fuel subsidies by 2022 and replace them with a N5000-a-month transportation grant to the poorest Nigerians.\nSpeaking at the launch of the World Bank Nigeria Development Update (NDU) on Tuesday, the minister said the grant will go to about 20 to 40 million Nigerians who make up the poorest population of the country.\nShe said the final number of beneficiaries will depend on the resources available after the removal of the fuel subsidy.\nThe World Bank in the development update had said the poorest 40% in Nigeria consume less than 3% of the total PMS in the country, highlighting that the rich were benefiting more from the subsidies.\nAhmed said this move is set for June 2022, but the federal government hopes to do this before June — in line with the Petroleum Industry Act (PIA)."
  },
  {
    "headline": "#EndSARS: Nigeria Government Discredits Lagos Panel Report, Calls It ‘Recycled Fake News’",
    "summarized_story": "Nigeria’s Minister of Information Lai Mohammed has dismissed the report submitted by the Lagos State EndSARS panel on Police Brutality as a hoax, which did not follow the evidence at hand.\nMohammed said it was shocking that the same allegations made by Nigerians were merely compiled and submitted as a report by the panel set up to investigate the claims of police brutality.\n“It is an intimidation of the majority by a minority,” Mohammed submitted."
  },
  {
    "headline": "Nigerian Politicians Are Messing up God’s Design for Our Country – Dr. Chukwuemeka Ezeife",
    "summarized_story": "As respected leaders from the southeast mount pressure on President Muhammadu Buhari to grant amnesty to Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra, the one thing they appear to have forgotten is that Kanu has a track record of breaking promises.\nNot only did Kanu violate the terms of his bail in 2017 after his release from detention by a Federal High Court, he transformed into a megalomaniac that created an armed wing to attack the Nigerian state in his quest for the restoration of the Republic of Biafra in the southeast.\nDespite this, some leaders from the region are confident that they can keep him in check once he is released to them.\nIn this interview, Dr. Chukwuemeka Ezeife, a former governor of the state, tells ARISE what has changed between 2017 when Kanu jumped bail and fled the country, and why he should be given a third chance.\nDr. Ezeife was a member of the delegation that met with Buhari last week to plead for Kanu’s release."
  }
]