[
  {
    "headline": "Kate Henshaw: Fighting for Women’s Rights",
    "summarized_story": "So we need good women, we need intelligent women, we need women in the community, we need women leaders, we need market women, we need women in religious societies who will continue to preach and advocate for a saner society and to banish all these traditional practices that are indeed harmful to their fellow women.\nWhat is your view on how your colleagues use the social media?\nShe can make the choice to go into the social media space knowing fully well that it’s a mixed world out there.\nSo, social media if it’s not used correctly can turn out to be harmful like, fake information, impersonation of people’s character, using of their images without permission.\nSo, we need to be more careful in the usage of social media in terms of disseminating information."
  },
  {
    "headline": "Kate Henshaw: Fighting for Women’s Rights",
    "summarized_story": "So we need good women, we need intelligent women, we need women in the community, we need women leaders, we need market women, we need women in religious societies who will continue to preach and advocate for a saner society and to banish all these traditional practices that are indeed harmful to their fellow women.\nWhat is your view on how your colleagues use the social media?\nShe can make the choice to go into the social media space knowing fully well that it’s a mixed world out there.\nSo, social media if it’s not used correctly can turn out to be harmful like, fake information, impersonation of people’s character, using of their images without permission.\nSo, we need to be more careful in the usage of social media in terms of disseminating information."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "Aisha Gambo: In Pursuit of Sustainable Development",
    "summarized_story": "As president of Nowa, what major initiative have you embarked upon to improve the lives of members of your organisation?\nThere is always room for NOWA members in the NOWA organization.\nIn what ways do you cater to both the developmental and moral growth of women and children left behind by late officers?\nWe also give work opportunities when the chance arises.\nHow do you balance being at the head of a property development and interior decorating company at the same time?"
  },
  {
    "headline": "Alaafin: Makinde visits Oyo over passage of foremost monarch",
    "summarized_story": "Governor Seyi Makinde of Oyo State has visited the palace of the late Alaafin of Oyo, Oba Lamidi Atanda Olayiwola Adeyemi, DAILY POST reports.\nMakinde who is the chief mourner and governor of the state has however visited the palace.\nMakinde while speaking further, added that he has received calls from prominent Nigerians over the death of the monarch.\n“For that, we are sad but we are also happy because Kabiyesi lived long on the throne of his forefathers.\n“What this means is that Kabiyesi lived a fulfilled and impactful life not only in Oyo State but throughout the federation."
  },
  {
    "headline": "45th Alaafin of Oyo, Lamidi Adeyemi has joined his ancestors at Bara – Palace source",
    "summarized_story": "The 45th Alaafin of Oyo, Oba Lamidi Atanda Olayiwola Adeyemi has joined his ancestors at Bara, a palace source revealed to DAILY POST.\nThe palace source, a prince and a member of the Adeyemi family, told DAILY POST on Sunday that Bara is about five minutes drive from the palace.\nHe said that previous Alaafin of Oyo were buried at Bara.\nHe said that the culture of burying the Alaafin at Bara started during the era of the old Oyo empire.\nDAILY POST gathered that Christian and Muslim clerics had earlier on Saturday offered prayers for the soul of the monarch."
  },
  {
    "headline": "2023: Senator Utazi declines Senatorial ambition in support of Gov Ugwuanyi’s bid",
    "summarized_story": "The federal lawmaker added amid jubilation that the decision was also to promote the existing peace in Enugu North Senatorial District in particular and Enugu State in general.\nInnocent Ezeoha to, on behalf of the people, thank Senator Utazi for his sportsmanship and sacrifice in declaring his support for the governor’s senatorial bid.\nThe PDP Zonal Chairman stated that the meeting was equally for the party delegates from Enugu North Senatorial District to renew their stance and reassure Gov.\nUgwuanyi, reassuring him that they will follow his directions as the only leader they know in Enugu State.\nThe two former State Chairmen of the PDP from Enugu North Senatorial District, Engr."
  },
  {
    "headline": "7 Nigerian leaders worked for UK, US – Fani-Kayode lists ‘secrets’",
    "summarized_story": "Former Aviation Minister, Femi Fani-Kayode (FFK) has stated that a number of Nigerian leaders worked for the United Kingdom and the United States.\nIn an essay titled ‘What they will not tell you’, he listed issues he described as secrets about Nigeria that have not been told, answered or explained.\n“Of the 13 leaders that have led our country since 1960 seven were working for the British MI6 and/or the American CIA.\nFFK added that the Nigerian people, though blissful in their naivety and innocence, still believe that they control their own future and destiny.\nDid you know that approximately 800,000 Nigerian civilians, including women and children, were killed by Biafran forces during the three-year Nigerian civil war."
  },
  {
    "headline": "I’m not a saint, but I didn’t steal money or land – Ogun Ex-Governor, Gbenga Daniel",
    "summarized_story": "Former Ogun State Governor, Otunba Gbenga Daniel, has said though he is not a saint, he did everything right as the Ogun helmsman.\nDaniel was the Governor of Ogun from 2003 to 2011 when he was succeeded by Senator Ibikunle Amosun.\nThe EFCC later arraigned him on a 32-count charge, bordering on alleged false declaration of assets, land allocations and ‘underpayment’ of values and alleged mismanagement of N211.3 million Ogun State fund.\nIn 2019, the Ogun State High Court hearing the case since 2011, knocked out 15 out of the 32 counts, leaving Daniel to open his defence on the remaining 17 counts.\nSpeaking to journalists, the Ogun East senatorial aspirant maintained that he neither stole lands nor money as governor."
  },
  {
    "headline": "Two shot dead as gangsters rampage in Offa",
    "summarized_story": "Youths suspected to be thugs went on rampage on Sunday in Offa, Offa local government area of Kwara state.\nThe bloody street brawls between rival thugs in the town, it was gathered, started around Olofa way area of the metropolis.\nPlease be security conscious and stay safe.”Spokesperson of Kwara Police Ajayi Okasanmi said that the clashes started around 11:30 am.\nOkasanmi said: “The public disturbance experienced today started around 11:30am, when some suspected gangsters from Isale Offa and Ojale areas both in Offa clashed.\n“Before the arrival of police men dispatched to the scene, two of the clashing gangsters named Samad Adeyemi (21) of Isale Offa and one Abdulahi Mohammed (20) of Ojale had been shot dead."
  },
  {
    "headline": "Traditional worshippers condemn open display of Alaafin’s corpse",
    "summarized_story": "Traditional worshippers have condemned the open display of the corpse of late Alaafin of Oyo, Oba Lamidi Adeyemi, during the Islamic funeral prayer.\nThey also enjoined all Yoruba monarchs to emulate the late Adeyemi in promoting traditional religion, which is the basis of their crown.\nThe traditionalists recalled the late Alaafin never minced words in condemning open display of Yoruba Obas” remains for any purpose while alive.\nThe Chairman, Traditional Religion Worshippers’ Association of Nigeria, Oyo State Branch, Surveyor Adefabi Fadiran and the Secretary, Mogaji Dr. Fakayode Fatunde, appreciated Sango devotees in Oyo town for tolerating the Muslim and Christian worshippers for the initial prayers before taking over the last traditional rites.\nThe statement said the maturity showed by the Sango worshippers would go into history as worthy of emulation, asking all traditional worshippers to start different appeasements to smoothen the late Alaafin’s transition to the great beyond."
  },
  {
    "headline": "Bandits kidnap lecturer, daughter in Kaduna, demand N100m ransom",
    "summarized_story": "A lecturer in the Polytechnic, who confirmed the abduction to The Nation, said the bandits trailed, attacked and kidnapped them around Kasuwan Magani Saturday eveningAccording to the lecturer: “Engr.\nRamatu Abarshi, and her daughter, Amira were returning to Kaduna, after a visit to Mariri village in Kajuru Local Government, where they distributed household items to the less privileged.\n“After they distributed the items, and were coming back to Kaduna that the bandits stopped their chattered vehicle, and kidnapped them in a village, near Kasuwan Magani,” the lecturer said.\nA friend of the kidnapped victims told journalists the bandits have made contact with the family and demanded N100 million for their release.\nKaduna Police spokesman ASP Muhammad Jalige said he was going to contact the DPO in charge of Kasuwan Magani to get details of the incident."
  },
  {
    "headline": "PHOTOS: Makinde pays condolence visit to Alaafin’s palace",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Emulate Alaafin in promotion traditional religion, worshippers urge obas",
    "summarized_story": "Traditional religion worshippers on Sunday charged all Yoruba obas to emulate the departed Alaafin Oyo, Oba Lamidi Adeyemi, to promote Yoruba traditional religion, the bases for their crowns.\nChief Adefabi Fadiran, Oyo State Chairman of Traditional Worshippers Association of Nigeria, gave the charge in Ibadan in a statement he issued.\nHe stated that the association condoled with the Oyomesi (Oyo traditional chiefs), Oloris, children of Oba Adeyemi, Sango devotees worldwide and all Oyo indigenes over the passing of the first class traditional ruler.\n“The maturity showed by the Sango worshippers would go into history as worthy of emulation.\n“We ask all traditional worshippers to start different appeasements to smoothen the departed Alaafin’s transition to the great beyond."
  },
  {
    "headline": "Consensus: Tambuwal, Hayatu-Deen agreed to accept outcome –Gov Mohammed",
    "summarized_story": "He said Saraki, Tambuwal Hayatu-Deen and him collectively approached former military president, Gen. Ibrahim Babangida (retd) to organise northern elders to chose a consensus candidate for the North in PDP.\nNorthern Leaders in a communiqué signed by Prof. Ango Abdullahi, had on Friday shortlisted Saraki and Mohammed as two leading presidential aspirants to represent the zone in the PDP presidential primary.\nAbdullahi said Saraki, Mohammed, Tambuwal and Hayatudeen had submitted themselves for the drive towards a consensus candidateHe said the decision on Saraki and Mohammed was arrived at, based on certain criteria adopted in the assessment of the four aspirants by the northern elders.\nRather it was the group of presidential aspirants made up of Sen. Bala Mohammed, Aminu Tambuwal.\nSen. Bukola Saraki and Alhaji Mohammed Hayatu-Deen that collectively, freely and willingly approached Gen Babangida to help select from amongst themselves a consensus presidential Aspirant."
  },
  {
    "headline": "The Sun Award special –Amaechi, Minister of Transportation",
    "summarized_story": "Minister of Transportation, Chibuike Rotimi Amaechi, has described The Sun Public Service Icon award as special, which will serve as a motivation to do more in the service of the country.\nThe Sun Management had given me an award previously, but this one recognising my contributions in the public service is special.\nUkeh said: “Your selection for this award is purely based on merit because of your outstanding performance in public office and development of the country.\n“You later became governor of Rivers State.\n“When you were governor, Rivers State witnessed quantum development in road infrastructure, education, security among others."
  },
  {
    "headline": "Imo explosion: Buhari orders clampdown on illegal refineries – The Sun Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has described the explosion that rocked an illegal crude oil refinery in Abaezi forest in Ohaji-Egbema Local Government Area of Imo State as a national disaster,.\nHe, therefore, directed the armed forces, security and intelligence agencies to intensify clampdown on illegal refineries following reported deaths of tens of people in the disaster.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAre you a Man 40 yrs and above?\nDo not miss the Vital Information, it goes off in 2 days!"
  },
  {
    "headline": "2023 Presidency: Govs, Igbo leaders meet May 5",
    "summarized_story": "From Magnus Eze, EnuguOhanaeze Ndigbo has convoked the Imeobi meeting to arrive at a common position on next year’s Presidential Elections.\nThe Imeobi Ohanaeze with membership consisting of Governors of the seven Igbo Speaking States, former Presidents of the Senate, former Governors, serving ministers and ex-ministers as well as members of the council of elders headed by Chief Emmanuel Iwuanyanwu, would hold in Enugu on Thursday, May 5.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details .\n“It is for this reason that I call on all political parties in the country, to zone the Presidency to the South East,” he counselled."
  },
  {
    "headline": "Insecurity: Opposition, Kukah to blame for US delay in delivering 12 Tucano fighter jets –Presidency – The Sun Nigeria",
    "summarized_story": "The Presidency noted that the delay was compounded by constant lobbying of US Congress by the government’s opponents, including Kukah.\nIt is a pity therefore that US policy and support towards our country, including during the Buhari administration, has been so inconsistent.\n“In 2015 the then newly-elected Buhari government requested US military support in the form of Super Tucano jet fighters for the Nigerian Air Force.\nThe Nigerian military, security, and intelligence services repeatedly made this request.\n“It is all very well to claim it is in the United States’ interests to help Nigeria become an even-better democracy and stable country."
  },
  {
    "headline": "Atiku, Tambuwal, Lamido Reject Saraki, Mohammed as Northern PDP’s Consensus Presidential Candidates",
    "summarized_story": "Atiku, Tambuwal, Lamido, and Hayatu-Deen, who are all PDP presidential aspirants, have also denounced the report of Prof. Ango Abdullahi, which endorsed Saraki and Mohammed as the North’s consensus presidential candidates with the backing of a former military President, Gen. Ibrahim Babangida (rtd).\nThe First Lady invited all presidential aspirants of all political parties, to the Ramadan Iftar, where he also hosted elected officials of the political parties.\nThe report, which shortlisted Saraki and Governor Mohammed as the two northern presidential consensus candidates, urged Tambuwal and the investment banker and economist, Hayatu-Deen to drop their presidential ambition.\nAlso denouncing the controversial consensus report, former Jigawa State Governor, Lamido called on all members of the party in the northern states to ignore it.\nThe position of the northern elders is not only injurious to the North but equally injurious to the northern aspirants,” Lamido explained."
  },
  {
    "headline": "Alaafin Lamidi Adeyemi Dies, Buried in Glory",
    "summarized_story": "He said the late Alaafin was a patriotic and highly respected traditional ruler who had immeasurable love for his people and great faith in a united Nigeria.\nIn a condolence letter to Makinde, Jonathan noted that the late Alaafin was a skilled custodian of the tradition and culture of his people who had an eventful and epoch-making reign.\nOsun State governor, Oyetola, also described the passing of the Alaafin of Oyo, as shocking, saying it signified the end of an era.\nOyetola also commiserated with his Oyo State counterpart, Makinde, and the entire Yoruba race over the demise of the late monarch.\nGovernor of Benue State, Ortom also yesterday commiserated with the government and people of Oyo State over the transition to the great beyond of the Alaafin of Oyo."
  },
  {
    "headline": "THISDAY Group Announces New Appointments",
    "summarized_story": "*Konye Nwabogor replaces Ruth Osime as Executive Editor of Style Magazine *Funke Babs-Kufeji serves as Deputy Executive EditorVanessa ObiohaThe board of directors of THISDAY Group has announced new appointments for THISDAY STYLE with immediate effect.\nKonye Nwabogor replaces Ruth Osime, the long-standing editor of THISDAY Style, whose 19-year tenure created a standard for Style reporting in Nigeria.\nShe started at THISDAY Style as a Lifestyle Correspondent in 2010.\nShe joined the THISDAY Style team in 2007, and her 15-year journey in the organisation has seen her take up roles as a correspondent, Assistant Editor, and Editor.\nIn 2020, she was appointed the Print Editor of THISDAY Style, a position that has prepared her for her current role."
  },
  {
    "headline": "Breaking : Alaafin, Oba Lamidi Adeyemi, Dies at 83",
    "summarized_story": "By Kemi OlaitanThe Alaafin of Oyo, Oba Lamidi Adeyemi, is dead.\nAdeyemi, the third from the Alowodu Ruling House, died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti.\nThe monarch had been sick and a plan had been made to fly him abroad before he passed on late Friday night.\nA source familiar with the medical travel plan said his tickets and those of a few wives were already procured.\nWith the demise of Oba Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch as his predecessor, Bello Ladigbolu, was from the Agunloye House."
  },
  {
    "headline": "2023: Under Pressure Jonathan Hints at Contesting, Tells Supporters to ‘Watch out’",
    "summarized_story": "‘I cannot tell you I’m declaring; the political process is ongoing’Adedayo AkinwaleFormer President Goodluck Jonathan yesterday in Abuja came under intense pressure from his supporters, urging him to contest for president in 2023 and he did not disappoint, telling them that “the political process is ongoing; just watch out.\njust watch out.”The supporters, comprising largely women and youths, stormed the Jonathan Foundation’s Abuja office, chanting his name, forcing him to come out to address them.\nThe supporters, who demanded the return of Jonathan as President in 2023, arrived in four buses and displayed placards at Jonathan’s Taraba Close, Maitama office.\nSome of the placards read, “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; and “Goodluck we love you”, among others.\n“We want Jonathan to run under the Nigeria Peoples Party."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "N1.7bn Wema Bank Fraud: Pastor Faults Police Report, Accuses Assistant Police Commissioner, Businessman Of ‘Harassment, Malicious Prosecution’",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nPhase II as part of the additional security requested by Wema Bank.\nHe also voluntarily executed all requisite documents in favour of Wema Bank in this regard.\nSome of the letters by Shibahwells to Wema Bank in this regard are attached as ANNEXURE 4.\n“The consultant brought this discovery to our client’s attention and also notified Wema Bank."
  },
  {
    "headline": "Worshippers injured as church building collapses in Lagos",
    "summarized_story": "Some members of the Deeper Life Bible Church located at Iragbo community in Badagry, Lagos state, were injured on Sunday when the church building collapsed.\nAccording to NAN, there was heavy rain during which the church building collapsed around 9:30am while service was in progress.\nTopohozin Tunde, a member of the church, said six members of the church sustained serious injuries.\n“Around 9:30 this morning, during the church service, there was a heavy storm which hit the church building, and before we knew what was happening, the whole church building collapsed.\nAlso speaking on the incident, Thoma Agodi, the Baale of Iragbo community, said he was inside his palace when a resident came to inform him that the church building had collapsed."
  },
  {
    "headline": "Worshippers injured as church building collapses in Lagos",
    "summarized_story": "Some members of the Deeper Life Bible Church located at Iragbo community in Badagry, Lagos state, were injured on Sunday when the church building collapsed.\nAccording to NAN, there was heavy rain during which the church building collapsed around 9:30am while service was in progress.\nTopohozin Tunde, a member of the church, said six members of the church sustained serious injuries.\n“Around 9:30 this morning, during the church service, there was a heavy storm which hit the church building, and before we knew what was happening, the whole church building collapsed.\nAlso speaking on the incident, Thoma Agodi, the Baale of Iragbo community, said he was inside his palace when a resident came to inform him that the church building had collapsed."
  },
  {
    "headline": "Macron 're-elected' as president of France",
    "summarized_story": "Emmanuel Macron has been projected as the winner of the presidential election in France, defeating far right-wing candidate, Marine Le Pen.\nPollsters are individuals or organisations that collect, analyse and present data from a poll — in this case, an election.\nFrench pollsters typically release election result projections when polls close in major cities based on data from voting units that close at 7pm.\nAdvertisementFollowing the announcement of the projected win, Macron delivered a speech to his supporters in Paris, thanking them for backing him and expressing his commitment to addressing the country’s problems.\n“A great wind of freedom could have blown over our country; the fate of the ballot box wanted otherwise."
  },
  {
    "headline": "Macron 're-elected' as president of France",
    "summarized_story": "Emmanuel Macron has been projected as the winner of the presidential election in France, defeating far right-wing candidate, Marine Le Pen.\nPollsters are individuals or organisations that collect, analyse and present data from a poll — in this case, an election.\nFrench pollsters typically release election result projections when polls close in major cities based on data from voting units that close at 7pm.\nAdvertisementFollowing the announcement of the projected win, Macron delivered a speech to his supporters in Paris, thanking them for backing him and expressing his commitment to addressing the country’s problems.\n“A great wind of freedom could have blown over our country; the fate of the ballot box wanted otherwise."
  },
  {
    "headline": "Sanwo-Olu: Lagosians will ride trains on blue line rail by Q1 2023",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, says the state’s blue line rail project has reached 90 percent completion.\n“This is the first time I am taking you on the blue line to see where we are.\nThe first phase of the blue line rail project starts from Mile 2 and terminates at Marina,” the governor was quoted as saying.\n“Marina Station is an elevated station and it stretches out to outer Marina and terminates where the Governor’s residence is.\nThe major aspect apart from the Marina Station is a sea crossing from Eko Bridge to join the outer Marina."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "2023: Aisha Buhari wants women as running mates to candidates",
    "summarized_story": "The first lady, Aisha Buhari, has urged political parties to always consider women as running mates to candidates contesting elections into various positions across the country.\nBuhari was speaking on Saturday night when she hosted Presidential Aspirants from various political parties to a Ramadan (Iftar) breakfast at the State House, Abuja.\n“ In fact, it is high time women are adopted as running mates at all levels considering their voting strength and active involvement in political processes.\nThe first lady, enjoined the presidential hopefuls to remain focused on issues that strengthened the nation`s unity, brotherhood and national cohesion.\nDave Umahi of Ebonyi and APC aspirant, expressed appreciation to the first lady for bringing the presidential aspirants together to foster unity and nation cohesion."
  },
  {
    "headline": "APC, PDP primaries: The battle before the real war",
    "summarized_story": "With the array of presidential aspirants already on parade, the real battle is expected to take place at the primaries.\nIn the last few months, several leading politicians have publicly signified their interest to contest their party presidential ticket in the two major parties.\nThe expression of interest form for presidential aspirants is expected to go for N30 million while the nomination form is pegged at N70 million.\n“Money would be a defining factor in the primaries both in APC and PDP because both parties are setting for delegate convention,” Oke stressed.\nHe advocated for a holistic change in the manner presidential primaries are conducted in Nigeria."
  },
  {
    "headline": "FG reopens another four land borders three years after",
    "summarized_story": "The Federal Government has given directive for the re-opening of four additional land border closed in August of 2019.\nAccording to a circular released on Friday by the Nigeria Customs Service (NCS), which was signed by E.I Edorhe, deputy comptroller-general of Customs, the Federal Government directed the Customs to open Idiroko, Ogun State; Jibiya, Katsina State; Kamba, Kebbi State and Ikon, Cross River State borders with immediate effect.\nRecall that the Federal Government in August 2019 closed the nation’s borders as part of policy geared towards preventing the smuggling of illegal arms, food and agricultural products into the country in order to stimulate local production.\nIn December 2020, the Presidency announced the immediate re-opening of the first four major land borders including Seme, Illela, Maigatari and Mfun.\nThis action was believed to be in readiness for the commencement of the African Continental Free Trade Agreement (AfCFTA) scheduled for January 1, 2021."
  },
  {
    "headline": "Truck set ablaze after crushing music director in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-A Benin-based music director has been killed by a trailer along the Benin bypass at Ahor N’Uselu in Uhunmwonde local government area of Edo State.\nSources disclosed that the music director identified simply as Simon was crushed when a commercial motorcycle that he boarded was knocked down by the truck.\nThe accident occurred when both the truck driver and the motorcycle rider were avoiding another trailer that broke down on the busy road.\nThe unfortunate incident triggered a pandemonium during which irate youths set the truck ablaze in the middle of the road about 10:16a.m on Friday, April 22, 2022.\nThe operatives were also on the ground when the burnt truck was being towed from the accident spot."
  },
  {
    "headline": "Edo charges residents on food, environmental hygiene as Lassa fever cases reach 185 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has confirmed 185 cases of Lassa fever since the outbreak of the epidemic in the state, with the government reiterating the need for residents to maintain good environmental health and sanitation habits as well as proper hygiene in the handling and preparation of food.\nProf. Akoria noted, “Edo State has confirmed 185 Lassa fever cases since the outbreak of the disease in the state.\nThe fatality rate stands at 14 percent and this is not acceptable to the Edo State Government.\n“The intervention of the Edo State Government is targeted at reducing the number that fall ill with Lassa fever as we focus on downstream approaches that require ownership and participation.\nWe are also working with the Edo State Waste Management Board.”“I call on the people to improve their food and environmental hygiene in the state,” she urged."
  },
  {
    "headline": "Obaseki mourns passing of Alaafin of Oyo, Oba Lamidi Adeyemi – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\nIn a statement, the governor described the Alaafin of Oyo, as a “a great ruler, who displayed kindness and compassion to his people, espousing the virtues of hard work, diligence and love for humanity.”He noted, “It is with a heavy heart that I mourn the passing of a revered monarch and an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\n“Brave and cheerful, Oba Adeyemi embodied the ideals of the Yoruba nation, promoting the rich culture and heritage of the Yorubas and providing wise counsel to those who sought guidance from the throne.”According to him, “During his over 50-year spell on the throne, Oyo witnessed numerous transformations and transitions, but he remained true to his heritage and harped on the need for brotherly love and conscientious living.”“He will be remembered for his kind-nature, conviviality, wisdom and love for humanity and living.”Obaseki commiserated with the Government and people of Oyo State, the Oyo Kingdom, family, friends, associates and well-wishers, and prayed that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo updates digital database of students, advances on new education policy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is updating a digital database of all students in the state to facilitate planning and budgeting for the education sector in line with the government’s efforts to sustain the progress recorded in the sector over the past five years.\nThe Edo State Commissioner for Education, Dr. Joan Osa-Oviawe, who disclosed this to journalists in Benin City, said the ministry has already captured over 45,000 biometric data of secondary school students in private and public schools across the state.\nOviawe said, “We have also started gathering the biometrics of secondary school students and have captured 45,000 SSS3 students from both public and private schools across the state.\nWe plan to capture all students in our schools from kindergarten to tertiary level both in private and public institutions.\nWe are looking at the disarticulation of junior secondary schools from the senior secondary schools.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Osun 2022: West APC backs Oyetola’s re-election",
    "summarized_story": "By Sunday Oguntuyi, OsogboStakeholders of the All Progressives Congress (APC) in Osun West Senatorial District, have reiterated their readiness to work for the re-election of Gov.\nThis is as they urged intending aspirants for the 2023 general election to to put the governor’s reelection as priority.\nOsun West Senatorial District APC chairman, Hon.\nAkintola called on political office holders to stop divisive politicking and fall in line with the party leadership at all levels.\nHe added that a reconciliation committee had been constituted to appeal to the aggrieved party members."
  },
  {
    "headline": "Enugu senator, Utazi drops reelection bid, backs Gov Ugwuanyi for senate",
    "summarized_story": "Senator representing Enugu North senatorial district on the platform of the People’s Democratic Party (PDP), Chukwuka Utazi, on Sunday, announced his decision not to seek reelection to pave the way for the state governor, Ifeanyi Ugwuanyi to go to the senate after his tenure in 2023.\nSenator Utazi made the announcement while addressing delegates of the PDP from Enugu North Senatorial District and other stakeholders of the party.\nHe said he did not purchase the expression of interest and nomination forms of the party for the senatorial seat to give Gov.\nThe federal lawmaker added that the decision was also to promote the existing peace in Enugu North Senatorial district in particular and Enugu State in general.\nInnocent Ezeoha to, on behalf of the people, thank Senator Utazi for his sportsmanship and sacrifice in declaring his support for the governor’s senatorial bid."
  },
  {
    "headline": "Oyibo Odinamadu: Nigeria’s woman of many firsts takes a bow at 94",
    "summarized_story": "She was, too, the 1st National Vice-President of the Unity Party of Nigeria (UPN) to the late sage, Chief Obafemi Awolowo, in the Second Republic.\nShe later had Master of Arts in Education (Social and Philosophical Foundations) from Teachers College, Columbia University, New York, U.S. in 1953.\nThe late Oyibo married Benedict Obidimma Odinamadu in 1957 and they were blessed with four children – two boys and two girls.\nSupport programs of Head-Start Kindergarten Education for children aged two to five years in Eastern Nigeria;ii.\nii & iii through writing and publishing of articles and books, as well as by sometimes speaking under the Igbo Customs Series programme"
  },
  {
    "headline": "SEC Committed to Technology Driven Market – Yuguda",
    "summarized_story": "Mr. Lamido Yuguda, the director general of Securities and Exchange Commission (SEC) has restated the commission’s commitment to ensuring that technology plays a major role in ensuring that the nation’s capital market attains its full potentials.\nYuguda who stated this during a meeting with the Management Team of Financial Sector Deepening (FSD) Africa in Abuja, weekend.\nYuguda expressed the Commission’s delight with the support from FSD Africa in the areas of Human Resource transformation, Information Technology Strategy as well as Capital Market Master Plan review.\n“I cannot but express my support to FSD Africa for the various support they have given to the Commission in various areas.\nTo this end, the review of the Capital Market Master Plan better positions the SEC to deliver on these objectives in these very challenging times."
  },
  {
    "headline": "Pandemonium As Police Fingered In Death Of Traditional Head, 2 Others In Ondo",
    "summarized_story": "Pandemonium was let loose in Kajola community, Odigbo local government area of Ondo State on Saturday as youths in their hundreds mobilised to burn the police station in the area over alleged police recklessness, leading to the death of three persons including a traditional community head (Baale).\nThe victims, namely David Olowofeyekun, Gbenga Abayomi and Kola Akinduro, who was the Head of Korede Village, were on a motorcycle and heading home from their farms when the incident happened.\n“It was not due to the recklessness of the police officers, they took one way and they had an accident.\nSo there was no way the police can be reckless in a situation whereby there is a route to take and they took another one.\n“Of course it was an oncoming vehicle that they collided with and died, it was not police recklessness there,” the PPRO said."
  },
  {
    "headline": "Macron Beats Le Pen In French Election – Projections – Leadership News",
    "summarized_story": "Emmanuel Macron has beaten far-right candidate, Marine Le Pen, to win the French presidency, projections show.\nHe has taken 58% of the vote to her 42% in a narrower victory than their previous contest in 2017.\nMacron, 44, will make history by becoming the first French president to be re-elected in 20 years.\nLe Pen, 53, was running for the presidency for a third time.\nThe defeated far-right candidate says she will never abandon the French people as she concedes defeat in the presidential election."
  },
  {
    "headline": "Consensus: NECG Wants Bala Mohammed To Step Down For Saraki",
    "summarized_story": "The North-East Consolidated Group (NECG) has commended the Northern Elders for shortlisting the President of the 8th Senate, Abubakar Bukola Saraki, and Bauchi State governor, Bala Mohammed, as the possible consensus presidential candidate of the North on the platform of People’s Democratic Party (PDP) in the 2023 general elections.\nThe group in a press release signed by its chairman, Mr. Ahmad Abubakar (A.Yobe) and made available to journalists, appreciated the bold step taken by the Northern Elders under the leadership of Prof. Ango Abdullahi and the Northern PDP caucus ahead of PDP presidential primaries.\nA. Yobe noted that the former Senate President Saraki was more than qualified to fly the PDP flag at the 2023 polls over Governor Mohammed.\nADVERTISEMENTHe said Governor Bala Mohammed should be considerate and patriotic enough to step down for Saraki in the interest of the North.\n“Senator Abubakar Bukola Saraki being a well groomed personality, young and perfectly fit for the task of rescuing Nigeria from the glaring danger Nigeria is facing today."
  },
  {
    "headline": "Consensus: NECG Wants Bala Mohammed To Step Down For Saraki",
    "summarized_story": "The North-East Consolidated Group (NECG) has commended the Northern Elders for shortlisting the President of the 8th Senate, Abubakar Bukola Saraki, and Bauchi State governor, Bala Mohammed, as the possible consensus presidential candidate of the North on the platform of People’s Democratic Party (PDP) in the 2023 general elections.\nThe group in a press release signed by its chairman, Mr. Ahmad Abubakar (A.Yobe) and made available to journalists, appreciated the bold step taken by the Northern Elders under the leadership of Prof. Ango Abdullahi and the Northern PDP caucus ahead of PDP presidential primaries.\nA. Yobe noted that the former Senate President Saraki was more than qualified to fly the PDP flag at the 2023 polls over Governor Mohammed.\nADVERTISEMENTHe said Governor Bala Mohammed should be considerate and patriotic enough to step down for Saraki in the interest of the North.\n“Senator Abubakar Bukola Saraki being a well groomed personality, young and perfectly fit for the task of rescuing Nigeria from the glaring danger Nigeria is facing today."
  },
  {
    "headline": "Abuja Airport To Introduce Park ‘N’ Pay",
    "summarized_story": "Preparations are in advanced stage to introduce ‘park and pay’ for motorists at the Nnamdi Azikiwe International Airport, Abuja.\nSpeaking to LEADERSHIP over the weekend, the airport manager/regional general manager, North Central, Kabir Mohammed, said this was aimed at bringing sanity to the airport.\nMohammed, who was deployed to head the Abuja Airport on March 10, 2022, further said the introduction of the park and pay at the airport will address the problems of touts, who go about harrasing and extorting innocent drivers who bring in passengers at the airport.\nHe also said as part of the ongoing reorganisations at the airport, the roudy taxi drivers and the illegal businesses going on at the front of the departure hall at airport will be addressed.\nHe said the effort has improved on the situation to a great extent, making entry into the airport easier."
  },
  {
    "headline": "How Kukah, others slowed delivery of Super Tucano jets to fight terrorists",
    "summarized_story": "The Presidency on Sunday attacked the Catholic Bishop of the Diocese of Sokoto, Mathew Kukah and others for delaying the delivery of Super Tucanos to fight terrorists in the country.\nThe presidency, in a statement issued by its spokesman, Garba Shehu on Sunday said it was a pity that US policy and support towards the country, including during the Buhari administration, had been so inconsistent.\nIt said in 2015, the then newly-elected Buhari government requested US military support in the form of Super Tucano jet fighters for the Nigerian Air Force.\nIt added that the Nigerian military, security, and intelligence services repeatedly made this request, but that the US administration of the time concurred, stressing that the delivery of such jets would help deliver a critical turning point in Nigeria’s struggle against jihadist terrorists across the Sahel.\n(Kukah even took to addressing the US Congress himself, briefing his audience on the history of coups in Nigeria—without, of course, mentioning that none had occurred since 1993, some 29 years ago),” it said."
  },
  {
    "headline": "Rudiger will leave Chelsea in summer: Tuchel",
    "summarized_story": "Germany defender Antonio Rüdiger will leave Chelsea at the end of the season after turning down the offer of a new contract, manager Thomas Tuchel confirmed on Sunday.\n“The situation is that he wants to leave the club,” Tuchel said after their 1-0 English Premier League (EPL) win over West Ham.\nWe will miss him a lot.”The 29-year-old Rüdiger, who has roots in Sierra Leone, was reportedly offered record terms for a defender from Chelsea.\n“We gave everything —- me and the club —- but we could not fight anymore because of the actions,” Tuchel explained.\nBundesliga champions Bayern Munich could also be interested in him as a replacement for the departing Niklas Süle."
  },
  {
    "headline": "PDP stages 96th NEC meeting ahead 2023 presidential primaries",
    "summarized_story": "Ahead of its national convention slated for May 28 and 29, 2022 to elect a presidential candidate for the 2023 election, the Peoples Democratic Party (PDP) has summoned 96th session of its National Executive Committee (NEC) meeting for Wednesday, May 4, 2022.\nThe Benue state Governor, Samuel Ortom’s 37-man zoning committee had submitted its report on April 13, 2022 to the National Working Committee (NWC) for onward transmission to the NEC.\nA source who is also a member of the party’s NEC reliably informed Blueprint that part of the agenda is consideration of the Ortom committee’s report and the forthcoming national convention.\n“Of course, the major is consideration of the Ortom Committee’s report, issues around our National Convention to elect presidential candidate will also be discussed,” he said.\n“The venue of the meeting is the NEC hall PDP National secretariat, Wadata Plaza, Abuja and the time is 2pm.”PDP appealed to all NEC members to attend."
  },
  {
    "headline": "Breaking: Tyson Fury lands stunning punch on Dillian Whyte, retains WBC heavyweight title",
    "summarized_story": "WBC champion Tyson Fury produced a stunning one-punch stoppage in the sixth round to beat fellow Briton Dillian Whyte, and then suggested he may now retire from the sport.\nWhyte, admirably, got to his feet within the count before staggering into the referee as the fight was halted.\nBut the challenger could not get close to Fury, who used his height and reach advantage to keep Whyte at bay as the fight progressed.\nThen came arguably Fury’s greatest punch of what is proving to be an illustrious career.\nHe teed it up with a left jab and as Whyte stepped forward, Fury whipped in the brutal uppercut."
  },
  {
    "headline": "Breaking: Scores dead as fire engulfs illegal oil bunkering site",
    "summarized_story": "Up to 100 people, mostly youth are believed to have been burnt to death, while others sustained varying degrees of burns at an ilegal oil bunkering site at Abaezu forest in Ohaji Egbema local government area of Imo state Friday night.\nAn eyewitness who spoke to Blueprint said the fire incident occurred around 11pm, and that smoke from the fire enveloped the atmosphere which made villagers uncomfortable and forced them to wake up.\nReacting to the incident, Imo state Commissioner for Petroleum Resources, Rt.Hon.\nGoodluck Nanah Opiah, said the fire incident took lives of many youth at the site.\nHe added that the owner of the ilegal refinery was nowhere to be found, and had been declared wanted by the government."
  },
  {
    "headline": "Fashola Inaúgurates FMBN Board, Executive Management Team",
    "summarized_story": "By Mathew Dadiya, AbujaThe Minister of Works and Housing, Babatunde Raji Fashola has officially inaugurated the newly appointed members of the Federal Mortgage Bank of Nigeria (FMBN) Board and Executive Management Team.\nFashola urged the new oard and executive management team to work within the conceptual framework of FMBN as a specialized banking institution that was established to deliver on a specialized job of driving affordable housing for Nigerians nationwide; Group Head, Corporate Communications ofFMBN, Lawal Isa K/Sauri stated.\nHe also advised the Board and Management to promptly engage with the Central Bank of Nigeria (CBN) and ensure FMBN’s compliance with regulatory stipulations for operating as a Bank.\nFurthermore, the minister expressed appreciation to the immediate past Board and Executive Management Team for their service saying their efforts cannot be forgotten.\nIn his response, the new FMBN Managing Director/Chief Executive, Madu Hamman on behalf of the Board members and Executive Management Team, thanked President Muhammadu Buhari for the privilege and opportunity to serve the nation."
  },
  {
    "headline": "World Bank tells Nigeria to drop fuel subsidy",
    "summarized_story": "By Emmanuel ObisuePresident of the World Bank Group, David Malpass has asked the Federal Government to have a rethink on its policy on fuel subsidy, stating that the huge amount being expended on the policy could be channeled into other critical sectors.\nMalpass noted this on Wednesday at a media briefing at the ongoing World Bank/International Monetary Fund Spring Meetings in Washington DC, United States.\nIt would be recalled that the Nigerian Senate last week approved N4 trillion for petrol subsidy in 2022.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nThe World Bank had in November 2021 warned Nigeria not to delay any further in removing the fuel subsidy which had been described as a major drain and waste on the economy."
  },
  {
    "headline": "Naira depreciates, sells at N419.50 to dollar",
    "summarized_story": "Agency reportThe Naira exchanged at N419.50 to the dollar at the Investors and Exporters window on Thursday.\nThis represents 0.28 per cent depreciation, compared to N418.33 to the dollar recorded on Wednesday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.50.\nThe Naira sold for as low as N410 to the dollar within the day’s trading.\nA total of $124.85 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "ONU inducted into ASURI hall of fame",
    "summarized_story": "By Eunice OrikeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, has made history as he became the first inductee into the hall of fame of the Academic Staff Union of Research Institutes ASURI.\nThis historical event took place at the sensitisation workshop of the staff of FMSTI on the full implementation of the Presidential Executive Order 05 yesterday in Abuja.\nThe Minister enunciated that the essence of the Executive Order 5, is to ensure that Nigeria acquires technologies that will help in positioning the nation towards self-sufficiency.\nHe said, “The Executive Order is revolutionary as it is a contribution of the Ministry towards transforming the nation to the level of greatness ordained by God”.\nThe National Coordinator of the Strategy implementation task office of the Presidential Executive Order No."
  },
  {
    "headline": "Okowa says Delta Agro-Industrial Park to be ready Nov 2022",
    "summarized_story": "By Anastacia Eluwa, AsabaGovernor Ifeanyi Okowa of Delta State on Thursday, said the Agro-Industrial Park being executed by his administration at Aboh-Ogwashi, Aniocha South Local Government Area, would be ready for inauguration in November, 2022.\n“Let me appreciate the level of cooperation we have had with the Ogwashi-Uku community because they gave us over 180 hectares of land for the Agro-Industrial Park.\n“The contractor has promised to deliver the project towards the end of November which means if they start the road project now, they will still have time during the break in August and in the later part of October to finish with the road project,” Okowa said.\n“The park is a community of its own where you have various agro-processing industries co-sharing common facilities for agro-indstrialisation in the state,” he stated.\nHe said that the state government was working with the Federal Ministry of Trade and Investment to designate the park as an Export Processing Zone."
  },
  {
    "headline": "Imo Tragedy: Buhari Mourns Victims, Orders Clampdown On Illegal Refineries",
    "summarized_story": "President Muhammadu Buhari has mourned the victims of an explosion that rocked an illegal refinery in Imo State and also ordered an intensified clampdown on illegal refining sites across the country.\nAbout 100 people were killed on Friday after a fire engulfed an illegal crude oil refining site in the Abaezi forest, in Ohaji-Egbema Local Government Area of Imo State.\nTo forestall a reoccurrence of the incident, the President ordered the armed forces, security, and intelligence agencies to intensify the clampdown on illegal refineries.\nMeanwhile, the Imo State Governor Hope Uzodimma has commiserated with the families of affected victims.\nThe governor warned those still in the business of running illegal refineries in the state to stop forthwith or face the wrath of the law."
  },
  {
    "headline": "2023: Nigeria Needs A President Who Understands The Economy – Saraki",
    "summarized_story": "The former Senate President and presidential aspirant under the People Democratic Party (PDP) Bukola Saraki says the choice of Leadership Nigerians make in 2023 is critical to the nation’s economic development.\nHe said this while addressing the party’s delegates in Minna, the Niger State Capital ahead of the forthcoming primaries.\nRead Also: 2023 Presidency: PDP Northern Elders Endorse Saraki, Bala Mohammed“2023 is very important to the nation because where the country is now, the nation is consumed by insecurity.\nYou cannot travel, people cannot go to farm; we cannot even sleep in our homes with our eyes closed.\nTherefore, Nigeria needs a president who understands the economy, a president that can unite all Nigerians."
  },
  {
    "headline": "NDLEA Seizes Cocaine In Teabags, Arrests Traffickers At Lagos, Abuja Airports",
    "summarized_story": "Operatives of National Drug Law Enforcement (NDLEA) have seized 4.1 kilograms of cocaine wrapped in tea bags as well as arrested four traffickers at the Lagos and Abuja airports.\nThe spokesman of the agency, Femi Babafemi, said this in a statement issued on Sunday, explaining that the cocaine was intercepted from a Brazil-based cartel.\n“At least, four traffickers involved in the attempts to import and export illicit drugs through the country in the last week are now in the custody of the agency,” the statement read.\nTwo blocks of cocaine weighing 2.10kg were discovered when his luggage was searched.\nIn his reaction to the feats, the Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Fury Beats Whyte To Retain World Heavyweight Title",
    "summarized_story": "Tyson Fury retained his WBC heavyweight crown on Saturday, stopping Dillian Whyte in round six of an all-British bout at a delirious Wembley Stadium before repeating his suggestion that he would now retire.\nUnbeaten Fury, 33, had said this would be his last fight and announced immediately afterwards: “This might be the final curtain for the Gypsy King.\nNo boxer has held all the major world heavyweight belts since Britain’s Lennox Lewis, who became the undisputed champion in 1999.\nFury hailed Whyte as a “warrior”, predicting he would be a world champion one day but said his opponent had met a “great” in the sport.\n“And unfortunately for Dillian Whyte, he had to face me here tonight."
  },
  {
    "headline": "Liverpool Overcome Everton Battle To Keep Pressure On Man City",
    "summarized_story": "Liverpool kept the pressure on Manchester City at the top of the Premier League table and pushed local rivals Everton towards relegation with a 2-0 win in the Merseyside derby on Sunday.\nSecond-half goals from Andy Robertson and Divock Origi ensured they remained there despite a spirited display in a feisty encounter.\nA 12th consecutive home league win for Liverpool cuts City’s lead at the top of the table back to one point with five games remaining.\nThe attitude and the way the lads stuck to their task today was really, really good,” said Lampard, despite his side enjoying just 17 percent possession.\nGordon also had claims for a penalty appeal waved away to Lampard’s dismay for a push by Joel Matip."
  },
  {
    "headline": "Police hunt for fleeing lover who machetted girlfriend in Ondo -",
    "summarized_story": "The Police in Ondo State are investigating the bloody attack on a lady identified as Funmilola Ogundare by her boyfriend in Akure.\nHer boyfriend left her in a pool of blood.\nThe boyfriend left her in a pool of blood inside an apartment located in Ijapo Estate.\nSpokesperson of Ondo State Polo Command, Mrs Funmilayo Odunlami, explained that the suspect took the victim to his friend’s house where he allegedly committed the dastardly act.\nThe suspect took the woman to the apartment to spend the night with her."
  },
  {
    "headline": "APC reschedules sale of nomination forms, sends directors on leave -",
    "summarized_story": "The All Progressives Congress (APC) has rescheduled for next week the sale of expression of interest and nomination forms for elective positions which was originally fixed for today.\nThe leadership of the party has also sent all the six directors at the APC National Secretariat, on compulsory leave.\nAs the party rev up arrangements for their primaries which must be concluded by 3rd June , the Independent National Electoral Commission (INEC) has asked them to submit their membership registers to enable it monitor the primaries at all levels."
  },
  {
    "headline": "INEC suspends CVR in parts of Imo, Anambra, Kaduna States",
    "summarized_story": "The Independent National Electoral Commission has suspended the continuous voters registration exercise in parts of Imo, Anambra, and Kaduna States due to the spate of insecurity and attacks on its field officers.\nChairman of INEC, Mahood Yakubu also disclosed that security agencies have enough time to address the challenges before the 2023 elections.\nProfessor Yakubu spoke during a meeting with resident electoral commissioners in Abuja, where he disclosed that the voters registration exercise has been suspended in 54 centers in imo, 42 centers in Anambra, as well as the registration centers in jemaa, kaura, and large areas of Birnin Gwari and Giwa local government areas in Kaduna state.\nProfessor Mahmood Yakubu also directed all registered political parties to submit copies of membership register to the commission, in compliance with the new Electoral Act 2022, before their primary elections."
  },
  {
    "headline": "Osinbajo pays courtesy visit to Olubadan, meets Oyo APC stakeholders -",
    "summarized_story": "Vice President, Professor Yemi Osinbajo earlier today paid a courtesy visit to the Olubadan of Ibadan Land.\nHe also engaged with Stakeholders of the Oyo State All Progressives Congress chapter in Ibadan, Oyo State"
  },
  {
    "headline": "Bala Mohammed: We Are Not Just Northerners, We Are Presidential Candidates",
    "summarized_story": "People’s Democratic Party presidential candidate & Bauchi State Governor, Bala Mohammed joins ARISE News to address reports that suggest his rejection for obtaining the presidential ticket, alongside Bukola Saraki, for his party.\nHe also speaks on the state of current affairs with the PDP in the issues of consensus candidacy."
  },
  {
    "headline": "‘We Need a Rounded Approach to Economic Growth to Preserve Our Forests’- Laila Johnson-Salami",
    "summarized_story": "ARISE Environmental Correspondent, Laila Johnson-Salami, has carried out research on the carbon concentration of these forests and what this means for Africa.\nRelatedStories No Content AvailableShe shares details from her report, her proposition for carbon financing and what this could look like for Nigerians and their livelihood."
  },
  {
    "headline": "Macron Beats Le Pen to Win Second Term as French President",
    "summarized_story": "With counting still under way, projections by France’s five main pollsters put Macron on course to win more than 57% of the vote in Sunday’s runoff compared with 42% for Le Pen.\nThe 44-year-old Macron becomes the first incumbent to win a second term since Jacques Chirac two decades ago.\nYet the margin of victory is far narrower than last time, when Macron beat Le Pen by more than 30 points.\n“The result in itself represents a stunning victory,” Le Pen said, before leading her supporters in a chorus of the national anthem.\nOn Friday, the last day of campaigning, Macron pledged to do more to address the grievances of poorer voters to reverse the steady increase in support for Le Pen."
  },
  {
    "headline": "Shanghai Fences Up Covid-Hit Areas, Fuelling Fresh Outcry",
    "summarized_story": "Shanghai authorities battling an outbreak of COVID-19 have erected fences outside residential buildings, sparking fresh public outcry over a lockdown that has forced much of the city’s 25 million people indoors.\nShanghai reported 39 COVID-19 deaths for April 23, versus 12 a day earlier and by far the most during the current outbreak.\nThe city recorded 19,657 new locally transmitted asymptomatic cases, versus 20,634 a day prior, and 1,401 symptomatic, versus 2,736.\nNationwide, China reported 20,285 new asymptomatic coronavirus cases for Saturday, versus 21,423 a day earlier, with 1,580 symptomatic cases, versus 2,988.\nBeijing recorded 22 new COVID-19 cases – all locally transmitted – compared with six the day before, prompting a number of gyms and after-school activity providers to suspend in-person classes."
  },
  {
    "headline": "French Vote as Incumbent President Macron Aims to Beat Far- Right Le Pen",
    "summarized_story": "After a divisive election campaign, Ms Le Pen faces an uphill battle with her 44-year-old opponent polling ahead.\nThere are plenty of shy Le Pen voters here too.\nApprentice accountant Séréna, 18, is worried about the war in Ukraine: “We don’t really know what Le Pen feels about Putin.\nHe was narrowly beaten by Marine Le Pen but won in cities including Marseille and Nantes.\nThe town of Trappes, to the south-west of Paris, is a Mélenchon stronghold where Le Pen voters are in short supply."
  }
]