[
  {
    "headline": "NLC mobilises for fresh Kaduna strike, alleges agreement breached",
    "summarized_story": "THE Nigeria Labour Congress on Tuesday said it would resume its suspended industrial action in Kaduna State over the mass sacking of workers and other anti- labour practices by the Governor Nasir El-Rufai administration.\nThough the NLC was not definite, it directed its state councils and affiliate unions to mobilise and officially communicate to all employers of labour in the state for the latest action.\nThe NLC took the decision after the emergency National Executive Council meeting presided over by its President, Ayuba Wabba, on Tuesday.\nWabba accused El-Rufai of failing to respect the Memorandum of Understanding brokered between the NLC and the state government by the Federal Government.\nAccording to him, the governor has continued to violate the provisions of the MoU, especially the “No victimisation clause”."
  },
  {
    "headline": "Detained Ondo #EndSARS protester released, baby christening holds today",
    "summarized_story": "The Ondo State High Court sitting in Olokuta Correctional Centre, Akure, has granted bail to Kemisola Ogunniyi, the #EndSARS protester who was delivered of baby in prison.\nEighteen-year-old Ogunniyi and three others are standing trial for allegedly vandalising a property during the #EndSARS protest in Akure in October last year.\nShe gave birth to a baby boy in prison last Wednesday.\nShe said granted the bail based on humanitarian ground, “and for the purpose of the christening of the baby which will take place on Wednesday (today).\nThe defendant also has a right to bail.”The judge admitted Ogunniyi to bail in the sum of N10m with one surety."
  },
  {
    "headline": "Night club promoter allegedly swindles man of N4.3m",
    "summarized_story": "By Onozure DaniaA 28 year old night club promoter and event planner, Baba Williams, who allegedly swindled a man of N4.3million, under false pretence of exchanging it in to US Dollars,was yesterday arraigned before a Lagos Magistrates’ Court, sitting in Tinubu.\nWilliams is facing a three count charge bordering on conspiracy, obtaining by false pretence, fraud and stealing preferred against him by the Police.\nThe defendant who resides at Idejo Street Victoria Island, was arraigned before Magistrate Mrs T.O.\nAccording to the prosecutor the offence committed is punishable under Sections 411, 314 and 287, of the criminal laws of Lagos State 2015.\nShe said the sureties must have evidence of three years, tax payment to the Lagos State Government, present National Identification card."
  },
  {
    "headline": "Senate Minority Leader, Abaribe rocks “The Dot Nation ” T-Shirt",
    "summarized_story": "By Levinus Nwabughiogu-AbujaSenate Minority Leader, Senator Enyinnaya Abaribe yesterday wore “The Dot Nation” T-Shirt to his office in the national assembly to showcase his Igboness.\nIPOB has been clamoring for self rule outside the Nigerian state, a development the government has vehemently resisted.\nBuhari had said: “That IPOB is just like a dot in a circle.\n“And the way they are spread all over the country, having businesses and properties, I don’t think IPOB knows what they are talking about.\nApparently, showcasing his Igboness, Senator Abaribe, a known face of the main opposition in Nigeria and critic of Buhari’s administration dressed in the T-shirt to office."
  },
  {
    "headline": "Farmers/Herders clashes: Reps initiate Climate Change Bill to tackle insecurity",
    "summarized_story": "By Johnbosco AgbakwuruABUJA—IN a bid to find a lasting solution to the incessant clashes between farmers and herders, the joint climate change bill review committee and the legal working group yesterday met to fast track the passage of the Bill on Climate Change aimed at ending the clashes.\nREAD ALSO: $3m bribery: Court sentences ex-Rep Farouk Lawan to 7 years imprisonmentSpeaking to journalists, Chairman of the House of Representatives ad-hoc committee on Climate Change, Rep Samuel Onuigbo, said climate change has significantly contributed to the raging problem of insecurity faced in the country.\nOnuigbo, who represents Ikwuano/Umuahia North and South Federal Constituency of Abia State, was Chairman of the House Committee on Climate Change in the 8th Assembly and had sponsored the bill on Climate Change in 2016 but it was not assented to by President Muhammadu Buhari after it was passed into law.\nThe lawmaker noted that climate change was responsible for farmers/herders clashes, banditry, kidnappings and insurgency among others.\nWe know the impact of climate change on Nigeria in particular and its contribution to some of the challenges we are having security wise like clashes of farmers and herders."
  },
  {
    "headline": "NPC, NBC amendment bills draconian, anti-free press — Guild of Editors",
    "summarized_story": "The Guild argued that while the sponsors of the bills claim that the amendments were geared towards moderating the ‘recklessness of the media, the bills are actually criminalising journalism practice in Nigeria.\nThe body of editors argued that the media, which serve as the ‘oxygen of democracy’ would be strangulated if the bills are passed into law.\nWhile the intention of the sponsor of the bills is suspicious, the bills negate all known features of media regulatory bodies in the world,’’ the Guild said.\nAnd that all other members of the Board shall be appointed by the President on the recommendation by the Minister of Information.\nThe NGE added that the two bills if passed, would compound the nation’s negative image in the global community."
  },
  {
    "headline": "Poverty reduction: Buhari sets up private equity fund",
    "summarized_story": "President Muhammadu Buhari—Inaugurates steering committeeBy Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari Tuesday approved the setting up of a private equity fund known as the Nigeria Investment and Growth Fund (NIG-Fund), to lead in resource mobilization drive and management for the poverty reduction initiative of his administration in a sustainable manner.\nMeanwhile, the National Steering Committee (NSC) of the National Poverty Reduction with Growth Strategy (NPRGS) was inaugurated at the presidential villa, Abuja.\nHe said that the NPRGS had already proposed the establishment of a private equity fund, the NIG-Fund, to lead resource mobilization drive and also manage the resources in a sustainable manner.\n“If India can lift 271 million people out of poverty between 2006 and 2016, Nigeria can surely lift 100million out of poverty in 10 years.\nIn his remarks, the Chairman of the committee, Vice President Osinbajo said the National Poverty Reduction with Growth Strategy would consolidate other efforts of the government to reduce poverty which include N-Power, school feeding and conditional cash transfer."
  },
  {
    "headline": "Iskilu Wakili: Court orders release of detained OPC members in Oyo [PHOTOS]",
    "summarized_story": "An Iyaganku Magistrate Court sitting in Ibadan, the Oyo State capital, has ordered the release of three members of Odua People’s Congress (OPC).\nDAILY POST recalls that the trio; Dauda Kazeem, Awodele Adedigba and Ramon Hasan were arrested in March this year after the arrested one Iskilu Wakili.\nOur correspondent recalls that the trio arrested the suspect and handed him over to the men of Oyo State Police command.\nThe arrest of the three OPC members has attracted reactions from some groups and individuals.\nThe Court, however, on Tuesday ordered the release of the detained OPC members."
  },
  {
    "headline": "Insecurity: Ohanaeze, ADF launch pact, to hold security conclave",
    "summarized_story": "The apex Igbo socio-cultural organization, Ohanaeze Ndigbo and a frontline Igbo group, Alaigbo Development Foundation, ADF, on Tuesday, launched a working partnership in search for remedies to the security challenges facing the South-East zone.\nDAILY POST reports that both groups made the commitment when the Chief Chidi Ibeh-led Ohanaeze Ndigbo Executive Committee members paid a courtesy call on the ADF President, Prof. Uzodinma Nwala in Enugu.\nIbeh told their host that the essence of the visit was to seek collaboration towards finding a lasting solution to the problems confronting Ndigbo.\n“We are here to tap from your experience and seek mutual cooperation with ADF to move Igboland forward,” Ibeh said.\nResponding, Nwala said he was elated by the visit, assuring that the ADF would partner with the Ohanaeze to resolve the issues affecting Ndigbo."
  },
  {
    "headline": "Buhari appoints Buratai as Ambassador to Benin Republic",
    "summarized_story": "President Muhammadu Buhari has deployed the former Chief of Army Staff, Lt.Gen.\nTukur Yusufu Buratai (rtd) Benin Republic as an Ambassador Nigeria.\nWhile the immediate Chief of Defence Staff, General Abayomi Gabriel Olonisakin (rtd) was also deployed to the Republic of Cameroon as Ambassador-Designate of Nigeria.\nGeoffrey Onyeama today 22 June 2021, presented Letters of Credence to the Ambassador-Designate of Nigeria to the Republic of Cameroon, General Abayomi Gabriel Olonisakin (Retired) and the Ambassador-Designate of Nigeria to the Republic of Benin, Lt.Gen.\nTukur Yusufu Buratai (Retired).”Recall that President Buhari, upon the retirement of the service chiefs, appointed them as non-career ambassador."
  },
  {
    "headline": "Buhari moves to reduce poverty in Nigeria, appoints Osinbajo, Governors",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja commenced the process to reduce poverty in Nigeria.\nBuhari inaugurated the National Steering Committee (NSC) of the National Poverty Reduction with Growth Strategy (NPRGS) chaired by Vice President Yemi Osinbajo.\nIn attendance were Osinbajo, Secretary to the Government of the Federation, Boss Mustapha, some governors and top government officials.\nBuhari noted that the NPRGS already proposed the establishment of a private equity fund, the Nigeria Investment and Growth Fund (NIG-Fund).\nBuhari said if India can lift 271million people out of poverty between 2006 and 2016, Nigeria can lift 100million out of poverty in 10 years."
  },
  {
    "headline": "Solid minerals areas development bill scales second reading in Senate",
    "summarized_story": "A Bill for an Act to establish Solid Minerals Areas Development Commission bill, which was sponsored by Senator Yakubu Oseni, passed second reading in the Senate on Tuesday.\n“The commercial value of Nigeria’s solid minerals has been estimated to run into hundreds of billions of dollars”.\nJustifying the bill, Senator Oseni argued that the bill when passed into law will provide template for formulation of policies and guidelines for the development of the mineral producing areas.\nDAILY POST recalls that the bill was first read on the floor of the Senate on 5th May, 2021.\nAfter contributions by other Senators in support of the bill, Senate President, Dr. Ahmad Ibrahim Lawan referred the bill to the Senate Committee on Solid minerals to turn in their report in four weeks time."
  },
  {
    "headline": "Corp members offer free medical services to Sokoto community",
    "summarized_story": "By Adamu Suleiman, SokotoThe National Youth Service Corps (NYSC) members yesterday organised a free medical outreach from which 1,500 people Gidan Kara in Wamakko Local Government Area of Sokoto State benefited.\n“This is why the NYSC engage the services of corps member doctors, and other medical-related graduates to attend to those in need.\nThe leader of the medical team, Dr Ishaya Lengdang said the exercise recorded over 500 treated cases.\nThe District Head of Wamakko, Alhaji Aliyu Barade thanked the NYSC for considering his community for the outreach.\nHe pleaded for the exercise to be a routine one with a call on other agencies to emulate the NYSC."
  },
  {
    "headline": "Group endorses Nasarawa lawmaker for second term",
    "summarized_story": "By Linus Oota, LafiaA political group in Nasarawa State, Azara Youths Association has unanimously endorsed the House of Representatives member for Keana, Awe and Doma Federal Constituency, Abubakar Nalaraba for a second term in 2023.\nThe group said they have resolved to join hands with other people within the constituency to ensure his re-election in 2023.\nThe group made their position known in a statement signed by the Chairman of Azara Youths Association Abdullahi Hamza and Secretary Aliyu Mohammed, a copy of which was made available to our correspondent yesterday in Lafia.\nADVERTISEMENTThe group said the decision to endorse the APC House of Representatives member was taken after critical and in-depth performance basement of the House of Representatives member.\n“After due consultations with the entire people of Doma, Awe and Keana, we the Azara Youths Association have thrown our weight behind the re-election of Abubakar Nalaraba to represent us again in 2023."
  },
  {
    "headline": "Why we didn’t sign MoU to end strike, by Nasarawa NLC",
    "summarized_story": "By Linus Oota, LafiaThe leadership of organised labour in Nasarawa State has said they refused to sign the Memorandum of Understanding (MoU) with Nasarawa State government to suspend the ongoing strike action because the government allegedly doctored the agreement.\nThe NLC Chairman explained that a committee set up after the commencement of the strike had collectively written an agreement (MoU) on what to do to end the strike.\nHe said the MoU collectively written stated that the last tranche of August 2016 salary arrears would be paid in June.\nIya said signing the agreement with the clause would mean mortgaging the future of workers in Nasarawa State.\nThe TUC Chairman further revealed that the workers would continue to stay at home until their demands are fulfilled by the state government."
  },
  {
    "headline": "Masari to communities: defend yourselves from bandits",
    "summarized_story": "By Augustine Okezie, KatsinaKatsina State Governor Aminu Bello Masari has warmed residents and members of Katsina communities to stand firm, fight and defend themselves from the intimidation of bandits in their areas.\nSame bandits are causing unrest in the state.”Masari, who gave the charge at the official inauguration of Council for the Regulation of Engineering in Nigeria (COREN), Katsina State’s office, said the challenges posed by bandits are surmountable.\nHe further challenged those indigenous to Katsina State to guard their places and fight the battle without fear.\nThe COREN President, Ali RAbi’u disclosed that the Katsina Office of COREN would absorb young professionals and build the professional standard among them.\nHe appreciated the Katsina State government for providing an edifice for the association and the Governor for supporting them in all areas of need."
  },
  {
    "headline": "You’re too small to decide on Biafra, IPOB replies S’East govs",
    "summarized_story": "From Stanley Uzoaru, OwerriIndigenous People of Biafra (IPOB) has responded to the recent utterance by the South East governors purportedly disowning its group.\nIn a statement by Emma Powerful, IPOB said their comments did not came to them as a surprise because, according to him, “they were the first people to proscribe us before the Federal Government tagged us terrorists.\n“So the South East self-acclaimed leaders are quick to disown IPOB and Eastern Security Network yet they are calling us to accept the calls for peaceful negotiations?\n“How can South East governors be so desperate for power beyond 2023 that they can sacrifice anything and anybody for personal gains?\nIn case they don’t know, even the northerners they are trying to impress understand the handwriting on the wall."
  },
  {
    "headline": "Security, welfare of Nigerians remain my top priority –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has assured that his administration would continue to give priority to security and welfare.\n“The PPCC has a membership made up of officials from relevant Minitries; Departments; Agencies and security agencies.\n“A public private partnership arrangement undertaken by the Ministry of Police Affairs to rejuvenate the National Public Security Communication System Network has been approved by the federal executive council.\nThis is with the intention to drive the police reform process by initiating, formulating, and implementing policies and programmes relating to policing and internal security.\nThe president recounted that on September 15, 2020, he assented to the Nigeria Police Bill which had been under legislative actions since 2014."
  },
  {
    "headline": "Media not political enemy of FG –NGE",
    "summarized_story": "Nigerian Guild of Editors (NGE) has rejected the proposed National Press Council (NPC) Act Amendment Bill before the House of Representatives and the National Broadcasting Commission (NBC) Act amendment Bill, describing them as draconian and an orchestrated move to stifle the press.\n“The media is not an enemy of the Federal Government and should not be seen as such by agents of government.\nAttacks by political elite on the media, which may have prompted the NPC amendment Bill and the NBC amendment Bill, are habitually not envisioned to win an argument on the values of journalism, but designed to intimidate media organisations,” the Guild said.\nOdebunmi Olusegun sponsored NPC amendment Bill are actually aimed at criminalising media practice in Nigeria.”Saying that the NPC Act amendment Bill and NBC Act amendment Bill negate all known features of media regulatory bodies in the world, the Guild said “while the NPC Act.\n“We are not aware of any media regulatory council in the world, which says that media regulatory council shall establish a National Press and Ethical Code of Conduct for media houses and media practitioners, which shall come into effect and be inaugurated after approval by the Minister of Information, and that the code shall be binding on every media houses and journalists."
  },
  {
    "headline": "Court orders FG to pay Rivers, Akwa Ibom $3.3bn oil revenue share",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court, yesterday, ordered the Federal Government to pay $3.3billion to Rivers and Akwa Ibom states as revenue share from crude oil sales.\nJustice Taiwo Taiwo, who passed the judgment, ordered that $1,114,551,610 be paid to Rivers State and $2,258,411,586 to Akwa Ibom being the amount separately claimed against the Federal Government from the share of $62 billion recovered from oil companies operating in the country.\nPlaintiffs in the suit are Attorney Generals of Rivers and Akwa Ibom states while the Attorney General of the Federation (AGF) and Minister of Justice was the sole defendant.\nThe judge held that the Federal Government admitted to the monetary claims of the two states brought against it by its refusal to defend the case when served with court processes.\nJustice Taiwo held that although the AGF office attempted to withdraw the press statement, the issue of the huge revenue generation was not addressed."
  },
  {
    "headline": "BREAKING: Farouk Lawan bags 7 years jail term",
    "summarized_story": "From Godwin TsaA High Court of the Federal Capital Territory(FCT) has convicted and sentenced former chairman of House of Representatives probe panel, Farouk Lawal to seven years imprisonment for demanding $3m bribe from an oil magnate, Femi Otedola.\nJustice Angela Otaluka in her judgment on Tuesday, convicted the ex- lawmaker on all three count charges the ICPC preferred against him.\nDetails soon"
  },
  {
    "headline": "ECOWAS Court Stops FG from Prosecuting Nigerians Using Twitter",
    "summarized_story": "By Udora OrizuThe ECOWAS Court of Justice in Abuja has restrained the federal government from imposing sanctions or doing anything whatsoever to arrest or prosecute any Nigerian and media houses using Twitter, pending the hearing and determination of a suit filed by the Socio-Economic Rights and Accountability Project (SERAP).\nThe court gave the order after hearing arguments from the solicitor to SERAP, Mr. Femi Falana (SAN), and lawyer to the federal government, Maimuna Shiru, following a suit filed on June 8 against the government by SERAP and 176 concerned Nigerians.\nThe court said: “The court has listened very well to the objection by Nigeria.\nAny interference with Twitter is viewed as inference with human rights, and that will violate human rights.\nThe Nigerian government must take immediate steps to implement the order.”Reacting to the ruling, Falana said the intervention of the ECOWAS Court is a timely relief for millions of Nigerians using Twitter who have been threatened with prosecution under the provision of the Penal Code relating to sedition."
  },
  {
    "headline": "Court Orders FG to Pay $3.3bn Oil Revenue to Akwa Ibom, Rivers",
    "summarized_story": "By Alex EnumahJustice Taiwo Taiwo of the Abuja Division of the Federal High Court on Tuesday, ordered the federal government to pay a total sum of over $3.3 billion to both Rivers and Akwa Ibom States, being their share of revenue from crude oil sales.\nThe amount represents what the two states separately claimed against the federal government as their share from the $62 billion recovered from the oil companies.\nWhile the Attorneys General of Rivers and Akwa Ibom States are plaintiffs in the suit, the Attorney General of the Federation (AGF) and Minister of Justice was the sole defendant.\n“I hereby make an order that $1,114,551,610 be paid to Rivers State as its share from the $62 billion oil revenue and another $2,258,411,586 be also paid to Akwa Ibom as its own share from the oil proceeds,” the judge said.\nJustice Taiwo held that although, the AGF office attempted to withdraw the press statement, the issue of the huge revenue generation was not addressed."
  },
  {
    "headline": "Updated: Court Sentences Ex-Lawmaker, Farouk Lawan, to 7 Years Imprisonment",
    "summarized_story": "Justice Otaluka handed down the jail term to Lawan after finding him guilty on all three-count criminal charges brought against him by the federal government.\nHe was also accused of receiving the sum of $620,000 cash from Otedola being part of the bribe.\nMeanwhile, the judge also ordered Lawan to refund the sum of $500,000 he collected from Otedola to the coffers of the federal government.\nLawan, before his arraignment was a four-term member of the House of Representatives, who represented Bagwai/Shanono Federal Constituency of Kano State between 1999 and 2015.\nIn the case marked FCT/HR/CR/76/13, Lawan was alleged to have demanded the sum of $3 million for himself from the Chairman/Chief Executive Officer (CEO) of Zenon Petroleum and Gas Limited, Otedola."
  },
  {
    "headline": "Senate Confirms Yahaya as Chief of Army Staff",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate Tuesday confirmed the appointment of Major General Farouk Yahaya as the Chief of Army Staff (COAS).\nThis was sequel to the consideration of the report of the Joint Committee on Defence and Army which screened Yahaya a fortnight ago.\nThe Chairman of the Joint Committee, Senator Aliyu Wamakko, in his presentation at plenary, said the committee was satisfied with the comprehensive and robust nature of the engagement and interactions with the nominee during the screening exercise.\nPresident Muhamnadu Buhari had earlier this month forwarded the name of General Yahaya to the Red Chamber for confirmation as Army Chief.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Approves FG’s Team to Engage With Twitter over Ban",
    "summarized_story": "President Muhammadu Buhari has approved the composition of the Federal Government’s team to engage with Twitter over the recent suspension of the operations of the microblogging and social networking service in Nigeria, the Ministry of Information has disclosed.\nThe statement noted that Twitter wrote to President Buhari seeking to engage with the Federal Government over the suspension, with a view to charting a path forward.\nTwitter ban was announced by the Information Minister two days after Twitter deleted President Buhari’s tweet wherein he threatened to deal with secessionist agitators “in the language they understand”.\nMore than 39 million Nigerians have a Twitter account, according to NOI polls, a public opinion and research organization based in Nigeria.\nNigerian telecoms operators complied with the government directive on the ban but Nigerians are circumventing ban using VPNShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Twitter Ban: Nigerian Government Threatens To Suspend Facebook, Instagram, WhatsApp, Others",
    "summarized_story": "The Nigerian Government has threatened to suspend all social media platforms that allow their apps to be used to propagate division of the country through inflammatory statements or posts.\nLai MohammedHe said Twitter made its platform available as a choice for people who want to destabilise and cause disunity in Nigeria.\nOn whether any channel of dialogue had been opened with Twitter, the minister said \"we tried to but they rebuffed us.\nAriyo said he was a Nigerian and a user of Twitter, noting that it was wrong for the committee chairman to rule him out of order.\nMeanwhile, some of the committee members expressed concern at the decision and action of the executive to suspend Twitter, stating that the country was sliding into totalitarianism."
  },
  {
    "headline": "Twitter Ban: Nigerian Government Threatens To Suspend Facebook, Instagram, WhatsApp, Others",
    "summarized_story": "The Nigerian Government has threatened to suspend all social media platforms that allow their apps to be used to propagate division of the country through inflammatory statements or posts.\nLai MohammedHe said Twitter made its platform available as a choice for people who want to destabilise and cause disunity in Nigeria.\nOn whether any channel of dialogue had been opened with Twitter, the minister said \"we tried to but they rebuffed us.\nAriyo said he was a Nigerian and a user of Twitter, noting that it was wrong for the committee chairman to rule him out of order.\nMeanwhile, some of the committee members expressed concern at the decision and action of the executive to suspend Twitter, stating that the country was sliding into totalitarianism."
  },
  {
    "headline": "Why Buhari Was Absent At Passing-out Of 418 Cadets By Police Academy",
    "summarized_story": "President Muhammadu Buhari did not attend the passing-out parade of 418 cadets of the Nigeria Police Academy, Wudil, Kano State, despite the fact that they had postponed the event several times because of him.\nSee Also Police Tension, Anger In Police Academy As Nigeria Police Refuse To Pass Out 418 Cadets Enrolled Since 2015On Tuesday, a top source said the postponement was partly to ensure Buhari attended the event.\nSaharaReporters had been told last week that the inefficiency at the NPF Academy stalled the passing-out of the cadet ASPs amidst the shortage of policemen to quell the insecurity in the country.\nThe police authorities have refused to organise our passing-out despite the coming of a new Inspector General of Police.”“It is not so for our colleagues in the National Defence Academy.\nSaharaReporters had also reported that the academy was presently screening the Regular Course 8 despite not passing out the Course 3, which was giving the cadets a lot of worry."
  },
  {
    "headline": "Why Buhari Was Absent At Passing-out Of 418 Cadets By Police Academy",
    "summarized_story": "President Muhammadu Buhari did not attend the passing-out parade of 418 cadets of the Nigeria Police Academy, Wudil, Kano State, despite the fact that they had postponed the event several times because of him.\nSee Also Police Tension, Anger In Police Academy As Nigeria Police Refuse To Pass Out 418 Cadets Enrolled Since 2015On Tuesday, a top source said the postponement was partly to ensure Buhari attended the event.\nSaharaReporters had been told last week that the inefficiency at the NPF Academy stalled the passing-out of the cadet ASPs amidst the shortage of policemen to quell the insecurity in the country.\nThe police authorities have refused to organise our passing-out despite the coming of a new Inspector General of Police.”“It is not so for our colleagues in the National Defence Academy.\nSaharaReporters had also reported that the academy was presently screening the Regular Course 8 despite not passing out the Course 3, which was giving the cadets a lot of worry."
  },
  {
    "headline": "Local Council Boss Resumes Work Under Mango Tree To Monitor Errant Workers In Rivers",
    "summarized_story": "The newly sworn-in Chairman of Emohua local government area of Rivers State, Dr. Chidi Julius Lloyd, on Tuesday, resumed duty under a mango tree within the council secretariat.\nHe said the aim is to check the attitude of civil servants to their duties while expressing worry over the lack of seriousness often displayed by local government workers.\n“I sat under the mango tree deliberately to check egress and ingress of staff.\nThey didn’t know that the chairman was under the mango tree.\n“The civil servants were just coming in the way they liked."
  },
  {
    "headline": "Lai: Any social media platform used to bring down Nigeria will be suspended",
    "summarized_story": "The federal government says it will not hesitate to suspend any social media platform, which allows activities that have a negative impact on the country.\nAdvertisementHe said the government would also suspend any platform that wants to toe the same path as the microblogging site.\n“On Twitter not being the only social media in Nigeria but banning Twitter alone, honestly, we suspended Twitter because Twitter became a platform of choice for those that want to bring down this country,” he said.\n“If any other platform does it, we will suspend their operations too.\nAdvertisement“If Nigerians do make money through Twitter, unfortunately, Nigeria has to be a country first before they can make that money."
  },
  {
    "headline": "Lai: Any social media platform used to bring down Nigeria will be suspended",
    "summarized_story": "The federal government says it will not hesitate to suspend any social media platform, which allows activities that have a negative impact on the country.\nAdvertisementHe said the government would also suspend any platform that wants to toe the same path as the microblogging site.\n“On Twitter not being the only social media in Nigeria but banning Twitter alone, honestly, we suspended Twitter because Twitter became a platform of choice for those that want to bring down this country,” he said.\n“If any other platform does it, we will suspend their operations too.\nAdvertisement“If Nigerians do make money through Twitter, unfortunately, Nigeria has to be a country first before they can make that money."
  },
  {
    "headline": "FG deploys Buratai to Benin Republic",
    "summarized_story": "The federal government has presented letters of credence to Tukur Buratai and Abayomi Olonisakin, as non-career ambassadors to the Republic of Benin and Cameroon, respectively.\nThe letters were handed over to the two ambassadors by Geoffrey Onyeama, minister of foreign affairs, in Abuja, on Tuesday.\nIn February, President Muhammadu Buhari appointed Buratai, former chief of army staff, and Olonisakin, former chief of defence staff, as non-career ambassadors.\nAdvertisementAlso appointed were Ibok-Ete Ibas, former chief of naval staff, and Sadique Abubakar, former chief of air staff.\nPresenting a report on behalf of the senate foreign affairs committee in February, Muhammed Bulkachuwa had said the nominees met the requirements for the positions."
  },
  {
    "headline": "FG deploys Buratai to Benin Republic",
    "summarized_story": "The federal government has presented letters of credence to Tukur Buratai and Abayomi Olonisakin, as non-career ambassadors to the Republic of Benin and Cameroon, respectively.\nThe letters were handed over to the two ambassadors by Geoffrey Onyeama, minister of foreign affairs, in Abuja, on Tuesday.\nIn February, President Muhammadu Buhari appointed Buratai, former chief of army staff, and Olonisakin, former chief of defence staff, as non-career ambassadors.\nAdvertisementAlso appointed were Ibok-Ete Ibas, former chief of naval staff, and Sadique Abubakar, former chief of air staff.\nPresenting a report on behalf of the senate foreign affairs committee in February, Muhammed Bulkachuwa had said the nominees met the requirements for the positions."
  },
  {
    "headline": "REWIND: The moment Farouk Lawan collected part of $3m bribe from Otedola (video)",
    "summarized_story": "On Tuesday, Farouk Lawan, a former member of the house of representatives, was convicted for bribery after a trial that lasted seven years.\nAs the chairman of the house committee that investigated the fuel subsidy scam, Lawan had approached Femi Otedola, billionaire businessman, to demand the bribe.\nAdvertisementOn April 23 and 24, Lawan visited Otedola at his residence to collect the said money in two tranches.\nOtedola would later testify in court that he gave Lawan $500,000 as instructed by the DSS.\nBelow is a video of Otedola’s meeting with Lawan, during which the former lawmaker received part of the money:"
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "#TwitterBan: ECOWAS Court restricts Nigerian government from imposing further sanctions",
    "summarized_story": "The ECOWAS Court sitting in Abuja has given an order restraining the Nigerian government from imposing sanctions or harassing, intimidating, arresting, or prosecuting Twitter or its users in the country.\nThis was met with varying levels of criticism which eventually led to the suit filed by SERAP.\nCurrently, SERAP has also filed a claim against the government in the Federal High Court on the same matter.\nAlthough this appears to be good news, the Nigerian government is not known to obey orders or judgments given by the ECOWAS Court.\nA good example is another case, SERAP v. Federal Republic of Nigeria & Anor, filed by the organisation in the sub-regional court."
  },
  {
    "headline": "Nithio FI to scale up off-grid energy access in Africa with $4.5m investment from FSD Africa",
    "summarized_story": "Today, June 22, 2021, Africa-focused renewable energy finance platform, Nithio FI announced that it has secured $4.5 million in funding to offer sustainable and renewable off-grid energy solutions for homes and small businesses in Kenya, Nigeria, and Uganda.\nIt is also looking to achieve its five-year goal of providing financing to more than 224,000 energy access products, like productive use appliances and solar home systems(SHS), across Africa.\nNithio Holdings — the parent company — is an AI-enabled energy financing platform whose mission is to standardise credit risk assessment by investing directly and efficiently in off-grid solar companies.\nCurrently, Nithio FI provides receivables-backed financing in Nigeria, Uganda, and Kenya, with plans to foray into other African countries in 2022.\nCommenting on this investment, Nithio FI Co-founder and CEO, Hela Cheikhrouhou believes that “in order to achieve universal energy access by 2030, last-mile financing must scale to the billions."
  },
  {
    "headline": "FRSC confirms 13 vehicles burnt in Lagos-Ibadan road tanker explosion",
    "summarized_story": "The Federal Road Safety Corps (FRSC) on Tuesday confirmed six tankers, five trucks and two cars destroyed in a tanker explosion at Ogere on the Lagos-Ibadan Expressway.\nFRSC sector commander in Ogun, Ahmed Umar, confirmed the incident, saying the disaster occurred at about 6.20 a.m.Umar said the explosion occurred in front of Romona trailer park on the expressway.\nWhile it lasted, the Ogun State Traffic Compliance and Enforcement Corps (TRACE), advised motorists to use alternative routes, as traffic build-up became unbearable for hundreds of vehicles trapped in the process.\nTRACE spokesman, Babatunde Akinbiyi explained that the tanker which was laden with fuel suddenly burst into flames affecting other vehicles.\nOn March 21, a fuel tanker was the cause of the fire on Otedola Bridge, also on the Lagos-Ibadan Expressway in which many vehicles were burnt."
  },
  {
    "headline": "For Nigeria, simply exiting recession is not enough",
    "summarized_story": "For Nigeria, simply exiting recession is not enoughThe Nigerian economy consolidated its recovery from recession as it grew further by 0.5% in Q1 2021.\nThis performance represents the second consecutive expansion following the country’s recovery from recession in 2020Q4.\nIt is, however, a slower growth when compared with the real gross domestic product (GDP) growth recorded in 2020Q1 (1.9%).\nDespite the positive…"
  },
  {
    "headline": "Nigeria-focused gold miner, Thor, lists on London exchange",
    "summarized_story": "Thor Explorations, a Nigeria-focused gold miner, on Tuesday, June 22, listed its shares on the London Stock Exchange (LSE) Alternative Investment Market (AIM) with an expected market capitalisation of around £127 million.\nThe Segilola Gold Project is considered Nigeria’s most advanced gold project with a total probable reserve of 517,800 ounces of gold, grading at…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Removal of illegal structures: We’ll not tolerate lawlessness in Edo – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the ongoing removal of illegal structures is in line with the State Extant Planning Laws and Regulations and aimed at ensuring order and sanitizing the built environment space.\nObaseki disclosed this when he visited the demolition site of 30 lock-up stores illegally built at Iyekogba Housing Estate, without a building permit.\nThe governor said: “Over the last few weeks, you will notice that our team has been going round the town to remove illegal structures that don’t have a building permit, particularly in areas with public activity.\n“A lot of people build shopping malls across the city without building plans or approvals from the appropriate authority.\nEven this store, which is an illegal structure, was served notice."
  },
  {
    "headline": "Edo intensifies removal of illegal structures, reads riot act – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the removal of shopping malls, hotels and other commercial buildings erected without appropriate approvals from the relevant regulatory authorities.\nSecretary to the State Government, Osarodion Ogie, Esq., in a statement, said the exercise is aimed at ensuring order and sanitizing the built environment space, in line with the extant laws and guidelines in the state for the benefit of the generality of Edo people.\nThe statement reads: “The Edo State Government hereby informs the general public and property developers in particular, that government is intensifying the removal of shopping malls, hotels and other commercial buildings erected without appropriate approvals from the relevant regulatory authorities.\n“The exercise is aimed at ensuring order and sanitizing the built environment space, in line with the extant laws and guidelines in the state for the benefit of the generality of Edo people.\n“In essence, all buildings and structures planned, being developed or completed in different parts of the state, without approvals, are to be discontinued and (or) removed."
  },
  {
    "headline": "TWITTER BAN :NGOs, Journalists Sue Federal Government at ECOWAS Court over Twitter Ban – Nigerian Observer",
    "summarized_story": "The suit, lodged with number ECW/CCJ/APP/29/21 ECW/CCJ/APP/29/21, in a 73-page documentation, was filed on their behalf by Abuja-based human rights and free expression lawyer, Mrs. Mojirayo Ogunlana Nkanga, under the African Charter on Human and Peoples’ Rights (ACHPR), the International Covenant on Civil and Political Rights (ICCPR), the Revised ECOWAS Treaty, and the Nigerian Constitution, among others.\nThey are claiming that Nigeria’s ongoing suspension of Twitter, which came into effect on or around June 4, 2021, violated their right to freedom of expression and interfered with the ability of the journalists to do their work.\nThe NGOs and journalists are also alleging that the general situation in Nigeria with respect to human rights, has created an environment where freedom of expression is stifled, which has contributed to creating a chilling effect on press and media freedom and which the ongoing suspension of Twitter is a continuation of.\nNo date has been fixed for the hearing of the suit.\nThe suit is being litigated with the support of Media Defence, a London-based NGO, which provides legal assistance to journalists, citizen journalists and independent media."
  },
  {
    "headline": "Unverified Private Aircrafts To Be Impounded By Customs From July 6 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Private aircrafts that have not been verified by the Customs are to be forfeited to the Government come July 6 this year.\nThe Nigerian Customs Service made the pronouncement on Monday in Abuja with a stern warning that it will, from July 6, begin to impound all private jets that their documents are not verified by it.\nThe Service therefore advised all owners of private jets to ensure that they take advantage of the one-month grace period to verify their documents.\nWe also know that some brought their private jets under a temporary import certificate, which has expired and not renewed.\n“For the avoidance of doubt, private aircrafts owners or their representatives are to report to room 305, Tariff & Trade Departments, Nigeria Customs Service headquarters, Abuja, from 10am to 5pm."
  },
  {
    "headline": "ANALYSIS: Constitution Review: More opposition, criticism trail process",
    "summarized_story": "Between May and June, both the Senate and the House of Representatives Committees on Constitution Review held public hearings across the country’s six geopolitical zones.\nThe legislature has been embarking on constitution review since the 5th National Assembly.\nMao OhuabunwaA former senator, Mao Ohuabunwa , said the 1999 constitution is too flawed and that what Nigeria needs is a brand new constitution.\nMike OzekhomeAnother legal luminary, Mike Ozekhome, said the 1999 constitution is a “bad document” which cannot be amended.\nHe, however, advocated the adoption of salient points 1963 and 1999 constitution to achieve a better result of the ongoing constitution review exercise."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Kumuyi Set To Storm FCT For ‘Divine Connection’ Crusade",
    "summarized_story": "The General Superintendent (GS) of the Deeper Christian Life Ministry Worldwide, Pastor William Kumuyi, is set to storm the Federal Capital Territory (FCT) Abuja and other States/Nations with a 6-day ‘Divine Connection’ Crusade.\nAdvertisementsThis was made known in a statement signed by the State Overseer, Deeper Life Bible Church, FCT, Pastor Femi Elijah Adebiyi, saying that the crusade will hold from Thursday, June 24 to Tuesday, June 29, 2021.\nThe statement also disclosed that the programme targets millions of people in FCT and other States/Nations, which will feature salvation, healing, deliverance, breakthrough, revival and lots more.\nIn the evening of Friday June 25, 2021, the Crusade, for all virtual and physical audiences starts from 5.30 pm.\nOn Monday June 28 and on Tuesday June 29, 2021 (which is the last day of the programme), the Crusade starts from 5.30 pm."
  },
  {
    "headline": "Kumuyi Set To Storm FCT For ‘Divine Connection’ Crusade",
    "summarized_story": "The General Superintendent (GS) of the Deeper Christian Life Ministry Worldwide, Pastor William Kumuyi, is set to storm the Federal Capital Territory (FCT) Abuja and other States/Nations with a 6-day ‘Divine Connection’ Crusade.\nAdvertisementsThis was made known in a statement signed by the State Overseer, Deeper Life Bible Church, FCT, Pastor Femi Elijah Adebiyi, saying that the crusade will hold from Thursday, June 24 to Tuesday, June 29, 2021.\nThe statement also disclosed that the programme targets millions of people in FCT and other States/Nations, which will feature salvation, healing, deliverance, breakthrough, revival and lots more.\nIn the evening of Friday June 25, 2021, the Crusade, for all virtual and physical audiences starts from 5.30 pm.\nOn Monday June 28 and on Tuesday June 29, 2021 (which is the last day of the programme), the Crusade starts from 5.30 pm."
  },
  {
    "headline": "Coalition Tackles Bank Over Alleged Harassment Of Ubah",
    "summarized_story": "A coalition of civil society organisations (CCSOs), on Tuesday, berated Heritage Bank over alleged harassment of Senator Andy Ubah, over loan repayment by the latter.\nThe statement reads in part, “Our attention has been drawn to a virile video in which some staff of Heritage Bank stormed Sen. Andy Ubah’s residence in Abuja demanding for repayment of loan allegedly owed the bank years back.\nWhen has protest turned means of enforcing repayment of Bank loans?\n“We, as Coalition of Civil Society Group frown at this blackmail tendencies of Heritage Bank and call on relevant agencies to look into it and bring them to book.\nTurning to agents provocateur in the hands of political enemies of Sen. Andy Ubah is disheartening for a bank."
  },
  {
    "headline": "Coalition Tackles Bank Over Alleged Harassment Of Ubah",
    "summarized_story": "A coalition of civil society organisations (CCSOs), on Tuesday, berated Heritage Bank over alleged harassment of Senator Andy Ubah, over loan repayment by the latter.\nThe statement reads in part, “Our attention has been drawn to a virile video in which some staff of Heritage Bank stormed Sen. Andy Ubah’s residence in Abuja demanding for repayment of loan allegedly owed the bank years back.\nWhen has protest turned means of enforcing repayment of Bank loans?\n“We, as Coalition of Civil Society Group frown at this blackmail tendencies of Heritage Bank and call on relevant agencies to look into it and bring them to book.\nTurning to agents provocateur in the hands of political enemies of Sen. Andy Ubah is disheartening for a bank."
  },
  {
    "headline": "Rivers LG Chairman Resumes Work Under Mango Tree To Monitor Workers",
    "summarized_story": "The newly sworn-in chairman of Emohua local government area of Rivers State, Dr. Chidi Julius Lloyd, has resumed duty under a mango tree within the council secretariat to check the attitude of civil servants to their duties.\nHe said: “I sat under the mango tree deliberately to check gress and ingress of staff.\nThey didn’t know that the chairman was under the mango tree.\n“The civil servants were just coming in the way they liked.\nYou could see the docility in the civil servants."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Court Jails Ponzi scheme Operator Seven Years in Rivers – Daylight",
    "summarized_story": "He was convicted on Friday June 18, 2021 after being found guilty of one-count charge bordering on advance fee fraud.\nSpecifically, Edet collected a sum of N7, 000,000(Seven Million Naira only) from a petitioner ostensibly for bitcoin transactions.\nThis is contrary to Section 1(1) (a) of the Advance Fee Fraud and Other Fraud Related Offences Act No.14, 2006 and punishable under Section 1 (3) of the same Act.\nIn his judgment, Justice Mohammed found Edet guilty as charged.\nHe also ordered that the sum of seven million Naira he defrauded the victim be returned to her."
  },
  {
    "headline": "Court Jails Ponzi scheme Operator Seven Years in Rivers – Daylight",
    "summarized_story": "He was convicted on Friday June 18, 2021 after being found guilty of one-count charge bordering on advance fee fraud.\nSpecifically, Edet collected a sum of N7, 000,000(Seven Million Naira only) from a petitioner ostensibly for bitcoin transactions.\nThis is contrary to Section 1(1) (a) of the Advance Fee Fraud and Other Fraud Related Offences Act No.14, 2006 and punishable under Section 1 (3) of the same Act.\nIn his judgment, Justice Mohammed found Edet guilty as charged.\nHe also ordered that the sum of seven million Naira he defrauded the victim be returned to her."
  },
  {
    "headline": "Messy Ownership Tussle: Three more directors resign from Lekoil Cayman",
    "summarized_story": "Lekoil Cayman, a Cayman Islands-registered AIM-listed holding company holds a 40 percent equity holding in Lekoil Nigeria.\nThe directors involved include Aisha Muhammed-Oyebode, Chair of Lekoil Nigeria, who resigned as a non-executive Director of Lekoil Cayman, Lekan Akinyanmi, CEO of Lekoil Nigeria, resigned as an executive Director of Lekoil Cayman and Gloria Iroegbunam, Company Secretary of Lekoil Nigeria, as Company Secretary of Lekoil Cayman.\nIn particular, Mr Akinyanmi vigorously disputes his unilateral termination as CEO of Lekoil Cayman and all of the statements made by Lekoil Cayman in connection with his employment contract and the loan agreement between him and Lekoil Cayman.\n“This in turn will ensure the restoration of value for all shareholders, both in Lekoil Nigeria and Lekoil Cayman.\n“The continuous breaches of due process and corporate governance by the Board of Lekoil Cayman has left us with no option but to resign collectively from the Board of Lekoil Cayman."
  },
  {
    "headline": "Messy Ownership Tussle: Three more directors resign from Lekoil Cayman",
    "summarized_story": "Lekoil Cayman, a Cayman Islands-registered AIM-listed holding company holds a 40 percent equity holding in Lekoil Nigeria.\nThe directors involved include Aisha Muhammed-Oyebode, Chair of Lekoil Nigeria, who resigned as a non-executive Director of Lekoil Cayman, Lekan Akinyanmi, CEO of Lekoil Nigeria, resigned as an executive Director of Lekoil Cayman and Gloria Iroegbunam, Company Secretary of Lekoil Nigeria, as Company Secretary of Lekoil Cayman.\nIn particular, Mr Akinyanmi vigorously disputes his unilateral termination as CEO of Lekoil Cayman and all of the statements made by Lekoil Cayman in connection with his employment contract and the loan agreement between him and Lekoil Cayman.\n“This in turn will ensure the restoration of value for all shareholders, both in Lekoil Nigeria and Lekoil Cayman.\n“The continuous breaches of due process and corporate governance by the Board of Lekoil Cayman has left us with no option but to resign collectively from the Board of Lekoil Cayman."
  },
  {
    "headline": "NNPC: Nigeria bleeds as petrol cost hits N256, subsidy N150b",
    "summarized_story": "By Edith Ike-Eboh/AbujaThe Nigerian National Petroleum Corporation (NNPC) said the cost of a litre of petrol has hit N256 and it is absorbing between N140-N150 billion in monthly subsidy to sell to consumers at N162.\nBut the octopus corporation blamed fuel smugglers for worsening the situation, as daily consumption jumped to to 103 million litres per day in May, as against the usual 50-60 million litres.\nThe Group Managing Director (GMD), NNPC, Mele Kyari, made this known on Tuesday at stakeholders meeting organised by the corporation to discuss how best to stop smuggling in the country.\n“From the truck out report from the PPPRA data base , we have seen collapse of load out average move from 70 million litres to 60 million litres just in one month, that means we can do with less than 70 million.\n“We are assuring Nigerians that anything we have to do to stop smuggling, we will do to ensure that perpetrators are brought to book and justice is met for the benefits of Nigerians,’’ he added."
  },
  {
    "headline": "Killer-labourer Ikechi goes to jail for life in Lagos",
    "summarized_story": "By Chinyere OmeireJustice Modupe Nicol-Clay of a Lagos High Court sitting at the Tafawa Balewa Square (TBS), on Tuesday sentenced a 32-year-old labourer, Philip Ikechi, to life jail for committing murder.\nThe News Agency of Nigeria (NAN) reports that the Lagos State Government in 2015 charged Ikechi before the court on a two-count charge of murder and causing bodily harm.\n“PW2 testified that on April 13, 2014, the defendant (convict) visited his friend Abu.\n“PW3 stated that the deceased shouted and begged the defendant not to allow his gang to hurt him.\n“PW3 stated that the defendant did not listen, and in the process, the deceased was injured and killed."
  },
  {
    "headline": "JUST IN:Court orders Buhari pay Rivers, Akwa Ibom $3.37billion",
    "summarized_story": "Justice Taiwo O. Taiwo of the Federal High Court in Abuja has ordered the Buhari Government to pay Rivers and Akwa Ibom states $3,372,963,196.\nFHC/ABJ/CS/174/2021 filed by the Attorney General of Rivers State and Attorney General of Akwa Ibom against the Attorney General of the Federation.\nIn 2016 Rivers, Bayelsa and Akwa Ibom States through their Attorneys-General sued the Federal Government, represented by the Attorney General of the Federation at the Supreme Court in Suit No: SC.964/2016.\nThe Report of that body stated among others that Rivers is entitled to $1,114,551,610.00 and Akwa Ibom $2,258,411,586 as Derivation proceeds.\nHowever, Attorney General of the Federation without recourse to the Governments of Rivers and Akwa Ibom States unilaterally claimed to have settled with International Oil Companies (IOCs)."
  },
  {
    "headline": "Reps Advocate Social Media Regulation As FG Insists Twitter Ban Is In Nigeria’s Interest",
    "summarized_story": "When Lai Mohammed testified before the House Committee on Information on Tuesday, Mohammed made the call.\nLai Mohammed has invoked different portions of the Federal Republic of Nigeria’s constitution in support of the official action taken in light of the country’s security challenges.\nAllowing Twitter’s breaches to continue undetected until the President’s message was taken down, he claimed, was a disservice to the country.\nWhen it came to national security and national interest, Ibrahim remarked that anything would pale into insignificance.\nRep. Chinedu Ogah (APC-Ebonyi), another committee member, noted that if the law regulating social media had been applied, the microblogging site’s activity would have been monitored."
  },
  {
    "headline": "Ebonyi State Gov, Umahi Loses Another Commissioner In Enugu Auto Crash",
    "summarized_story": "Ebonyi State Governor David Umahi lost one of his “Super Commissioners” in a vehicle accident in Enugu State on Tuesday.\nEngr Fidelis Kings Nweze, the Commissioner for Infrastructure and Concession, died in Turkish Hospital in Abuja following a successful intestinal surgery.\nBy 7 p.m. on Saturday, his vehicle slammed into a stationary truck in Obinagu, Enugu State.\nAccording to him: “Engr Kings died this morning at 9:15 am at Turkish Hospital, Abuja.\n“And about Obinagu in Enugu State, they rammed into a stationery truck."
  },
  {
    "headline": "Yoruba Nation Rally Will Hold As Planned In Lagos, Rain Or Shine— Igboho’s Aide Dares Police",
    "summarized_story": "The activist’s spokeswoman, Olayomi Koiki, stated in a live video that the rally will depart from Ojota Park in Lagos on the stated day.\nThe Lagos State Commissioner of Police, Hakeem Odumosu, told The Nation that no group had approached the command about a rally.\n“We have no business with the police and we are not coming to disrupt the peace of Lagos state.\n“Tell them that, I, Olayomi Koiki, media aide to Chief Sunday Adeyemo (Igboho) said we will hold the July 3rd rally in Lagos State.\nYoruba Nation now, no retreat, no surrender.”"
  },
  {
    "headline": "Twitter Ban: Nigerian Government Threatens To Suspend Facebook, Instagram, WhatsApp, Others",
    "summarized_story": "The Nigerian government has vowed to shut down all social media sites that allow provocative words or posts to be used to spread discord in the country.\nOn whether any channel of dialogue had been opened with Twitter, the minister said “we tried to but they rebuffed us.\nHe added that if other social media platforms such as Facebook, Instagram, WhatsApp, Google Hangout, and others are found to be encouraging posts or utterances that could destabilize the country, the government will not hesitate to suspend them.\nHe was perplexed as to how the same person could transform overnight into a proponent of social media regulation.\nMeanwhile, several committee members raised alarm over the executive’s move to ban Twitter, claiming that the country was on the verge of dictatorship."
  },
  {
    "headline": "HOTO: Yadda wata tankar mai ta ci wuta a Legas",
    "summarized_story": ""
  },
  {
    "headline": "Kotu ta ɗaure Lawan shekara bakwai saboda cin-hancin $500,000",
    "summarized_story": ""
  },
  {
    "headline": "Buhari ya amince da kashe bilyan N18 don gina sabbin jami’o’i huɗu a sassan ƙasa",
    "summarized_story": ""
  },
  {
    "headline": "El-Rufai ya rantsar da wasu manyan jami’an gwamnati",
    "summarized_story": ""
  },
  {
    "headline": "Kumuyi set to storm FCT, and beyond, with 6-day ‘Divine Connection’ Crusade -NigPilot",
    "summarized_story": "General Superintendent, GS, of the Deeper Christian Life Ministry, Worldwide, Pastor William Kumuyi, is set to storm the Federal Capital Territory, FCT, and from there, reach out to other States Nations with a 6-day ‘Divine Connection’ Crusade.\nThis was made known in a statement signed by the State Overseer, Deeper Life Bible Church, FCT, Pastor Femi Elijah Adebiyi, indicating that the Crusade is holding from Thursday June 24 and ending on Tuesday June 29,.\nIn the evening of Friday June 25, the Crusade, for all virtual and physical audiences starts from 5.30 pm.\nOn Monday June 28 and on Tuesday June 29, 2021 which is the last day of the programme, the Crusade starts from 5.30 pm.\n“God has helped the Church to put all in place to ensure participants get the best of the six-day power-packed programme."
  },
  {
    "headline": "45 buildings receive 3-day demolition in Lekki-LASG -NigPilot",
    "summarized_story": "Government of Lagos State Government has given demolition notices to owners of 45 buildings on the Lekki axis.\nThe notice was informed by the spokesman of Lagos State Building Control Agency, LASBCA, Mr. Gbadeyan Abdulraheem.\nHe said the buildings are encroaching on canals, adding that the demolition notice follows the illegal extension of the development of those residential and commercial buildings to the canal on the Lekki axis.\nOn his part, Oki said the buildings were sealed for contravening the physical planning regulations of the state, adding that the violators had 3 days to remove all the illegal constructions.\nHe said, “Most of the buildings on this axis have interlocking tiles erected across canals, and this is against the physical planning regulations of Lagos state."
  },
  {
    "headline": "Senate moves to approve Solid Minerals Development Commission -NigPilot",
    "summarized_story": "A bill seeking the establishment of a Solid Minerals Producing Areas Development Commission to address the environmental devastation and other related matters in the country, yesterday passed second reading in the Senate.\nThe bill, sponsored by Senator Yakubu Oseni (APC Kogi Central) also has the objectives of formulating policies and guidelines for the development of the mineral producing areas.\nThe Nigerian Extractive Industries and Transparency Initiative (NEITI) reported that there are approximately 40 different kinds of solid minerals and precious metals buried in N igerian soil waiting to be exploited.\nThe commercial value of Nigeria’s solid minerals has been estimated to run into hundreds of billions of dollars,” the lawmaker stressed.\nIn his remarks, the Senate President Dr. Ahmad Lawan, charged the Committee on Solid Minerals to conclude legislative work on the bill and report back within four weeks."
  },
  {
    "headline": "Senator Frank Ibezim (Imo North), at the Senate Plenary -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Buhari Inaugurates Committee To Lift 100 Million Nigerians Out Of Poverty",
    "summarized_story": "President Muhammadu Buhari has inaugurated the National Steering Committee (NSC) of the National Poverty Reduction with Growth Strategy (NPRGS) to be chaired by the Vice President, Professor Yemi Osinbajo.\nIn his remarks at the event on Tuesday in Abuja, the President reiterated his commitment to lifting 100 million Nigerians out of poverty in 10 years, with a well-researched framework for implementation and funding.\n“This journey began in January 2021 when I directed the Chairman of the Presidential Economic Advisory Council and Secretary to the Government of the Federation to collaboratively work together to articulate what will lift 100 million Nigerians out of poverty in 10 years.\n“If India can lift 271 million people out of poverty between 2006 and 2016, Nigeria can surely lift 100 million out of poverty in 10 years.\nPresident Buhari asked the committee to commence work immediately to enable the Technical Working Group to begin to put the nuts and bolts together."
  },
  {
    "headline": "ECOWAS Court Restrains Nigerian Govt From Imposing Sanctions On Twitter, Others",
    "summarized_story": "The ECOWAS Court of Justice in Abuja has restrained the Federal Government from imposing sanctions or harassing, intimidating, arresting, or prosecuting Twitter.\nThe court gave the restraining order after hearing arguments from parties in a suit filed by the Socio-Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians.\n﻿According to the court, interference with Twitter is a violation of human rights and the Nigerian government must take immediate steps to implement the order.\nThis followed the suspension of Twitter by the Federal Government after the social media giant deleted a tweet by President Muhammadu Buhari.\nThereafter, the National Broadcasting Commission (NBC) ordered television and radio stations to suspend the patronage of Twitter immediately."
  },
  {
    "headline": "Court Orders FG To Pay Rivers, Akwa Ibom States $3.3bn Oil Revenue",
    "summarized_story": "A Federal High Court in Abuja has ordered the Federal Government to pay over $3 billion to Rivers and Akwa Ibom states, as part of their revenue shares from crude oil sales.\nThe amount formed part of the $62 billion said to have been recovered from some oil companies by the Federal Government.\nDelivering the judgement on Tuesday, Justice Taiwo Taiwo held that the notice of intention to defend the case without joining issues with the plaintiffs was an error on the part of the government.\nDelivering judgement, Justice Taiwo Taiwo, ordered that the sum must be paid within 14 days after which, 8% interest will be accurable on the principal sum, annually.\nThe judge held that the American company and NNPC, were negligent in the way they handled oil spills that caused environmental degradation in the communities."
  },
  {
    "headline": "Bribery: Court Sentences Farouk Lawan To Seven Years In Prison",
    "summarized_story": "﻿A High Court in the Federal Capital Territory (FCT) has sentenced the former Chairman of the House of Representatives ad-hoc committee on Petroleum Subsidy, Farouk Lawan to seven years in prison.\n﻿ ﻿In this video published in 2012, Mr Lawan purportedly requested for a $3 million bribe from Mr Otedola.\nCount two stated that the defendant collected the sum of $500,000 as a bribe to exonerate Zelon petroleum and gas from the fuel subsidy probe report.\nFor count one and two the court sentenced Lawan to seven years while for count three he was sentenced to five years.\nThe court also ordered that the defendant return the sum of $500,000 to the Federal Government."
  },
  {
    "headline": "People Taking Advantage Of #TwitterBan As Blackmail Weapon – Keyamo",
    "summarized_story": "﻿The Federal Minister of State for Labour and Employment of Nigeria, Festus Keyamo, has lamented that some Nigerians have been taking undue advantage of the #TwitterBan in the country to blackmail the Federal Government.\nHe said this in response to questions that the party used the same social media to rise to power back in 2015, stressing that the goal of the government with the #TwitterBan is not to stifle free speech.\nPeople have been using this as a blackmail weapon that we rode to power using social media.\nBut on Tuesday, the ECOWAS Court of Justice joined the call to condemn the decisions.\nHowever, reacting to this, Mr Keyamo said “I have not seen anywhere where they said the ECOWAS court is the moral thermometer or barometer to decide whether Nigeria’s image is bad or not”."
  },
  {
    "headline": "The media is not government’s enemy -NGE",
    "summarized_story": "The Nigerian Guild of Editors (NGE) say the media industry is not a political opponent or enemy of the Federal Government.\nThey say the political elite’s attacks on the media are habitually and not envisioned to win an argument on journalistic values, designed to bully media organizations.\nAdvertisementThe NGE said, QUOTE ‘’While we are not opposed to an Act that will promote media stakeholders-driven regulatory council, the many draconian provisions in the Hon.\nOdebunmi Olusegun’s sponsor bills are actually aimed at criminalising media practice in Nigeria.\nWhile the intention of the sponsor of the bills is suspicious, the bills negate all known features of media regulatory bodies in the world’’, the Guild stated."
  },
  {
    "headline": "Suspected bandit killed as Police foil kidnap of Indian expatriate, recover 4 AK-47 magazines",
    "summarized_story": "A suspected bandit has been killed and four AK-47 magazines and a mobile phone recovered in Kaduna state.\nThe state police command says this happened as the bandit and his team attempted to kidnap an Indian expatriate in the state.\nHe added that the bandits who were desperate to kidnap the foreigner, shot sporadically at the police operatives but were repelled.\nThe Kaduna police spokesperson says after an extended period of fire exchange, several of the bandits escaped into the forest with bullet wounds.\nAdvertisementA joint team of the Police and Military personnel while searching the area on Tuesday, recovered the lifeless body of one of the suspected bandits, four (4) AK-47 magazines fully loaded with one hundred and twenty rounds of live ammunitions and a mobile phone."
  },
  {
    "headline": "US Government allegedly seizes Iranian, Houthi media websites",
    "summarized_story": "Notices have appeared on two Iranian news sites as well as two websites affiliated with Yemen’s Houthi movement claiming they were seized by the US government as part of law enforcement action.\nAdvertisementMarzieh Hashemi, a prominent anchor for Press TV, told The Associated Press that the channel was aware of the seizure but had no further information.\n“This seizure of the almasirah.net and other allied websites reveals once again the deceit of the free speech slogans that America promotes,” the agency said.\n“We condemn this American piracy.”Last year the US Treasury Department blocked and seized the official domain name of Iranian state-run newspaper “Iran”.\nThe website, once registered under the domain “iran-newspaper.com”, is still offline but can now be found instead under “irannewspaper.ir”."
  },
  {
    "headline": "ECOWAS Court Stops Nigeria Government From Sanctioning, Prosecuting Twitter Users",
    "summarized_story": "The court said: “The court has listened very well to the objection by Nigeria.\nAny interference with Twitter is viewed as inference with human rights, and that will violate human rights.\nThe Nigerian government must take immediate steps to implement the order.”This development was disclosed today by SERAP deputy director Kolawole Oluwadare.\nThe National Broadcasting Commission (NBC) also ordered TV and radio stations to “suspend the patronage of Twitter immediately”, and told them to delete ‘unpatriotic’ Twitter.\nThis implies a free press and other media able to comment on public issues without censor or restraints, and to inform public opinion."
  },
  {
    "headline": "Kenyan Faces 30-year Jail Sentence After Pleading Guilty in US Romance Scams Case",
    "summarized_story": "A Kenyan national faces up to a 30-year jail sentence, after pleading guilty to fraud conspiracy involving romance scams in the US, the justice department in Massachusetts has said.\nThe 36-year-old woman, Florence Mwende Musau and five others are accused of defrauding people out of more than $4m.\nThe other five accused remain not guilty until the court proves it.\nMs Musau is alleged to have used fake passports with different names to open bank accounts in and around Boston.\nThe money was deposited into those, then transferred in several daily transactions, according to charging documents cited by the justice department."
  },
  {
    "headline": "Sunday Igboho’s Agitations For Yoruba Nation Can’t be Faulted: OPC President Osibote",
    "summarized_story": "Aare Osibote, the President of Ooduwa Peoples Congress (OPC), a Yoruba nationalist organization in Nigeria says he cannot fault agitations of popular Yoruba activist, Sunday Adeyemo.\nHe said this on Tuesday when he featured on an ARISE News programme, The Morning Show.\nMr Adeyemo, popularly known as Sunday Igboho had staged protests in five of Nigeria’s southwestern states and plans a Lagos rally for July 3.\nHe’s consistently called for a separate ‘Yoruba Nation’ and expressed anger over the continuous killing and kidnapping of Yoruba people by killer herdsmen in recent times.\nMr Osibote however warned that the price for separation could prove to be very costly."
  },
  {
    "headline": "Nigeria: President Buhari Writes Parliament, Seeks Approval For $2bn Supplementary Budget",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has written the leadership of the country’s parliament to approve a supplementary budget of N895 billion ($2 billion).\nThe country’s federal executive council had already approved the sum on June 9.\nThe request from Mr Buhari was read by the President of the Senate, Ahmad Lawan during plenary on Tuesday.\nAccording to the President, the budget is meant to boost military operations and facilitate procurement of Covid-19 vaccine.\nZainab Ahmed, Nigeria’s finance minister had said after FEC approved the sum that there’s an urgent need for the procurement of vaccines."
  },
  {
    "headline": "Saudi Arabia Hands Over 23 Ventilators to Nigeria",
    "summarized_story": "Saudi Arabia has handed over 23 ventilators worth $1 million to the Nigerian government to combat Covid-19.\nThe other equipment expected include 25,000 surgical sterile gowns, 125,000 non-sterile surgical gowns, 188,000 KN95 masks, 1,606,700 surgical masks and 9,500 nitrile gloves.\nAccording to a press release on Tuesday by the the Royal Embassy of Saudi Arabia, the equipment are already being shipped and are expected to arrive the country on July 1.\nSaudi Arabia, through the programme, is also targeting 70 catheterization and heart surgeries in the South-South and South-East regions of the country.\nHe appreciated the donation from the government of Saudi Arabia."
  }
]