[
  {
    "headline": "Court grants embattled Rivers Rep, Dagogo, bail after 62 days",
    "summarized_story": "A High Court sitting in Port Harcourt, Rivers State, has granted bail to the embattled lawmaker representing Degema – Bonny Federal Constituency in the House of Representatives, Hon.\nFarah Dagogo.\nDagogo, a Peoples Democratic Party governorship aspirant in the state for the 2023 elections, was granted bail on Tuesday after been incarcerated for 62 days.\nDagogo was granted bail to the tune of N20 million or a surety in like sum with a landed property worth the same amount.\nJustice Chiwendu Nworgu granted Dagogo bail after listening to all arguments by his counsel and counsel to the Rivers State government."
  },
  {
    "headline": "Court grants Dagogo bail after 60 days in detention",
    "summarized_story": "The Rivers State High Court, Tuesday, granted bail to Hon.\nFarah Dagogo, the embattled former governorship aspirant of the Peoples Democratic Party, PDP.\nThe bail approval came after he had spent about 60 days in detention.\nNwogu also ordered Dagogo to deposit his international passport and barred him from travelling outside the country without leave of the court pending his trial at the court.\nSpeaking outside the court room, Cosmos Enweluzo, SAN, lead counsel to Dagogo, said he was happy that his client has been granted bail but wondered why the court took over two months to grant the defendant bail."
  },
  {
    "headline": "Nnamdi Kanu grants interview, sends message to South-East",
    "summarized_story": "Nnamdi Kanu, the embattled leader of the Indigenous People of Biafra, IPOB, on Tuesday, reacted to the ruling of Justice Binta Nyako of an Abuja Federal High Court that dismissed his bail application.\nKanu said Justice Nyako’s verdict, which denied him bail was ‘expected’.\nSpeaking after Tuesday’s court session, the IPOB leader urged the people of the Southeast to “remain calm” and make the zone peaceful.\nI want Biafranland to be calm, calm, and very peaceful.\nWe are fighting to defend our people, not to kill them."
  },
  {
    "headline": "Yahoo boys: Landlords may spend 15 years in jail – EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is set to go after landlords who rent their houses to internet fraudsters a.k.a.\nThe topic of the chat, ‘Give your house to Yahoo boys, spend 15 years in jail’, has elicited reactions on social media.\nNzekwe accused some of them of working with suspected fraudsters by housing them over a long period and making internet facilities available.\nThe official stated that such act negates Section 3 of the Advance Fee Fraud and Other Fraud Related Offences Act, 2006.\nThe EFCC told them to always ask their customers for means of identification and to include their occupation during check-in procedure."
  },
  {
    "headline": "Court shifts Kanu’s trial till Nov 14",
    "summarized_story": "The trial of the leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu on terrorism charges has been shifted till November 14 by a Federal High Court in Abuja.\nThe trial was put on hold by Justice Binta Nyako following the appeal instituted against the high court order upholding seven count charges against Kanu.\nIn the appeal marked CA/ABJ/CR/625/2022, Kanu, through Ozekhome SAN, prayed the appellate court to nullify the seven counts still standing against him.\nOzekhome prayed the court to stop further trial in the charges until the Court of Appeal decides the issues brought before it.\nIn a short ruling, Justice Nyako upheld arguments of Ozekhome and shifted further trial till November 14 to await the outcome of the Court of Appeal decision."
  },
  {
    "headline": "Russia places entry ban on Biden’s wife, daughter",
    "summarized_story": "Russia has placed an entry ban on the family of United States President, Joe Biden.\nThe Foreign Ministry in Moscow said this on Tuesday.\nBiden’s wife, Jill and daughter, Ashley, would no longer be allowed to travel to Russia.\nThe Foreign Ministry said Russia had in total placed new bans on 25 U.S. nationals, including well-known Prof. Francis Fukuyama, for having taken “Russophobic” positions.\nThe U.S. and Canada had added two adult daughters of Russian President Vladimir Putin to their sanctions list in the wake of Russia’s war against Ukraine."
  },
  {
    "headline": "BREAKING: We'll probe Supreme Justices' allegations despite CJN’s resignation",
    "summarized_story": "The Senate on Tuesday declared the resignation of the former Chief Justice of Nigeria (CJN) Justice Ibrahim Tanko Muhammad won’t stop its probe of corruption allegations against him by Justices of the apex court.\nThe resolution of the Red Chamber followed a motion by the Chairman, Senate Committee on Judiciary, Human Rights and Legal Matters, Senator Opeyemi Bamidele.\nBamidele’s motion was titled: “Matter of urgent public importance on the state of affairs in the Supreme Court of Nigeria and demand by Justices of the court, pursuant to rules 41 and 51 of the Senate Standing Orders, 2022 (as amended).”Details Shortly…"
  },
  {
    "headline": "Chelsea contact Man City over move for Raheem Sterling The Nation Newspaper",
    "summarized_story": "Chelsea have made contact with Manchester City about a move for England forward Raheem Sterling.\nIt is understood Chelsea are yet to lodge a formal bid for the 27-year-old, but one is expected shortly.\nSince Pep Guardiola became manager in 2016, only Sergio Aguero (124) has scored more goals for City than Sterling (120).\nSterling scored 13 goals in 30 Premier League appearances last season as he won his fourth league title and ninth major honour in seven seasons with City.\nOf City’s attacking players, only Bernardo Silva started significantly more Premier League games last season – 33 to Sterling’s 23."
  },
  {
    "headline": "JUST IN: Buhari off to Lisbon on State visit The Nation Newspaper",
    "summarized_story": "JUST IN: Buhari off to Lisbon on State visitTwo days after his return from Kigali in Rwanda, President Muhammadu Buhari will on Tuesday jet out to the capital of Portugal, Lisbon, on a four-day state visit.\nBuhari on Sunday afternoon returned to Abuja after attending the 26th Commonwealth Heads of Government Meeting (CHOGM) in the capital of Rwanda, Kigali.\nBuhari will also visit the Portuguese Parliament and hold discussions with its president, Dr Augusto Santo Silva, as well as the Prime Minister of Portugal, Antonio Costa.\nBuhari will also participate in the United Nations Ocean Conference, which began in Lisbon on Monday, June 27, and runs till July 1.\nThe Nigerian leader is also expected to engage members of the Nigerian community in Portugal on matters affecting them and developments at home."
  },
  {
    "headline": "Gabriel Jesus holds Arsenal medical ahead £45m move The Nation Newspaper",
    "summarized_story": "Gabriel Jesus is having a medical at Arsenal before a £45m move from Manchester City.\nJesus has made 236 appearances and scored 95 goals for City since moving from Palmeiras in January 2017.\nHe has won four Premier League titles during his time at Etihad Stadium, plus three League Cups and the FA Cup.\nArsenal finished fifth in the Premier League last season and narrowly missed out on qualifying for the Champions League to north London rivals Tottenham.\nJesus played 28 times in the Premier League last season, scoring eight goals and registering nine assists."
  },
  {
    "headline": "BREAKING: Court rejects Nnamdi Kanu’s fresh bail application The Nation Newspaper",
    "summarized_story": "A Federal High Court in Abuja has dismissed the fresh bail application filed by Nnamdi Kanu of the Indigenous People of Biafra (IPOB).\nIn a ruling on Tuesday, Justice Binta Nyako described the application, filed by Kanu’s lawyers led by Mike Ozekhome (SAN), as an abuse of court process.\nRead Also: Stop portraying IPOB and Nnamdi Kanu as heroesJustice Nyako held that the application was an attempt to re-litigate an issue on which the court had ruled.\nJustice Nyako had in 2017 granted Kanu bail, which was later revoked on the grounds that he violated the conditions attached to the bail.\nKanu is standing trial before the court on treasonable felony charge."
  },
  {
    "headline": "France’s Macron: Russia cannot, should not win Ukraine war",
    "summarized_story": "(AP)French President Emmanuel Macron said Tuesday that Russia “cannot and should not win” the war in Ukraine, as its terrible toll was on full view the day after a Russian missile strike hit a shopping mall, killing 18 people.\nRussia has repeatedly denied it targets civilian infrastructure, even though Russian attacks have hit other shopping malls, theaters, hospitals, kindergartens and apartment buildings in the four-month war.\nOn Tuesday, Russian forces struck the Black Sea city of Ochakiv in the Mykolaiv region, damaging apartment buildings and killing two, including a 6-year-old child.\nThe barrage was part of Russian forces’ intensified offensive aimed at wresting the eastern Donbas region from Ukraine.\nOver the weekend, the Russian military and their local separatist allies forced Ukrainian government troops out of Lysychansk’s neighboring city, Sievierodonetsk."
  },
  {
    "headline": "Reps invite Aregbesola, Onyeama, others over Ekweremadu",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, on Tuesday, invited the Minister of Interior, Rauf Aregbesola, and his counterpart in the Ministry of Foreign Affairs, Geoffrey Onyeama, to brief it on issues relating to the ordeal of former Deputy Senate President Ike Ekweremadu and his wife, Nwanneka, who are detained London.\nAlso to brief the House through its relevant committees is the acting Comptroller General of Immigration, Issa Jere.\nEkweremadu and his wife were detained in London last week over an alleged “conspiracy to arrange and facilitate the travel of another person with a view to exploitation namely organ harvesting.”"
  },
  {
    "headline": "Buhari heads to Portugal on state visit, to participate in UN Ocean Confab",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is embarking on a state visit to Portugal at the invitation of President Marcelo Rebelo de Sousa, the Presidency has said.\nPresident Buhari will also visit the Portuguese Parliament and hold discussions with its president, Dr Augusto Santo Silva, as well as the Prime Minister of Portugal, Antonio Costa.\nIn the course of the visit, the President is scheduled to address a Forum of Nigerian and Portuguese businessmen and hold separate meetings with select Portuguese Chief Executive Officers and prospective investors in Nigeria.\nPresident Buhari will also participate in the United Nations Ocean Conference, which began in Lisbon on Monday, June 27, and runs till July 1.\nBuhari is also expected to engage members of the Nigerian community in Portugal on matters affecting them and developments at home."
  },
  {
    "headline": "Ekweremadu: FG to investigate those circulating organ donor’s information",
    "summarized_story": "Pictures of Nwamini’s passport were shared online after he was reported to have been trafficked to the United Kingdom for organ harvest by the senator and his wife.\n“NDPR prohibits the processing of personal data without the informed consent or other lawful bases known to law.\nAccordingly, all data controllers and all persons are hereby warned of the consequences of using anyone’s data in violation of NDPR.\n“The Bureau recognizes the vital role of media organizations in educating the general public.\nIn carrying out this important assignment, however, it is obligatory to respect the boundaries of citizens’ privacy."
  },
  {
    "headline": "Gunmen kill pregnant woman, vigilante member at drinking joint in Enugu",
    "summarized_story": "From Jude Chinedu, EnuguGunmen on Monday shot dead a pregnant woman and a member of a local vigilante in Akwuke, Enugu South Local Government Area of Enugu State.\nIt was learnt that the assailants who were three in number stormed the joint at about 8pm and ordered everybody to lie down.\nThe pregnant woman’s house help, who was also helping out in the joint was shot in the leg and is now receiving treatment at a hospital.\nOnyia was sitting on the other side with Nonso, the vigilante man that was shot.\n“It was later I learnt that they shot NwaGod’s wife and shot Nonso, the security man also."
  },
  {
    "headline": "FLASHBACK: How Late Gani Fawehinmi Sued Tinubu For Lying Under Oath He Attended Government College Ibadan, University Of Chicago",
    "summarized_story": "Tinubu had made the claim of loss of certificates in his filings with the Independent National Electoral Commission (INEC) in 1999 and 2003 when he ran for governor of Lagos State.\nHe however stated in 1999 that he attended St Paul Children’s Home School, Ibadan, from 1958 to 1964 and Government College, Ibadan (GCI) from1965 to 1968 before proceeding to Richard Daley College, Chicago, from 1969 to 1971 and the University of Chicago.\nThough Tinubu later presented a certificate indicating he attended Chicago State University but SaharaReporters learnt that had never been the issue in contention as raised by the late legal luminary, Fawehinmi.\nThe issue raised by the late lawyer was about what he (Tinubu) filled in the INEC form F001 he submitted to the electoral body as his academic qualifications in 1998 which included the claim that he attended the University of Chicago and not Chicago State University.\nThe University of Chicago is a private research university in Chicago, Illinois while on the other hand, Chicago State University is a predominantly Black, public university in Chicago, Illinois that is not highly regarded."
  },
  {
    "headline": "FLASHBACK: How Late Gani Fawehinmi Sued Tinubu For Lying Under Oath He Attended Government College Ibadan, University Of Chicago",
    "summarized_story": "Tinubu had made the claim of loss of certificates in his filings with the Independent National Electoral Commission (INEC) in 1999 and 2003 when he ran for governor of Lagos State.\nHe however stated in 1999 that he attended St Paul Children’s Home School, Ibadan, from 1958 to 1964 and Government College, Ibadan (GCI) from1965 to 1968 before proceeding to Richard Daley College, Chicago, from 1969 to 1971 and the University of Chicago.\nThough Tinubu later presented a certificate indicating he attended Chicago State University but SaharaReporters learnt that had never been the issue in contention as raised by the late legal luminary, Fawehinmi.\nThe issue raised by the late lawyer was about what he (Tinubu) filled in the INEC form F001 he submitted to the electoral body as his academic qualifications in 1998 which included the claim that he attended the University of Chicago and not Chicago State University.\nThe University of Chicago is a private research university in Chicago, Illinois while on the other hand, Chicago State University is a predominantly Black, public university in Chicago, Illinois that is not highly regarded."
  },
  {
    "headline": "EXCLUSIVE: How Tanko Muhammad Was Queried Over $10m Bribe Collected By Son, Forced To Resign As Chief Justice Of Nigeria",
    "summarized_story": "Justice Tanko Muhammad was forced to resign as the Chief Justice of Nigeria, multiple sources on Monday told SaharaReporters.\nBREAKING: Embattled Chief Justice Of Nigeria, Tanko Muhammad Tenders Resignation Letter To Buhari | Sahara Reporters https://t.co/MPMyz8lS7E pic.twitter.com/mWluV6OVD7 — Sahara Reporters (@SaharaReporters) June 27, 2022In May, Wamakko emerged as the candidate of the All Progressives Congress for Sokoto North senatorial district.\nThe son took $10 million from former Governor of Sokoto state, Wamakko to procure judgement for him on an election matter that didn’t materialise.\nThey are planning to remove Tanko Muhammad before then and don’t want the woman to even act as CJN for one day.\n“The most senior Justice after Odili is Olukayode Ariwoola but they claim he’s got a terminal illness."
  },
  {
    "headline": "EXCLUSIVE: How Tanko Muhammad Was Queried Over $10m Bribe Collected By Son, Forced To Resign As Chief Justice Of Nigeria",
    "summarized_story": "Justice Tanko Muhammad was forced to resign as the Chief Justice of Nigeria, multiple sources on Monday told SaharaReporters.\nBREAKING: Embattled Chief Justice Of Nigeria, Tanko Muhammad Tenders Resignation Letter To Buhari | Sahara Reporters https://t.co/MPMyz8lS7E pic.twitter.com/mWluV6OVD7 — Sahara Reporters (@SaharaReporters) June 27, 2022In May, Wamakko emerged as the candidate of the All Progressives Congress for Sokoto North senatorial district.\nThe son took $10 million from former Governor of Sokoto state, Wamakko to procure judgement for him on an election matter that didn’t materialise.\nThey are planning to remove Tanko Muhammad before then and don’t want the woman to even act as CJN for one day.\n“The most senior Justice after Odili is Olukayode Ariwoola but they claim he’s got a terminal illness."
  },
  {
    "headline": "Ekiti Election: Pregnant Woman, Six Others Drag EFCC To Court Over Continued Detention, Seek N100million Compensation",
    "summarized_story": "A pregnant woman and six other persons have filed a N100million suit against the Economic and Financial Crimes Commission (EFCC) and one Michael Nzekwe before a Kwara State High Court over alleged infringement on their fundamental human rights.\nSaharaReporters had earlier reported that the EFCC was accused of detaining a six-month-old pregnant woman, a nursing mother and five others for days without trial and on stringent bail conditions on the allegation of vote-buying in Ekiti State.\nThe commission, in a statement issued by its spokesman, Wilson Uwujaren on Monday while confirming that it had to right the detain the suspects, denied that there was a pregnant woman among them.\nThe suit was filed before the court by their counsel, Y.A Alajo, L.O Bello, Olawale Ogundele and S.T Yahaya.\n“An order of mandatory injunction compelling the Respondents, jointly to release the Applicants unconditionally or charge the Applicants in Court, forthwith, for the alleged electoral offence(s) for which they were arrested."
  },
  {
    "headline": "Judge refuses to hear case of lawyer for dressing as 'juju priest' to court",
    "summarized_story": "A federal high court in Lagos has refused to hear the cases filed by Malcolm Omirhobo for appearing before the court dressed as a ”juju priest”.\nThe lawyer had said he was exercising his fundamental rights following the recent verdict of the apex court which affirmed the wearing of hijab in schools.\nOn Monday, the human rights lawyer appeared before Tijani Ringim, the judge, dressed the same way sparking reactions from some lawyers who argued he could not be heard.\nI will adjourn your matter and you come and address the court if the rules allow you to appear in court like this,” the judge said.\nThe judge adjourned the hearing to October 10, 2022."
  },
  {
    "headline": "Judge refuses to hear case of lawyer for dressing as 'juju priest' to court",
    "summarized_story": "A federal high court in Lagos has refused to hear the cases filed by Malcolm Omirhobo for appearing before the court dressed as a ”juju priest”.\nThe lawyer had said he was exercising his fundamental rights following the recent verdict of the apex court which affirmed the wearing of hijab in schools.\nOn Monday, the human rights lawyer appeared before Tijani Ringim, the judge, dressed the same way sparking reactions from some lawyers who argued he could not be heard.\nI will adjourn your matter and you come and address the court if the rules allow you to appear in court like this,” the judge said.\nThe judge adjourned the hearing to October 10, 2022."
  },
  {
    "headline": "'Born in 1958, started school in 1959?' -- fresh questions raised over acting CJN's credentials",
    "summarized_story": "On Monday, following the resignation of Ibrahim Tanko Muhammad, Olukayode Ariwoola was sworn in by President Muhammadu Buhari as the acting chief justice of Nigeria (CJN).\nAriwoola is expected to serve in acting capacity until confirmation by the National Judicial Council (NJC) and the national assembly.\nHowever, fresh questions have been raised over the credentials of Ariwoola, and particularly on the date which he began school.\nAdvertisementBORN IN 1958 AND STARTED SCHOOL IN 1959Ariwoola was born in Iseyin, Oyo state, on August 22, 1958.\nAccording to his credentials, he began his primary education less than a year later in 1959 at the Local Authority Demonstration School, Oluwole, in his hometown."
  },
  {
    "headline": "'Born in 1958, started school in 1959?' -- fresh questions raised over acting CJN's credentials",
    "summarized_story": "On Monday, following the resignation of Ibrahim Tanko Muhammad, Olukayode Ariwoola was sworn in by President Muhammadu Buhari as the acting chief justice of Nigeria (CJN).\nAriwoola is expected to serve in acting capacity until confirmation by the National Judicial Council (NJC) and the national assembly.\nHowever, fresh questions have been raised over the credentials of Ariwoola, and particularly on the date which he began school.\nAdvertisementBORN IN 1958 AND STARTED SCHOOL IN 1959Ariwoola was born in Iseyin, Oyo state, on August 22, 1958.\nAccording to his credentials, he began his primary education less than a year later in 1959 at the Local Authority Demonstration School, Oluwole, in his hometown."
  },
  {
    "headline": "Court dismisses Nnamdi Kanu's fresh bail application",
    "summarized_story": "A federal high court in Abuja has dismissed an application for bail filed by Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nHowever, on April 8, the judge struck out eight of the 15-count charge.\nThe court had on May 18 refused to grant Kanu bail, stating that the application is premature.\nAdvertisementIn a fresh bail application argued by Mike Ozekhome, Kanu challenged the revocation of the bail earlier granted to him.\nAdvertisement“The present application amounts to an abuse of court process for attempting to relitigate an issue already decided by the court."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abeg’s future lies in its rebrand to a social commerce platform",
    "summarized_story": "Payment app, Abeg, has rebranded and will now be called PocketApp, a move that underlines its transition from a payment app to a social commerce app.\nOver 65% of Piggvest’s current users sell something, it made sense for us because we’re trying to create extra value for our current customers,” Chibueze told TechCabal.\nPocketApp has expressed interest in tapping into Nigeria’s social commerce market which is estimated to reach US$23.8 billion by 2028.\nPocketApp COO, Patricia Adoga, said that the PocketApp infrastructure has been in the works for over 18 months to enable secure social commerce because social commerce thrives better in a more trusted environment.\nThe company said in a statement that as a full social commerce app, it will connect buyers and sellers across Nigeria, and soon, other African countries."
  },
  {
    "headline": "The Next Wave: How development agencies are investing in Africa’s tech ecosystem",
    "summarized_story": "During my time at these conferences, I realised that funding and support for African startups and the tech ecosystem don’t just come from investment firms, angel investors, corporates, and tech hubs.\nSenegal’s Délégation Générale à l’Entreprenariat Rapide des Femmes et des Jeunes (DER) since 2018 has been investing in the country’s tech environment, granting about 60 billion FCFA (~$96,424,000) out and helping transform the Senegalese tech ecosystem.\nMany other African country governments like Mauritius, Congo, Tunisia, Ghana, and Rwanda have initiatives to spur the tech ecosystem in their country.\nBetter awareness of the different players and activities in the African tech ecosystem creates room for collaboration.\nOne way to scale the impact of the investment activities of development agencies in the Africa tech ecosystem is to increase similar partnerships between them and other players such as tech hubs, universities, and research institutes."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Shaibu visits community of murdered catholic priest, condemns killing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… urges calm, assures assailants will be brought to bookThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, has condemned the killing of a Catholic Priest, Rev.\nChristopher Odia, in Ikabigbo, Etsako West Local Government Area of the State.\nShaibu, who led other government functionaries and heads of security agencies in the state, on Monday, to Ikabigbo, called for calm among residents in the community.\nChristopher Odia at St. Michael Catholic Church, Ikabigbo in Etsako West Local Government Area."
  },
  {
    "headline": "Obaseki pays harmonized pension to Edo retirees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn fulfillment of the implementation of the harmonized pension announced on Workers’ Day, Governor Godwin Obaseki has paid verified pensioners in the state their pension for the month of June, reflecting the harmonized rate.\nIn a statement, Secretary to the State Government, Osarodion Ogie said: “With the approval of the Edo State Governor, Mr. Godwin Obaseki for the harmonization of monthly pension, retirees with the state government who took part in the last verification exercise held across the state, have been paid their pension for the month of June, today, June 27, 2022, reflecting the harmonized rate.”He added, “The payment of the harmonized pension to the verified retirees is in line with the government’s commitment to provide succour to pensioners, who are overburdened with the weight of the harsh economic realities in the country.”Governor Obaseki had on Workers Day announced the payment of harmonized pension to retirees in the state after 21 years, as well as the increment of the minimum wage in the state from N30,000 to N40,000.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "How Rev Father, four others were killed in Edo kidnap – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- At least, three lives including that of two suspected kidnappers were lost when gunmen abducted and killed the parish priest of St Michael Catholic church, lkhabigbo , Etsako West local government area of Edo state, Rev Father Christopher Odia, last Sunday.\nIt was gathered that the Rev Father was in his rectory about to go out for mass on Sunday June 26, 2022 when the gunmen struck.\nIt was scooped that the said Kabiru, an old Fulani man in the community connived with four other Fulanis in Aviele town to kidnap the Rev Father.\n‘In fustration, the kidnapped Rev Father Christopher Odia was killed by his abductors.\nCP Abutu further encouraged Edo state people not to relent in providing the police with prompt and useful information."
  },
  {
    "headline": "Police kill 2 robbery suspects in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command says its operatives have killed two armed robbery suspects in a gun duel in Benin City.\nThe police command further stated that the two suspects were members of a robbery gang that robbed an Oil and Gas station Off Murtala Mohamed way Benin City, yesterday.\n“The Armed robbers were later successfully trailed to a different location where they were carrying out another Armed Robbery operation.\n“On sighting the team of Security Operatives, the armed robbers opened fire on them which led to a gun duel.\n“The two suspected Armed robbers were taken to the Police Cottage hospital in Benin city where they were confirmed dead by the doctor and their bodies deposited at the mortuary”."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "PVC: INEC shuts down operations in FCT, as crowd overwhelmed officials",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Tuesday ended abruptly the ongoing Continuous Voters Card (CVR) registration in the Federal Capital Territory (FCT), Abuja over crowd disturbance.\nSomebody who has never come to INEC before will just walk into the office that he wants to collect his PVC.\nOne of the youths, Emmanuel Ogbon, said that he got to the INEC office at about 5am and was given a book to write his name.\n“It has been come back today, come back tomorrow, at the end of this month, the CVR process will come to an end.\n“Secondly, if we are not given this PVC today or by Wednesday as promised, it won’t be good, now the most painful thing is that they are inside and not responding to anyone.’’"
  },
  {
    "headline": "Controversy surrounds age, health status of new CJN, Olukayode Ariwoola,",
    "summarized_story": "There are controversies over the age and health status of Olukayode Ariwoola, who was on Monday, sworn in by President Muhammadu Buhari as the acting chief justice of Nigeria (CJN).\nAriwoola is expected to serve in acting capacity until confirmation by the National Judicial Council (NJC) and the national assembly.\nAt the swearing-in ceremony in the presidential villa, the acting CJN swore to be faithful and bear true allegiance to the federal government, as well as defend the constitution of the Federal Republic of Nigeria.\nAriwoola, according to his credentials, was born in Iseyin, Oyo state, on August 22, 1958.\nMany have thus, wondered how possible it is for the new CJN to have started school just a year after he was born."
  },
  {
    "headline": "JUST IN: Court dismisses Nnamdi Kanu’s fresh bail application",
    "summarized_story": "A Federal High Court sitting federal in Abuja has dismissed a fresh application for bail by Mazi Nnamdi Kanu, the detained leader of the Indigenous People of Biafra (IPOB).\nThe trial judge noted that from records of the court, Kanu was represented by his lawyer on the day his bail was revoked, likewise his sureties.\n“The present application amounts to an abuse of court process for attempting to relitigate an issue already decided by the court.\nThe Judge had also on March 18, declined to release the embattled IPOB leader on bail.\n“However, the defendant is at liberty to re-file the application”, Justice Nyako said."
  },
  {
    "headline": "Ekweremadu, wife sue NIMC, others, say donor’s organ not compatible with daughter",
    "summarized_story": "Senator Ike Ekweremadu, former deputy senate president and his wife, Beatrice, have filed a suit against the National Identity Management Commission (NIMC) and others over the alleged organ harvesting victim’s age.\nRespondents in the suit include: NIMC, the Comptroller General of Nigeria Immigration Service (NIS), Stanbic-IBTC Bank, United Bank of Africa (UBA) and Nigeria Inter-Bank Settlement System Plc.\nThe medical test conducted revealed that Mr Ukpo’s kidney was not compatible with their daughter as he is not a suitable donor.\nBO0569974 for the purpose of assisting criminal investigation and tendering same before the Uxbridge Magistrate Court, UK until July 7 in the alleged criminal charge brought against the applicants.\n“An order of court directing UBA to supply the applicants with the Certified True Copy of mandate card and account opening package of account No."
  },
  {
    "headline": "How ex-CJN’s resignation was delayed to stop Mary Odili from succeding him – Report",
    "summarized_story": "‘Tanko Muhammad battled dementia, memory disorder as CJN’A detailed revelation of how the Chief Justice of Nigeria (CJN), Tanko Muhammad, was forced to delay his exit from the judiciary in order to prevent the emergence of retired Justice Mary Odili as his successor, has emerged.\nBut he didn’t want some forces to take advantage of his challenge to hijack or influence Supreme Court decisions, which they reckoned could cause crisis in the country.\nSources said Justice Muhammad got a medical advisory to “slow down drastically”.\n“He has no disdain for his colleagues, but his health challenge accounted for the lapses which led to a letter of protest by Supreme Court Justices.\n“The committee on March 24 submitted a list of demands by the Supreme Court Justices to the CJN, which could not be met."
  },
  {
    "headline": "30 Killed In Cameroon Land Tussle",
    "summarized_story": "A spokesman for the Presbyterian Church in Cameroon said the fight between the Oliti and Messaga Ekol groups in Akwaya was very violent.\nHe added that people were burnt in their homes while others were beheaded in the attack.\nAn MP, Aka Martin Tyoga, told the BBC that the attackers promised to return in two days.\nOn Monday, a Human Rights Watch report said separatist fighters have killed at least seven people, raped one girl, and carried out scores of kidnappings since January.\nThe rights group called for the prosecution and sanctioning of separatists fighters for these and other “grave human rights abuses”."
  },
  {
    "headline": "30 Killed In Cameroon Land Tussle",
    "summarized_story": "A spokesman for the Presbyterian Church in Cameroon said the fight between the Oliti and Messaga Ekol groups in Akwaya was very violent.\nHe added that people were burnt in their homes while others were beheaded in the attack.\nAn MP, Aka Martin Tyoga, told the BBC that the attackers promised to return in two days.\nOn Monday, a Human Rights Watch report said separatist fighters have killed at least seven people, raped one girl, and carried out scores of kidnappings since January.\nThe rights group called for the prosecution and sanctioning of separatists fighters for these and other “grave human rights abuses”."
  },
  {
    "headline": "Customs Intercepts Adulterated Diesel, Others Worth N1.29bn In Ogun",
    "summarized_story": "A petroleum tanker laden with 45, 000 litres of adulterated diesel being imported into the country, as well as 14 trucks of foreign parboiled rice, weighing 50kg each top the list of seizure recorded by the Ogun Area 1 Command of Nigeria Customs Service (NCS) between the month of May and 25th of June, 2022.\nThis is just as the command also intercepted 23, 400 pairs of footwear, 289 cartons of tomato paste, 1,100 packets of Tramadol, as well as several sacks and wraps of weeds, suspected to be Cannabis Sativa among other contrabands, which Duty Payable Value (DPV) worth over N1.\n29 billion within the period under review.\nTaking journalists round what he described as “uncommon seizures under a month” yesterday in Idiroko Border, the Customs Area Controller (C.A.C) for Ogun 1 Command, Comptroller Bamidele Makinde explained that the adulterated diesel product was intercepted along the Sagamu – Ijebu Ode expressway, while the bunkerer absconded upon sighting the command’s operatives.\nMakinde explained that the command generated a total revenue of over N12."
  },
  {
    "headline": "Customs Intercepts Adulterated Diesel, Others Worth N1.29bn In Ogun",
    "summarized_story": "A petroleum tanker laden with 45, 000 litres of adulterated diesel being imported into the country, as well as 14 trucks of foreign parboiled rice, weighing 50kg each top the list of seizure recorded by the Ogun Area 1 Command of Nigeria Customs Service (NCS) between the month of May and 25th of June, 2022.\nThis is just as the command also intercepted 23, 400 pairs of footwear, 289 cartons of tomato paste, 1,100 packets of Tramadol, as well as several sacks and wraps of weeds, suspected to be Cannabis Sativa among other contrabands, which Duty Payable Value (DPV) worth over N1.\n29 billion within the period under review.\nTaking journalists round what he described as “uncommon seizures under a month” yesterday in Idiroko Border, the Customs Area Controller (C.A.C) for Ogun 1 Command, Comptroller Bamidele Makinde explained that the adulterated diesel product was intercepted along the Sagamu – Ijebu Ode expressway, while the bunkerer absconded upon sighting the command’s operatives.\nMakinde explained that the command generated a total revenue of over N12."
  },
  {
    "headline": "Fayemi Appoints Agbede As New Ekiti State Head of Service",
    "summarized_story": "Ekiti State Governor Kayode Fayemi has approved the appointment of Mr. Bamidele Olugbenga Agbede as the new Head of Service in the state civil service.\nHe takes over from the state’s first female Head of Service, Mrs Peju Babafemi, who is billed to retire from the state’s civil service on June 30, having attained the mandatory 35 years in the service.\nMeanwhile, Governor Fayemi has commended Mrs Babafemi for her demonstrated brilliance, diligence and professionalism which has greatly helped in repositioning the state civil service for optimal service delivery.\nAgbede, the new Head of Service holds a Bachelor of Arts degree in History as well as a Law degree from the Ondo State University (now Ekiti State University), Ado-Ekiti.\nHe was on secondment to the Ekiti State Independent Electoral Commission (EKSIEC) as Executive Secretary between 2000 and 2004."
  },
  {
    "headline": "Senate moves to probe Justice Tanko Muhammad despite resignation",
    "summarized_story": "The Senate on Tuesday declared that allegations against Justice Ibrahim Tanko Muhammad will be investigated despite his resignation as the Chief Justice of Nigeria (CJN).\nThe resolution of the Red Chamber followed a motion by the Chairman, Senate Committee on Judiciary, Human Rights and Legal Matters, Senator Opeyemi Bamidele.\nIn a protest memo signed by 14 Supreme Court judges, Muhammad was accused of not giving justices their legitimate entitlements.\nThe justices said their annual foreign training, meant to enhance capacity building for the country’s judicial process, had been blocked by Muhammad.\nHowever, Muhammad had replied to the judges, giving a breakdown of the expenses that the nation’s apex court made under him."
  },
  {
    "headline": "Traffic operatives banned from forcefully removing vehicle number plates",
    "summarized_story": "By Kelechi OgunleyeMr Abdul-Lateef Bello, Director, Federal Capital Territory (FCT), Vehicle Inspection Office, has banned traffic operatives from forcefully removing vehicle number plates of traffic offenders in the territory.\nEmetu said Bello gave the directive while presenting the new operational order to personnel of the office recently.\nThe PRO said the operatives had rather been directed to make use of their telephone cameras to capture the number plates of such vehicles.\nHe said that the image of the number plate was to be sent to the directorate’s control room, saddled with the responsibility of stipulating fines on defaulters, through telephone or email messages.\n“Removal of plate numbers from vehicles is out of fashion, and the territory remains a model city in Nigeria."
  },
  {
    "headline": "BREAKING: Court dismisses Nnamdi Kanu’s fresh bail application",
    "summarized_story": "The trial judge noted that from records of the court, Kanu was represented by his lawyer on the day his bail was revoked, likewise his sureties.\n“The present application amounts to an abuse of court process for attempting to relitigate an issue already decided by the court.\n“This application is accordingly dismissed”, Justice Nyako held.\nThe court maintained that Kanu must explain the reason why he breached the previous bail that was given to him before he could enjoy another favourable discretion from it.\n“However, the defendant is at liberty to re-file the application”, Justice Nyako added."
  },
  {
    "headline": "JUST IN: Nnamdi Kanu arrives court ahead of bail application hearing",
    "summarized_story": "JUST IN: Nnamdi Kanu arrives court ahead of bail application hearingNnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, has arrived the Abuja Federal High Court as his trial resumes.\nThe IPOB leader is facing trial before Justice Binta Nyako-led court for charges bordering on terrorism.\nA few weeks ago, Justice Nyako had struck out some charges from those levelled against Kanu by the Federal Government.\nHowever, the court is expected to rule on Kanu’s bail application today.\nThe IPOB leader was rearrested in Kenya and repatriated to Nigeria."
  },
  {
    "headline": "Don’t Arrest, Harass Nnamdi Kanu’s Supporters In Tuesday’s Court Sitting – IPOB Leader’s Lawyer Warns Nigerian Security Operatives",
    "summarized_story": "Ejiofor argued that there had been several high-profile trials involving prominent Nigerians, with supporters thronging the court premises in solidarity, who were not intimidated by the security agencies.\nThis is even as he advised the supporters to be civil in their approach while at the court premises.\nHis statement reads, “We conducted our routine court-Ordered visit to our indefatigable Client – Onyendu Mazi Nnamdi Kanu at the DSS Headquarters.\n“It is possible you all may not be accommodated within the precinct of the Court, but you could organise yourselves outside the Court premises and remain peaceful, as always.\nTherefore, we expect utmost decorum in and around the Court tomorrow."
  },
  {
    "headline": "PDP Threatens To Expose Obasanjo, Gives Him 48hrs To Clarify Comments On Atiku",
    "summarized_story": "Peoples Democratic Party ( PDP) has threatened to expose the former President Olusegun Obasanjo and tell the whole world and Nigerians who he is if he failed to retract his comments on its Presidential Candidate, Atiku Abubakar in 48 hours.\nSenator Walid Jibrin, the Chairman of the PDP Board of Trustees (BoT) said this while speaking to journalists in Kaduna State, northwest Nigeria.\n“The statement which was among others that he, Obasanjo, made a mistake of appointing the PDP Presidential candidate, Alhaji Atiku as his running mate was unfortunate.\n“In the present circumstance, I wish to appeal to former President Obasanjo to come out openly to repeat what he has said.\nWe will do all within our powers to ensure victory for Atiku and Okowa come 2023 Presidential elections.”"
  },
  {
    "headline": "NCC says telecom firms’ operating costs have risen by N265bn",
    "summarized_story": "Latest data from the Nigerian Communications Commission, NCC, has shown that operating costs of telecommunication companies in Nigeria increased by N265.25 billion in one yearThe figure contained in the 2021 Subscriber/Network Data Annual Report’ by the NCC showed that the operating costs rose from N1.4tn in 2020 to N1.66tn in 2021.\nThe report read in part, “Total operating cost for the mobile network operators increased from N1, 395,000,000,000 in 2020 to N1, 658,235,000,000 at the end of 2021.\nThe President, ALTON, Mr. Gbenga Adebayo, said that the industry was worried about how the rising cost of diesel would further drive the high cost of business.\nAll network planning, operational expenses and planned projection for the year is based on the fact diesel prices.\nBut we are mindful of the high cost of living, and the implication of this on the economy and citizens."
  },
  {
    "headline": "AfDB moves to cut $14bn annual import of medicine into Africa",
    "summarized_story": "Board of Directors of the African Development Bank (AfDB) has approved the establishment of African Pharmaceutical Technology Foundation for Africa’s access to technologies.\n“African pharmaceutical companies do not have the scouting and negotiation capacity, and bandwidth to engage with global pharmaceutical companies.\n“They have been marginalized and left behind in complex global pharmaceutical innovations.”He decried that of 35 companies which recently signed a licence with America’s Merck to produce Nirmatrelvir, a COVID-19 drug, none was African.\nAccording to him, no institution exists in Africa to support the practical implementation of Trade Related Intellectual Property Rights (TRIPs) on nonexclusive or exclusive licensing of proprietary technologies, know-how and processes.\n“It will be staffed with world-class experts on pharmaceutical innovation and development, intellectual property rights, and health policy”, he stated."
  },
  {
    "headline": "Amazing Discounts On Itel Smartphones As Jumia Celebrate 10th Anniversary",
    "summarized_story": "This time around, itel has partnered with Jumia for its 10th anniversary celebration.\nOnline shoppers can get up to 2,000 naira discounts, free gifts, and itel accessories when they purchase itel smartphones and other products on itel’s online store on the Jumia app or website.\nCustomers will also enjoy discounts on the itel A25 Pro, P37, S17, A58, and A37.\nCustomers in Ibadan, Abuja, and Lagos will not have to pay for the delivery of their smartphones when they buy from the itel store on Jumia.\nTo get shopping on itel’s store and to get amazing discounts, click on this link to get started."
  },
  {
    "headline": "MTN’s Mobile Money Bank suffers N22b fraud, drags18 banks to court for recovery",
    "summarized_story": "By Kenneth AtavtiNewly licensed Mobile Money Payment Service Bank Limited (MOMO PSB) a banking subsidiary of MTN Communications Limited has in less than a month operations suffered a massive fraud worth over N22 billion on its network.\nIn an affidavit in support of the originating summons, the Chief Executive Officer (CEO), MOMO PSB Ltd, Mr. Anthony Usoro Usoro claimed that MOMO PSB Ltd is the bona fide owner of the aggregate sum of N22.3 billion which is maintained in its MOMO settlement account.\nAnthony in the affidavit further claimed that a total of about 700, 000 transactions were processed with credits made into about 8,000 various accounts in the listed 18 banks.\nThe erroneous transfers, he claimed, were due to the fact that MOMO PSB Ltd suffered a system exploitation which led to the said debits.\nIt added that its resort to the court was informed by the insistence of the 18 banks that they needed to be ordered by the Federal High Court before they could act."
  },
  {
    "headline": "Collaboration is success path to 5G deployment in Nigeria – NCC",
    "summarized_story": "According to him, the policy framework for the deployment has come into place and will facilitate deployment of services by the recent winners of the 3.5GHz spectrum auction, MTN Nigeria Communications Ltd and MAFAB Communications Ltd.\nHe said the Commission has set out the regulatory instruments needed for fast deployment of the new versatile technology for the benefit of the consumers and the stakeholders.\nProf. Danbatta, therefore, invited the support of all stakeholders to ensure that 5G technology is deployed in Nigeria in a manner beneficial to all telecom consumers and to support the emergent Digital Economy Policy of the Federal Government of Nigeria.\nHe highlighted the potential use cases for 5G networks as broadly categorised by the International Telecommunication Union (ITU) to include Enhanced Mobile broadband (eMBB), Massive Machine-type Communications (mMTC), as well as Ultra-reliable and Low-latency Communications (uLLC)“We will continue to collaborate with stakeholders across sectors to ensure faster deployment of 5G services, and accelerate the growth of Nigeria’s broadband infrastructure,” he said.\nHe identified some challenges in the deployment to include limited frequencies with the required spectral efficiency, skilled professionals with requisite knowledge of the technology, fewer number of 5G-enabled devices, and cost of deployment but stated that the industry must work to turn the challenges into opportunities rather than seeing them as obstacles."
  },
  {
    "headline": "Court Dismisses Nnamdi Kanu’s Bail Application",
    "summarized_story": "The Federal High Court in Abuja has dismissed the application for bail by the detained leader of the Proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nShe, however, advised the applicant to approach the Court of Appeal on the issue of bail, should he feel aggrieved by the decision of the court.\nREAD ALSO: Court Denies Nnamdi Kanu Bail, Prosecutors Withdraw Newly Amended Charges Against HimJustice Nyako stated that from the records of the court, Kanu was represented by his lawyer on the day his bail was revoked, likewise his sureties and he has never been denied a fair hearing.\nThereafter, the case was adjourned until November 14 for mention and to await the outcome of Kanu’s appeal at the appellate court.\nTuesday’s ruling comes a month after the court declined to release the embattled IPOB leader on bail on May 18."
  },
  {
    "headline": "Alleged Organ Harvesting: Ekweremadu, Wife Sue NIMC, Immigration, Others",
    "summarized_story": "Former Deputy Senate President, Ike Ekweremadu, and his wife, Beatrice, have sued the National Identity Management Commission (NIMC), Nigeria Immigration Service (NIS), and two commercial banks in a Federal High Court in Abuja.\nThe duo filed the suit before Justice Inyang Ekwo amid allegation of organ harvesting against them by the United Kingdom authorities, involving one David Nwamini.\nChannels Television had reported that the London Metropolitan Police said it had arrested Senator Ekweremadu and his wife over allegations of conspiring to bring a child to the UK for organ harvesting.\nREAD ALSO: Alleged Organ Harvesting: Immigration Confirms Age Of ‘Victim’ In Ekweremadu’s CaseAs the controversy continues, Senator Ekweremadu and his wife filed an originating summon through their counsel and a Senior Advocate of Nigeria (SAN), Adegboyega Awomolo, at the court in Abuja.\nThey prayed the court for an order directing the NIMC to bring out the Certified True Copy of the biodata of David Ukpo Nwamini."
  },
  {
    "headline": "Okagbare Ban Extended, Robs Nigeria Of World Athletics Championships Relay Spot",
    "summarized_story": "Blessing Okagbare has had her ban extended as Nigeria’s 4×100m relay team lose their qualification spot for the World Athletics Championships in Oregon, United States.\nAccording to the Athletics Integrity Unit, Okagbare’s 10-year ban has been extended by a year after she was found to have committed additional anti-doping rule violations.\nFollowing her latest sanction, Okagbare seemed to respond with a cryptic message on social media.\nAs result, Nigeria’s 4x100m relay team have now lost their spot for July’s World Athletics Championships because Okagbare took part in the 4x100m event at the Nigeria Olympic trial six days after evading sample collection on June 13, 2021.\nNigeria’s 4×100m women’s team had the last qualification spot before this latest ruling and the deadline to achieve a fresh qualification time elapsed on Sunday."
  },
  {
    "headline": "PDP Tackles Obasanjo Over Comments On Choice Of Deputy In 1999",
    "summarized_story": "The Peoples Democratic Party has tackled former President Olusegun Obasanjo over comments that he made mistake when he picked his Vice President in 1999.\nObasanjo had over the weekend said he made a mistake in the choice of his number two ahead of the 1999 presidential election.\nHe was elected as President in 1999 along with the current PDP presidential candidate, Atiku Abubakar, as his vice-president.\nHe further accused Obasanjo of being angry with Atiku Abubakar for truncating his third term agenda despite the latter’s contribution to the Obasanjo administration.\n“I wish to appeal to former President Obasanjo to come out openly to repeat what he has said,” Jibril said."
  },
  {
    "headline": "Serena Returns At Wimbledon As Nadal Eyes Next Leg Of Slam",
    "summarized_story": "Serena Williams returns to singles tennis at Wimbledon after a year away on Tuesday as Rafael Nadal begins his quest to win the third leg of a potential calendar Grand Slam.\nWilliams, 40, won the last of her Wimbledon singles titles six years ago but reached the final in 2018 and 2019.\nThe American, who was given a wildcard for this year’s tournament, is stuck on 23 Grand Slam singles wins — agonisingly one short of Margaret Court’s all-time record.\nThe Spaniard’s win at Roland Garros earlier this month took him to 22 Grand Slam singles titles — two clear of Djokovic and Roger Federer.\nNadal won the most recent of his two Wimbledon titles in 2010, having captured his first with an epic triumph over Federer two years earlier."
  },
  {
    "headline": "NASS begins construction work on complex, roads, diverts traffic -",
    "summarized_story": "The National Assembly has kicked of construction work on the leaking complex housing the two chambers.\nThe road leading to the complex has also been shut to enable repair works.\nTraffic has now been diverted to the annex gate while lawmakers access the complex using the Villa gate."
  },
  {
    "headline": "Fayemi appoints Agbede as new Head of Service",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi has approved the appointment of Bamidele Olugbenga Agbede as the new Head of Service in the State Civil Service.\nHe takes over from the State’s first female Head of Service, Mrs Peju Babafemi, who is billed to retire from the State Civil Service on June 30th, having attained the mandatory 35years in service.\nMeanwhile, Governor Fayemi has commended Mrs Babafemi for her demonstrated brilliance, diligence and professionalism which has greatly helped in repositioning the State Civil Service for optimal service delivery.\nAgbede, the new Head of Service holds a Bachelor of Arts degree in History as well as a Law degree from the Ondo State University (now Ekiti State University), Ado-Ekiti.\nAgbede, who hails from Ikole Local Government Area, was appointed Permanent Secretary in December 2012."
  },
  {
    "headline": "Fayemi inaugurates 18-member transition committee",
    "summarized_story": "The Transition committee and Advisory Council for the incoming administration in Ekiti State has been inaugurated.\nWhile inaugurating the Council members, the Governor of Ekiti State, Kayode Fayemi said he is delighted that Ekiti State is in safe hands with the emergence of Biodun Abayomi Oyebanji and urged members of the Council to ensure a smooth transition from the current administration to the nextIn his Opening remark, the Attorney-General and member of the Transition Committee, Olawale Fapohunda, said Ekiti is the first state to enact and implement the Transition Law which entails that the succeeding administration must not abandon any project initiated by the outgoing administrationThe Governor while delivering his address ,highlights the robust CV and achievements of the incoming Governor since the creation of the State in 1996,reiterating his involvement in the outgoing administration, and charges the Transition committee to deliver on the assignment within 6 weeks time frame.\nResponding on behalf of the Committee members, Senator Olubunmi Adetumbi appreciates the opportunity to serve and commends the Fayemi administration which he says will give the basis for a seamless processThe committee is to be chaired by the Deputy Governor of the State, Bisi Egbeyemi and co-chaired by Senator Olubunmi Adetumbi, they will work with 16 other members."
  },
  {
    "headline": "2023: Northern group canvasses for Dogara as Tinubu's running mate -",
    "summarized_story": "A northern group in Kaduna state, the Coalition for Peace and Progress (CPP) has kicked against insinuations that only a Muslim-Muslim ticket will guarantee victory for the ruling All Progressives Congress (APC) in the 2023 general elections.\nThe group is also suggesting that the leadership of the ruling All Progressive Congress (APC) consider the immediate past speaker of the House Of Assembly, Yakubu Dogara as the running mate to Asiwaju Bola Ahmed Tinubu.\nThey say considering the diverse nature of Nigeria and the need to ensure a sense of fairness to all tribes and religion, it is important that the Vice Presidential candidate is a Christian from the North-East.\nThey further argue that the agitation for a Muslim-Muslim ticket if given credence by the APC will portray the North as Insensitive and may jeopardize the chances of the party in 2023."
  },
  {
    "headline": "Nigeria: Court Dismisses Proscribed IPOB Leader Nnamdi Kanu’s Fresh Bail Application",
    "summarized_story": "The trial judge noted that from records of the court, Kanu, was represented by his lawyer on the day his bail was revoked, likewise his sureties.\n“The present application amounts to an abuse of court process for attempting to relitigate an issue already decided by the court.\n“This application is accordingly dismissed”, Justice Nyako held.\nIt will be recalled that the court had also on March 18, declined to release the embattled IPOB leader on bail.\n“However, the defendant is at liberty to re-file the application”, Justice Nyako added."
  },
  {
    "headline": "Okagbare’s Doping Ban Extended, Keeping Nigeria’s 4-by-100 Women’s Relay Team from World Championships",
    "summarized_story": "Sprinter Blessing Okagbare’s doping violations will keep her Nigerian teammates from participating in the 4×100 meter relay at next month’s world championships.\nThe Athletics Integrity Unit, which oversees doping cases in track, announced Monday it was extending Okagbare’s 10-year ban by a year and making it retroactive to June 13, 2021.\nThat’s six days before she competed at Nigeria’s Olympic trials, with her relay squad qualifying for this year’s worlds.\nThe former world champion originally received her 10-year ban in February for being part of an organized doping regimen in preparation for last year’s Tokyo Olympics.\nThat law was passed to go after people and organizations that fund and promote doping schemes."
  },
  {
    "headline": "Days of Drug Abuse in Nigeria Are Numbered, Says VP Osinbajo",
    "summarized_story": "Nigeria’s Vice President, Prof. Yemi Osinbajo has assessed the current war being waged against illicit drugs in the country and declared that the days of drug abuse were numbered in Nigeria.\nHe, however said the nation was winning the drug war, adding that the days of the scourge of drug abuse and dependency in the country were numbered.\nThe days of the scourge of drug abuse and dependency are clearly numbered, but it will involve even greater investment in focus and determination for the long haul,” according to the Vice President.\nHis vision and strong resolve have given the war against drug trafficking and abuse new energy, purpose and clearer direction.\n“The master plan adopts a comprehensive and inclusive approach to addressing issues of drug supply reduction, issues of drug abuse and it has it is based on four thematic pillars, drug supply reduction, demand reduction, access to drug on medical purposes, and governance and coordination."
  },
  {
    "headline": "Cash-Strapped Nigeria Again Loses $650.7m Crude to Force Majeure, Equipment Failure",
    "summarized_story": "Nigeria again lost a whopping $650.7 million to crude oil losses resulting from declaration of force majeure, equipment failures and host communities’ disturbances between the April and May production cycle.\nWhen converted to naira, the country’s local currency, using the official exchange rate of N420/$, the amount Nigeria lost for the period was an estimated N273,296,023,560.\nTo put it in proper context, the gross domestic crude oil and gas revenue from sales for the entire month of May was N426.14 billion, the highest in months.\nFor the entire month, Nigeria lost 3.450 million barrels of oil from the facility.\nThe country’s sweet crude oil is known as Bonny Light."
  },
  {
    "headline": "Nigeria: FIRS to the Rescue as Subsidy Gulps NNPC’s Revenue",
    "summarized_story": "The trend has continued in the first five months of 2022 as the NNPC’s contribution is still weighed down by the fuel subsidy burden.\nThe World Bank had estimated that fuel subsidy payment in the country may rise to N5 trillion this year.\nIn January, February and March 2022, petrol subsidy gulped 210.38 billion, N219.78 billion, and N245.77 billion, respectively while in April, the country spent N271 billion.\nSadly, the agency could only spend 4.8 per cent of its revenue on capital projects.\nSpecifically, FIRS has lots of capital projects it had started (including its Corporate Headquarters which is rated one of the 10 top capital projects in Africa) and could not complete the project for lack of funds."
  }
]