[
  {
    "headline": "I never visited British envoy over IPOB, says Kalu",
    "summarized_story": "Senator Orji Kalu has refuted social media reports of him paying a private visit to the British High Commissioner to Nigeria, Mrs Catriona Laing, to discuss issues relating to IPOB.\nHe explained that contrary to rumours, it was the British High Commissioner that visited him at his Abuja residence on May 13.\nHe said that he was accompanied by Political Counsellor, British High Commission, Mr Jonathan Bacon and Mr Stuart Gardner.\nHe said Ngige was not even aware that the British envoy was paying him a visit on that same day.\nKalu stressed, ”Putting the records straight, I neither visited nor discussed IPOB with British High Commissioner as reported.” (NAN)"
  },
  {
    "headline": "BREAKING: Senate okays five INEC commissioners, suspends Adam’s confirmation",
    "summarized_story": "The Senate after considering the report of its Committee on the Independent National Electoral Commission, on Tuesday, confirmed the appointment of five National Commissioners for the nation’s electoral umpire.\nThe nominees of the President, Major General Muhammadu Buhari (retd), who were confirmed were, Prof. Muhammad Sani Kallah (Katsina); Prof. Kunle Ajayi ( Ekiti); and Saidu Ahmad (Jigawa), Baba Bila (North East) and Abdullahi Zuru (North- West).\nAlso, the Senate, following the recommendation of its panel, stepped down the confirmation of Professor Sani Adam from North Central because of the petitions against him.\nDetails later…"
  },
  {
    "headline": "Kalu denies visiting British envoy to discuss IPOB matters",
    "summarized_story": "Orji KaluSenator Orji Kalu has refuted social media reports of him paying a private visit to the British High Commissioner to Nigeria, Mrs Catriona Laing, to discuss issues relating to IPOB.\nHe explained that contrary to rumours, it was the British High Commissioner that visited him, at his Abuja residence on May 13.\nHe said that he was accompanied by Political Counsellor, British High Commission, Mr Jonathan Bacon and Mr Stuart Gardner, the First Secretary on Political.\nHe explained that prior to the arrival of the British envoy, the Minister of Labour and Employment, Dr Chris Ngige, was in his house on a cordial visit.\nKalu stressed that ” Putting the records straight, I neither visited nor discussed IPOB with British High Commissioner as reported.”(NAN)Vanguard News Nigeria"
  },
  {
    "headline": "World Population Day: UNFPA calls for closure of gaps on sexual, reproductive services",
    "summarized_story": "“But the real cause for concern comes when people cannot exercise their sexual and reproductive rights and choices because of disruptions in the health services.\n“The COVID19 pandemic has compromised health care systems particularly in the area of sexual and reproductive health.\n“Against this backdrop, many countries are expressing growing concern over changing fertility rates.\nHistorically, alarmism over fertility rates has led to abrogations of human rights.”The agency further emphasised that women must be empowered educationally, economically and politically to exercise choice over their bodies and fertility.\nOn average 4.5 children each; by 2015, total fertility for the world had fallen to below 2.5 children per woman."
  },
  {
    "headline": "Rep member withdraws controversial bill seeking to jail protesters",
    "summarized_story": "By Levinus NwabughioguSponsor of the controversial bill seeking a 5-year jail term for protesters, Hon.\nChinedu announced the formal withdrawal of the bill in a letter read by the Speaker of the House, Femi Gbajabiamila at Tuesday plenary.\nREAD ALSO: Tension in Abuja over fresh protest in Dunamis ChurchChinedu however said he was misquoted in the media, saying he was not sponsoring a bill to jail protesters.\nAcknowledging the letter, Gbajabiamila said “It’s your prerogative.\nThe bill is hereby withdrawn.”The Speaker however asked the media be accurate in its reportage."
  },
  {
    "headline": "Breaking: Senate bows to pressure, fails to confirm Onochie as INEC Commissioner",
    "summarized_story": "By Henry Umoru, AbujaTHE Senate on Tuesday bowed to pressure from Civil Society Organisations, the Peoples Democratic Party, PDP and other Nigerians and refused to confirm the Special Assistant on new media to President Muhammadu Buhari, Lauretta Onochie from Delta as a Commissioner of the Independent National Electoral Commission, INEC.\nThe refusal was based on Federal Character Principle and to adhere strictly to the Act, just as the Senate said that she is from Delta and the state has May Agbamuche who is the Chairman, Legal Services, INEC.\nThe resolution of the Senate was sequel to the consideration of the Senator Kabiru Gaya, APC, Kano South led Senate Committee on the Independent National Electoral Commission, INEC.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "2021 UTME: JAMB threatens withdrawal of candidates’ results involved in malpractice",
    "summarized_story": "By Joseph ErunkeTHE Joint Admissions and Matriculation Board, JAMB, has said it would not hesitate to withdraw results of candidates involved in malpractice in the just concluded Unified Tertiary Matriculation Examination, UTME, after thorough viewing of Close Circuit Television,CCTV cameras deployed for the examination.\nOn the alleged poor performance by candidates in this year’s exam , Oloyede said UTME is not a certification exam, hence, there cannot be an issue of mass failure.\nAs if.., the exam will conduct is one chance exam.\n4 million candidates registered for this year’s exam because of the NIN which prevented dubious registration.\nOloyode also revealed that plans are underway to put in place 2,500 capacity CBT centre in the present JAMB headquarters for the conduct of UTME and other exams for government agencies."
  },
  {
    "headline": "INEC: Reactions trail Lauretta Onochie’s rejection by Senate",
    "summarized_story": "Reactions have trailed the rejection of Lauretta Onochie, aide to President Muhammadu Buhari, as a National Commissioner of the Independent National Electoral Commission (INEC) by the Nigerian Senate.\nDAILY POST had reported that the Senate, on Tuesday, declined Lauretta Onochie’s nomination.\nReacting, some Nigerians on social media hailed Onochie’s rejection saying it was victory for democracy.\nWe all did it together.”@emmaikumeh,”Now the Senate has rejected the nomination of Lauretta Onochie as National Commissioner for INEC.\nStay FOCUSED!.”@buchinjere, “Was Lauretta Onochie’s nomination to prove to us the independence of the current Senate?"
  },
  {
    "headline": "Insecurity: Buhari meets 109 senators in Aso Villa",
    "summarized_story": "President Muhammadu Buhari will, on Tuesday night at 8 pm, host the 109 Senators of the 9th Senate to dinner in Aso Villa, Abuja.\nThe scheduled meeting between President Buhari and members of the upper chamber was conveyed in a letter received from the State House and read by Ahmad Lawan, the President of the Senate, during plenary.\nThe Senate had in April reached a resolution for the leadership of the upper chamber to schedule a meeting with Buhari to enable all 109 Senators to meet with him to discuss the issue of insecurity in Nigeria.\nThe invitation letter reads, “I write to inform the Distinguished President of the Senate, that President Muhammadu Buhari will host a dinner of Senators of the Federal Republic of Nigeria on Tuesday, 13th July, 2021, at 8pm 20:00 hrs.\n“The venue is at the State House Banquet Hall, Presidential Villa, Abuja.”"
  },
  {
    "headline": "BREAKING: Hundreds stranded as FERMA commences construction on Abuja-Keffi Road unannounced",
    "summarized_story": "Business and commercial activities have grounded to a halt on the Abuja-Keffi boundary between Abuja, the Federal Capital Territory (FCT), and Nasarawa State due to a heavy gridlock.\nAs a result of the gridlock occasioned by road repair works being undertaken by the Federal Road Maintenance Agency (FERMA), hundreds of thousands of private and public workers have been stranded.\nDAILY POST investigation showed the lane from Keffi leading to Abuja has been cut off by the FERMA without prior notice to road users.\nAngry commercial and private vehicle owners trapped in the gridlock were seen abandoning their vehicles due to the state of hopelessness.\nHowever, capitalizing on the gridlock, commercial motorcycle riders, commonly called Okada, have been making brisk business from those desperate to go to Abuja for work."
  },
  {
    "headline": "Press must be free, open",
    "summarized_story": "Bayelsa State Governor, Senator Douye Diri, has stressed the need for press freedom in Nigeria, noting that absolute freedom does not exist anywhere.\nHe however emphasised that the press must be free and open.\nSpeaking to journalists in Abuja on Monday during the House of Representatives Press Corps’ Annual Dinner and Award ceremonies, Governor Diri said the importance of a free press in a democracy cannot be overemphasized as it plays a key role in the development process.\nHe thanked the House of Reps Press Corps for his ‘Pride of The House of Representatives Award’, saying it would spur him to do more.\n“I was actually shocked when I saw the level of what we have done recorded by the House of Representatives Press Corps."
  },
  {
    "headline": "Alleged support for Fulani herdsmen: Benue youths give Akume 48 hours to apologise",
    "summarized_story": "Benue youths under the umbrella of Benue Youth Forum, BYF, have issued a 48-hour ultimatum to the Minister of Special Duties and Inter-governmental Affairs, Senator George Akume, for allegedly speaking in favour of Fulani herdsmen who wreak havoc in the state.\nIn a statement on Tuesday by the group’s president, Terrence Kuanum , the former governor of the state was accused of mocking the state government for enacting the Open Grazing Prohibition and Ranches Establishment Law.\nThe group vowed that there would be a heavy sanction by the state council of chiefs against Senator Akume if he fails to apologize within the stipulated time.\n“Just like his principal President Buhari who could only see the 1968 gazetted grazing routes as the solution to Fulani attacks in Nigeria, Minister Akume is sadly hell bent on handing over our lands to the violent nomads.\n“We demand an unreserved apology from the Hon Minister to the people of Benue State within 48hrs, failure of which should attract a heavy sanction by the state council of chiefs."
  },
  {
    "headline": "ATALA [OML 46], DEBUNKING THE LIES AND FALSEHOOD",
    "summarized_story": "The Atala Marginal Field [OML 46] was awarded to BOCL on the 25th February, 2003.\nThis gracious extension of the Atala Marginal license expired on the 15th of March, 2015.\nThis approval lapsed on the 1st of December, 2017 and from an official standpoint the Atala Field license awarded to BOCL had expired.\nSo the Federal Government gave BOCL ample time even after the Atala License had officially expired in 2017, to develop the field.\nThank you Mr. President once again for revoking the Atala Field and giving it to a company that is ready to finally produce the field in a businesslike fashion."
  },
  {
    "headline": "Basketmouth, wife expect third child after three miscarriages",
    "summarized_story": "By Gbenga BadaComedian and actor, Bright ‘Basketmouth’ Okpocha is expecting his third child with his wife, Elsie Okpocha after three miscarriages.\nThe couple announced they would be having another child in separate Instagram posts on Tuesday, July 13.\nBasketmouth’s wife said she had prayed endlessly and craved desperately for another child despite having two kids.\nADVERTISEMENTResponding to his wife, Basketmouth appreciated his wife for updating his fatherhood licence with the pregnancy.\n“Thanks for updating my fatherhood licence a month ago, I am now upgraded to version 4."
  },
  {
    "headline": "1xBet’s Prize Hunt Promotion Final Draw Prizes Awarded – a Samsung TV, two smartphones, and tons of bonus points",
    "summarized_story": "The Prize Hunt promotion started on 1xBet in March and had its second and final draw on the 13th of June.\nThat was the case for three lucky Nigerian 1xBet customers that won in the final Prize Hunt draw.\nOne player walked away with a brand-new Samsung TV, while two other participants won a Samsung A71 smartphone each.\nOkoye Anthony from Aba Abia state is the winner of the second Samsung A71 in the Prize Hunt promotion.\nThe list of winners also included six 1xBet customers that received bonus points for their participation in the Prize Hunt promotion."
  },
  {
    "headline": "Kalu refutes report of visit to British envoy to discuss IPOB matters",
    "summarized_story": "Agency ReporterSen. Orji Kalu, has refuted social media reports of him paying a private visit to the British High Commissioner to Nigeria, Mrs Catriona Laing to discuss issues relating to IPOB.\nHe explained that contrary to rumours, it was the British High Commissioner that visited him, at his Abuja residence on May 13.\nADVERTISEMENTHe said that he was accompanied by Political Counsellor, British High Commission, Mr Jonathan Bacon and Mr Stuart Gardner, the First Secretary on Political.\nHe said Ngige was not even aware that the British envoy was paying him a visit on that same day.\nKalu stressed that ” Putting the records straight, I neither visited nor discussed IPOB with British High Commissioner as reported.”(NAN)"
  },
  {
    "headline": "Soldiers foil terrorists’ attempt to abduct commuters in Borno, rescue 17 civilians",
    "summarized_story": "From Molly Kilete, AbujaThe Army headquarters in Abuja, said soldiers fighting the counter-terrorism war in the North East have foiled terrorists attempt to abduct some commuters and rescued 17 of them.\n‘Further exploitation conducted by troops of 7 Division Garrison and 212 battalions, immediately after quelling the infiltration attempt by the terrorists, resulted in the successful rescue of the commuting civilians, who were abducted during the attack at Kontori along Maiduguri – Damaturu road.\n‘The rescued civilians have been adequately documented and handed over to officials of Rapid Response Squad for further action.\n‘Recall that It was during the said attack that own troops were involved in a road traffic accident, while responding to a distress call from the area.\n‘The Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya, has commended the troops’ commitment and decisive operations against the terrorists."
  },
  {
    "headline": "Nigeria democracy better off with free press –Fayemi",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiChairman, Nigeria Governors’ Forum (NGF) and Ekiti Governor, Dr. Kayode Fayemi, yesterday said the nation’s democracy would be better off if the media is allowed to operate freely.\nFayemi stated this when he hosted a delegation of The Sun Publishing Limited management led by its Managing Director/Editor-in-Chief, Mr Onuoha Ukeh.\nThe governor said Nigeria, like other democracies, need a strong and free press to monitor governance and socio-economic activities.\nHe said though there were some journalists and media platforms acting irresponsibly, the place of free speech and free media in deepening democracy cannot be vitiated.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "High court recognises Ozigbo as PDP candidate",
    "summarized_story": "From Obinna Odogwu, Awka, Aloysius Attah, Onitsha and Mokwugwo Solomon, NnewiAnambra State High Court sitting in Awka, yesterday, declined to renew an order it granted Senator Ugochukwu Uba, on July 5, seeking the non-recognition of Valentine Ozigbo as the authentic candidate of the Peoples Democratic Party (PDP) in Anambra State.\nDaily Sun recalls that on June 26, 2021, Valentine Ozigbo emerged the flag-bearer of the PDP in a keenly contested primary election conduced by the National Working Committee of the party.\nThe primary, which was also monitored by INEC, was adjudged the freest, fairest and most credible in the history of the party.\nMeanwhile, PDP stalwarts across the country had continued to congratulate Mr Ozigbo over the latest victory.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "2023: Northern leaders drum support for S’East, N’East, N’Central",
    "summarized_story": "From Fred Itua, AbujaNorthern leaders under the aegis of North Central People’s Forum (NCPF) have called for power shift to the South East, North East or North Central in 2023 to correct injustices the three regions have suffered since 1999.\nOn the marginalisation of the North Central, Bolaji said Bauchi State in North East has more heads of federal parastatals than the entire North Central states, including the Federal Capital Territory (FCT) .\n“We are out to make sure that the North Central is not shortchanged in the Nigerian project.\nWe hold this country; without the North Central there’s no Nigeria.\nEven within the geographical North, the North Central is being shortchanged."
  },
  {
    "headline": "Nnamdi Kanu’s trial: FG hails Ohanaeze monitoring group",
    "summarized_story": "From Godwin Tsa, AbujaThe Federal Government said Attorney General of the Federation and Minister of Justice, Abubakar Malami has welcomed the formation of legal team by the apex-Igbo body, Ohanaeze Ndigbo, to monitor proceedings at the trial of leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nKanu, who was standing trial before the Abuja division of the Federal High Court on terrorism related offences had jumped bail but was re-arrested by the Federal Government and brought to court for the continuation of his trial.\nFollowing the incident, the Ohanaeze Ndigbo said it had constituted a legal team to monitor proceedings at the trial which resumes on July 26.\nThe team would be led by the National Legal Adviser of Ohanaeze Ndigbo, Joseph Obinamma Ojobu.\nSpeaking on the matter, Malami said inherent in the position of the Ohanaeze Ndigbo was the demonstration of their recognition of belonging to Nigeria and succumbing to the rule of law while maintaining their stance that they were not averse to trial of Nnamdi Kanu."
  },
  {
    "headline": "Breaking: Senate Bows to Pressure, Rejects Onochie as INEC Commissioner",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate on Tuesday bowed to public pressure and rejected the nomination of Presidential aide, Lauretta Onochie, as Independent National Electoral Commission (INEC) National Commissioner.\nThe upper chamber at plenary described Onochie as ineligible for the position of National Commissioner of the Independent National Electoral Commission based on the report of its committee on INEC.\nPresenting the report, Chairman of the Senate Committee on INEC, Senator Kabiru Gaya, said Onochie’s nomination contravenes the principle of Federal Character Commission as enshrined in the 1999 Constitution.l (As Amended).\nGaya recalled that Delta state which Onochie was supposed to represent had been adequately represented by May Agbamuche-Mbu, INEC’s current National Commissioner, who incidentally is from Delta state as Onochie.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Insecurity: Buhari to Meet Senators Tuesday Night",
    "summarized_story": "By Deji Elumoye and Juliet AkojePresident Muhammadu Buhari will on Tuesday (today) at 8pm meet with all the 109 Senators of the National Assembly to discuss the security challenges facing the nation.\nThe scheduled meeting between members of the upper legislative chamber and President Buhari was conveyed in a letter received from the State House and read at Tuesday’s plenary by President of the Senate, Ahmad Lawan.\nThe invitation letter for the scheduled meeting between the President and members of the upper chamber reads, “I write to inform the Distinguished President of the Senate, that President Muhammadu Buhari will host a dinner of Senators of the Federal Republic of Nigeria on Tuesday, 13th July, 2021, at 8pm 20:00 hrs.\n“The venue is at the State House Banquet Hall, Presidential Villa, Abuja.”The Senate had on April 27, resolved to mandate the leadership of the upper chamber to schedule a meeting with the President to enable all the 109 Senators meet with him to discuss the issue of insecurity in the country.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "FG Reaffirms Commitment to OPEC’s 1.554m bpd Oil Quota",
    "summarized_story": "He stated that it is the way things work in OPEC wherein every member has to agree on every issue before it can be resolved.\nHe said: “Our OPEC quota is around 1.554 million bpd for crude oil, excluding condensates.\n“It’s the right thing to do and whenever OPEC gives us our quota, we do everything to achieve it.\nHe said both OPEC and Nigeria had repeatedly demonstrated their commitment to the universal values of international cooperation, dialogue, sustainable development and working towards the common good.\nBarkindo added that Nigeria has consistently regarded as one of the most admired and respected members of the OPEC, particularly in consensus-building."
  },
  {
    "headline": "Battle to Remove Matawalle Begins, Court Fixes July for Suit",
    "summarized_story": "Bello Matawalle, for defecting to the All Progressives Congress (APC).\nThe suit, filed in the names of two PDP members from Zamfara State, Sani Ahmed and Abubakar Muhammed, is seeking to oust the governor for dumping the PDP.\nThe governor, two weeks ago, had defected from the PDP, which brought him to power to the ruling APC, an action which the plaintiffs considered wrong, illegal and unlawful.\nJustice Ekwo thereafter fixed July 16 for the report of court papers on the two defendants.\nFiled on June 17, 2021 before Matawalle eventually defected to the APC, the suit has as defendants: Matawalle, Gusau, APC, and INEC."
  },
  {
    "headline": "Obaseki: Our Actions in Interest of All Edo People",
    "summarized_story": "Adibe EmenyonuEdo State Governor, Mr. Godwin Obaseki, yesterday clarified the position of the state government on the controversy between it and the Oba of Benin, Oba Ewuare II, over the custody of some looted Benin artefacts that Germany is planning to return to Nigeria, saying all actions taken so far were in the interest of all Edo people.\n“The actions of the government thus far on this issue have been driven by selfless, patriotic considerations and in the best interest of Edo State and Edo people,” he said in a statement by the Secretary to the State Government, Mr. Osarodion Ogie, in Benin.\nHe committed his administration to continued engagement with the monarch to ensure that all the looted artefacts from the kingdom are returned.\nThe oba’s demand followed a statement issued by the Edo State Government which said a “transformational” museum would be built in Benin to house the artefacts upon their return.\nHe said the clarification became necessary because the widely publicised media statement issued by the palace had given the impression that the Edo State Government was fighting with the palace."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Senate Rejects Lauretta Onochie As INEC Commissioner",
    "summarized_story": "The Senate, on Tuesday, rejected the confirmation of Lauretta Onochie as a National Commissioner of the Independent National Electoral Commission.\nChairman of the Committee, Kabiru Gaya, in his report, said Onochie did not satisfy the provisions of the Federal Character Principles.\nThe Senate at the committee of the whole subsequently voted against her nomination."
  },
  {
    "headline": "BREAKING: Senate Rejects Lauretta Onochie As INEC Commissioner",
    "summarized_story": "The Senate, on Tuesday, rejected the confirmation of Lauretta Onochie as a National Commissioner of the Independent National Electoral Commission.\nChairman of the Committee, Kabiru Gaya, in his report, said Onochie did not satisfy the provisions of the Federal Character Principles.\nThe Senate at the committee of the whole subsequently voted against her nomination."
  },
  {
    "headline": "BREAKING: Bandits Release Kaduna Emir, Hold On To Daughter, 12 Other Captives",
    "summarized_story": "Alhaji Alhassan Adamu, Emir of Kajuru, has been released from captivity.\nThirteen other persons abducted from the monarch’s private residence including his daughter are still in captivity, Daily Trust reports.\nIbrahim Inuwa Kajuru, a former chairman of the Nigerian Union of Journalists in Kaduna, confirmed the monarch’s release.\nSee Also Insecurity Abductors of Kaduna Emir, 13 Family Members Demand N200million RansomThe journalist, who is also a resident of the town, said the Emir has addressed his subjects at his palace.\nGunmen had on Sunday morning abducted Kajuru and 13 of his family members in his palace."
  },
  {
    "headline": "NBC, NPC bills have been suspended, says lawmaker behind the legislation",
    "summarized_story": "Olusegun Odebunmi, a federal lawmaker from Oyo state, who sponsored the bills for the amendment to the laws establishing the NBC and the NPC, says legislative process on the bills has been suspended.\nBut speaking on Sunrise Daily, a Channels Television programme, on Tuesday, Odebunmi said he initiated the suspension of the bills to allow for consultation with stakeholders in the industry.\nAdvertisement“What I’m saying is that the NUJ cannot gag the activities of the national assembly by saying ‘No you must drop it’, because obviously that is not the way.\n“We have suspended the process for more consultation to happen on it.\nAnd I know the national assembly has the power to look into the existing act,” he said."
  },
  {
    "headline": "NBC, NPC bills have been suspended, says lawmaker behind the legislation",
    "summarized_story": "Olusegun Odebunmi, a federal lawmaker from Oyo state, who sponsored the bills for the amendment to the laws establishing the NBC and the NPC, says legislative process on the bills has been suspended.\nBut speaking on Sunrise Daily, a Channels Television programme, on Tuesday, Odebunmi said he initiated the suspension of the bills to allow for consultation with stakeholders in the industry.\nAdvertisement“What I’m saying is that the NUJ cannot gag the activities of the national assembly by saying ‘No you must drop it’, because obviously that is not the way.\n“We have suspended the process for more consultation to happen on it.\nAnd I know the national assembly has the power to look into the existing act,” he said."
  },
  {
    "headline": "WHO: COVID deaths on the rise -- and Delta variant now in 104 countries",
    "summarized_story": "He said the surge followed the spread of the Delta variant of the virus, which according to him, has now been detected in over 104 countries.\nThe Delta variant is known as B.1.617.2.\nAdvertisementThe Nigeria Centre for Disease Control (NCDC) on Thursday confirmed the index case of the Delta variant of the coronavirus in Nigeria.\n“The Delta variant is ripping around the world at a scorching pace, driving a new spike in cases and deaths.\nHe asked wealthy countries to bridge the COVID-19 vaccine distribution gap, especially in low and middle income countries."
  },
  {
    "headline": "WHO: COVID deaths on the rise -- and Delta variant now in 104 countries",
    "summarized_story": "He said the surge followed the spread of the Delta variant of the virus, which according to him, has now been detected in over 104 countries.\nThe Delta variant is known as B.1.617.2.\nAdvertisementThe Nigeria Centre for Disease Control (NCDC) on Thursday confirmed the index case of the Delta variant of the coronavirus in Nigeria.\n“The Delta variant is ripping around the world at a scorching pace, driving a new spike in cases and deaths.\nHe asked wealthy countries to bridge the COVID-19 vaccine distribution gap, especially in low and middle income countries."
  },
  {
    "headline": "Buhari to flag off Kaduna-Kano rail project Thursday",
    "summarized_story": "President Muhammadu Buhari will perform the groundbreaking ceremony for the Kaduna-Kano standard gauge rail line on Thursday.\nThe statement said the new rail project will further boost the president‘s programme of linking the country through rail in order to enhance the economic growth of the nation.\nAlso, in February, the president flagged off the Kano-Maradi railway project, following approval by the federal executive council.\nAdvertisementThe 248km railway project will start from Kano, pass through Dambatta, Kazaure, Daura, Mashi, Katsina, Jibia and terminate in Maradi.\nHe added that financial arrangements are being made with other partners on the West-East coastal rail line from Lagos to Calabar and linking Onitsha, Benin, Warri, Yenegao, Port Harcourt, Aba and Uyo."
  },
  {
    "headline": "Mobile money operators can issue cards but not loans or insurance, CBN says",
    "summarized_story": "Nigeria’s apex bank has moved to improve the public’s access to mobile money services in Nigeria.\nIn Ghana, mobile money services are widely used because they provide unconventional services, such as inter-bank transfers to their customers.\nCBN seems to be prioritizing a significant reduction of this number by providing simplified access to mobile money services.\nThe framework regulates the activities of everyone involved in the mobile money ecosystem, from the mobile money operators to banks, telecommunications companies, agents, and consumers.\nIt also lists permissible and non-permissible activities under its business rules, allowing mobile money operators to create wallets and even issue cards while prohibiting them from issuing insurance or accepting foreign deposits."
  },
  {
    "headline": "How Charlotte Bwana leads partnerships at Audiomack",
    "summarized_story": "At Audiomack Africa, Charlotte leads business development and media partnerships and is responsible for connecting creators, listeners, and brands to each other.\n“Business development is not sales.”In your own words, what exactly is business development?\nIn my role, business development means identifying and developing growth opportunities that will benefit Audiomack internally and forge mutually beneficial partnerships with external parties.\nAudiomack is in the media industry, but we are also in the entertainment industry.\nThis means we deal with three groups of people: creators (music artists), listeners (fans), and partners (brands)."
  },
  {
    "headline": "Telecom operators are trapped in Africa’s internet shutdowns: Can they fight back?",
    "summarized_story": "The internet ban came as the small southern African kingdom grappled with violent protests demanding the abolishment of a monarchy that has lasted more than three decades.\nNetwork operators in Africa have been severally called on to challenge internet restriction orders instead of simply implementing government directives as they come.\n“So challenging internet ban directives would be a waste of time and political suicide for telecoms businesses.\nIt’s not a sound business decision.”If telecom companies can’t challenge governments, who can?\n“So they don’t actually have a business argument or concern and it is clear that the internet ban doesn’t necessarily pose a notable threat to revenues."
  },
  {
    "headline": "Paxful Celebrates 6th Anniversary: Convenes weeklong global virtual conference",
    "summarized_story": "Lagos, 12th July 2021: Paxful, the leading global peer-to-peer fintech in celebration of its sixth-year anniversary will be hosting a weeklong virtual event around the globe.\nPaxful’s Built with Bitcoin Foundation Director; Yusuf Nessary will give a presentation on Bitcoin for Social Good.\nA panelist discussion on How crypto empowers the unbanked will be led by Ray Youssef, Co-Founder & CEO, Paxful and Victor Asemota, Growth Partner, AnD Ventures.\nSpeaking on its Sixth anniversary; Ray Youssef; Founder & CEO, Paxful said “We are elated to be celebrating six years of continuous growth as a business.\nThe Built with Bitcoin Foundation is funded by Paxful and in part by donations from Paxful users."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "M-KOPA’s new management, YouTube Shorts in Nigeria, CribMD’s latest acquisition",
    "summarized_story": "Good day,Today, I’m discussing:M-KOPA’s new managementYouTube Shorts in NigeriaCrib-MD’s latest acquisitionKenya-based M-KOPA appoints new general managerSource: TechCrunchIn light of M-KOPA’s expansion plans into Nigeria, the company has appointed Babajide Duroshola as its new General Manager.\nIn his time at the helm of affairs of Safeboda’s Nigeria branch, he and his team launched a finance offering.\nAmong other things, it enabled drivers to access credit and loan facilities via an asset financing model very similar to M-KOPA’s.\nNigerians can now access YouTube Shorts creative toolsGoogle-owned video-sharing platform, YouTube is launching its Shorts feature in Nigeria.\nTheir expansion to Nigeria is in line with a current move into the countries — over 100 — where YouTube is available."
  },
  {
    "headline": "5 ways to attract the right customers for your online business",
    "summarized_story": "Whatever your preferred social media platform, the five steps below provide strategies to attract the right customers to your business.\nIdentify the people who need youNow that you’ve identified the value you’re offering, the next thing to do is find your people, the ones who will be willing to pay for the value you’re offering.\nThat’s why you shouldn’t miss the upcoming SME Clinic 2021, where you’d get first hand proven strategies from seasoned experts to grow your business online.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business online.\nLearn how to launch, market and grow your business online."
  },
  {
    "headline": "Nigeria’s CribMD acquires Charisland Pharmaceuticals to facilitate quick drug deliveries to patients",
    "summarized_story": "Nigerian healthtech startup, CribMD has announced its acquisition of Charisland Pharmaceuticals Group to ensure fast and efficient one-hour drug deliveries to its patients across Nigeria.\nCharisland Pharmaceuticals Group was founded nine years ago and has a presence in major Nigerian cities.\nAs part of the sale, the startup would be assimilating Charisland Pharmaceuticals Group’s staff and hiring more to build out its operations.\nBefore the acquisition, CribMD dispensed drugs from pharmacies that they own.\nSpeaking on the choice of Charisland Pharmaceuticals Group, Ossai reveals that the group’s commitment to excellence was a decisive factor."
  },
  {
    "headline": "Nigeria’s abduction epidemic in 5 charts",
    "summarized_story": "The Kidnap-for-ransom business is fuelling an abduction epidemic in Nigeria with many persons killed and kidnapped in the first half of 2021.\nAccording to data from Nigeria Security Tracker (NST), there have been 2,943 abduction cases and 5800 death cases due to insecurity between January and June 2021.\nThis means about 16 persons were abducted…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Pension contributors to get more in Reform Bill amendment",
    "summarized_story": "As poverty in Nigeria bites harder, making it almost impossible for the naira to buy basic necessities, pension industry stakeholders are considering an upwards review of retirement lump-sum to meet contributors’ expectations.\nThis, expected to come in the next pension law amendment, will help contributors and retirees meet their immediate and medium-term needs after leaving paid employment, and also reduce agitation pressures on the industry.\nRead Also: Pension contributors navigate maze of PFAs for better returnsSection 7 (1) (a) of the Pension Reform Act (PRA) 2014 allows for 25 percent lump sum to be paid to a retiree provided that the amount left after the lump sum withdrawal will be sufficient to fund a programmed withdrawal or annuity over the expected lifespan.\nIt also acknowledged the role the National Assembly, Labour Unions and Pension Fund Operators have played in the survival of the Contributory Pension Scheme through supportive legislations, buy-in and adherence to best practices, respectively.\nThe meeting resolved that the National Assembly should set up a task force to engage state governments and come up with innovative ways to help drive compliance by state governments."
  },
  {
    "headline": "Tough business realities dim companies’ appetite for fresh graduates",
    "summarized_story": "The current harsh economic condition in Nigeria may be forcing companies to prioritise the recruitment of experienced talents rather than fresh graduates to save on training cost.\nAnalysis shows that companies employ more people between the ages of 35 and 44 at a higher rate than unemployed people around 25-34 age-range, who are usually fresh…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt pledges support for Olympics-bound Edo sprinter, Enoch Adegoke – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has pledged to give all necessary support to the state’s Ambassador to the Tokyo 2020 Olympic Games, Enoch Olaoluwa Adegoke, reassuring the provision of both moral and financial support needed to succeed in the Games.\nAdegoke, who won the 100m gold medal for Edo State at the 2020 National Sports Festival, is the 12th Nigerian athlete to qualify for the Olympics in the track and field event.\nEdo State Deputy Governor, Rt.\nPhilip Shaibu, who virtually hosted the Olympic-bound sprinter on Monday, hailed the Edo athlete, reassuring the government’s support to ensure that he succeeds in Tokyo.\nOn his part, the Edo Athlete, Enoch Adegoke thanked the government for their support so far, and promised to do his best in representing the state and the country."
  },
  {
    "headline": "Federal High Court to begin 2021 annual vacation, July 26 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal High Court will begin it’s 2021 annual vacation on July 26.\nA circular from the Chief Judge of the Court, Justice John Tsoho, sighted by the News Agency of Nigeria (NAN) said that the vacation would end on Sept. 17.\n“Pursuant to the provisions of Order 46, Rule 4 (d) of the Federal High Court (Civil Procedure) Rules 2019, the Federal High Court will proceed on its annual vacation for the year 2021 from July 26 to Sept. 17.”The chief judge said that the court would resume sitting on Sept. 17.\nJustice Tsoho said that the vacation was to enable judges the opportunity to rest and to prepare for the challenges of the new legal year.\n“Port Harcourt: Justice S.D Pam and Justice A.T Mohammed.”Justice Tsoho wished all the judges a happy vacation."
  },
  {
    "headline": "Obaseki pledges protection of women’s rights, improved reproductive health services – Nigerian Observer",
    "summarized_story": "Obaseki noted that his administration will continue to prioritize policies that eliminate inequality, engender inclusive growth and ensure the sustenance of the reproductive health and rights and women and girls in the state.\nAccording to the UN Secretary-General, António Guterres, “Our latest estimates indicate that COVID-19 will push 47 million women and girls into extreme poverty.\n“In every corner of the world, we are seeing a reversal of hard-won gains and an erosion of women’s reproductive rights and choices, among other things.\nWith the onset of the pandemic, resources for sexual and reproductive health services were diverted.\n“These gaps in access to health rights are unacceptable."
  },
  {
    "headline": "Benin artefacts: Obaseki will continue to engage His Royal Majesty to secure final return – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said Governor Godwin Obaseki will continue to engage with His Royal Majesty, Omo N’Oba N’Edo Uku Akpolokpolo, Oba of Benin, Oba Ewuare II, to secure the final return of Benin artefacts to the state.\nIn a statement, the Secretary to the Edo State Government, Osarodion Ogie Esq., said the actions of the government thus far on the issue have been driven by selfless, patriotic considerations and in the best interest of Edo State and Edo people.\nThe statement reads: “The attention of the Edo State Government (EDSG) has been drawn to the widely publicized media statement issued by the Palace of His Royal Majesty, Omo N’Oba N’Edo Uku Akpolokpolo, Oba of Benin, Oba Ewuare II.\n“It is concerning that, the statement appears to have created the impression that there is a major conflict between the interests of the EDSG and His Royal Majesty with regards to the laudable national milestone of having our highly valued artefacts returned home to Nigeria.\n“The Governor has consequently ordered that on no account should anyone, whether in government or acting independently, engage in disrespectful exchanges and/or altercation with our revered Royal Majesty and the Benin Royal Palace,” he added."
  },
  {
    "headline": "Senate exposes Buhari’s blunder, rejects Lauretta Onochie as INEC commissioner",
    "summarized_story": "The letter specifically listed the nominees as “Muhammad Kallah (National Electoral Commissioner), Katsina; Lauretta Onochie (National Electoral Commissioner), Delta; Kunle Cornelius Ajayi (National Electoral Commissioner), Ekiti; and Saidu Babura Ahmad (Resident Electoral Commissioner), Jigawa.\nMr Buhari’s decision to appoint Ms Onochie is curious especially because Ms Agbamuche-Mbu still has over five months to serve in the Commission.\nThere is also nowhere in Mr Buhari’s letter where he indicated to the Senate that Ms Onochie will replace Ms Agbamuche-Mbu now or later.\nMs Onochie was also one of the Nigerian politicians identified in a PREMIUM TIMES analysis who deployed fake news as campaign strategies online.\nThe senators have now given Ms Onochie the same treatment they dished out to Mr Olalekan."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Market set for deficit, volatility as oil demand surges – IEA",
    "summarized_story": "The warning came against the backdrop of oil demand surge recorded last month as rising vaccination rates helped underpin robust economic activities.\nThe IEA expects oil demand to rise by another 3.3 mbd in the three months from July.\nFurthermore, it forecasts the biggest draw upon stocks in at least a decade will happen this quarter as OPEC+ pumps nearly 2 mbd less than market demand.\n“Oil markets are likely to remain volatile until there is clarity on OPEC+ production policy,” the IEA warned.\nWhile the agency, which advises oil-consuming nations, foresees oil demand recovering along with the global economy, it doesn’t discount the pandemic continuing to weigh upon the market."
  },
  {
    "headline": "JUST IN: Senate rejects Lauretta Onochie’s nomination as INEC commissioner",
    "summarized_story": "BY EMEKA EJEREAccording to Channels Television, the Senate has rejected the nomination of Lauretta Onochie as an Independent National Electoral Commission (INEC) National Commissioner.\nPresident Muhammadu Buhari had written to the Senate in October 2020, to confirm the appointment of Onochie who is currently his media aide on Social Media, and three others as Commissioners of INEC.\nIn her introductory remarks during her screening last Thursday, Onochie, however, insisted she is not partisan.\nOnochie, however, insisted that since President Buhari won his second term, she has removed herself from all things political.\nAccording to her, from 2019 till date she has not had anything to do with any political organisation and did not partake in APC’s recent validation exercise."
  },
  {
    "headline": "Fidelity Bank plots new path to sustainable growth",
    "summarized_story": "BY EMEKA EJEREThe drive of Fidelity Bank Plc to attain a tier 1 status received a boost at the weekend when the lender unveiled a seven-point agenda to improve operational efficiency and expand its footprints.\nIn May 2021, the management had announced plans to make Fidelity Bank one of the tier-1 banks by 2025 and achieve a 7.5 percent total market share of deposits in the same year.\nShe added that Fidelity Bank would also build brand loyalty through personalised and seamless customer experience delivery, develop an end-to-end digitisation, boost performance discipline, and drive aggressive market penetration and business diversification.\nThere is also brand refresh with the aim to increase top-of-mind awareness of the Fidelity brand by external and internal stakeholders.\nOther initiatives geared towards deepening growth include; accelerated play in the SME segment, renewal of institutional banking, and drive for transaction-based propositions in corporate banking, the bank said."
  },
  {
    "headline": "We won’t gag the press, but we will not allow press to run amok – Gbajabiamila",
    "summarized_story": "Femi Gbajabiamila, has argued that while he would not be part of any bill that seeks to gag the press, he noted that the press would be allowed to run amok.\nMany critics of the bill say it is meant to gag the press.\n“I will not be part of any bill that will seek to gag the press.\nNo bill will come to the floor of the House that seeks to gag the press, because the press as it is supposed to be, is supposed to be the voice of the people,” he said.\nThe executive is regulated, the judiciary to a large extent is regulated, the legislature is regulated."
  },
  {
    "headline": "Insecurity: Buhari To Host 109 Senators To Dinner",
    "summarized_story": "President Muhammadu Buhari will this Tuesday night host the 109 Senators of the National Assembly to a dinner at 8pm.\nThe scheduled meeting between members of the upper chamber and President Buhari was conveyed in a letter received from the State House and read during plenary by President of the Senate, Ahmad Lawan, on Tuesday.\nThe Senate on April 27, 2021, reached a resolution for the leadership of the upper chamber to schedule a meeting with the President to enable all 109 Senators meet with him to discuss the issue of insecurity in the country.\nThe invitation letter for the scheduled meeting between the President and members of the upper chamber reads: “I write to inform the Distinguished President of the Senate, that President Muhammadu Buhari will host a dinner of Senators of the Federal Republic of Nigeria on Tuesday, 13th July, 2021, at 8pm 20:00 hrs.\n“The venue is at the State House Banquet Hall, Presidential Villa, Abuja.”"
  },
  {
    "headline": "Insecurity: Buhari To Host 109 Senators To Dinner",
    "summarized_story": "President Muhammadu Buhari will this Tuesday night host the 109 Senators of the National Assembly to a dinner at 8pm.\nThe scheduled meeting between members of the upper chamber and President Buhari was conveyed in a letter received from the State House and read during plenary by President of the Senate, Ahmad Lawan, on Tuesday.\nThe Senate on April 27, 2021, reached a resolution for the leadership of the upper chamber to schedule a meeting with the President to enable all 109 Senators meet with him to discuss the issue of insecurity in the country.\nThe invitation letter for the scheduled meeting between the President and members of the upper chamber reads: “I write to inform the Distinguished President of the Senate, that President Muhammadu Buhari will host a dinner of Senators of the Federal Republic of Nigeria on Tuesday, 13th July, 2021, at 8pm 20:00 hrs.\n“The venue is at the State House Banquet Hall, Presidential Villa, Abuja.”"
  },
  {
    "headline": "BREAKING: Senate Rejects Lauretta Onochie As INEC Commissioner",
    "summarized_story": "The Senate has rejected the nomination of President Muhammadu Buhari’s senior special assistant on New Media, Lauretta Onochie, as a National Commissioner of the Independent National Electoral Commission (INEC).\nAlso, Sani Mohammed Adam’s confirmation as the National Commissioner of INEC representing North-Central was put on hold while the Senate Committee on INEC was mandated to do further legislative action and report back in two weeks.\nDespite several petitions against her nomination, Onochie was rejected on the ground that there is already a National Commissioner of INEC from Delta State, Barr May Agbamuche-Mbu.\n“In 2016, we confirmed a national commissioner from Delta State, Mrs May Mbu and confirming Lauretta from the same Delta State will violate the federal character,” Gaya said.\nADVERTISEMENTOnochie had earlier when she and five other nominees for appointment as National Commissioners for the INEC were screened by the Senate committee on INEC, said she was no longer a member of the All Progressives Congress (APC)."
  },
  {
    "headline": "BREAKING: Senate Rejects Lauretta Onochie As INEC Commissioner",
    "summarized_story": "The Senate has rejected the nomination of President Muhammadu Buhari’s senior special assistant on New Media, Lauretta Onochie, as a National Commissioner of the Independent National Electoral Commission (INEC).\nAlso, Sani Mohammed Adam’s confirmation as the National Commissioner of INEC representing North-Central was put on hold while the Senate Committee on INEC was mandated to do further legislative action and report back in two weeks.\nDespite several petitions against her nomination, Onochie was rejected on the ground that there is already a National Commissioner of INEC from Delta State, Barr May Agbamuche-Mbu.\n“In 2016, we confirmed a national commissioner from Delta State, Mrs May Mbu and confirming Lauretta from the same Delta State will violate the federal character,” Gaya said.\nADVERTISEMENTOnochie had earlier when she and five other nominees for appointment as National Commissioners for the INEC were screened by the Senate committee on INEC, said she was no longer a member of the All Progressives Congress (APC)."
  },
  {
    "headline": "Buhari’s Administration Best Since Amalgamation – Masari",
    "summarized_story": "Katsina State Governor, Aminu Bello Masari, has described the APC administration under President Muhammadu Buhari as the best government Nigeria has ever had since the 1914 amalgamation by the British colonial era.\nHe cited the school feeding project, alongside other government’s social intervention schemes in which billions of naira was expended for the common people in the society.\nHow much is the government paying for only one programme, the school feeding which has also greatly encouraged enrolment in schools.\n“Whether you like Buhari or not, he has redefined governance to a level for the ordinary person who has never known what government is all about.\n“Now we have the mandate to reach an additional five million pupils by 2023 as directed by President Muhammadu Buhari.”"
  },
  {
    "headline": "No way! Senate rejects Onochie as INEC commissioner",
    "summarized_story": "Senate rejects Onochie as INEC commissionerNo way!\nSenate rejects Onochie as INEC commissionerThe Senate on Tuesday, rejected the confirmation of Lauretta Onochie as a National Commissioner of the INEC.\nChairman of the Committee, Kabiru Gaya, in his report said Onochie did not satisfy the provisions of the Federal Character Principles.\nThe Senate at the committee of the whole subsequently voted against her nomination.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "No way! Senate rejects Onochie as INEC commissioner",
    "summarized_story": "Senate rejects Onochie as INEC commissionerNo way!\nSenate rejects Onochie as INEC commissionerThe Senate on Tuesday, rejected the confirmation of Lauretta Onochie as a National Commissioner of the INEC.\nChairman of the Committee, Kabiru Gaya, in his report said Onochie did not satisfy the provisions of the Federal Character Principles.\nThe Senate at the committee of the whole subsequently voted against her nomination.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Election victory: Buhari congratulates Ethiopia’s Prime Minister, Abiy Ahmed",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has congratulated the Prime Minister of Ethiopia Abiy Ahmed over the decisive victory won by his party in the just concluded parliamentary elections, returning him to office for another five years.\nReacting to the outcome of the elections as announced over the weekend, the President told the Ethiopian leader: “On behalf of the Nigerian people I send you and the people of Ethiopia our well wishes for your courage and commitment to the democratic process and urge you to continue with the good policies of your government that endeared you to the people.”President Buhari, who also reflected on the instability rocking Ethiopia appealed to parties and factions in the country to come together to halt their country’s march to civil war to save their people from depravations of conflict.\nHe lamented that instability in one part of Africa is a threat to stability elsewhere: “Instability is a grave threat to African progress.\nAfrican countries cannot attain their development goals if every group resorts to violence and destabilisation instead of seeking peaceful resolution of conflicts through dialogue.”President Buhari assured the Ethiopian leader that Nigeria will continue to support the unity and territorial well-being of his country and of all African States.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Election victory: Buhari congratulates Ethiopia’s Prime Minister, Abiy Ahmed",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has congratulated the Prime Minister of Ethiopia Abiy Ahmed over the decisive victory won by his party in the just concluded parliamentary elections, returning him to office for another five years.\nReacting to the outcome of the elections as announced over the weekend, the President told the Ethiopian leader: “On behalf of the Nigerian people I send you and the people of Ethiopia our well wishes for your courage and commitment to the democratic process and urge you to continue with the good policies of your government that endeared you to the people.”President Buhari, who also reflected on the instability rocking Ethiopia appealed to parties and factions in the country to come together to halt their country’s march to civil war to save their people from depravations of conflict.\nHe lamented that instability in one part of Africa is a threat to stability elsewhere: “Instability is a grave threat to African progress.\nAfrican countries cannot attain their development goals if every group resorts to violence and destabilisation instead of seeking peaceful resolution of conflicts through dialogue.”President Buhari assured the Ethiopian leader that Nigeria will continue to support the unity and territorial well-being of his country and of all African States.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "JUST IN: Buhari to meet 109 Senators tonight",
    "summarized_story": "President Muhammadu Buhari will tonight at 8pm meet with the 109 Senators of the National Assembly.\nThe scheduled meeting between members of the upper chamber and President Buhari was conveyed in a letter received from the State House and read during plenary by President of the Senate, Ahmad Lawan.\nThe Senate on April 27, 2021, reached a resolution for the leadership of the upper chamber to schedule a meeting with the President to enable all 109 Senators meet with him to discuss the issue of insecurity in the country.\nThe invitation letter for the scheduled meeting between the President and members of the upper chamber reads, “I write to inform the Distinguished President of the Senate, that President Muhammadu Buhari will host a dinner of Senators of the Federal Republic of Nigeria on Tuesday, 13th July, 2021, at 8pm 20:00 hrs.\n“The venue is at the State House Banquet Hall, Presidential Villa, Abuja.”"
  },
  {
    "headline": "Back to sender: Senate rejects Lauretta Onochie for INEC",
    "summarized_story": "By AbankulaThe Nigerian Senate on Thursday rejected the nomination of Lauretta Onochie as a National Commissioner of the Independent National Electoral Commission (INEC).\nPresident Buhari had nominated her as a national commissioner last October, triggering a maelstrom of opposition.\nHe said the Committee rejected the nomination of Onochie because there is already a National Commissioner of INEC.\nThe Senate also stepped down the nomination of Professor Sani Mohammad Adam (North Central) to allow for further legislative action.\nPresident Muhammadu Buhari wrote the Senate in October 2020, to confirm her and three others as Commissioners of INEC."
  },
  {
    "headline": "Brenda Ataga wife of Super TV CEO demands N1Billion from blogger",
    "summarized_story": "By AbankulaBrenda Ataga, wife of the slain Super TV CEO has demanded N1 Billion as compensation from a blogger for libellous and malicious report.\nBrenda, also, asked the online platform, Naijaloaded to pull down the report from the website and retract the report.\nNaijaloaded in a report on 26 June accused Brenda of the murder, citing her relationship with the suspect through Brenda’s boyfriend.\nBrenda’s lawyer described the report as callous, malicious and a mindless attack on the personality of their client.\nHe also demanded a total retraction of the offending story, to be carried by the platform and other online news outlets."
  },
  {
    "headline": "Benue Youths Give Akume 48 Hours To Apologise Over Alleged Support For Fulani Herdsmen",
    "summarized_story": "Benue youths, united under the Benue Youth Forum, have given Senator George Akume, Minister of Special Duties and Inter-governmental Affairs, a 48-hour ultimatum for reportedly advocating in favor of Fulani herders wreaking havoc in the state.\nThe group’s president, Terrence Kuanum, issued a statement on Tuesday accusing the former governor of insulting the state government for enacting the Open Grazing Prohibition and Ranches Establishment Law.\nSenator Akume will face a hefty censure from the state council of chiefs if he does not apologize within the time limit, according to the organization.\n“Just like his principal President Buhari who could only see the 1968 gazetted grazing routes as the solution to Fulani attacks in Nigeria, Minister Akume is sadly hell bent on handing over our lands to the violent nomads.\n“We demand an unreserved apology from the Hon Minister to the people of Benue State within 48hrs, failure of which should attract a heavy sanction by the state council of chiefs."
  },
  {
    "headline": "FERMA Begins Construction On Abuja-Keffi Road Unannounced, Leaves Hundreds Stranded",
    "summarized_story": "Hundreds of thousands of private and public personnel have been stranded as a result of the gridlock caused by road repair work being carried out by the Federal Road Maintenance Agency (FERMA).\nAccording to a DAILY POST investigation, the FERMA closed off the lane from Keffi to Abuja without prior notice to road users.\nWhen DAILY POST visited the construction site, highly armed security personnel were observed providing security backup to the workers to prevent furious road users from attacking them.\nDue to the hopelessness of the situation, enraged commercial and private car owners stranded in the bottleneck were observed ditching their vehicles.\nEngineer Tony Emeka, a FERMA employee, told DAILY POST that his organization has a deadline to complete the bridge in order to limit erosion on the highway, hence the urgency before heavy rains arrive."
  },
  {
    "headline": "Lauretta Onochie: Senate Rejects Buhari’s Nominee As INEC Commissioner",
    "summarized_story": "The nomination of Lauretta Onochie, a presidential assistant, as a commissioner of the Independent National Electoral Commission was denied by the Senate (INEC).\nAfter the head of the INEC committee, Kabiru Gaya, submitted a report in plenary, the higher legislative chamber rejected her nomination.\nPresident Muhammadu Buhari nominated Onochie for the position in October 2020.\nConcerns that she is a member of the ruling All Progressives Congress (APC) provoked controversy, but a presidential advisor confirmed she quit her membership in the ruling party in 2019.\nGaya said Onochie was disqualified based on federal character standards when presenting the report on Thursday, adding that there is now a sitting commissioner from Delta state, where Onochie is from."
  },
  {
    "headline": "Police Reacts To Chidinma Ojukwu’s New Claims On Usifo Ataga’s Death",
    "summarized_story": "The latest accusations made by Chidinma Ojukwu, the alleged killer of Super TV’s Chief Executive Officer, Usifo Ataga, have been termed as a “afterthought” by the Lagos State Commissioner of Police, Hakeem Odumosu.\nThe undergraduate denied killing the Super TV CEO in a video that went viral on Monday, contradicting her previous confession.\nAccording to her, the dead had locked the room before she left, so when she returned, she was astonished to find it unlocked.\n“The duvet and the pillows were on the floor, the couch was facing the door with the bed stained with blood already.\nHe also urged the public to disregard the recent interview, adding that Chidinma remained a prime suspect and whatever was said in the video would not change the facts."
  },
  {
    "headline": "Pictures: Another Team Nigeria batch heads to Japan ahead of Tokyo Olympics",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Buhari submits 2022-2024 MTEF/FSP to Senate ahead 2022 budget presentation",
    "summarized_story": "The 2022-2024 Medium Term Expenditure Framework and Fiscal Strategy Paper (MTEF/FSP) has just been presented to the Senate by President Muhammadu Buhari for consideration and approval.\nPresident of the Senate Ahmad Lawan disclosed this while reading a letter to that effect on the floor of the upper chamber on Tuesday.\nAccording to the letter read by the Senate, President Buhari’s move was to ensure early passage of 2022 budget estimates by December 2021.\nDetails loading…"
  },
  {
    "headline": "Breaking: Senate bows to pressure, rejects Lauretta Onochie’s nomination as INEC National Commissioner",
    "summarized_story": "The Senate has finally refused to confirm Special Assistant to President Muhammadu Buhari on Social media Lauretta Onochie as National Commissioner for Independent National Electoral Commission (INEC).\nThe Senate on INEC had screened her last week despite public uproar when she was nominated by the President.\nDuring the screening, Onochie said she wasn’t a member of the All Progressives Congress (APC), a claim many Nigerians faulted.\nDetails loading…"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "BREAKING: Senate Rejects Onochie As INEC Commissioner",
    "summarized_story": "The Senate has rejected the nomination of Lauretta Onochie as an Independent National Electoral Commission (INEC) National Commissioner.\nPresident Muhammadu Buhari had written to the Senate in October 2020, to confirm the appointment of Onochie who is currently his media aide on Social Media, and three others as Commissioners of INEC.\nRead Also: ‘Avoid Controversy,’ Jega Advises Buhari To Withdraw Onochie’s NominationIn her introductory remarks during her screening last Thursday, Onochie, however, insisted she is not partisan.\nOnochie, however, insisted that since President Buhari won his second term, she has removed herself from all things political.\n—————————[VIDEO] I Am Not A Member Of Any Political Party, Onochie Tells Senate"
  },
  {
    "headline": "‘I’m In Charge Of Borno’, Zulum Dismisses ISWAP Claims",
    "summarized_story": "The Governor of Borno State, Babagana Zulum, has dismissed claims that the Islamic State in West African Province (ISWAP) is now in charge of the state.\nISWAP was alleged to have appointed one Abba Kaka as governor, following a newly-restructured leadership by an interim council.\nBut speaking with state house correspondents after a meeting with President Muhammadu Buhari at the presidential villa, Abuja, on Monday, Zulum dismissed the claim, describing it as unfounded.\n“We are yet to validate the authenticity of this report that ISWAP has appointed a governor in Borno state,” he said.\n“So, as the governor of the state, I think it’s not right for me to speak on something that I don’t have full knowledge of."
  },
  {
    "headline": "Nigeria Records COVID-19 Spike With 161 New Cases",
    "summarized_story": "Nigeria has recorded a fresh spike of COVID-19 cases.\nThe Nigeria Centre for Disease Control (NCDC) in its report on Monday night, disclosed that the country has recorded 161 new cases.\nLagos State, which still remains the epicenter of the virus in Nigeria, recorded 153 new cases, while Gombe recorded two, Oyo and Rivers one each and the FCT four cases respectively.\nThis comes days after the NCDC said it had detected the Delta COVID-19 variant in the country.\n“The Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2,” the health agency said in a statement last Thursday."
  },
  {
    "headline": "Nnamdi Kanu: FG Welcomes Ohanaeze To Monitor Trial Of IPOB’s Leader",
    "summarized_story": "Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami, SAN has welcomed the formation of a legal team by Ohanaeze Ndigbo to monitor the proceedings at the trial of the self-acclaimed IPOB leader, Nnamdi Kanu, a move which is in line with the doctrine of the right of fair hearing rooted in Section 36 of the Constitution of the Federal Republic of Nigeria.\n“Inherent in the position of the Ohanaeze Ndigbo on the matter was the demonstration of their recognition of belonging to Nigeria and succumbing to the rule of law while maintaining their stance that they were not averse to the trial of Nnamdi Kanu,” a communique by the AGF’s spokesman, Dr. Umar Jibrilu Gwandu reads in part.\nAccording to Malami, by urging the youths to be law-abiding and sheath their sword as well as asking them to try to obtain voter’s card to enable them to contribute to national development, the position of Ohanaeze becomes glaringly constitutional and commendable.\n“Let it be made abundantly clear that President Muhammadu Buhari-led Federal Government respects the rule of law and does not advocate for the breach of law.\nHence, with or without the so-called monitoring group, justice will be adequately served to Nnamdi Kanu in compliance with the enshrined provisions of the law,” the minister’s communique further reads."
  },
  {
    "headline": "Sanwo-Olu’s Convoy Nabs Traffic Robbers In Operation",
    "summarized_story": "The convoy of the Lagos State Governor, Mr. Babajide Sanwo-Olu, on Monday arrested a group of suspected robbers, whose stock-in-trade is tormenting motorists and pedestrians.\nThe gang of suspected criminals met their waterloo while attempting to engage in a raid around Ojota in-bound Alausa.\nTheir attempt was foiled by the security personnel attached to the Governor who swooped in and arrested three suspected members.\nMr. Akosile reiterated the governor’s stance on safeguarding Lagos State from those who wish to perpetuate nefarious acts.\nPrior to Monday’s raid, a total of 201 motorcycles were impounded."
  },
  {
    "headline": "Covid-19: Dozens of Thai medical workers test positive despite vaccine jabs",
    "summarized_story": "Hundreds of Thai medical workers have tested positive for Covid, despite Sinovac Vaccine Jabs on Sunday.\nAccording to the country’s health ministry, over 600 of the nearly 700,000 medical personnel who have been fully vaccinated with Sinovac became infected between April and July.\nOfficials claim that after receiving two doses of China’s Sinovac vaccine, hundreds of medical personnel in Thailand have been afflicted with COVID-19.\nThailand anticipates receiving 1.5 million Pfizer-BioNTech vaccines from the United States later this month.\nAdvertisementIndonesia, which has likewise relied largely on Sinovac, said on Friday (July 9) that medical staff would be given the Moderna vaccine as boosters."
  },
  {
    "headline": "BREAKING: Senate drops Onochie, okays five others for INEC job",
    "summarized_story": "The Nigerian Senate has declined the nomination of Lauretta Onochie as National commissioner of the Independent National Electoral Commission.\nHer nomination was rejected following the recommendations of the Senate committee on INEC in a report presented by the committee’s Chairman, Senator Kabiru Ibrahim.\nAccording to the report, approving her nomination goes against the country’s Federal Character Principles and as such should be denied.\nRecall that the nomination of Lauretta Onochie has generated controversies with the main opposition party, PDP, calling on the senate not to approve his nomination.\nAdvertisementAlso, Rivers State governor, Nyesom Wike on Monday opposed her nomination and called on the president to withdraw her nomination."
  },
  {
    "headline": "Senate Receives 2022-2024 MTEF/FSP",
    "summarized_story": "The Senate has received the 2022-2024 Medium Term Expenditure Framework and Fiscal Strategy Paper from President Muhammadu Buhari.\nThe document was submitted in a letter addressed to the President of the Senate and read on the floor of the parliament.\nAdopting order 1 of the Senate’s standing rule the bill passed first reading and was immediately referred to the relevant joint committees of the senate.\nThe President of the Senate says the reason for this quick action is to ensure the Senate considers and pass this fiscal document before it proceeds on its annual long recess.\nThe joint committees to continue legislation on this document includes the Senate’s committees on Finance, National planning , Petroleum Upstream & Gas."
  },
  {
    "headline": "Outrage As FG Earmarks N4.8BN To Monitor WhatsApp – Trending With Ojy Okpe – Arise News",
    "summarized_story": "Bandits have released the Emir of Kajuru Alhaji Alhassan Adamu, who on Sunday was kidnapped along with 13 other members of his familyThe federal government has earmarked N4.8 billion Naira for the National Intelligence Agency to monitor WhatsApp, and Thuraya, a satellite telephone.\nChidinma Ojukwu, the 21-year-old student of the University of Lagos, who confessed to Killing a television executive, “Micheal Usifo Ataga” in a new video circulating on social media, denied Killing the television executive.\nA bizzare video, now making the rounds on social media, captured the moment a masquerade was seen dancing inside a catholic church.\nThis video has Provoked a major argument among Nigerians, many of whom are wondering if the church was the right venue for a masquerade to entertain"
  },
  {
    "headline": "Nigeria: Senate Rejects Presidential Aide Lauretta Onochie as INEC Commissioner – Arise News",
    "summarized_story": "The Nigerian Senate has rejected Presidential aide Lauretta Onochie as a national commissioner for the country’s Independent National Electoral Commission (INEC).\nThe rejection of Ms Onochie’s contentious appointment to occupy a sensitive position in the country’s electoral umpire followed the consideration of the report of the Senate Committee on INEC which had the responsibility of screening Ms Onochie and the other nominees.\nThe committee chairman, Kabiru Gaya, who presented the report, recommended that Ms Onochie’s appointment be rejected.\nSenator Gaya said she was disqualified based on federal character principles and added that there is currently a serving commissioner from Delta State, where she hails from.\nMs Onochie is presently the Personal Assistant to President Muhammadu Buhari on New Media."
  },
  {
    "headline": "Ghana’s First Lady Rejects Allowances, Offers to Refund $151,618 Received Since 2017 – Arise News",
    "summarized_story": "Ghana’s first lady Rebecca Akufo-Addo has offered to refund all the allowances she has received since the president assumed office in 2017, following a public outcry over salaries.\nThe first lady in a statement said that she “decided to refund all monies paid to her as allowances” amounting to 899,097.84 Ghanaian cedis some $151,618.\nLast week, Ghanaians expressed outrage at the decision by MPs to approve salaries for the wives of the president and vice-president for the supportive role they play.\nThey were set to receive about $3,500 a month, the same amount as cabinet ministers following a 2019 recommendation by a parliamentary committee.\nThe first lady and second lady have always been given allowances over the years as part of executive privileges."
  },
  {
    "headline": "Death Toll Rises to 32 as pro-Zuma Protests Continue in South Africa – Arise News",
    "summarized_story": "The death toll from the violence and looting being witnessed in South Africa has risen to 32, with the announcement of 22 more deaths on Tuesday morning by the premier of Kwazulu-Natal province (KZN, East).\nThe death toll in the province where the violence began on Friday has risen to 26, Sihle Zikalala told a press conference.\nHe added that six people had died in the Johannesburg metropolitan area, as confirmed by President Cyril Ramaphosa on Monday evening.\nThis is not who we are as South Africans, this is not us.” President Ramaphosa said.\nThe sporadic pro-Zuma protests broke out when he handed himself over last week and have since escalated into looting and arson."
  },
  {
    "headline": "South Africa’s Continued Riots Could Cost Zimbabwe $25 million – Arise News",
    "summarized_story": "Authorities in Zimbabwe say the country’s economy will lose up to $25 million if the ongoing riots in South Africa continue for another week.\nThat’s according to Takunda Mugaga, president of the Zimbabwe National Chamber of Commerce who says disruptions of routes into Zimbabwe have affected the movement of goods between the two countries.\nSpeaking to the SABC in Harare, Mugaga says the sustained riots will also lead to job losses, which will affect immigrant workers from Zimbabwe.\nThere has also been torching of trucks, stoning of cars, and the destruction of other key infrastructure.\nTen people have been confirmed dead following the ongoing riots with extra police officers and the army being deployed to quell the unrest."
  }
]