[
  {
    "headline": "BREAKING: Reps pass electoral bill amidst protest",
    "summarized_story": "The House of Representatives has passed the Electoral Act (Amendment) Bill, maintaining the controversial Clause 52(2) as presented.\nThe clause allows the Independent National Electoral Commission to determine when, where and how voting and transmission of results will be done.\nClause 52(2) reads, “Voting at an election and transmission of result under this bill shall be in accordance with the procedure determined by the commission.”Several efforts to seek amendments to the clause had causes crisis in the House, forcing the lawmakers to spend two days on the exercise."
  },
  {
    "headline": "Russian plane with up to 17 passengers goes missing in Siberia",
    "summarized_story": "A Russian An-28 passenger plane with 17 people on board went missing Friday on a flight in the Siberian region of Tomsk, local news agencies reported citing aviation sources.\nThe RIA Novosti, TASS and Interfax news agencies said the plane had disappeared from radars with 17 people on board.\nInterfax and TASS had earlier said there were 13 people on board.\nInterfax said the plane had been carrying out a flight for regional airline Siberian Light Aviation and was due to land in the regional capital Tomsk.\nThe incident comes after an An-26 plane crashed earlier this month in Russia’s far eastern Kamchatka peninsula, killing all 28 people on board."
  },
  {
    "headline": "Ondo bank robbery: NUJ mourns, says killing of popular journalist, Afuye callous",
    "summarized_story": "The leadership of the Nigeria Union of Journalists, NUJ, Ondo State chapter, has described as callous, the killing of a popular journalist in the state, Olubunmi Afuye, popularly known as ‘Bumbam’ by armed robbers.\nOndo bank robbery: Killing of journalist, a dastardly act, big loss – AkeredoluWhile describing the sudden demise of Afuye as ‘Sunset at Noon’ in the state’s journalism fraternity, the NUJ in a statement signed by the chapel’s Chairman, Adetona Aderoboye and Secretary, Leke Adegbite, described the deceased journalist as a bright, cerebral and versatile colleague.\nWhile calling on security operatives to ensure that the perpetrators of the heinous crime were apprehended, the union said Afuye’s huge contributions to the Ondo NUJ and unionism in the state would be greatly missed.\n“We equally condole families and colleagues of the policeman and Motorcyclist killed in the bank robbery.\n“While declaring seven days of mourning in honour of our slain member popularly known as “BUMBAM”, Ondo NUJ demands that security operatives should do everything humanly possible to bring the perpetrators of the heinous act to justice within shortest time.”"
  },
  {
    "headline": "Buhari hails Awolowo over new ECOWAS position",
    "summarized_story": "President Muhammadu Buhari has lauded Executive Director/Chief Executive Officer of Nigeria Export Promotion Council, Mr Olusegun Awolowo, on his election as President of National Trade Promotion Organizations (TPOs) from ECOWAS member states.\nThe President, in a statement signed by Femi Adesina, his media aide, said Awolowo’s unanimous election is testament to the confidence reposed in him, and in Nigeria, by Chief Executive Officers of trade promotion organizations in West Africa, urging him to serve to the best of his ability, and do the country proud.\nBuhari noted that the ECOWAS TPO Network holds great possibilities for Nigeria and the sub-region in the areas of exchange of commercial information and business opportunities, adding that the domiciling of the secretariat in Abuja would open vistas of opportunities for Nigeria.\nHe wished Awolowo well in his new assignment, expressing confidence that Nigeria and ECOWAS would benefit a lot from his expertise in trade promotions."
  },
  {
    "headline": "Nnamdi Kanu: Why Igbo govs, Senators, Reps, traditional rulers will face bitter consequences",
    "summarized_story": "“We therefore task all of them including Governors, National Assembly members, Ministers, Commissioners, State lawmakers, state commissioners, religious leaders, traditional rulers, Local Government Area Chairman, all political appointees both current and former to ensure our leader is freed from detention as soon as possible.\n“They can’t pretend or feign ignorance at this critical moment in our history and struggle for freedom.\nIf they fail to stand with the people, then they should get ready for the wrath of the people.\n“Again, all those behind the abduction and extradition of our Leader should be ready and prepared to face the bitter consequences of their treachery.\nKanu has been in custody of the DSS following his repatriation to Nigeria and ruling by Justice Binta Nyako of an Abuja Federal High Court."
  },
  {
    "headline": "BREAKING: Reps pass conditional electronic transmission of results as PDP members stage walkout",
    "summarized_story": "The House of Representatives has passed a conditional electronic transmission of election results.\nThe House had on Friday been told that about 49% of polling units in Nigeria are without a network by the Nigeria Communication Commission (NCC).\nUbale Maska, the NCC commissioner of technical, said the Commission carried out a survey in 2018 of all the polling units in Nigeria.\nWhen the deputy speaker insisted and ruled Elumelu out of order, the members of the opposition decided to walk out.\nIt would be recalled that the House had passed 5% but the senate passed 3%."
  },
  {
    "headline": "Nnamdi Kanu didn't jump bail in 2017",
    "summarized_story": "The Igbo Lawyers Association (ILA) have insisted that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, is not guilty of jumping bail in 2017.\nThe lawyers also faulted the way and manner the IPOB leader was allegedly abducted in Kenya and bundled to Nigeria.\nChuks Muoma, leader of ILA and a Senior Advocate of Nigeria (SAN), told journalists in Aba, Abia State, that rather than jump bail, Nnamdi Kanu only preserved his life by running away from the police, Department of State Services, DSS, and army operatives who attacked his home in 2017.\n“After he was granted bail, Kanu stayed in his father’s house at Afara-Ukwu, Umuahia, until the invasion of the house by the police, Department of State Services (DSS) and the army.\nIf he was interested in jumping bail, why didn’t he jump bail before that incident?”The senior lawyer urged Nigerians, including agitators to always embrace dialogue, calling on the Buhari administration to embrace dialogue as a permanent solution to issues."
  },
  {
    "headline": "List of gifted, monetary items Obi Cubana got for mother's burial",
    "summarized_story": "Celebrity bar man Obi Cubana who buried his mother recently has recieved numerous gifts from friends and well wishers.\nWe would recall that Obi had gotten over 247 cows as gifts from friends and associates, 46 of which came from the well know cubana chief priest.\nObi Obi ( Ukwuoma kpolu Ozubulu) 5,000,0002.\nObi Obi Adada 1,000,00024.\nUche sparks ifeadigo awo idemili 1,000,000The money gifted in total by the committee of friends & Business Associates Of Obi Cubana amounted to 267, 000,000 (Two hundred and sixty seven million Naira)has Now Raised 267,000.000."
  },
  {
    "headline": "BREAKING: PDP Reps walk out as House passes Electoral Act",
    "summarized_story": "Peoples Democratic Party (PDP) lawmakers in the House of Representatives on Friday walked out during consideration of the Electoral Act amendment bill.\nSpeaker Femi Gbajabiamiala had appealed to members to allow consideration of other sections of the bill while leaving out the contentious section 5.\nHowever after the consideration, Minority Leader Ndidi Elumelu said the House cannot be asked to rescind decision on section since it was not ruled upon.\nHe led PDP members out of the floor of the House in protest.\nBut the House proceeded to pass the Electoral Act leaving the mode of transmission of results to the Independent National Electoral Commission(INEC) to decide."
  },
  {
    "headline": "Ghanian actress Moesha Boduong now born-again, counsels ladies aginst sleeping with men",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "FG appoints Jega, Udoma, others as Governing Council Chairs",
    "summarized_story": "The Federal Government on Thursday appointed a former chairman of the Independent National Electoral Commission (INEC), Prof Attahiru Jega and former Minister of Budget and National Planning, Senator Victor Udo Ndoma-Egba as Chairmen of the Governing Councils of the University of Jos and Bayero University, Kano respectivelyTheir appointments followed the re-constitution of the Governing Councils of 19 Federal universities and four inter-university centres by the Federal Government.\nAlso appointed are: University of Benin (Dr Sonny Kuku Chairman); Ahmadu Bello University, Zaria (Malam Adamu Fika – Chairman); University of Ilorin ( Malam Abidu Yazid – Chairman); Bayero University, Kano (Sen Udoma Udo Udoma – Chairman); University of Abuja (Prof Ahmed Mohammed Modibbo – Chairman); University of Nigeria, Nsukka (Chief Ikechi Emenike – Chairman); University of Maiduguri (Ballama Manu – Chairman); Federal University of Petroleum Resources, Efurun, Delta state (Prof Anthony Gozie Anwuka); University of Jos (Prof Attahiru Jega – Chairman); Federal University of Technology, Owerri (Sen Jack Tilley Gyado – Chairman); University of Uyo (Barr Njideka Bernedette Nwachukwu – Chairman); University of Calabar (Gen Martin Luther Agwai rtd- Chairman) and Modibo Adamawa University (Alhj Bashir Dalhatu – Chairman).\nOthers are: Usmanu Danfodiyo University, Sokoto (Ibrahim Ida – Chairman); National Open University of Nigeria (Peter Okebukola – Chairman); Nnamdi Azikiwe Univeristy, Awka (Prof Sulyman Alege Kuranga – Chairman); Abubakar Tafawa Balewa University, Bauchi (Bukar Goni Aji Chairman); and Federal University of Technology, Akure ( Amb Dr. Godknows Igali – Chairman).\nThe government also presented the new Pro-chancellor and Chairman of Council of the Federal University of Health Sciences, Otukpo, Benue State.\nMinister of Education, Adamu Adamu who performed the inauguration exercise at the National Universities Commission (NUC), accused some Governors of hijacking the process of appointment of Vice-Chancellors for Federal Universities because of his (Adamu’s) lack of interest in the selection processes of new VCs for the institutions."
  },
  {
    "headline": "BREAKING: FG declares Tuesday, Wednesday public holidays",
    "summarized_story": "The Federal Government has declared Tuesday, July 20 and Wednesday July 21, 2021 as public holidays to mark this year’s Eid-el-Kabir celebration.\nThe Minister of Interior, Ogbeni Rauf Aregbesola, made the declaration on behalf of the Federal Government.\nHe congratulated all Muslim faithful and Nigerians at home and in the Diaspora on the celebration.\n“I call on Muslims to continue to imbibe the spirit of love, peace, kindness and sacrifice, as exemplified by the Holy Prophet Muhammad (Peace be upon Him) and to also use the period to pray for peace, unity, prosperity and the stability of the country, considering the challenges of insecurity we face at the moment.\nThese mainly are bandits in the North West and North Central, insurgents in the North East, kidnappers, armed robbers, ethnic agitators and sundry criminals in other parts of the country,” Aregbesola said."
  },
  {
    "headline": "Breaking: Anambra guber: INEC drops Soludo, PDP’s Ozigbo over court order, clears Andy Uba for APC",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today.\nThe electoral commission however, cleared Emmanuel Andy Uba and Johnbosco Okechukwu Anaedobe as the governorship and deputy governorship candidates of the All Progressives Congress (APC) despite the controversy and court order against his emergence from the APC primaries.\n“The Commission also considered and took cognizance of the Judgments/Court Orders served on it in relation to the primaries of the political parties and other processes leading to the election.\n“The Commission will continue to act in consonance with the Constitution and the law and will continue to obey the judgments and orders of courts served on it.\nFestus Okoye Esq.National Commissioner & Chairman Information and Voter Education July 16, 2021,” it noted in the statement."
  },
  {
    "headline": "Tension mounts as Reps resume consideration of Electoral Bill",
    "summarized_story": "From Ndubuisi Orji, AbujaTension is mounting again as the House of Representatives resume consideration of the Electoral Act Amendment Bill.\nThe deputy speaker, Idris Wase, who chairs the Committee of the Whole, at the resumption of consideration of the clause-by-clause of the bill, at about 11.38 had started from clause 54.\nOkechukwu noted that clause 52, which deals with transmission of results, has not been addressed.\nAccording to him, there was a motion on Thursday, calling for a division over the clause 52.\nHowever, Wase retorted “there wasn’t a motion for division."
  },
  {
    "headline": "How gunmen killed former Army Provost Marshal on Abuja/Lokoja road",
    "summarized_story": "Molly Kilete, AbujaThe Nigerian Army has announced the death of its former Provost Marshall Major General Hassan Ahmed.\nAhmed was killed Thursday by gunmen along the Abuja Lokoja road.\n“The sad incident occurred when the senior officer’s vehicle was attacked by gunmen while transiting along Lokoja – Abuja road yesterday 15 July 2021.\nMembers of the Nigerian Army Officers’ Wives Association (NAOWA) led by the Deputy National President, Mrs Stella Omozoje have also visited the family to condole with them.\nThe remains of the deceased senior officer will be accorded a befitting burial at the Lungi Barracks Cemetery on Friday 16 July 2021 by 10."
  },
  {
    "headline": "Kalu’s bill on hunger reduction, others scale first reading",
    "summarized_story": "The bill titled: “National Food Bank of Nigeria (Establishment) Bill 2021 SB(780)” is being sponsored by Abia-North senator and Chief Whip, Orji Uzor Kalu.\nAside attaining food stability, the bill according to its sponsor, also aims to reduce the number of unemployed youths and encourage youth empowerment in the country.\nThe bill was read before members of the Senate on Wednesday by Senate Leader, Yahaya Abdullahi and subsequently referred for second reading.\nThe food bank concept focuses on tackling hunger, reducing food waste and solving the problem of malnutrition through targeted programmes that seek to improve the availability of food to different category of persons.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "COVID-19: 39 UNILAG staff, students infected",
    "summarized_story": "A senior management staff said the initial figure was 15 staff.\nManagement of the school have begun contact tracing of staff and students who came in contact with those infected.\nFrom there the figures rose to more students and staff infected.\nThe new additions join the recently approved Johnson and Johnson COVID-19 vaccine which was okayed earlier this year by the regulatory agency.\n“Most regulatory agencies across the world use the mechanism to expedite their own regulatory approval to import and administer COVID-19 vaccines."
  },
  {
    "headline": "House Passes Electoral Act, as Opposition Lawmakers Stage Walkout over Clause 52",
    "summarized_story": "By Udora OrizuThe House of Representatives Friday passed the Electoral Act Amendment Bill, as the minority caucus staged a walkout, following the refusal by the presiding chairman, Ahmed Idris Wade, to retake the amendment to clause 52 which seeks to allow electronic transmission (e-transmission) of election results.\nThe minority caucus briefing journalists later said they are totally disappointed in the Deputy Speaker, as well as the Nigerian Communications Commission (NCC) team, who they said told blatant lies about not having adequate network coverage to enable electronic transmission of results.\nDetails later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Inflation Drops to 17.75%",
    "summarized_story": "By James EmejoThe Consumer Price Index (CPI) which measures inflation – the rate of change in the increase in prices – dropped to 17.75 per cent (year-on-year) in June compared to17.93 per cent in the preceding month, the National Bureau of Statistics (NBS) stated Friday.\nThe NBS pointed out that the 0.18 per cent difference indicated that prices continued to rise in June but at a slightly slower increase than it did in May.\nIt stated that the moderation in prices were recorded in all the parameters that determine the headline index.\nIt pointed out that the rise in the food index was caused by increases in prices of bread and cereals, potatoes, yam and other tubers, milk, cheese and eggs, fish, soft drinks, vegetables, oils and fats and meat.\nCore inflation, which excludes the prices of volatile agricultural produce also slowed to 13.09 per cent in June, down by 0.06 per cent compared with 13.15 per cent in May."
  },
  {
    "headline": "Electoral Act: Only 50% of Polling Units Covered by 2G/3G Network, Says NCC",
    "summarized_story": "Lawmakers continue with shouting matchBy Adedayo Akinwale and Udora OrizuThe Nigeria Communications Commission (NCC) has disclosed that only 50.3 per cent of the 19,0000 polling units in the country are covered by 2G and 3G network.\nThe Director of Technical Services of the Commission, Obale Maska, made the disclosure during the continuation of the Electoral Act Amendment Bill consideration by the House of Representatives on Friday.\nWhile saying the remaining 49.7 per cent is without network coverage, he added that only 3G network can adequately transmit the results.\nMeanwhile, the lawmakers just like Thursday are currently engaged in another shouting match while the clauses of the Bill are being considered.\nAs at the time of filing this report, all effort by the Deputy Speaker, Hon."
  },
  {
    "headline": "Afraid of Defeat in 2023, APC Senators Weaken e-Transmission of Election Results",
    "summarized_story": "The senators’ tactical rejection of electronic transmission of election results drew flaks yesterday from a Sokoto State Governor, Hon.\nAhmed Wase, was trying to rig the voice votes in favour of opponents of electronic transmission of results.\nSenate Chief Whip, Senator Orji Uzor Kalu (APC, Abia), cautioned Abaribe over demands for electronic transmission of election results.\n“To think it will be fair that there should be no election transmission of election results from polling units is a shame,” he said.\nYawe, in an interview with THISDAY, said: “If the electronic transmission will work throughout Nigeria, fine – that is our preference."
  },
  {
    "headline": "Alakija: My Transition from Fashion to Oil Industry Was God Ordained",
    "summarized_story": "Kingsley Nwezeh in AbujaOil mogul and richest woman in Africa, Mrs. Folorunsho Alakija, yesterday recounted how she transited from being a fashion entrepreneur to an investor in the oil industry, saying her path was designed by God.\nAlakija, who joined the septuagenarian club yesterday, in an interview on ‘The Morning Show,’ a programme on ARISE NEWS Channel, the broadcast arm of THISDAY Newspapers, gave glory to God for her successes in the oil industry, fashion and her humanitarian gestures.\nShe also recalled the difficulties she encountered after she was awarded an offshore oil block, but oil exploration companies declined to partner her company to drill for oil.\n“I transitioned from fashion to oil to the glory of God,moving from fashion to the oil industry.\n“Nobody in the industry wanted it."
  },
  {
    "headline": "SaharaReporters: We Are Hiring Columnists",
    "summarized_story": "Do you have a knack for speaking truth to power with facts and reason?\nHere is an opportunity to join SaharaReporters as a columnist.\nOur ideal candidate is a courageous writer who is angry about the mediocrity and ineptitude in governance and who can stir the fire for repositioning.\nHow to applyPlease send us a cover letter that describes your background, passion, and expertise and why you are the ideal candidate for the position.\nAbout UsSaharaReporters.com is an outstanding, groundbreaking news website that encourages citizen journalists to report ongoing corruption and government malfeasance in Africa."
  },
  {
    "headline": "SaharaReporters: We Are Hiring Columnists",
    "summarized_story": "Do you have a knack for speaking truth to power with facts and reason?\nHere is an opportunity to join SaharaReporters as a columnist.\nOur ideal candidate is a courageous writer who is angry about the mediocrity and ineptitude in governance and who can stir the fire for repositioning.\nHow to applyPlease send us a cover letter that describes your background, passion, and expertise and why you are the ideal candidate for the position.\nAbout UsSaharaReporters.com is an outstanding, groundbreaking news website that encourages citizen journalists to report ongoing corruption and government malfeasance in Africa."
  },
  {
    "headline": "BREAKING: Seven Feared Dead As Soldiers Open Fire On Protesting Staff Of Dangote Sugar Company In Adamawa",
    "summarized_story": "Seven persons have sustained fatal injuries and are feared dead at Dangote Sugar Company, in Gyawana, Adamawa State owned by Africa's richest man, Aliko Dangote.\nReports from the area, which is about 70 kilometers from Yola, the capital of Adamawa State, indicate that the soldiers opened fire on the protesters around 5pm today.\nA resident of Gyawana told SaharaReporters that soldiers, despatched for the illegal operation, were hired by the management of the sugar company to chase the protesters away.\nThe soldiers, who reportedly came to the sugar company in four Toyota Hilux vans, allegedly left their duty post at Numan bridge."
  },
  {
    "headline": "BREAKING: Seven Feared Dead As Soldiers Open Fire On Protesting Staff Of Dangote Sugar Company In Adamawa",
    "summarized_story": "Seven persons have sustained fatal injuries and are feared dead at Dangote Sugar Company, in Gyawana, Adamawa State owned by Africa's richest man, Aliko Dangote.\nReports from the area, which is about 70 kilometers from Yola, the capital of Adamawa State, indicate that the soldiers opened fire on the protesters around 5pm today.\nA resident of Gyawana told SaharaReporters that soldiers, despatched for the illegal operation, were hired by the management of the sugar company to chase the protesters away.\nThe soldiers, who reportedly came to the sugar company in four Toyota Hilux vans, allegedly left their duty post at Numan bridge."
  },
  {
    "headline": "Nigeria Ranks 98 Among 107 Countries On Global Hunger Index",
    "summarized_story": "Nigeria is facing a critical hunger level as it ranks 98 out of 107 countries in the 2020 Global Hunger Index.\nAccording to the Nigerian Bureau of Statistics (NBS) report as published by SBM, food inflation has seen a 48.94% rise (from 15.04% to 22.95%).\nSBM gathered reports from major food markets across the country and noted how people lamented devastating rising prices of food which have altered their normal daily living.\nIn Lagos, a housewife disclosed to SBM that the food allowance her husband provides could no longer sustain the family.\nBeans rose from N1,457 to N2,883 per four-litre paint rubber and garri saw a price rise from N869 to N1,856 per paint rubber."
  },
  {
    "headline": "NCC: Only 50% of polling units in Nigeria have network coverage for e-transmission of results",
    "summarized_story": "The Nigerian Communications Commission (NCC) says only about 50 percent of polling units in the country have 3G network to transmit electoral results electronically.\nAdvertisementUmar Danbatta, executive vice-chairman (EVC) of NCC, disclosed this when he appeared before the house of representatives on Friday.\nThe electoral act amendment bill which is being considered by the lawmakers had ignited uproar at the lower legislative chamber on Thursday.\nAdvertisementSpeaking at the green chambers on Thursday, Danbatta who was represented by Ubale Maska, executive commissioner technical services, said electoral coverage conducted in 2018 by the commission, showed that about 50 percent of the polling units had 3G and 2G network services while 49 percent had 2G network and below.\nHe added that only 3G is needed to transmit result electronically."
  },
  {
    "headline": "NCC: Only 50% of polling units in Nigeria have network coverage for e-transmission of results",
    "summarized_story": "The Nigerian Communications Commission (NCC) says only about 50 percent of polling units in the country have 3G network to transmit electoral results electronically.\nAdvertisementUmar Danbatta, executive vice-chairman (EVC) of NCC, disclosed this when he appeared before the house of representatives on Friday.\nThe electoral act amendment bill which is being considered by the lawmakers had ignited uproar at the lower legislative chamber on Thursday.\nAdvertisementSpeaking at the green chambers on Thursday, Danbatta who was represented by Ubale Maska, executive commissioner technical services, said electoral coverage conducted in 2018 by the commission, showed that about 50 percent of the polling units had 3G and 2G network services while 49 percent had 2G network and below.\nHe added that only 3G is needed to transmit result electronically."
  },
  {
    "headline": "Reps pass electoral bill, adopt e-transmission of results 'where practicable'",
    "summarized_story": "The house of representatives has passed the electoral act amendment bill.\nAdvertisementThe lower legislative chamber passed the bill after the the clause-by-clause consideration of the bill.\nThe contentious issue in the legislation is the transmission of election results electronically.\nHowever, the lower chamber approved that “the Commission may transmit results of election through electronic means where and when practicable”.\nTheCable had reported how chaos erupted at the green chamber during the clause-by-clause consideration of the bill."
  },
  {
    "headline": "Reps pass electoral bill, adopt e-transmission of results 'where practicable'",
    "summarized_story": "The house of representatives has passed the electoral act amendment bill.\nAdvertisementThe lower legislative chamber passed the bill after the the clause-by-clause consideration of the bill.\nThe contentious issue in the legislation is the transmission of election results electronically.\nHowever, the lower chamber approved that “the Commission may transmit results of election through electronic means where and when practicable”.\nTheCable had reported how chaos erupted at the green chamber during the clause-by-clause consideration of the bill."
  },
  {
    "headline": "NBC asks broadcast stations not to report details of insurgent/bandit attacks",
    "summarized_story": "The National Broadcasting Commission (NBC) has asked broadcast stations in Nigeria not to report the details of attacks by bandits and insurgents.\nAdvertisementIn a letter dated July 7 and signed by Francisca Aiyetan, director of broadcast monitoring, the NBC directed radio and television stations not to “glamourise the nefarious activities of insurgents, bandits and kidnappers ” in their reports.\nThe letter was titled ‘Newspaper Reviews And Current Affairs Programmes: A Need For Caution’, and was signed on behalf of Balarabe Ilelah, director-general of NBC.\nThe commission advised broadcasters to apply caution in their reportage as divulging “too many details” may have an adverse effect on the efforts of the Nigerian security agencies.\n“Advising guests and/or analysts on programmes not to polarise the citizenry with divisive rhetoric, in driving home their point."
  },
  {
    "headline": "Apple’s new MagSafe battery pack just made power banks cool again",
    "summarized_story": "Well, I wonder what they’d say when they see Apple’s new MagSafe Battery Pack.\nThe MagSafe Battery pack sports a battery capacity of 1460mAh at 7.62V.\nCompared to other magsafe power banks, like Anker’s PowerCore Magnetic 5K Wireless with its 5000mAh battery, Apple’ new battery pack just doesn’t cut it.\nAccording to Apple Insider, the MagSafe Battery Pack might fully charge an iPhone 12 or iPhone 12 Pro with little issue.\nIf you charge your iPhone and MagSafe Battery Pack at the same time, your iPhone might charge to 80% or higher before your MagSafe Battery Pack begins charging."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "Westa.Solar sets its sights on West Africa after debut in Nigeria",
    "summarized_story": "Westa.Solar was recently launched as a joint venture between Oolu Solar, a solar home systems provider and RP Global, a renewable energy investment company.\nThe new company offers solar systems that range from 50kW to 5MW and has commenced operations in Nigeria.\nThe plant at Petrichor represents a perfect start to life for Westa.Solar, a company that has its sights set on the larger West African market.\n“This is the first of what we hope will be many solar power projects for C&I companies,” Akinboye said.\nOver the next five to ten years, the company aims to become the leading commercial and industrial renewable energy provider in the region."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "Biggest European consumers of Nigeria’s oil quicken electric vehicles adoption",
    "summarized_story": "Some of the biggest consumers of Nigeria’s crude oil such as Spain, Netherlands and France will no longer consider petrol as a priority in the next 14 years, thanks to an ambitious European Union plan to speed up the switch to zero-emission electric vehicles (EVs) as part of a broad package of measures to combat…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "United Capital navigates volatile half-year, pre-tax profit up 65%",
    "summarized_story": "United Capital plc, Nigeria’s leading investment bank and a foremost pan-African financial and investment services group, has announced its unaudited financial statements for the half-year (H1) ended June 30, 2021.\nThe investment bank’s financial statement shows revenue of N6.85 billion as against N4.44 billion in H1’2020, indicating 54.3 percent growth.\nAlso, the group recorded Profit…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Contentious PIB won’t make it to Aso Rock as planned",
    "summarized_story": "The most debatable bill in the history of Nigeria’s oil industry may not get presidential assent as planned, as the House of Representatives has stepped down the report of the Conference Committee of the National Assembly for reasons that may not be unconnected with percentage due to host communities.\nHaving delayed the passing of the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Concerned family say mother and son are missing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestConcerned members of the Igbinovia family in Benin City, Edo State, have raised alarm over the whereabouts, of one Priscilla Otobo Aghoghovia and her son who they say are nowhere to be found.\nThey say that members of the family have not set their eyes on both mother and son either in the family residence or in parts of the City for several months now.\nShe said she did not know whether Priscilla Otobo Aghoghovia was intimidated, harassed and threatened by elders and youths in the community, and even attacked at her residence before the Police came to her rescue.\nMeanwhile, indications are that Priscilla Otobo Aghoghovia who hails from Ughelli, Delta State is the only one of Chief Igbinovia’s many wives who gave birth him a son.\nWhat she did not know was that her son is heir to the Chief priest of Egugu deity."
  },
  {
    "headline": "Obaseki pledges sustained investment in youth devt to drive post-COVID-19 economic recovery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration will continue to prioritise investment in youth development and implement policies that will enable youths in the state acquire new skill-set to enable them contribute in the post-coronavirus (COVID-19) global economic recovery.\nObaseki made the remarks in commemoration of the World Youth Skills Day, marked every July 15 by the United Nations and its sister agencies.\nThe governor said: “As part of our broad strategy for post-COVID-19 economic recovery, we will continue to equip our youths with new skills-set to boost their employability through the state government’s skills development agency, EdoJobs and in line with our vision for Technical and Vocational Education and Training (TVET).”He noted that his administration has intensified training that prepares youth for top-of-the-range Information and Communication Technology (ICT) job as software engineers in the proposed Edo Tech Park, noting, “We are assisting our youth to acquire on-demand skill sets to drive economic growth.”The governor urged for more support from multilateral corporations, stakeholders in the private sectors, all levels of government, and other development partners in assisting the state with the required resources to equip more youth with new skills that will enable them to compete with their peers globally.\nObaseki said in the education sector, “my administration through reforms in TVET is revamping more technical colleges to provide opportunities for students in secondary schools to acquire technical skills.”According to the United Nations, the World Youth Skills Day was designated by the General Assembly in 2014, and provides the opportunity for young people, technical and vocational education and training (TVET) institutions, and public and private sector stakeholders to acknowledge and celebrate the importance of equipping young people with skills for employment, decent work and entrepreneurship."
  },
  {
    "headline": "EDSTMA to enforce color code for taxis in Benin, impound defaulting vehicles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… ‘impounded vehicles to be painted with right color code before release’BENIN CITY – The Edo State Traffic Control and Management Agency (EDSTMA) has concluded plans to ensure strict enforcement of color codes for commercial taxi operators in the state.\nIn a statement, Managing Director, EDSTMA, Dennis Oloriegbe, said the agency is undertaking the exercise in compliance with the law and order guiding the operation of commercial vehicles in the state.\nAccording to him, “EDSTMA hereby reiterates Edo State Government’s existing directives on the use of unauthorized color code of all intra-state commercial vehicles within Benin metropolis except for vehicles painted with authorized color code, ‘Yellow and Red.’“Consequently, any intra-state commercial vehicle found in breach of the above directive (s) will be impounded on sight and enforce painting before release,” he added."
  },
  {
    "headline": "Electoral Act Amendment Bill: Senate Votes Along Party line – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…as APC Senators Rejects Electronics VotingBENIN CITY – The Nigerian Senate on Thursday, voted along party lines on a clause 53 subsection 3 of the Electoral Act Amendments Bill, 2021.\nThe clause which empowers the Nigeria Communication Commission, NCC to approve the electronic transmission of results subject for the approval of National Assembly, before any certified results can be transmitted.\nAhmad Lawan therefore gave approval for the voting, where the lawmakers voted along party lines with the APC senators taking the majority votes.\nOne hundred and Eight Senators voted.\nTwenty-eight gave assent to the electronic transmission while Fifty-two were against it."
  },
  {
    "headline": "Reps pass PIB, adopt 3% for host communities as PDP lawmakers walk out",
    "summarized_story": "ADVERTISEMENTThe House has adopted the report of the conference committee on the Petroleum Industry Bill, which recommended three per cent for the Host Communities Development Fund.\nFollowing the rancour over the Electoral bill, the Peoples Democratic Party (PDP) members had staged a walkout.\nThe conference committee had recommended 3 per cent host communities, which the Senate adopted on Thursday.\nThe Speaker, Femi Gbajabiamila, explained that the House attempted to reach out to the Senate to reconsider the Host Communities component, however, theP Senate had adjourned.\nWhile the passage was ongoing, the PDP lawmakers were briefing journalists at the press centre."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Stanbic IBTC restates commitment to support SMEs in Nigeria",
    "summarized_story": "Adebayo ObajemuStanbic IBTC has reiterated its support for SMEs in Nigeria as part of its drive to align with the sustainable economic growth plan of the government.\nAccording to the Bank there are lots of growth opportunities for SMEs in Nigeria.\nHowever, several challenges hamper these growth prospects.\nObviously the most prominent is the challenge of funding.\nThe Chief Executive, Stanbic IBTC Bank, Wole Adeniyi at a webinar themed ‘Scaling your business in challenging economic times’ advised the government to diversify the economy through policies that would drive growth in various sectors, which will eventually lead to improved standard of living."
  },
  {
    "headline": "How 6 Finalists Will Emerge from FirstBank’s Sponsored The Voice Nigeria Season 3 Second Live Show",
    "summarized_story": "By Israel BolajiSix finalists are expected to emerge through the viewers votes following the second live show of the FirstBank Sponsored The Voice Nigeria Season 3.\nUN1TY Limited and Livespot360, producers of the global talents reality series, explained how to vote on the voice Nigeria season 3, sponsored by FirstBank, Baba Ijebu and Airtel.\nTo know the voting code of your preferred contestant to save, visit the Bank’s official Instagram handle and get voting:The International talents reality series designed to discover and harness music talents in Nigeria is in its third season in Nigeria.\nScores of vocalists have performed on the highly competitive show but dropped out going through the Auditions, Blinds, Knockouts, Battles and Live Shows stages.\nWith an electrifying mix of pulsating musical performances, music training, glamorous fashion and life enriching entertainment, the The Voice Nigeria 3 continues to glitter to the very grand finaleVoting opens on Saturday at 9:00pm and closes at 11:59pm on Thursdays."
  },
  {
    "headline": "Bank of Industry seeks more participation in the capital market",
    "summarized_story": "Adebayo ObajemuManaging Director, Bank of Industry (BOI), Olukayode Pitan was recently awarded with Honourary Fellow of the Chartered Institute of Stockbrokers (CIS).\nHe emerged the third Nigerian to earn the prestigious Honorary Fellowship of the institute.\nThe CIS said the rationale for the conferment of Honourary Fellowship to Pitan was the bank’s pivotal roles in the growth and development of micro, small and medium scale enterprises in Nigeria.\nBesides, the Institute is anticipating listing of some of the companies that have benefited from BOI loans to list on various securities exchanges in Nigeria.\nSuffice to say that BOI also provides a pipeline to the potential listing of these entities on the various securities markets."
  },
  {
    "headline": "Rail Transport patronage declines by 34.40% in Q1 2021- NBS",
    "summarized_story": "Adebayo ObajemuRecent report published the National Bureau of Statistics revealed that the rail transportation data for Q1 2021 reflected that a total of 424,460 passengers travelled via the rail system in Q1 2021 as against 647,055 passenger recorded in Q1 2020 and 134,817 in Q4 2020 representing -34.40% decline year on year and +214.84% growth quarter on quarter respectively.\nAccording to NBS, a total of 10,511 tons of volume of goods/cargo travelled via the rail system in Q1 2021 as against 18,484 recorded in Q1 2020 and 35,736 in Q4 2020 representing -43.13% decline YoY and -70.59% decline QoQ respectively.\nRevenue generated from passengers in Q1 2021 was put at N892,467,526 as against N398,999,290 in Q4 2020.\nSimilarly, revenue generated from goods/cargo in Q1 2021 was put at N26,195,160 as against N82,572,300 in Q4 2020."
  },
  {
    "headline": "APC Suspends 11 Lai Mohammed’s Men Over Kwara Chapter Crisis",
    "summarized_story": "For dragging the party to court, the All Progressives Congress (APC) has approved the suspension of 11 party members loyal to the Minister of Information and Culture Alhaji Lai Mohammed.\nBut that is not their only offence, another reason for their suspension was that they took the Kwara state chairman Hon.\nRecall that the minister and his loyalists are supporters of Bashir Bolarinwa who was removed as the caretaker chairman of the state chapter of the party.\nBut the 11 party men still went ahead to approach the court to demand the removal of the approved State Caretaker Committee Chairman, Abubakar.\nADVERTISEMENT“The Kwara State Caretaker Committee has received and adopted the report of the disciplinary Committee in respect of Joseph Tsado & 10 Ors."
  },
  {
    "headline": "APC Suspends 11 Lai Mohammed’s Men Over Kwara Chapter Crisis",
    "summarized_story": "For dragging the party to court, the All Progressives Congress (APC) has approved the suspension of 11 party members loyal to the Minister of Information and Culture Alhaji Lai Mohammed.\nBut that is not their only offence, another reason for their suspension was that they took the Kwara state chairman Hon.\nRecall that the minister and his loyalists are supporters of Bashir Bolarinwa who was removed as the caretaker chairman of the state chapter of the party.\nBut the 11 party men still went ahead to approach the court to demand the removal of the approved State Caretaker Committee Chairman, Abubakar.\nADVERTISEMENT“The Kwara State Caretaker Committee has received and adopted the report of the disciplinary Committee in respect of Joseph Tsado & 10 Ors."
  },
  {
    "headline": "BREAKING: PDP Caucus Stages Walk Out As Reps Pass Electoral Bill, PIB",
    "summarized_story": "Minority Caucus of the House of Representatives has staged a walkout from the chamber following controversy over the amendment of the Electoral Act, 2010.\nImmediately after the walkout was staged, members of the APC went ahead to pass the Electoral Bill including the controversial clause 52 in the Bill.\nThe House also went ahead to lay the report of the conference committee on the PIB which is about being passed.\nThe PDP lawmakers are currently briefing journalists on their disappointment in the presiding officers of the House,Details Later….\nADVERTISEMENT"
  },
  {
    "headline": "BREAKING: PDP Caucus Stages Walk Out As Reps Pass Electoral Bill, PIB",
    "summarized_story": "Minority Caucus of the House of Representatives has staged a walkout from the chamber following controversy over the amendment of the Electoral Act, 2010.\nImmediately after the walkout was staged, members of the APC went ahead to pass the Electoral Bill including the controversial clause 52 in the Bill.\nThe House also went ahead to lay the report of the conference committee on the PIB which is about being passed.\nThe PDP lawmakers are currently briefing journalists on their disappointment in the presiding officers of the House,Details Later….\nADVERTISEMENT"
  },
  {
    "headline": "Gov Sani-Bello Okays Law To Hang Bandits, Others",
    "summarized_story": "Abubakar Sani-Bello of Niger on Friday signed into law, the death penalty by hanging for cattle rustlers, bandits, kidnappers and informants in the state.\nReports gathered shows that on July 1, the Niger State House of Assembly passed into law a bill prescribing the death penalty for informants, kidnappers, and cattle rustlers in the State.\nBello said the Kidnapping and cattle rustling special provisions law of 2016 was amended to provide for the punishment of informants and all those involved in the aiding and abetting of kidnapping and cattle rustling in the state.\nHe said that informants who aid and abet kidnappers would now have to face death sentence by hanging in public as now enshrined in the state law.\nThe governor expressed hope that the signing of the state assembly Service Commission Law would further enhance the activities of legislators and solidify the already existing synergy between the executive and the legislature."
  },
  {
    "headline": "Woman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 years",
    "summarized_story": "Woman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 yearsWoman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 yearsA Sierra Leonean, Lora Olumide Johnson, has accused Globacom boss, Mike Adenuga, of being behind moves to throw her out of her apartment after 30 years of dating him.\n“Mike Adenuga leave me alone.”However, the move to eject Johnson was said to be purely the execution of a court order by the EFCC.\nJohnson, according to societynow.ng, is facing prosecution for alleged misconducts at her former place of employment, Globacom.\nThe affected persons, including Johnson, however, tried to block the interim forfeiture order with a counter-court case.\nThey reportedly sought an order to discharge the interim forfeiture of assets, an order discharging the final forfeiture order and any other orders as deemed fit by the court societynow.ng gathered."
  },
  {
    "headline": "Woman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 years",
    "summarized_story": "Woman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 yearsWoman accuses Globacom boss, Mike Adenuga of abandonment, harassment after allegedly dating him for 30 yearsA Sierra Leonean, Lora Olumide Johnson, has accused Globacom boss, Mike Adenuga, of being behind moves to throw her out of her apartment after 30 years of dating him.\n“Mike Adenuga leave me alone.”However, the move to eject Johnson was said to be purely the execution of a court order by the EFCC.\nJohnson, according to societynow.ng, is facing prosecution for alleged misconducts at her former place of employment, Globacom.\nThe affected persons, including Johnson, however, tried to block the interim forfeiture order with a counter-court case.\nThey reportedly sought an order to discharge the interim forfeiture of assets, an order discharging the final forfeiture order and any other orders as deemed fit by the court societynow.ng gathered."
  },
  {
    "headline": "Attempted kidnap: Zenith Bank Security Man Arrested In Edo",
    "summarized_story": "The police in Ekpoma, Edo State Police Command have arrested Felix Alika, a security aide at Zenith Bank Ekpoma branch for allegedly conspiring to kidnap his manager, Raphael Ibodeme.\nAlika had been locking horns with his manager over his promotion in the bank and punishment for insubordination.\n“Yes, l can confirm that Mr. Ibodeme, the bank manager and myself have been quarreling for some time now,” he said.\nThe Police Public Relations Officer, SP Kontongs Bello, confirmed the incident, noting that the two suspects would be charged to court for attempted kidnap.\n“The report from the anti-kidnapping squad in our Command said the security guard, Felix Alika, lied against Mr. Raphael Ibodeme.” SaharareportersShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Attempted kidnap: Zenith Bank Security Man Arrested In Edo",
    "summarized_story": "The police in Ekpoma, Edo State Police Command have arrested Felix Alika, a security aide at Zenith Bank Ekpoma branch for allegedly conspiring to kidnap his manager, Raphael Ibodeme.\nAlika had been locking horns with his manager over his promotion in the bank and punishment for insubordination.\n“Yes, l can confirm that Mr. Ibodeme, the bank manager and myself have been quarreling for some time now,” he said.\nThe Police Public Relations Officer, SP Kontongs Bello, confirmed the incident, noting that the two suspects would be charged to court for attempted kidnap.\n“The report from the anti-kidnapping squad in our Command said the security guard, Felix Alika, lied against Mr. Raphael Ibodeme.” SaharareportersShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Soludo, PDP missing as INEC releases list for Anambra governorship poll",
    "summarized_story": "By Kazeem UgbodagaThe name of Prof. Charles Soludo is conspicuously missing as the Independent National Electoral Commission, INEC, released the list of candidate for the November 6 governorship poll in Anambra State.\nRather INEC listed the names of Chukwuma Michael Umeoji as the governorship candidate for the All Progressives Grand Alliance (APGA) while Urogbu Obiageli Lilian was listed as the deputy governor.\nINEC said it listed the name of Umeoji and Urogbu based on court order.\nAlso, the commission did not list the name of any candidate for the Peoples Democratic Party, PDP both for governorship and the deputy governorship based on court order.\nIn all 17 political parties, excluding the PDP, which had no candidate are fielding candidates for the November 6 governorship election in Anambra State."
  },
  {
    "headline": "NBC gags TV, Radio stations on reporting banditry, insurgency",
    "summarized_story": "In a letter of 7 July 2021, issued to television and radio stations, Illela stressed the need for “caution” by broadcasters while reporting banditry and insurgency in the country.\nHe ordered television and radio stations in Nigeria not to divulge “details” of the activities of bandits, terrorists and kidnappers in their reports.\nHe said the NBC will not hesitate to sanction any broadcast station that violates the laid down rules of the Nigeria Broadcasting Code.\nHe urged broadcast stations to use their platforms not as tools to disintegrate the country but rather use them to encourage peace and unity amongst citizens.\nHe, therefore, urged broadcast stations to be professional and operate within the laid down rules of the Nigeria Broadcasting Code."
  },
  {
    "headline": "Arrest of Nnamdi Kanu, our story – Anambra Govt",
    "summarized_story": "By Kazeem UgbodagaThe Anambra State Government on Friday denounced claim that Governor Willie Obiano has a hand in the re-arrest of leader of the Indigenous People of Biabra (IPOB), Nnamdi Kanu.\nWe are also surprised that SaharaReporters could publish such a statement without bothering to hear from the Anambra State government in order to balance its story.\nIt is a trite fact that as a subnational government, the Anambra State administration does not deal with any of these two organizations either directly or indirectly.\nThe question of Anambra State financing their operations makes neither reason nor rhythm,” the statement said.\nThe statement added that Anambra State Government recognised its place in history and that these are turbulent times for everyone, including people from the Igbo-speaking world."
  },
  {
    "headline": "BREAKING: Yoruba Agitators List Five Demands, Set To Protest At British Parliament Over Sunday Igboho",
    "summarized_story": "Igboho, who fled the raid, has now gone underground after being proclaimed sought by the secret police.\nOthers include: a halt to Igboho witch-hunting; and five, requesting that the DSS focus its efforts on locating the bandits terrorizing the South-West region.\nKoiki said, “On the 1st of July was an assassination attempt on the life of Chief Sunday Igboho.\nAlso 12 Yoruba are still kept at the underground cell of the DSS without committing an offence.\n“Next week, join the protest in London, 21st July 2021 in front of the parliament."
  },
  {
    "headline": "BREAKING: Another Fight Breaks Out In House of Reps Over Electoral Bill Report",
    "summarized_story": "Another argument has erupted in the House of Representatives about whether or not members should vote on whether or not election results should be transmitted electronically.\nAt plenary, the House heard presentations and testimonies from a Nigerian Telecommunication Commission (NCC) team, which was led by speaker Femi Gbajabiamila.\nHe then declared that the House will return to the Committee of the Whole to continue debating the electoral bill’s clause-by-clause report from item 1 to item 52.\nBy House rules, the Deputy Speaker, Hon Ahmed Wase, is in control of the session as Chairman.\nWhen Wase took his seat, he sparked a hornet’s nest by stating that the House had previously discussed items 1 to 54."
  },
  {
    "headline": "PDP Withdraws Suit Seeking To Sack Zamfara Deputy Gov, Gusau Over Unlawful Defection",
    "summarized_story": "The Peoples Democratic Party (PDP) on Friday in Abuja withdrew Zamfara Deputy Governor, Alhaji Mahadi Aliyu Gusau, from a petition filed in the Federal High Court seeking to remove him and his principal, Governor Bello Muhammad Matawalle, for alleged unlawful defection.\nOver the same problem, the party had previously recommended Gusau’s removal from office as the state’s deputy governor.\nPDP also formally took over the matter as the first plaintiff in a move to that effect, claiming ownership of the contested mandate.\nMatawalle was represented by a legal luminary, Chief Mike Ozekhome SAN, at the Friday sessions, while the APC was represented by Alhaji Ahmed Raji SAN.\nThe governor had defected from the PDP to the APC two weeks previously, prompting the PDP to take legal action to reclaim its mandates from him."
  },
  {
    "headline": "Bet9ja Refuses To Pay Customer’s N3.350m Winning, Threatens Him With OPC, Police",
    "summarized_story": "Bet9ja is Nigeria’s number one sports betting company, however the company’s integrity is currently in question, and its legitimacy is under examination, as it refuses to pay a customer’s N3.350 million winnings.\nOn Tuesday, July 6, 2021, between 7 and 8 p.m., a government worker (names withheld) played Bet9ja virtual soccer game and won the jackpot of N10.850 million.\nIn the Akute area of Ogun State, he received the game from one of the company’s agents.\nAs soon as the winning number flashed on the bet shop’s screen, yells of delight filled the room as other customers joined in the celebration.\nSo far, several efforts by the civil servant to get the balance of his winning has proved abortive."
  },
  {
    "headline": "Breaking: PDP, Soludo removed as INEC releases list of candidates for Anambra guber poll",
    "summarized_story": "Candidate of Peoples Democratic Party (PDP) has been removed from the list of those cleared by the Independent National Electoral Commission (INEC) for November 6 governorship election in Anambra state.\nIncidentally, the Commission cleared the candidate of other APGA faction Chukwuma Micheal Umeoji for the poll.\nThis was disclosed in a statement on Friday by INEC National Commissioner and Chairman Information and Voter Education Committee, Festus Okoye.\nThe INEC Commissioner cited Court Order as the reason for the exclusion.\nThere have been contentious issues by various factions of PDP in Anambra state before and after their governorship primary."
  },
  {
    "headline": "VIDEO: President Muhammadu Buhari’s family presents gift to son’s fiancé ahead of proposed wedding in Kano",
    "summarized_story": "PreviousFor a second time, Arjen Robben announces retirement from football"
  },
  {
    "headline": "SENATE ON ELECTORAL ACT AMENDMENT: Network coverage to determine e-transmission of results",
    "summarized_story": "Provisions of Clause 52(3) of the Electoral Act (Amendment) Bill 2021 Thursday tore senators apart along party lines during consideration of the entire report containing 154 clauses.\nWhile calling for the amendment through a point of order, Senator Abdullahi added a proviso that such electronic transmission of results by INEC should be subjected to certification of network coverage by the Nigerian Communication Commission (NCC).\nAfter the ruling, the Senate was in stalemate for about 15 minutes, which led to a hurried closed door session.\nOthers are Yahaya Abdullahi (Kebbi North) , Abdullahi Adamu Aliero (Kebbi Central) , Oseni Yakubu (Kogi Central) , Smart Adeyemi (Kogi West ), Isah Jibrin (Kogi East ), Lola Ashiru (Kwara South) , Yahaya Oloriegbe (Kwara Central).\nThe consideration of the Electoral Act amendment report was smoothly progressing until clause 52 was mentioned."
  },
  {
    "headline": "Gunmen murders former Provost Marshal Nigerian Army -NigPilot",
    "summarized_story": "The former Provost Marshal of the Nigerian Army, Major General Hassan Ahmed, has been murdered by unknown gunmen in Abuja.\nIt was gathered that the gunmen opened fire on his vehicle, murdered him, and whisked away from the wife.\nThe statement said: “With a heavy heart, the Chief of Army Staff, Lt Gen Faruk Yahaya, Officers, and Soldiers of the Nigerian Army regret to announce the passing on of Maj Gen Hassan Ahmed, a former Provost Marshall of the Nigerian Army.\n“The sad incident occurred when the senior officer’s vehicle was attacked by gunmen while transiting along Lokoja – Abuja road yesterday 15 July 2021”.\nHe added that Members of the Nigerian Army Officers’ Wives Association (NAOWA) led by the Deputy National President, Mrs. Stella Omozoje have also visited the family to condole with them."
  },
  {
    "headline": "Electronic Transmission: PDP carpets APC Senators -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, on Thursday said the majority of Nigerians are shocked over the decision of the All Progressives Congress , APC-led Senate to undermine our electoral process by refusing to approve the demand by Nigerians across the board for electronic transmission of election results without conditionalities.\nReacting to the decision of the APC-dominated Senate to halt electronic transmission of votes, the PDP said the action of the APC senators is an atrocious assault on the sensibilities of Nigerians, who looked up to the Senate for improvement in our electoral process in a manner that will engender free, fair and credible process.\n“This action of the APC senators is a direct affront, novel in its recklessness and a defilement of the 1999 Constitution (as amended), which clearly conferred operational independence to INEC to conduct elections, free from interferences and regulations from any other agency of government.\n“The decision of the APC Senators, therefore, amounts to a suspension of the 1999 constitution (as amended) which is a recipe for the crisis that could derail our democracy and destabilize our nation.\n“It is, to say the least, a preparation for mass rigging of elections across Nigeria by the APC, which must be firmly resisted."
  },
  {
    "headline": "Electronic Transmission of votes: Senate decision unconstitutional -Tambuwal -NigPilot",
    "summarized_story": "…Lauds RepsFormer Speaker of the House of Representatives, Hon Aminu Tambuwal on Thursday said the decision of the Senate to subject INECs constitutional power to conduct elections t o the Nigerian Communications Commission (NCC), and National Assembly is patently unconstitutional.\nReacting to the decision of the Senate to stop INEC from the electronic transmission of votes, the Sokoto state governor said the powers of INEC on how to conduct elections are entrenched in the constitution and cannot be subject to anybody.\n“The decision of the Senate to subject INECs constitutional power to conduct elections to the Nigerian Communications Commission (NCC) , and National Assembly is patently unconstitutional.\nThe Senate decision to subject INECs constitutional power to conduct elections to NCC is consequently patently VOID, unconstitutional, and unlawful.\nINEC also has constitutional power backed by the Electoral Act to make rules and guidelines to ensure that every vote is counted and that every vote counts."
  },
  {
    "headline": "Lagos APC members petition national leadership over conduct of LG polls -NigPilot",
    "summarized_story": "Some members of the All Progressives Congress, APC, in Lagos, under the auspices of Concerned APC Progressives, have petitioned the party’s national caretaker committee in Abuja against plans by the state chapter of the party to field candidates for the forthcoming local government elections in 57 local government councils instead of 20.\nSpecifically, they accused the chairman of the state chapter of the party, Alhaji Tunde Balogun, of anti-party activities, subversion of the provision of the constitution, and indulging in actions capable of eroding the core values of the party in the country.\nThey urged the national leadership of the party to prevail on the governor of Lagos State to advise LAISEC to conduct election only in the constitutionally recognized 20 local government councils and desist from conducting elections in the 57 local government councils to avoid national embarrassment for the party.\n“If this is allowed without the party at the National level taking urgent steps to correct the anomaly it might grievously affect and undermine the existence of the political party in the state” they alleged.\nThe APC members noted that if Lagos State Independent Electoral Commission should go-ahead to conduct any local government election as stated on July 24, 2021, it would not only violate the core values of the party but also the section of the provisions of the Constitution which recognizes only 20 local government councils for Lagos State as against the much flaunted 57 local government councils."
  },
  {
    "headline": "BREAKING: Reps Pass Electoral Act Amendment Bill After Opposition Lawmakers Walk Out",
    "summarized_story": "The House of Representatives has passed the Electoral Amendment Bill, moments after opposition lawmakers walked out of the heated session at the National Assembly chambers in Abuja on Friday.\nNigeria’s lower chamber, by this, has stepped down the controversial section 52(3) of the bill which deals with the electronic transmission of election results.\nOpposition lawmakers majorly from the Peoples Democratic Party (PDP) walked out of the session as they insisted that the clause was never carried.\nSubsequently, the Speaker, Femi Gbajabiamila, said the Independent National Electoral Commission (INEC) and the NCC would be present on Friday to give further clarifications on the Electoral Act with a major focus on section 52(3).\nREAD ALSO: Reps In Disorder As Deputy Speaker Rules Against E-Transmission Of Electoral ResultsSenate VoteAlready, the Senate had voted for the conditional electronic transmission of election results."
  },
  {
    "headline": "Opposition Lawmakers Stage Walkout Over Electoral Act Amendment Bill",
    "summarized_story": "Opposition lawmakers in the House of Representatives have staged a walk-out over clause 52 of the Electoral Act Amendment Bill.\nThe new amendment provides that the Independent National Electoral Commission (INEC) may consider electronic transmission so far as the national network coverage is adjudged to be adequate and secure by Nigeria Communication Commission (NCC) and approved by the National Assembly.\nBut as the debate over the passing of the bill intensifies, members of the House have yet to reach an agreement.\nOn Thursday, the representatives had also gone into a rowdy session after Deputy Speaker Idris Wase ruled against the electronic transmission of results despite a resounding vote in favour of electronic transmission.\nSubsequently, the Speaker, Femi Gbajabiamila, adjourned the session and announced that the Independent National Electoral Commission (INEC) and the NCC would be present on Friday to give further clarifications on the Electoral Act with a major focus on section 52(3)."
  },
  {
    "headline": "Nigeria’s Inflation Rate Declines To 17.75%",
    "summarized_story": "Nigeria’s consumer price index (CPI), a measurement of the rate of change in prices of goods and services, has declined to 17.75% in June from 17.93 recorded in May 2021.\nThere was also an increase in the urban inflation rate as it jumped by 18.35 %(year-on-year) in June 2021 from May 2021’s 18.51%.\nOn the other hand, the rural inflation rate moved by 17.16% in June 2021 from 17.36% in May 2021.\nIncreases in prices of bread, cereals, yam, and others, drove the food price index.\nWhere Are Food Prices Headed?"
  },
  {
    "headline": "Gunmen Kill Nigerian Army General",
    "summarized_story": "Gunmen have killed a former Provost Marshall of the Nigerian Army, Major Gen Hassan Ahmed.\nMajor Gen Hassan was killed on Thursday night along the Lokoja – Abuja when his vehicle was attacked by the assailants.\n“With a heavy heart, the Chief of Army Staff, Lt Gen Faruk Yahaya, and Soldiers of the Nigerian Army regret to announce the passing on of Maj Gen Hassan Ahmed, a former Provost Marshall of the Nigerian Army,” the Nigerian Army spokesperson, Onyema Nwachukwu, said in a statement issued on Friday morning.\n“Members of the Nigerian Army Officers’ Wives Association (NAOWA) led by the Deputy National President, Mrs Stella Omozoje have also visited the family to condole with them.”Until his death, he served as a director at the Army Headquarters in Abuja.\nThe incident comes a few days after gunmen killed the acting Commanding Officer of 196 Battalion, Major MS Samaila."
  },
  {
    "headline": "Electronic Transmission Of Results: We Can’t Guarantee 100% Safety, NCC Tells Reps",
    "summarized_story": "The Nigerian Communications Commission (NCC) has said it cannot guarantee total safety for the electronic transmission of results, explaining that no system is completely free from hackers.\nFederal lawmakers had a rowdy session as debates over the inclusion of electronic transmission of results in the Electoral Act Amendment took centre stage in the chambers on Thursday in Abuja.\nThis was after Deputy Speaker Idris Wase ruled against the electronic transmission of results despite a resounding vote in favour of electronic transmission.\nThe Senate had on the same day voted for the conditional electronic transmission of election results.\nThis means the majority of Senators voted that INEC may consider electronic transmission provided the national network coverage is adjudged to be adequate and secure by NCC and approved by the National Assembly."
  },
  {
    "headline": "Pulitzer Prize-winning photojournalist killed in Afghanistan",
    "summarized_story": "A Pulitzer Prize-winning photographer with the Reuters news agency has been killed while covering the fighting between Afghan security forces and the Taliban near a border crossing with Pakistan, the media outlet reported, citing an Afghan army commander.\nAfghan forces were fighting to retake Spin Boldak when Danish Siddiqui and a senior Afghan officer were killed in Taliban crossfire, the official told Reuters.\nThe agency reported that Siddiqui, an Indian national, had been embedded with Afghan special forces in Kandahar since this week.\nAdvertisementChargé d’Affaires Ross Wilson, the top U.S. diplomat in Afghanistan, expressed condolences to Siddiqui’s family on Friday in a series of tweets.\nHe called it a “tragedy for #Afghanistan and the world that Danish is the latest of 54 reporters who have been killed or murdered” in the country."
  },
  {
    "headline": "Anambra 2021: Soludo dropped, PDP missing as INEC releases names of candidates",
    "summarized_story": "The Independent National Electoral Commission has released the names of governorship and deputy governorship candidates for the Anambra governorship election.\nInstead they were replaced by Chukwuma Michael Umeoji and Orogbu Obiageli Lilian as governorship and deputy governorship candidates respectively.\nMeanwhile, the names of the candidates of the People’s Democratic Party were completely omitted on the list.\nWhile no reason was given for replacing Soludo’s name, that of the PDP candidates’ were dropped as a result of court cases.\nLIST OF CANDIDATES FOR THE ANAMBRA GOVERNORSHIP ELECTION"
  },
  {
    "headline": "Ohanaeze Ndigbo condemns alleged killing of 3 in Ladipo Market",
    "summarized_story": "The Ohanaeze Ndigbo Worldwide has condemned the alleged killing of three traders of Aguiyi Ironsi International Trade Center, Ladipo market, Lagos, by the militaryThis was contained in a statement made available to newsmen in Enugu, signed by its secretary, Alex Ogbonna,The Apex Igbo Social Cultural Group called on President Muhammadu Buhari to ensure that bad eggs in the military are isolated and adequately punished.\nThe igbo group which based it’s resolutions on several interviews it had with persons on ground, to ascertain the accurate circumstances that led to the death of the trio on July 13, 2021, described the act as Brutish, barbaric and premeditated.\nThe Professor George Obiozor led Ohaneze group, praised the detribalized leadership prowess of Governor Babajide Sanwo-Olu of Lagos state, charged other sub Igbo socio cultural organizations to ensure the matter is pursued legally to its logical conclusion."
  },
  {
    "headline": "Bukayo Saka Slams Social Media Giants Over Racism – Trending With Ojy Okpe",
    "summarized_story": "Bukayo Saka was trending after he took to Instagram to state that he did not want anyone else to be targeted by the kind of messages that he had been receiving on his page and that he knew instantly, the kind of “hate” that he was about to receive after he missed the penalty at the Euro 2020 game and blamed the platform for not doing enough to stop the abuses"
  },
  {
    "headline": "South Africa Deploys 25,000 Troops as Death Toll in ‘Zuma Protests’ Tops 100",
    "summarized_story": "South Africa has begun deploying more than 20,000 troops to assist police in quelling week-long unrest, as the death toll soared to 117 people in the rioting and looting following the jailing of former President Jacob Zuma, authorities said on Thursday.\nThe unrest, which began last Friday, was triggered by the jailing of former President Zuma but widened into grievances over inequality and poverty.\nBut in KwaZulu-Natal province, the epicentre of the violence, the minister said the “situation remains volatile, but much improved and moving towards stability”.\nAbout 100 acts of violence had been recorded on Wednesday, but fewer than three dozen on Thursday, she said.\nThe violence has so far not spread to South Africa’s seven other provinces, where police are on alert."
  },
  {
    "headline": "With Virus Cases Rising, Mask Mandate Back in Los Angeles",
    "summarized_story": "The rapid and sustained increase in cases in Los Angeles County requires restoring an indoor mask mandate, said Dr. Muntu Davis, public health officer for the county’s 10 million people.\nLos Angeles County has been recording more than 1,000 new cases each day for a week, and there is now “substantial community transmission,” Davis said.\nIt comes after a winter where Los Angeles County experienced a massive surge in infections and deaths, with hospitals overloaded with COVID-19 patients and ambulances idling outside, waiting for beds to open.\nThe Los Angeles County decision came within hours of the University of California’s announcement that students, faculty and staff must be vaccinated for the upcoming semester.\nIn San Francisco, cases are rising among the unvaccinated."
  },
  {
    "headline": "Freedom or Folly? UK’s End to Mandatory Masks Sows Confusion",
    "summarized_story": "The face mask — a highly charged source of debate, confusion and anger around the world during the coronavirus pandemic — is now dividing people as the crisis eases.\nBritain is bracing for acrimony on Monday, when the government lifts a legal requirement to wear face coverings in most indoor settings, including shops, trains, buses and subways.\n“We cannot simply revert instantly from Monday the 19th of July to life as it was before COVID.”So while people no longer have to wear masks, they’re being told that they should.\nIn many East Asian countries, it was common even before the pandemic for people to wear masks when sick or on high-pollution days.\n“The face mask is such a minimal object — this small piece of fabric, it’s a very low-tech device."
  },
  {
    "headline": "Nigeria Approves Moderna, Sputnik, Korean Astrazeneca for Covid Vaccination",
    "summarized_story": "Nigeria’s National Agency for Food and Drug Administration and Control (NAFDAC) has approved three additional Covid-19 vaccines for use.\nNAFDAC had earlier granted emergency use authorisation approval for Astrazeneca from India, Pfizer Bio-N-Tech and Johnson and Johnson (Jassen) vaccines to be deployed in the country against COVID-19.\nShe said: “NAFDAC is announcing the approval of Moderna and AstraZeneca vaccines and conditional approval of Sputnik V vaccine.\nAdeyeye explained that Moderna and AstraZeneca AZD1222 vaccines have received WHO EUL listing and were given expedited approvals.\nWhile giving NAFDAC’s assessment of the outcome of the first phase COVID-19 vaccination rollout, Adeyeye said about 4,500 adverse effects were recorded out of the four million doses of Astrazeneca vaccines administered nationwide."
  }
]