[
  {
    "headline": "Nnamdi Kanu hungry, starving in DSS custody — Lawyer",
    "summarized_story": "Ifeanyi Ejiofor, the lawyer of the detained leader of the Indigenous People of Biafra, Mazi Nnamdi Kanu, on Tuesday, claimed that his client is starving in the custody of the Department of State Services.\nEjiofor said these in a statement titled: “Update on today’s visit to our indefatigable client – Onyendu Mazi Nnamdi Kanu at the Headquarters of the Department of State Services Abuja.”He said, “The routine visit to our client — Onyendu Mazi Nnamdi Kanu was conducted on December 6, 2021, and in his usual practice, he extended his compliments to his millions of supporters.\n“We were informed by our client – Onyendu Mazi Nnamdi Kanu that none of the pronouncements made by the Court on December 2 2021 has been obeyed by the DSS.\nOur client — Onyendu Mazi Nnamdi Kanu further informed us that he had not eaten anything since yesterday (Sunday).”The lawyer further claimed that his client is being punished because he complained to the court about how he is being treated in the custody of the DSS.\nBut, very, unfortunately, this should be the height of their reckless affront to the orders of Court."
  },
  {
    "headline": "Omicron: Student, work visa applications will be processed despite travel restrictions — UK",
    "summarized_story": "The United Kingdom on Monday said that student and work visa applications will be processed despite travel restrictions imposed on Nigeria amid the outbreak of the Omicron COVID-19 variant.\nThe British High Commission, Abuja, made this known in a statement titled, ‘Statement from British High Commission on UK visa applications’.\nThe High Commission had on Sunday said it will “pause making decisions on visitor visa applications in all red list countries, including Nigeria, until travel restrictions are lifted”.\nBut in an update on Monday, the UK said visa applications in other categories such as for persons who wish to study, work or live permanently, will continue to be processed.\n“To support the UK Government’s aim to protect public health from COVID 19 and associated variants of concern, UK Visas & Immigration have paused making decisions on visitor visa applications in all red list countries until travel restrictions are lifted."
  },
  {
    "headline": "Umahi rolls out housing projects for over one million households in Ebonyi",
    "summarized_story": "By Peter Okutu, AbakalikiGOVERNOR David Umahi of Ebonyi State has rolled out his administration’s agenda to tackle housing deficits, which has bedevilled the State since its creation.\nThe housing project is being executed through the Ministry of Trade and Investment headed by Barr Mrs Chioma Jennifer Nweze.\n“That the NLC estate at Ugwuachara would provide accommodation for 150 households; the forest estate along the expressway will provide accommodation for 750 households.\nThe Government facilitated Mortgage Home at Uburu will provide accommodation for 100 households while the park estate will provide accommodation for 130 households.\n“The CBN housing estate at the centenary city will provide accommodation for 110 households."
  },
  {
    "headline": "SYLVESTER OROMONI: ‘Lagos, Delta govts must carry out independent autopsy’",
    "summarized_story": "By Chukwueze EdwinThe sad death of Sylvester Oromoni Jnr has generated widespread reactions over the past week.\n12-year old Oromoni Jnr.\nThe family of the deceased however said that Sylvester Oromoni Jnr.\nThe Lagos state government and the police authorities have intervened and vowed to investigate the matter.\nThe statement read in part: “The Lagos State Government sends its condolences to the parents of 12-year-old Sylvester Oromoni Jnr., a student of Dowen College, Lekki."
  },
  {
    "headline": "Senate mourns Sen Gbenga Aluko, observes a minute silence in his honour",
    "summarized_story": "By Henry Umoru, ABUJATHE Senate has observed a minute silence in honour of its late colleague, Senator Gbenga Aluko.\nSenator Daniel Olugbenga Aluko, son of the renowned Economist, Professor Sam Aluko from Ekiti State, was born on 20 July 1963.\nRecall that after taking his seat in the Senate in June 1999, Late Senator Gbenga Aluko was appointed to Committees on Selection, Senate Services (vice Chairman), Aviation, Women Affairs, Finance & Appropriations, Social Development & Sports and Local & Foreign Debts.\nLater he became the Vice Chairman of the Committee on Gas and Chairman of the Petroleum Committee.\nThe late Senator attended the Federal Government College, Ilorin, and then admitted to the University of Benin and graduated in 1982 with a degree in Geography and Regional Planning."
  },
  {
    "headline": "BREAKING: Buhari writes Senate, seeks passage of Finance Bill 2021",
    "summarized_story": "By Henry Umoru, ABUJAPRESIDENT Muhammadu Buhari has written the Senate, seeking the consideration and subsequent passage of the 2021 Finance bill that will guide the implementation of the 2022 appropriation.\nIn a letter addressed to the President of the Senate, Senator Ahmad Lawan and read during plenary on Tuesday, President Buhari said that the bill when passed will help support the 2022 budget of Economic growth and sustainability that is presently before the National Assembly, awaiting passage.\nAccording to the President, the Bill will also help to carry out some radical reforms in the finances of the government.\nThe President’s letter read, “Pursuant to Sections 58 and 59 of the Constitution of the Federal Republic of Nigeria, 1999 (as amended), | formally request that the Finance Bill, 2021 be considered by the Senate for passage into law.\n“The Finance Bill, 2021 seeks to support the implementation of the 2022 Federal Budget of Economic Growth and Sustainability by Proposing key reforms to specific taxation, customs, excise, fiscal and other relevant laws."
  },
  {
    "headline": "Alleged sexual abuse of 13-yr-old girl by AE-FUNAI lecturer: We are waiting for Police report — VC",
    "summarized_story": "The July 2021 edition of Webometric World University ranking, AE-FUNAI ranked 50 out of 279 tertiary institutions in Nigeria.\nAlso in the African Continent, AE-FUNAI was ranked 279 out of 1,952 Institutions.\nThus, in the last 10 months of my administration, we have been able to achieve the constitution of a university-wide security committee comprising staff, students, host community representatives and members of security agencies.\nAgency Banking in Collaboration with Zenith Bank“Establishment of Agency Banking in the university to take care of the banking needs of our staff, students and host community.\nIn fact, AE-FUNAI was the only public university in Nigeria that mobilized students for NYSC in the batch B 2019/2020 academic session."
  },
  {
    "headline": "Students disrupt Anambra Poly’s convocation over issuance of invalid certificates [VIDEO]",
    "summarized_story": "Ex-students of Anambra State Polytechnic, Mgbakwu, on Friday disrupted the convocation ceremony of the institution, shutting the gate and denying visitors and some management staff entry into the convocation arena.\nDAILY POST gathered that the protest, which was led by past students of the institution was because of the issuance of certificates, which have been rejected by other institutions, including employers of labour.\nIn a video circulating on social media, Frank Onyekachi Imo, a former student of the institution, who spoke to journalists said: “Some of our students who graduated here and attempted to further their education, their certificates were rejected and described as invalid.\nSome of our former students who have gotten their certificates were rejected in other institutions where they went to further their education, and their certificates were described as invalid.\n“We are appealing to Governor Willie Obiano to look into the polytechnic."
  },
  {
    "headline": "Automation, next stage of service delivery in public sector – Danbatta",
    "summarized_story": "The Executive Vice Chairman of the Nigerian Communications Commission (NCC), Prof. Umar Garba Danbatta has said leveraging the potential of Information and Communication Technology (ICT) to automate service delivery should be the next frontier of excellent service delivery to Nigerians by public institutions.\n“Therefore, from our perspective as a regulator of the digital ecosystem in Nigeria, we feel that automation of service should be the next stage of service delivery.\nWe also constantly monitor the Quality of Service (QoS), ensuring that service delivery issues are within the acceptable key performance indicators (KPIs),” Adinde said.\nWe also constantly monitor the Quality of Service (QoS), ensuring that service delivery issues are within the acceptable key performance indicators (KPIs),” Adinde said.\nHe emphasized the role of Management’s support, education, and commitment towards improving and consolidating the various SERVICOM interventions that had been initiated."
  },
  {
    "headline": "NAWOJ tells security agencies to arrest factional executives in Oyo",
    "summarized_story": "The national secretariat of Nigeria Association of Women Journalists (NAWOJ) has appealed to security agencies in Oyo State to, without wasting more time, arrest and prosecute some impostors who are parading themselves as the factional executive of the union in the state.\nThe association made this disclosure via a statement signed by the National Secretary of the union, Comrade Helen Udofia.\nOur correspondent recalls that the National Secretariat of the union had last month inaugurated NAWOJ executive which had Jadesola Ajibola as Chairperson.\nThe national secretariat of the union has however enjoined security agencies to treat those who went ahead to inaugurate their own executive as impersonators.\nShe maintained that NAWOJ national secretariat has distanced itself from the charade of Omolola Alamu, Shade Oduola, Ramat Alade, Temilola Ankarah, Temitope Oyewole and Kehinde Igbari, who are parading themselves as leaders of NAWOJ in the state."
  },
  {
    "headline": "Why DSS is starving, refusing Nnamdi Kanu change of clothes – Lawyer, Ejiofor",
    "summarized_story": "Ifeanyi Ejiofor, lead counsel to Nnamdi Kanu, pro-Biafra agitator, has accused the Department of State Services, DSS, of refusing to obey court orders on allowing the agitator to change clothes and eat.\nEjiofor explained that the DSS is punishing Kanu because his legal team complained about the harsh conditions they subjected him to in detention.\nThe statement reads partly: “We were informed by our client Nnamdi Kanu that none of the pronouncement made by the Court on the 2nd of December 2021 has been obeyed by the lawless DSS.\nShe also ordered the secret police to allow Kanu to change his clothes and practice his religion freely.\nThe agitator has been in DSS custody since July when he was arrested in Kenya and repatriated back to Nigeria."
  },
  {
    "headline": "I didn’t ask DSS to starve Nnamdi Kanu during my visit – Orji Kalu",
    "summarized_story": "Kanu is currently detained on the order of Justice Binta Murtala Nyako-led Federal High Court in Abuja on treasonable felony charges preferred against him by the Federal Government.\nOn Monday, DAILY POST reported that Kanu had alleged that he is being starved in the DSS facility in Abuja.\nHe spoke through his younger brother, Prince Kanu Meme, who was on a routine visit to the detained separatist leader.\nHowever, the former Governor of Abia State, Senator Orji Kalu, in a statement made available to DAILY POST on Tuesday, described the purported statement linked to him as big fat lies and cheap propaganda to score selfish political points.\nAccording to him, “the circulating lie says, ‘when Senator Orji Uzor Kalu visited DSS and Nnamdi Kanu has been living without food since then’."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "BREAKING: Former PMAN president Bolaji Rosiji is dead",
    "summarized_story": "BREAKING: Former PMAN president Bolaji Rosiji is deadBolaji Rosiji, a former president of the Performing Musicians Association of Nigeria (PMAN), is dead.\nRosiji’s death was announced by one of his friends and colleague, renowned flutist Tee Mac Omatsola Iseli.\nUntil his death, he was the founder and brain behind Guarapad Charities.\nIn a statement by Olayemi Esan, the Public Relations Officer, Gaurapad Charities, Rosiji died in Lagos on Sunday after a brief illness.\nThe late Rosiji founded Gaurapad Charities in 2004, and was the former Secretary-General of the Nigeria Network of NGOs (NNNGO)."
  },
  {
    "headline": "Why travel ban on Nigeria will not work, by Onyeama",
    "summarized_story": "Nigeria’s Minister of Foreign affairs, Geoffrey Onyeama, has said the travel ban on Nigeria and other African countries will not work.\nThe Director General of WHO, Tedros Adhanom, is saying that these travel bans are not the solution and that your standard protocols should suffice to address the situation.\n“Travel bans will not work because some countries putting up these bans already have the Omicron variant in their countries and it doesn’t make a difference.\nRead Also: FG asks UK to rescind travel ban over OMICRON variant“We should rather be coming together to look at ways we could solve this issue as a global community rather than segmenting.\n“The United Kingdom said the increasing number they got was what drove their decision on the travel ban on Nigerians."
  },
  {
    "headline": "BREAKING: Dowen College ‘murder’: Police invite accused pupils",
    "summarized_story": "Detectives at the State Criminal Investigation Department (SCID) Panti have invited pupils named in the alleged murder of 12-year-old Sylvester Oromoni at Dowen College in Lekki, Lagos.\nThe pupils and their parents, who were invited for questioning at the homicide section of the police unit, are expected to report today.\nThe mother of one of the invited pupils, Edward Brown, said he was innocent.\nIn a statement released on social media, the woman, Ms. Oluchi Sunday, explained that her son was a day student.\n“In a social media post made on December 1, 2021, on the deceased’s elder brother’s Instagram page, ‘greatoromonii’, five names, including Dowen College were mentioned before the conclusion."
  },
  {
    "headline": "NCoS arrests 21 escapees from Jos prisons – official",
    "summarized_story": "The Nigerian Correctional Service (NCoS), Plateau Command, has arrested 21 inmates who escaped from the Jos custodial centre when gunmen attacked the facility.\nASC Geofrey Longdiem, the Public Relations Officer (PRO) of the command, disclosed this to the News Agency of Nigeria (NAN) on Tuesday in Jos.\nNAN reports that gunmen invaded the custodial centre on Nov. 28, killed a personnel of the Nigerian Correctional Service (NCoS) and nine inmates, while 252 inmates escaped during the invasion.\n“As at today, we have recaptured 21 of the inmates who escaped during the last attack at our custodial centre in Jos,” he said.\nNAN also reports that two of the inmates were brought back to the custodial centre by their mother."
  },
  {
    "headline": "Omicron: Travel ban on Nigeria discriminatory, prejudiced -FG",
    "summarized_story": "The United Kingdom’s restrictions on Nigerians came into effect, yesterday after the Omicron variant of COVID-19 was discovered, first in South Africa and later, Nigeria.\nA waiver was, however, made for citizens who travel from Nigeria but would have to pay £2,285 for a 10-day quarantine.\nCountries in Europe where the same variant has been discovered, they have not been included on the travel ban.\nEven if 21 cases were discovered, does that qualify us for a travel ban?\nThis is why this decision to ban travellers from Nigeria, who are neither citizens nor residents, is grossly discriminatory and punitive."
  },
  {
    "headline": "Malami launches virtual court sitting at Kuje correctional centre",
    "summarized_story": "The minister was quick to clarify that “this virtual court hearing will not in any way contravene the provision of section 36(6) of the 1999 Constitution, which provides for the arraignment, taking of evidence, tendering of documents, cross-examination and general conduct of criminal proceedings.\nInasmuch as these are done in accordance with the said provision, the virtual hearing would be valid.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMalami further added that the project was initiated to ensure the hearing and determination of urgent and time-bound cases, using the digital platform.\nThe AGF spoke, yesterday, at the launch of the virtual court sitting facilities deployed here at the Kuje Correctional Centre, for virtual court sitting proceedings.\nEarlier, the Controller General Correctional, Halilu Nababa, expressed confidence that the project will enhance speedy access to justice and reposition the correctional service in line with standard global practice."
  },
  {
    "headline": "Over 70,000 Cameroonian refugees in Nigeria, says UNHCR",
    "summarized_story": "From Aidoghie Paulinus, Abuja and Tony Osauzo, BeninThe United Nations High Commissioner for Refugees (UNHCR) Nigeria has raised the alarm over spike in influx of Cameroonian refugees into Nigeria.\nUNHCR Nigeria, in a statement by the Communication/Public Information Officer, Gabriel Adeyemo, called on the international community for urgent additional support for refugees in Nigeria.\n70,000 refugees are 70,000 daughters and sons.\nUNHCR commends Nigeria because it is on its way to become a champion in implementing the Global Compact on Refugees.\nBut Nigeria needs support.”Meanwhile, the global agency has announced that Edo State accounts for 70 percent of migration from Nigeria."
  },
  {
    "headline": "Fuel import throws Nigeria to negative trade balance of N3.0trn in Q3 2021",
    "summarized_story": "From Isaac Anumihe, AbujaNigeria recorded a negative trade balance of N3,023.50 billion in the third quarter of 2021 from a total trade of N13, 284.09 billion between it and its partners across the world.\nWhile export trade value was N5,130.30 billion, import trade value was N8,153.79 billion resulting to a negative trade balance of N3,023.50 billion.\nAccording to the SG, comparing third quarter to second quarter, 2021, total trade grew by 10.43 per cent from N12,029.64 billion; export trade grew by 1.00 per cent from N5,078.44 billion; import trade also grew by 17.32 per cent from N6,950.21 billion while trade balance recorded a deficit of 61.62 per cent from N1,870.77 billion in second quarter, 2021, depicting a decline.\n“In terms of exports, Nigerian export trade was mainly dominated by crude oil which amounted to N4,026.18 billion (78.47 per cent) of total export in the third quarter.\nListing Nigeria’s trade partners during the period, Harry said that India had a trade volume of N758.1 billion, Spain N627.01 billion, Italy (446.04 billion), France (N363.23 billion) and Netherlands (N242.49 billion)."
  },
  {
    "headline": "Senate slams health ministers, perm sec for shunning COVID-19 summit",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaSenate President, Ahmed Lawan, has lambasted the Minister of Health, Osagie Ehanire, Minister of State for Health, Olorunimbe Mamora, and the Permanent Secretary, Mahmuda Mamman for being absent at a National COVID-19 Summit.\nWhen told that the minister of health was present earlier, he insisted another senior official should have replaced him to demonstrate the seriousness of the event.\nThe Senate president, who declared the summit opened, said: “Before I begin my remarks, is the permanent secretary ministry of health here?\nWell, I asked that question because the two ministers of health are not here.\nThe minister of health, the minister of state and the permanent secretary are not here."
  },
  {
    "headline": "Red List: UK Under Fire for Travel Apartheid against Nigeria",
    "summarized_story": "Latest figures from the UK government on its website revealed that 21 cases of omicron reported in England were linked to travel from Nigeria.\nThe UK, at the weekend, had updated its so called Red List, indicating countries prohibited from entering the UK in view of the new COVID-19 variant called “omicron”.\nIn his contribution, the President of the National Association of Nigeria Travel Agencies (NANTA), Mrs. Susan Akporiaye condemned the decision of the UK to put Nigeria in the red list and said it was totally uncalled for.\n“The decision taken by the UK by putting Nigeria on the red list is affecting our business.\n“Since the news of the outbreak, many countries, Nigeria inclusive, have reacted swiftly by placing a raft of travel restrictions and protocols."
  },
  {
    "headline": "Tax-to-GDP Ratio: FIRS Moves to Reflect Govt Revenues, Waivers, Others in Computation",
    "summarized_story": "Agba, said the ministry would continue to support the FIRS and provide the enabling environment and policy direction to strengthen its operations.\nHe said, “I am glad to note that the FIRS non-oil tax collections for 2020 and the collections so far for 2021 is higher than the tax from oil.\nThis can be attributed to the various reform programmes and digitization projects being undertaken by the Service to improve its operations.\nShe further stressed the need for the country to strengthen its fiscal buffers by building a resilient economy to withstand and overcome external vulnerabilities.\nThe former FIRS boss, also called for integrated tax system and real stakeholder engagement as well as home-grown solutions to enhancing domestic non-oil revenue collections."
  },
  {
    "headline": "Gana: Buhari’s Failure to Implement 2014 Confab Report, Terrible Mistake",
    "summarized_story": "•Says Nigeria better off togetherSylvester Idowu in WarriA former Minister of Information and Culture, Professor Jerry Gana, has described the failure of President Muhammadu Buhari-led administration to implement the 2014 National Conference report “as a terrible mistake”.\n“We, in the middlebelt of Nigeria, are great lovers of peace, justice and fairness.\nThe last administration convened a national conference in 2014 and we agreed on some certain fundamentals to ensure justice and fairness.\nLet me appeal to the federal government to promote peace, equity and justice.\nThe Youth Arise Nigeria Conference with large turnout in attendance from within and Outside Delta was put together by Advocates of Paradigm Shift in Governance."
  },
  {
    "headline": "…Fails to Red List 17 European Countries Despite Recording Omicron",
    "summarized_story": "Following its discovery at the end of November, the variant has now been detected in at least 48 countries, with 17 of them in Europe, according to the World Health Organisation (WHO).\nFor instance, checks by THISDAY yesterday showed as of yesterday, Austria had reported 10 cases of the new disease variant, while Croatia and Denmark had reported two and 18 cases respectively.\nSimilarly, other European countries that had reported omicron on their soil included Netherlands with a total of 18 cases as of yesterday; Norway – 19 cases; Portugal – 34; Belgium – nine and Luxembourg with just one case.\nUK’s failure to red list its European allies reinforces the suspicion that African countries are being targeted by the Western world.\nThe racist undertone becomes even more obvious considering the speed of the action against African countries and the deliberate attempt to tag the virus an African virus."
  },
  {
    "headline": "Citizenship: Court to Decide Atiku’s Status February",
    "summarized_story": "Alex Enumah in AbujaJustice Inyang Ekwo of the Federal High Court, Abuja, on Monday adjourned till February 21, 2022 to deliver his judgment in a suit querying the Nigerian citizenship of former Vice-President Atiku Abubakar.\nThe suit, filed on February 11, 2019 before the presidential election, was brought by the Incorporated Trustees of Egalitarian Mission for Africa.\nThe defendants include Atiku, PDP, the Independent National Electoral Commission (INEC), the Attorney-General of the Federation (AGF) and Minister of Justice as well as the Attorney General of Adamawa State.\n“Whether by the provisions of Section 131(a) of the Constitution, only a Nigerian citizen by birth can contest for the office of president.\nAfter listening to the submissions of all lawyers in the suit, Justice Ekwo then adjourned till February 21, 2022 to deliver judgment."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Take Over Yobe Police Station, Barracks, Set Operational Vehicles Ablaze",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have taken over a police station in Buni Yadi town, Gujba Local Government Area of Yobe State.\nHowever, a military source told SaharaReporters on Tuesday that the terror group stormed the community, took over the police station and barracks newly renovated by the state government for several hours.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe States."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Take Over Yobe Police Station, Barracks, Set Operational Vehicles Ablaze",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have taken over a police station in Buni Yadi town, Gujba Local Government Area of Yobe State.\nHowever, a military source told SaharaReporters on Tuesday that the terror group stormed the community, took over the police station and barracks newly renovated by the state government for several hours.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe States."
  },
  {
    "headline": "BREAKING: Broke Nigerian Government Owes Police Officers Nationwide Amid Insecurity As Personnel Lament Non-payment Of November Salaries",
    "summarized_story": "Some police personnel have cried out over the non-payment of their November salary, saying the situation has worsened their economic plight.\nFile Photo“Today is 7th and no policeman has been paid salary.\nFunny enough, every other security agencies has been paid,” one of the officers told SaharaReporters.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures.\nThe country’s debt profile according to the Debt Management Office was N33.10 trillion as of the end of the first quarter of 2021."
  },
  {
    "headline": "BREAKING: Broke Nigerian Government Owes Police Officers Nationwide Amid Insecurity As Personnel Lament Non-payment Of November Salaries",
    "summarized_story": "Some police personnel have cried out over the non-payment of their November salary, saying the situation has worsened their economic plight.\nFile Photo“Today is 7th and no policeman has been paid salary.\nFunny enough, every other security agencies has been paid,” one of the officers told SaharaReporters.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures.\nThe country’s debt profile according to the Debt Management Office was N33.10 trillion as of the end of the first quarter of 2021."
  },
  {
    "headline": "Why UK Added Nigeria To Travel Red List — High Commissioner",
    "summarized_story": "The reasons the United Kingdom added Nigeria to the travel red list amid concerns over the newly detected Omicron variant of Coronavirus, have been revealed by the British Deputy High Commissioner to Nigeria, Catriona Laing.\nLaing said the UK made the decision in order to protect the public health of its people while the government tried to understand the new variant.\nBritish High Commissioner to Nigeria, Catriona Laing.\nThe Nigerian government has faulted the decision of the UK government, describing it as unjust and discriminatory.\nMeanwhile, the Minister of Information and Culture, Lai Mohammed, had on Monday during a press conference called the UK government to rescind its decision immediately."
  },
  {
    "headline": "Buhari sacks AEDC management over workers' strike",
    "summarized_story": "President Muhammadu Buhari has approved the sack of the management of the Abuja Electricity Distribution Company (AEDC) over the strike by the Nigerian Union of Electricity Employees (NUEE).\nAdvertisementThe strike by the NUEE left areas serviced by the AEDC without power for hours on Monday.\nThe areas serviced by the company are the federal capital territory (FCT), Kogi, Nasarawa and Niger states.\nThe workers were protesting unpaid allowances, salaries and unremitted pension deductions.\n“The presidential directives as conveyed also directed the Bureau of Public Enterprises to set up a new management team of the AEDC,” the statement said."
  },
  {
    "headline": "Buhari sacks AEDC management over workers' strike",
    "summarized_story": "President Muhammadu Buhari has approved the sack of the management of the Abuja Electricity Distribution Company (AEDC) over the strike by the Nigerian Union of Electricity Employees (NUEE).\nAdvertisementThe strike by the NUEE left areas serviced by the AEDC without power for hours on Monday.\nThe areas serviced by the company are the federal capital territory (FCT), Kogi, Nasarawa and Niger states.\nThe workers were protesting unpaid allowances, salaries and unremitted pension deductions.\n“The presidential directives as conveyed also directed the Bureau of Public Enterprises to set up a new management team of the AEDC,” the statement said."
  },
  {
    "headline": "Police interrogate 3 Dowen College students over Oromoni’s death",
    "summarized_story": "Three students of Dowen College are being grilled by the Lagos state police command in connection to the death of Sylvester Oromoni Jnr.\nAdvertisementSources close to the family confirmed the development to TheCable Lifestyle on Tuesday morning.\nBefore his death, Oromoni had named five students who he claimed had attacked him in his dormitory room, inflicting on him multiple internal injuries.\nThe student’s father had earlier told TheCable Lifestyle that his child was beaten and fed a liquid chemical.\nOdumosu had earlier ordered an investigation into Oromoni’s death while Dowen College was also sealed off last Sunday."
  },
  {
    "headline": "Police interrogate 3 Dowen College students over Oromoni’s death",
    "summarized_story": "Three students of Dowen College are being grilled by the Lagos state police command in connection to the death of Sylvester Oromoni Jnr.\nAdvertisementSources close to the family confirmed the development to TheCable Lifestyle on Tuesday morning.\nBefore his death, Oromoni had named five students who he claimed had attacked him in his dormitory room, inflicting on him multiple internal injuries.\nThe student’s father had earlier told TheCable Lifestyle that his child was beaten and fed a liquid chemical.\nOdumosu had earlier ordered an investigation into Oromoni’s death while Dowen College was also sealed off last Sunday."
  },
  {
    "headline": "Nami: Nigeria's tax-to-GDP ratio undercalculated... we need to include waivers, MDAs' revenue",
    "summarized_story": "Muhammad Nami, executive chairman of the Federal Inland Revenue Service (FIRS), has faulted the computation of Nigeria’s tax-to-gross domestic product (GDP) ratio, currently at six percent.\nAdvertisementHe said the figure captures only the federal government’s taxes and excludes the contributions of states and local governments in the country.\n“One of the recurring issues in national discourse has been Nigeria’s low tax-to-GDP ratio,” Nami said.\nNami said that FIRS, through the ministry of finance, must include all government revenues in accounting for taxes generated to give the correct state of governments revenue.\nHe identified taxes generated to include amounts invested by taxpayers in the country’s road infrastructure as a result of Executive Order 007 and tax waivers granted to pioneer companies."
  },
  {
    "headline": "Funke Opeke’s MainOne to be acquired for $320mn by US giant Equinix",
    "summarized_story": "Founded by Funke Opeke in 2010, MainOne is a key provider of enterprise connectivity solutions, with an estimated 800+ business-to-business customers.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\n“Deals like the MainOne acquisition will keep drawing foreign investors’ attention to the region,” Omole told TechCabal over the phone.\n“MainOne’s leading interconnection position and experienced management team represent critical assets in our aspirations to be the leading neutral provider of digital infrastructure in Africa,” added Charles Meyers, President and CEO of Equinix."
  },
  {
    "headline": "Earnipay is improving financial well-being for salaried employees",
    "summarized_story": "In Nigeria, wages for formal-sector employees are paid monthly; in the informal sector, however, this is paid daily.\nNow, when salaried employees go broke between paydays, they have three options: borrow, take a loan, or request a salary advance.\nEarnipay, a fintech solution, founded by Nonso Onwuzulike, allows employees flexible access to their accrued salaries on any day of the month.\nCommenting on Earnipay’s plans for 2022, Onwuzulike said, “Our goal is to partner with employers to improve employee financial well-being.\nIn addition to flexible salary access, we provide financial education to advise employees on best practices to manage their finances, and other products to assist them daily.”Share this article"
  },
  {
    "headline": "TradeDepot secures $110m to expand Buy-Now-Pay-Later to more African retailers",
    "summarized_story": "The fund will support the delivery of Buy-Now-Pay-Later (BNPL) services to 5 million SME retailers and drive further expansion of its merchant platform across the continent.\nThe debt funding was led by Arcadia Funds.\nIn Africa, SME retailers generate $1 trillion in sales annually and contribute $2.6 trillion to the continent’s nominal GDP.\nTradeDepot has grown from over 40,000 merchants on its platform last year to more than 100,000 merchants.\nBut, as for TradeDepot, it wants to capture more than 5 million SMEs as it continues to leverage and expand its BNPL offering in the 12 cities it’s currently operating in."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Equinix to buy MainOne in push for Africa’s data centre market",
    "summarized_story": "Founded in 2010 by Funke Opeke, MainOne has a presence in three countries including Nigeria, Ghana, and Côte d’Ivoire.\nThe acquisition marks the first step in Equinix’s long-term strategy to become an African carrier neutral digital infrastructure company.\nEquinix is betting on Nigeria’s growing population pushing demand for data centres and a spike in the number of operators.\nCharles Meyers, President, and CEO, Equinix, says the MainOne deal represents a critical point of entry for Platform Equinix into the expansive and rapidly African market.\nShe was also recently named one of the Top 10 Women to Watch in the Data Center Industry by Data Centre Magazine."
  },
  {
    "headline": "FX speculators selling off hoarded cash says senior Nigerian bankers",
    "summarized_story": "Senior Nigerian bankers say currency speculators are now beginning to bring out the foreign exchange they are hoarding to the market and selling, according to the Economist Intelligence Unit, EIU.\nIt is seen as reversing the speculative pressure on the Naira since the Central Bank stopped the sale of foreign exchange to bureau de change operators in July but the market still has a long way to go to stabilize.\nThe EIU said, “another test to our assumption lies in how a planned end to fuel subsidies in early 2022 plays out.\nNigeria’s national oil company is the sole petrol retailer because of the subsidy, and engages in crude‑for‑fuel swaps that conserve foreign exchange.\n“If the reform goes ahead (not our core forecast so close to an election), petrol will be imported by private marketers exclusively using hard currency."
  },
  {
    "headline": "Haulage cost in yuletide stable first time in 8 years",
    "summarized_story": "The Tin-Can and Apapa Ports are major economic gateway to Nigeria and account for about 80 percent of the country’s total imports.\nSimilarly, transporting a 20-foot container which cost N800, 000 in 2020, has equally dropped by 56.3 percent N350, 000.\nHe said shippers were still hoping for a further reduction in the cost of haulage especially if the government makes the roads to the ports motorable.\nThe reduction in the gridlock on port roads also helped in reducing the cost of freight,” he added.\nEmma Nwabunwanne, a Lagos-based importer, said transportation has remained stable despite the yuletide due to the decline in the volume of business at the nation’s seaport."
  },
  {
    "headline": "Buhari, Obaseki urge Auditor-Generals on strategies to end corruption – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – President Muhammadu Buhari and the Edo State Governor, Mr. Godwin Obaseki have charged Auditor-Generals in the country to develop innovative strategies that can help the government win the war against corruption.\nDeclaring open the 2021 conference of Auditor-Generals in Nigeria (COAGN) with the theme ‘Securing Audit Independence Sustainability: The Urgency of Now,’ President Buhari restated his administration’s commitment to end corruption in the country.\nBuhari, represented by Governor Obaseki, noted that the sustained fight against corruption by his administration is already yielding positive results.\nAccording to him, “As you go into deliberations, I urge you to come with strategies on how to help stamp out corruption in Nigeria.\nWe have no other country than Nigeria; it is by doing so that the future generations of Nigeria can thrive in this great nation.”Buhari further noted, “During my first inauguration, I told Nigerians that if we don’t kill corruption, corruption will kill Nigeria."
  },
  {
    "headline": "Obaseki approves appointment of Agbogun, Gowon, Obadiku as Special Advisers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the appointment of three new Special Advisers.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the appointees are James Babatunde Agbogun Esq.\nAccording to him, “The Edo State Governor, Mr. Godwin Nogheghase Obaseki, has approved the appointments of the underlisted persons as Special Advisers in the Edo State Government.\n; Yakubu Gowon, and Jimfred Obadiku.”He added that the swearing-in of the appointees will be conducted at a date to be announced later.\nThis follows the recent appointment of 38 Senior Special Assistants and 96 Special Assistants drawn from across the state after the harmonization of the Peoples Democratic Party (PDP) by the leaders of the party."
  },
  {
    "headline": "Obaseki: Edo’s 30-year plan’ll sustain reforms in healthcare, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state’s newly unveiled 30-year development plan will sustain ongoing reforms and projects by his administration aimed at improving the livelihoods of the people and ensuring a progressive and prosperous state.\n“In the last five years, we have undertaken transformational reforms targeted at overhauling the civil/public service, which is the engine that drives government.\nWe are aware that we need to sustain these deep reforms and initiatives.\nThat is why we unveiled the 30-year development plan process, which we have commenced.\n“The Edo State 30-year Development Plan and the Edo State 30-year Urban and Regional Masterplan will be a grand design to set the new course and direction for one of the most progressive and prosperous sub-national governments in Nigeria,” Obaseki added."
  },
  {
    "headline": "Obaseki to spend N51bn on physical infrastructure, construction of roads, bridges in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state plans to expend N51billion in 2022 for the development and sustenance of physical infrastructure, as well as the construction and rehabilitation of roads and bridges.\nThe governor, who recently presented the 2022 budget proposal to Edo State House Assembly in Benin City, said N30bn will be spent on improving roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nReassuring the completion of all ongoing road projects in the state, Obaseki, reassured residents that his government remains committed to infrastructural development across the state.\nIn the new financial year, we have budgeted N30bn to improve roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nThese include roads linking towns as well as small township and inner-city roads."
  },
  {
    "headline": "Equinix acquiring Nigeria’s MainOne for $320M to expand into Africa",
    "summarized_story": "Equinix, a global digital infrastructure company, has announced it is acquiring MainOne, Nigeria’s based data centre and connectivity solutions provider with a presence in Ghana and the Ivory Coast, for $320 million.\nIn a statement, Equinix acknowledged that acquiring MainOne is the first step in its long-term strategy to become an African carrier neutral digital infrastructure company.\n“The acquisition of MainOne will represent a critical point of entry for Platform Equinix into the expansive and rapidly growing African market.\nOpeke said the acquisition will accelerate MainOne’s long-term vision to grow digital infrastructure investments across Africa.\nThe MainOne team is excited about the partnership created through the acquisition, and we look forward to building our next chapter together,” she added"
  },
  {
    "headline": "JUST IN: Three students arrested over Sylvester Oromoni’s death",
    "summarized_story": "Three students of Dowen College in the Lekki area of Lagos are currently in police custody for allegedly assaulting 12-year-old Sylvester Oromoni, the state Commissioner of Police, Hakeem Odumosu, has revealed.\nWith the national outrage the case has attracted since Oromoni’s death on November 30, 2021, federal and state governments have taken a number of actions.\nThe Lagos State Government on Friday ordered the indefinite closure of the school and sealed it off pending the outcome of an investigation into the death of Oromoni.\nOdumosu had also ordered the Homicide Section of the State Criminal Investigation Department, Panti, to take over the investigation of the case immediately.\nOromoni’s death is one of the disheartening deaths resulting from bullying and molestations in boarding secondary schools of late."
  },
  {
    "headline": "Osun 2022: Group canvases support for Dele Adeleke, says he is a young, competent leader",
    "summarized_story": "By Sunday Oguntuyi, OsogboA group within Osun State chapter of Peoples Democratic Party, PDP, National Youth League Osun Chapter, on Monday, rose from an extended Exco meeting to call on Bamidele Adeleke to join the Osun State Gubernatorial race come 2022.\nThis call is coming on the heels of demands by the Soro Soke Generation for a Governor who is passionate about the development of Osun State.\nThe Group State Coordinator, Hon.\nEmmanuel said, “Today’s Osun has witnessed a high level of insecurity, unemployment, youth restiveness and acute borrowing, which has derailed our great State.\nHis last performance in 2018 Gubernatorial election, where he was the lead strategist for Sen. Ademola Adeleke, the PDP flag bearer remains unforgettable."
  },
  {
    "headline": "Death toll in Kano boat mishap rises to 42",
    "summarized_story": "A total of 42 persons have died in boat mishap that occurred in Bagwai, Kano State, Nigeria.\nThe boat conveying 49 passengers, mostly pupils of Madinatu Islamiyya School from Badau village to Bagwai, capsized on Tuesday last week.\nThe pupils were heading to Bagwai to participate in Maulud celebration when the accident happened.\nTwenty-nine bodies were earlier recovered while seven persons were rescued alive."
  },
  {
    "headline": "Kwara Gov Stands Out In Women Emancipation – Aisha Buhari",
    "summarized_story": "The First Lady, Mrs Aishat Buhari, on Tuesday, poured encomiums on Kwara State governor, AbdulRahaman AbdulRazaq, for advancing the cause of women.\nMrs Buhari spoke in Ilorin, the state capital at an event titled “Cracking The Glass Ceiling: The Story Of Kwara Women” to celebrate the social, cultural, economic and political contributions and achievements of Kwara women.\n“Today, I’m a witness to the great work the Kwara Governor has been doing, especially with regards to women emancipation,” Mrs Buhari said.\nIt gladdens my heart that Kwara women are doing well in all spheres.\nWe thank him for advancing the cause of women.”She also commended the wife of the Kwara State governor, Mrs Olufolake AbdulRazaq, for her interest in the wellbeing of Kwara women."
  },
  {
    "headline": "Kwara Gov Stands Out In Women Emancipation – Aisha Buhari",
    "summarized_story": "The First Lady, Mrs Aishat Buhari, on Tuesday, poured encomiums on Kwara State governor, AbdulRahaman AbdulRazaq, for advancing the cause of women.\nMrs Buhari spoke in Ilorin, the state capital at an event titled “Cracking The Glass Ceiling: The Story Of Kwara Women” to celebrate the social, cultural, economic and political contributions and achievements of Kwara women.\n“Today, I’m a witness to the great work the Kwara Governor has been doing, especially with regards to women emancipation,” Mrs Buhari said.\nIt gladdens my heart that Kwara women are doing well in all spheres.\nWe thank him for advancing the cause of women.”She also commended the wife of the Kwara State governor, Mrs Olufolake AbdulRazaq, for her interest in the wellbeing of Kwara women."
  },
  {
    "headline": "Aung San Suu Kyi Sentenced To 2 Years In Jail",
    "summarized_story": "A court in military-ruled Myanmar has sentenced deposed leader Aung San Suu Kyi to two years in prison after convicting her on charges widely dismissed as politically motivated.\nIt is not clear where Aung San Suu Kyi has been held but she has not described it as a prison.\nZaw Min Tun, a spokesman for Myanmar’s military told the AFP news agency on Monday that Aung San Suu Kyi was found guilty of incitement and of violating COVID-19 rules.\nAung San Suu Kyi has denied all the charges.\nWestern states have demanded Aung San Suu Kyi’s release and condemned the violence since the coup."
  },
  {
    "headline": "Aung San Suu Kyi Sentenced To 2 Years In Jail",
    "summarized_story": "A court in military-ruled Myanmar has sentenced deposed leader Aung San Suu Kyi to two years in prison after convicting her on charges widely dismissed as politically motivated.\nIt is not clear where Aung San Suu Kyi has been held but she has not described it as a prison.\nZaw Min Tun, a spokesman for Myanmar’s military told the AFP news agency on Monday that Aung San Suu Kyi was found guilty of incitement and of violating COVID-19 rules.\nAung San Suu Kyi has denied all the charges.\nWestern states have demanded Aung San Suu Kyi’s release and condemned the violence since the coup."
  },
  {
    "headline": "C/River To Vaccinate 900,000 Children Against Polio",
    "summarized_story": "Cross River State government has unveiled plan to vaccinate 900,000 children against polio.\nThe exercise will be carried by the state Primary Healthcare Development Agency.\nWe are told that Cross River State and Benue have shown the signs of having the virus.\nIn her remarks, the director-general, Cross River State Primary Healthcare Development Agency, CR- PHCDA, Dr Janet Ekpeyong urged parents residing in the state to make their children available for vaccination to avoid being paralyzed.\nADVERTISEMENTThe chairman of the Cross River State Women Medical Doctors, Vivian Mesembe Otu, stated that 50 per cent of children in the state have been vaccinated, stressing that statistics available still showed that a lot of children were yet to be vaccinated."
  },
  {
    "headline": "Fuel price hike: Anxiety as labour puts members on the alert",
    "summarized_story": "The Nigeria Labour Congress (NLC) yesterday put its members on alert over a likely hike in pump price.\nThe Congress warned that Organised Labour would not fold its hands and watch the Federal Government push more Nigerians below the poverty line.\nThe Federal Government last month hinted at a possible fuel hike given the heavy burden of subsidy on the government.\n“Remember when the Organised Labour submitted a list of the working poor of 50,000 persons on request to the Ministry of Humanitarian Affairs.\nI am not happy with Organised Labour again."
  },
  {
    "headline": "Fuel price hike: Anxiety as labour puts members on the alert",
    "summarized_story": "The Nigeria Labour Congress (NLC) yesterday put its members on alert over a likely hike in pump price.\nThe Congress warned that Organised Labour would not fold its hands and watch the Federal Government push more Nigerians below the poverty line.\nThe Federal Government last month hinted at a possible fuel hike given the heavy burden of subsidy on the government.\n“Remember when the Organised Labour submitted a list of the working poor of 50,000 persons on request to the Ministry of Humanitarian Affairs.\nI am not happy with Organised Labour again."
  },
  {
    "headline": "Crisis brews as US announces diplomatic boycott of 2022 Beijing Olympics",
    "summarized_story": "The United States has announced plans to stage a diplomatic boycott of the upcoming Winter Olympics in Beijing over China’s “egregious” rights abuses, a move the Chinese government has already said would be met with “firm countermeasures”.\nThe White House on Monday said the US would not send an official delegation to the games in protest against Chinese human rights abuses, including Beijing’s treatment of Muslim Uighurs in its western Xinjiang region.\n“The Biden administration will not send any diplomatic or official representation to the Beijing 2022 Winter Olympics and Paralympic Games given the [People’s Republic of China’s] ongoing genocide and crimes against humanity in Xinjiang, and other human rights abuses,” White House press secretary Jen Psaki told reporters.\n“US diplomatic or official representation would treat these Games as business as usual in the face of the PRC’s egregious human rights abuses and atrocities in Xinjiang – and we simply can’t do that,” said Psaki.\nThe administration has said that Biden intends to use the gathering “to announce both individual and collective commitments, reforms, and initiatives to defend democracy and human rights at home and abroad”.VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Crisis brews as US announces diplomatic boycott of 2022 Beijing Olympics",
    "summarized_story": "The United States has announced plans to stage a diplomatic boycott of the upcoming Winter Olympics in Beijing over China’s “egregious” rights abuses, a move the Chinese government has already said would be met with “firm countermeasures”.\nThe White House on Monday said the US would not send an official delegation to the games in protest against Chinese human rights abuses, including Beijing’s treatment of Muslim Uighurs in its western Xinjiang region.\n“The Biden administration will not send any diplomatic or official representation to the Beijing 2022 Winter Olympics and Paralympic Games given the [People’s Republic of China’s] ongoing genocide and crimes against humanity in Xinjiang, and other human rights abuses,” White House press secretary Jen Psaki told reporters.\n“US diplomatic or official representation would treat these Games as business as usual in the face of the PRC’s egregious human rights abuses and atrocities in Xinjiang – and we simply can’t do that,” said Psaki.\nThe administration has said that Biden intends to use the gathering “to announce both individual and collective commitments, reforms, and initiatives to defend democracy and human rights at home and abroad”.VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Dowen College update: Police arrest 3 students mentioned by Oromoni",
    "summarized_story": "Three of the five students of Dowen College, Lekki Lagos, accused by late schoolboy Sylvester Oromoni of torturing him, have been arrested.\nLagos State Commissioner of Police Hakeem Odumosu said on Channels Television on Tuesday that the arrested students are assisting the police in their investigation into the death of Oromoni.\nThe police boss explained that the Command is set to go for the post mortem of the body in Delta state to ascertain the cause of death.\nHis story sharply contradicted the school authorities’, which said the 12 year-old boy was injured on the football pitch.\nThe Lagos government, amid public outrage, has shut the school and the police have also moved in to investigate the matter."
  },
  {
    "headline": "Peruzzi acquires Mercedes Benz (video)",
    "summarized_story": "Nigerian singer, Tobechukwu Victor Okoh, popularly known as Peruzzi has gifted himself with a Mercedes Benz GLE for his birthday.\nThe music star who celebrated his 32nd birthday on Sunday, December 5, 2021, decided to celebrate his birthday in style by buying himself a brand new Mercedes Benz.\nThe ‘Somebody Baby’ crooner also shared a hint of the new car purchase on his Instastory as he expressed appreciation to his car dealer for making a prompt delivery of exactly what he wanted.\nAlso, the car dealer also shared a series of videos of the moment the luxury automobile was delivered to the 30 BG superstar at his Lagos residence.\nAn excited Peruzzi could be seen stepping into his new whip to check out its cool features."
  },
  {
    "headline": "BREAKING: Dowen College Parents Demand Change Of School Management, Hostel Teachers, Organise Candlelight For Late Sylvester",
    "summarized_story": "“As parents of Dowen college students, we are still in shock and could not come to terms with this incident and the accounts so far provided by the school,students, and the media.\n“We therefore earnesly ask for a resolution that will bring some relief to the bereaved family, other parents, students of Dowen College and the public.\nDetails of which are as follow: Wednesday, December 8, 6pm; Dowen College.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students of Dowen College.\nThe Management of Dowen College in a statement had claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "BREAKING: 3 Dowen College Students Arrested Over Oromoni’s Death",
    "summarized_story": "Three students from Dowen College, Lekki Lagos, have been arrested by the Lagos Police Command for their suspected involvement in the death of Sylvester Oromoni junior, a 12-year-old student at the college.\nHakeem Odumosu, the Lagos State Commissioner of Police, made the announcement on Tuesday.\nLast week, Sylvester’s 12-year-old story became viral after a family member took to social media to demand justice.\nSylvester was allegedly assaulted by some senior Dowen College students, according to a family member who goes by the name @Perrisonoromoni on Twitter.\nOromoni jr was also seen writhing in anguish in a video posted online by a family member."
  },
  {
    "headline": "IPOB: Anger As Sit-At-Home Order Grounds Commercial Activities In Onitsha",
    "summarized_story": "Residents of Onitsha, Anambra State, decried the impact of the outlawed Indigenous People of Biafra in the South East’s sit-at-home order on Monday.\nDespite the fact that IPOB had halted the order, our correspondent reported that schools, stores, banks, offices, and automobile parks were closed on Monday, and main highways were vacant.\nUdeh said, “Onitsha is the commercial centre of Anambra and the continued closure of commercial activities every Monday is having a huge effect on the state.\nThe government cannot force anybody to go to his business place.”Also, the state Police Public Relations Officer, DSP Ikenga Tochukwu, urged the people to ignore the sit-at-home order.\nEfforts to get the spokesperson for IPOB, Emma Powerful, proved abortive as several calls to his phone line rang out."
  },
  {
    "headline": "Nnamdi Kanu Starving In DSS Facility — Younger Brother Raises Alarm",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB), has claimed that he is being deprived meals at a Department of State Service facility (DSS).\nPrince Kanu Meme was paying an usual visit to Nnamdi, the imprisoned separatist leader.\nDespite repeated court rulings forcing the Nigerian government to provide him with the medical report, the pro-biafra leader expressed regret for the DSS’s actions.\nThe statement by the younger brother partly read, “Just visited the Alpha Mazi Nnamdi Kanu, at the Department of State Security Services Abuja.\n“As if that wasn’t enough, DSS had also denied him his medical report after taking his blood for more than 21 times."
  },
  {
    "headline": "Breaking: Police arrest 3 Dowen college students over Oromoni’s death",
    "summarized_story": "Three students of Dowen College Lekki are about now being interrogated by the Lagos state police command over the death of Sylvester Oromoni Jnr.\nThe Lagos state commissioner of police, Hakeeem Odumosu, confirmed that three out of the five names mentioned by the late Oromoni are being quizzed.\nHowever, CP Odumosu was silent on the wayabout of the other two students.\nDowen college has been in the news since the demise of Oromoni Jnr following an alleged bully inflicted on him before his death.\nDetails loading…"
  },
  {
    "headline": "FG to UK on OMICRON: Travel ban on Nigeria lacks common sense, not science-driven",
    "summarized_story": "The federal government Monday accused the United Kingdom of bias by adding Nigeria to the red list which bans Nigerians from travelling to the UK over the outbreak of Omicron COVID variant.\nNigeria became the latest country to be added to the UK’s travel ‘red list’ Monday, with all 11 others on the list located in Africa.\nBy the red list, the only people allowed to enter the UK from them are UK or Irish nationals and residents.\n“We sincerely hope the British government will immediately review the decision to put Nigeria on its red list and rescind it immediately.\n”As a result of the UK Government placing Nigeria on to the red list, we continue to closely monitor the situation and adjust our schedule accordingly."
  },
  {
    "headline": "Abuja, Nasarawa, Edo, 2 other states plunged in darkness as electricity workers shut facilities",
    "summarized_story": "Abuja, the nation’s capital city and its suburbs, were Monday thrown into darkness following the shutting down of distribution facilities by the protesting electricity workers for hours.\nA statement by the Transmission Company of Nigeria said the evacuation of bulk power from electricity substations was disrupted following a shutdown of the facilities belonging to the Abuja Electricity Distribution Company (AEDC) by the company’s in-house workers’ union.\nListed in the areas under AEDC franchise were Abuja, Nasarawa, Kogi, parts of Edo and Niger states.\n“We would like to assure all our customers that all hands are on deck to resolve the issues that prompted this action.\nWe would also like to apologize to our customers for the inconvenience and disruption”, the statement said."
  },
  {
    "headline": "Sylvester Oromoni: Three Dowen Students Are Currently In Police Custody – Odumosu",
    "summarized_story": "Three students of the Dowen College, Lekki Lagos are currently assisting the police in their investigation into the death of Sylvester Oromoni junior, a 12-year-old student of the college, the Lagos State Commissioner of Police Hakeem Odumosu told Channels Television on Tuesday.\nThe letter was dated December 6, 2021, signed by Taiwo Olawale, and addressed to the chief coroner, High Court of Lagos State.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students pf Dowen College.\nAlso, in a video released online by the family member, Oromoni jr was seen writhing in pain.\nThe Management of Dowen College in a statement claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "Travel Ban: Tomori Goes Emotional, Says Nigeria Paying For Overlooking Errors Of Omission",
    "summarized_story": "The COVID-19 pandemic and other disease outbreaks in Nigeria are nothing compared to the real enemies of the country, said Professor Oyewale Tomori.\n“Our underdevelopment and backwardness rest on four pillars – they are the real enemies of our nation.\n“Anytime I think of Nigeria, I have Nigeria on my mind,” an emotional Tomori sobbed.\nWe painfully call the reactions of the UK and Canada racism, inequity, but I say we are paying for condoning our errors of commission and overlooking our errors of omission.\n“Mr President, the generation of Nigerians we have today is much smarter than my generation."
  },
  {
    "headline": "Omicron: UK Red Listing Nigeria Is Unjust, Discriminatory – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Lai Mohammed, has condemned the red listing of Nigeria by the UK government over the two cases of the omicron variant of COVID-19.\nSpeaking at a news conference in Abuja, Mr Mohammed described the decision as unjust and discriminatory.\n[Read Also] Omicron: FG Expresses Disappointment Over UK Govt’s Red Listing Of NigeriaLai Mohammed’s comments are the latest reactions to the red listing which has continued to stir debates in Nigeria and across the world.\nEarlier, the Minister of Health, Dr Osagie Ehanire, expressed disappointment over the United Kingdom government’s placement of Nigeria on its red list following the detection of the COVID-19 Omicron variant.\n“From what we know about the COVID-19, there are many ways to manage it, and besides, not much is still known about the Omicron variant."
  },
  {
    "headline": "Police Begin Probe As Eight Children Die In SUV",
    "summarized_story": "The Lagos State Police Command said it is investigating the death of eight children, whose bodies were recovered in a Lexus Sport Utility Vehicle (SUV) van in the Badagry area of Lagos State.\nSpokesman of the Lagos State Police Command, CSP Adekunle Ajisebutu, confirmed the incident to Channels Television via a statement.\nCSP Ajisebutu noted that their bodies were found locked in the vehicle parked on Adelayo Street in the Jah-Michael area of Badagry.\n“Notwithstanding the report made to the Police, the Commissioner of Police, CP Hakeem Odumosu, has ordered a thorough and speedy investigation into the circumstances surrounding their death.”Multiple reports suggest that the car had a child lock feature and could only be opened from outside.\nThe children, mostly between four and six years old, were reportedly found dead when a parent was looking for her child."
  },
  {
    "headline": "S.Africa Economy Shrinks After Riots, COVID-19 Measures",
    "summarized_story": "South Africa’s economy shrank for the first time in a year in the third quarter as the country was hit by riots and tighter Covid restrictions, official statistics showed Tuesday.\nAfter four consecutive quarters of growth, the economy contracted by 1.5 percent between July and September compared to the previous three-month period, the Stats SA agency said.\nThe economy underperformed “under the twin pressures of tighter Covid-19 lockdown restrictions and a spate of civil disorder in July, as well as several other headwinds”, the agency said.\nThe country, worst-hit by Covid in Africa also tightened coronavirus restrictions that month to tackle a third wave of infections.\nThe economy contracted by a record 6.4 per cent in 2020, but rebounded faster than expected during the first half of this year."
  },
  {
    "headline": "I don't see anything wrong In Sanwo-Olu's Peace Walk initiative",
    "summarized_story": "In this interview, Babajide Kolade-Otitoju shares his views on the peace walk suggested by the Lagos State Governor, Babajide Sanwo-Olu.\nThe veteran journalist added that the move by the state governor is a good one, that is geared towards healing the wounds created by the unfortunate incident of October 20, 2020."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Low turnout as Ekiti residents vote to elect Council chairmen, Councillors -",
    "summarized_story": "There was low turn-out of voters today at the Local Government Elections held in Ekiti State to determine which party will Pilot the affairs of the 16 LGA, and 20 LCDAs for the next two years.\nTVc monitored the Election around the State and reports that asides the fact that Vehicular Movement was restricted, the Voting Exercise was largely PeacefulIn most Polling units visited ,voters didn’t turn up until 10am, and before 12pm,the exercise has been concluded as party agents were nowhere to be found in most of the Wards and Units.\nThe Creation of 20 LCDAs had generated Controversies of its own in the last few months, and it is yet to be seen how the meagre resources available to Ekiti State will be able to take care of 36 Local Councils altogether."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Buhari’s Failure to Implement 2014 Confab Report a Terrible Mistake, Jerry Gana Says",
    "summarized_story": "A former Minister of Information and Culture, Professor Jerry Gana, has described the failure of President Muhammadu Buhari-led administration to implement the 2014 National Conference report “as a terrible mistake”.\n“We, in the middlebelt of Nigeria, are great lovers of peace, justice and fairness.\nThe last administration convened a national conference in 2014 and we agreed on some certain fundamentals to ensure justice and fairness.\nLet me appeal to the federal government to promote peace, equity and justice.\nThe Youth Arise Nigeria Conference with large turnout in attendance from within and Outside Delta was put together by Advocates of Paradigm Shift in Governance."
  },
  {
    "headline": "UK Fails to Red List 17 European Countries Despite Recording Omicron",
    "summarized_story": "Following its discovery at the end of November, the variant has now been detected in at least 48 countries, with 17 of them in Europe, according to the World Health Organisation (WHO).\nAs of Monday, Austria had reported 10 cases of the new disease variant, while Croatia and Denmark had reported two and 18 cases respectively.\nSimilarly, other European countries that had reported omicron on their soil included Netherlands with a total of 18 cases as of yesterday; Norway – 19 cases; Portugal – 34; Belgium – nine and Luxembourg with just one case.\nUK’s failure to red list its European allies reinforces the suspicion that African countries are being targeted by the Western world.\nThe racist undertone becomes even more obvious considering the speed of the action against African countries and the deliberate attempt to tag the virus an African virus."
  },
  {
    "headline": "Nigeria’s Parliament to ‘Ensure Judicious Use’ of Covid Funds, Says Senate President Lawan",
    "summarized_story": "President of the Senate, Dr. Ahmad Lawan has given assurance that the National Assembly would provide resources in 2022 budget for the battle against COVID-19 pandemic while insisting on judicious use of the funds.\nHe commended the PSC for the great work it had done in effectively coordinating and mounting a formidable national response to this emergent global public health threat.\n“The NASS proactively reviewed the Medium-Term Expenditure Framework (MTEF) and the 2020 national budget in order to sufficiently fund the national response to the pandemic and to provide economic stimulus packages for Nigerians.\n“In addition, after meticulous scrutiny, the Assembly gave approvals for various loans requested by the Executive to fund the 2020 national budget.\n“The Executive was engaged on the implementation of the Social Intervention Programme (SIP) in response to the needs of the citizenry."
  },
  {
    "headline": "Omicron: UK Under Fire for Travel Apartheid against Nigeria",
    "summarized_story": "The UK has now joined other countries, including Canada, which have taken a similar action against Nigeria over Omicron.\nHe also raised eyebrows against the UK government action, insisting Omicron did not originate in Nigeria.\nLatest figures from the UK government on its website revealed that 21 cases of omicron reported in England were linked to travel from Nigeria.\nThe season for this kneejerk reaction is bad for air travel and tourism business for UK, and for Nigeria.\nHe said that diplomatic relations was guided by the principle of reciprocity, noting that Nigeria could ban UK nationals but not British Carriers, as UK did not ban Nigerian carriers, but Nigerian citizens."
  },
  {
    "headline": "Nigeria: Northern Groups Endorse Anyim as South East Candidate for 2023 Presidency",
    "summarized_story": "Some Northern civil society groups under the umbrella of Arewa Concerned Civil Society Organisations of Nigeria (ACCSON), have endorsed the Presidential ambition of a former Senate President, Pius Anyim.\nAddressing a press conference on Monday in Kaduna, spokesman of the group, Abdulsalam Kazeem, said the the next President should come from the south east, maintaining that Anyim is the best candidate for the job.\n“For instance; between 1999 to 2007, it was South West and North East, and between 2007 to 2015 it was between North West, South South and North West while between 2015 till date it is between North West and South West!\n“Consequently, we hereby urge all political parties to zone their presidential ticket to the South East for justice, equity and fairness”, Kazeem added.\n“As a former Senate President, history has it that before his emergence as the President of the Senate, the Senate was a troubled institution."
  }
]