[
  {
    "headline": "FG directs fleeing Nigerians to head for Romania, Hungary",
    "summarized_story": "Russian President, Vladimir Putin, in the early hours of Thursday, ordered an invasion of Ukraine.\nHowever, the core requirements for admission into Hungary from Ukraine included a valid Nigerian passport and a Ukrainian resident permit.\n“Consequently, arrangements are underway for the transportation of Nigerian nationals, to enable them to stabilise.\nAccording to the Nigerian Ministry of Foreign Affairs, there were no fewer than 5,600 Nigerians resident in Ukraine, the majority of whom are students.\nIn a video of him on Sunday during a meeting with security chiefs, the Russian President hinged the decision on “unfriendly” economic sanctions against Russia."
  },
  {
    "headline": "Increasing coups in West Africa disturbing, says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Sunday in Arusha, Tanzania, said that sanctioning coup plotters without proper implementation mechanisms has not been effective in curbing unconstitutional change of power experienced in Africa.\nHe described a situation where West Africa experienced four cases of coups d’état in one year as disturbing “because we felt we had put those things behind us.”Osinbajo spoke during a bilateral meeting with his Tanzanian counterpart, Dr Philip Mpango, on his arrival in Tanzania for the inaugural session of the African Court of Human and Peoples’ Rights for 2022.\nHe said, “We in ECOWAS have experienced in just under a year, four coups d’état including attempts, and it is disturbing because we felt we had put those things behind us, and now they seem to be coming back.\nAU has been very forthcoming (in condemnation) in saying that we cannot tolerate unconstitutional seizures of power.\nWe need to come together to oppose any situation where the wealthier countries insist on going towards net-zero emissions in 2050.”Copyright PUNCH."
  },
  {
    "headline": "Nollywood Celebrities Shipping Steadily",
    "summarized_story": "Still, in the spirit of Valentine, we celebrate some of Nollywood celebrity couples, whose marriages have endured and who, remain an inspiration to the rest of us.\nMercy and Odi OkojieNot many gave Nollywood star actress, Mercy Johnson’s marriage to Prince Odi Okojie a chance, back in 2011.\nOlu and Joke JacobsThis Nollywood power couple has been married for over 30 years, and still going strong.\nYears in the spotlight haven’t come between the Nollywood A-list actress and her pilot husband, with whom she has four children.\nWhile she may be successful in her career, she has equally drawn attention for being one of the celebrities who have proven that a celebrity marriage can last long."
  },
  {
    "headline": "Nollywood Celebrities Shipping Steadily",
    "summarized_story": "Still, in the spirit of Valentine, we celebrate some of Nollywood celebrity couples, whose marriages have endured and who, remain an inspiration to the rest of us.\nMercy and Odi OkojieNot many gave Nollywood star actress, Mercy Johnson’s marriage to Prince Odi Okojie a chance, back in 2011.\nOlu and Joke JacobsThis Nollywood power couple has been married for over 30 years, and still going strong.\nYears in the spotlight haven’t come between the Nollywood A-list actress and her pilot husband, with whom she has four children.\nWhile she may be successful in her career, she has equally drawn attention for being one of the celebrities who have proven that a celebrity marriage can last long."
  },
  {
    "headline": "Stanley & Blessing Nze: Love Made In Nollywood",
    "summarized_story": "By Rita OkoyeIn September 11, 2021, Nollywood actor, Stanley Ebuka Nzediegwu, otherwise known as Stan Nze and his colleague, Blessing Jessica Obasi, walked down the aisle in a glamorous ceremony witnessed by family and friends.\nIn celebration of Valentine’s Day today, the couple shares their love story, sweetly made in Nollywood against all odds.\nStanley Nze: I’ve always known I’d marry an entertainerWhat first attracted you to your wife?\nI’m still not great at it, but I think I’m getting better, and there’s always room for improvement.\nBlessing Nze: Age is just a numberThis is your first Valentine season as a married couple, how does it feel to be in love?"
  },
  {
    "headline": "Stanley & Blessing Nze: Love Made In Nollywood",
    "summarized_story": "By Rita OkoyeIn September 11, 2021, Nollywood actor, Stanley Ebuka Nzediegwu, otherwise known as Stan Nze and his colleague, Blessing Jessica Obasi, walked down the aisle in a glamorous ceremony witnessed by family and friends.\nIn celebration of Valentine’s Day today, the couple shares their love story, sweetly made in Nollywood against all odds.\nStanley Nze: I’ve always known I’d marry an entertainerWhat first attracted you to your wife?\nI’m still not great at it, but I think I’m getting better, and there’s always room for improvement.\nBlessing Nze: Age is just a numberThis is your first Valentine season as a married couple, how does it feel to be in love?"
  },
  {
    "headline": "Ruger: Man of Dior",
    "summarized_story": "Words By – Rita OkoyeMichael Adebayo Olayinka popularly known as Ruger, is a Nigerian Afrobeat singer, and songwriter.\nThe Song Dior is for ballers, every hustler, everyone who loves luxury and wants to enjoy life.\nSince then, it’s been work, work, family, learning, putting in the work, having the knowledge that the goal is to go make it big and it’s been bliss since then.\nI’ve also learnt Hard work, putting in the work irrespective of what anyone is saying, just do your work.\nNo pressure, I’m enjoying myself."
  },
  {
    "headline": "Verify lands in Lagos before paying – Nigerian govt warns buyers",
    "summarized_story": "The Federal Government of Nigeria (FGN) has advised persons interested in buying lands in Lagos State to carry out a thorough verification.\nThe official urged the media to embark on awareness campaign against grabbers, complaining that they sold-off gazetted FGN lands in the state.\nAdejobi advised citizens to always check lands with with federal and state government agencies before purchase.\nShe said grabbers ignore compensations paid to their fathers, encroach on gazetted government lands and fraudulently sell the same to multiple buyers.\nEven learned people fall victims to these land grabbers."
  },
  {
    "headline": "We have rounded up bandits that attacked Bida Emirate, neutralized eight – Niger govt",
    "summarized_story": "The Niger State Government has revealed that security personnel in the state have rounded up bandits that invaded several communities in Bida Emirate.\nIt also stated that so far, about eight of the bandits have been neutralized, even as others are holed up by the bank of River Kaduna.\n“The security and local vigilantes engaged the bandits in a gun battle during which eight bandits were killed.\nThey moved over to Laun and Kutigi local governments and to the flanks of river Kaduna up to Dabban community.\n“They are currently rounded up in the area and we hope to neutralise them,” the commissioner further explained."
  },
  {
    "headline": "Leave Oni out of your obnoxious tax – SOM tells Fayemi",
    "summarized_story": "The attempt by the Ekiti State governor, Dr Kayode Fayemi to shift the blame of his new tax policies on the former governor, Segun Oni has been described as preposterous and ignominious.\nThis was contained in a statement made available to journalists in Ado Ekiti during the weekend by the Director of Media and Publicity, Segun Oni Movements, Jackson Adebayo.\nThe land use charge covers all residential and commercial property owned in Ado Ekiti metropolis and Ikere Ekiti, which are the commercial hubs of the state.\nAccording to the movement, in an attempt to ringle out of the protest the government decided to blackmail the then Segun Oni government of initiating the policy before he was removed.\n“We want to state categorically that at no time did Oni ever contemplated imposing any additional tax during his tenure talk less of such an unbearable tax like this,” he said."
  },
  {
    "headline": "Ortom directs construction of classroom block, bridge at rice mill, Gboko",
    "summarized_story": "Benue State Governor, Samuel Ortom, has directed the Executive Chairman of Gboko LGC, Hon James Kachina, to immediately construct a bridge at Adi, linking rice mill community Gboko, using ecological funds.\nSimilarly, Governor Ortom has also directed the State Universal Basic Education Board, SUBEB, to construct a block of three classrooms at St Theresa’s Primary School Gboko and furnish same with plastic desks and chairs.\nThe Governor gave the directives Sunday, in Gboko during a thanksgiving service in honour of Commissioner for Health and Human Services, Prof Joseph Ngbea, held at St Theresa’s Catholic Church, Rice Mill, Gboko.\nGovernor Ortom, who gave the directives following requests by the Parish Priest of St. Theresa’s Catholic Church, Rice Mill, Gboko West, Rev Fr Jacob Tondu, also donated money for replacement of the roof at the Church.\nFirst Lady of Benue State and wife of the Governor, Dr Mrs Eunice Ortom, selected elders and wives of prominent government appointees also accompanied the Governor on the thanksgiving service."
  },
  {
    "headline": "Osun govt vows to smoke out criminals, end cult clashes, killings",
    "summarized_story": "Disturbed by the spate of killings resulting from cult clashes in some areas of the Osun State, the state government has vowed that it will stop at nothing to ensure those perpetrating violence are made to pay for their actions along with their sponsors.\nThis followed recent instances of cult-related violence in Ilesa and Ede towns.\nAccording to the statement, “The current spate of killings in Ilesha and Ede are cult-related, and the security architecture of the state has briefed the Governor.\n“We urge for calm in the affected communities as efforts are on to smoke out the perpetrators of violence along with their sponsors.\nRecall that the Timi of Ede, Oba Munirudeen Lawal, recently raised alarm over the spate of killings by hoodlums in the town, calling for urgent government intervention."
  },
  {
    "headline": "Commissioner hails residents’ synergy with security agencies",
    "summarized_story": "Edo State Commissioner for Communication and Orientation Adaze Emwanta has hailed residents’ synergy with security agencies, to ensure the state remains unsafe for criminals.\nHe urged more youths to key into the community-driven security architecture of the Governor Godwin Obaseki administration.\nThis explains why Governor Obaseki has designed the state’s security architecture with community participation and inter-agency collaboration as the focus.\nThe robbers had to abandon some of the stolen money, vehicles and other items and fled the towns on motorcycles.\nWe are seeing the results, as demonstrated by our people in Uromi, Ubiaja and elsewhere, who liaise with the government and security agencies daily to keep our communities safe."
  },
  {
    "headline": "Why I want to be Rivers governor, by Lulu-Briggs",
    "summarized_story": "Former governorship candidate in Rivers State, Chief Dumo Lulu-Briggs, has said his administration will put food on people’s table if he becomes the governor after the 2023 general election.\n“Rivers State is blessed with many capable hands.\nRivers State is a microcosm of Nigeria.\nWhat’s good in Rivers State is also very good in Nigeria.\n“Also here in Rivers State, I think it is time for the riverine to have a shot."
  },
  {
    "headline": "Fed Govt lists February savings bonds on NGX",
    "summarized_story": "The Federal Government at the weekend listed its latest monthly issuance of savings bonds on the Nigerian Exchange (NGX), paving the way for investors to trade on the bonds issued earlier this month.\nThe two bonds were continuation of the monthly Federal Government of Nigeria (FGN) Savings Bonds (FGNSBs).\nThe February 2022 issuances were the 56th tranche of the savings bond, introduced in 2017.\nGTI Securities noted that the savings bonds are acceptable as collateral for loans by banks and can be sold for cash in the secondary market before maturity.\nSavings bonds are good for savings towards retirement, marriage, school fees and house projects among other targets while assuring on its safety as the bonds are backed by the full faith and credit of the Federal Government of Nigeria."
  },
  {
    "headline": "Russia-Ukraine war poses double risks for Nigeria’s economy",
    "summarized_story": "Experts yesterday agreed that despite the steep rise in crude oil price and Nigeria’s position as a major crude oil exporter, Nigeria’s economic structure makes it more prone to the negative effect of the ensuing crisis.\nExperts expressed worries that rather than benefiting optimally from the surging crude oil prices, the inherent distortions in the Nigerian economy may worsen and topple the fragile economic condition.\nChief Executive Officer, Centre for the Promotion of Private Enterprise, Dr. Muda Yusuf, said rather than a blessing, the rising global crude oil price is a “penalty” for the economy.\n“The rising oil price cannot be celebrated by Nigeria because it penalises the Nigerian economy and this is a paradox.\nRather than benefit from the rising oil price, we are going to be penalised by it."
  },
  {
    "headline": "Ebonyi Assembly crisis bizarre, says Anyim",
    "summarized_story": "Ex-Secretary to the Government of the Federation Anyim Pius Anyim has reacted to the crisis in Ebonyi State House of Assembly.\nAnyim also spoke about the statement of Peoples Democratic Party (PDP), Ebonyi State chapter spokesman, Nwoba, from detention.\n“Nwoba’s ordeal is only one of the many cases of intimidation of the opposition or any person that holds dissent opinion in Ebonyi State,” he said.\nAnyim, a presidential aspirant under the Peoples Democratic Party (PDP), described the Assembly’s actions as bizarre.\n‘If the Assembly and their master care, they can declare the whole of the House vacant."
  },
  {
    "headline": "Russia-Ukraine crisis: Hungary, Romania approve visa free access to Nigerians",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Hungarian Government and the Government of Romania, have approved visa free access to Nigerians fleeing Ukraine.\nThe Permanent Secretary, Ministry of Foreign Affairs, Ambassador Gabriel Aduda, disclosed the development in a statement issued in Abuja.\nAduda stated that Nigerians leaving Ukraine should move to the Hungarian Zahony border and Romanian Suceava, Tulcea, Satu Mare County and Maramures borders as they have approved visa free access to all Nigerians coming from Ukraine.\n“For now, movement to the Hungarian Zahony border and Romanian Suceava, Tulcea, Satu Mare County and Maramures borders is advised, as they have approved visa free access to all Nigerians coming from Ukraine and arrangements for accommodation and feeding before evacuation is arranged,” Aduda said.\nAduda further encouraged parents, guardians and wards of Nigerians in Ukraine to remain calm, saying that the Federal Government is working very hard to get them all home safely."
  },
  {
    "headline": "Gunmen kill 9 mourners in Benue",
    "summarized_story": "From Rose Ejembi, MakurdiAt least, nine persons have been reportedly killed by yet to be identified gunmen in Mbacher Council Ward of Katsina-Ala Local Government area of Benue State on Saturday.\nSpeaking to newsmen by telephone on Sunday, Chairman of Kastina-Ala LGA, Alfred Atera confirmed the killing saying nine persons were killed during the attack.\n“The gunmen only wanted to make a statement by storming that burial and killing people.\nIn fact, one of the in-laws from Vandeikya who provided the coffin for the burial of the deceased man was sadly gunned down by the invading gunmen.\n“They have just made up there minds that they are going to make the place unsafe to law abiding citizens ."
  },
  {
    "headline": "Gunmen on rampage in Niger communities, kill eight, injure two",
    "summarized_story": "From John Adams, MinnaGunmen numbering well over 100 on Saturday invaded some communities in Lavun local government area of Niger state, killing eight people and injured several others.\nThe attack which last all through to Sunday morning, saw the gunmen overran about eight communities, leaving over 5,000 Displaced.\nCommunities that were ransacked by the gunmen includes Egbako, Ndaruka, Ebbo, Ndagbegi, Tshogi, Gogata and Ndakogitu, all in Lavun local government.\nAccording to source close one of the communities, the gunmen were said to have Killed one person each at Ebbo, Tsonfadagabi, Tsogi and Kanko.\nAccording to another source close to Akere community, the gunmen are currently stranded at the point of crossing with the cattle as the animals refused to enter river."
  },
  {
    "headline": "NCC alerts of malware that steals banking app login details on Android devices",
    "summarized_story": "From Adanna Nnamani, AbujaThe Nigerian Communications Commission (NCC) has warned the public of a newly-hatched malicious software that steals users’ banking app login credentials on Android devices.\nIn reality, however, the app is only a means by which the Xenomorph Trojan could be propagated easily and efficiently.\n‘The CSIRT said the malware also steals victims’ banking credentials by overlaying fake login pages on top of legitimate ones.\nThe Fast Cleaner app has now been removed from the Play Store but not before it garnered 50,000+ downloads,” the CSIRT security advisory asserted,’ NCC said.\nConsumers and other stakeholders are also instructed to always update banking applications to their most recent versions."
  },
  {
    "headline": "Bandits kill 8, abduct 57 in Kaduna",
    "summarized_story": "The statement noted that three other people escaped with mild wounds, while, 57 people were equally abducted.\n‘Today(Saturday) around 10:00 am a final year student of Science Secondary School Birnin-Gwari escaped with bullet wounds on his shoulder while on his way for JAMB -UMTE registration in Kaduna.\n‘The dreadful armed bandits spray bullets on the vehicle conveying the student and others at Manini village after Kuriga along Birnin-Gwari Kaduna Highway.\n‘The student is awaiting surgery for the removal of the bullet on his shoulder at Jibrin Maigwari General Hospital in Birnin-Gwari.\n‘Similarly, armed bandits killed seven people at Unguwar Bula, Unguwar Dafillo and Ijinga in Randagi district, Birnin-Gwari on Saturday."
  },
  {
    "headline": "Primaries Now April 4 to June 3 Ahead of Presidential Poll of Feb 25, 2023",
    "summarized_story": "Under the new timetable for the 2023 general election, INEC has shifted the presidential and National Assembly elections from February 18 to February 25, 2023, while the governorship elections will hold on March 11, 2023.\n“Accordingly, the presidential and National Assembly elections will now hold on Saturday, February 25, 2023, while the governorship and state Houses of Assembly elections will hold two weeks later on Saturday, March 11, 2023.\nWith this adjustment, the 2023 general election is now 363 days away,” he explained.\nThen, he said, the Act was repealed and re-enacted as the Electoral Act 2002 which was in turn repealed and re-enacted in 2006, 2010 and now we have the 2022 Electoral Act.\nHe said the 2023 general election was initially scheduled to commence on February 18, 2023, with the presidential and National Assembly elections, followed by the governorship and state Houses of Assembly elections on March 4, 2023."
  },
  {
    "headline": "In Line with CBN’s Directive, Banks Expose Clients with Suspicious Dollar Transactions",
    "summarized_story": "These customers can beat regulations by presenting false travel documents, prompting the apex bank to direct banks to notify their customers of an impending crackdown on saboteurs in the forex market.\nHowever, a report by Bloomberg yesterday revealed that some banks have begun to implement the CBN’s directives by publishing the names of clients found to have filed suspicious claims for forex transactions on their websites last week.\nThe list of banks that complied also included the United Bank for Africa Plc.\nThe apex bank had directed banks to identify such customers and ensure they refund the hard currency.\n“As reported in the February 11, 2022 edition of our CWR, we observed that money moved out of T-bills securities to Local Money Market Securities (LMMS), especially bank placements,” the report stated."
  },
  {
    "headline": "Purported Endorsement of Consensus Chairman Divides APC Governors",
    "summarized_story": "Chuks Okocha in AbujaThe purported endorsement of a former Governor of Nasarawa State, Senator Abdullahi Adamu, as the consensus National Chairman of the All Progressives Congress (APC) by President Muhammadu Buhari has further divided the governors elected on the platform of the ruling party, THISDAY has learnt.\nSources privy to the meeting, who spoke to THISDAY, said that the meeting had a one-item agenda, which explained its brief nature.\nThe source told THISDAY that three governors from the North-west, one governor from the South-west, another governor from the South-east and a minister from the South-south were behind the purported adoption of a consensus candidate.\nBoth Al-Makura and Musa had in newspaper advertorial rejected the purported nomination of Adamu.\nEfforts to get the Secretary of the National Caretaker Committee of APC, Senator John Akpanudoedehe to clarify the adoption of Adamu as a consensus national chairman proved abortive as he did not pick his calls."
  },
  {
    "headline": "Seplat Explains Acquisition of ExxonMobil Assets",
    "summarized_story": "He added that Seplat already set up a subsidiary called Seplat Energy offshore limited that would be acquiring the business of MPNU.\nHe noted that Seplat would continue the “excellent performance” of the Mobil business, adding that the new entity has a slightly different plan in terms of cost-efficiency.\nAnd again over the last 10 years, we’ve seen a reduction in costs and losses in Seplat.\nWe have pillar one, which is our upstream oil and gas, business and pillar two business is the midstream gas business, going down into gas power.\n“ We made a decision before to look at the power opportunities and then our new energy, the bridge into renewable energy."
  },
  {
    "headline": "Breaking: INEC Changes 2023 Election Dates, Releases Adjusted Timetable",
    "summarized_story": "* Presidential and National Assembly elections hold Feb 25* Says all 774 local govt areas have telecom coverage* Urges political parties to adhere strictly to new guidelinesChuks Okocha in AbujaWith the signing of the new electoral law by President Muhammadu Buhari Friday, the Independent National Electoral Commission (INEC), Saturday released new dates and time table for the presidential and general election in 2023.\nAddressing a press conference Saturday, the INEC chaìrman, Prof. Mahmood Yakubu, said that the presidential election will now hold on February 25 next year instead of the earlier announced date of February 18.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism",
    "summarized_story": "President Muhammadu Buhari has lamented the ill-treatment being meted out to Nigerian nationals, and citizens of other African countries in Ukraine amid the ongoing war in the country.\nThere have been reports, along with videos of Nigerians being turned back at Ukraine's borders in their attempt to exit the troubled country for neighbouring ones.\nThe majority of Nigerian citizens in the country today are university-enrolled students.\n“There are also separate reports of Polish officials simply refusing Nigerian citizens’ entry into Poland from Ukraine.\n“Nigeria, with our 200 million people, support all and every diplomatic effort to bring this war to an end.”"
  },
  {
    "headline": "BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism",
    "summarized_story": "President Muhammadu Buhari has lamented the ill-treatment being meted out to Nigerian nationals, and citizens of other African countries in Ukraine amid the ongoing war in the country.\nThere have been reports, along with videos of Nigerians being turned back at Ukraine's borders in their attempt to exit the troubled country for neighbouring ones.\nThe majority of Nigerian citizens in the country today are university-enrolled students.\n“There are also separate reports of Polish officials simply refusing Nigerian citizens’ entry into Poland from Ukraine.\n“Nigeria, with our 200 million people, support all and every diplomatic effort to bring this war to an end.”"
  },
  {
    "headline": "BREAKING: 40 Ukrainian Civil Society Groups Sign Kyiv Declaration, Issue Six Appeals To World Leaders",
    "summarized_story": "As the Russia-Ukraine crisis rages on, 40 Ukrainian civil society organisations have issued the Kyiv Declaration, putting six urgent appeals before the international community.\nThis six-point appeal has been signed by 40 Ukrainian civil society organisations in Kyiv and other cities under siege.\nUkrainian Helsinki Group for Human Rights, Oleksandr Pavlichenko4.\nZMINA Centre for Human Rights, Tetyana Pechonchyk7.\nUkrainian Centre for Independent Policy Research, Yuliya Tyshchenko12."
  },
  {
    "headline": "BREAKING: 40 Ukrainian Civil Society Groups Sign Kyiv Declaration, Issue Six Appeals To World Leaders",
    "summarized_story": "As the Russia-Ukraine crisis rages on, 40 Ukrainian civil society organisations have issued the Kyiv Declaration, putting six urgent appeals before the international community.\nThis six-point appeal has been signed by 40 Ukrainian civil society organisations in Kyiv and other cities under siege.\nUkrainian Helsinki Group for Human Rights, Oleksandr Pavlichenko4.\nZMINA Centre for Human Rights, Tetyana Pechonchyk7.\nUkrainian Centre for Independent Policy Research, Yuliya Tyshchenko12."
  },
  {
    "headline": "As Nigerians Languish In Ukraine, India Welcomes Citizens Home, Says Government In Talks With Russia, Ukraine To Bring Everyone Back Safely",
    "summarized_story": "The Indian government has airlifted its citizens from war-ravaged Ukraine, with government officials assuring the people onboard that all Indians would be evacuated from the troubled country.\nWe are in touch with the Ukrainian government and the conversation is on to ensure that everyone is brought back safely.\nSaharaReporters was told on Sunday that people could not move out and Nigerians were already freezing at the borders.\nSee Also International BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism“We are denied exit from Ukraine.\nAt Uzhgorod city (border between Ukraine and Slovakia),” another stranded Nigerian said."
  },
  {
    "headline": "'5 bodies found, unauthorised persons on site' -- SEPCOL provides update on fire incident",
    "summarized_story": "The Shebah Exploration and Production Company Ltd (SEPCOL) says new information on the recent fire on its vessel indicated that unauthorised persons were on site at the time of the incident.\nThe floating production, storage and offloading (FPSO) vessel named ‘Trinity Spirit’ exploded on February 2, with 10 crew members said to be on board.\nAs of February 7, three crew members had been found dead, while three others were rescued.\nAdvertisementGiving an update on the fire incident, Okafor said the company is awaiting forensic identification of five bodies recovered.\nThe bodies have been handed over to the police for due process to establish the identities of the deceased persons."
  },
  {
    "headline": "'5 bodies found, unauthorised persons on site' -- SEPCOL provides update on fire incident",
    "summarized_story": "The Shebah Exploration and Production Company Ltd (SEPCOL) says new information on the recent fire on its vessel indicated that unauthorised persons were on site at the time of the incident.\nThe floating production, storage and offloading (FPSO) vessel named ‘Trinity Spirit’ exploded on February 2, with 10 crew members said to be on board.\nAs of February 7, three crew members had been found dead, while three others were rescued.\nAdvertisementGiving an update on the fire incident, Okafor said the company is awaiting forensic identification of five bodies recovered.\nThe bodies have been handed over to the police for due process to establish the identities of the deceased persons."
  },
  {
    "headline": "Wike: Atiku taking PDP members for granted by assuming he will win presidential ticket",
    "summarized_story": "Nyesom Wike, governor of Rivers, says former Vice-President Atiku Abubakar is taking members of the Peoples Democratic Party (PDP) for granted on the issue of securing the presidential ticket.\nAfter a visit to former President Olusegun Obasanjo on Saturday, Abubakar had expressed confidence that he would win the PDP ticket.\nSpeaking on the development, Wike said the former vice-president went too far with his comment.\n“I didn’t expect him frankly speaking to say that he will always take the ticket of the party.\nWike also commended the PDP leadership in Plateau, Cross River, and Ondo states for the party’s performance in Saturday’s by-elections."
  },
  {
    "headline": "Wike: Atiku taking PDP members for granted by assuming he will win presidential ticket",
    "summarized_story": "Nyesom Wike, governor of Rivers, says former Vice-President Atiku Abubakar is taking members of the Peoples Democratic Party (PDP) for granted on the issue of securing the presidential ticket.\nAfter a visit to former President Olusegun Obasanjo on Saturday, Abubakar had expressed confidence that he would win the PDP ticket.\nSpeaking on the development, Wike said the former vice-president went too far with his comment.\n“I didn’t expect him frankly speaking to say that he will always take the ticket of the party.\nWike also commended the PDP leadership in Plateau, Cross River, and Ondo states for the party’s performance in Saturday’s by-elections."
  },
  {
    "headline": "EXCLUSIVE: APC governors to meet on Tuesday as 'zoning formula' causes ripples",
    "summarized_story": "The 21 governors in the All Progressives Congress (APC) will meet in Abuja on Tuesday to discuss the party’s zoning formula ahead of the March 26 national convention, TheCable can report.\nA list of all the party’s national positions along with the geo-political zones to fill them was widely published in the media, including TheCable, after the governors’ meeting with President Muhammadu Buhari on Tuesday.\nHowever, some governors are said to be kicking against the list because it does not reflect the outcome of the meeting with the president.\n“Zonal congresses are alien to the current APC constitution.\nIt is understood that this will also be discussed by the APC governors at their meeting."
  },
  {
    "headline": "Development finance institutions are looking to Africa’s digital frontier for impact and returns",
    "summarized_story": "Development finance institutions have long funded traditional finance and infrastructure projects in Africa; now they’re increasingly backing Africa’s digital future.\nIt can mean more opportunities unlocked as DFI money de-risks investment in high risk but critical business models.\nAfrica’s telecoms infrastructure, the backbone of its digital growth today, is an example of DFI money doing good while making returns.\nIn a perfect world, DFI and MFB activity in Africa’s fairly young venture space should be led (not nominally) by African development finance institutions.\nThat should help these institutions gain more financial clout and firepower to direct African technology to the areas of greatest need."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "Kenyan influencers were paid $10 to $15 to discredit controversial bills on Twitter",
    "summarized_story": "The bills are the Reproductive Healthcare Bill and the Assisted Reproductive Technology Bill, also known as the Surrogacy Bill.\nThe Mozilla report reveals that CitizenGO paid the owner of these accounts or “disinformation influencers” around $10 to $15 to make tailored tweets that discredited the bills.\nIn response to this report, Twitter has permanently suspended 240 accounts connected to this disinformation campaign for violating its platform manipulation and spam policy.\nHeightening Twitter Trend’s criticismTwitter’s Trends section helps users identify the most discussed topics on the platform and also help them find popular information or discussion.\nLast year, a Buzzfeed investigation revealed that Nigerian influencers paid to tweet in a coordinated manner successfully manipulated Twitter Trends in order to sway public opinion and court judgement in favour of Venezuelan politician, Alex Saab."
  },
  {
    "headline": "Meet the 19 year old Nigerian building his own blockchain empire",
    "summarized_story": "Born to an engineer father and a school teacher mother, Njoku was a mathematics whiz.\nThis, his engineer father could live with.\nIn April 2020, a month after he started working at Kwivar, he got another offer as a blockchain developer at Project Hydro, a blockchain company based in the British Virgin Islands.\nAt Xend Finance, he had to step in when the lead blockchain engineer was unavailable, and that accelerated his blockchain knowledge.\nNjoku isn’t Zukerberg and may never be, but he’s building his own empire in the blockchain world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "What Flutterwave’s fintech as a service means for the African tech ecosystem",
    "summarized_story": "In addition to its payment infrastructure, the startup unveiled the addition of Apple and Google Pay, Grow (its SME financing service), and fintech as a service (FaaS).\nAkurateco, a Dutch software provider, defines fintech as a service as offering financial technology as a service.\nAdvertisementFlutterwave founder and CEO, Olugbenga AgboolaAfrican API fintech startups have gained more attention in recent years, but they often focus on a few services.\nBy enabling other companies to integrate financial services to existing offerings, they allow the businesses to expand already existing offers.\nOutsourcing the provision of their fintech services could, therefore, leave startups at the mercy of the service provider as they often lose control over the quality and security of their fintech service."
  },
  {
    "headline": "Can Russia-Ukraine tensions spark World War III?",
    "summarized_story": "While tensions between Russia and Ukraine, a former Soviet republic, had existed for some time, the situation began to spiral out of control in early 2021.\nAdvertisementUkrainian president, Volodymyr Zelenskyy, urged US president, Joe Biden, to allow Ukraine to join NATO in January of last year.\nSadly, 14,000 people have died in Ukraine since 2014; I’m sure many more will perish if caution is not exercised.\nPlus, I think this conflict has the potential to spark World War III.\nAccording to CoinGlass data, $462.91 million in cryptocurrency has been ‘rekt’ – financially lost – since two nights ago, Wednesday, February 23, 2022."
  },
  {
    "headline": "Space Universe Africa launches new technology-enabled R&D lab to power next layers of human advancements from Africa",
    "summarized_story": "Also, a significant product of Space Universe Africa known as the School of Ground Truth embodies this principle.\nSpace Universe Africa is solving problems on many fronts, and here are some of their products that are doing just that.\nWith Awamaridi, Space Universe Africa plans to take a bold step into space and chart the unknown to make life better for humans while creating a healthy environment.\nCurrently serving companies across verticals like media and gaming, the company is furthering its vision to build the continent of our dreams through its innovative Space Universe Africa R&D lab.\nTo learn more about this lab and what Space Universe Africa represents, visit https://spaceuniverse.africa/."
  },
  {
    "headline": "In race to attract Nigerian students, US losing ground to UK",
    "summarized_story": "In race to attract Nigerian students, US losing ground to UKThe United States of America may be fast losing ground to the United Kingdom as the preferred study destination, BusinessDay’s analysis of new enrolment data shows.\nIn Australia, the number of Nigerian students dropped by 5.6 percent to 1,928 in 2021.\nExperts say that the expanded work and immigration opportunities offered in the UK have become major drivers for international student enrolment in UK higher education.\nOne of the measures that the developed economy took was to update its International Education Strategy, which was originally launched in 2019.\nAdditionally, Olugbenga Ogunbode, CEO at International Education Corporation Group, said the UK exit from Brexit created job vacancies at the middle and low levels."
  },
  {
    "headline": "Electoral Act: Nigeria on the march to credible election in 2023?",
    "summarized_story": "Beyond the signing into law Friday of the Amended Electoral Act by President Muhammadu Buhari, Nigerians have been urged to prepare for credible elections, henceforth.\nPresently, all eyes are now on the Independent National Electoral Commission (INEC) to accelerate preparations for next year’s election.\nUpon the return of Nigeria to civil rule in 1999, the first Electoral Act was passed in 2001.\nIndeed, there has always been an attempt after every election to amend the Electoral Act to take care of deficiencies or mischief noticed during the elections.\n“I have gone through the clauses and amendments introduced in section 49 of the Electoral Act."
  },
  {
    "headline": "Handball League: Edo Dynamos Defeated Kwara United – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Dynamos Handball Club today continued their impressive form in the ongoing National Division 1 Handball league holding in Benin City after narrowly defeating Kwara United by 23 goals to 22.\nDynamos scored their winning goal within the last 30 seconds of the game after being awarded a penalty, as the first half ended nine goals apiece.\nSpeak with Journalists after the game, head coach of Edo Dynamos Ijeh Kingsley who noted his sides’ intention is promotion to the Handball Premiership league blamed his boys for losing too many chances which almost cost them the game.\nWe have tried our best and our best was not good enough to win.\nBut at least, we have showed the world what handball is and the world was against us and there was nothing we can do about it”."
  },
  {
    "headline": "EU, CONGOS Train Civil Society Groups on Organisational Mgt. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The conference of Non-Governmental Organisations (CONGOS), Edo State has commenced a capacity building programme aimed at equipping its members for uptimal service delivery.\nThe nine months training programme is funded by the European Union (EU) in collaboration with the British Council.\nPresident of CONGOS, Mrs Abiola Daisy Ogaga at the programme inception meeting in Benin City said that the training is aimed at enhancing Civil Society Groups with capacity for enhanced performance.\nAccording to her, the present executive of CONGOS is committed to membership drive which would culminate in increased number of beneficiaries of the capacity building programme of the organisation.\nThe British Council Focal Person in Edo State, Mr Newton Osmaye, while lauding CONGOS and its activities in the state, expressed readiness to sustain the council’s efforts towards improving on the society."
  },
  {
    "headline": "Edo Ranks Low in Drug Abuse – NDLEA Official – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The National Drug Law Enforcement Agency, (NDLEA), Edo State Command since intensified its war on drug barons, illicit drug, drug abusers, dealers and its like nationwide.\nOur source disclosed that, “there were years when Edo State was a safe haven for drug abusers, drug dealers and drug barons.\n“Those were the years parents were not informed of the persistent activities of drug dealers.\n“So, the agency has really done well in the fight against illicit drug intakes, destructive drug dealers and merchandise of drug abuse.\nKudos to the operatives of the agency in Edo; how I wish other states can understudy Edo NDLEA,” our source said."
  },
  {
    "headline": "High hopes as Obaseki sends Disability Bill to EDHA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After several years of advocacy by disability community in Edo State for the domestication of Disability act, governor Godwin Obaseki on Wednesday sent Disability Rights Bill to the state house of assembly.\nOther Bills sent are Electricity Commission and Agency Bill, Criminal Law Bill of Edo State, Edo Property Development Agency (EDPA) Bill, and the Justice Reform Bill.\nObaseki had jettisoned a similar Bill sent to the house by previous administration, citing inconsistencies in the documents.\n“Sir, the disability community in Edo State is super excited about the prospect of having a law that will safeguard their interests and unlock their potentials.\n“While hoping that the 7th Edo State House of Assembly will give expeditious consideration and passage to the executive Bill before them."
  },
  {
    "headline": "APGA rejects Enugu LG election results, accuses PDP of massive rigging",
    "summarized_story": "TUESDAY OLOKODEThe Enugu State chapter of the All Progressive Grand Alliance (APGA), has rejected the outcome of last week’s local government election held in the state in which the People’s Democratic Party (PDP) won all contested seats.\nAPGA which rejected the outcome of the election in a statement signed by its state chairman, Ndubuisi Enechionyia and secretary, Hon.\nDickson Ani and issued after its extraordinary meeting held on 26th February 2022, accused the Enugu State Independent Electoral Commission (ENSIEC) of conniving with the state authorities to manipulate the polls.\n“The party decries the activities and actions of the Mr Ajogwu led Enugu State Independent Electoral Commission which reneged on their statutory oaths and betrayed the mandate reposed on them.\n“Once again, the state leadership of APGA commends our candidates and supporters for embarking on the journey of re-writing the political history of Enugu State."
  },
  {
    "headline": "Dele Momodu visits Gbongan, mother’s hometown to kickstart presidential campaign",
    "summarized_story": "On his arrival in the town, Momodu visited the graveside of his mother and prayed for the repose of her soul.\nA large number of people ( comprising of residents and supporters) thronged the palace of the Olufi to receive Dele Momodu when he went to the palace to pay homage to the king.\nSpeaking at the palace, Momodu said he joined the main opposition party, the People’s Democratic Party so as to play an active role in saving the nation from the unpleasant grip of the All Progressives Congress (APC).\nI have also worked with President Muhammad Buhari before things started turning upside down,” he saidSpeaking, the Olufi of Gbongan showered encomium on the presidential aspirant, promising to support his presidential ambition.\nHowever, Momodu recently registered his commitment to the PDP as well as his determination to stick to his ambition through to the end."
  },
  {
    "headline": "Gunmen invade burial event in Anambra, kill 16, injure scores",
    "summarized_story": "There was mayhem at Ebenebe, Awka North Local Government Area of Anambra State on Saturday as gunmen suspected to be cultists stormed the venue of a burial ceremony and opened fire on mourners, killing at least 16 of them while many others were injured.\nThe gunmen were also said to have seized the corpse of 34-year-old Ozor Chibuike Joseph Chukwuka being prepared for burial and shot it several times over before driving away.\nThe Anambra State Police command confirmed the incident to PUNCH, stating that it was a case of cult rivalry.\nA burial was going on when some people suspected to be cultists invaded the area and started shooting.\n“For now, the Commissioner of Police, CP Echeng Echeng, has despatched tactical squads comprising of various units to the area to maintain calm.”"
  },
  {
    "headline": "Unknown assailants set Elliot Uko’s poultry farm ablaze in Enugu",
    "summarized_story": "A poultry farm belonging to Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement, was on Friday night set ablaze by unknown assailants in what appears to be a targeted attack.\nThe incident is the latest in series attacks on Uko’s farm in Enugu State by unknown persons who appear to be on a mission to hurt his businesses over his positions key national issues.\n“Last night, unknown persons set the main office block of my poultry farm in Enugu ablaze,” he said.\n“False narratives and cooked up allegations to blackmail me, won’t change my position.\n“The plots against me won’t change anything.”"
  },
  {
    "headline": "COVID 19: 103.7m Nigerians Not Fully Vaccinated",
    "summarized_story": "Two years after the first case of COVID -19 was detected in Nigeria, 103,745,586 out of the 111,776,503 eligible population targeted for COVID-19 vaccination to reach herd immunity against the disease have not been fully vaccinated.\nThough vaccination against COVID-19 commenced about a year after, the huge gap between eligible Nigerians and those vaccinated shows that Nigerians are not willing to be vaccinated.\n“Government should ensure that the COVID-19 vaccine is enough to go round.\nA few days ago, the minister of health, Dr. Osagie Ehanire, said the proportion of fully vaccinated Nigerians was still very low.\nI call on all eligible persons that are yet to receive their vaccination to go to the nearest COVID-19 vaccination site and get vaccinated."
  },
  {
    "headline": "234 Express Unveils Nigeria Heritage Series",
    "summarized_story": "The independent educational publishing company, +234Express Communications has unveiled the first 21 books of its flagship series which was developed to support the recently-introduced curriculum for History at the basic education level.\nWe can rekindle values like tolerance, integrity, self-reliance, dignity and others using history as a tool.\nThis is the vision of the Nigeria Heritage Series,” he said.\nHe identified primary education as the bedrock for all other levels of education, and urged the government through the ministry of education to redirect attention accordingly.\nThe special guest of honour, the minister for education, Mallam Adamu Adamu, stated that the Nigeria Heritage Series was quite an interesting project because it serves as a strategic supplement to the History curriculum at the basic education level."
  },
  {
    "headline": "Gunmen Kill Gov Ishaku’s Aide, Attack Mourners In Anambra",
    "summarized_story": "Gunmen early yesterday killed Hon.\nLevi Gbashi, an aide of Taraba State Governor Darius Ishaku in Donga local government area of the state.\n“We refused to comply as we wanted to buy time to attract the attention of people who were still around.\nPolice in Anambra State yesterday confirmed a violent attack at a funeral at Ebenebe community in Awka North local government area by suspected cultists.\nPolice spokesman in Anambra, DSP Tochukwu Ikenga, who confirmed the incident told newsmen that “a burial was going on when some people suspected to be cultists invaded the area and started shooting."
  },
  {
    "headline": "Abiodun Vows Tough Measures Against Ritual Killings",
    "summarized_story": "Ogun State Governor Dapo Abiodun has condemned the rise in killings and dismembering of human beings for ritual purposes.\nWhile expressing concern over the involvement of young ones in the act, the governor vowed to deal decisively with anyone caught in the crime in accordance with the relevant laws.\n“We won’t be identified by this notoriety.\nWe have emplaced security measures in schools and all the villages, hamlets and towns to ensure zero-tolerance for ritualists.\nWe will trail them, apprehend them, investigate them and make them serve as examples for those harbouring such sinister routes to wealth,” he said."
  },
  {
    "headline": "IGP Appoints Senchi As DIG Operations, Redeploys AIG Ciroma",
    "summarized_story": "The inspector-general of police, IGP Usman Baba, has ordered the posting of assistant inspector-general of police, AIG Bala Zama Senchi, as Ag.\nDIG department of operations, force headquarters, Abuja and DIG representing North-West Geo-political zone.\nThe IGP has equally ordered the redeployment of AIG Aji Ali Janga, AIG Bala Ciroma, and AIG Ndatsu Aliyu Mohammed to AIG Police Mobile Force (PMF), AIG federal operations (FEDOPS), and AIG Zone 7 Abuja, respectively.\nThe acting Force PRO, CSP Muyiwa Adejobi, said the posting/redeployment of the senior officers was due to the recent vacuum occasioned by the retirement of DIG Zaki Ahmed, the DIG representing the North-West Geo-political zone and immediate past DIG in-charge of Operations, and AIG John Abang, AIG PMF, after the completion of their statutory years of service.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Russia moving large ground forces toward Kyiv, satellite reveals",
    "summarized_story": "Despite agreeing to peace talks with Ukraine, Russia is still deploying its war arsenals towards Kyiv, the Ukrainian capital.\nSatellite imagery taken on Sunday showed a large deployment of Russian ground forces including tanks.\nThey were moving in the direction of the Ukrainian capital Kyiv from approximately 40 miles (64 km) away, a private U.S. company said.\nThe images released by Maxar Technologies Inc (MAXR.N) showed a deployment comprised of hundreds of military vehicles and extending more than 3.25 miles (5 km), Maxar said.\nThe convoy was situated northeast of the Ukrainian city of Ivankiv and contained fuel, logistics and armored vehicles including tanks, infantry fighting vehicles and self-propelled artillery, it said."
  },
  {
    "headline": "Russian forces seize Ukraine's city of Berdyansk: Mayor Svidlo",
    "summarized_story": "Oleksandr Svidlo, the acting mayor of the town of Berdyansk on Ukraine’s southern coast, has said that Russian forces have entered and taken control of the town.\nBerdyansk, which has a small naval base, has a population of about 100,000.\nSvidlo posted a message to the town’s residents on his Facebook page Sunday which said, “A few hours ago, you and I witnessed how heavy military equipment and armed soldiers entered the city and began advancing throughout our hometown.\nI consider this proposal unacceptable, so we, as all members of the operational headquarters, left the building of the executive committee.”Svidlo ended his post, saying, “Today Berdyansk was on the line of fire.\nI don’t know what tomorrow will be like, but I think tonight will be very, very hard.”"
  },
  {
    "headline": "BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism",
    "summarized_story": "President Muhammadu Buhari has expressed his displeasure with the mistreatment of Nigerians and citizens of other African countries in Ukraine as a result of the country’s protracted conflict.\nNigerians have been turned back at Ukraine’s borders in their bid to flee the unstable country for neighboring countries, according to reports and recordings.\n“There is a long history dating back to decades of Nigerians and other Africans studying in Ukraine, particularly medicine.\nThe majority of Nigerian citizens in the country today are university-enrolled students.\n“There are also separate reports of Polish officials simply refusing Nigerian citizens’ entry into Poland from Ukraine."
  },
  {
    "headline": "APC Governors Meet As ‘Zoning Formula’ Causes Ripples",
    "summarized_story": "The 21 governors in the All Progressives Congress (APC) will meet in Abuja on Tuesday to discuss the party’s zoning formula ahead of the March 26 national convention, TheCable can report.\nHowever, some governors are said to be kicking against the list because it does not reflect the outcome of the meeting with the president.\n“Zonal congresses are alien to the current APC constitution.\nThey are contained in the proposed amendment to our constitution, which can only be adopted at the March 26 convention after which it will become operational.\nIt is understood that this will also be discussed by the APC governors at their meeting."
  },
  {
    "headline": "Popular Pastor Poses On A Cobra Throne (video)",
    "summarized_story": "A popular Pastor and Founder of Anointed Palace Chapel (APC), Rev Obofour has ignited a controversy after sharing a video of him sitting on a “cobra throne”.\nThe gold-plated throne was topped with the head of a colossal cobra, which had its jaws open.\nThough the owner of the throne is not known, the video was first shared by his wife and has now been deleted."
  },
  {
    "headline": "2023 Presidency: Nigeria Will Be Safe In My Hands — Atiku",
    "summarized_story": "2023 Presidency: Nigeria Will Be Safe In My Hands — AtikuFormer Vice President Atiku Abubakar has stated that if he is elected President, Nigeria and Nigerians will be secure in his hands.\nHe said this ahead of the 2023 elections, when he’s expected to run for the People Democratic Party’s presidential ticket.\nAccording to the Daily Nigerian, Atiku mentioned this in a taped message delivered at the MUSON Center in Lagos during the South-West edition of the Atiku Abubakar Town Hall Meetings of National Unity and Prosperity Forum 2022, produced by the Atiku Kawai Media Group.\n“The willpower and empathy required to fix Nigeria will need a leader who knows both the historical and contemporary issues of our generations.\n“Nigeria and indeed Nigerians will be safe in my hands."
  },
  {
    "headline": "Russia, Ukraine Presidents set for peace talks as war escalates",
    "summarized_story": "Peace talks are due to be held between Ukraine and Russia, Volodymyr Zelenskyy confirmed on Sunday – despite Vladimir Putin putting his nuclear forces on high alert.\nIn a televised address, he said: “Today, we were as close as ever to the entry of Belarus armed forces into the war.\nWe are going there to say what we think of this war and Russia’s actions,” Kuleba added.\nIt comes after Putin put his nuclear forces on high alert just after warning the West “may face the greatest consequences in history”.\nPutin said he has now ordered his military command to put Russia’s deterrence forces – a reference to units which include nuclear arms – on high alert."
  },
  {
    "headline": "2022: Like ASUU, non-teaching staff may join strike in universities – Official",
    "summarized_story": "Nigerian students may have to stay longer at home as the non teaching staff in Nigerian Universities have revealed plans to embark on strike, two weeks after Academic Staff Union of Universities (ASUU) embarked on an industrial action.\nThe non-academic lecturers in various higher institutions said they can not longer watch as agreements freely entered with government are not respected.\nThe unions under the umbrella of Joint Action of Non-Academic Staff Union of Educational and Associated Institutions (NASU) and the Senior Staff Association of Nigerian Universities (SSANU) at the weekend said they would withdraw their services any moment without further notice.\n“Given the situation of things as at today, following agitation of our members, we can no longer guarantee industrial peace in our university system.\nWith this release, we place all Nigerians on red alert of the possibility of an industrial acton by the non-teaching staff unions of NASU and SSANU, as we can no longer watch as agreements freely entered into by the Federal Government with the Unions are not respected,” the union leaders said."
  },
  {
    "headline": "Breaking: Russian airlines ‘banned from EU airspace’ as more sanctions beckon over Ukraine invasion",
    "summarized_story": "Russian airlines have reportedly been banned from EU airspace as Europe unites over the invasion of Ukraine.\nGermany’s transport minister is in favour of closing Germany’s airspace to Russian aeroplanes.\nEarlier Saturday evening German airline Lufthansa said it will cancel all flights to Russia and will cease using Russian airspace for the coming week, citing the “emerging regulatory situation”.\n“Flights that are in Russian airspace will leave it again shortly,” a spokesperson for the company said.\nIt will also cease to use Russian airspace for the coming seven days, it said in a statement"
  },
  {
    "headline": "Russian Invasion: Nigerians From Ukraine Granted Visa-Free Access To Romania, Hungary – FG",
    "summarized_story": "The Federal Government has said that Hungary and Romania have approved visa-free access to all Nigerians coming from Ukraine.\nThe Ministry of Foreign affairs disclosed this in a statement on Sunday, while advising Nigerians fleeing Ukraine to move to the Hungarian or Romanian borders for easy access.\nIt’s been four days since the Russian invasion that has sent shockwaves around the world and fighting raged on Sunday in Ukraine.\nHowever, the country’s forces have put up fierce resistance and claim to have inflicted heavy damages on the Russian military.\n“We will not surrender, we will not capitulate, we will not give up a single inch of our territory,” Ukraine’s Foreign Minister, Dmytro Kuleba, said at a press conference broadcast online."
  },
  {
    "headline": "Bandits Kill 10, Kidnap Several Others In Kaduna State",
    "summarized_story": "At least ten persons have been killed by suspected bandits during separate attacks in Birnin Gwari Local Government Area of Kaduna State.\nThe bandits also kidnapped an unspecified number of people, mainly women, from the communities during the operation that lasted for several hours.\nREAD ALSO: Kaduna Govt Arraigns Suspected Killers Of Senator Na’Allah’s SonIn retaliation, the bandits were said to have returned to the villages on Saturday morning and killed ten people, including six local vigilante members and four villagers.\nThey also kidnapped an unspecified number of people during the operation.\nSimilarly, bandits also blocked the Kaduna- Birnin-Gwari Road at about 10 am on Saturday morning and attacked motorists."
  },
  {
    "headline": "NDLEA Raids Lagos Island Drug Den, Arrests Kingpin, Six Others",
    "summarized_story": "A major drug kingpin operating the notorious Patey Lagos Island drug haven, in Lagos State, Mrs. Sherifat Kehinde Lawal, has been arrested along with six other suspects by operatives of the National Drug Law Enforcement Agency (NDLEA).\nThe NDLEA operatives also recovered 5,862 kilograms of assorted illicit drugs including Loud and Codeine in the raid which took place on Saturday.\nREAD ALSO: NDLEA Arraigns 10 Thais, Nine Nigerians Over Hard Drugs ImportationDesist or Face ConsequencesThe operatives tactically defend themselves and took the suspects and exhibits away.\nGen. Mohamed Buba Marwa commended the officers and men of the Lagos Command of the agency for the successful operation.\nHe warned those being used by drug cartels to obstruct or attack anti-narcotic officers in the course of doing their work to desist or face dire consequences."
  },
  {
    "headline": "SERAP Sues Buhari Over ‘Failure To Probe Alleged Misuse Of Security Votes By Governors’",
    "summarized_story": "Ending impunity for allegations of corruption in the spending of security votes and recovering any mismanaged public funds are matters of public interest”.\n“Security votes should be used for improving the security situation in the states or returned to the public treasury,” it added.\n“As revealed by a recent report by Transparency International (TI), most of the funds appropriated as security votes are spent on political activities, mismanaged or simply stolen.\nIt is estimated that security votes add up to over N241.2 billion every year.\nOn top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance."
  },
  {
    "headline": "Liverpool Beat Chelsea To Win League Cup",
    "summarized_story": "Liverpool won the League Cup final in dramatic fashion as Chelsea goalkeeper Kepa Arrizabalaga missed the decisive penalty to give the Reds an 11-10 shoot-out victory after a pulsating 0-0 draw at Wembley on Sunday.\nJurgen Klopp’s side clinched their first domestic knockout prize since the 2012 League Cup when Kepa blazed his spot-kick high over the bar.\nIt was the only miss in the nerve-jangling shoot-out, which saw Liverpool keeper Caoimhin Kelleher score his penalty just before Kepa failed.\nKepa had already endured penalty misery in the 2019 League Cup final when he petulantly refused to be substituted before a shoot-out defeat against Manchester City.\nHavertz was also denied a goal by another offside flag, setting the stage for Liverpool to win it in the shoot-out."
  },
  {
    "headline": "Senator Omo Agege, Govs. Sanwoolu, Ayade, Others lead APC Convention sub-Committees -",
    "summarized_story": "Deputy President of the Senate, Senator Ovie Omo-Agege, Attorney General of the Federation, Abubakar Malami, Governor Ben Ayade, Governor Babajide Sanwo-Olu, Governor Dave Umahi, Minister of Foreign Affairs, Geoffrey Onyema, Others Lead APC National Convention Sub-Committees.\nAdvertisementAdvertisementThey will be in charge of ensuring a hitch free National Convention for the ruling All Progressives Congress at the Eagle Square in Abuja."
  },
  {
    "headline": "APC wins Ngor Okpala by-election in Imo State",
    "summarized_story": "The Independent National Electoral Commission has declared Blyden Okanni Amajirionwu of the APC winner of Saturday’s Ngor Okpala, Imo State Assembly by-election.\nThe election, which began in the early hours of Saturday, February 26th, was quiet, with minimal distortions regulated by security officers on duty.\nAdvertisementMr. Amajirionwu polled 9,248 number of votes as against his closest rival from the People’s Democratic Party (PDP) who got 7,161 number of votes.\nHaving fulfilled the requirements as stipulated by law, the Returning Officer declared the All Progressives Congress (APC) candidate winner and returned him elected."
  },
  {
    "headline": "APC wins Akure North/ South Federal Constituency by-election",
    "summarized_story": "The Independent National Electoral Commission has declared Mr Mayokun Lawson Alade of the All Progressives Congress, APC as the winner of Akure North and South federal constituency by-election.Mr Alade polled 26,379 to beat his closest rival, Mr Olumuyiwa Adu of the People’s Democratic Party, PDP who polled 24,201 votes.\nOther contestants, Oluwawemimo Fadeke of the African Democratic Party, had 465 votes, Joseph Ajayi of the All People’s Party polled 125 votes, Olaniyi Olufemi of the National Redemption movement , 76 votes , Opawole Tajudeen of the Social Democratic Party, 68 votes while Olawale of the Accord Party polled 41 votes.\nThe election held in two local governments of Akure North/ Akure South was conducted under a peaceful atmosphere.\nAdvertisementThe by-election became necessary following the death of the lawmaker representing the constituency, Mr Adedayo Omolafe in August, 2021.\nFINAL RESULT FOR AKURE NORTH/SOUTH FEDERAL CONSTITUENCY BY-ELECTION;Akure North LGA:APC – 8,291PDP – 5,830AdvertisementAkure South LGA:APC – 16,996PDP – 17,645TOTALAPC – 25,287PDP – 23,475AdvertisementDifference = 1,812"
  },
  {
    "headline": "Jos North/Bassa by-election: INEC, electorate commended for peaceful conduct -",
    "summarized_story": "Residents in the Jos North and Bassa Federal Constituency have been commended for their peaceful conduct during the by-election for the Jos North, Bassa Federal House of representatives.\nTVC News crew in Jos went round some of the polling units within the affected areas also confirmed the peaceful and orderly conduct of the exercise.\nAdvertisementParty agents, civil society organisations, observers, as well as the officials of INEC, monitoring the polls expressed satisfaction with the peaceful conducts of the electorate.\nOfficials of the electoral body conducting the polls have also been applauded for a free fair and credible exercise at the moment.\nAdvertisement"
  },
  {
    "headline": "World’s Largest Plane Destroyed By Russian Strikes in Ukraine",
    "summarized_story": "The largest plane in the world Ukraine’s Antonov-225 cargo plane, was destroyed by Russian strikes outside Kyiv on the fourth day of Moscow’s invasion, Ukraine’s state-owned Ukroboronprom group said Sunday.\n“Russian invaders destroyed the flagship of the Ukrainian aviation, the AN-225” at the Antonov airport in Gostomel near Kyiv, the group said in a statement.\n“This was the world’s largest aircraft, AN-225 ‘Mriya'” Ukraine’ Foreign Minister Dmytro Kuleba tweeted Sunday.\n“Russia may have destroyed our ‘Mriya’.\nIt has been operated by Ukraine’s Antonov Airlines for cargo flights and was in high demand during the start of the Covid-19 pandemic."
  },
  {
    "headline": "One Dead in New Violence at Zimbabwe Opposition Rally",
    "summarized_story": "At least one Zimbabwean opposition activist was killed and 17 others were hospitalised on Sunday after violence broke out during a rally, the Citizens Coalition for Change (CCC) announced.\nThe events come a day after the country’s vice president Constantino Chiwenga said the ruling party would “crush” the opposition, fuelling fears of a new wave of state-sponsored violence.\nOn Saturday, the police used violence to disperse hundreds of opponents in Gokwe, some 140 kilometres (87 miles) away from Kwekwe, on the pretext that they lacked the personnel to supervise the rally properly.\n“We condemn the unbridled violence,” CCC spokeswoman Fadzayi Mahere told AFP on Sunday.\n“We demand an end to the political persecution and incitement of senior ZANU leaders who threatened that they will ‘crush CCC like lice’."
  },
  {
    "headline": "EU Escalates Sanctions on Russia: Closes Airspace, Bans Media",
    "summarized_story": "The EU on Sunday announced swingeing new sanctions against Russia over its invasion of Ukraine, closing its airspace to Russian aircraft and banning Russian state media outlets broadcasting in the bloc.\n– Stopping Russian ‘lies’ –The move against Russian state media targeted its outlets Russia Today — known as RT — and Sputnik, and their subsidiaries.\nVon der Leyen said they “will no longer be able to spread their lies to justify Putin’s war and to sow division in our Union”.\nVon der Leyen said the sanctions against Belarus were aimed at “the other aggressor in this war”, naming the regime of strongman Alexander Lukashenko.\nVon der Leyen said the decision to provide funding for the purchase and delivery of arms to Ukraine was “a watershed moment for our Union”."
  },
  {
    "headline": "2023: More Calls For Igbo Presidency",
    "summarized_story": "‘Peter Obi must Join the 2023 presidential race…he is the most qualified candidate from the south east” Law Mefor, the Vice chairman of the Igbo leadership development foundation call on former governor of Anambra State Peter Obi to present himself as an aspirant in the 2023 presidential race.\nHe says the country should allow the South East produce the next president."
  },
  {
    "headline": "Putin Puts Russia’s Nuclear Forces on High Alert, Cites Sanctions",
    "summarized_story": "Russian President Vladimir Putin ordered his military command to put Russia’s deterrence forces – a reference to units which include nuclear arms – on high alert, citing aggressive statements by North Atlantic Treaty Organization (NATO) leaders and economic sanctions against Moscow.\nInternational tensions are already soaring over Russia’s invasion of Ukraine, and Putin’s order will cause further alarm.\nMoscow has the world’s second-largest arsenal of nuclear weapons and a huge cache of ballistic missiles which form the backbone of the country’s deterrence forces.\n“I order the defence minister and the chief of the general staff of the Russian armed forces to put the deterrence forces of the Russian army into a special mode of combat service,” Putin said in a televised address.\nDefence Minister Shoigu replied: “Affirmative.”The Russian president on Thursday ordered the invasion of Ukraine, sending shockwaves around the world."
  }
]