[
  {
    "headline": "Why babies should be allowed to suck for decent minutes before switching to another breast —Paediatrician",
    "summarized_story": "Oluwatobiloba JaiyeolaA Consultant Paediatrician, Dr. Abdurrazzaq Alege, has urged nursing mothers to ensure babies spend a minimum of 15 minutes sucking one breast before being switched to the other breast.\nAccording to him, doing this will help to ensure the baby gets the necessary nutrients needed for optimal growth and development.\n“However, It is the hindmilk that comes later that contains the nutrients the child will use like, proteins, carbohydrates, and vitamins.\n“What the child needs at that stage is bodybuilding to grow,” the expert noted.\n“Good breastfeeding and long breastfeeding, especially exclusive breastfeeding, allow the womb to get back to shape,” he said."
  },
  {
    "headline": "Why babies should be allowed to suck for decent minutes before switching to another breast —Paediatrician",
    "summarized_story": "Oluwatobiloba JaiyeolaA Consultant Paediatrician, Dr. Abdurrazzaq Alege, has urged nursing mothers to ensure babies spend a minimum of 15 minutes sucking one breast before being switched to the other breast.\nAccording to him, doing this will help to ensure the baby gets the necessary nutrients needed for optimal growth and development.\n“However, It is the hindmilk that comes later that contains the nutrients the child will use like, proteins, carbohydrates, and vitamins.\n“What the child needs at that stage is bodybuilding to grow,” the expert noted.\n“Good breastfeeding and long breastfeeding, especially exclusive breastfeeding, allow the womb to get back to shape,” he said."
  },
  {
    "headline": "LASU takes free medical outreach to Ikorodu, 300 residents benefit",
    "summarized_story": "The Lagos State University on Friday took a free medical screening programme to Ikorodu North Local Council Development Area, with over 300 residents benefiting.\nBlood pressure checkups, blood glucose, HIV test, hepatitis B test, eye screening, breast cancer screening, cervical screening and prostate cancer screening were carried out on beneficiaries.\nThe Director, LASUDA, Prof. Yinka Okubena –Dipeolu, in her remarks, appreciated the Chairman of Ikorodu North LCDA for embracing the health programme.\n“In most cases, the LASU will always support other local governments, but for Ikorodu North LCDA, the Chairman paid the bills.\nMr. Adeola Banjo, Chairman, Ikorodu North LCDA, said the council was committed to ensuring that the people had easy access to health care services."
  },
  {
    "headline": "LASU takes free medical outreach to Ikorodu, 300 residents benefit",
    "summarized_story": "The Lagos State University on Friday took a free medical screening programme to Ikorodu North Local Council Development Area, with over 300 residents benefiting.\nBlood pressure checkups, blood glucose, HIV test, hepatitis B test, eye screening, breast cancer screening, cervical screening and prostate cancer screening were carried out on beneficiaries.\nThe Director, LASUDA, Prof. Yinka Okubena –Dipeolu, in her remarks, appreciated the Chairman of Ikorodu North LCDA for embracing the health programme.\n“In most cases, the LASU will always support other local governments, but for Ikorodu North LCDA, the Chairman paid the bills.\nMr. Adeola Banjo, Chairman, Ikorodu North LCDA, said the council was committed to ensuring that the people had easy access to health care services."
  },
  {
    "headline": "Nnamdi Kanu’s family responds to alleged sponsors of insecurity in Abia",
    "summarized_story": "By Steve OkoThe family of the Leader of the Indigenous People of Biafran, Mazi Nnamdi Kanu, has expressed shock over the fingering of the former Governor of Abia State, Senator Theodore Orji representing Abia Central; his son and Speaker of the Abia House of Assembly, Rt.\nChinedum Orji; the Deputy Governor, Sir Ude Oko Chukwu; and former Commissioner for Local Government and Chieftaincy Affairs, Chief Charles Ogbonnaya, as sponsors of insecurity in the state.\nKanu’s family who spoke through Kalunta Kanu, expressed surprise over the veracity of the intelligence that led to the conclusion.\nThe family said that their son currently in security custody would not appreciate the involvement of IPOB with matters outside the group’s core mandate which is the restoration of Biafra.\nThey asked politicians to settle their issues and leave IPOB alone."
  },
  {
    "headline": "JUST IN: CAN calls for nationwide protest over Deborah Samuel’s murder",
    "summarized_story": "By Luminous Jannamike, AbujaThe Christian Association of Nigeria, has called for a nationwide protest over the gruesome killing of Deborah Samuel, a 200 level student of Shehu Shagari College of Education, Sokoto.\nOlasupo Ayokunle, in a letter addressed to all bloc leaders, urged Christians to hold peaceful protests within their church premises on Sunday May 22, 2022.\nHe made the call against the backdrop of the Thursday killing and setting ablaze of the female student by an angry mob that accused her of blasphemy.\nThe letter dated May 14, 2022 and signed by CAN’s General Secretary, Joseph Daramola, reads: “I have been directed by the CAN President, His Eminence, Rev.\nWe also call on Nigerian Christians in diaspora to join us using our embassies all over the world."
  },
  {
    "headline": "I will work with NASS to restructure Nigeria – Atiku",
    "summarized_story": "Atiku AbubakarAlhaji Atiku Abubakar, Presidential Aspirant of the People’s Democratic Party (PDP), says if he is elected president of Nigeria, he would work with the National Assembly to restructure Nigeria.\nAbubakar said this on Saturday in Calabar while addressing party delegates and stakeholders as the party prepares for its May 28 and 29 presidential primary.\nThe former Vice President said he would give more powers to both the state and local government councils.\nHe said the PDP in Cross River is one family and would pull their support behind him.\nRecall that Alhaji Atiku Abubakar ran as governor of Adamawa in 1990, 1997 and 1998 before becoming the running mate to former President Olusegun Obasanjo in 1999."
  },
  {
    "headline": "Deborah murder: Attempts to burn Catholic Church, Kukah’s house didn’t succeed; protest ended 3pm",
    "summarized_story": "By Haruna AliyuContrary to reports that protesters have burnt the house of Bishop Matthew Hassan Kukah, the Catholic Church and its secretariat in Sokoto, Vanguard learned that the properties were not torched.\nHowever, a source, one Niyi, said that protesters actually made attempts to burn it but didn’t succeed.\n“They moved to the Catholic secretariat, where they also met resistance.\nThe building houses a restaurant and the administrative block belonging to the Catholic Diocese of Sokoto,” the source said.\nHe noted that the protest ended since 3p.m., after the state governor imposed curfew and that normalcy had since returned in Sokoto."
  },
  {
    "headline": "Actions that caused civil war being re-enacted — Justice Odili",
    "summarized_story": "Justice Mary OdiliBy Ikechukwu NnochiriABUJA — Justice Mary Odili, who, yesterday, bowed out the bench of the apex court, yesterday, urged the Federal Government to pay attention to calls for the country to be restructured, warning that some actions that propelled the civil war, were being re-enacted.\nJustice Odili, who clocked the 70 years mandatory retirement age, spoke at a special valedictory session the Supreme Court held in her honour.\n“It, therefore, behooves on me, the duty to speak with the platform open to me today as a retired justice of the Supreme Court.\n“As I had earlier mentioned, I lived through the Nigerian civil war, which was precursed by the January 15, 1966, army coup and later the July 1966 pogrom as it was referred to.\n“Some of the actions or speeches that propelled the unfortunate war, which took the lives of millions of our people are being re-enacted at this time, hence the necessity for this reminder."
  },
  {
    "headline": "Deborah Samuel: CAN calls on Christians to be peaceful, law-abiding",
    "summarized_story": "The Christian Association of Nigeria (CAN), Kaduna State chapter, has urged pastors and church leaders to appeal to their members to remain peaceful, law-abiding and refrain from any act of lawlessness, and apply emotional intelligence in the face of challenge and provocation.\nA statement issued by the Secretary of CAN, Kaduna State, Rev Ma’aji Caleb, said, “I have directed to write and appeal to our Amiable Pastors and Church Leaders to continue to use our God-given roles and Revered pulpits to appeal to our Members to remain peaceful and law-abiding as we are always known.\nWe are blessed because we are always known for peaceful coexistence (Matthew 5:9).”The statement urged Christians to refrain from any act of lawlessness, and apply emotional intelligence in the face of challenge and provocation.\n“I on behalf of the State CAN Chairman request us to pray for the repose of the soul of our sister Deborah Samuel who was gruesomely murdered by her senseless, inhuman and irreligious perpetrators,” the statement stressed.\nCAN called on the security agencies to work assiduously to apprehend and prosecute those responsible to ensure due justice is done without fear and favour."
  },
  {
    "headline": "Deborah Samuel: Respect Sultan of Sokoto – Islamic group to protesters",
    "summarized_story": "The Muslim Rights Concern (MURIC) has appealed for calm in Sokoto over the demonstration that followed Deborah Samuel’s killing.\nThe Islamic group told the demonstrators to respect the Sultan of Sokoto, Sa’ad Abubakar, the leader of Muslims in Nigeria.\nIn a statement, MURIC director, Prof Ishaq Akintola noted that now is not the time for division but for peace.\n“As the seat of the caliphate, we must always ensure that Sokoto State is peaceful.\n“We demand same from the Muslim youths in Sokoto State”, the statement added."
  },
  {
    "headline": "Sokoto riot: You will soon see us – Southeast youths fume over attacks on Igbos, shops, churches",
    "summarized_story": "The Coalition of South East Youth Leaders, COSEYL, the apex socio-political youth group in the South East has warned against further attacks on Igbos residing in Sokoto State and their shops.\nAngered by the arrest, a large number of Muslim youths stormed several streets destroying churches and shops belonging to Igbos.\n“We warn the Sokoto indigenes to stop the attack and destruction of Igbo properties and goods forthwith.\n“The same way Igbos are living in Sokoto doing their legitimate business is also the same way Sokoto indigenes are living in the South doing their business”.\nThe coalition called on the Sokoto State Governor, Aminu Tambuwal to immediately arrest and prosecute those involved in the destruction of Igbo properties and churches."
  },
  {
    "headline": "UAE: Nigeria wants greater cooperation against terrorists, sponsors – Buhari to Sheikh Zayed",
    "summarized_story": "President Muhammadu Buhari has congratulated the new President of the United Arab Emirates (UAE), Sheikh Mohamed bin Zayed.\nHe was elected President by a Federal Supreme Council to succeed his half-brother, the late Sheikh Khalifa Bin Zayed.\nIn a statement on Saturday, Buhari said stepping into the shoes of the late Sheikh “is no easy task”.\n“I’m confident that you’re going to build on this great legacy created by your half-brother.”President Buhari said, “Nigeria looks forward to greater cooperation with the UAE “.\nNoting that Dubai is a reliable partner in progress, Buhari believes the cooperation will grow bigger and stronger."
  },
  {
    "headline": "Police officer, four others escape death in Bauchi accident",
    "summarized_story": "A police Inspector, Zubairu Yusuf, serving with the Jigawa State Police Command and five other passengers travelling in a Honda Civic car escaped death on Friday afternoon by the whiskers when they had an accident at Boi in Bogoro Local Government Area of Bauchi State.\n“Yes, a police officer who works with the Jigawa State command had an accident here.\n“The police officer and others in the car were very lucky to have escaped from the incident.\nTheir narrow escape is from God,” the military officer said.\nAccording to him, this would ensure that when an accident eventually occurs, the fatality rate would be minimal."
  },
  {
    "headline": "Wike begs Lagos PDP for presidential ticket",
    "summarized_story": "Rivers Governor Nyesom Wike has begged Lagos Peoples Democratic Party (PDP) for support towards becoming the presidential candidate of his party.\nThe PDP presidential aspirant made the appeal in Lagos during a consultation parley with the party leaders, executive, delegates and members of the opposition party.\nHe said: “I have come to Lagos state as somebody who is committed and sincere, to beg you for your votes during our forthcoming presidential primaries.\nIt is not about man-know-man, it is about who can win election for the PDP.\nI have the capacity to win election for the PDP."
  },
  {
    "headline": "Train attack: Terrorists release pregnant woman",
    "summarized_story": "Terrorists, who bombed the Abuja-Kaduna train, killed nine persons and kidnapped about 70 passengers in March, have released one of the pregnant captives.\nA video of the released pregnant clad in black abaya (gown) and black face mark, went viral on social media at the weekend.\nIn the video, the woman called on the Federal Government to negotiate with the terrorists and secure release of the remaining captives.\nThe woman said the terrorists took care of them, saying they were also fed very well.\nHer release brings to three the abducted train passengers who have so far regained their freedom."
  },
  {
    "headline": "BREAKING: Liverpool beat Chelsea on penalties to win FA Cup final",
    "summarized_story": "Liverpool have won the FA Cup final.\nCésar Azpilicueta and Mason Mount missed both missed chances to score.\nKonstantinos Tsimikas converted his penalty with a left footed shot to give the liverpool team victory over Chelsea.\nThis means Liverpool now has two trophy (Carling cup and FA Cup) in their cabinet this season and aiming for two (Premier League and Champions League).\nChelsea have become the first side since Newcastle United (1974, 1998 and 1999) to lose on three consecutive FA Cup final appearances."
  },
  {
    "headline": "BREAKING: Tears as Deborah Samuel is laid to rest",
    "summarized_story": "BREAKING: Tears as Deborah Samuel is laid to restThe remains of Deborah Samuel, who was burnt to death in Sokoto last Thursday over alleged blasphemy, have been laid to rest.\nShe was buried in her hometown,Tunga Magajiya, in Rijau local government area of Niger State.\nTears flowed freely as she was being buried as well wishers and relations lamented how she was killed.\nShe was buried around 6:30pm at the Christian cemetery in Tunga Magaiya.\nHer uncle, who is the Pastor of ECWA in Tunga Magajiya, Emmanuel Maaji, led the prayers at the cemetery before she was lowered to mother earth."
  },
  {
    "headline": "I will end banditry in six months, Wike promises",
    "summarized_story": "Rivers Governor Nyesom Wike has vowed to get rid of banditry within six months if elected President in 2023.\nWike said he had drawn the blueprint to provide the logistics and gadgets necessary for security agencies to expeditiously end banditry in the country.\nSo the basic thing in my first six months as president of Nigeria is to end banditry.\nWike maintained that he remained the only person that could defeat the APC in the 2023 general election if given the PDP presidential ticket.\nGo to the north it’s Wike; go to the east, it’s Wike, go to the west, it’s Wike, go to the south, it’s Wike."
  },
  {
    "headline": "Alleged Blasphemy: Tension in Sokoto, Tambuwal Declares Curfew",
    "summarized_story": "The irate youth also demanded that those arrested over the killing should be released with immediate effect.\nHe appealed to the people of Sokoto state to continue to observe law and order.\n“Everyone should, please, in the interest of peace go back home and observe this measures, with a view to re-establishing peace, law and order in the state”, he stated..\nHe noted that it was not in the interest of anyone to have a breakdown of law and order.\n“I, therefore, appeal for restraint; and, for people to observe and respect the rule of law”, he said ."
  },
  {
    "headline": "COVID Under Control in China",
    "summarized_story": "I would like to assure my Nigerian friends that China will be able to win the battle.\nChina’s anti-epidemic experience has demonstrated that its dynamic zero-COVID policy is not only the best option but also the bottom line that must be maintained for the country’s current epidemic prevention and control work.\nBy pursuing the dynamic zero-COVID approach, China has managed to safeguard people’s lives and well-being and has minimized the epidemic’s impact on economic and social development to the largest extent.\nAs a result, it is not difficult to conclude that China’s dynamic zero-COVID policy complements and bolsters the normal operation of the economy and society.\nFacing the COVID-19 pandemic, China has carried out its largest emergency humanitarian action since the founding of the People’s Republic of China in 1949."
  },
  {
    "headline": "Northern Christian Elders, CAN, UK Demand Arrest, Prosecution of Deborah’s Killers",
    "summarized_story": "Likewise, President Muhammadu Buhari strongly flayed the resort to self-help by the mob in Sokoto, resulting in violence, destruction and killing of Deborah.\nThe Christian group noted that anything short of apprehending and prosecuting those involved in the heinous act was unacceptable.\nDeborah had shared a voice note on her class Whatsapp group in which she challenged her colleagues who were posting religious information there.\nFormer President of the Senate, Anyim Pius Anyim also condemned, in the strongest terms, the gruesome and unlawful killing of Deborah.\nIn a statement he personally signed, Anyim decried the killing of Deborah as cruel, illegal, callous and inhuman."
  },
  {
    "headline": "At Farewell Meeting, Buhari Vows to Swiftly Replace Departing Ministers",
    "summarized_story": "Lai Mohammed at the press briefing announced that Buhari said he would immediately fill the vacancies created by the exodus of the nine ministers.\nAccording to him, “The ministers will be replaced very soon without delay, he (The President) said so.\n“Of course, Mr. President also admonished the remaining members of the Cabinet that the journey is still far.\nMr. President said some have and others are in the process of doing so.\n”I also wish to thank you for your invaluable services to this nation through your contributions as Cabinet members."
  },
  {
    "headline": "Labour Minister Ngige Drops Presidential Ambition to Stay in Office",
    "summarized_story": "Minister of Labour, Chris Ngige, has dropped his presidential ambition so that he could retain his ministerial portfolio.Ngige had on April 19 publicly announced his presidential aspiration at his hometown Alor, Anambra State.\nHe also procured the ruling All Progressives Congress’ Expression of Interest and Nomination forms sold at N100m.Following President Muhammadu Buhari’s directive Wednesday that ministers nursing presidential ambition should resign on or before May 16, Ngige quickly announced that he would consult his constituents and meet with the President before taking a decision on resignation.Ngige who was at the valedictory session the President had with ministers who had political ambition Friday later issued a two-page statement annucing his withdrawal from the race in the “overall interest of the nation” and “other family reasons”.He said he had commmunicated his decision to the President and the Secretary to.the Government of the Federation.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "BREAKING: Sokoto Residents Plan Mass Protest Over Police Arrest Of Suspected Killers Of Female Student, Claim Suspects Were ‘Defending Islam, Prophet Muhammad’",
    "summarized_story": "Some residents of Sokoto State will on Saturday embark on a “mass” protest against the arrest of two people suspected to be involved in the killing of a female student of Shehu Shagari College of Education, identified as Deborah Samuel, for alleged blasphemy.\nFollowing the incident, the police in Sokoto said two suspects had been arrested and taken into custody.\nAccording to the Sokoto police spokesman, Sanusi Abubakar, the mob overpowered campus security before killing the female student and setting her remains on fire.\nSee Also Breaking News BREAKING: Police Confirm Arrest Of Suspected Killers Of Female College Student In Sokoto State Over BlasphemyHowever, a leaflet obtained by SaharaReporters on Saturday, written in Hausa, asked Muslims to come out en mass to protest against the arrest.\n“We’re inviting Muslims in Sokoto to come and help them rescue our brothers that were arrested because they were defending Islam and uplifting prophet Muhammad S.A.W,” the leaflet read."
  },
  {
    "headline": "BREAKING: Sokoto Residents Plan Mass Protest Over Police Arrest Of Suspected Killers Of Female Student, Claim Suspects Were ‘Defending Islam, Prophet Muhammad’",
    "summarized_story": "Some residents of Sokoto State will on Saturday embark on a “mass” protest against the arrest of two people suspected to be involved in the killing of a female student of Shehu Shagari College of Education, identified as Deborah Samuel, for alleged blasphemy.\nFollowing the incident, the police in Sokoto said two suspects had been arrested and taken into custody.\nAccording to the Sokoto police spokesman, Sanusi Abubakar, the mob overpowered campus security before killing the female student and setting her remains on fire.\nSee Also Breaking News BREAKING: Police Confirm Arrest Of Suspected Killers Of Female College Student In Sokoto State Over BlasphemyHowever, a leaflet obtained by SaharaReporters on Saturday, written in Hausa, asked Muslims to come out en mass to protest against the arrest.\n“We’re inviting Muslims in Sokoto to come and help them rescue our brothers that were arrested because they were defending Islam and uplifting prophet Muhammad S.A.W,” the leaflet read."
  },
  {
    "headline": "BREAKING: Jihadists In Borno Plot To Kill Another Young Woman For Alleged Blasphemy, Post Death Threats On Facebook",
    "summarized_story": "Some religious extremists in Borno State have threatened to kill a young woman, identified as Naomi Goni, after claiming that she allegedly insulted Prophet Muhammad (SAW) on Facebook.\nIn the Borno episode, SaharaReporters learnt that the police had taken Naomi Goni into custody over the death threats by the Jihadists.\nWriting partly in Hausa, Tanko Izge said, “A message to Government of Borno State.\nAkwai wata yarinya me suna Naomi Goni wanda tayi batanci ga manzo Allah wanda hakan a musulunci kisa ne hukunci Ko da soho ne koda musulmi ne ya kafurta.\nWe therefore call on the Borno State Government to take immediate action or else we Muslims will not sleep and we will take action).”He made the post on his Facebook as seen by SaharaReporters."
  },
  {
    "headline": "Atiku: Nobody would steal public funds if I'm elected president -- I swear!",
    "summarized_story": "Atiku Abubakar, former vice-president, says he would ensure that public money is not pilfered if elected president in 2023.\nAtiku spoke during a consultative meeting with delegates of the Peoples Democratic Party (PDP) in Port Harcourt, Rivers state capital, on Saturday.\nNot because we have not instituted institutions during PDP to make sure there is enough funding for these institutions.\nI will make sure nobody steals public money, I swear.\nHe accused the ruling party of being a one-sided government, saying this has caused disunity in the country."
  },
  {
    "headline": "Atiku: Nobody would steal public funds if I'm elected president -- I swear!",
    "summarized_story": "Atiku Abubakar, former vice-president, says he would ensure that public money is not pilfered if elected president in 2023.\nAtiku spoke during a consultative meeting with delegates of the Peoples Democratic Party (PDP) in Port Harcourt, Rivers state capital, on Saturday.\nNot because we have not instituted institutions during PDP to make sure there is enough funding for these institutions.\nI will make sure nobody steals public money, I swear.\nHe accused the ruling party of being a one-sided government, saying this has caused disunity in the country."
  },
  {
    "headline": "Deborah Samuel, Sokoto student killed for alleged blasphemy, buried amid tears",
    "summarized_story": "Deborah Samuel, a student of Shehu Shagari College of Education, Sokoto, who was murdered over alleged blasphemy, has been buried.\nSamuel was laid to rest on Saturday in her hometown in Tunga Magajiya, Rijau LGA of Niger state.\nAdvertisementA mob killed Deborah over alleged blasphemy on Thursday.\nOn Saturday morning, some Muslim youths in Sokoto took to the streets to protest the arrest of the suspects.\nAdvertisementSubsequently, Aminu Tambuwal, governor of Sokoto, declared a curfew in parts of the state to quell the unrest."
  },
  {
    "headline": "Deborah Samuel, Sokoto student killed for alleged blasphemy, buried amid tears",
    "summarized_story": "Deborah Samuel, a student of Shehu Shagari College of Education, Sokoto, who was murdered over alleged blasphemy, has been buried.\nSamuel was laid to rest on Saturday in her hometown in Tunga Magajiya, Rijau LGA of Niger state.\nAdvertisementA mob killed Deborah over alleged blasphemy on Thursday.\nOn Saturday morning, some Muslim youths in Sokoto took to the streets to protest the arrest of the suspects.\nAdvertisementSubsequently, Aminu Tambuwal, governor of Sokoto, declared a curfew in parts of the state to quell the unrest."
  },
  {
    "headline": "Aisha Buhari to APC: Don't use free nomination forms to sideline women",
    "summarized_story": "Aisha Buhari, first lady, has asked the All Progressives Congress (APC) not to sideline women in the contest for tickets for elective positions in 2023.\nAisha spoke on Saturday at a summit for APC female aspirants at the state house conference centre, Abuja.\nWomen interested in the ticket of the APC for elective positions are expected to only pay for the expression of interest form while the nomination form is free.\n“I appreciate and commend the recent party’s gesture in offering free nomination forms to female aspirants.\n“Get ready, get ready, because it’s time for us to take our seats at the table,” she said."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Google unveils first smartwatch, new phones, virtual cards and more",
    "summarized_story": "Google also announced updates to several of its most popular tools including Maps, Google Translate and its core search product.\nGoogle search which started from only text queries has over the years added the option to use voice and picture queries options.\nGoogle maps’ new immersive view for cities comes off as a challenger to Apple’s 3D mode map view.\nVirtual cardsSource: GoogleGoogle is rolling out virtual credit cards to help protect users’ financial information while they’re shopping online.\nThese virtual cards are typically used for one-time purchases, but users will also be able to use these cards for subscriptions."
  },
  {
    "headline": "Nigeria’s Central Bank edges close to eNaira use case with much-needed upgrade",
    "summarized_story": "Share this article:Nigeria’s central bank digital currency (CBDC), eNaira, will get an update that will allow it to perform more functions such as bill payment and USSD access.\n“Fundamentally, there were faults that would not have allowed the eNaira to achieve its full potential.”There were issues with setting up the eNaira Speed Wallet application at launch.\nOnly 1.3% had completed a transaction with the eNaira Wallet, while 34.4% were indifferent about the CBDC project.\nHow eNaira USSD could workWhile there’s little detail on how the eNaira will work with USSD, we can make educated guesses on how the service will work based on our understanding of the eNaira and USSD protocols in Nigeria.\nAccording to the CBN, the first tier of Speed Wallet users can set up a wallet without a Bank Verification Number (BVN)."
  },
  {
    "headline": "Interswitch raises $110m",
    "summarized_story": "Perhaps now’s a good time to ask how many fintech startups you know do not provide lending and payment options in Nigeria.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, has partnered with YC to give an account of its activities in Africa since 2009.\nThe fintech company is well known for its Point-of-Sale terminals and online consumer payment platforms like Quickteller and Verve.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than nine days!\nPolygon is sponsoring 50 free tickets to Techpoint Africa Blockchain Summit (TABS), holding on May 21, 2022."
  },
  {
    "headline": "Does Nigeria have too many fintech startups? What the numbers say",
    "summarized_story": "Share this article:There are at least 150 fintech startups in Nigeria, depending on who you ask.\nStatista reports that there were 144 fintech startups as of 2021 and a 2020 McKinsey report puts the number of standalone fintech startups at over 200.\nConsequently, it is not unusual to hear comments on the proliferation of fintech startups in the country, which begs the question, are there too many fintech startups in Nigeria?\nWhile the United States has 8,775 fintech startups for its 334.6 million people, the United Kingdom has 1,600 fintech startups serving 68.5 million people.\nLooking at the numbers, one could say that we need at least 1,000 more fintech startups in the country."
  },
  {
    "headline": "MARA Raises $23M to Build Africa’s Portal to the Crypto Economy",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMARA Chain – a layer-1 blockchain, powered by the native MARA token, that gives savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nThe MARA Chain will launch later in 2022, giving savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "5 Organisations providing ‘Tech’ and ICT solutions for SMEs in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nSMEDANSmall and Medium enterprise development agency of Nigeria commonly known as SMEDAN, organizes e-business and empowerment training for young entrepreneurs across Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "APC nets over N28 billion from sale of presidential, governorhsip, NASS forms",
    "summarized_story": "The All Progressives Congress (APC) has generated over N28 billion from the sale of expression of interest and nomination forms to presidential, governorship and National Assembly aspirants.\nAPC fixed the cost of presidential forms at N100 million, governorship for N50 million; Senate at N20 million and of Representatives for N10 million.\nAt the end of the sale and submission of forms, there are 28 presidential aspirants, 145 governorship contenders, 351 contestants for the senate and 1197 House of Representatives aspirants.\nThe sale of forms for the State Houses of Assembly is handled by the respective state secretariats of the party.\nArgungu also said the screening for the presidential aspirants begins on May 24, adding that some contenders for the highest office have started withdrawing from the race."
  },
  {
    "headline": "SEC bypasses public to issue crypto regulation in Nigeria",
    "summarized_story": "The Securities and Exchange Commission (SEC) on Friday released a new regulation for the cryptocurrency market in Nigeria.\nWhile it is the first of its kind in Africa, the SEC regulation is coming without an exposure draft.\nHowever, while the market was expecting an exposure draft to be made public first, the SEC has now issued final regulations.\nHowever, it did not make the draft public before releasing the final regulations on Friday.\nRead also: MTN Nigeria’s 10.7 million users boost fintech ambitionNonetheless, Owen Odia, Country Manager for Nigeria at Luno, one of the global cryptocurrency exchanges in Nigeria, sees the SEC regulation as a positive step for the cryptocurrency market in Nigeria."
  },
  {
    "headline": "CBN Governor, Emefiele withdraws his presidential bid",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele has withdrawn from the 2023 presidential bid, a credible source confirmed to BusinessDay.\nEmefiele’s final withdrawal came weeks after speculations were rife that he would contest for the seat during the upcoming general elections.\n“CBN Governor has withdrawn from the presidential race and has communicated his intention to continue as CBN Governor,” the source said.\nThough he declined comment after the meeting, Emefiele had told State House correspondents to expect an announcement any moment.\nI am having a lot of fun”, Emefiele said of his many critics who had called him to resign as the CBN Governor and face his political ambition."
  },
  {
    "headline": "Obaseki receives Saraki in Edo, as former Senate President meets Edo PDP delegates – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has received former Governor of Kwara State and ex-Senate President, Sen. Olubukola Saraki in the state.\nThe governor hosted Saraki, who is a presidential aspirant under the Peoples Democratic Party (PDP), at the Government House on Saturday, in Benin City.\nSaraki is to meet with PDP delegates in the state after the courtesy call on the governor.\nThe housing sector will stimulate the economy, create jobs for the youths and improve lives for the people.\n“My plan is to have vocational training for about one million people and stop importing workers in the housing sector."
  },
  {
    "headline": "Obaseki intensifies ongoing construction of Edo agric hub – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government will sustain investment in the agriculture sector in a renewed effort to attain food sufficiency, drive job creation and improve livelihoods.\nThe governor, who spoke to journalists in Benin City, said his government has intensified ongoing construction of the Edo Agricultural Development Hub, reassuring timely completion of the projectThe Edo State Commissioner for Agriculture and Food Security, Mr. Stephen Idehenre, who spoke on behalf of the governor, said the government has also completed the construction of an input warehouse to support agricultural production at the Edo Agricultural Development Hub.\nHe noted that the ongoing construction work on the Edo Agricultural Development Hub comprises administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others.\n“We have also established a Mechanization Hub, and purchased tractors and Harvesters to boost agricultural production and reduce drudgery.”“In addition to these programmes, we are making progress with the construction of the Edo Agricultural Development Hub.\nThe hub will house the administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others,” he added."
  },
  {
    "headline": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti election – Nigerian Observer",
    "summarized_story": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti electionShare FacebookTwitterStumbleuponLinkedInPinterestChairman of the Independent National Electoral Commission, INEC, Prof. Mahmood Yakubu has said the on-going continous voters registration exercise nationwide will be ending soon.\nAccording to the chairman, the ongoing Continuous Voter Registration (CVR) exercise will be ending on the 30th June 2022.\nThese Regulations and Guidelines, together with the Constitution and the Electoral Act, constitute the electoral legal framework that govern the conduct of elections.\n“There are many progressive provisions of the Electoral Act 2022 which require clear understanding to guide implementation.\n“Section 54(2) of the Electoral Act makes provision for assistive materials for Persons with Disabilities (PWDs)."
  },
  {
    "headline": "Gov Obaseki committed to special, inclusive education – Edo SUBEB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Stakeholders in the special education sector have chatted a roadmap with a view to making education available and accessable to every child irrespective of their disability and location in Edo state.\n“His Excellency is absolutely committed to special and inclusive education”, Salami said while describing the workshop as “timely”.\nExecutive Director of NAPVID, Barr Melody Omosah expressed appreciation to the governor for his administration’s partnership with the organization.\nAccording to Omosah, inclusive education is the core of inclusive governance hence NAPVID is working closely with the state government to ensure the mainstreaming of appreciable numbers of persons with disabilities into the public service is achieved.\n“I want to thank Mr governor for the partnership and we are over confident that this will be sustained throughout his term."
  },
  {
    "headline": "Nigeria’s GDP grows by 3.98% in Q4 2021— NBS",
    "summarized_story": "Nigeria’s Gross Domestic Product (GDP) increased by 3.98 per cent in the fourth quarter of 2021, according to figures from the National Bureau of Statistics (NBS) Quarterly Report released in Abuja on Saturday.\nThe report said Nigeria’s GDP grew by 3.98 per cent year-on-year in real terms in the fourth quarter of 2021.\n“The Q4 2021 growth rate was higher than the 0.11 per cent growth rate recorded in Q4 of 2020 by 3.87 per cent points and lower than 4.03 per cent recorded in Q3 of 2021 by 0.05 per cent points.\n“Nevertheless, quarter on quarter, real GDP grew at 9.63 per cent in Q4 of 2021 compared to Q3 of 2021, reflecting a higher economic activity than the preceding quarter.\nThe report revealed that the non-oil sector grew by 4.73 per cent in real terms during Q4 of 2021."
  },
  {
    "headline": "JUST IN: JAMB releases 2022 UTME results",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has released results of the 2022 Unified Tertiary Matriculation Examination (UTME).\nThe board which announced the release in a statement, also outlined process to check the results of the 2022 UTME which began on Friday, 6th May, 2022 and ended on Friday 13th May, 2022.\n“In addition, candidates are forewarned that they would, as usual, receive all kinds of messages from desperate fraudsters on how to check their results different from the aforementioned one.\nHence, the Board urge all candidates to ignore all such messages on how to check their 2022 UTME results as they are all products of deceit aimed at misleading them.\nThe board, he said, in line with its desire to adhere to the ease of doing business protocol of the government, has emplaced this user-friendly and simplified process of checking UTME results."
  },
  {
    "headline": "Sokoto: Tambuwal imposes curfew as violence erupts over arrest of Deborah’s killers",
    "summarized_story": "Aminu Tambuwal, Sokoto State governor, has imposed a 24-hour curfew on the state following a violence that erupted over the arrest of Deborah Samuel’s killers.\nSamuel, a female student of Shehu Shagari College of Education, was killed by a mob over alleged blasphemy on Thursday.\nSubsequently, the police command in Sokoto announced the arrest of two suspects in connection with the killing.\nBut on Saturday morning, some Muslim youths in Sokoto took to the streets to protest against the arrest of the suspects.\n“I appeal to the citizens of Sokoto state to kindly continue to observe law and order.”"
  },
  {
    "headline": "‘Greater synergy between book clubs and Libraries imperative for better readership outcomes’",
    "summarized_story": "For improved readership outcomes to be attained in Nigeria, there has to be a closer synergy between book clubs and libraries in the country, participants at a joining event convened by the Network of Book Clubs and Reading Promoters in Nigeria, NBRP as part of the Nigerian International Book Fair 2002 holding in Lagos, have emphasised.\nAmong the participants at the session were Booksellers Association of Nigeria, BAN President, Mr Dare Oluwatuyi; BAN Secretary, Henry Ekom Itauma: Director, African Libraries Institutions and Associations, Dr Nkem Osakwe; National Librarian, Prof Chinwe Anunobi; Chair, 774 Book Clubs and Libraries Project, Prof Felicia Etim; President, Network of Book Clubs and Reading Promoters in Nigeria, Mr Richard Mammah; founder, Uyo Book Club, Dr Udeme Nana and NBRP Secretary, Emmanuel Okoro."
  },
  {
    "headline": "Climate Change: Experts, stakeholders Urge Implementation Of Glasgow Accord",
    "summarized_story": "The Nigerian Academy of Engineering (NAEng) and other stakeholders in the environment sector have stressed the need to strengthen the platform for Climate Change mitigation through capacity development and provision of adequate funding.\nThe experts and stakeholders who spoke at a forum on ‘Climate Change, COP26 And The Nigerian engineer’ at a webinar organised by the NAEng in Lagos said there is a need for urgent take off of the outcomes of Climate Change summit held in Glasgow, Scotland (COP26) by putting into practice the recently approved Climate Change Act and Nigeria’s commitments to the United Nations’ Framework Convention on Climate Change (UNFCCC) and Paris Agreement.\n“Policy measures and documents were produced by the Federal government to address impacts of climate change and these include climate change act 2021, national climate change policy for Nigeria 2021-2030, Nationally Determined Contribution, and National Agency for the Great Green Wall (NAGGW) Act of 2015, National Strategy for REDD+ and recent United Nations Convention to Combat Desertification (UNCCD) meeting of COP15 in Cote d’Ivoire,” he said.\nHe emphasised that they must also develop and implement low GreenHouseGas (GHG) emission power supply, transportation systems and industrial facilities, low GHG agriculture, human and agriculture waste management and energy efficiency systems.\nThe Chairman, Engineering and Environment Management Services ltd, Prof. Samuel Adefila explained that climate change challenges could only be managed through trans-disciplinary application of Political, Economic, Social Technological, Legal and Environmental (PESTLE) as a framework to ensure the sustainability of human civilisation on earth."
  },
  {
    "headline": "Court Remands 5 NAHCO Staff In Prison For Drug Trafficking",
    "summarized_story": "Justice Ambrose Lewis-Allagoa of the Federal High Court in Lagos has remanded five employees of Nigerian Aviation Handling Company Plc (NAHCO) and staff of Skyway Aviation Handling Company Plc (SAHCO) in prison for allegedly conspiring unlawfully importing 886.85 kilograms of Tramadol into Nigeria.\nThe five NAHCO Officials are; Yunana Fidelis, Nyam Gazu Alex, Fasoranti Shola, Adesanwo Temitope and Owoseni Taiwo Temidayo, while the SAHCO staff arraigned with them is, Ifijeh John Mowa.\nThe prosecutor stated that the offences are contrary to sections 14 (b); 20 (1)(a); 20 (1) (c)of the National Drug Law Enforcement Agency Cap.\nN30, Laws of the Federation of Nigeria, 2004 and punishable under Section 20 (2) (a) of the said Act.\nThe judge also ordered that the defendants be remanded in the custody of the Nigerian Correctional Services (NCOS) pending the ruling."
  },
  {
    "headline": "Abia Lags Behind 30 Years After Creation – Guber Aspirant – Leadership News",
    "summarized_story": "A 2023 Abia State Accord Party governorship aspirant, Bishop Emeka Nwankpa, has said 30 years after its creation, the state lags terribly behind in all spheres of life.\nNwankpa stated this in Umuahia yesterday when he announced his aspiration for the office, describing the situation in the state as irritating and nauseating.\nReading an address titled; “My mission and vision for Abia State” the second clergyman to indicate interest in the seat said the state had no Government House of its own and the water taps are ever dry.\n“The workers which include the core civil servants, parastatals and agencies, primary, secondary and tertiary institutions, health workers and pensioners are owed several months salary arrears and pension,” he said.\nHe said Nwankpa’s indication of interest for the office was a response to his prayer, adding that God was about doing a new thing in the state."
  },
  {
    "headline": "Abia Lags Behind 30 Years After Creation – Guber Aspirant – Leadership News",
    "summarized_story": "A 2023 Abia State Accord Party governorship aspirant, Bishop Emeka Nwankpa, has said 30 years after its creation, the state lags terribly behind in all spheres of life.\nNwankpa stated this in Umuahia yesterday when he announced his aspiration for the office, describing the situation in the state as irritating and nauseating.\nReading an address titled; “My mission and vision for Abia State” the second clergyman to indicate interest in the seat said the state had no Government House of its own and the water taps are ever dry.\n“The workers which include the core civil servants, parastatals and agencies, primary, secondary and tertiary institutions, health workers and pensioners are owed several months salary arrears and pension,” he said.\nHe said Nwankpa’s indication of interest for the office was a response to his prayer, adding that God was about doing a new thing in the state."
  },
  {
    "headline": "Soludo Appeals For Support On Medical Facilities",
    "summarized_story": "The Anambra State Governor Professor Chukwuma Soludo has appealed for support from wealthy indigenes of the state to provide efficient health facilities to the people of the state.\nCommending Sir Okwuosa for providing a hospital properly equipped with top class hospital facilities that can even handle critical cases including open heart surgery, Soludo promised that his administration would support the hospital to ensure that it does not lack medical professionals that would put the facilities into proper use to save the people of the state and Nigerians at large from seeking medical treatment overseas.\nEarlier in his address, Sir Okwuosa stated that he was motivated by the concern his late mother always showed whenever she saw a sick person to found the hospital, adding that was why he named the hospital after her: Dame Irene Memorial Hospital.\nHe stated that in addition to providing efficient medical services, especially handling critical cases like heart surgery, the hospital would provide about 100 direct job opportunities, 500 businesses and healthcare to about 3,000 patients annually.\nOur nurses and doctors are under instruction not to reject any patient on account of money but to save life first”, Sir Okwuosa stated further"
  },
  {
    "headline": "Just IN: Buffalo Tops shooter identified after killing 10 people",
    "summarized_story": "An 18-year-old white gunman, identified as Peyton Gendron was the shooter at Tops, a grocery store in a Black neighbourhood of Buffalo, New York.\nStephen Belongia, the FBI special agent in charge of the bureau’s Buffalo field office, said the attack would be investigated both as a hate crime and as an act of “racially motivated violent extremism” under federal law.\n“It was a straight-up racially motivated hate crime from somebody outside of our community.”The suspect was expected to make his first court appearance to face murder charges by day’s end, officials said.\n“This is a day of great pain for our community,” Buffalo Mayor Bryon Brown told reporters.\nU.S. Representative Jerry Nadler, a New York Democrat and chairman of the House Judiciary Committee, said the attack appeared to be the work of a violent white supremacist."
  },
  {
    "headline": "COVID-19 kills scores in North Korea, infections balloon",
    "summarized_story": "North Korea said on Sunday a total of 42 people had died as the country began its fourth day under a nationwide lockdown aimed at stopping the impoverished country’s first confirmed COVID-19 outbreak.\nSo far 820,620 suspected cases have been reported, with 324,550 still under medical treatment, state news agency KCNA said.\nExperts say North Korea appears to lack the capacity to test those tens of thousands of symptomatic patients.\nKCNA did not report how many of those suspected cases had tested positive for COVID-19.\nNorth Korea had previously claimed no confirmed cases of the virus, and is one of only two countries in the world that have yet to begin a COVID vaccination campaign, according to the World Health Organization."
  },
  {
    "headline": "BREAKING: Jihadists In Borno Plot To Kill Another Young Woman For Alleged Blasphemy, Post Death Threats On Facebook",
    "summarized_story": "BREAKING: Jihadists In Borno Plot To Kill Another Young Woman For Alleged Blasphemy, Post Death Threats On FacebookSome religious extremists in Borno State have threatened to kill a young woman named Naomi Goni, accusing her of insulting Prophet Muhammad (SAW) on Facebook.\nIn the Borno episode, SaharaReporters learnt that the police had taken Naomi Goni into custody over the death threats by the Jihadists.\nWriting partly in Hausa, Tanko Izge said, “A message to Government of Borno State.\nAkwai wata yarinya me suna Naomi Goni wanda tayi batanci ga manzo Allah wanda hakan a musulunci kisa ne hukunci Ko da soho ne koda musulmi ne ya kafurta.\nWe therefore call on the Borno State Government to take immediate action or else we Muslims will not sleep and we will take action).”He made the post on his Facebook as seen by SaharaReporters."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Terrorists Free Pregnant Woman Among Abducted Passengers",
    "summarized_story": "Terrorists who kidnapped and attacked passengers on an Abuja-Kaduna train have released one of their captives, a pregnant woman.\nThe woman was reportedly let free, though it is unclear whether her family members paid a ransom.\nMeanwhile, a woman dressed in black Muslim robes and wearing a face mask claimed that the terrorists had released her due to her health.\nShe urged the Nigerian authorities to talk with the kidnappers in order to free the other victims held captive in their cave.\nThe terrorists are taking care of us; they feed us well and give us our medication.”It could be recalled that the terrorists attacked a train on the Abuja-Kaduna Railway on March 28, where at least eight passengers were killed in the incident."
  },
  {
    "headline": "BREAKING: Sokoto Residents Plan Mass Protest Over Police Arrest Of Suspected Killers Of Female Student, Claim Suspects Were ‘Defending Islam, Prophet Muhammad’",
    "summarized_story": "Some residents of Sokoto State will on Saturday embark on a “mass” protest against the arrest of two people suspected to be involved in the killing of a female student of Shehu Shagari College of Education, identified as Deborah Samuel, for alleged blasphemy.\nFollowing the incident, the police in Sokoto said two suspects had been arrested and taken into custody.\nAccording to the Sokoto police spokesman, Sanusi Abubakar, the mob overpowered campus security before killing the female student and setting her remains on fire.\nHowever, a leaflet obtained by SaharaReporters on Saturday, written in Hausa, asked Muslims to come out en mass to protest against the arrest.\n“We’re inviting Muslims in Sokoto to come and help them rescue our brothers that were arrested because they were defending Islam and uplifting prophet Muhammad S.A.W,” the leaflet read."
  },
  {
    "headline": "Petroleum minister, Timipre Sylva forced to resign, submits presidential form",
    "summarized_story": "Timipre Sylva, the minister of state for Petroleum Resources, has been forced to resign from the cabinet of President Muhammadu Buhari, News Direct reports.\nAlso on the list were former minister of Transportation, Rotimi Amaechi; former minister of Niger Delta Development, Sen. Godswill Akpabio; former Imo State governor, Sen. Rochas Okorocha; and former Ogun State governor, Sen. Ibikunle Amosun.\nOthers were Pastor Tunde Bakare; Cross River State governor, Prof. Ben Ayade; his Ebonyi State counterpart, Gov.\nDave Umahi; Chairman, Nigeria Governors Forum (NGF) and Ekiti State governor, Dr. Kayode Fayemi; Minister of State, Education, Hon.\nEmeka Nwajiuba; former Senate President, Sen. Ken Nnamani; Kogi State Governor, Yahaya Bello; Jigawa State Governor Mohammed Badaru Abubakar and former Zamfara State governor, Sen. Ahmed Yerima."
  },
  {
    "headline": "Breaking: Liverpool squeeze victory vs Chelsea, win FA Cup on penalties",
    "summarized_story": "Liverpool kept alive hopes of an unprecedented quadruple as Konstantinos Tsimikas struck a sudden-death penalty winner to earn victory over Chelsea in the FA Cup final.\nFollowing the grilling victory, Liverpool have become the first club to win the League Cup and the FA Cup in the same season multiple times.\nAnd Chelsea have become first club to lose three consecutive FA Cup final.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "In Kaduna, El-Rufai bans religious protests, reveals what will happen to violators",
    "summarized_story": "Kaduna state government on Saturday placed indefinite ban on religious protests across the state, while warning that violators will be prosecuted accordingly.\n“The Kaduna state government, in consultation with security agencies under the umbrella of the Kaduna state Security Council, has placed a ban on protests related to religious activity throughout the state with immediate effect.\nThis prohibition becomes imperative in view of moves by some unpatriotic elements to organise series of for-and-against protests related to a security development in one of the Northern Nigerian states.\n“Security agencies have thus resolved that any attempt by individuals or groups to disrupt the peace and stability of the state, by way of religious protests, will not be condoned.\n“Citizens are implored to remain calm as they go about their lawful pursuits, and to immediately report any such activity or security concern to the Kaduna state security operations room, on 09034000060 and 08170189999.”Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Tambuwal declares 24-hour curfew in Sokoto as protests go wild",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal, on Saturday afternoon, declared 24 hours curfew across the state after protest by the youths against the arrest of suspects allegedly involved in the killing of Deborah Yakubu Samuel, resulted to violence.\nThis was announced via the official Facebook handle of the Special Adviser Media and Publicity to the Governor, Muhammad Ahmad Bello.\nProtests broke out in Sokoto as youths continue to express anger over the alleged abusive remark that led to the killing of female student on 12 May, 2022.\nMs Deborah, a student of Shehu Shagari College of Education Sokoto state, die on Thursday when angry mob killed her after she was accused of alleged blasphemy against Prophet Muhammad.\nShare this: TwitterFacebook"
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "Nigeria set to become destination for medical tourism, reverse brain drain – Mohammed",
    "summarized_story": "By Palma IleyeMinister of Information and Culture, Alhaji Lai Mohammed, has said that with the establishment of world class healthcare facilities in Nigeria, the country was set to become a destination for medical tourism, in addition to reversing the brain drain in the health sector.\nMohammed who spoke after a media tour of Duchess International Hospital in Lagos, said the world class healthcare facilities springing up in Nigeria will also curb medical tourism abroad, conserve foreign reserves and create jobs.\n“Today, we are here at the Duchess International Hospital.\nThe Minister said the Federal Government, through the Central Bank of Nigeria and the Bank of Industry, provided financial support for Duchess International Hospital, as part of its intervention in the health sector.\n“With that, we can conserve our foreign reserves, earn foreign exchange for the country, create jobs, reverse brain drain, become a destination for medical tourists and also ensure affordable and standard healthcare for Nigerians,” he said."
  },
  {
    "headline": "Halo financial services launches into Nigeria Fintech space",
    "summarized_story": "By Kehinde Ibrahim, LagosHALO Financial Services Ltd, a fintech start-up has launched with an innovative approach to help Nigerians manage and grow their money.\nSpeaking at a media round table to introduce the company, the Chief Executive Officer and co-founder, Chidimma Onyeokoro disclosed that Halo enables communities to provide financial services to their members.\nCommunity members are able to leverage the strength of their union for better financial returns.\nBy focusing on communities, Halo will be able to scale faster.\nThis allows us to offer a full spectrum of financial services from basic banking to sophisticated investments."
  },
  {
    "headline": "Sokoto: Bishop Kukah Says He Is Safe, House Not Burnt As Curfew Commences",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Mathew Kukah, on Saturday said he is safe after protests rocked parts of Sokoto city over the detention of two persons linked to the gruesome killing of Deborah Samuel.\nContrary to some reports online, the Bishop also told Channels Television that his house was not set ablaze.\nIn a statement sent to Channels Television, Kukah called for calm and commended Governor Aminu Tambuwal for acting promptly by declaring the curfew.\nHe noted that all Masses in Sokoto metropolis have been suspended until the curfew is lifted.\nCalm returningMeanwhile, calm appears to be returning to Sokoto city after the earlier violence, according to a Channels Television correspondent in the city."
  },
  {
    "headline": "Deborah’s Killing: Tambuwal Declares 24-Hour Curfew In Sokoto Metropolis",
    "summarized_story": "﻿Governor Aminu Tambuwal of Sokoto State has declared a 24-hour curfew within the metropolis in a bid to prevent a curtail further spread of civil unrest trailing the death of Miss Deborah Samuel.\nHe announced the curfew on Saturday at the Government House in Sokoto, the state capital.\nGovernor Aminu Tambuwal of Sokoto State has declared a 24-hour curfew within the metropolis in a bid to prevent a curtail further spread of civil unrest trailing the death of Miss Deborah Samuel.He announced the curfew on Saturday at the Government House in Sokoto, the state capital.\nDeborah, a second-year student of the Shehu Shagari College of Education in Sokoto State, was killed on Thursday following an allegation that she had blasphemed Muhammad (SAW), the prophet of Islam.\n“I appeal to the good people of Sokoto state to kindly continue to observe law and order and calm down (on the) restiveness currently pervading in the metropolis."
  },
  {
    "headline": "Deborah Samuel: El-Rufai Bans Religious Protests In Kaduna",
    "summarized_story": "The Kaduna State Government has banned all forms of protests related to religious activities across the state.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said in a statement that the ban, which is with immediate effect, was done in consultation with the State Security Council.\nHe explained that the prohibition of all forms of religious protests becomes imperative in view of moves by some unpatriotic elements to organize series of for-and-against protests related to a recent security development in another northern state.\n‘Remain calm’According to Aruwan’s Saturday statement, Governor Nasir El-Rufai who has been briefed of the development, has charged security agencies to ensure strict enforcement of the ban on religious protests.\n“Citizens are implored to remain calm as they go about their lawful pursuits, and to immediately report any such activity or security concern to the Kaduna State Security Operations Room, on 09034000060 and 08170189999”."
  },
  {
    "headline": "Malami Withdraws From Kebbi Governorship Race, Cites Patriotism For Decision",
    "summarized_story": "The Attorney General of the Federation and Minister of Justice, Abubakar Malami on Saturday said he has withdrawn from the Kebbi Governorship race.\nAccording to a statement signed by his spokesperson, Umar Jibrilu Gwandu, Malami cited “altruism and patriotism” as reasons for his decision.\nREAD ALSO: Nine Ministers Seeking Elective Positions Resign After Buhari’s Order“Attorney General of the Federation and Minister of Justice, Abubakar Malami has not resigned,” Gwandu’s Saturday statement said.\n“Right thinking members of the society accord respect to individual’s right to freedom of choice in matters relating to this.\n“The decision is not only a demonstration of altruism and patriotism, but of contentment, self-control, placidity and decisiveness in problem-solving at a time shrouded with confusing and competing stimulus."
  },
  {
    "headline": "Finland Seeks To Reassure Russia About NATO Bid",
    "summarized_story": "Finland on Saturday sought to allay Moscow’s fears about its bid to join NATO, as fierce fighting raged in Ukraine’s east, slowing a Russian advance.\nEarlier, in a phone call initiated by Helsinki, President Sauli Niinisto had a “direct and straightforward” conversation with Russian president Vladimir Putin.\nPutin, however, told him that Finland joining NATO would be a “mistake”, insisting that Russia posed “no threat to Finland’s security”, the Kremlin said.\nKharkiv regional governor Oleg Synegubov meanwhile said in a video on Telegram that Ukrainian forces were counterattacking in the direction of the northeastern city of Izyum.\nUkraine’s military intelligence chief, Major General Kyrylo Budanov, said the months ahead could prove decisive."
  },
  {
    "headline": "APC Screening for NASS, Governorship candidates Starts in Abuja -",
    "summarized_story": "The All Progressives Congress.APC, has inaugurated the screening committees for its House of Representatives, Senate and Governorship aspirants.\nThe committees were inagurated on Saturday and have since commnced work.https://www.tvcnews.tv/purplegold/post.php?post=197134&action=edit#The screening exercise for each of the three committees has since commenced at various designated centres in Abuja.\nA statement by the National Organising Secretary of the APC, Sulaiman Muhammad Argungu, in Abuja indicated Chairmen and Secretaries of the committees will be inaugurated by noon while the screening exercise will begin immediately at various centres.\nAspirants for the House of Representatives will be screened at Zeus Paradise Hotel, Mabushi, in Abuja while Senatorial and governorship aspirants will have their exercise carried out at Fraser Suites, within the Central Business District, Abuja.\nThe publication of the screening exercise is expected to be released on Sunday."
  },
  {
    "headline": "Why I deleted tweet condemning murder of Sokoto student",
    "summarized_story": "The People’s Democratic Party’s Presidential Hopeful, and former Vice President, Atiku Abubakar says the directive to pull down the reaction to the killing of Sokoto College student, Deborah Samuel should not be misconstrued for condoning religious intolerance.\nThe former vice president said he has been loud on religious issues that tend to divide NigeriansMr. Abubakar spoke, this Friday when he visited Governor Godwin Obaseki in continuation of his effort to woo delegates ahead of the PDP presidential primaries"
  },
  {
    "headline": "DSS Distances Self from alleged Tenure Elongation plot -",
    "summarized_story": "The Department of State Services (DSS) has distanced itself from media reports that it called for the elongation of the tenure of President Muhammadu Buhari.\nIn a press statement e-signed and released to the National Association of Online Security News Publishers, NAOSNP by the Service’s Spokesperson, Peter Afunanya on Thursday stated that, “The attention of the Department of State Services (DSS) has been drawn to a misleading and mischievous publication by SaharaReporters titled Nigeria’s Secret Police, DSS Tests the Water on Tenure Elongation for Buhari, Tells Journalists, CSOs 2023 Elections May Not Hold.\nIn the said report, the Service was accused of informing participants at its April 6th brainstorming session with CSOs/NGOs that the 2023 general elections might not hold due to insecurity.\nThe Online paper, in its characteristic gutter journalism, had initially claimed that participants at the session were harassed.\nWhile the Service, in the circumstance, aligns with the Presidency, it urges the public to disregard the lies of SaharaReporters and its promoter whose activities are usually antithetical to a decorous environment.https://www.tvcnews.tv/purplegold/post-new.php#It is common knowledge that SaharaReporters is mischievously desperate and takes delight in promoting negative narratives against Government and its officials."
  },
  {
    "headline": "Soldier arrested for Selling live ammunition to Bandits in Zamfara -",
    "summarized_story": "The Nigerian Army has Arrested a Serving Soldier selling ammunition to Bandits in Zamfara State.\nThe suspect was arrested by Military Police on Wednesday around Galadi village in Shinkafi local government area of the stateA reliable source who pleaded annoynimity told TVC News that the Soldier has confessed to the crimeDuring interrogation he says he sell each of 7.62mm special ammunition for one thousand naira to terroristsHe was arrested with one thousand live ammunition set to deliver to terrorists for one Million Naira."
  },
  {
    "headline": "Mike Ozekhome: You Cannot Add or Subtract from The Constitution",
    "summarized_story": ""
  },
  {
    "headline": "The Return of The Charly Boy Show",
    "summarized_story": ""
  },
  {
    "headline": "48 Days After, 67 Kaduna Train Passengers Still with Terrorists; Relatives, Sheikh Gumi Beg FG to Meet Demands of Captors",
    "summarized_story": "He said: “We are sick, tired and frustrated by not having our loved ones for almost 50 days now.\nWe are appealing to the government to bring back our loved ones.\nWe are appealing to the bandits to please free our loved ones.\nGumi, who led the Muslim prayer, assured the families of the kidnapped passengers that the prayers would make the captives feel divine presence as God would comfort them.\nHe urged government to meet the terrorists’ demands so that the victims, who had spent over 40 days in their den, can regain their freedom."
  },
  {
    "headline": "Nigeria: AfDB President Adesina and Senate President Lawan In; Jonathan and Emefiele Out, as 25 APC Presidential Aspirants Submit Forms – Arise News",
    "summarized_story": "Twenty five presidential aspirants on the platform of the All Progressives Congress (APC) beat the deadline for the submission of forms ahead of the party’s primary slated for May 30 to June 1.\nParty sources revealed that former President Goodluck Jonathan, the Governor of Central Bank of Nigeria, Godwin Emefiele and the Minister of Labour and productivity, Dr. Chris Ngige did not submit their forms.\nThe aspirants that submitted forms are former governor of Lagos State, Bola Tinubu; Vice President Yemi Osinbajo; former Minister of Transportation, Rotimi Amaechi; former Minister of Niger Delta, Godswill Akpabio; former Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu; former Imo State governor, Rochas Okorocha and former Ogun State governor, Ibikunle Amosun.\nOthers are Pastor Tunde Bakare; Cross River State Governor, Ben Ayade; his Ebonyi State counterpart, Dave Umahi; Ekiti State Governor, Kayode Fayemi; former Minister of State, Education, Emeka Nwajiuba; former Senate President, Ken Nnamani; Kogi State Governor, Yahaya Bello;Jigawa State Governor, Mohammed Badaru Abubakar and former Zamfara State governor, Ahmed Yerima.\nAlso on the list of presidential aspirants that filed their papers are Senator Ajayi Borroffice; the only female aspirant, Uju Kennedy Ohnenye; Pastor Nicholas Felix Nwagbo; former Speaker of Representative, Dimeji Bankole; President of the Senate, Ahmed Lawan; AfDB President, Akinwumi Adesina; former Minister of State, Petroleum, Timipre Sylva, former Minister of Information, Chief Ikeobasi Mokelu and Tein Jack Rich."
  },
  {
    "headline": "Buhari Demands Impartial, Extensive Probe into Deborah’s Murder, Says Violence Doesn’t Solve Problems",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has reacted to the murder of Deborah Samuel, a 200-level female student of Shehu Shagari College of Education, Sokoto, by some fanatical students of the same school for allegedly blaspheming Prophet Muhammad (SAW) in a Whatsapp post.\nIn a release issued by his spokesman, Mallam Garba Shehu, Buhari said the news of the killing of Deborah by fellow students was a matter of concern and demanded an impartial, extensive probe into all that happened before and during the incident.\n“Moreover, religious leaders preach that it is not for the believer to judge the actions of another person.\n“No person has the right to take the law into his or her own hands in this country.\nViolence has and never will solve any problem,” said the President."
  }
]