[
  {
    "headline": "June 12: There’s nothing to celebrate, says Kaigama",
    "summarized_story": "Ignatius Kaigama on Sunday said there was nothing to celebrate on Nigeria’s democracy day because of corruption, hunger and other vices which have become a norm.\nAccording to him, Nigeria was near collapse as the high level of inflation, unemployment, and hunger have remained worrisome.\n“How do we celebrate in the midst of escalating prices of essential commodities, hunger and unemployment?\nHow do we celebrate democracy when yet-to-be-identified gunmen pose such a grievous setback in our march towards harmonious and peaceful co-existence?\nHow do we celebrate when corrupt governance and insecurity threaten the present and future of Nigerians?"
  },
  {
    "headline": "Gombe board ends orientation for intending Muslim pilgrims",
    "summarized_story": "The Gombe State Muslim Pilgrims Welfare Board on Sunday, concluded the education and orientation exercise for 2022 intending pilgrims, ahead of its desire to airlift participants from June 20 to 21, 2022.\nThe exercise, which was conducted in phases, enabled the intending pilgrims to become acquainted with Hajj rites as well as other guidelines stipulated by relevant authorities for the successful conduct of the religious exercise.\nThe final exercise witnessed the practical aspect where scholars led the intending pilgrims on a mock Hajj exercise using facilities provided for that purpose at the Arabic Teachers College, Gombe.\nSpeaking earlier, an Islamic Scholar, Yahaya Haruna, trained the intending pilgrims on how to practically perform Dhawaf.\nOn his part, the newly appointed chairman of the board, Emir of Dukku, Haruna Rasheed, emphasised the need for all the intending pilgrims to follow the rules and regulations laid by the Kingdom of Saudi Arabia."
  },
  {
    "headline": "‘I never expected it’, says Ayrubber after grand reception in Ghana",
    "summarized_story": "Adedoyin Ayomide Samuel, better known as Ayrubber, who is TikTok Nigeria’s Creator Operations Manager, has expressed total surprise over the unusually royal-themed reception he received in Ghana during an official trip recently.\nAyRubber visited the country with some members of his team for familiarisation tour and collaboration.\nAyrubber was then given a rousing welcome by the team in Ghana.\nAyrubber and his team were hosted at the magnificent Kempinski Hotel at the Gold Coast city.\nThe Nigeria Institute of Journalism in Lagoa graduate was also hosted to a welcoming reception by TikTok Ghana, after which he was dressed in one of the country’s most exquisite attire and adorned in royalty to commemorate 2022 African day."
  },
  {
    "headline": "Democracy Day: Osun civil societies coalition seeks security, free, fair elections",
    "summarized_story": "It is unfortunate that 29 years after the annulment of June 12, Nigeria is still far from its expected development pedestal.\n“The primary responsibility of every government is provision of adequate security for the protection of lives and property.\nWith starring facts and incidents, Nigeria is far from winning the war against insurgencies, banditry, kidnapping, armed robbery, etc.\n“Surprisingly, the Commissioner of Police, Mr. Wale Olokode, has always been manipulating facts on cases of police brutality and extrajudicial killings.\n“Equally, we want CP Wale Olokode to be transferred out of Osun because of his brazen neglect and continued shield for his trigger-happy officials."
  },
  {
    "headline": "Jettison sentiments that threaten our unity — Oyetola tells residents",
    "summarized_story": "Osun State Governor, Adegboyega Oyetola, has enjoined Nigerians to jettison sentiments, which he described as obstacle to the unity, peace and progress of Nigeria.\nOyetola spoke at Aurora Event Centre, Osogbo, on Sunday, during a democracy lecture organized by the Osun State Government in conjunction with the civil society coalition.\nNigeria can rise from the rubble of failures and missteps of yesterday and reach its greatest heights.\nBut to achieve this, we need to jettison the age-old primordial sentiments that continue to threaten our unity, peace, and progress.\nHe said, “the excessive number of legislators, failure to restructure the civil and public service, massive corruption at every level of governance, the monumental corruption in the oil industry corruption, etc."
  },
  {
    "headline": "PVC: Tinubu not responsible for attack on Ndigbo in Lagos — Ebonyi Reps member insists",
    "summarized_story": "… Ndigbo are not third class citizensBy Peter Okutu, AbakalikiThe Member representing Ikwo/Ezza South Federal Constituency at the National Assembly, Hon.\nDisclosing this in a statement, the APC Stalwart and lawmaker called on the general public to disregard the online publication on the APC presidential candidate, even as he described the news as an act falsehood and sabotage.\nHe has made series of nominations into President Buhari’s Cabinet and Federal parastatals as it concerns the welfare and appointment of Ndigbo.\nHis love for Ndigbo is also seen in the appointment of Ndigbo into the present administration in Lagos State.\nIgbo Stakeholders in APC will support him during election and we believe that he will win.”"
  },
  {
    "headline": "Group takes PVC campaign to Somolu, Epe, Ikorodu",
    "summarized_story": ",By Miftaudeen RajiAs the 2023 general elections draw nearer, Lagos East Progressive Forum (LEPF) has commenced a robust civic awareness and PVC registration drive with the Lagos East Senators District.\nThe campaign was initiated, in partnership with the Office of the lawmaker representing the District in National Assembly, Tokunbo Abiru.\nMeanwhile, in his Democracy Day message, Abiru called on Nigerians to foster national unity, stressing that there is stillhope for the nation.\nHe said, “I join esteemed constituents of the Lagos East Senatorial District and Nigerians in general in commemorating 2022 Democracy Day.\nThe challenges notwithstanding, we should not be quick to dismiss commemoration of Democracy Day especially the tortuous June 12 struggle as non-event."
  },
  {
    "headline": "Kidnapping: Akwa Ibom to rejig security apparatus",
    "summarized_story": "The Akwa Ibom State Government has promised to rejig the security architecture in the state in order to tackle new wave of crimes and criminality in the state.\nThe governor, who was represented by the 2023 governorship candidate of the Peoples Democratic Party, Pastor Umo, said security agencies are still trailing the kidnappers.\nHe explained, however, that despite the challenging security situation in most parts of the country, Akwa Ibom has enjoyed a high level of peace in the state.\nAccording to him government has invested a lot of resources in the area of security which has also yielded appreciable results in the state.\nNarrating his ordeal in the kidnappers’ den, Okoriko said, “The painful experience began on Tuesday, 19 April, 2022."
  },
  {
    "headline": "Owo massacre: South West governors meet, take actions",
    "summarized_story": "Governors of the South West have taken actions against the security challenges facing the region, with a view to stemming the tide of banditry, kidnapping and terror attacks in the region.\nThe governors, at a virtual meeting held on Friday deliberated extensively on the rising wave of insecurity in the country, especially the South West.\nBaffled by the attack on St. Francis Catholic Church, Owo, Ondo State, the governors called for immediate intervention in the whole of the South West.\nThey lamented that the South West have been taken over by some unidentified and unknown migrants.\nAfter reviewing reports from each state in the South West on the factors militating against peace and security in the region, the governors “expressed grave concern on the influx of Okada riders into all parts of the South West, especially the State capitals.”As a result, it was recommended that efforts should be geared toward identity management of commercial motorcyclists, while stringent regulation be put in place to regulate their operation."
  },
  {
    "headline": "2023: OPM church begins operation show your PVC, bars members from accessing facilities",
    "summarized_story": "“All traders in OPM Divine market will not be permitted to sell in the market if he or she does not have PVC.\n“All parents that their children attend OPM free schools have 7 days to get their PVC to revalidate their children’s admission in OPM free schools.\n“Everyone coming to OPM Free Specialist Hospitals, before you register, you must present your PVC and that of your husband.\nWithout your PVC, you will not be registered and old patients have 7 days to present there PVC.\n“For now, I can only penalize those benefiting from OPM free programmes, not OPM staff."
  },
  {
    "headline": "You goofed, exibihited ignorance – JAMB slams ASUU President, Osodeke",
    "summarized_story": "The Joint Admissions and Matriculation Board, JAMB, on Sunday said the President of the Academic Staff Union of Universities, ASUU, Prof. Emmanuel Osodeke, “goofed” over his recent comment on admission into universities.\nJAMB made the remark while denying conducting the admission process for universities.\nThe body said contrary to Osodeke’s claim; it regulates the process of admission into universities across the country.\nAccording to Benjamin: “The attention of the Joint Admissions and Matriculation Board (JAMB) has been drawn to the ill-informed statement made by the rattled President of the Academic Staff Union of Universities (ASUU), Prof. Emmanuel Osodeke.\nHe betrayed his acute ignorance of the admission process into tertiary institutions in the country when he appeared on a programme of one of the radio stations in Abuja on Saturday, 11th June 2022."
  },
  {
    "headline": "June 12 more than just a date – Senate President, Lawan",
    "summarized_story": "As Nigerians celebrate this year’s Democracy Day, the Senate President, Ahmad Lawan, has reminded them that June 12 was more than just a date.\n“The statement of that day propelled us into the longest period of democracy in our nation’s history.\n“Our goal should be to build our nation with the bricks of equity, fairness and justice, so that it can withstand challenges as they may come,” he added.\n“We believe that once we build the necessary safeguards and strengthen the confidence of Nigerians in the process, the outcomes will always represent their wishes,” Lawan stressed.\nHe, however, enjoined all and sundry to work for and be optimistic for the success of the next year’s elections."
  },
  {
    "headline": "States to share World Bank’s $750m facility",
    "summarized_story": "In continuation of its efforts to encourage transparency and accountability by states governments, the World Bank is set to release $750 million, it was learnt at the weekend.\nThe facility is the second tranche of a $1.5 billion plan between the World Bank and the Federal Government, which intention is, apart from fiscal transparency, is sustainable growth.\nThe incentivized scheme known as States Fiscal Transparency Accountability and Sustainability (SFTAS) is a conditional grant with the states expected to achieve certain Disbursement Linked Indicators (DLIs) in order to qualify for the new disbursement in 2022.\nAlso, further evaluation of earlier disbursements to determine how the first tranche was utilised will be conducted in some states by the World Bank.\nThe World Bank is supporting the federal government with the two-tranche $1.5 billion to incentivise the states to properly achieve federal government’s 22-point Fiscal Sustainability Plan."
  },
  {
    "headline": "Southwest governors draw battle plan against terrorists",
    "summarized_story": "The meeting resolved to tackle terrorism vigorously to prevent a repeat of the Owo killings.\nThey also directed the regional security outfit, Amotekun, to contain the influx of Okada riders into the six states.\n“They expressed grave concern on the influx of Okada riders into all parts of the Southwest, especially the state capitals.\n“Consequently, the Forum decided it was time to reconvene the Southwest Security Committee to look critically into this creeping menace before it blossoms into another intractable social problem.\n“The Forum agreed to convene forthwith a physical meeting of the Southwest governors to deliberate on the security challenges confronting the region.”"
  },
  {
    "headline": "Umahi under fire for attacking Ohanaeze president Obiozor",
    "summarized_story": "By Nwanosike Onu, Awka; Damian Duruiheoma, Enugu and Chris Njoku, OwerriEbonyi State Governor David Umahi came under fire yesterday for attacking President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor.\nUmahi, speaking at the maiden matriculation of King David University of Medical Sciences, accused the Ohanaeze leadership of abandoning the Southeast president project.\n“First of all, Prof Obiozor was not at the convention and is not the governor’s personal President General but President General of Ohanaeze Ndigbo which covers all the states.\n“Governor Umahi expected Prof Obiozor to present him to the President when he visited Ebonyi, but Prof Obiozor could not honour his invitation to make such pronouncement.\n“Prof Obiozor could not have presented Umahi to the President when other aspirants were also bent on contesting the primary election.”"
  },
  {
    "headline": "Owo massacre: Security beef up around churches in Osun",
    "summarized_story": "Osun State has beefed up security around and within worship centres to prevent a similar occurrence.\nThe measures include; the setting up of a security committee, which may comprise government security personnel, disallowing baggage in the church auditorium, erection of metal doors, proper scrutiny of newcomers, installation of CCTV cameras around the church, usage of hand-held scanners by the church security personnel, and ensuring well-illumination around the church premises among others.\nSome of the churches visited on Sunday are Living Faith Church (Winners Chapel), Oke-Onitea, Osogbo, Methodist Church, Osogbo, Redeemed Christian Church of God, Ogo-Oluwa, Celestial Church of Christ, Osogbo, Christ Life Baptist Church, Omo-West and Christ Apostolic Church (CAC), Alekuwodo.\nHe said: “We have deployed our men to churches in all local government areas of Osun State.\nWe are conducting regular sensitisation for members on security issues and also seeking cooperation with security agencies by reporting any security challenges to them.”"
  },
  {
    "headline": "Tinubu’s emergence testament to his contributions to Southwest, APC, says Bakare",
    "summarized_story": "Tinubu’s emergence testament to his contributions to Southwest, APC, says BakareOverseer of the Citadel Global Community Church, Pastor Tunde Bakare, yesterday said the emergence of Asiwaju Bola Tinubu as the All Progressives Congress (APC) presidential flag bearer was deserving.\nBakare, who contested in the primary but go no votes, spoke while addressing his congregation in Lagos.\n“I congratulate the winner of the APC presidential primaries, Asiwaju Bola Ahmed Tinubu, on his victory.\n“His emergence as the flagbearer and presidential candidate of the APC is a testament to his significant contributions to the course of the Southwest as well as his labour towards the formation and establishment of the APC as I have said in times past.\nAccording to him, the overwhelming votes by the delegates showed Tinubu’s acceptability by members of the party."
  },
  {
    "headline": "Again, suspected herders kill 11 in Benue",
    "summarized_story": "From Rose Ejembi, MakurdiGunmen suspected to be herdsmen, yesterday, reportedly attacked Igama community of Okpokwu Local Government area of Benue State, killing 11 people and injuring others.\nThe attackers were said to have, during the attack, murdered youths, while they allowed the elderly, women and children to escape unhurt.\nThey stormed the community in a commando manner between 4am and 6am this morning (Sunday).\n“I had the report that the Fulani herders stormed Igama community between 4am and 6am today (Sunday).\n“The attackers were said to have left women, children and the elderly to run away, but attacked and killed youths in the community."
  },
  {
    "headline": "NDLEA seizes US, Dubai-bound drugs at Lagos airport",
    "summarized_story": "In the past week, no fewer than 39 suspects were arrested across drug joints raided in parts of the Federal Capital Territory and different quantities of assorted illicit drugs recovered from them.\nChairman and Chief Executive of NDLEA, Brig.\nGen. Mohamed Buba Marwa (retd) commended the officers and men of MMIA, Edo, Yobe and FCT Commands as well as the C-MSTF for their resilience.\nHe charged them and others across all commands to remain vigilant and committed to the collective goal of saving Nigeria from the drug scourge.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Ekiti 2022 : Tension in Ekiti over killing of party supporter",
    "summarized_story": "Ajayi who was a member of the Road Road Transport Employer Association of Nigeria (RTEAN) was allegedly shot dead in Itaji-Ekiti by political thugs when the APC and Social Demoratic Party (SDP) had taken their campaigns to the sleepy town only for a confrontation to ensue between members and supporters of the two parties.\nSequel to Ajayi’s killing, tension gripped residents of Ado-Ekiti following rumours that the leadership of the transport union in the state had mobilised themselves to launch a possible reprisal attack.\nMen of the Army, the Police, DSS and the NSCDC were patrolling the streets in Hilux trucks to restore calm and normalcy.\nThree Armoured Personnel Carriers and truck were stationed in various strategic locations in the state capital including at the Tosin Aluko motor park, Atikankan, Old garage, Ajilosun, Ijigbo and Oja Oba.\nHowever, normalcy has gradually returned to various parts of Ado-Ekiti as residents, motorcyclists and motorists carried on with various activities."
  },
  {
    "headline": "Owo massacre: South West Governors declare 3 days mourning",
    "summarized_story": "From Bamigbola Gbolagunte, AkureThe six Governors of the South West geo political zone under the auspices of the South West Governors’ Forum have declared a three day mourning period in memory of the victims of the 5th June, 2022 terror attack on St Francis Catholic Church, Owo, Ondo State.\n“The Governors noted, with great discomfiture, the increasing agitations about spaces taken over by unidentified and unknown migrants in all South West States.\nThey expressed grave concern on the influx of Okada riders into all parts of the South West, especially the State capitals.\n“Consequently, the Forum decided it was time to reconvene the South West Security Committee to look critically into this creeping menace before it blossoms into another intractable social problem.\n“The Forum agreed to convene forthwith a physical meeting of the South West Governors to deliberate on the security challenges confronting the region, it added."
  },
  {
    "headline": "Again, suspected herders storm Community, kill 11 – The Sun Nigeria",
    "summarized_story": "From Rose Ejembi, MakurdiGunmen suspected to be herdsmen on Sunday, reportedly attacked Igama community of Okpokwu Local Government area of Benue State killing 11 persons and injuring others.\nAccording to sources from the area, the attackers who stormed the community in a gurella manner in the early hours of the day, also burnt down the entire buildings in the community.\nThe attackers were said to have during the attack, murdered youths while they allowed the elderly, women and children to escape unhurt.\nThey stormed the community in a commando manner between 4am and 6am this morning (Sunday).\n“The attackers were said to have left women, children and the elderly to run away but attacked and killed youths in the community."
  },
  {
    "headline": "Lagos Club Shooting: Police Personnnel Arrested",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Police personnel identified in the shooting incident at Club Cubana in Victoria Island, Lagos have been taken into custody and are being investigated for their involvement in the incident, Police Force Headquarters said at the weekend.\nA statement issued in Abuja, said the Inspector-General of Police, Mr Usman Baba, who described the circumstances surrounding the incident as “unbelievable”, condemned, in the strongest terms, the unfortunate incident.\n“Consequently, the IGP has directed the Commissioner of Police, Lagos State, CP Abiodun Alabi, to carry out a thorough investigation into the matter and forward his report as urgent as possible for further action”.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: We Must Never Forget the Sacrifices of Heroes of Nigeria’s Democracy",
    "summarized_story": "On this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nWe must never forget the sacrifices of the heroes of Nigeria’s democracy during 1993.\nIt is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections.\nGod bless the Federal Republic of Nigeria• Being an address by President Muhammadu Buhari on the occasion of the commemoration and celebration of Democracy Day 2022Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "At Democracy Day, Buhari Promises Nigerians Free, Fair, Transparent Elections in 2023",
    "summarized_story": "In a national broadcast this morning to commemorate the celebration of this year’s Democracy Day, President Buhari assured Nigerians of a free, fair and transparent electoral process come 2023, while also pleading with all citizens to come together and work with the government to build a peaceful and prosperous nation.\nPresident Buhari also charged politicians and their followers to run their campaigns with a high sense of maturity and dignity, which had been sustained throughout the various parties’ primaries.\nCommenting on security challenges facing the nation and how they could affect the coming elections, President Buhari said the government was working to contain the issues so that the 2023 elections could be preserved and secure.\n“On June 12, 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nAkeredolu Cancels Democracy Day Celebration over Owo CarnageIn another development, Ondo State Governor, Akeredolu has cancelled the celebration of Democracy Day in the state due to last Sunday’s attack on the St Francis Xavier Catholic Church in Owo."
  },
  {
    "headline": "PDP Moves to Unveil Vice Presidential Candidate on Tuesday as APC Considers New Options",
    "summarized_story": "The leadership of the PDP had after the emergence of Atiku as the presidential candidate of the party set up a high-powered committee to drive a rancour-free emergence of his running mate.\n“Though the leaders of the party believe that the conduct of the unnamed governor is not befitting of a vice presidential candidate, he is being considered because it is believed that he has enormous financial prowess to finance the PDP presidential campaigns.\nThe PDP stakeholders are said to be concerned that the emergence of Senator Rabiu Musa Kwankwaso as the presidential candidate of the New Nigeria Peoples Party (NNPP) would erode APC and PDP votes in the North-west.\nPohu said, “APC is not the only party that has elected a southern candidate; there are other political parties with Southern candidates.\nBut the Kaduna State Governor, Nasir el-Rufai believed that competence should be a major consideration and not religion."
  },
  {
    "headline": "Don’t Present Muslim Running Mates, CAN, Northern Christian Elders Warn Tinubu, Atiku",
    "summarized_story": "But Governor Nasir El-rufai of Kaduna State stressed yesterday that competence should determine his party’s choice of presidential running mate instead of religion.\n“We do not subscribe to Christian/Christian ticket or Muslim/Muslim ticket.\nThose who are planning Muslim/Muslim ticket should also find out what was the outcome of MKO Abiola and Kingibe ticket in 1993.\nIf they try Muslim/Muslim ticket this time around, the outcome will be worse because our fault lines are very visible.\n“Now, extending that consideration to the Muslim-Muslim ticket, I have lived among the Christians and I know that among the Christians, the question of a Muslim-Muslim ticket is a no-go area."
  },
  {
    "headline": "Police Escorts Attached To Nigerian Grammy Award Winner, Burna Boy Shoot Married Man For Complaining After Singer Made Pass At Wife",
    "summarized_story": "It was learnt that Burna Boy was laughing while the incident occurred and immediately left for Spain.\nAfter some minutes, Burna Boy reportedly made fresh advances at the woman.\n“As things were getting heated, Ibrahim brought out his service pistol and shot multiple times while Burna Boy was laughing,” said a senior policeman.\nBurna Boy's manager, who is also his mother, Bose Ogulu, did not respond to inquiries.\nAlso in May 2020, Burna Boy's neighbours called the police to arrest him and his father over an altercation."
  },
  {
    "headline": "Police Escorts Attached To Nigerian Grammy Award Winner, Burna Boy Shoot Married Man For Complaining After Singer Made Pass At Wife",
    "summarized_story": "It was learnt that Burna Boy was laughing while the incident occurred and immediately left for Spain.\nAfter some minutes, Burna Boy reportedly made fresh advances at the woman.\n“As things were getting heated, Ibrahim brought out his service pistol and shot multiple times while Burna Boy was laughing,” said a senior policeman.\nBurna Boy's manager, who is also his mother, Bose Ogulu, did not respond to inquiries.\nAlso in May 2020, Burna Boy's neighbours called the police to arrest him and his father over an altercation."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "Segun Oni: I left PDP because I don't collaborate with cheats",
    "summarized_story": "Segun Oni, the Social Democratic Party (SDP) governorship candidate in Ekiti, says he left the Peoples Democratic Party (PDP) because of “cheating”.\nOn January 26, Oni lost the PDP governorship primary in Ekiti to Bisi Kolawole, the preferred candidate of Ayodele Fayose, a former governor of the state.\nThe Segun Oni campaign organisation rejected the result of the PDP primary, while alleging that members of the organisation were disenfranchised by the process.\nI don’t cheating and don’t like people to cheat.\nIf I see a party that has no respect for its own rules, I see it as not my type of party,” Oni said."
  },
  {
    "headline": "Segun Oni: I left PDP because I don't collaborate with cheats",
    "summarized_story": "Segun Oni, the Social Democratic Party (SDP) governorship candidate in Ekiti, says he left the Peoples Democratic Party (PDP) because of “cheating”.\nOn January 26, Oni lost the PDP governorship primary in Ekiti to Bisi Kolawole, the preferred candidate of Ayodele Fayose, a former governor of the state.\nThe Segun Oni campaign organisation rejected the result of the PDP primary, while alleging that members of the organisation were disenfranchised by the process.\nI don’t cheating and don’t like people to cheat.\nIf I see a party that has no respect for its own rules, I see it as not my type of party,” Oni said."
  },
  {
    "headline": "INEC: Akpabio not recognised as Akwa Ibom APC senatorial candidate",
    "summarized_story": "The Independent National Electoral Commission (INEC) says its officials did not monitor any primary that produced Godswill Akpabio as senatorial candidate for Akwa Ibom north-west.\nPrior to the presidential primary, on May 27, Udom Ekpoudom, a former deputy inspector-general of police (DIG), had won a primary organised for the Akwa Ibom north-west senatorial ticket.\n“The authentic party leadership of the party in the state is led by Obong Stephen Leo Ntukekpo.\nThat was the only recognised primary by INEC, because it was organised by Electoral Officers sent from the party’s headquarters.\n“The reordered primary took place on the 9th of June, 2022, at the Skill Acquisition Centre, Ikot Ekpene, Akwa Ibom State."
  },
  {
    "headline": "INEC: Akpabio not recognised as Akwa Ibom APC senatorial candidate",
    "summarized_story": "The Independent National Electoral Commission (INEC) says its officials did not monitor any primary that produced Godswill Akpabio as senatorial candidate for Akwa Ibom north-west.\nPrior to the presidential primary, on May 27, Udom Ekpoudom, a former deputy inspector-general of police (DIG), had won a primary organised for the Akwa Ibom north-west senatorial ticket.\n“The authentic party leadership of the party in the state is led by Obong Stephen Leo Ntukekpo.\nThat was the only recognised primary by INEC, because it was organised by Electoral Officers sent from the party’s headquarters.\n“The reordered primary took place on the 9th of June, 2022, at the Skill Acquisition Centre, Ikot Ekpene, Akwa Ibom State."
  },
  {
    "headline": "Osinbajo: Peaceful conduct of party primaries shows our democracy is growing",
    "summarized_story": "Vice-President Yemi Osinbajo says despite the current challenges, Nigeria’s democracy is showing signs of positive growth.\nOsinbajo spoke on Sunday at the 2022 Democracy Day inter-denominational church service, held at the National Christian Centre in Abuja.\nAdvertisement“The social contract between the government and the people with the ballot as arbiter is daily being strengthened.\nA rain of peace and prosperity — one which like the goodness of God, touches everyone no matter who or where they are.\nAll things are working toward the emergence of a stronger, unified, peaceful and economically prosperous Nigeria.”"
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kenya’s controversial “ICT Practitioners Bill” is closer to becoming law",
    "summarized_story": "First introduced in 2016 by majority leader, Aden Duale, and supported by Kenyan MP, Godfrey Osotsi, the wide-sweeping and vague ICT Practitioners Bill mandated the registration and licensing of vaguely defined “ICT practitioners” by a council.\nAt the time, Mucheru had said, “If enacted, the ICT Protection Bill 2016 will cause duplication in regulation and frustrate individual talents from realising their potential.”That was in 2016.\nNow instead of being required to have graduated from a university, a proposed ICT Practitioners Council would determine who got registered.\nWhile the bill has generated outrage from stakeholders in Kenya’s tech community, there is significant support from a raft of tech professionals.\nKenya’s government says that its Long Term Development Blueprint, Vision 2030 will make the nation a globally competitive and prosperous nation by promoting “local ICT software development,” and making ICT Software more affordable and accessible”."
  },
  {
    "headline": "How Tijan Watt is building a pan-African VC from Dakar",
    "summarized_story": "In 2019, they incorporated Wuri Ventures, and within a year, the duo made 6 investments.\nWuri Venture also provides incubating programs for founders to learn the ropes of the startup world.\nTijan Watt, co-founder and general partner at Wuri Ventures, stands on a makeshift podium to address the guests at the launch event.\nAfter spending a year playing with ideas, he started his own flavoured sugar company in 2002.\nWatt told the abridged version of his entrepreneurial journey, and attempted to sell the crowd on Wuri Venture’s dream, especially its subscription plan, urging them to join Wuri Ventures in building a prosperous Africa one startup at a time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria’s power grid collapses again, blackout worsens",
    "summarized_story": "Nigeria’s power grid suffered another system collapse on Sunday, the second time in less than three months, exacerbating blackout in parts of the country.\nRead also: Power Ministry confirms national grid collapseAbdulazeez Abdullahi, head of corporate communication at Kaduna Electric, said: “We regret to inform you that the power outage being experienced in our franchise states is due to system collapse of the national grid.\nThe collapse occured at about 18:47 pm this evening hence the loss of supply on all our outgoing feeders.\n“Power supply shall be restored as soon as the national grid is powered back.\nOur sincere apologies for any inconvenience.”“Please be informed that the current outage is due to a system failure from the national grid."
  },
  {
    "headline": "Where to invest N1m right now",
    "summarized_story": "Broadly, there are three major investible instruments: equity, money market, and fixed income securities.\nBefore you invest in stocks, bonds, Treasury bills (T-Bills), exchange traded funds, foreign exchange, and even cryptocurrency, you must consider your investment objective, risk tolerance and source of fund, and age.\nFX issues and macro issues will have a negative impact on the equity market for the rest of the year; so entering now might be a bad time for a low-risk investor.\nAlthough the risk level is significantly low, compared with ordinary shares, that does not remove risks entirely.”According to Oni, a government bond, with all its benefits, is subject to inflation risk, interest rate risk and opportunity cost risk, among others.\nIn addition, we expect a negative reaction in the equities market as investors sell off equity exposures in response to rising yields."
  },
  {
    "headline": "Nigeria on the thumbs of Atiku, Tinubu, Obi, Kwankwaso, others",
    "summarized_story": "Others are New Nigeria Peoples Party (NNPP), National Rescue Mission (NRM), People’s Democratic Party (PDP), People’s Redemption Party (PRP), Social Democratic Party (SDP), Young Progressives Party (YPP), Zenith Labour Party (ZLP), and Action Alliance (AA).\nObservers are of the view that judging from their political antecedents and background, the presidential contest would be a four horse race between Atiku, Tinubu, Obi and Kwankwaso.\n“Tinubu would win his South West base; Atiku, who hails from Adamawa State in the North East would also carry the day there.\nSpeaking further, he predicted that at least 80 percent of Igbo votes would go for Obi, reducing PDP chances.\nWhat Tinubu said was that he was going to continue with the Buhari policy, policy like RUGA of what use is that to Nigeria?"
  },
  {
    "headline": "World Day Against Child Labour: Obaseki harps on sustainable investments in social systems – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state government’s investments in education and the enforcement of the Child Rights Law will ensure the protection of children from abuses, especially child labour.\nThe governor said this in commemoration of the 2022 World Day Against Child Labour, marked every June 12, by the International Labour Organisation (ILO), and observed across the globe.\n“As a government, we will continue to invest in education which is critical to the development of a child.\n“We have expanded the Edo Basic Education Sector Transformation (Edo-BEST) programme to give more children the opportunity to get quality basic education.\nWhile significant progress has been made in reducing child labour over the last two decades, progress has slowed over time, and it has even stalled during the period 2016-2020.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo NEWMAP beats 22 other states, clinches W’Bank best performance award, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…bags disbursement, counterpart funding awardsThe Edo State Nigeria Erosion and Watershed Management Project (NEWMAP) has emerged as the World Bank’s overall best-performing state since the inception of the project in 2012, defeating 22 other beneficiary states to clinch the award.\nAt the closing/valedictory session for the NEWMAP project, the state also came out tops in two other categories, including Best in Disbursement/Engineering/Civil Works/Bio-Engineering and Best in Counterpart Funding.\nThe honour is the highest winning by any state out of the 23 NEWMAP participating states.\nThe Project Coordinator of Edo NEWMAP, Dr. Tom Obaseki led the project’s monitoring unit and other members of the management team to receive the awards at the Federal Capital Territory, Abuja.\nMohammed Abdullahi, who commended Edo State for the exceptional performance, hailed Tom Obaseki for expertly steering the affairs of the project since its inception in 2012."
  },
  {
    "headline": "Strike: AAU Management Commences Implementation of ‘No Work No Pay’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – The acting Vice Chancellor of Ambrose Alli University (AAU), Prof. Sonnie Adagbonyi has disclosed that his administration has commenced the implementation of the’ no work no pay’ policy as directed by the state government.\nWe are going to stick completely to the directives of government in terms of paying the salaries of staff, and we will pay those who resume.\nWe hope that as the directives sink in, more workers will key into the directives, because the state government owns this university, unions don’t own this university.\nCyril Onogbosele, one of the suspended unions, insisted that lecturers would only resume for work when all outstanding emoluments were paid and the national strike by ASUU was called off.\nOn the suspension of unionism by state government, he said they would take legal action to challenge the ban,Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "CVR deadline: You’ll hear from us soon – INEC – Nigerian Observer",
    "summarized_story": "The exercise started on Monday with the deployment of 50 INEC Voter Enrolment Devices (IVED) to capture youths in the CVR, culminated in the concert which featured several youth-inspiring musicians, comedians and celebrities.\n“I know you want to hear from INEC if we are ending the registration on June 30.\nWe have heard you loudly and clearly, You want time until all Nigerians register for PVCs: you will hear from INEC very soon on that.\n“You want to hear from INEC if you register and vote: will your vote count?\nHe encouraged the youths to know that there were reforms within the electoral system that would make their votes to count."
  },
  {
    "headline": "Democracy Day: Osun Civil Societies Coalition seeks security, free, fair elections",
    "summarized_story": "Chairman, Osun Civil Societies Coalition (OCSC), Comrade Waheed Lawal, stated this on Sunday when members of the coalition held its annual June 12 rally in Osogbo, Osun State capital.\nIt is unfortunate that 29 years after the annulment of June 12, Nigeria is still far from its expected development pedestal.\n“The governorship election in Osun State is coming up on July 16, a month to this time.\nWe demand from INEC, security agencies, political parties and all other stakeholders that the governorship election must be free, fair, transparent, credible and violent free.\nThe act remains a tenet of an uncivilized and unhealthy democracy, which Nigerian Politics and its players should have grown from."
  },
  {
    "headline": "Super Eagles arrive Morocco for Nations Cup qualifier against Sao Tome",
    "summarized_story": "Super Eagles players have arrived Morocco ahead of their 2023 Africa Cup of Nations qualifying encounter against the Falcons of Sao Tome and Principe.\nThe players and officials of the team who departed for Morocco via the Nnamdi Azikiwe International Airport, Abuja, at about 12:44 a.m. (Sunday morning) have since arrived and will train Sunday evening.\nThe Jose Peseiro coached side will train inside the Adrar Stadium, Agadir, Morocco at 4pm after the team’s pre-match press conference scheduled for 1.30 p.m.Nigeria, three-time African champions, will slug it out against Sao Tome and Príncipe on Monday as the Eagles press on in their quest to qualify for next year’s Africa Cup of Nations billed to take place in Cote D’Ivoire.\nIn their opening match in the qualifying campaign, the Super Eagles got off to a positive start as they came from behind to beat Sierra Leone 2-1 on Thursday at the MKO Abiola Stadium, Abuja.\nFor São Tomé and Principe, it was not the best of starts in the qualifiers as they were hammered 5-1 by Guinea-Bissau."
  },
  {
    "headline": "Ebonyi 2023: PDP guber candidate, Odii flays Ogba’s ‘false’ claims, seeks unity ahead of polls",
    "summarized_story": "Meanwhile, a federal high court sitting in Abakaliki, had on Tuesday, June 7, nullified the rescheduled primary election, which was boycotted by ad-hoc party delegates, pronouncing it illegal, unconstitutional, null and void.\nAddressing Ogba’s claims in a statement on Sunday by its director of media and publicity, Abia Onyike, the AnyiChucks Campaign Organization maintained that the Lagos-based industrialist is the only PDP governorship candidate whose name has since been submitted to the Independent National Electoral Commission (INEC).\n“The PDP Governorship Candidate today is Dr Ifeanyi Chukwuma Odi.\nHe won the Primary Election conducted by the PDP on 28 and 29 of May, 2022.\nThe 3-man Delegates List used for the Primary Election was the outcome of the State PDP Congress of 7th May, 2022 which was eventually recognised by the PDP National Working Committee(NWC)."
  },
  {
    "headline": "Democracy Day: Buhari assures citizens of protection from enemies- Full Speech",
    "summarized_story": "Full Speech Below:Fellow Nigerians, Today, June the 12th, marks another Democracy Day anniversary and an occasion to celebrate freedom and unity of our nation.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President.\nGod bless the Federal Republic of Nigeria• Being an address by President Muhammadu Buhari on the occasion of the commemoration and celebration of Democracy Day 2022"
  },
  {
    "headline": "MultiChoice subscriber base reaches 21.8m households",
    "summarized_story": "The MultiChoice Group has released its financial results for the year ended March 31, 2022.\nThe results show that the group’s linear pay-TV subscriber base (measured on a 90-day active basis) increased by 0.9 million to reach 21.8 million households, comprising 9 million in South Africa and 12.8 million in the Rest of Africa (RoA), led by Nigeria.\nThe Group said the 5% growth year-on-year (YoY) is subdued due to the tough economic environment and elevated subscriber growth during COVID-19-related lockdowns in the previous year.\nMore specifically, the year ahead will see the group increasing its investment in local content, targeting an allocation of 50% of total general entertainment spend by FY24,” he added.\nThe company adds that the Rest of Africa (RoA) business benefited from the popularity of local content such as Big Brother Naija and live sporting events."
  },
  {
    "headline": "Akwai Kalubale Ga Matan Da Ba Su Da Sana’a – Aisha Isah",
    "summarized_story": "Ga dai tattaunawar tare da wakiliyarmu RABI’AT SIDI BALA kamar haka;Masu karatu za su so jin cikakken sunanki da kuma sunan da aka fi saninki da shi?\nKamar wanne irin kalubale kika taba fuskanta game da sana’ar ki wanda ba za ki taba iya mantawa da shi ba?\nYanzu misali idan wata na son koyan ita wannan sana’a ta ya za ta fara,wanne abubuwa za ta tanada?\nGaskiya su tashi su nemi sana’ar dogaro da kai saboda rayuwar yanzu ta zama da tsada kuma zama ba abun yi bai yi ba, gaskiya su tashi su nemi abin yi suma, domin akwai kalubale ga matan da basu sana’a.\nKo akwai wani kira da za ki ga gwamnati musamman game da bunkasa kasuwanci irin naku?"
  },
  {
    "headline": "Rikicin Katin Zabe A Legas: Mutanen Tinubu Sun Hana ‘Yan Kabilar Igbo Karbar Kati Saboda Tsoron Atiku – PDP",
    "summarized_story": ""
  },
  {
    "headline": "2023: Za Mu Samar Wa Da Tinubu Kuri’a Miliyan 1 A Jihar Ribas —Abe",
    "summarized_story": ""
  },
  {
    "headline": "‘Yan Bindiga Sun Yi Garkuwa Da ‘Yan Tawagar Biki 50 A Hanyar Zamfara Zuwa Sokoto",
    "summarized_story": ""
  },
  {
    "headline": "Xi Ya Taya Ta Kung Pao Murnar Cika Shekaru 120 Da Kafuwa",
    "summarized_story": ""
  },
  {
    "headline": "Running Mate: Tinubu’s Men Rule Out Lalong, SGF, Consider Shettima, Ganduje, El-Rufai",
    "summarized_story": "One of those involved in the consultation for Tinubu’s running mate pointed out that the party might settle for a Muslim-Muslim ticket.\nShettima is a strong supporter of the APC candidate and he spoke out in Tinubu’s defence after his Abeokuta outburst.\nI want you to pay attention to my state and also consider my principal, Senator Shettima, as your running mate.\nThe same set of people should be able to decide who will be the running mate.\n“We will pick the best (running mate) for our party who can deliver the election for us; they should allow the people to decide what they want.”(PUNCH)"
  },
  {
    "headline": "BREAKING: Terrorists Release 11 Kidnapped Train Passengers",
    "summarized_story": "The terrorists freed 11 kidnapped train passengers on Saturday after intense discussions between the FG and the terrorists, according to Malam Tukur Mamu, Sheikh Ahmad Gumi’s communications consultant.\nAccording to him, the 11 victims who were released were transported to Abuja on President Buhari’s orders for medical evaluation and treatment before being reunited with their bereaved relatives.\nSome retired Army Generals and a well-known academic, he claims, also assisted in the passengers’ release.\nDetails later…"
  },
  {
    "headline": "Alleged N2bn Fraud: Pastor, Wife Sue As EFCC Declares Them Wanted",
    "summarized_story": "Pastor Oyinmiebi Bribena, the President of Baraza Multipurpose Cooperative Society Limited (BMCSL), and his wife, Beatrice, say that the Economic and Financial Crimes Commission (EFCC) never invited them for questioning or interrogation before declaring them wanted.\nThe EFCC’s Head of Media and Publicity, Wilson Uwujaren, issued a statement declaring the pair wanted for allegedly scamming Nigerians of N2 billion.\nHe had requested answers to some queries about the EFCC’s abilities to intervene in conflicts between cooperative society members, based on the terms of the Nigerian Cooperative Societies Act of 2004.\nReacting to the declaration, Bribena, who is also pastor in a popular church, stated: “We did not receive any invitation letter from the EFCC and were not aware of any summons or pending charge against us by the EFCC.\nBribena, who assured contributors that all hope was not lost, stated that he would not relent in the efforts being made to clear his name."
  },
  {
    "headline": "Sanwo-Olu has abandoned governance for Tinubu’s campaign -Adegboruwa",
    "summarized_story": "Adegboruwa, who was one of the members of the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS-Related Abuses, warned the governor on spending the state’s resources on Tinubu’s campaign.\n“Since the declaration of the presidential aspiration of Asiwaju Bola Ahmed Tinubu, Governor Babajide Sanwoolu has abandoned governance in Lagos State.\nNine aspirants had earlier stepped down, eight of whom asked their supporters to vote for Tinubu, while one asked his supporters to vote for Osinbajo.\nThose who stepped down before voting began are Governor Abubakar Badaru of Jigawa, Robert Boroffice, Ken Nnamani, Ibikunle Amosun, Dimeji Bankole, Ekiti State Governor Kayode Fayemi and Godswill Akpabio.\nPastor Felix Nicholas, the United States of America-based aspirant also stepped down and asked his supporters to vote for Osinbajo."
  },
  {
    "headline": "Buhari reveals how FG is tackling insecurity, other talking points from President’s Democracy Day speech *Read full address",
    "summarized_story": "I ask all citizens to support and cooperate with our security agencies by reporting any suspicious characters and activities to law enforcement agencies.\nI and the security agencies are doing all we can to free those unfortunate countrymen and countrywomen safely.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nI ask all citizens to support and cooperate with our security agencies by reporting any suspicious characters and activities to law enforcement agencies.\nI and the security agencies are doing all we can to free those unfortunate countrymen and countrywomen safely."
  },
  {
    "headline": "Breaking: Buhari vows peaceful, transparent process ahead 2023 presidential election in Democracy Day message",
    "summarized_story": "Ahead of the 2023 presidential election, President Muhammadu Buhari said Sunday that he remains committed and determined to ensure that the new President is elected through a peaceful and transparent process.\nThe President said this in a nationwide broadcast to mark this year’s Democracy Day anniversary in honour of the presumed winner of the June 12, 1993, presidential election, Chief Moshood Kashimawo Abiola.\nI remain committed and determined to ensure that the new President is elected through a peaceful and transparent process.\n“As we move into the general election campaign season, we must sustain this mature attitude to campaigning and ultimately, voting.\n“On June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully."
  },
  {
    "headline": "Terrorists release 11 kidnapped Abuja-Kaduna train passengers *See full names",
    "summarized_story": "After many weeks, terrorists have released 11 out of 61 kidnapped passengers on Abuja-Kaduna train.\nThe attack on the train happened on March 28, 2022.\nAmong those who regained their freedom are six females and five males who have now been flown to the nation’s capital, Abuja.\nThey are Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari and Hannah Ajewole.\nHe further explained that the 11 victims were freed on health grounds in order to enable them undergo urgent medical treatment."
  },
  {
    "headline": "FIRS Pledges Collaboration with KW-IRS on Improved Revenue Generation",
    "summarized_story": "By Kayode AbdulazeezFederal Inland Revenue Service (FIRS) has pledged to collaborate with the Kwara State Internal Revenue Service (KW-IRS) to improve revenue generation in the state.\nThe FIRS official also said that the courtesy visit was aimed at strengthening the long-standing institutional relationship between FIRS and KW-IRS.\nAdama, who applauded the data-sharing liaison between both revenue agencies, pledged continual collaboration in ensuring eligible taxpayers in the State are adequately and appropriately captured into the tax net.\nThe team also discussed several areas of interest and concerns as they relate to revenue enhancement for Kwara State.\nAlso speaking, the Executive Chairman, KW-IRS, Shade Omoniyi, commended FIRS for the support towards achieving seamless tax administration."
  },
  {
    "headline": "NBC Celebrates DG Ilelah as he marks one year in office",
    "summarized_story": "By Friday ObandeAs he marks one year in office, the Management and Staff of National Broadcasting Commission, have felicitated with Director General of the commission, Mallam Balarabe Shehu Ilelah.\nIn a congratulatory message by the commission’s management, it said Ilelah, has on assumption in office, brought his wealth of experience into the running of the NBC.\nAlso, in the course of carrying out the commission’s regulatory functions, the management noted that the DG has continued to stress on professionalism on the part of broadcasters.\nThe Director General implored Broadcasters to engender the unity, peace and progress of our dear country,” they added.\nIlelah, a veteran international broadcaster, was appointed DG of the commission on June 7, 2021 by President Muhamadu Buhari."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Candidates Make Their Pitch In Ekiti State Governorship Debate",
    "summarized_story": "Channels Television brings you a debate between the leading candidates.\n– Olabisi Kolawole, PDP#EkitiGovDebate#CTVTweets pic.twitter.com/cx3UGvthoM — Channels Television (@channelstv) June 12, 2022I am not afraid of APC.\n– Oluwole Oluyede, ADC#EkitiGovDebate#CTVTweets pic.twitter.com/w8lHfBqspQ — Channels Television (@channelstv) June 12, 2022My priority is to revive agriculture and diversify our economy from over-reliance on Abuja.\n– Ranti Ajayi, YPP#EkitiGovDebate#CTVTweets pic.twitter.com/BDUZDDz0T9 — Channels Television (@channelstv) June 12, 2022I believe Ekiti can be better.\n– Segun Oni, SDP#EkitiGovDebate#CTVTweets pic.twitter.com/6Pw3ZHFWxp — Channels Television (@channelstv) June 12, 2022I have a six-point agenda for Ekiti."
  },
  {
    "headline": "Nigerians Must Trust The Military For Insecurity To End – CDS Irabor",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor, on Sunday said citizens must trust the military and other security agencies for the war on insecurity to be more effective.\n“I will seek and crave the indulgence of all Nigerians to say that there has to be trust.\nThe CDS regretted the violent incidents but argued that security agencies have averted several others.\nHe said in the same week of the Owo attack, security agencies had halted what could have been a major attack in Kano and Abuja.\n“We recovered a large quantum of arms and ammunition and other materials which, of course, the criminals were intending to use in various parts of the country, including Abuja,” he said."
  },
  {
    "headline": "Bandits Abduct ’50 Wedding Guests’ Along Sokoto-Zamfara Highway",
    "summarized_story": "Bandits have abducted no fewer than 50 wedding guests travelling along the Sokoto-Zamfara road.\nZurmi noted that more than 20 persons later managed to escape, while some of them sustained various degrees of injuries.\nHe confirmed that 30 members are currently in captivity and the abductors have contacted the members of their Union, confirming that they are with them.\nThe Secretary of the Union also suspected the involvement of informants which he said might have notified the kidnappers about their movement.\nHe also give a 48-hour ultimatum for security agencies and government authorities to ensure the rescue of the abducteesPolice Authorities in Sokoto State have yet to confirm the incident."
  },
  {
    "headline": "Full Text: Buhari Speaks About Honouring MKO, 2023 Elections, Victims Of Terrorism In Last Democracy Day Broadcast – Channels Television",
    "summarized_story": "On this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President.\nBy June 12th, 2023, exactly one year from today, you will already have a new President.\nIt is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections."
  },
  {
    "headline": "Okonjo-Iweala ‘Cautiously Optimistic’ As High Stakes WTO Meeting Kicks Off",
    "summarized_story": "The World Trade Organization chief voiced cautious optimism Sunday as global trade ministers gathered to tackle food security threatened by Russia’s invasion of Ukraine, overfishing and equitable access to Covid vaccines.\nOpening the WTO’s first ministerial meeting in nearly five years, Ngozi Okonjo-Iweala said to “expect a rocky, bumpy road with a few landmines along the way”.\nBut since the global trade body only makes decisions by consensus, it can be more than tricky to reach agreements.\n“There is not a single issue that India is not blocking,” a Geneva-based ambassador said, singling out WTO reform and agriculture.\nIndia has also struck a harsh tone on another key issue on the table: WTO response to the Covid crisis."
  },
  {
    "headline": "Full text of President Buhari's 2022 Democracy Day Speech",
    "summarized_story": "He made this remark on Sunday during a statewide broadcast to mark this year’s democracy day celebration.\nRead the full text belowTHIS DEMOCRACY DAY, 2022 SPEECH IS RELEASED TO YOU STRICTLY UNDER EMBARGO UNTIL 7.30 AM, JUNE 12, 2022 AFTER THE PRESIDENT HAS READ IT.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nOn June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nFellow Nigerians this is my last Democracy Day speech as your President."
  },
  {
    "headline": "Tinubu visits Lawan, Okorocha, Nnamani, Jack Rich, seeks collaborations -",
    "summarized_story": "Presidential candidate of the All Progressives Congress, Asiwaju Bola Tinubu has visited more aspirants of the party’s primary that produced him as the flagbearer.\nThe former governor of Lagos continued the consultation as he visited Senate President, Ahmed Lawan, former Governor of Imo State, Rochas Okorocha, former Senate President Ken Nnamani and Jack Rich.\nHe said the visit is to seek collaborations from the aspirants in the interest of building the party and the nation.\nAll the aspirants visited promised to support Asiwaju tinubu to ensure victory for the party in the 2023 elections."
  },
  {
    "headline": "Two shot, one feared killed as APC, SDP supporters clash in Ekiti -",
    "summarized_story": "At least two persons have been reportedly shot on Saturday in Itaji Ekiti, Oye local Government area of Ekiti state during a Political rally ahead of the June 18 Governorship ElectionAccording to an eye-witness, trouble started when suspected Political thugs attacked the campaign train of the Governorship candidate of the Social democratic party, Segun Oni, even though it is not yet clear what transpired before the altercationsA chieftain of the Social Democratic party, Bimbo Daramola who was on the campaign train of the SDP Candidate, accused certain interest groups in the state of interfering in a Peaceful campaign by opening Fire on SupportersReacting, the Governorship candidate of the APC, Biodun Oyebanji ,condemned violence in all forms and appealed to his supporters to exercise refrain in the face of Provocation.\nThe Police Public Relations officer in Ekiti State Sunday Abutu confirmed the incidence of violence however could not confirm if anyone was killed at the time of Filing this report and Says normalcy has since returned to the area."
  },
  {
    "headline": "Democracy Day: Nigeria on pathway to greatness, says Lagos Speaker -",
    "summarized_story": "The Speaker of the Lagos State House of Assembly, Mudashiru Obasa, has described Nigeria as a country currently on a track to greatness just as he urged the citizens to play active roles for this to be fully achieved.\nDr. Obasa said this in a statement at the weekend to commemorate Nigeria’s Democracy Day which coincides with the 29th anniversary of the June 12, 1993 elections claimed to have been won by the late Chief Moshood Abiola.\nAccording to the Speaker, Nigeria had, since 1999, experienced what could best be described as the teething stage of its democratic journey with the need for unity taking the centre-stage of public discourse.\n“History will forever be kind to those who made Nigeria’s democracy possible.\n“We are honoured to be the current bearers of the baton of democracy and we look forward to upholding the labour of these heroes.”"
  },
  {
    "headline": "We Must Remember all Those Who Have Fallen for the Sake of Our Freedom – Shehu Sani – Arise News",
    "summarized_story": "Former National Lawmaker, Sen Shehu Sani, reflect on the struggle for democracy and the present dividends of Nigerian democracy"
  },
  {
    "headline": "Doyin Okupe: I Can Authoritatively Say There is No More Faction Within the Labour Party",
    "summarized_story": "DG, Peter Obi Campaign Organization, Dr. Doyin Okupe, says the emergence of Peter Obi into the Labour Party aggravated the resolve of aggrieved party member to escalate their desires for justice, however, the issue of factions within the labour party after days of negotiations and talks have been resolved leaving Peter Obi as the party’s legitimate candidate."
  },
  {
    "headline": "Nigeria: University Students Lament as Lecturers’ Strike Enters Fourth Month",
    "summarized_story": "Some students of Nigerian public universities have expressed frustration over the lingering strike by the Academic Staff Union of Universities (ASUU).\nA third-year student of the University of Port Harcourt, Greatness Nnamdi, who is studying gas engineering, said that the ongoing strike was impacting negatively on the plans of Nigerian students.\nNwafor expressed displeasure at the ongoing strike, saying that the action was leading some students into crime.\nASUU Chairman at the Abia State University, Mr. victor Nkemdirim, attributed the strike to the non-revitalisation of public universities in the country.\nNkemdirim said if not for ASUU’s continued struggles, most of the states and federal universities would have gone under by now."
  },
  {
    "headline": "Nigeria’s 2023 Elections Can’t Be Rigged, INEC Says as It Considers Voter Registration Extention",
    "summarized_story": "He debunked the claim that the Permanent Voters’ Cards (PVCs) would expire, clarifying that the PVCs have no expiry date.\nOn the fears being expressed in certain quarters that elections could be rigged, the INEC Chairman said the commission would do everything in its power to protect the sanctity of the ballot.\n“The best way to protect the sanctity of the ballot is what happens at the polling unit.\nYou can’t go to the polling unit on election day and say – here I come INEC, I’ve registered.\nYakubu also debunked another rumour that the PVCs would expire, insisting that the PVCs have no expiration date."
  },
  {
    "headline": "CBN Unveils Plans to Introduce USSD Code to Improve eNaira",
    "summarized_story": "The Central Bank of Nigeria (CBN) has said it is set to introduce the Unstructured Supplementary Service Data (USSD) code as part of steps to improve the Central Bank Digital Currency (CBDC).\nObiora said the introduction of the USSD code became necessary to improve financial inclusion in the country and to ensure people without smartphones could still transact on the eNaira platform.\nHe said that the CBDC had significant benefits for Nigeria, which was why the CBN decided to introduce it.\nThe report stated that the total RSA Transfer was 7,663, which was concluded in the first week of April 2022.\n“This covered RSA transfer requests, submitted by PFAs between January 1, and March 31, which were eligible for RSA transfer in the first quarter of 2022."
  }
]