[
  {
    "headline": "Ooni has a picture he projects to the world, another one which is his true self – Estranged wife, Naomi Silekunola",
    "summarized_story": "Ooni of Ife Oba, Adeyeye Ogunwusi Ojaja II, has a picture he projects to the world and another one which is his true self, his estranged wife, Evangelist Silekunola Naomi has said.\nI made my journey into the ancient throne of Ife with faith in my heart and love for the keeper of it.\nLet it be known that this decision to move on did not come because his majesty is married to another queen.\nAs many would love to assume, throughout our life as a couple, I was the only married wife to him.\nInstead, His Majesty has a picture he would love the world to see and perceive him as and another one which is his true self."
  },
  {
    "headline": "Queen Silekunola: Things to know about Ooni’s estranged wife",
    "summarized_story": "Her Majesty, Queen Silekunola Naomi, on Thursday announced her separation from the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja II.\nIn this piece, The PUNCH highlights five things to know about the monarch’s ex-wife.\nIt was gathered that the traditional wedding was done in Akure, the Ondo State capital before the new bride was brought to the palace.\nMotherhoodQueen Silekunola and the Ooni had a son together, Tadenikawo.\nThe girl who is said to be my daughter is my niece.”MinistrySilekunola is also the founder and president of En-Heralds— an inter-denominational ministry based in Akure, Ondo State."
  },
  {
    "headline": "Buhari leaves Abuja for Maiduguri",
    "summarized_story": "Johnbosco Agbakwuru, AbujaPresident Muhammadu Buhari on Thursday morning left Abuja to the Maiduguri, the Borno State Capital on an official visit.\nThe President’s chopper left the Presidential Villa about 10:04 am at the time the Vice President was presiding over the extraordinary virtual Federal Executive Council, FEC meeting at the Council Chambers, Presidential Villa, Abuja.\nPresident Buhari is visiting Maiduguri to commission multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nRecall that on Tuesday, Governor Zulum of Borno State had said that President Buhari has greatly supported Borno State and made sacrifices so that the people can live in peace, harmony and progress.\nHe said Buhari had spent more than $50m to generate stable and sustainable power and energy for the people of Borno State."
  },
  {
    "headline": "UPDATED: Queen Naomi’s alleged separation from Ooni-of-Ife not true — Palace",
    "summarized_story": "Dapo AkirefonBy Dapo Akinrefon & Shina Abubakar, OsogboThe queen of Ooni of Ife, Naomi Silekunola Ogunwusi has announced her separation from the monarch, Oba Adeyeye Ogunwusi.\nQueen Naomi announced the decision on her verified Instagram page citing irreconcilable differences between the duo.\nLet it be known that this decision to move on did not come because his majesty is married to another queen.\nAs many would love to assume, throughout our life as a couple, I was the only married wife to him.\nThere was a time it was reported that she left the palace and the next thing, she gave birth."
  },
  {
    "headline": "BREAKING: Queen Naomi separates from Ooni of Ife",
    "summarized_story": "Shina Abubakar, OsogboThe queen of Ooni of Ife, Naomi Silekunola Ogunwusi has announced her separation from the monarch, Oba Adeyeye Ogunwusi.\nQueen Naomi announced the decision on her verified Instagram page citing irreconcilable differences between the duo.\nI made my journey into the ancient throne of Ife with faith in my heart and love for the keeper of it.\nLet it be known that this decision to move on did not come because his majesty is married to another queen.\nI, at this moment, announce that I shall no longer be referred to as wife to the Ooni of Ife or as Queen of lle-Ife but as the Queen of the people and mother of my adorable Prince”."
  },
  {
    "headline": "Plateau govt to create 20,000 jobs for youths in 2022",
    "summarized_story": "Governor Simon Lalong of Plateau StatePlateau State government has affirmed its commitment to create 20,000 jobs in 2022 for youths in the state.\nThe state government’s plan is contained in a communique issued on Wednesday in Jos by the Secretary to the State Government, Prof. Danladi Atu, at the end of a two-day retreat to review its policies.\nThe retreat was organised for members of the state executive council, permanent secretaries, chief executives of boards and parastatal agencies and special advisers to the governor.\nALSO READ: NDE empowers 100 unemployed youths on Entrepreneurship skills in Ondo“All Ministries, Departments and Agencies (MDAs) must put all hands on deck to ensure that the commitment to create jobs that will take 20,000 youths out of the unemployment market between now and 2022″.\nSimon Lalong’s administration restated its determination to prioritise the completion of all critical projects and programmes before the end of his administration."
  },
  {
    "headline": "Police beef up security, ban use of fireworks in Akwa Ibom",
    "summarized_story": "The Police Command in Akwa Ibom says it has beefed up security and banned the use of fireworks during the Christmas and New Year celebration.\nMacdon said the Commissioner of Police (CP), Andrew Amiengheme, had ordered the immediate enforcement of the ban on the use of fireworks across the state during the yuletide.\n“He has therefore requested parents/guardians to warn their children/wards to refrain from the use of all kinds of prohibited fireworks during and after the yuletide.\nThe PPRO quoted the commissioner of police as felicitating the people of Akwa Ibom at Christmas.\nHe added that security had been beefed up in all parts of the state for a successful celebration."
  },
  {
    "headline": "Insecurity: We won’t hand over Nigeria how we met it – Masari",
    "summarized_story": "In fact, the only thing that differentiates us now from them is that they are bandits and we are not,” he said.\nMasari urged the people of the state to rise up collectively as a people and take advantage of technology to defeat the hoodlums and restore the lost peace in the state.\nThe only loss in this fight is if you run away and refused to fight.\nWe should not under any condition run away we should stay and fight,” he said.\nMany responsible people are already offering suggestions on how best to deal with these people because without peace there won’t be development.”"
  },
  {
    "headline": "Yuletide: Lawmaker, Onuzuruike urges Abia govt to lift curfew",
    "summarized_story": "The member representing Umuahia North Constituency at the Abia State House of Assembly, Hon Kelechi Onuzuruike, has made a case for the lifting of the existing curfew imposed by the state government.\nWe are in the yuletide season and many well-meaning Abia sons and daughters will travel from their places of residence to the state, it is therefore imperative to lift the curfew to ease their ingress into the state.\nHe also explained that the yuletide season is typically characterized by celebratory functions some of which are better suited for the night or late evening.\nHon Onuzuruike further said that the Yuletide season is typically characterized by celebratory functions some of which are better suited for the night or late evening.\nMeanwhile, the Abia House of Assembly has resolved and called on the executive arm of government led by Governor Okezie Ikpeazu to consider the lifting of the curfew to ensure a hitch-free yuletide."
  },
  {
    "headline": "BREAKING: Explosion rocks Maiduguri as President Buhari visits Borno",
    "summarized_story": "No fewer than three explosions on Thursday rocked Maiduguri, the Borno State capital, ahead of President Muhammadu Buhari’s visit, Channels TV reports.\nDetails of the incidents, which occurred a few hours before Buhari’s visit to the state, are currently sketchy.\nEfforts by DAILY POST to reach the Borno State Police Command for comments proved abortive as of press time.\nPresident Buhari had been scheduled to commission an edifice donated by Mohammed Indimi to the University of Maiduguri.\nHe is also expected to commission some projects executed by the Borno State Government."
  },
  {
    "headline": "Insecurity: This is not Imo we rescued in 2011 – Okorocha",
    "summarized_story": "Former Governor of Imo State, Rochas Okorocha, has expressed worries over the high level of killings in the state, saying the state is not the same as the one he governed from 2011.\nOkorocha expressed displeasure that over seven governors in the country and other notable individuals would have attended the burial ceremony of Jemimah Nwosu, mother of his son-in-law, Uche Nwosu, but could not because any governor visiting Imo State must come with armoured vehicles.\nOkorocha, now Senator representing Imo West Senatorial District, said this at St. Peter’s Anglican Church Eziama Obaire in Nkwerre Local Government Area of Imo State.\nHe opined that many other notable individuals would have attended the burial but due to insecurity and negative reports coming from the state they could not.\nRecall that Imo State has been in the news in recent time over rising cases of insecurity resulting in killings, kidnapping of notable individuals including some traditional rulers by unidentified gunmen."
  },
  {
    "headline": "Group calls for Aregbesola, Adeoti’s arrest over alleged electoral fraud in Osun",
    "summarized_story": "A socio-political group, Osun Shall Rise Again, OSRA, has called for the immediate arrest and investigation of former Governor of the state, Rauf Aregbesola, and a former Secretary to State Government, SSG, Moshood Adeoti, for electoral fraud.\nThe group asked Aregbesola, currently the Minister of Interior, to stop playing God over the 2022 gubernatorial poll in the state.\nHe noted that the socio-political group was not intelligent about its assertion by calling for the arrest of a citizen without any tangible evidence against them.\n“There are a hundred ways of earning a living, if we investigate this so-called group, you will find out that they are sponsored.\nThe call for the arrest of a citizen is ridiculous without evidence,” he said."
  },
  {
    "headline": "‘I became an orphan again with Ige’s death’",
    "summarized_story": "‘I became an orphan again with Ige’s death’Elder statesman and former Osun State Governor Bisi Akande was on his way to Osogbo after a trip to the United Kingdom when Muyiwa Ige broke the news of his father’s death.\nHe drove in his car with Akinwumi and they headed for Osogbo via the old road from Ibadan, passing Iwo.\nThen, the line went off,” Akande recalled.\nMembers of the team started groaning and moaning and there was general confusion.\n“It was President Obasanjo on the other end,” Akande recalled."
  },
  {
    "headline": "Ige wanted to resign from Obasanjo’s govt before murder, says Akande",
    "summarized_story": "Ige wanted to resign from Obasanjo’s govt before murder, says AkandeChief Bola Ige intended to resign from the government of Chief Olusegun Obasanjo before he was killed on December 23, 2001, former Osun State Governor Chief Bisi Akande has said.\nAkande, in his book, ‘My Participations’, recalled that the late Ige confided in him about his plan to leave as the Attorney-General of the Federation and Minister of Justice.\nHis reason was that the government was not implementing programmes that could benefit the people.\nBefore being posted to the Ministry of Justice, Ige was Minister of Power and had vowed to ensure a stable electricity supply within six months.\n- Advertisement -The author also added that Ige’s former deputy governor, who was then the Minister of Internal Affairs, Chief Sunday Afolabi, chided Chief Ige that he should not forget that he was only invited to ‘come and eat.’"
  },
  {
    "headline": "Akande: How ex-minister Bola Ige was killed",
    "summarized_story": "Elder statesman Chief Bisi Akande has recounted how Chief Bola Ige was killed.\nIge was shot dead in his Ibadan, Oyo State capital, residence on December 23, 2001.\nAkande, who was Osun State governor at the time, recalled in his book ‘My Participations’ the circumstances in which Ige was killed.\n“Instead of going to Esa-Oke, Uncle Bola decided to spend the night in Ibadan.\n“They overpowered the only gateman who had been working with Uncle Bola before he took up the ministerial appointment with Obasanjo and marched him upstairs."
  },
  {
    "headline": "Ige: Unsolved crimes lead to culture of impunity, says Soyinka",
    "summarized_story": "Nobel laureate Prof Wole Soyinka has said that unsolved crimes result in a culture of impunity.\nThe event, which was held in Lagos on Tuesday, had the theme: 20th year of Bola Ige memorial symposium, two decades of injustice: what are the implications on Nigerian democracy?\n- Advertisement -It was organised by the Bola Ige For Justice Centre.\n“Bola Ige, as the nation’s minister of justice, and United Nations’ civil servant designate, was unarguably one such.\n“President Buhari, share the rewards of your investigations – if any!!"
  },
  {
    "headline": "Lagos runs out of Moderna Vaccine doses",
    "summarized_story": "This was stated in a terse post on the official Instagram page of the Lagos State Commissioner for Health, Akin Abayomi, titled ‘Non-availability of #COVID19 Moderna Vaccine in Lagos State – Appeal for Restraint by Lagos State Ministry of Health’.\nThe statement reads: “Lagos State Ministry of Health (LSMOH) and Lagos State Primary Healthcare Board (LSPHCB) sincerely appeal for understanding over the non-availability of Moderna vaccine in all vaccination centres in Lagos at the moment.\n“Lagos State is in touch with NPHCDA to ensure availability of adequate doses of Moderna vaccine at vaccination centres as soon as possible.\n“Please be rest assured that second doses of Moderna vaccine will be administered to all who have received the first doses as soon as Lagos State receives new supply from NPHCDA.\nModerna COVID-19 vaccine is an mRNA vaccine that requires two shots, 28 days apart."
  },
  {
    "headline": "Obasanjo, Sultan, ethnic leaders, others list ways how to save Nigeria",
    "summarized_story": "Their observations are contained in a communiqué issued after an open dialogue meeting held physically in Abuja and virtually across the world on December 13.\nIt said: “The 1999 Constitution does not embody the principles of justice, fairness and equality on which every democracy is founded.\nIt said Nigeria must explore its diverse religion and traditions to discover what is best for the people.\nUnderdevelopment and isolation cannot remain the strategy else they will be uncomfortable to remain with the concept of Nigeria.\nThe role of religious leaders and pulpit managers (traditional, Christian, Islam) in our moral rearmament and collective re-engineering is urgently needed to salvage our nation.”Those physically present at the meeting include former president, Obasanjo, the Sultan of Sokoto, Rev."
  },
  {
    "headline": "Electoral Bill: Senate backs down on plan to veto Buhari’s decision",
    "summarized_story": "From Fred Itua, AbujaContrary to public expectations that the senate would initiate moves to override President Muhammadu Buhari’s veto of the Electoral Amendment Bill 2021, the upper legislative chamber, yesterday, failed to carry out its threat.\nSenate President, Ahmad Lawan while giving a situation report after a closed session, said senators had a frank talk, where they agreed to suspend action on the president’s letter until adequate consultations were made.\nThe senate also resolved in the closed door session to discuss how to respond to the letter of Mr. President on the Electoral Amendment Bill.\nThe senate consequently resolved to consult with the House of Representatives in January when the senate and the House will be in session.\n“Presently, the House of Representatives has gone on recess and the constitutional provision is for the Senate and House of Representatives to jointly take the appropriate action."
  },
  {
    "headline": "2023: Why PDP’ll win presidency –Wike",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor, Nyesom Wike, has said concerned stakeholders fought for the change of the immediate past national leadership of the Peoples Democratic Party (PDP) because they wanted to reposition the party to win the presidency in 2023.\nHe said such change of leadership at the national level was also to avert a situation of doom for the party.\nOn the Oyigbo-Okoloma road project, Governor Wike said it is a federal road that connects neighbouring states like Abia, Akwa-Ibom and Cross River, but was allowed to fail completely.\nHe said a company that won the bid for Afam Power Station came to indicate interest to partner the Rivers State government for its reconstruction.\nAyu commended Governor Wike and PDP governors for spreading development to every nook and crannies of their states."
  },
  {
    "headline": "NASS raises own budget to N139bn, approves N17.126trn for FG",
    "summarized_story": "From Fred Itua, AbujaLike the House of Representatives, the senate has raised the budget of the National Assembly for 2022 from the proposed N134 billion to N139 billion, which represents a N5 billion increment.\nAbout N134 billion was proposed in the 2022 Appropriation Bill when it was laid before the National Assembly by President Muhammadu Buhari on October 7, 2021.\nMeanwhile, the Senate passed the 2022 Appropriation Bill, raising the total estimates of the Federal Government’s budget from the proposed N16,391,023,917,692 to N17,126,873,917,692, an increase of N735,850,000,000.\nThe oil benchmark was raised from the proposed $57 per barrel to $62.\nPassage of the 2022 budget followed the laying of the report by the Committee on Appropriations, consideration by the Committee of Supply and adoption by the House."
  },
  {
    "headline": "COVID-19 assuming dangerous, harmful dimension, FG warns",
    "summarized_story": "The Federal Government has urged Nigerians not to be lulled into a false sense of security on COVID-19 pandemic but to note that it was increasingly assuming a dangerous and harmful dimension with the emergence of Omicron variant.\nHe urged quick report to medical authorities of any respiratory illness observed in self and others before, during and after the Yuletide.\n“We must emulate the life of Jesus Christ in His practice and teachings on humility, service, compassion, patience, Peace and Righteousness that His birth signifies.\nHe also expected Nigerians to support efforts of security agencies by providing useful information that would assist them in the performance of their duties.\nAregbesola admonished all citizens to remain focused and expressed confidence that the year 2022 would be a better year for everyone."
  },
  {
    "headline": "Electoral Act Amendment: Senate Cowers, Suspends Move to Override Buhari’s Veto",
    "summarized_story": "Buhari had declined assent to the Electoral Act Amendment Bill, citing issues with direct primaries provisions in the bill.\n“The senate, also, in the closed session, discussed how to respond to the letter from Mr. President on the electoral bill amendment.\nThis is because we cannot sit back and allow one contentious clause to throw away all the positives in the proposed Electoral Act (amendment) Bill.\nThis Electoral Act [Amendment] Bill serves that purpose.\nMore Nigerians React…Meanwhile, Nigerians from all walks of life have continued to react to President Muhammadu Buhari’s refusal to assent to the electoral bill."
  },
  {
    "headline": "Buhari: Nigeria Requires N348trn for Realistic 5-year Nat’l Devt Plan",
    "summarized_story": "•FG to provide N49.7trn, private sector N298.3 trillionDeji Elumoye in AbujaPresident Muhammadu Buhari has disclosed that Nigeria requires an investment size of N348.1 trillion to achieve the targets set out in its five-year National Development Plan (NDP) from 2021 to 2025.\n‘‘This implies that successful implementation of the Plan will require a strong partnership between the public and private sectors.\nThe president recalled that the Federal Executive Council (FEC) had on November 10, 2021, approved the Draft National Development Plan, 2021-2025, which is the first of the envisaged Medium Term development Plans to implement the Nigeria Agenda 2050.\n‘‘I on September 9, 2020, therefore, inaugurated the National Steering Committee (NSC), co-chaired by the respected Mr. Atedo Peterside and the Honourable Minister of Finance, Budget and National Planning, Dr. (Mrs) Zainab Ahmed.\nAccording to him, “we congratulate Mr. President for launching the 2021-2025 Development Plan as ably introduced by the Minister of National Planning."
  },
  {
    "headline": "Senate Passes 2022 Budget, to Transmit Spending Plan to President Today",
    "summarized_story": "The Red Chamber also approved the N276.8 billion request of President Muhammadu Buhari for funding of expenditure in the 2021 budget before adjourning plenary to January 18, 2022.\nThis is just as President of the Senate, Dr. Ahmad Lawan also disclosed that the National Assembly would today transmit the 2022 budget passed by both chambers to President Muhammadu Buhari for assent.\nIn addition, the Federal Ministry of Industry, Trade and Investment received N17,966,745,438; Federal Ministry of Labour and Employment – N14,453,726,978; Federal Ministry of Science, Technology and Innovation – N49,683,523,165; Federal Ministry of Transport – N15,892,132,819; Federal Ministry of Aviation – N7,692,548,460; Federal Ministry of Power – N6,262,156,943, and Ministry of Petroleum Resources – N30,502,257, 191.\nOthers are Federal Capital Territory Administration – Nil; Federal Ministry of Niger Delta – N2,569,680,304; Federal Ministry of Youth and Sports Development – N185,489,102,966; Federal Ministry of Women Affairs – N2,103,758,084; Federal Ministry of Education – N593,473,925,256; Federal Ministry of Health – N462,858,698,619; Federal Ministry of Environment – N22,796,647,842; National Population Commission – N8,880,618,082, and Ministry of Humanitarian Affairs, Disaster Management and Social Development – N7,669,972,542.\nAlso yesterday, the Senate approved President Muhammadu Buhari’s request for the virement of N276,757,232,395 billion to fund expenditures in the 2021 budget."
  },
  {
    "headline": "NNPC Raked in N2.563trn from Petroleum Products Sale in 12 Months",
    "summarized_story": "•Nigerians consumed 19.535 billion litres in a year, says oil companyEmmanuel Addeh in AbujaThe Nigerian National Petroleum Company (NNPC) Ltd yesterday revealed that its downstream subsidiary, the Petroleum Products Marketing Company (PPMC) realised a total sum of N2.563 trillion from the sale of petroleum products between July 2020 and July 2021.\nTotal sale of petroleum products for the period July 2020 to July 2021, stood at 19.535 billion litres and Premium Motor Spirit (PMS) accounted for 99.73 per cent of total volume, the report stated.\nIn the downstream sector, to ensure sustained increase and effective distribution of petroleum products, especially Premium Motor Spirit (PMS), across the country, the NNPC said it had continued to diligently monitor the daily stock of petrol to achieve success in this regard.\n“Receipts from crude oil amounted to $12.95 million while gas and miscellaneous receipts stood at $78.69 million and $99.61 million respectively.\n“Total crude oil and gas export receipt for the period July 2020 to July 2021 stood at $1.73billion,” the national oil company noted."
  },
  {
    "headline": "Lawan: N’Assembly Will Transmit 2020 Budget to Buhari Thursday",
    "summarized_story": "According to him, businesses operating in the country as well as the economy stand to be impacted positively by the timely passage of the nation’s budget by the National Assembly.\n“We have seen the benefits of passing and assenting to the budget in good time, especially when we had to fight COVID-19.\n“The consequence of the implementation of the budget in 2021 and 2020 was very clear.\n“Our Committee on the Review of the 1999 Constitution has been doing its work.\n“We are expectant that our Committee on the review of the constitution will be presenting the report to this chamber as soon as we resume."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "Secret Memo: National Intelligence Agency Directors Ask Buhari To Stop Signing Documents He Doesn't Understand —Report",
    "summarized_story": "Directors in the Nigerian Intelligence Agency (NIA) have asked President Muhammadu Buhari to desist from appending his seal on decisions he does not understand.\nThe letter was written to Buhari amid claims that the President is considering tenure extension for the current NIA director-general, Ahmed Abubakar.\nThe directors described Buhari’s decision on the tenure elongation as a “wrong one based on a wrong advice”.\nThey pointed out that Buhari flouted the National Security Agencies Act, which specified that the NIA DG should be appointed on the advice of the national security adviser.\nMany have described the President’s decision as a “breach of national security.”"
  },
  {
    "headline": "Secret Memo: National Intelligence Agency Directors Ask Buhari To Stop Signing Documents He Doesn't Understand —Report",
    "summarized_story": "Directors in the Nigerian Intelligence Agency (NIA) have asked President Muhammadu Buhari to desist from appending his seal on decisions he does not understand.\nThe letter was written to Buhari amid claims that the President is considering tenure extension for the current NIA director-general, Ahmed Abubakar.\nThe directors described Buhari’s decision on the tenure elongation as a “wrong one based on a wrong advice”.\nThey pointed out that Buhari flouted the National Security Agencies Act, which specified that the NIA DG should be appointed on the advice of the national security adviser.\nMany have described the President’s decision as a “breach of national security.”"
  },
  {
    "headline": "ISWAP bombs Maiduguri as Buhari visits Borno",
    "summarized_story": "The Islamic State in West African Province (ISWAP) has launched multiple rockets attack on Maiduguri, Borno state capital.\nAdvertisementThe insurgents launched the attacks on Thursday ahead of President Muhammadu Buhari’s visit to the city to inaugurate projects done by the state government .\nThe president arrived in Maiduguri around 11 am as part of a one-day official visit to Borno.\nAdvertisementThe president was received by Babagana Zulum, governor of the state, Usman Kadafur, his deputy, members of national and state houses of assembly, and some top government officials.\nOther dignitaries that received the president were Faruk Yahaya, chief of army staff, and Christopher Musa, theatre commander of operation Hadin Kai."
  },
  {
    "headline": "ISWAP bombs Maiduguri as Buhari visits Borno",
    "summarized_story": "The Islamic State in West African Province (ISWAP) has launched multiple rockets attack on Maiduguri, Borno state capital.\nAdvertisementThe insurgents launched the attacks on Thursday ahead of President Muhammadu Buhari’s visit to the city to inaugurate projects done by the state government .\nThe president arrived in Maiduguri around 11 am as part of a one-day official visit to Borno.\nAdvertisementThe president was received by Babagana Zulum, governor of the state, Usman Kadafur, his deputy, members of national and state houses of assembly, and some top government officials.\nOther dignitaries that received the president were Faruk Yahaya, chief of army staff, and Christopher Musa, theatre commander of operation Hadin Kai."
  },
  {
    "headline": "Oil exports to drop as Shell declares force majeure on Nigerian Forcados crude",
    "summarized_story": "Shell Petroleum Development Company of Nigeria (SPDC) says it has declared force majeure on exports of Nigerian Forcados crude oil after a malfunctioning barge obstructed a tanker path.\nAdvertisementSPDC is a Nigerian subsidiary of the Royal Dutch Shell Plc.\nForce majeure is a clause that allows a company to skip contractual obligations following issues beyond its control.\nAdvertisementForcados is Nigeria’s sweet crude blend with an average output of about 200,000 barrels a day.\nThis halt in crude shipments from Nigeria’s Forcados will further increase the ongoing issues that have reduced crude oil export sales in recent months."
  },
  {
    "headline": "Oil exports to drop as Shell declares force majeure on Nigerian Forcados crude",
    "summarized_story": "Shell Petroleum Development Company of Nigeria (SPDC) says it has declared force majeure on exports of Nigerian Forcados crude oil after a malfunctioning barge obstructed a tanker path.\nAdvertisementSPDC is a Nigerian subsidiary of the Royal Dutch Shell Plc.\nForce majeure is a clause that allows a company to skip contractual obligations following issues beyond its control.\nAdvertisementForcados is Nigeria’s sweet crude blend with an average output of about 200,000 barrels a day.\nThis halt in crude shipments from Nigeria’s Forcados will further increase the ongoing issues that have reduced crude oil export sales in recent months."
  },
  {
    "headline": "Naomi Silekunola announces split from Ooni of Ife",
    "summarized_story": "Naomi Silekunola has announced her separation from Adeyeye Ogunwusi Ojaja II, the Ooni of Ife.\nShe also touched on her protracted “struggles” and the monarch’s preferences regarding his public image.\nSilekunola urged the public not to refer to her as “queen of Ile-Ife or the wife of the monarch”.\nAdvertisement“Let it be known that this decision to move on did not come because his majesty is married to another queen.\nAs many would love to assume, throughout our life as a couple, I was the only married wife to him,” she wrote."
  },
  {
    "headline": "TechCabal’s Guide to Gift Giving",
    "summarized_story": "So, if you want to roll with the big boys, here’s a last-minute gift guide for all our overworked hard-working readers out there.\nGift someone, or even yourself, a music subscription this season, so that next year you too can post your #SpotifyWrapped and we can all judge your bad taste in music.\nDon’t just gift music subscriptions, get listening devices to go with it.\nLaptop standsSource: The New York MagazineLaptop stands are also great gift items.\nPower banksSource: The IndependentWith great power comes great responsibility."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "FG destroys over 1m donated doses of expired Astrazeneca vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government on Wednesday destroyed over 1m doses of Astrazeneca vaccines donated to combat COVID-19.\n“As you can see these vaccines have now been deposited by the Abuja Environmental Protection Agency.\n“We have come through in our promise to all Nigerians to be transparent in our delivery of vaccines.\nNAN reports that Malawi was the first country to publicly destroy vaccine doses in May.\nThe African Union’s African Vaccine Acquisition Task Team shipped over 900,000 doses AstraZeneca vaccine to 13 African nations through donations."
  },
  {
    "headline": "Army promotes 117 officers to Major, Brigadier Generals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Army Council has approved promotion of 117 senior officers to Major and Brigadier Generals.\nThe promotion, comprising of 41 brigadier generals to the ranks of major generals and 76 colonels to the ranks of brigadier generals respectively, was approved at the council’s sitting on Tuesday.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, disclosed this in a statement on Wednesday in Abuja.\n“Others are Brig.-Gen. OJ Akpor, Director Military Training, Nigerian Defence Academy; Brig.-Gen. UT Musa of the Department of Administration Army Headquarters Abuja and Brig.-Gen. Abdulwahab Eyitayo, Acting General Officer Commanding 7 Division/ JTF NE Operation Hadin Kai Maiduguri.\n“The Chief of Army Staff, Lt.-Gen. Faruk Yahaya, congratulates all the promoted officers and their families, and urges them to redouble effort to justify the confidence reposed in them by the Nigerian army,” he said."
  },
  {
    "headline": "FG introduces digital tokens to replace NIN slip-Minister – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government has introduced a suite of digital Tokens to replace the aging NIN slip and polycarbonate card.\nThe Minister of Communications and Digital Economy, Isa Pantami said this at stakeholders workshop on the National Identification Number (NIN) Tokenization Solution organised by National Identity Management Commission (NIMC) in Abuja.\nHe said the tokenisation solution was customised to protect personal identifiable information and to protect the sanctity as well as sensitivity of the NIN issued by NIMC to registered individuals.\nAlso speaking, the Technical Consultant of NIMC, Mr Tunji Durodola said the Digital Token was designed to replace the 11-digit NIN for every usage for everyday usage.\n“Some of the pre-requisite of tokenization, one needs a NIN issued by NIMC, mobile number registered in Nigeria and linked to your NIN,” he said."
  },
  {
    "headline": "Electoral bill: CDD urges NASS to remove provisions on direct primaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Centre for Democracy and Development (CDD) has called on the National Assembly to immediately remove the provisions on direct primaries as raised by President Mohammad Buhari.\nCDD’ s Director, Idayat Hassan, in a statement in Abuja said the call became imperative against the backdrop of President Mohammad Buhari’s decision to decline assent to the Electoral Bill 2021.\n“As the election is just 14 months away, the CDD is calling on the National Assembly to immediately toe two immediate options.\nShe added that the reform in the Electoral Bill 2021 would improve the quality of elections thereby imbuing citizen’s trust in our democracy.\n“The National Assembly must act, and the time is now, save our elections and our democracy,” she said."
  },
  {
    "headline": "Olori Naomi quits marriage to Ooni of Ife, says monarch’s public identity not his true self",
    "summarized_story": "The wife of the Ooni of Ife, Oba Adeyeye Ogunwusi, Silekunola Naomi, has confirmed that she quit her three-year-old marriage to the monarch.\nThe monarch revealed Naomi Oluwaseyi, who runs an interdenominational ministry based in Akure, Ondo State, as his wife on Instagram on October 18, 2018.\nThis was 14 months after his ex-wife , Zaynab Otiti-Obanor, confirmed that her 17-month-old marriage to the monarch had indeed ended.\n”He chose Saul to be king, and when He was done, He told the prophet Samuel I have moved on.\nInstead, His Majesty has a picture he would love the world to see and perceive him as and another one which is his true self."
  },
  {
    "headline": "Osun 2022: My ambition is a call to duty -Dele Adeleke",
    "summarized_story": "By Sunday Oguntuyi, OsogboAn aspirant under People’s Democratic Party (PDP), in the forthcoming governorship election in Osun state, Mr. Bamidele David Adeleke, has said his ambition is borne out of his passion to serve the people of the state using his wealth of experience gathered from private sector.\nThere had been several calls since then and it continued to grow into the movement that it is today.\nAlso in bringing the South West together.”Adeleke noted that he could no longer fold his hands while Osun State continues to go down the drain as it suffers in incompetent hands.\n“From the word ‘sponsor’, it is the youths of Osun sponsoring me.\nIt is the spirit of wanting to make that difference that we so desperately need, that is sponsoring me."
  },
  {
    "headline": "Nigeria records 4,035 new cases of Covid-19, highest daily figure ever",
    "summarized_story": "Nigeria on Wednesday, recorded a total of 4,035 new cases of the Covid-19, representing the highest daily number of cases recorded in Nigeria since the virus came into the country last year.\nSo far in the week, a total of 7,930 new cases of the covid-19 has been recorded in the country with the number of active cases hitting 16,569, which is the highest since August 2021.\nA breakdown of the 4,035 cases shows that Lagos State led the pack with 3,393 new cases, accounting for 84.1% of the total cases recorded on Wednesday.\nAccording to the Nigeria Centre for Disease Control, a total of 2,991 deaths have been recorded, while 211,853 patients have been discharged.\nMeanwhile, Nigeria currently ranks 8th on the list of highest number of cases in Africa, following the likes of Kenya and Egypt with 270,899 and 377,960 cases respectively"
  },
  {
    "headline": "Nollywood actor, Sam Obiago is dead",
    "summarized_story": "Veteran Nollywood actor, filmmaker and chairman of Screen Writers Guild of Nigeria (SWGN), Mr. Sam Obiago has died.\nDetails of his death is not yet clear but his colleagues have taken to social media to mourn his passing.\nObiago was a filmmaker, actor and TV personality who has featured in over 100 Nollywood movies.\nAmong those are, Tears Of A King, Woman Of Fire, Royal Turning Point, Royal Appointment, Gifted, Bargain, Combined Forces, Altar Of Love, Wishes, Ancient Love, Drunk Princess, The Missing Blood, Obed And Ruth, Ghana Island, The Visitor, Osinachi, One Night Stand, Throne Of Fire, Ancient Key, Wicked Tradition, Tortured Heart, Royal Wreck, The King’s Decision, Blood Brothers, The Orbit, Strength Of Womanhood, Battle Of Kings, Royal Headache, Another Life, Game Of War, among others."
  },
  {
    "headline": "Police Begin Trial Of Officers Involved In Extortion",
    "summarized_story": "The FCT commissioner of police, CP Sunday Babaji, has ordered the immediate arrest, investigation and trial of police officers seen in a viral video extorting a motorist.\nFCT police spokesperson, DSP Josephine Adeh, said the officers who were on traffic duty along Area 11, Abuja, where a young man whose identity is yet to be identified was intercepted and extorted, have been taken into custody and are currently under investigation towards unraveling facts surrounding the situation.\nAccording to her, CP Babaji, who received the news with grave bewilderment described the attitude of the officers as a discreditable conduct, an act unbecoming of a police officer, and a total deviation from the core values of uprightness expected of a Police officer.\nThe CP also stated that the act is unacceptable and will not be condoned in the command as hesitation will not be made in the administration of a commensurate disciplinary action against the culprits.\nADVERTISEMENTThe police command also called on anyone who has a way of reaching out to the young man in the video to avail the command with his contact details or to relay a message of invitation to the public relations office of the command ."
  },
  {
    "headline": "Food Support Scheme: Osun Govt Gives Out ‘Ofada’ Rice To Beneficiaries",
    "summarized_story": "As part of efforts to encourage farmers and boost local production of rice in Osun Stats, the administration of Governor Adegboyega Oyetola, on Wednesday, commenced distribution of local rice popularly known as “Ofada” to the beneficiaries of its monthly Food Support Scheme.\nADVERTISEMENTHe disclosed that another empowerment plan had reached the final stage to ensure that widows, aged and other vulnerable citizens who were not captured in the food support scheme are properly taken care of.\nSamson Owoyokun, said it gladdened his heart that this month’s edition was dedicated to pure local food.\n“We are doing the 9th edition of the Ilerioluwa Food Support Scheme and this one is spectacular because we have gone out of our way to meet our local rice farmers to ensure that we are getting enough rice for distribution.\n“Yes, we couldn’t get all in the State because of the present rice production capacity but this is Nigerian-made rice popularly known as “Ofada rice” that we sourced locally from the farmers."
  },
  {
    "headline": "Food Support Scheme: Osun Govt Gives Out ‘Ofada’ Rice To Beneficiaries",
    "summarized_story": "As part of efforts to encourage farmers and boost local production of rice in Osun Stats, the administration of Governor Adegboyega Oyetola, on Wednesday, commenced distribution of local rice popularly known as “Ofada” to the beneficiaries of its monthly Food Support Scheme.\nADVERTISEMENTHe disclosed that another empowerment plan had reached the final stage to ensure that widows, aged and other vulnerable citizens who were not captured in the food support scheme are properly taken care of.\nSamson Owoyokun, said it gladdened his heart that this month’s edition was dedicated to pure local food.\n“We are doing the 9th edition of the Ilerioluwa Food Support Scheme and this one is spectacular because we have gone out of our way to meet our local rice farmers to ensure that we are getting enough rice for distribution.\n“Yes, we couldn’t get all in the State because of the present rice production capacity but this is Nigerian-made rice popularly known as “Ofada rice” that we sourced locally from the farmers."
  },
  {
    "headline": "N’Assembly To Transmit 2022 Budget To Buhari Thursday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the National Assembly will on Thursday transmit the 2022 budget passed by both chambers to President Muhammadu Buhari for assent into law.\nAccording to him, the timely assent of the 2022 Appropriations bill into law would ensure the commencement of its implementation by January next year.\n“[And] we are very optimistic that Mr. President will assent to the bill, like he did for 2020 and 2021, so that by January 2022, the implementation of the budget 2022 will commence by the grace of God.\nADVERTISEMENT“We have seen the benefits of passing and assenting to the budget in good time, especially when we had to fight COVID-19.\n“So, we believe that the economy of Nigeria, and Nigerian businesses especially, will continue to benefit from the passage of the appropriation bills in time and the assent by Mr. President, accordingly."
  },
  {
    "headline": "N’Assembly To Transmit 2022 Budget To Buhari Thursday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the National Assembly will on Thursday transmit the 2022 budget passed by both chambers to President Muhammadu Buhari for assent into law.\nAccording to him, the timely assent of the 2022 Appropriations bill into law would ensure the commencement of its implementation by January next year.\n“[And] we are very optimistic that Mr. President will assent to the bill, like he did for 2020 and 2021, so that by January 2022, the implementation of the budget 2022 will commence by the grace of God.\nADVERTISEMENT“We have seen the benefits of passing and assenting to the budget in good time, especially when we had to fight COVID-19.\n“So, we believe that the economy of Nigeria, and Nigerian businesses especially, will continue to benefit from the passage of the appropriation bills in time and the assent by Mr. President, accordingly."
  },
  {
    "headline": "Queen Silekunola announces divorce from Ooni of Ife",
    "summarized_story": "Her Majesty Queen Silekunola Naomi has announced her divorce from the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja II.\nIn a statement posted on her verified Instagram handle on Thursday, she said announced an end to the three-year marriage.\nShe wrote, “Today I announce the beginning of a new dawn and the close of a chapter.\nToday, I am a mother to God’s unique gift.\nI, at this moment, announce that I shall no longer be referred to as wife to the Ooni of Ife or as Queen of Ile-Ife but as the Queen of the people and mother of my adorable Prince.”Details later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Queen Silekunola announces divorce from Ooni of Ife",
    "summarized_story": "Her Majesty Queen Silekunola Naomi has announced her divorce from the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja II.\nIn a statement posted on her verified Instagram handle on Thursday, she said announced an end to the three-year marriage.\nShe wrote, “Today I announce the beginning of a new dawn and the close of a chapter.\nToday, I am a mother to God’s unique gift.\nI, at this moment, announce that I shall no longer be referred to as wife to the Ooni of Ife or as Queen of Ile-Ife but as the Queen of the people and mother of my adorable Prince.”Details later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NNPC Rakes in N203bn from Petroleum Products Sale in July 2021",
    "summarized_story": "…As Gas Production Goes up 4%A total sum of ₦203.73billion was made on the sale of white products in the month of July 2021 by the Petroleum Products Marketing Company (PPMC), a downstream subsidiary of the Nigerian National Petroleum Company (NNPC) Ltd.\nSimilarly, a total of 1.544billion litres of petroleum products were sold and distributed by the PPMC, in the month of July 2021 with PMS accounting for 99% of total volume.\nTotal sale of petroleum products for the period July 2020 to July 2021 stood at 19.535billion litres and Premium Motor Spirit (PMS) accounted for 99.73% of total volume, the report stated.\nIn the Upstream, NNPC recorded total export receipt of $191.26million in July 2021 as against $188.00million in June 2021.\nTotal crude oil and gas export receipt for the period July 2020 to July 2021 stood at $1.73billion."
  },
  {
    "headline": "NNPC Rakes in N203bn from Petroleum Products Sale in July 2021",
    "summarized_story": "…As Gas Production Goes up 4%A total sum of ₦203.73billion was made on the sale of white products in the month of July 2021 by the Petroleum Products Marketing Company (PPMC), a downstream subsidiary of the Nigerian National Petroleum Company (NNPC) Ltd.\nSimilarly, a total of 1.544billion litres of petroleum products were sold and distributed by the PPMC, in the month of July 2021 with PMS accounting for 99% of total volume.\nTotal sale of petroleum products for the period July 2020 to July 2021 stood at 19.535billion litres and Premium Motor Spirit (PMS) accounted for 99.73% of total volume, the report stated.\nIn the Upstream, NNPC recorded total export receipt of $191.26million in July 2021 as against $188.00million in June 2021.\nTotal crude oil and gas export receipt for the period July 2020 to July 2021 stood at $1.73billion."
  },
  {
    "headline": "JUST IN: Queen Naomi Silekunola divorces Ooni of Ife",
    "summarized_story": "By Nehru OdehHer Majesty Queen Silekunola Naomi, the estranged wife of the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja 11 has announced her divorce from the traditional ruler.\nShe announced an end to the three year marriage in a statement posted on her verified Instagram handle on Thursday,She wrote, “Today I announce the beginning of a new dawn and the close of a chapter.\nToday, I am a mother to God’s unique gift.\nI am no longer a slave to my thoughts of perfection.\nI, at this moment, announce that I shall no longer be referred to as wife to the Ooni of Ife or as Queen of Ile-Ife but as the Queen of the people and mother of my adorable Prince.”"
  },
  {
    "headline": "Ayade bows to people’s choice, halts plan to sell state companies",
    "summarized_story": "Ayade told newsmen that while privatizing the companies was the right thing to do, it was not politically correct.\nFew weeks back, Cross River conducted a referendum on the governor’s plan to privatize the companies, but majority of Cross River people antagonised the plan.\nAyade also called on the people of Cross River to take advantage of the companies to create wealth for themselves by partnering.\n“I took over a state that is basically a civil service state happy with dancing on the streets during Christmas in the name of carnivals which does not really yield much to the state.\nAyade added that if the state was to grow, it must go beyond just being a civil service state with the salary mentality."
  },
  {
    "headline": "JUST IN: Queen Naomi Announces ‘Divorce’ From Ooni Of Ife, Explains Reasons",
    "summarized_story": "Queen Silekunola Naomi has declared her divorce from Oba Adeyeye Ogunwusi Ojaja II, the Ooni of Ife.\nHe chose Saul to be king, and when He was done, He told the prophet Samuel I have moved on.\nShe further explained, “As many would love to assume, throughout our life as a couple, I was the only married wife to him.\nHe later married Silekunola in 2018 and the marriage produced a son, Tadenikawo.\nOlatubosun gave birth to Princess Adeola Ogunwusi but of recent, there have been counter-claims between the Ooni and Olatubosun over who was responsible for the upbringing of their daughter."
  },
  {
    "headline": "BREAKING: President Buhari Leaves Aso Villa For Maiduguri",
    "summarized_story": "), has arrived at the Presidential Wing of the Nnamdi Azikiwe International Airport in Abuja, from where he will fly to Maiduguri, the capital of Borno State.\nThe President is visiting Maiduguri to commission multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nThe PUNCH had reported on Tuesday that Governor Zulum said President Buhari has greatly supported Borno State and made sacrifices so that the people can live in peace, harmony, and progress.\nHe said Buhari had spent more than $50m to generate stable and sustainable power and energy for the people of Borno State.\nMeanwhile, as the President is en route to Maiduguri, Vice President Yemi Osinbajo is currently presiding over an Extraordinary Federal Executive Council meeting at the Council Chambers."
  },
  {
    "headline": "Ooni Of Ife Reveals Why He Almost Commited Sucide",
    "summarized_story": "Oba Adeyeye Ogunwusi Ojaja II, the Ooni of Ife, has revealed why he tried suicide at a young age.\nOoni disclosed that he attempted suicide over an N8 billion loan he collected.\nDisclosing that the loan was used on a failed real estate project, the monarch said listening to music, however, saved him from committing suicide.\nWhen I almost committed suicide in my younger age as a real estate business man, it was music that saved my life.\n“I had become very successful in the real estate sector at a very young age."
  },
  {
    "headline": "BREAKING: NCAA Shuts Down Glo Abuja Base Station Over N4.5bn Debt",
    "summarized_story": "Globacom (Glo) facility in Wuse 2 Abuja has been shut down by the Nigerian Civil Aviation Authority (NCAA) due to an N4.7 billion debt.\nMusa Nuhu, the NCAA’s director-general, conducted the drill, which was overseen by Sen. Hadi Sirika, the Minister of Aviation.\nThe DG stated that a number of Glo’s Main Switch Centres (MSC) around the country will remain closed unless the telecom giant commits to a payment plan.\nDetails later…"
  },
  {
    "headline": "Breaking: Queen Naomi part ways with Ooni of Ife",
    "summarized_story": "Wife of the Ooni of Ife, Queen Silekunola Naomi has announced her divorce from the Oba Adeyeye Ogunwusi Ojaja II.\nAccording to a post on her verified Instagram handle, Thursday, the queen announced the end to the three-year marriage with the monarch.\nShe said, “Today I announce the beginning of anew dawn and the close of a chapter.\nToday, I am amother to God’s unique gift.\nI, at this moment,announce that I shall no longer be referred to aswife to the Ooni of Ife or as Queen of Ile-Ife but asthe Queen of the people and mother of my adorablePrince.”Details loading…"
  },
  {
    "headline": "Breaking: Another popular Nollywood actor, Daddy Sam, is dead",
    "summarized_story": "A veteran and popular Nollywood actor Sam Obiago also known as Daddy Sam has passed on.\nThe death of Daddy Sam who was said to ill in the past few days was disclosed by the President of Actors Guild of Nigeria Emeka Rollas on social media on Thursday morning.\nDetails loading…"
  },
  {
    "headline": "Internal wrangling won’t affect APC’s chances in 2023 – Bagudu",
    "summarized_story": "Kebbi state Governor Atiku Abubakar Bagudu has assured that the internal wrangling within the All Progressives Congress (APC) would not make the party sink ahead of the 2023 general elections.\nThe governor said despite the wrangling, the APC, under the present national caretaker committee, has attracted more people, including serving governors and federal legislators.\n“My appeal is for the caretaker committee to remain proactive; certain issues should not be allowed to go into speculation.\nSo, party members should look forward for a specific date that will be announced by the caretaker committee.\n“Another point which is there in the book is an appeal to party leaders again to prioritise the issue of relationship because the major challenge of politics in this country today is poor management of relationship among party leaders."
  },
  {
    "headline": "BREAKING: Explosions Rock Maiduguri Ahead Of Buhari’s Visit",
    "summarized_story": "At least four people were killed on Thursday after three explosions rocked Maiduguri the Borno State Capital.\nThe blasts which come a few hours before President Muhammadu Buhari’s visit to the state left about eight persons injured.\nPresident Buhari is billed to commission an edifice donated by Mohammed Indimi to the University of Maiduguri.\nHe is also expected to commission some projects executed by the Borno State Government.\nIt is not clear at this time if the president’s itinerary will be affected by the explosions."
  },
  {
    "headline": "Gunmen Abduct 70 Travellers Along Kaduna-Birnin Gwari Highway",
    "summarized_story": "Over 70 travellers have been reportedly kidnapped by gunmen along the Kaduna-Birnin Gwari Road on Wednesday.\nThe incident occurred around Udawa village after Buruku in Chikun Local Government Area of the state.\nAccording to an eyewitness account, the vehicles conveying the travellers, mainly traders, were attacked by a large number of gunmen in the morning.\nBut authorities of the Kaduna State Police Command said they rescued 48 of the kidnapped victims.\nHe explained that the police operatives successfully repelled the attack through superior firepower before rescuing 48 of the passengers."
  },
  {
    "headline": "Nigeria Confirms Highest-Ever Daily COVID-19 Cases",
    "summarized_story": "Nigeria on Wednesday reported 4,035 COVID-19 cases, the highest-ever daily infection tally since the disease was detected in the country nearly two years ago.\nThe Nigeria Centre for Disease Control (NCDC) disclosed this in its daily update about the pandemic in the country.\nOgun – 30; Abia – 26; Bauchi – 15; Ondo – 14; Enugu – 9 and Kwara – 7 are the other states with additional COVID-19 infections.\nWith the new figures, Nigeria’s COVID-19 infections now stand at 231,413 out of which 211,853 have been successfully treated and discharged.\nBut on Tuesday, Nigeria destroyed one million, sixty-six thousand, two hundred and fourteen (1,066,214) doses of the AstraZeneca vaccine, raising concerns over the COVID-19 vaccination drive."
  },
  {
    "headline": "Electoral Bill: Again, Senate Holds Closed-Door Session, Awaits Reps For Next Move",
    "summarized_story": "Senators resumed plenary on Wednesday with another closed-door session discussing President Muhamadu Buhari’s veto on the Electoral Act Amendment bill.\nAt the end of the session, Senate President Ahmad Lawan said the lawmakers discussed President Buhari’s refusal to sign the Electoral Act Amendment Bill into law.\nThe National Assembly on Tuesday read President Buhari’s letter in which he declined assent to the Electoral Act Amendment Bill.\nVeto or NotPresident Buhari’s decline to the Electoral Amendment Bill drew reactions from various quarters.\nA federal lawmaker Senator George Sekibo confirmed to Channels Television on Tuesday that some senators are planning to veto President Muhammadu Buhari on the electoral act amendment bill."
  },
  {
    "headline": "Buhari Arrives In Maiduguri Despite Multiple Explosions",
    "summarized_story": "President Muhammadu Buhari has arrived in Maiduguri, the Borno State Capital, where he will be commissioning various projects.\nThere were doubts on Thursday that Buhari will still visit the state, as three explosions rocked the city just a few hours before the president’s arrival.\nREAD ALSO: Explosions Rock Maiduguri Ahead Of Buhari’s VisitAfterward, he will proceed to commission some projects executed by the Borno State Government.\nThe explosions which some feared might have made the president cancel his Maiduguri trip, claimed the lives of at least four persons.\nThree different locations experienced blasts but while casualties were reported in Ayaje and Bulumkutu, there were no concrete reports from Ajilari."
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Just In: Reps raise 2022 budget by N200bn, extend 2021 budget lifespan by 90 days -",
    "summarized_story": "The House of Representatives has extended the lifespan of the 2021 Appropriation act by nine months to enable it run concurrently with the 2022 appropriation.\nMeanwhile, the house of representatives has raised the budget by N200b and passed N17.126 billion as 2022 Spending plan.\nStill in the house of representatives, the lawmakers have approved N215.81b for the Federal Inland Revenue Service in 2022Also, the Senate has approved the nomination of Muazu Sambo as the new minister of Power.\nRecall that President Muhammadu Buhari had few months ago sacked the former minister over failure to improve the sector."
  },
  {
    "headline": "Buhari gives reasons for not signing Electoral Act Amendment Bill -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has read President Muhammadu Buhari’s letter explaining why he declined to sign the Electoral Act Amendment bill.\nAccording to the president, direct primaries an affront to the right to freedom of association."
  },
  {
    "headline": "World’s Second-Biggest Miner Rio Tinto Buys Lithium Project For $825m",
    "summarized_story": "World’s second-biggest miner Rio Tinto Group has agreed to buy a lithium mine in Argentina for $825 million as the company accelerates its push into battery materials.\nRio stated that it will buy the Rincon asset in Argentina from private equity buyers.\nThe lithium brine project is in the so-called lithium triangle in South America, home to many of the best lithium deposits.\nRio is already looking to develop a $2.4 billion lithium mine in Serbia as it moves to diversify its business away from iron ore.\nClearly, Rio has thought their lithium strategy through.”Rio’s push into lithium comes as prices surge."
  },
  {
    "headline": "Electoral Act Amendment: Nigeria Senate Cowers, Suspends Move to Override Buhari’s Veto",
    "summarized_story": "Despite the resolve and threat by many senators on Tuesday to overrule President Muhammadu Buhari’s veto of the Electoral Act Amendment Bill, the senate Wednesday, backed down from its resolve.\nBuhari had declined assent to the Electoral Act Amendment Bill, citing issues with direct primaries provisions in the bill.\n“The senate, also, in the closed session, discussed how to respond to the letter from Mr. President on the electoral bill amendment.\nThis is because we cannot sit back and allow one contentious clause to throw away all the positives in the proposed Electoral Act (amendment) Bill.\nThis Electoral Act [Amendment] Bill serves that purpose."
  },
  {
    "headline": "Nigeria Senate Passes 2022 Budget, to Transmit Spending Plan to President on Thursday",
    "summarized_story": "The Red Chamber also approved the N276.8 billion request of President Muhammadu Buhari for funding of expenditure in the 2021 budget before adjourning plenary to January 18, 2022.\nThis is just as President of the Senate, Dr. Ahmad Lawan also disclosed that the National Assembly would on Thursday transmit the 2022 budget passed by both chambers to President Muhammadu Buhari for assent.\nIn addition, the Federal Ministry of Industry, Trade and Investment received N17,966,745,438; Federal Ministry of Labour and Employment – N14,453,726,978; Federal Ministry of Science, Technology and Innovation – N49,683,523,165; Federal Ministry of Transport – N15,892,132,819; Federal Ministry of Aviation – N7,692,548,460; Federal Ministry of Power – N6,262,156,943, and Ministry of Petroleum Resources – N30,502,257, 191.\nOthers are Federal Capital Territory Administration – Nil; Federal Ministry of Niger Delta – N2,569,680,304; Federal Ministry of Youth and Sports Development – N185,489,102,966; Federal Ministry of Women Affairs – N2,103,758,084; Federal Ministry of Education – N593,473,925,256; Federal Ministry of Health – N462,858,698,619; Federal Ministry of Environment – N22,796,647,842; National Population Commission – N8,880,618,082, and Ministry of Humanitarian Affairs, Disaster Management and Social Development – N7,669,972,542.\nOn Wednesday ay, the Senate approved President Muhammadu Buhari’s request for the virement of N276,757,232,395 billion to fund expenditures in the 2021 budget."
  },
  {
    "headline": "Nigeria Destroys More Than 1 Million Expired Covid Vaccines",
    "summarized_story": "Nigeria has destroyed more than a million doses of expired AstraZeneca vaccines in a bid to assure a wary public that they have been taken out of circulation.\nThe Reuters news agency reported on December 7 that about one million COVID-19 vaccines were estimated to have expired in Nigeria in November without being used.\nA truck offloads expired AstraZeneca vaccines at the Gosa dumpsite in Abuja [Afolabi Sotunde/Reuters]Al Jazeera’s Fidelis Mbah, reporting from Abuja, said the delivery of the vaccines has been accompanied by conspiracy theories via social media and word of mouth.\n“We have successfully withdrawn 1,066,214 doses of expired AstraZeneca vaccines.\nThe World Health Organisation said 12,971,729 vaccine doses have been administered in Nigeria as of December 19."
  },
  {
    "headline": "Carabao Cup Semi-Final Draw: Arsenal v Liverpool, Chelsea v Tottenham",
    "summarized_story": "Arsenal will face Liverpool in the semi-finals of the Carabao Cup, while Chelsea will meet Tottenham.\nChelsea’s meeting with Spurs is a repeat of the 2015 final, when the Blues won 2-0 at Wembley.\nEight-time winners Liverpool came from 0-2 and 1-3 down to make it 3-3 before they beat Leicester 5-4 on penalties in a thrilling quarter-final on Wednesday.\nThe Reds won the match 4-0.\nWhile Chelsea won 2-0 at Brentford on Wednesday, Tottenham overcame West Ham 2-1."
  }
]