[
  {
    "headline": "Drinking coffee could prevent chronic liver disease, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that drinking coffee could help reduce the risk of chronic liver disease.\nThe study published in the BMC Public Health Journal said that it has found evidence that all types of coffee (including decaffeinated) have protective effects against chronic liver disease outcomes.\nThe researchers examined the coffee habits of 384,818 coffee drinkers and 109,767 non-coffee drinkers over 11 years with the participants of the study being adults between 40 – 69 years of age.\nAt the end of the study, the researchers said they found that “coffee drinkers were 21% less likely to develop chronic liver disease, 20% less likely to develop chronic or fatty liver disease, and 49% less likely to die from chronic liver disease than non-coffee drinkers.\nThe study said it “agrees with previous cohort studies that generally report inverse associations between coffee consumption and chronic liver disease outcomes, including deranged liver enzymes, fibrosis, cirrhosis and hepatocellular carcinoma – which occurs in people with chronic Hepatitis B and C.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Drinking coffee could prevent chronic liver disease, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that drinking coffee could help reduce the risk of chronic liver disease.\nThe study published in the BMC Public Health Journal said that it has found evidence that all types of coffee (including decaffeinated) have protective effects against chronic liver disease outcomes.\nThe researchers examined the coffee habits of 384,818 coffee drinkers and 109,767 non-coffee drinkers over 11 years with the participants of the study being adults between 40 – 69 years of age.\nAt the end of the study, the researchers said they found that “coffee drinkers were 21% less likely to develop chronic liver disease, 20% less likely to develop chronic or fatty liver disease, and 49% less likely to die from chronic liver disease than non-coffee drinkers.\nThe study said it “agrees with previous cohort studies that generally report inverse associations between coffee consumption and chronic liver disease outcomes, including deranged liver enzymes, fibrosis, cirrhosis and hepatocellular carcinoma – which occurs in people with chronic Hepatitis B and C.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Nigeria to grapple with 20m drug users by 2030 —UNODC",
    "summarized_story": "Over 14.3 million people in Nigeria used different kinds of drugs in the year 2020, the United Nations Office on Drugs and Crime said in its “World Drug Report 2021” published globally on Thursday.\nThe report stated that from UNODC’s Drug Use Survey in Nigeria, 14.3 million people used drugs, a figure that increased in 2020, along with the figure for Africa.\nThe UN body noted that the COVID-19 global pandemic also heightened the risk of drug use during the period under review and based on the current projections, Nigeria would have an estimated 20 million drug users to grapple with by 2030.\n“In Nigeria, this would signify that the country will have to grapple with approximately 20 million drug users by 2030 further deepening the public health and public security challenge”, the report added.\nIn Nigeria, with 14.4%, the drug use prevalence is significantly higher than the global average,” it said."
  },
  {
    "headline": "Nigeria to grapple with 20m drug users by 2030 —UNODC",
    "summarized_story": "Over 14.3 million people in Nigeria used different kinds of drugs in the year 2020, the United Nations Office on Drugs and Crime said in its “World Drug Report 2021” published globally on Thursday.\nThe report stated that from UNODC’s Drug Use Survey in Nigeria, 14.3 million people used drugs, a figure that increased in 2020, along with the figure for Africa.\nThe UN body noted that the COVID-19 global pandemic also heightened the risk of drug use during the period under review and based on the current projections, Nigeria would have an estimated 20 million drug users to grapple with by 2030.\n“In Nigeria, this would signify that the country will have to grapple with approximately 20 million drug users by 2030 further deepening the public health and public security challenge”, the report added.\nIn Nigeria, with 14.4%, the drug use prevalence is significantly higher than the global average,” it said."
  },
  {
    "headline": "Ministry of Trade and Investment endorses the 2020 Corporate Sustainable Investor Report",
    "summarized_story": "By Moses NosikeNigeria’s Federal Ministry of Industry, Trade and Investment has expressed support for the 2020 Corporate Sustainable Investor Report (CSIR), a research document that analyses the sustainability progress of companies in Nigeria.\nI deeply appreciate the development of this Corporate Sustainable Investment Report which encourages sustainable and ethical business practices.\nIn the wake of major human rights abuses in recent decades, there has been an increased interest in acknowledging human rights.\nOftentimes, established companies are unwittingly complicit in this repression of human rights.\nTo be included in the CSIR, corporate organisations need to meet two out of the four prerequisites."
  },
  {
    "headline": "Nestlé launches sustainability training for kids",
    "summarized_story": "The training which is being implemented in collaboration with the International Climate Change Development Initiative (ICCDI), was launched under her Nestlé for Healthier Kids (N4HK) program.\nThe Sustainability Training for Kids is specially designed to help children inculcate the right habits at an early age.\nI recall with special interest your interventions in the educational sector in Ogun State, especially through the Nestlé for Healthier Kids project which has contributed immensely to the wellbeing of our learners.\nNestlé for Healthier Kids (N4HK) is the company’s flagship initiative which aims to help 50 million children globally lead healthier lives by 2030.\nIn Nigeria, N4HK incorporates a school-based nutrition education program, which helps children imbibe healthy habits including good nutrition, active lifestyles through adequate physical activity, good hygiene practices and healthy hydration."
  },
  {
    "headline": "I was not quizzed by DSS, says Gumi",
    "summarized_story": "Sheikh Ahmad GumiBy Ibrahim WuyoShekh Ahmad Gumi, the Kaduna based Islamic scholar, has denied either being quizzed or invited for questioning by the Department of State Security (DSS).\nThe Sheikh was reported to have been with the DSS for questioning over remarks he allegedly made against the militarySheikh Gumi however, said in an interview that his interventions with bandits inside the forest were done in collaboration with the support of the government and security agencies, and therefore ,he did not commit any offence.\n“Nobody Invited me for questioning or any arrest, I can say that categorically.Since I ventured into the forest, I went there with full security, the police, with the knowledge of the DSS, traditional rulers and the Fulani leaders, I never went alone.”“I never made any disparaging remarks against the military during my recent live interview on national television.There was nowhere in the TV interview that I categorically accused the entire military,” he said.\nEarly on Friday ,it was reported that he DSS had invited Gumi for questioning in its Kaduna office.\nVanguard News Nigeria"
  },
  {
    "headline": "Police confirm bandits attack along Kaduna-Kachia road",
    "summarized_story": "The Police Command in Kaduna State, on Friday confirmed attack by suspected bandits along Kaduna-Kachia road in the state, abducting an unspecified number of travellersThe Command’s Public Relations Officer, ASP Mohammed Jalige, confirmed the incident to the News Agency of Nigeria (NAN) in a telephone interview in Kaduna.\nJalige said three empty vehicles were recovered from the scene, while one person was found injured and taken to hospital for treatment.\nAn eyewitness who did not want his name mentioned, told NAN that the incident happened about 3:00pm at Makyalli area along Kaduna – Kachia road.\nAccording to him, he was plying the road when some people alerted him a few meters to the place of the incident.\nHe said he and some other lucky commuters spent about 40 minutes on the highway before security operatives came and cleared the road."
  },
  {
    "headline": "Ebonyi rates highest on drug abuse, says official",
    "summarized_story": "Mr Eze Ude, State Coordinator, International Society for Substance Use Prevention and Treatment Professionals (ISSUP), said that Ebonyi was being rated highest in substance abuse among states of the federation.\nAccording to him, the state is rated above 13 per cent in the act of drug abuse, according to United Nations’ statistics.\n“In United Nation report of 2018, research shows that globally, we have about 5.6% rate of substance abuse.\n“According to the same statistics, the state is over 13 per cent with this analysis, one can see the rate of substance abuse in Ebonyi and Nigeria in general,” Ude explained.\nHe said that large number of young men and women at the hospital were usually seen on daily basis going down as a result of drug abuse."
  },
  {
    "headline": "Olayemi Grace Odetomi: Police confirm murder of ex-Oyo commissioner’s wife",
    "summarized_story": "The Police Command in Oyo State has confirmed the killing of Mrs. Olayemi Grace Odetomi by gunmen.\nShe was the wife of Peter Oluremi Odetomi, a former Commissioner for Local Government and Chieftancy Matters.\nOdetomi was shot dead on Friday in her residence at Ashi in the Bodija area of Ibadan, the state capital.\nPolice Public Relations Officer, DSP Adewale Osifeso, confirmed the incident.\nOsifeso assured that further updates will be communicated to the public."
  },
  {
    "headline": "Ayade stops salaries of aides, LG chairmen, others who refused to follow him to APC",
    "summarized_story": "Political appointees, elected local government chairmen, councilors and other political office holders in Cross River State have not been paid their May 2021 salaries and allowances.\nDAILY POST gathered that salaries for the month of May 2021 was paid but the appointees, elected and others have not been paid.\nHe raised the alarm over the alleged withholding of salaries and allowances of some House of Assembly members and councillors for refusing to defect to the APC.\n“It is criminal to seize elected officers’ salaries and allowances for not defecting to APC with you.\n“Well, we as a party would not fold our hands and allow our members to be humiliated just because they refused to join Ayade in APC."
  },
  {
    "headline": "Tell us how much you got, those sponsoring Fulani terrorists",
    "summarized_story": "Femi Fani-Kayode, former Aviation Minister has charged Ahmad Gumi, popular Islamic cleric, to disclose his benefits from banditry.\nFani-Kayode charged Gumi to tell Nigeria s how much “commission” he gets from the abduction of students by bandits.\nIn a tweet, the former Aviation Minister has charged the Islamic cleric to reveal foreign countries funding Fulani terrorists causing havoc in Nigeria.\nHe had also alleged that bag eggs in the security agencies are aiding bandits with weapons and drugs.\nHowever, the Islamic cleric has denied being summoned by the DSS."
  },
  {
    "headline": "Derek Chauvin sentenced to 22.5 years in prison over George Floyd’s death",
    "summarized_story": "Former police officer Derek Chauvin, has been sentenced to 22 and half years in prison (270 months) for the murder of George Floyd.\nVerdict on Derek Chauvin historic in US – George Floyd’s brotherThis is coming after Minnesota Assistant Attorney General Matthew Frank asked for a sentence of 360 months (30 years) for Chauvin.\nRecall that Floyd, an unarmed 46-year-old man died on May 25, 2020, in the hands of the White police officer in Minneapolis, Derek Chauvin.\nGeorge Floyd: Joe Biden reacts as jury finds Derek Chauvin guiltyChauvin who was seen in the viral video with his knee on Floyd’s neck, was charged with third-degree murder and manslaughter which some blacks and protesters believe were not harsh enough for the crime.\nHowever, Minnesota Attorney General Keith Ellison later announced that the charges against Chauvin had been upgraded to second-degree murder and that new charges have been filed against the other three officers involved."
  },
  {
    "headline": "Borno: Provost queried for suspending students who refused to welcome Buhari",
    "summarized_story": "Juliana Bitrus, Borno State Commissioner of Health has issued a query to the Provost, College of Nursing and Midwifery, Rukaiya Mustapha, for suspending some students who failed to welcome President Muhammadu Buhari.\nBitrus described the provost’s action as mischievous and against Borno State Government.\nThe commissioner lamented Mustapha acted without recourse to any official at her supervising ministry.\nThe commissioner said while Borno has about eight state owned tertiary institutions, it was curious that only the students of one were punished.\nBitus added that though it is a normal practice that students join in welcoming visiting Presidents, such acts are voluntary."
  },
  {
    "headline": "NPC amendment act: the corrupt mind of power",
    "summarized_story": "The government has, for a long time, stroked its beard in thoughtful consideration of how to further shackle the Nigerian media already ranked as one of the least free in the world.\nThe administration of the country is the duty of all these three arms of government, and it is from the legislature that one controversial bill, which seeks to amend the Nigerian Press Council Act, emanated.\nThis bill gratuitously grants the media an endangered status thereby making the country’s democracy to rock on its heels.\nAlthough he did the spade work, the opinion of the public is that he is a stooge of government.\n“Power tends to corrupt and absolute power corrupts absolutely,” said Lord Acton."
  },
  {
    "headline": "Police confirm killing of Ex-Oyo Commissioner’s wife",
    "summarized_story": "Agency ReporterThe Police Command in Oyo State, has confirmed the killing of Mrs Olayemi Odetomi, wife of a former Commissioner for Local Government and Chieftancy Matters, in the state by unknown gunmen.\nThe News Agency of Nigeria (NAN) gathered that Mrs Odetomi was shot dead on Friday in her residence at Ashi, Bodija Area of Ibadan, when unknown gunmen invaded her house.\nADVERTISEMENTThe Police Public Relations Officer in the state, DSP Adewale Osifeso, confirmed the incident in a text message sent to NAN in Ibadan.\nOsifeso said that the deceased, aged 66, died immediately after being shot.\n“Updates on Investigations would be provided in due course,” he said."
  },
  {
    "headline": "NDLEA arrests 46 suspected drug traffickers in six months in Enugu",
    "summarized_story": "Agency ReporterThe National Drug Law Enforcement Agency (NDLEA), says 46 suspected drug traffickers were arrested in Enugu State in the last six months.\nThe State Commander of the agency, Mr Bassey Anietie, disclosed this on Friday in Enugu while briefing newsmen on the sidelines of the International Day Against Drug Abuse and Illicit Trafficking.\n“Our youths are getting increasingly involved in drug abuse and trafficking which to a large extent has threatened their future growth rate and development,” he said.\n“The drug problem cuts across every segment of human life and permeates every sector of the economy.\nThe News Agency of Nigeria (NAN) reports that the theme for the 2021 International Day Against Drug Abuse and Illicit Trafficking is, ‘Share Facts on Drugs, Save Lives’."
  },
  {
    "headline": "TIMELINE of Buhari’s foreign ‘medical trips’ in six years",
    "summarized_story": "By Alao AbiodunPresident Muhammadu Buhari’s frequent foreign travels, especially for medical check-ups have always set many tongues wagging.\nAsides his medical trips, Buhari has visited the UK on several occasions for private and official reasons.\nA lot of Nigerians have always raised questions on propriety of Buhari’s medical tourism with respect to the country’s healthcare system.\nHere is a timeline of the Buhari’s trips for medical treatment:* February 5-10, 2016: Buhari took a six-day vacation in the United Kingdom.\n* June 6-19, 2016: Buhari went on a 10-day medical trip to England for an ear infection surgery."
  },
  {
    "headline": "FRSC impounds 835 articulated vehicles in Lagos",
    "summarized_story": "Agency ReporterLagos Sector Command of the Federal Road Safety Corps (FRSC) says it impounded 835 articulated vehicles in 2020 under its Operation Scorpion I, II and III.\nThe conference on: “Curbing Crashes Involving Articulated Vehicles, was jointly organised by FRSC, Lagos State Transport Management Authority (LASTMA) and Vehicle Inspection Service (VIS), Lagos State.\n“The FRSC, Lagos Sector Command, had in recent times adopted and engaged in some home-grown operational initiatives.\nHe added that accidents involving articulated vehicles had huge negative impacts on the economy.\nThe Director of Vehicle Inspection Service (VIS), Lagos State, Mr Akin Fashola, said that VIS would continue to work with FRSC in improving road safety."
  },
  {
    "headline": "DSS quizzes Gumi over remarks against military",
    "summarized_story": "From Molly Kilete, Abuja and Noah Ebije, KadunaThe Department of State Service (DSS) has quizzed controversial Islamic cleric, Sheikh Ahmad Abubakar Gumi, over remarks he made on Arise Television that some Nigerian soldiers might be aiding and abetting bandits.\nA Voice of America (VOA) Hausa service report monitored on Friday said Gumi was invited to the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi alleging that their operatives were conniving with bandits.\nHowever, Gumi’s spokesman, Malam Tukur Mamu in an interview with VOA Hausa Service, dismissed the allegation against Gumi, saying there was nowhere in the TV interview where Gumi categorically accused the entire military.\nMeanwhile Sheikh Ahmad Gumi has debunked reports that he was invited or quizzed by the DSS.\nThe DSS on Friday confirmed that it invited Islamic cleric Sheikh Ahmad Gumi for questioning."
  },
  {
    "headline": "Anambra guber: Obiora Okonkwo, 15 others in epic battle FOR PDP ticket",
    "summarized_story": "In 1999, Anambra was a PDP state, with Dr. Chinwoke Mbadinuju, and thereafter, Dr Chris Ngige and finally, Andy Uba.\nOne characteristics of PDP in Anambra governorship election is that it is always crowded and costly, and this one is not an exception.\nThere is Senator (Iyom) Uche Ekwunife, who has also contested governorship election on the platform of Progressives People Alliance (PPA).\nThis is the first time Ozigbo is making a bid for the PDP governorship ticket.\nShe was the running mate to Henry Oseloka Obaze, the PDP candidate during the last governorship election."
  },
  {
    "headline": "Breaking: APC Caretaker Committee gets fresh tenure extension",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee has gotten another tenure elongation that may last for another six months to enable it supervise the conduct of the party’s congresses across the country.\nThe extension became very necessary following the expiration of the extended tenure of the Governor Mai Mala Buni-led Caretaker Committee on Friday.\nSources at the secretariat who confided in the Daily Sun in Abuja said that the extension was made possible after President Muhammadu Buhari’s approval of the timetable and schedule of activities for the conduct of the Congresses from the wards to the national which may end in December this year.\nDetails later"
  },
  {
    "headline": "KALU GREETS SANWO-OLU AT 56",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has felicitated with Governor of Lagos state, Mr. Babajide Sanwo-Olu on the occasion of his 56th birthday anniversary.\nDescribing the Governor as an accomplished public servant and consummate politician, Kalu acknowledged the achievements of the Governor in Lagos state, adding that Sanwo-Olu has sustained and consolidated on the achievements of his predecessors.\nKalu while wishing the Governor many more years in the service of humanity, urged the celebrant to sustain his feat in governance.\nIn a congratulatory message, the former Governor stressed that the celebrant has demonstrated robust capacity in steering the affairs of Lagos state.\nHe said, “I join the people of Lagos state in celebrating Governor Babajide Sanwo-Olu of Lagos state as he clocks 56."
  },
  {
    "headline": "Buhari directs Onu to submit revised 25-year roadmap on National Space Policy to FEC",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, Thursday directed the Minister of Science and Technology, Dr. Ogbonnaya Onu to prepare and submit to the Federal Executive Council for consideration and approval, “a revised 25-year roadmap for the implementation of the National Space Policy.”A statement by Senior Special Assistant to the President on Media and Publicity, Garba Shehu, said Buhari gave the directive at a meeting with members of the National Space Council of the National Space Research and Development Agency (NASRDA) at the State House in Abuja.\nBuhari expressed a renewed commitment to the space sector, describing it as the foundation of cyber security and a vibrant digital economy.\n“No doubt Space is providing a new frontier for human development.\nAs a stimulus for increased technological advancement and economic innovation, outer space offers a unique challenge and platform for effective exploration and exploitation of our natural resources and the protection of our environment.\n“Moreover, space technology remains the foundation for cyber security and a vibrant digital economy.”“I also acknowledge the huge human resources already acquired by Nigeria in the field of Space Science and Technology over the last twenty-one years and the need for the country to put in place the necessary infrastructure required for the actualization of the goals and objectives of our National Space Policy and Programme."
  },
  {
    "headline": "Buhari Postpones Medical Trip to London",
    "summarized_story": "By Deji ElumoyeThe medical follow-up visit of President Muhammadu Buhari to London, United Kingdom earlier scheduled for Friday (today) has been postponed.\nAccording to a release on Friday by Special Adviser on Media to the President, Femi Adesina, a new date will be announced in due course.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Nigeria will Soon Overcome its Security Challenges, Says Osinbajo",
    "summarized_story": "•UN: 350,000 killed in North-east insurgencyDeji Elumoye and Michael Olugbode in AbujaVice President Yemi Osinbajo has expressed optimism that Nigeria will soon prevail over the current security challenges facing it.\nOsinbajo, while hosting the Oluyin of Iyin Ekiti, Oba Adeola Ajakaiye, yesterday in Abuja rallied Nigerians to support the security agencies to ensure that Nigeria is safe.\n“Any country with this number of security challenges must respond as robustly as possible.\nAccording to him, even as the federal government is concerned about the security challenges, and will continue to ramp up efforts towards improving security nationwide, community efforts are also vital in tackling the issue from the roots.\n“Without continued investment in development as a long-term solution, the protracted conflict in north-east Nigeria will continue to impact other parts of the country and the entire Sahel region."
  },
  {
    "headline": "Barkindo: COVID-19 Pandemic Increased Global Debt by $24tn",
    "summarized_story": "Barkindo highlighted the contributions of the Declaration of Cooperation (DoC) of participating countries, which continue to support the global oil market through voluntary production adjustments in the interest of market stability.\nHe said: “The forecast for world oil demand has decreased from 6.2 mb/d in November 2020 to 6 mb/d in June 2021.\nWorld debt now stands at $281 trillion, comparing to the annual world GDP of around $80 trillion.\n“Looking at the world oil supply, non-OPEC supply growth was revised down from 0.9 mb/d in November 2020 to 0.8 mb/d in June 2021.\nOther speakers at the event were the President of the Nigeria Gas Association (NGA) and Managing Director, Shell Nigeria Gas (SNG), Mr. Ed Ubong, and Gas Portfolio Manager, Shell Petroleum Development Company (SPDC), Mr. Yemi Famori."
  },
  {
    "headline": "Delta Urges FG to Constitute NDDC Board",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Delta State Government yesterday called for the speedy reconstitution of the board of the Niger Delta Development Commission (NDDC) to avert the 2016 experience when the resurgence of militancy plunged Nigeria into recession.\nHe described as untenable, the assurance of the Minister of Niger Delta Affairs, Senator Godswill Akpabio, that the board would be constituted after an ongoing forensic audit.\n“And for us in Delta State Government, we don’t want a repeat of what happened in 2016 that boxed us up into a recessionary period, where there was a resurgence of militancy in the region.\nHe said: “We have a strong opinion that the long delay and the non-constitution or the substantive board of the NDDC is a flagrant abuse of the Act, establishing the NDDC.\n“So I want to say that it is the expectation of the critical stakeholders that the board should be constituted,” he said."
  },
  {
    "headline": "Lawan: N’Assembly will be Diligent in Approving Loan Requests",
    "summarized_story": "Deji Elumoye in AbujaPresident of the Senate, Dr. Ahmad Lawan, has said the National Assembly will always follow due diligence in approving loan requests from the executive arm of government.\nLawan told journalists yesterday in Abuja after a closed-door meeting with President Muhammadu Buhari that the National Assembly will not approve frivolous loan requests from the executive as it will always ask for details before any loan is approved.\nWhenever we have to approve any loan, we have to insist on the details of what projects will be funded by those loans.\nSo, we will not be frivolous and will not take it lightly to just approve any loan”.\nHe, however, supported the idea of government sourcing loan to execute projects, saying the revenues are not available while Nigerians cannot be taxed further."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "Derek Chauvin, ex-US policeman, jailed for 22.5 years over George Floyd's murder",
    "summarized_story": "Derek Chauvin, former Minneapolis police officer, has been sentenced to 22 years and six months in prison for the murder of George Floyd.\nSpeaking before the sentencing, Chauvin offered his condolences to Floyd’s family.\nLike the conviction of Derek Chauvin two months ago, today’s sentencing is not justice, but it is another moment of accountability on the road to justice,” Ellison said.\nAdvertisement“My hope for Derek Chauvin is that he uses his sentence to reflect on the choices that he made on May 25, 2020.\n“This historic sentence brings the Floyd family and our nation one step closer to healing by delivering closure and accountability,” he said."
  },
  {
    "headline": "Derek Chauvin, ex-US policeman, jailed for 22.5 years over George Floyd's murder",
    "summarized_story": "Derek Chauvin, former Minneapolis police officer, has been sentenced to 22 years and six months in prison for the murder of George Floyd.\nSpeaking before the sentencing, Chauvin offered his condolences to Floyd’s family.\nLike the conviction of Derek Chauvin two months ago, today’s sentencing is not justice, but it is another moment of accountability on the road to justice,” Ellison said.\nAdvertisement“My hope for Derek Chauvin is that he uses his sentence to reflect on the choices that he made on May 25, 2020.\n“This historic sentence brings the Floyd family and our nation one step closer to healing by delivering closure and accountability,” he said."
  },
  {
    "headline": "Borno queries provost for suspending students who failed to welcome Buhari",
    "summarized_story": "Juliana Bitrus, Borno commissioner for health and human services, has issued a query to Rukaiya Mustapha, provost of the College of Nursing and Midwifery, for suspending some students who failed to welcome President Muhammadu Buhari to the state on June 17.\nIn a letter that went viral, the students were suspended for a week for “disobedience of executive order to welcome the President of Nigeria, Muhammadu Buhari GCFR, GCON (on the 17th of June 2021)”.\nThe commissioner explained that the news was “unbelievable”, noting that the ministry confirmed the development before issuing the provost a query.\nThe commissioner said though it is a normal practice that students join in welcoming visiting presidents all over Nigeria, such acts are voluntary.\nHe added that the students constitute far less than “a thousand residents who freely trooped out to welcome the president in all parts of Maiduguri“."
  },
  {
    "headline": "Borno queries provost for suspending students who failed to welcome Buhari",
    "summarized_story": "Juliana Bitrus, Borno commissioner for health and human services, has issued a query to Rukaiya Mustapha, provost of the College of Nursing and Midwifery, for suspending some students who failed to welcome President Muhammadu Buhari to the state on June 17.\nIn a letter that went viral, the students were suspended for a week for “disobedience of executive order to welcome the President of Nigeria, Muhammadu Buhari GCFR, GCON (on the 17th of June 2021)”.\nThe commissioner explained that the news was “unbelievable”, noting that the ministry confirmed the development before issuing the provost a query.\nThe commissioner said though it is a normal practice that students join in welcoming visiting presidents all over Nigeria, such acts are voluntary.\nHe added that the students constitute far less than “a thousand residents who freely trooped out to welcome the president in all parts of Maiduguri“."
  },
  {
    "headline": "'APC is back to life' -- Buhari says party crisis over",
    "summarized_story": "President Muhammadu Buhari says the All Progressives Congress (APC) is back to life and has overcome the phase of litigations and intra-party strife.\nAdvertisementThe president said the party has been revived, energised, and repositioned for its national convention and future elections.\nBuhari spoke on Friday at a meeting with members of the national caretaker/extraordinary convention planning committee (CECPC) led by Mai Mala Buni, governor of Yobe state.\nThe president hailed the committee for reorganising the party and reconciling members, and added that “with the work done by the committee the party has bounced back to life”.\nThe CECPC chairman added that the party members had agreed to name the APC national secretariat after the president."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "What you need to know as Malawi gets the world’s first 3D-printed school",
    "summarized_story": "The first 3D-printed school, a partnership between Holcim and CDC Group, has been unveiled in Malawi’s Salima district.\nUsing conventional materials, it would take 70 years to bridge this gap, but 14Trees claims that it could take as little as 14 years with 3D printing.\nUnlike conventional buildings, with 3D printing, schools can now be built in days instead of months and at less cost.\nBuilding infrastructure is one reason many African children are out of school, and 3D printing could provide a way out.\nWhile 3D printing could be good for education, should we be cautiously optimistic if it becomes a big deal?"
  },
  {
    "headline": "Six countries show Nigeria’s poverty reduction goal is achievable",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Tuesday inaugurated the Steering Committee of the National Poverty Reduction with Growth Strategy (NPRGS) to achieve his mission of lifting 100 million Nigerians out of poverty within a decade.\nAlready, he has claimed that his administration has successfully lifted 10.5 million Nigerians out of poverty in the last two years…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Fear of power loss keeps Buhari from ending wasteful petrol subsidy",
    "summarized_story": "The fear of popular uprising toppling his government again as it did in 1984 may be the underlying reason behind President Muhammadu Buhari’s insistence on petrol subsidies, even when it is coming at a great cost to the economy.\nAccording to the Nigerian National Petroleum Corporation (NNPC) Africa’s biggest oil producer now consumes about 103…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Foreign manufacturers eye Nigeria’s $153m motorcycle market",
    "summarized_story": "An example of manufacturers looking to tap into this market is Hero MotoCorp, one of the world’s largest manufacturers of motorcycles and scooters, which has made investments to tap from Nigeria’s $153 million two-wheelers industry through its specially made-for-Nigeria motorcycle named Hunter.\nThis also presents an opportunity for more investors to come in as the Nigeria Two-Wheeler Market report by Market Research reveals that the sector has a promising future in the country.\n“Nigeria two-wheeler market is projected to surpass $153 million by 2023.\nThis has also prompted manufacturers of motorcycles like Hero MotoCorp to still see limitless opportunities in the Nigerian market.\nDespite the huge demand for motorcycles, Nigeria relies on the importation of Completely Knocked Down (CKD) parts from Asian countries, which are assembled in the country."
  },
  {
    "headline": "Obaseki unveils plans for Benin City Cultural District, EMOWAA pavilion …chronicles journey for return of Benin artifacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has unveiled plans for the Benin City Cultural District, which will house the Edo Museum of West African Arts (EMOWAA).\nObaseki disclosed this at the 2021 National Commission for Museums and Monuments (NCMM) Retreat for management staff and curators held in Benin City, the Edo State capital.\n“In this plan, we have included the carving out of a large area as a Cultural District and the Museum will be located in the Cultural District.\nIf we host 5,000 visitors every year as a result of the attraction to the Museum, the state will benefit from it.\n“The Edo Museum of West African Arts (EMOWAA) is a big opportunity for us to be at the forefront of promoting and establishing this museum."
  },
  {
    "headline": "Edo govt, NDLEA link rising crime rate to drug use, lead walk against drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government and the National Drug Law Enforcement Agency (NDLEA), as part of activities to mark the 2021 International Day Against Drug Abuse and Illicit Trafficking, led other stakeholders in a sensitization road walk against drug abuse and trafficking across the Benin metropolis.\nThe International Day Against Drug Abuse and Illicit Trafficking is observed globally every June 26 to strengthen action and cooperation to achieve the goal of an international society free of drug abuse.\nTo raise awareness on the dangers of the menace, the Edo State Drug Control Committee (ESDCC) and NDLEA staged a walk from Edo State Secretariat to Sakponba Road, Ring Road, and Sapele Road, warning residents against the intake of drugs.\nAccording to him, “We took this walk against drug abuse today to create the necessary information in society.\nDrug abuse is an ill that must be eradicated completely."
  },
  {
    "headline": "Edo govt pays June salaries, pensions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government on Friday paid June salaries and pension to workers and retirees in the state, in furtherance of efforts by the Governor Godwin Obaseki-led administration to keep to its promise of prompt remuneration to sustain the welfare of workers.\nSecretary to the State Government, Osarodion Ogie Esq., in a statement, reassured that the Obaseki-led administration will sustain its commitment to workers’ welfare, ensuring that public servants and retirees get what is rightly due them for their service to the state.\nAccording to him, “The Edo State Government has paid June salaries and pension to workers and retirees, in continuation of the trend of meeting its statutory obligation well before the end of the month.”Noting that the government remains committed to the welfare of workers in the state, Ogie noted, “The Edo State Government will not relent in its efforts at sustaining its worker-friendly disposition and ensuring an enabling environment for workers to perform optimally.\n“It is imperative that workers reciprocate this gesture by displaying an unalloyed commitment to their duties and supporting the governor in the actualisation of the ‘Making Edo Great Again’ Agenda.”..."
  },
  {
    "headline": "Continuous Voters Registration: INEC Launches Online Portal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Independent National Electoral Commission (INEC), Thursday launched the online Portal for the continuous voters registration exercise nationwide.\nAccording to the chairman, the register of voters is at the heart of democratic elections, stating that “a good register of voters is a precursor to a good election.\nThe chairman also said that, Monday 28th June 2021 remains sacrosanct, as the registration of voters will commence in full nationwide.\nSome citizens may also have one form of disability or another to make it impossible for them to register online.\n“I wish to assure you that in addition to the online registration portal, there will be some 2,673 centres where citizens can register physically nationwide”, he added."
  },
  {
    "headline": "#EndSARS: Panel awards ₦83m compensation to late victim’s family, 12 others",
    "summarized_story": "ADVERTISEMENTThe Lagos State Judicial Panel on restitution for victims of police brutality on Friday awarded the sum of ₦83 million to 13 victims of police brutality including the family of the late Kolade Johnson.\nThe mother of late Mr Johnson, Odebiyi Jokotade, received the N10 million award compensation on behalf of the family.\nOthers include Lucky Igbinovia (₦5m) Elvis Irenuma (₦5m), Effiong Edu (₦5m), Olajide Fowotade (₦2m), Sulaimon Raheem (₦8m), Osidipe Sunday (₦3m), and Francis Osajiokweh (₦3m).\nJohnson’s petitionPREMUIM TIMES reported how the family of Mr Johnson, 36, approached the panel in December 2019.\nMr Johnson, who was at a football viewing centre, was shot by a police officer during a raid at his neighbourhood at Onipetesi, Lagos-Abeokuta road."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "UniAbuja VC Cautions Students Against Drug Abuse",
    "summarized_story": "As Nigeria joins other countries to commemorate the International Day Against Drug Abuse and Illicit Trafficking, the vice chancellor of the University of Abuja, Professor Abdul-Rasheed Na’Allah has warned the students of the institution to refrain from drug abuse and human trafficking.\nAdvertisementsThe vice chancellor spoke yesterday in Abuja at an event organised by the international centre of the university to mark the International Day against Drug Abuse and Illicit Trafficking.\nSpeaking on the theme, “Drug Abuse And Illicit Trafficking: Consequences And Solutions,” Na’Allah said the university is determined to invest whatever it takes to ensure that students are developed into global citizens.\n“We are doing this as part of the goal of the world to stop drug abuse.\nWe must know that drug abuse is at the centre of a lot of crises."
  },
  {
    "headline": "UniAbuja VC Cautions Students Against Drug Abuse",
    "summarized_story": "As Nigeria joins other countries to commemorate the International Day Against Drug Abuse and Illicit Trafficking, the vice chancellor of the University of Abuja, Professor Abdul-Rasheed Na’Allah has warned the students of the institution to refrain from drug abuse and human trafficking.\nAdvertisementsThe vice chancellor spoke yesterday in Abuja at an event organised by the international centre of the university to mark the International Day against Drug Abuse and Illicit Trafficking.\nSpeaking on the theme, “Drug Abuse And Illicit Trafficking: Consequences And Solutions,” Na’Allah said the university is determined to invest whatever it takes to ensure that students are developed into global citizens.\n“We are doing this as part of the goal of the world to stop drug abuse.\nWe must know that drug abuse is at the centre of a lot of crises."
  },
  {
    "headline": "APC’s Lackluster Reign Incubated Hoodlums, ‘One Million Boys’ In Oyo – PDP",
    "summarized_story": "The PDP berated the policies of the APC when it ruled Oyo State, describing the opposition party as ‘the architect of present hoodlums-led vandalism in parts of Ibadan in recent times.\n“For the avoidance of doubt, the Seyi Makinde-led Government will leave no stone unturned to arrest the situation,” the PDP said.\nOyo state PDP made this disclosure in a Press Release signed by its state Publicity Secretary, Akeem Olatunji, and made available to newmen in Ibadan.\n“The good people of Oyo state can now see very clearly what the monster created by the APC government has turned our dear state into.\nThe APC should stop the collective insult to our sensitivities by coming to public space to further expose its shameful legacies."
  },
  {
    "headline": "APC’s Lackluster Reign Incubated Hoodlums, ‘One Million Boys’ In Oyo – PDP",
    "summarized_story": "The PDP berated the policies of the APC when it ruled Oyo State, describing the opposition party as ‘the architect of present hoodlums-led vandalism in parts of Ibadan in recent times.\n“For the avoidance of doubt, the Seyi Makinde-led Government will leave no stone unturned to arrest the situation,” the PDP said.\nOyo state PDP made this disclosure in a Press Release signed by its state Publicity Secretary, Akeem Olatunji, and made available to newmen in Ibadan.\n“The good people of Oyo state can now see very clearly what the monster created by the APC government has turned our dear state into.\nThe APC should stop the collective insult to our sensitivities by coming to public space to further expose its shameful legacies."
  },
  {
    "headline": "PDP To Buhari: Tell Nigerians Why You Cancelled London Trip",
    "summarized_story": "The Peoples Democratic Party (PDP) has charged President Muhammadu Buhari to come clean on the real reason he rescheduled his medical trip to London at the last-minute.\nAdvertisementsThe party’s position is amidst increasing international disapprovals to the escalated human right violations, constitutional breaches, clampdown on citizens, suppression of free speech and other excesses by the Buhari administration, for which there have been concerted demands for travel restrictions against officials of the Buhari administration.\n“Our party urges President Buhari to use this period to reflect on the suffering of millions of Nigerians who do not have access to foreign medical treatment, but who are dying on daily basis because of his failure to pay attention to our healthcare system, which has become decrepit under his watch.\n“It is indeed heartrending that President Buhari appears to think of himself only even as Nigerians pass through these worst forms of hardship occasioned by his own misrule.\n“Nigerians are also dismayed that Mr. President has consistently failed to honour his pre-2015 campaign promise not to embark on medical tourism if elected President."
  },
  {
    "headline": "Buhari appoints chairman, executive secretary for PPPRA",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has approved the appointment of a Chairman, and an Executive Secretary for the Petroleum Product Pricing Regulatory Agency (PPPRA).\nThe Chairman is Mr Atuonwo A. Obinna, while the Executive Secretary is Mr Abdulkadir Saidu, reappointed for another four years.\nThe appointment of Mr Atuonwo Obinna as Chairman Governing Board for a four-year term is in accordance with Section 2 (1-3) and 3 (a) of the Petroleum Product Pricing Regulatory Agency (Establishment, ETC) Act 2003.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari appoints chairman, executive secretary for PPPRA",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has approved the appointment of a Chairman, and an Executive Secretary for the Petroleum Product Pricing Regulatory Agency (PPPRA).\nThe Chairman is Mr Atuonwo A. Obinna, while the Executive Secretary is Mr Abdulkadir Saidu, reappointed for another four years.\nThe appointment of Mr Atuonwo Obinna as Chairman Governing Board for a four-year term is in accordance with Section 2 (1-3) and 3 (a) of the Petroleum Product Pricing Regulatory Agency (Establishment, ETC) Act 2003.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Group accuses NECO staff of engaging in exam fraud, demands probe",
    "summarized_story": "A media organisation, Signature TV, has called on the Independent Corrupt Practices and other related offences Commission to probe some staff of the National Examination Council for engaging in examination malpractices at a centre in Kaduna State.\nThe Chief Executive Officer of the station, Mr Vinmartin Ilo, stated this during the inauguration of a TV show, Corruption Tori Season Two, in Abuja.\nA statement on Thursday said Corruption Tori is an anti-corruption programme supported by the MacArthur Foundation and aired on the network services of the African Independent Television and the Nigerian Television Authority to cause attitudinal change and make Nigerians demand accountability and transparency from leaders.\nIlo in his remark at the event explained that the station recently uncovered how some NECO officials colluded with prospective candidates to undermine the integrity of their examination.\nHe called on the anti-corruption agency to wade into the case and bring anyone culpable to justice."
  },
  {
    "headline": "Group accuses NECO staff of engaging in exam fraud, demands probe",
    "summarized_story": "A media organisation, Signature TV, has called on the Independent Corrupt Practices and other related offences Commission to probe some staff of the National Examination Council for engaging in examination malpractices at a centre in Kaduna State.\nThe Chief Executive Officer of the station, Mr Vinmartin Ilo, stated this during the inauguration of a TV show, Corruption Tori Season Two, in Abuja.\nA statement on Thursday said Corruption Tori is an anti-corruption programme supported by the MacArthur Foundation and aired on the network services of the African Independent Television and the Nigerian Television Authority to cause attitudinal change and make Nigerians demand accountability and transparency from leaders.\nIlo in his remark at the event explained that the station recently uncovered how some NECO officials colluded with prospective candidates to undermine the integrity of their examination.\nHe called on the anti-corruption agency to wade into the case and bring anyone culpable to justice."
  },
  {
    "headline": "Abidemi Rufai : Federal marshals moving him to Washington state",
    "summarized_story": "Agency ReportsAbidemi Rufai, the suspended Ogun government official now detained in New York, will be transported by federal marshals to Washington State for trial.\nJudge Settle agreed with federal prosecutors that the 42 year-old Rufai represented a flight risk.\nHe was charged after allegedly stealing over $350,000 in jobless benefits from the Washington state Employment Security Department in 2020.\nWashington state was severely victimized by fraudulent claims for pandemic-related benefits.\nHe also stole around $53,000 in federal disaster loans, according to an indictment returned Wednesday in federal district court in Tacoma."
  },
  {
    "headline": "Businessman Andrew Warri arraigned for allegedly defrauding GTBank N125m",
    "summarized_story": "The Lagos Zonal Office of the Economic and Financial Crimes Commission, EFCC, on Friday arraigned Andrew Warri before Justice Sherifah Solebo of the Special Offences Court sitting in Ikeja, Lagos.\nHe was arraigned on a seven-count charge bordering on stealing, obtaining by false pretence and issuance of dud cheques.\nProjects Consultancy Limited and Ranez Medical Consultancy Limited.\nProjects Consultancy Limited, in favour of Guaranty Trust Bank, which upon presentation for payment was dishonoured on the grounds that no sufficient funds were standing to your credit.”He pleaded “not guilty” to the charges.\nNelson Imoh, counsel for Warri, informed the Court that the bail application for his client was before the Court."
  },
  {
    "headline": "DSS goes after ‘bandits’ man Gumi over inciting comments",
    "summarized_story": "The Department of State Services (DSS) has summoned controversial Islamic cleric, Sheikh Ahmad Gumi over recent comments that some military officers supply drugs and arms to bandits.\nGumi, in an interview on Arise TV said some military officers fuel banditry by supplying them with ammunition and drugs.\nBut Gumi spokesman, Malam Tukur Mamu in an interview with VOA Hausa Services said the allegations against Gumi were baseless.\nHe called on the military and the TV company to apologise to Gumi and retract their statements against him.\nHe threatened that Gumi might seek legal action against the military and DSS."
  },
  {
    "headline": "TB Joshua Is Not A Real Man Of God, He Sexually Molested Me For 14 Years – Former Assistant, Bisola Johnson Spits Wild Allegations",
    "summarized_story": "TB Joshua, the late general overseer of the Synagogue, Church of All Nations, has been accused of some outrageous claims.\nBisola Johnson, his former aide, claims that TB Joshua sexually assaulted her numerous times throughout their 14-year relationship.\nShe claimed that TB Joshua was particularly interested in having sex with virgins and young girls.\nJoshua allegedly introduced Bisola to his hidden cult of young females with whom he sleeps whenever he feels like it, according to Bisola.\nTB Joshua insisted, dragged me into his bedroom by force; that is when I knew it was intentional."
  },
  {
    "headline": "Nigeria’s Elites Behind Secession Agitation – FG",
    "summarized_story": "The federal government claims that Nigeria’s elites are funding those calling for the country’s disintegration.\nLai Mohammed, the Minister of Information, addressed during a meeting with the Nigerian Association of Advertising Agencies (AAAN).\nMohammed commended the body for planning the national unity campaign scheduled for October.\nMohammed told Nigerians not to allow anarchists to drive a wedge between them in the attempt to disorganize the nation.\nHe admitted the challenges in the areas of security and the economy, and assured that the government is working hard to fix them."
  },
  {
    "headline": "Lagos #EndSARS Panel Awards N10m to Kolade Johnson’s Family",
    "summarized_story": "Lagos #EndSARS panel awards N10m to Kolade Johnson’s familyThe family of late Kolade Johnson has been awarded N10 million by a Lagos judicial panel.\nJohnson was shot by police during a raid in Lagos’ Onipetesi neighborhood on March 31, 2019, while watching an English Premier League match between Tottenham and Manchester United.\nFollowing an orderly trial, Olalekan was dismissed from the force after he was found guilty, while Orji was acquitted.\nDoris Okuwobi, chairman of the Lagos panel, announced the compensation at the sitting on Friday.\nThirteen petitioners — including Johnson’s family — were compensated with a total of N83 million at the sitting on Friday."
  },
  {
    "headline": "DSS Should Apologize To Gumi – Tukur Mamu (Spokesman)",
    "summarized_story": "During an interview with Arise TV, the Department of State Security (DSS) questioned controversial Islamic preacher Sheikh Ahmad Gumi about allegations that soldiers help and abet criminals.\nGumi was summoned to the DSS headquarters in Kaduna after military authorities took issue with the cleric’s claims that their operatives were conspiring with bandits.\nBut when The Nation reached out to the Sheikh for comments on the security questioning, he did not pick calls.\nHowever, Gumi’s spokesman, Malam Tukur Mamu, in an interview with VOA Hausa, dismissed the allegation against the cleric.\nHe said there was no where in the TV interview where Gumi categorically accused the entire military."
  },
  {
    "headline": "Hunger, starvation imminent over security concerns",
    "summarized_story": "BENJAMIN SAMSON in this report examines the effects of the ugly security situation on food production and availability.\n“The security situation has crippled the economy as travelling on the highways across the country has become a nightmare to Nigerians.\nFAO, ActionAid’s alarmsIn the same vein, the Food and Agriculture Organisation (FAO) has raised the alarm over the worsening state of food security in the country.\nIt, therefore, stressed the need for urgent measures to protect the most vulnerable, keep the national agricultural supply chains functional and efficient, and mitigate the food security impacts of the Covid-19 pandemic.\nFor example, wheat remains an imported production input costing Nigeria about N222 billion in the first quarter of 2021 alone."
  },
  {
    "headline": "Breaking: DSS invites Sheikh Gumi over comment on Nigerian Military",
    "summarized_story": "Kaduna-based Islamic cleric, Sheikh Ahmad Abubakar Gumi, has been reportedly invited the Department of State Security ( DSS) for questioning over remarks he made on Arise TV interview that allegedly portrayed the Nigerian military in bad light.\nThis was revealed via a report by the Voice of America, VOA, Hausa service monitored on Friday.\nThe report said Gumi was invited at the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi, alleging that their operatives were conniving with bandits.\nDetails coming…"
  },
  {
    "headline": "VIDEO: Watch Super TV CEO’s last outing with ‘Killer’ girlfriend",
    "summarized_story": ""
  },
  {
    "headline": "Athletes national trials record indicates Tokyo Olympics expectations—Sports Minister",
    "summarized_story": "Dare’s confidence is hinged on the form athletes displayed during the recent Athletics Federation of Nigeria Olympic Trials held at the Sports Complex of Yaba College of Technology, Lagos last week.\nThe minister said, with and they the form and the recorded times by the athletes in the All Nigeria National Olympics trial are flashes of what to expect and are looking good to go.\nShe added that she is happy and certainly the performance is a confidence booster ahead of the Tokyo Olympics.\nThe 32-year-old saw her 10.63 seconds time tie with Jamaican Shelly-Ann FraserPryce’ best time in 2021.\nThe Nigerian has now emerged one of the favourites for the 100m gold at the Tokyo Olympics alongside ShellyAnn Fraser-Pryce who first ran 10.63 seconds this season"
  },
  {
    "headline": "Athletes national trials record indicates Tokyo Olympics expectations—Sports Minister",
    "summarized_story": "Dare’s confidence is hinged on the form athletes displayed during the recent Athletics Federation of Nigeria Olympic Trials held at the Sports Complex of Yaba College of Technology, Lagos last week.\nThe minister said, with and they the form and the recorded times by the athletes in the All Nigeria National Olympics trial are flashes of what to expect and are looking good to go.\nShe added that she is happy and certainly the performance is a confidence booster ahead of the Tokyo Olympics.\nThe 32-year-old saw her 10.63 seconds time tie with Jamaican Shelly-Ann FraserPryce’ best time in 2021.\nThe Nigerian has now emerged one of the favourites for the 100m gold at the Tokyo Olympics alongside ShellyAnn Fraser-Pryce who first ran 10.63 seconds this season"
  },
  {
    "headline": "State-LG crisis and quest for fiscal federalism -NigPilot",
    "summarized_story": "Several people have decried how the third tier of Government has been deprived, denied and dragged down by the other superior tiers in Nigeria.\nLocal governments now suffer from paucity of fund resulting in inability to cater for their basic responsibilities.\nThis is plus the fact that the state governments enjoy other means of funding.\nI hold a strong view that the effort of the state governments and local governments are supposed to be complimentary.\nStrengthen the local government system and many of the challenges we are faced with, including insecurity and unemployment, will be thrashed."
  },
  {
    "headline": "State-LG crisis and quest for fiscal federalism -NigPilot",
    "summarized_story": "Several people have decried how the third tier of Government has been deprived, denied and dragged down by the other superior tiers in Nigeria.\nLocal governments now suffer from paucity of fund resulting in inability to cater for their basic responsibilities.\nThis is plus the fact that the state governments enjoy other means of funding.\nI hold a strong view that the effort of the state governments and local governments are supposed to be complimentary.\nStrengthen the local government system and many of the challenges we are faced with, including insecurity and unemployment, will be thrashed."
  },
  {
    "headline": "Hong Kong pro-democracy paper Apple Daily confirms closure -NigPilot",
    "summarized_story": "Reporters said they planned to print one million copies overnight — a staggering number given Hong Kong’s 7.5 million population.\nApple Daily has long been a thorn in Beijing’s side, with unapologetic support for Hong Kong’s pro-democracy movement and caustic criticism of China’s authoritarian leaders.\nBritish foreign secretary Dominic Raab accused Hong Kong’s authorities of spearheading a “forced closure” of the paper, describing it as “a chilling demonstration of their campaign to silence all opposition voices”.\nChina imposed its security law on Hong Kong last year after the city was convulsed by huge and often violent democracy protests.\n“Every journalist in Hong Kong now has a metaphorical gun pointed at their heads,” Sharron Fast, a lecturer at the University of Hong Kong’s journalism school, told AFP."
  },
  {
    "headline": "DSS Invites Sheikh Gumi For Questioning",
    "summarized_story": "The Department of State Services on Friday said it has invited Kaduna-based cleric Sheikh Ahmad Gumi for questioning.\n“Sheikh Gumi was invited by the Service,” the service’s spokesmperson, Peter Afunaya, said in a response to a Channels Television enquiry.\n﻿Although the DSS did not confirm the rationale for the invitation, Sheikh Gumi has recently been outspoken on the issue of banditry in Nigeria.\nIn a recent interview, Gumi alleged that some military operatives actively connive with bandits to wreak havoc on the country.\nHowever, Gumi, who has visited some bandit groups in the forests where they reside, has advocated for the bandits to be treated with compassion."
  },
  {
    "headline": "Nobody Invited Me For Questioning Or Any Arrest – Sheikh Gumi",
    "summarized_story": "﻿Kaduna-based Islamic cleric, Sheikh Ahmad Gumi, has debunked reports that he was either quizzed or invited for questioning by the Department of State Security Service (DSS) over his remarks against the military.\nRead Also: DSS Invites Sheikh Gumi For QuestioningHe also insisted that he never made any disparaging remarks against the military during his recent live interview on national television.\nAccording to him, there was nowhere in the TV interview that he categorically accused the entire military.\nThe DSS had earlier on Friday said it invited the cleric for questioning.\n“Sheikh Gumi was invited by the Service,” the service’s spokesman, Peter Afunaya, said in a response to a Channels Television enquiry."
  },
  {
    "headline": "APC Is Back To Life, Says Buhari",
    "summarized_story": "President Muhammadu Buhari Friday in Abuja said the All Progressives Congress (APC) has been revived, energized, and repositioned for its national convention and future elections while commending the National Caretaker/Extraordinary Convention Planning Committee (CECPC) led by Governor of Yobe State, Malam Mai Mala Buni.\nThe CECPC Chairman told the President and other party members that 14 party members had indicated their interest to contest for the Anambra State elections, assuring that the primary elections will be free, fair, and transparent.\nThe Yobe State governor said huge legal fees were inherited, and the committee had worked with members to settle all the outstanding, after scaling them down, noting that payment for the APC National Secretariat had been completed.\n“The party members have agreed to name the secretariat, Muhammadu Buhari House,’’ he added.\nOthers are, Governor of Kaduna State, Nasir el’Rufai, Governor of Osun State, Adegboyega Oyetola, and Governor of Niger State, Abubakar Sani Bello."
  },
  {
    "headline": "President Buhari Postpones London Trip",
    "summarized_story": "The medical follow-up visit of President Muhammadu Buhari to the United Kingdom earlier scheduled for today, Friday, June 25, 2021, has been postponed.\nOn Thursday, Adesina had announced that the President’s trip to London was for a scheduled medical follow-up, adding that he would be back in the country during the second week of July.\nREAD ALSO: PHOTOS: Buhari Receives Progress Report Of APC Caretaker CommitteePresident Buhari’s scheduled trip to London comes almost three months since he last visited the United Kingdom for the same purpose.\nThe president had travelled to the UK on March 30 for a routine medical check-up, as indicated in a statement by his media adviser.\n“It is a routine medical check-up; the President has undertaken this with a set of doctors that he has retained over many years,” said Garba Shehu, another media aide to the President, during an interview with Channels Television."
  },
  {
    "headline": "Zamfara Govt Approves Release Of ₦100m To WAEC",
    "summarized_story": "The Governor of Zamfara State, Hon.\nDr. Bello Mohammed Matawalle Maradun, has approved the release of ₦100 million to the West African Examinations Council (WAEC) as payment to enable students in the state write the 2021 examinations.\nGovernor Matawalle said the ministry has supported the state by giving all the required considerations to the teeming candidates for WAEC including releasing their results, and also allowing them to sit for subsequent examinations.\nAccordingly, the governor reiterated that education being the catalyst for achieving greatness will receive topmost priority in his administration.\n“The effort will certainly give peace of mind to many candidates and parents in the state”, he added."
  },
  {
    "headline": "Derek Chauvin sentenced to twenty two and half years for George Floyd murder",
    "summarized_story": "Derek Chauvin, the white former Minneapolis police officer convicted of killing George Floyd, a Black man, has been sentenced to 22 1/2 years in prison.\nProsecutors had asked for a 30-year sentence for Chauvin, who was convicted of second-degree murder.\nMinnesota sentencing guidelines recommended Chauvin be sentenced to 12 and a half years, given he has no criminal record.\nAdvertisementThe Judge Peter Cahill however justified the longer sentence citing “aggravating factors”.\nDefence attorney Eric Nelson asked the judge consider not only the aggravating factors, but also the mitigating factors."
  },
  {
    "headline": "Lagos #SARS panel awards N85m to 13 Petitioners",
    "summarized_story": "The family of the late Kolade Johnson is among the four petitioners awarded ten million naira each as compensation for SARS related abuses by police operatives including extra judicial killings.\nthe lagos state judicial panel on restitution for victims also awarded three others, who are the families of the late Jessica ejide and sulaimon olaoye at it’s sitting on friday.\nAdvertisementthe panel also found nine others deserving of financial compensations of 43 million.\nto date, the Lagos judicial panel has now awarded N151.25 million to 25 victims of police brutality so far.\nAt least three other petitioners have received no compensation because they could not prove their cases before the panel."
  },
  {
    "headline": "Court Remand Four in Prison Custody For Caging 12 Year-Old Girl For 8 Months",
    "summarized_story": "Four persons have been charged to court for criminal conspiracy wrongful confinement, cruelty to child and attempt to commit an offence with to culpable homicide filled before a Sokoto state chief magistrate court 1The charges are all contrary to section 60,233(b)288(b) and 58 of the sokoto state penal code law.\nThat, sometime in August last year being guardian of Joy Emanuel 12 year survivor, accused her of witchcraft wrongfully confined her in a Cage in their house in the area.\nAccording to the prosecutor, the accused persons Caged Joy for Eight months without proper feeding as a result of which the survivor became seriously sick and was rushed to police Hospital sokoto where she is receiving treatment.\nAdvertisementThe suspect however pleaded guilty to the charges read against them.\nThe Judge, Shuaibu Ahmad therefore adjourned the case and ordered the accused to be remanded in sokoto correctional service."
  },
  {
    "headline": "Man City to Confirm Premier League’s Biggest Ever Transfer with £100m Grealish Deal: Daily Mail",
    "summarized_story": "Reports in the United Kingdom suggest Manchester City will complete a record-breaking, £100million deal for Jack Grealish after the England star has finished representing his country at Euro 2020.\nThe UK Daily mail reports that talks between the two clubs have progressed rapidly and City, who still want to sign Harry Kane from Tottenham this summer, have now agreed a huge deal.\nHe looks certain to have played his last game for boyhood club Villa, who have reluctantly agreed to let him go in the Premier League’s biggest ever transfer.\nCity’s summer spending will not end there, however, with Spurs talisman Kane still a major target for the Premier League champions.\nCity have already begun their pursuit of Kane and bid £100m for the Tottenham striker earlier this week, though Spurs chairman Daniel Levy values the forward at £150m."
  },
  {
    "headline": "Nigeria: Buhari Postpones Medical Trip to UK – Arise News",
    "summarized_story": "President Muhammadu Buhari has postponed his medical follow-up visit to the United KingdomNo reason was provided for the postponement, but the presidency had said the scheduled trip was a follow-up to the president’s last visit.\nFemi Adesina, presidential spokesperson, in a statement on Friday, said the trip has been postponed and that a new date will be announced soon.\n“The medical follow-up visit of President Muhammadu Buhari to the United Kingdom earlier scheduled for today, Friday, June 25, 2021, has been postponed,” Adesina said.\nIn April, the president went to the UK for what the presidency described as a “routine” check-up.\nAs part of his campaign in 2014, President Buhari had attributed the health situation to the country’s health sector’s “inability to combat outbreak of deadly diseases and mass migration of medical personnel out of the country”."
  },
  {
    "headline": "‘No Cross, No Crown’: Soludo Sets Sights on Anambra Government House Despite Challenges",
    "summarized_story": "Despite two unsuccessful attempts to become the executive governor of Anambra State in Southeast Nigeria, renowned economist and former Central Bank Governor, Prof Chukwuma Soludo has again thrown his hat into the political arena again.\nOn Wednesday, he scaled a major hurdle when he secured the ticket of the ruling All Progressives Grand Alliance in the state to emerge the party’s candidate in the rthcoming gubernatorial election slated for November 6, 2021.\nSoludo joined from his country home in Anambra to discuss how he intends to forge party unity among aggrieved members ahead of the election, among other topics."
  },
  {
    "headline": "Members of Anambra APGA Faction Should Be Arrested: Soludo",
    "summarized_story": "Candidate of the All Progressives Grand Alliance (APGA) in the November 6 Anambra State governorship election, Charles Soludo, has called on the Inspector-general of Police, Usman Baba, to apprehend members of the Jude Okeke-led National Working Committee of the party for announcing his purported suspension.\nDescribing the factional members as a “bunch of criminals”, Soludo, a Professor of economics told ARISE News on Friday that the media should discontinue giving such persons the “hype” they crave.\nHe likened their action to one where non-lawmakers meet in Lagos and announce the sack of the leadership of the National Assembly.\nAccording to him, in saner countries, those people should be arrested.\nWatch the video"
  },
  {
    "headline": "Russia Mandates Vaccinations for Some as Virus Cases Surge",
    "summarized_story": "But an ambitious plan of vaccinating 30 million Russians by mid-June still has fallen short by a third.\nOfficials have blamed Russians’ lax attitude toward taking necessary precautions and the growing prevalence of more infectious variants.\nKremlin spokesman Dmitry Peskov insisted Thursday the vaccinations in Moscow were “voluntary,” because those refusing to get the shot can still seek a different job.\nPolice quickly cracked down, launching 24 criminal cases last week against sellers of fake vaccination certificates.\nAs of mid-May, just over 33 million doses were produced in Russia, and a significant amount was exported."
  }
]