[
  {
    "headline": "NDLEA intercepts 1.5m Tramadol tablets going to Kebbi",
    "summarized_story": "The National Drug Law Enforcement Agency said it intercepted about 1.5 million tablets and capsules of pharmaceutical opioids such as Tramadol, Exol-5 and Diazepam loaded in Onitsha, Anambra State, and heading to Yauri, Kebbi State.\nThe NDLEA spokesman also said the same day, 425,000 Diazepam tablets were recovered at Segemu, Kano.\n“Acting on credible intelligence, operatives in Edo State on Friday 14th January 2022, intercepted a trailer coming from Onitsha and going to Yauri in Kebbi State.\nThe drugs seized include: 394,480 capsules and 3,000 tablets of Tramadol weighing 83.707kg; Exol-5: 647,500 tablets weighing 203.315kg; Diazepam: 12,500 tablets weighing 2.05kg; Bromazepam: 1,500 tablets weighing 0.45kg; Codeine based Syrup: 999 bottles weighing 134.865kg; Pentazocine injections: 4,000 ampoules weighing 16.64kg.\n“In Plateau State, a fake security agent, Babagana Maaji has been arrested through a controlled delivery of 5.6kg cannabis from Lagos."
  },
  {
    "headline": "Troops neutralise Boko Haram, ISWAP terrorists, recover anti-aircraft gun in Borno",
    "summarized_story": "Troops of Sector 2 Joint Task Force North East Operation HADIN KAI have neutralised Boko Haram and Islamic State West Africa Province terrorists who had tried to infiltrate the ancient town of Biu, Borno State.\nThis was disclosed in a statement signed by the Director Army Public Relations, Brigadier General Onyema Nwachukwu, on Sunday.\n“In the intense battle, troops unleashed superior fire power on the terrorists, neutralising five BH/ISWAP terrorists, compelling others to withdraw in disarray.\n“The gallant troops also captured from the terrorists one gun truck, one Deshka M Anti-Aircraft Gun, one HK 21 Machine Gun, one Rocket Propelled Grenade Bomb, 137 rounds of 12.7mm Anti-Aircraft Rounds amongst others.\nTroops are currently in pursuit of the fleeing terrorists,” the statement added."
  },
  {
    "headline": "Agreement with Twitter: SERAP demands publication, copy from FG",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has urged President Muhammadu Buhari to provide it with a copy of the agreement recently signed with Twitter and to widely publish the details of any such agreement.\nRecall that Mohammed on June 5, 2021, announced the suspension of operation of Twitter by the Federal Government, following which a seven-man Presidential Committee was set up to engage Twitter Incorporated.\nThe Presidential Committee in turn established a 20-member Technical Committee, which reportedly directly worked with the Twitter team.\nThe letter, read in part: “Any agreement with social media companies must meet constitutional and international requirements, including legality, necessity, proportionality and legitimacy.\n“This means that any conditions for lifting the suspension of Twitter must meet the requirements of regular legal processes and limit government discretion."
  },
  {
    "headline": "Police begin probe of alleged involvement of senior officer in artisanal refining of crude",
    "summarized_story": "By Davies IheamnachorPORT HARCOURT: The Rivers State Police Command has set up a panel to investigate the alleged involvement of a Divisional Police Officer, DPO, fingered in artisanal refining of petroleum products in the state.\nRecalled that the Rivers State Governor Chief Nyesom Wike has in efforts to end artisanal refining of petroleum products in the state had said a DPO, name not given, was involved in the illegal business.\nThe statement read: “The Rivers State Police Command, received with concern, the news making the rounds that a Divisional Police Officer in the state, is involved in illegal bunkering activities.\n“The officer was immediately redeployed and a panel headed by an Assistant Commissioner of Police inaugurated to investigate the matter.\nThe outcome shall be made public and the officer punished appropriately if the allegations are confirmed."
  },
  {
    "headline": "University of Abuja’s quest for a world-class status",
    "summarized_story": "One of the federal universities that has caught my attention in this journey to raising its rank is the University of Abuja.\nEasily the only public university in the Federal Capital Territory (FCT), the University of Abuja was established in 1988, though academic activities began in the institution in 1990.\nThis university has been insufferably slow in embracing the opportunities around it for growth, especially its proximity to the seat of power.\nThe University thus came before Ahmadu Bello University, Zaria; Federal University of Technology, Owerri; Bayero University, Kano and Usman Danfodio University, Sokoto which previously ranked higher especially in 2020.\nAnd this cannot happen if the university is not empowered to employ more tenure staff at all levels."
  },
  {
    "headline": "US court dismisses Ude’s motion against Wabote",
    "summarized_story": "While the court dismissed and denied Ude’s motion, it granted the relief sought by Wabote.\nWhile dismissing his motion during one of the court sessions, the court ordered Ude to enter into a protective order before Wabote is required to disclose any banking or other personal and sensitive information.\nUde’s Motion does not mention these defenses again.\nSee id.”Also, the judge granted the Plaintiff’s (Wabote) request to quash Defendant’s (Ude) subpoenas, ECF Nos.\nHe ruled that: “All subpoenas issued by Defendant after December 22, 2021, are null and void.”"
  },
  {
    "headline": "2022 Armed Forces Day: Gov Emmanuel preaches peace, tolerance among Nigerian",
    "summarized_story": "Mr. Udom EmmanuelAkwa Ibom State Governor, Mr. Udom Emmanuel, has called on Nigerian politicians to eschew tendencies that are capable of heating up the polity or straining the cords of unity, as the nation approaches another electioneering season.\nGovernor Emmanuel made the advocacy at the 2022 Wreath Laying and Armed Forces Remembrance Day, at the State Cenotaph in Uyo.\n“Let me use this opportunity to appeal to our people to eschew tendencies that helped provide the ferment for conflicts”.\nThis is, just a little effort on our part to show that we appreciate the sacrifices the Men and Officers of the Nigeria Armed Forces are making to keep us safe and secure”.\nHighpoints of the event included wreath laying by the governor, senior military and civilian personalities, gun salutes, parades, signing of condolence register in honour of the fallen heroes, as well as release of pigeons, signifying a call for peace."
  },
  {
    "headline": "Pope Francis reveals what he misses since becoming Supreme Pontiff",
    "summarized_story": "Pope Francis has made revelations in recent communication with Spanish journalist, Javier Martínez Brocal, the Director of Rome Reports.\nOn January 11, Brocal photographed him in Rome’s Pantheon area as he was leaving Stereo sound, a record store.\nTheir friendship dates back to when he was Archbishop of Buenos Aires in the “House of the Clergy” in Via Della Scrofa.\nDays after the black and white photo went viral on the internet, the Pope sent a letter to Brocal.\n“There is only one thing I miss very much: the possibility of going out and wandering around on the street."
  },
  {
    "headline": "Benue Govt moves to grant clemency to 58 convicts on death roll in Jos prison",
    "summarized_story": "The Benue State Advisory Council on Prerogative of Mercy, on Friday, visited the Jos Correctional Center in Plateau State on a fact-finding mission.\nHe stated that by law, it is the governor who has the powers to grant them clemency.\nEarlier, The Controller of Plateau State Command of the Nigerian Correctional Service, Mr Samuel Aguda disclosed that 58 convicts from Benue State are on death row waiting for the hangman of the Jos Correctional Center.\nIn a remark, the Welfare Officer Jos Correctional Center, Chief Superintendent Victoria Datti disclosed that inmates from Benue State have shown exceptional good conduct while serving their jail term.\nShe pointed out that even during the recent jailbreak, inmates from Benue State did not participate and further appealed to the Benue State governor to pardon all the convicts from the state."
  },
  {
    "headline": "SERAP asks Buhari to publish Nigeria’s agreement with Twitter",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has asked President Muhammadu Buhari to approve the publication of Nigeria’s agreement with Twitter.\nSERAP urged the President to direct the Minister of Information, Lai Mohammed to widely publish the details of the agreement.\nSERAP stressed the importance of promoting transparency, accountability, and helping to mitigate threats to Nigerians’ rights online, as well as any interference with online privacy in ways that deter freedom and expression.\nThe memo read in part: “Any agreement with social media companies must meet constitutional and international requirements, including legality, necessity, proportionality and legitimacy.\nSERAP noted that the “open-ended terms and phrases” may be used to suppress the legitimate exercise of human rights online."
  },
  {
    "headline": "Primate Ayodele issues fresh prophecy on Kenyan presidential election",
    "summarized_story": "The Leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Sunday released another prophecy concerning Kenya presidential election which will hold in August 2022.\nPrimate Ayodele said the Vice President of Kenya, William Ruto is already sleeping and if the election is conducted today, Raila Odinga will win but with a very slim margin.\n‘’If the election in Kenya is conducted today, Raila Odinga will win with a slim margin.\nThe government of the day wants to back Raila Odinga.\nThe deputy president, Willam Ruto should work very hard if he wants to become the president of Kenya."
  },
  {
    "headline": "Troops kill three bandits, recover weapons in Kaduna",
    "summarized_story": "The Kaduna State government has said military troops in the state killed three bandits and recovered weapons in Chikun Local Council of the state.\nThe Commissioner, Ministry of Internal Security and Home Affairs, Samuel Aruwan, in a statement revealed that troops neutralised three terrorists during a patrol along the Telele-Sabon Gida Road.\nThe statement explained that the troops laid ambush at a suspected terrorist rallying point on the route, saying the outlaws approached the troops’ position and entered the killing range, after which they were vigorously engaged.\nThe statement said, “The criminals returned fire but were overpowered by the troops after a brief firefight.\nThree terrorists were neutralized in the exchange.”It stated that the troops recovered three AK47 rifles, three AK47 magazines, two motorcycles, and two mobile phones from the terrorists."
  },
  {
    "headline": "Panic as petrol tanker falls in Anambra",
    "summarized_story": "Residents of Awka, Awka South local government area of Anambra State on Sunday morning scampered for safety when a petrol tanker fell in the cityThe incident happened at the popular Aroma junction around 8.25am with many residents gripped by fear.\nBut the Chief Fire Fighter in Anambra State, Martin Agbili, allayed their fears, saying they should not panic as the tanker was empty.\nAs we drove to the incident scene and we found out that the tanker is empty of any petroleum product.\n“The incident was caused due to the falling off of the back tyres of the tanker which immediately hit a moving Keke Napep (tricycle).\n“Other relevant authorities had been notified to do the needful about the tanker removal and the road safety for passersby and other motorists.”"
  },
  {
    "headline": "FACT-CHECK: Did Ishola, Lam Adesina, Ajimobi, Alao-Akala, Bola Ige die at 71?",
    "summarized_story": "Claim: A viral message titled — Can this be described as mere coincidence?\nEx-Governors Kolapo Ishola (77); Lamidi Adesina (73); Abiola Ajimobi (70) all died at different ages while Christopher Alao-Akala and Bola Ige died at 71 respectively.\nFormer Governor Christopher Alao-Akala died at 71 in January 2021.\nFormer Minister of Justice, Bola Ige died at 71.\nConclusion:The now-viral narrative trending on social media platforms that Ex-governors Kolapo Ishola, Lamidi Adesina, Abiola Ajimobi, Adebayo Alao-Akala and Bola Ige all died at the age of 71 is partly false."
  },
  {
    "headline": "Eguavoen warns Super Eagles against complacency",
    "summarized_story": "Super Eagles coach Augustine Eguavoen has warned his players against complacency and taking their chances in front of goal in subsequent matches of the 2021 AFCON in Cameroon.\nEguavoen however said the team did not play at the same high tempo, especially in the second half and that gave the Sudanese the comeback for the consolatory goal.\n“So it’s a little bit difficult to say whether we were complacent in the Sudan game or not but we will discuss this with the boys going forward,” he said.\n“Obviously, we will make changes for the last group game against Guinea-Bissau.\nThe Super Eagles will take on Guinea-Bissau on Wednesday in their last group match."
  },
  {
    "headline": "Shonekan was a gift to Nigeria – Northern Govs",
    "summarized_story": "The Northern Governors Forum said ex- Head of the Interim National Government(ING) Chief Ernest Shonekan was a gift to Nigeria who played a crucial role of holding the nation together during one of its difficult moments.\nChairman of the Forum Governor Simon Lalong, in a statement, described the death of the elder statesman as a huge loss to the country.\nHe said the late Shonekan was an accomplished technocrat who distinguished himself in the world of business rising to the peak, before he was called upon to serve the nation as the head of ING.\nWhile commiserating with his family and the nation over this colossal loss, the Northern Governors said his legacies of patriotism, patience and tolerance will continue to endure.\n- Advertisement -In a statement by the spokesman, Dr. Makut Simon Macham, said the Northern Governors also want Nigerians to honour his memory by working together to build democracy and good governance."
  },
  {
    "headline": "Lekan Balogun is next Olubadan —Kingmakers",
    "summarized_story": "According to the High Chiefs, they are unanimous in the selection of Senator Lekan Balogun as the next Olubadan.\nThe meeting which held at the Government House, Agodi, Ibadan was attended by High Chiefs Lekan Balogun, Eddy Oyewole, Abiodun Kola Daisi, and Amidu Ajibade.\nNone of us argued that the Otun Olubadan, Senator Balogun is not the next Olubadan, he is the next Olubadan.\nAccording to the High Chiefs, they are unanimous in the selection of Senator Lekan Balogun as the next Olubadan.\nNone of us argued that the Otun Olubadan, Senator Balogun is not the next Olubadan, he is the next Olubadan."
  },
  {
    "headline": "2023 presidency: Northern elders kick against zoning",
    "summarized_story": "From Noah Ebije, KadunaThe Northern Elders Forum (NEF) has kicked against zoning of the presidency as advocated by some political parties, claiming that it is anti-democracy.\n“The meeting notes the desperate condition of economic existence of most Northerners, poses additional threats to security and the democratic process.\nGovernment at all levels should consider a form of structured welfare system to alleviate poverty in the populace.\n“The meeting urges the national and states assemblies to prioritize constitutional amendments currently being processed.\n“The meeting advises Northern groups to visit and engage President Muhammadu Buhari to discuss with him on ways in which the security and economic condition of Northerners can be improved."
  },
  {
    "headline": "Ogun: 5 killed, many injured, houses burnt as farmers, herders clash",
    "summarized_story": "From Laide Raheem, AbeokutaNo fewer than five persons have been killed in a fresh crisis between farmers and herdsmen in Imeko-Afon Local Government Area of Ogun State.\nSunday Sun gathered that the herdsmen and some Ohori farmers had engaged one another in a clash at Idofa village, leading to loss of lives and property.\nAccording to a source, Aworo people had accused the herdsmen of destroying their farms and water sources through open grazing, a practice the Ogun State government had banned.\nAs of Friday, it was learnt that many residents of the village had fled for fear of being killed.\nThe Ogun State Police Public Relations Officer, Abimbola Oyeyemi, confirmed the incident, assuring that those behind the incident would be apprehended."
  },
  {
    "headline": "IPOB denies declaring January 19, 20 sit-at-home",
    "summarized_story": "From Stanley Uzoaru,OwerriThe Indigenous People of Biafra (IPOB) has dismissed as false the claims that the group has declared January 18, 19 and 20 as sit-at-home.\nIPOB never declared sit-at-home on 19th and 20th of January, 2022.\n“Again, we don’t want to compound the pains of our people, hence we will limit the sit-at-home to only January 18.\nAnybody found enforcing non-existent Monday sit-at-home on 17th, 19th and 20th is criminal and must be treated as such, IPOB leadership has given order and that order is what is signed.\nIPOB remains unshakeable, built and rooted on the rock and will remain so until the freedom for Biafra is fully achieved.”"
  },
  {
    "headline": "Governors to meet Wednesday over crucial issues –NGF",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGovernors on the platform of the Nigeria Governors’ Forum (NGF) are to meet on Wednesday over crucial issues, a statement from the forum’s secretariat has said.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nThe statement signed by Head, Media and Public Affairs at NGF’s Secretariat, Abdulrazaque Bello-Barkindo, said the meeting was at the invitation of the Chairman of Forum and Governor of Ekiti State, Kayode Fayemi, and noted that pressing national concerns would be discussed.\nThe meeting expected to commence at 8pm will be at the NGF Secretariat in Abuja."
  },
  {
    "headline": "Music affected my marriage –Tracy Tolota, US-based Nigerian gospel singer",
    "summarized_story": "By Bianca Iboma-EmefuUS-based Nigerian gospel music minister, Tracy Tolota continues to make waves with her sophomore album, Heaven’s Sound released a few months ago.\nI joined the choir when I was like 9-years-old but I ventured into gospel music when I started receiving songs from God.\nAlthough, we always have the business side to gospel music ministry, this is all good for me.\nSome artistes started out doing gospel and along the line, they got distracted and started doing other kinds of music.\nBesides doing music, do you hope to do other forms of entertainment in the future?"
  },
  {
    "headline": "Novak Djokovic Loses Australia Visa Appeal, to Be Deported",
    "summarized_story": "Tennis star Novak Djokovic has lost his last-ditch court bid to stay in Australia and is set to be deported.\nJudges rejected his appeal after the government cancelled the unvaccinated player’s visa for a second time this month on public health grounds.\nThe decision has ended the 34-year-old’s hopes of defending his Australian Open title and winning a record 21st Grand Slam.\nThere has been much public anger in Australia over Djokovic’s attempt to enter the country while unvaccinated.\nThe government has repeatedly said that no-one is above the strict rules in place to cope with the pandemic."
  },
  {
    "headline": "2023: North Won’t Vote Based on Sentiments as Done to Buhari, Say Northern Elders",
    "summarized_story": "The elders say they will no longer vote for a candidate based on sentiments as they did for President Muhammadu Buhari in 2015, describing the incumbent as a disappointment to not only the North but the entire country.\nBaba-Ahmed said Nigerians, especially northerners would vote for the best candidate, whether he or she is from the northern or southern part of the country.\n“Northerners were told that if Buhari becomes president, the country would be secured; he will fight corruption; the economy will improve, but now we are worst.\nHe said those who urged the political parties not to field northern candidates are not democrats.\n“That is how we ended up with President Buhari."
  },
  {
    "headline": "President, Others Lay Wreaths to Honour Fallen Heroes",
    "summarized_story": "Our CorrespondentsThe 2022 Armed Forces Remembrance Day was marked yesterday in Abuja with President Muhammadu Buhari presiding.\nActivities to commemorate the Armed Forces Remembrance Day had commenced on October 28, 2021, when the president launched the remembrance emblem at the State House, Abuja.\nTop officials who also laid wreaths include Vice President Yemi Osinbajo, Senate President, Dr Ahmad Lawan; Speaker, House of Representatives, Hon.\nSimilarly, Rivers State Governor, Wike has urged Buhari to stop the incessant killing of Nigerians by Boko Haram groups and bandits.\nThe second meeting is the meeting of all the 36 state governors scheduled for Wednesday to discuss the state of the nation."
  },
  {
    "headline": "OPEC Misses Production Target over Nigeria, Others’ Under-performance",
    "summarized_story": "The development widened the gap between the production quotas set by OPEC and its allies and their actual production.\nThe S&P data showed that OPEC’s 13 countries pumped 28.04 million bpd of crude, up 190,000 bpd from November, while nine non-OPEC partners pumped 13.98 million bpd, an increase of 120,000 bpd.\nBut gains by Venezuela, Kazakhstan, Saudi Arabia, Iraq and Angola far outstripped losses by Libya and Nigeria, making December the 10th straight month that OPEC+ output increased.\nIn addition, Nigeria retained the oil production target of 1.88 million bpd, including condensate production of between 300,000-400,000 bpd, for its revenue calculation in 2022.\nThis is as compared to the output target of 1.86 million bpd the government had set for the 2021 fiscal year."
  },
  {
    "headline": "My Meeting with Tinubu Not About Presidency, Fayemi Clarifies",
    "summarized_story": "This is as Oyo State Governor, Mr. Seyi Makinde, yesterday wished Tinubu well in his 2023 presidential ambition, adding that he would want the best for Nigeria.\nFayemi berated those he described as spin doctors, who claimed that he dropped his veiled presidential ambition at the meeting when nothing of such happened.\nIt is therefore disingenuous of the spin doctors who were nowhere near the venue of the meeting to begin to second guess discussions at the meeting.\n“Fayemi sees Tinubu as his leader in politics and reserves respect for him as a national leader of his party.\nMeanwhile, Oyo State Governor, Makinde, has wished Tinubu, well in his 2023 presidential ambition, but added that he would want the best for Nigeria."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "Insecurity: Buhari asks military to 'respond robustly' to killings, abductions in Niger",
    "summarized_story": "President Muhammadu Buhari has asked the military to respond fiercely to the abductions and killings by gunmen in Niger state.\nAccording to a statement by Garba Shehu, presidential spokesperson, Buhari gave the order to the defence headquarters a few days ago.\nAdvertisement“In a directive to the Defence Headquarters a few days ago, the President asked the military to respond robustly to the cases of killings and kidnappings in the State and to give effect to the strategic objectives through the use of force.\nAdvertisementThe commander-in-chief said, “The Federal Government is willing to strengthen support and cooperation with all the states.\nI believe that with the full cooperation of the citizens, we will surely overcome this problem.”"
  },
  {
    "headline": "Insecurity: Buhari asks military to 'respond robustly' to killings, abductions in Niger",
    "summarized_story": "President Muhammadu Buhari has asked the military to respond fiercely to the abductions and killings by gunmen in Niger state.\nAccording to a statement by Garba Shehu, presidential spokesperson, Buhari gave the order to the defence headquarters a few days ago.\nAdvertisement“In a directive to the Defence Headquarters a few days ago, the President asked the military to respond robustly to the cases of killings and kidnappings in the State and to give effect to the strategic objectives through the use of force.\nAdvertisementThe commander-in-chief said, “The Federal Government is willing to strengthen support and cooperation with all the states.\nI believe that with the full cooperation of the citizens, we will surely overcome this problem.”"
  },
  {
    "headline": "Emirates resumes flights from five African countries -- but not Nigeria",
    "summarized_story": "Emirates Airlines, flag carrier of the United Arab Emirates (UAE), has announced the resumption of passenger flight operations to and from Ghana, Guinea, Angola, Ivory Coast and Uganda.\nIt later extended the flight ban to other countries including Ghana, Angola, Guinea, Uganda, Cote d’Ivoire, Zambia and Zimbabwe.\nAdvertisementIn a travel update posted on its website, Emirates indicated that the lifting of travel restrictions placed on Ghana, Guinea and three other African countries took effect on Thursday.\nAdvertisementAlso, travellers from Angola and Ivory Coast are required to show a negative 72-hour PCR test, and another PCR test on arrival in Dubai.\nThe federal government had reinstated the daily flights of Emirates Airlines to Nigeria after the UAE authority offered daily flight slots to Air Peace."
  },
  {
    "headline": "Emirates resumes flights from five African countries -- but not Nigeria",
    "summarized_story": "Emirates Airlines, flag carrier of the United Arab Emirates (UAE), has announced the resumption of passenger flight operations to and from Ghana, Guinea, Angola, Ivory Coast and Uganda.\nIt later extended the flight ban to other countries including Ghana, Angola, Guinea, Uganda, Cote d’Ivoire, Zambia and Zimbabwe.\nAdvertisementIn a travel update posted on its website, Emirates indicated that the lifting of travel restrictions placed on Ghana, Guinea and three other African countries took effect on Thursday.\nAdvertisementAlso, travellers from Angola and Ivory Coast are required to show a negative 72-hour PCR test, and another PCR test on arrival in Dubai.\nThe federal government had reinstated the daily flights of Emirates Airlines to Nigeria after the UAE authority offered daily flight slots to Air Peace."
  },
  {
    "headline": "IBB: I knew Abacha wouldn’t hand over power",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former military head of state, says he knew Sani Abacha, former military ruler, would not relinquish power after he took over in a coup.\nFollowing the annulment, a national protest ensued, which forced Babangida to step aside and hand over power to Ernest Shonekan on August 27, 1993, as the head of an interim national government.\nWeeks later, Abacha stagged a coup, returning Nigeria to military rule.\nAdvertisementBabangida, in 2021, had said he annulled the election because a bloody coup would have occurred if he did not.\n“I knew, we knew, that it wouldn’t be because the argument was: “Why should I risk my life only to come and hand over power to you?”, that was what happened.”"
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "2023 presidency: Who goes for the Igbo nation?",
    "summarized_story": "And, too early in the day, the Igbo nation and its hapless people are already burdened with confusion as to who goes for them as president.\nMore than ever before, the Igbo nation needs to fight together/pull resources together to be able to fight money bags like Atiku Abubakar and Bola Ahmed Tinubu.\n“For a successful shot at the presidency in 2023, the Igbo nation needs a harmonised approach, which may not come easy, but it is very possible.\nTerming it ‘Igbo Emancipation 2023’, Chigbu Onumah, a lawyer and activist based in Onitsha, Anambra State, noted that the 2023 ambition is achievable for the Igbo nation and that streamlining, fielding a credible candidate, and reaching out to other Nigerians with fairness message will help the Igbos occupy Aso Rock in 2023.\nAccording to him, “Igbo presidency is very realisable; it is far more realisable in 2023 than any other time."
  },
  {
    "headline": "APC gambles with 2023 as convention controversy persists",
    "summarized_story": "If the APC can’t agree on the convention, the opposition will naturally take over,” he said.\nImmediately after the meeting with President Buhari, His Excellency Bagudu announced the agreement reached with President Buhari to the effect that the Convention will hold in February 2022.\n“The truth must be told, the responsibility of organising the February 2022 APC National Convention rests squarely with the CECPC.\nThe Caretaker, especially Governor Buni doesn’t want to take what President Buhari said on NTA for granted”, the source said, pleading for anonymity.\nAkpanudoedehe had on December 20 the meeting of CECPC said the Committee resolved to setup sub-committees on budgeting and other relevant structures for the February National Convention."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Igbo leaders have failed their people, should be ashamed – Elliot Uko",
    "summarized_story": "Have they ever wondered how they are perceived by the angry younger generation?\nThe younger generation are educated, suave, urbane, articulate and social media savvy.\nWhat is true rather, is that the leadership cadre should ask themselves : how come our younger generation lost confidence in us?\nIf all eligible Igbo voters register and vote, Ndigbo could boast of over 25 million votes and nobody can lead Nigeria without them.\nIncidentally, millions of Igbo youths are angry with Nigeria, and don’t want to hear about Nigerian elections, and we still insist on calling them miscreants."
  },
  {
    "headline": "For The Record: Southern and Middle Belt Leaders Demand Power Shift, Restructuring – Full Communique",
    "summarized_story": "COMMUNIQUE ISSUED AT THE END OF A MEETING OF THE SOUTHERN AND MIDDLE BELT LEADERS’ FORUM HELD ON THURSDAY, 13TH JANUARY, 2022A meeting of the Southern and Middle Belt Leaders’ Forum (SMBLF), held on Thursday, 13th January 2022 in Abuja under the Chairmanship of the Leader and Elder Statesman, Chief Dr. E. K. Clark, OFR, CON.\nIn attendance at the meeting were delegations from the four regional socio-cultural organisations, that’s: Afenifere for the South West, Ohanaeze Ndigbo for the South East, Pan Niger Delta Forum (PANDEF) for the South-South and the Middle Belt Forum (MBF) for the Middle Belt.\nTHEREFORE, UNEQUIVOCALLY, AND IN FULL RESOLVE, CALL ON ALL POLITICAL PARTIES IN THE COUNTRY TO ZONE THEIR PRESIDENTIAL TICKETS TO THE SOUTH;iv.\nUrges Governors and members of the National Assembly of the four regions to commit themselves to the subject of Restructuring;ix.\nSigned:Chief Dr. E. K. Clark, OFR, CON – LeaderChief Ayo Adebanjo – Leader, AfenifereProf. George Obiozor – President-General, Ohanaeze NdigboDr. Pogu Bitrus – National President, Middle Belt Forum"
  },
  {
    "headline": "Osun PDP Aspirant, Dele Adeleke eulogises Isiaka Adeleke on 67th posthumous birthday",
    "summarized_story": "By Sunday Oguntuyi, OsogboA leading governorship aspirant on the platform of the Peoples Democratic Party (PDP) in Osun State, Mr. ‘Dele Adeleke, has eulogised the first Civilian Governor of the state, Late Sen. Isiaka Adetunji Adeleke on his 67th posthumous birthday, describing him as a father of modern politics.\nWhen you moved, all men knew a great man has moved.\n“De Guv, you were a great man in every ramification.\n“Thank you for sharing your great life with us.\n“Happy 67th Posthumous birthday, dear Mentor, Leader and Distinguished Sen. Isiaka Adetunji Adeleke."
  },
  {
    "headline": "Nigeria’s financial services sector to grow by 8.32% in 2022 – Rewane",
    "summarized_story": "Managing Director/Chief Executive Officer, Financial Derivatives Company, Mr Bismarck Rewane has projected Nigeria’s financial services industry to grow by 8.32 per cent in 2022, going by the increased partnership and collaborations by Fintechs in promoting financial inclusion.\nRewane said the manufacturing sector would likely grow by 4.70 per cent in 2022, while predicting that improved foreign exchange liquidity and increased product innovation would boost the sector’s growth.\nTop players (Nestle Nigeria and Unilever) will report profit growth of 20 per cent in 2022,” he said.\n“Agriculture sector is likely to grow by 1.6 per cent in 2022, an efficient rail system will ease logistics constraints and boost productivity.\nRewane added that the ICT industry would likely to grow by 9.72 per cent in 2022 with telephone penetration on the rise."
  },
  {
    "headline": "Why Two-thirds Of Lawmakers May Not Return To NASS",
    "summarized_story": "The APC Senatorial ticket for Ararume is a walkover if the battle is left between him and Ibezim.\nObviously, the senators do not have the backing of the state governor as supporting their return to the red chamber amounts to anti-party activity.\nBesides, he has the backing of the state governor Inuwa Yahaya as the governor attends any political gathering organised by him.\nEmerengwa will be struggling it out with the chairman of Ikwerre local government area of the state, Hon.\nCross River is predominantly a PDP state, despite the fact that the state governor is of the APC."
  },
  {
    "headline": "Field Unqualified Candidate, Pay N0.5m Fine, INEC Warns Political Parties",
    "summarized_story": "The Independent National Electoral Commission (INEC) has warned that any political party that presents a candidate that does not meet the qualifications stipulated in the Constitution and the Electoral Act would be guilty of an offence and on conviction, liable to a fine of N500,000.\nThe commission appealed to citizens who applied for fresh registration as well as transfers and replacement of the PVCs to do so immediately and avoid last last-minute rush for the cards like in the past.\nADVERTISEMENTIt said the FCT was the only part of Nigeria where INEC conducts local government elections and a total of 475 candidates sponsored by all the 18 political parties are vying for the 68 constituencies involving six area council chairmen and 62 councilors.\n“Political parties must conduct their primaries including resolution of disputes arising from the primaries between 26 January and 5th February 2022 while the last day for submission of list of nominated candidates is 6 pm on the ninth of February which must be done through the Commission’s online nomination portal,” it said.\nIt, however, reminded political parties that the aspirant with the highest number of votes at the end of voting shall be declared the winner of the primary of the party and the aspirant’s name shall be forwarded to the Commission as the candidate of the party."
  },
  {
    "headline": "REMEMBRANCE DAY: Buhari, Governors, Others Pay Tribute To Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari and governors of the 36 states of the federation yesterday led Nigerians to honour and pay glowing tributes to fallen heroes during the 2022 Armed Forces Remembrance Day across the country.\nOn October 28, 2021 President Buhari kick started activities to mark this year’s Armed Forces Remembrance Day when he launched the remembrance emblem at the presidential villa.\nHe made the call while responding to questions from journalists after laying the wreath during the Armed Forces Remembrance Day celebration in Kano.\nZulum launched the 2022 Armed Forces Remembrance Day and emblem appeal week with the sum of N10 million.\nChairperson of MIWA, Mrs Like Ugoagha, made the appeal during the 2022 Armed Forces Remembrance Day celebration at Cenotaph, Unity Square, Abakaliki."
  },
  {
    "headline": "REMEMBRANCE DAY: Buhari, Governors, Others Pay Tribute To Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari and governors of the 36 states of the federation yesterday led Nigerians to honour and pay glowing tributes to fallen heroes during the 2022 Armed Forces Remembrance Day across the country.\nOn October 28, 2021 President Buhari kick started activities to mark this year’s Armed Forces Remembrance Day when he launched the remembrance emblem at the presidential villa.\nHe made the call while responding to questions from journalists after laying the wreath during the Armed Forces Remembrance Day celebration in Kano.\nZulum launched the 2022 Armed Forces Remembrance Day and emblem appeal week with the sum of N10 million.\nChairperson of MIWA, Mrs Like Ugoagha, made the appeal during the 2022 Armed Forces Remembrance Day celebration at Cenotaph, Unity Square, Abakaliki."
  },
  {
    "headline": "Excise Duty On Drinks Negates FG’s Economic Recovery, Job Creation Aspirations– OPS",
    "summarized_story": "Labour unions and the Organised Private Sector (OPS) have said the reintroduction of excise duty on drinks in the country negates the federal government’s aspiration on economic recovery and job creation.\nThe federal government had earlier announced the introduction of excise duty of N10 per litre on all non-alcoholic, carbonated and sweetened beverages in the country.\nADVERTISEMENTExcise duty refers to a form of tax imposed on the production, licensing and sale of goods.\nThe citizens and the business community, he said, are already experiencing a galloping and volatile inflationary condition, stressing that the excise duty is also a negation of the economic recovery, job creation and poverty reduction aspirations of the federal government.\nThe millions of micro enterprises in the soft drinks’ fruit juice distribution chain will be adversely impacted by the imposition of the excise tax,” he said."
  },
  {
    "headline": "Father from hell arrested for allegedly raping 3-year-old daughter in Bauchi",
    "summarized_story": "The police in Bauchi State have arrested a man for allegedly raping his three-year-old daughter in Kirfi Local Government Area (LGA) of the state.\nAhmed Wakil, the command’s spokesman, stated this in a statement he made available to journalists on Saturday in Bauchi.\nHe said the arrest was part of the effort to tackle criminality and other offences in the state.\nHe said the girl’s father, who was the suspect, was arrested and would be charged to court.\nHe said the command, acting on intelligence, also arrested one Ya’u Haruna, aged 25, for being in possession of one locally fabricated revolver, with one live ammunition."
  },
  {
    "headline": "Father from hell arrested for allegedly raping 3-year-old daughter in Bauchi",
    "summarized_story": "The police in Bauchi State have arrested a man for allegedly raping his three-year-old daughter in Kirfi Local Government Area (LGA) of the state.\nAhmed Wakil, the command’s spokesman, stated this in a statement he made available to journalists on Saturday in Bauchi.\nHe said the arrest was part of the effort to tackle criminality and other offences in the state.\nHe said the girl’s father, who was the suspect, was arrested and would be charged to court.\nHe said the command, acting on intelligence, also arrested one Ya’u Haruna, aged 25, for being in possession of one locally fabricated revolver, with one live ammunition."
  },
  {
    "headline": "Buhari mourns Chu Okongwu, former finance minister",
    "summarized_story": "By CHIKA CHIMEZIEPresident Muhammadu Buhari extends heartfelt condolences to the Okongwu family on the passing of the foremost economist and a former Minister of Finance, Prof Chu Okongwu.\nThe President joins family, friends and associates in paying tribute to a man of many parts, who never hesitated to give his best to Nigeria as a broadcaster with the Nigerian Broadcasting Service, sub-editor, Daily Times Nigeria, Lecturer, University of Nigeria and a Federal Minister of National Planning and later Finance.\nPresident Buhari believes that the perspectives the late Professor brought to governance and economics, which centered on improving the lives of Nigerians, will not be forgotten.\nThe President prays for the repose of the soul of the departed and divine comfort for his family during this difficult time.\nFemi AdesinaSpecial Adviser to the President(Media & Publicity)Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari mourns Chu Okongwu, former finance minister",
    "summarized_story": "By CHIKA CHIMEZIEPresident Muhammadu Buhari extends heartfelt condolences to the Okongwu family on the passing of the foremost economist and a former Minister of Finance, Prof Chu Okongwu.\nThe President joins family, friends and associates in paying tribute to a man of many parts, who never hesitated to give his best to Nigeria as a broadcaster with the Nigerian Broadcasting Service, sub-editor, Daily Times Nigeria, Lecturer, University of Nigeria and a Federal Minister of National Planning and later Finance.\nPresident Buhari believes that the perspectives the late Professor brought to governance and economics, which centered on improving the lives of Nigerians, will not be forgotten.\nThe President prays for the repose of the soul of the departed and divine comfort for his family during this difficult time.\nFemi AdesinaSpecial Adviser to the President(Media & Publicity)Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Just In: Buhari gets 7 days to release copy of agreement with Twitter",
    "summarized_story": "President Muhammadu Buhari has been given 7 days ultimatum to release a copy of the agreement recently signed with Twitter or face legal action.\nThe ultimatum was issued by the Socio-Economic Rights and Accountability Project (SERAP) on Sunday.\nThese open-ended terms and phrases may be used to suppress the legitimate exercise of human rights online.”“Any agreement with social media companies must not be used as a ploy to tighten governmental control over access to the internet, monitor internet activity, or to increase online censorship and the capacity of the government to restrict legitimate online content, contrary to standards on freedom of expression and privacy.\nThe decision to lift the suspension was reportedly based on the recommendations by the Technical Committee on Nigeria-Twitter Engagement.”“SERAP notes that Alhaji Lai Mohammed on 5th June 2021, announced the suspension of operation of Twitter by the Federal Government, following which a seven-man Presidential Committee was set up to engage Twitter Inc.\nThe Presidential Committee, in turn, established a 20-member Technical Committee, which reportedly directly worked with the Twitter team.”The letter was copied to Alhaji Lai Mohammed and Mr. Abubakar Malami, SAN, Attorney General of the Federation, and Minister of Justice."
  },
  {
    "headline": "Troops kill 5 ISWAP terrorists in Biu",
    "summarized_story": "By Sumaila OgbajeThe Nigerian Army said troops of Operation Hadin Kai (OPHK) have dealt decisively with Boko Haram and Islamic State West Africa Province (ISWAP) terrorists.\nThe troops dealt with the terrorists while they were attempting to infiltrate the ancient town of Biu in Borno.\nNwachukwu said the criminal elements met their waterloo, when the gallant troops swiftly routed them in a failed incursion at Maina Hari village in Biu on Saturday.\nHe said the troops unleashed superior fire power on the terrorists, neutralising five of the terrorists, compelling others to withdraw in disarray in the intense battle.\n“Troops are currently in pursuit of the fleeing terrorists,” he said."
  },
  {
    "headline": "BREAKING: ISWAP Fighters Attack Biu In Southern Borno",
    "summarized_story": "Fighters of the Islamic State West Africa Province on Saturday, attacked Mainahari community near Wakabiu in the Biu Local Government Area of Borno State, The PUNCH has learnt.\nAccording to a source from the Army Barrack in Biu, the insurgents threw bombs to the village around 3pm today.\nHowever, the insurgents were successfully repelled by men of the Nigerian Army.\nThen we heard that they were trying to enter Mainahari village near Wakabiu but the army were on alert and they immediately engaged the insurgents.\nThis attack followed an alleged attack by the ISWAP terrorists on Friday in Biu town after attacking the army institute of peace and war college Buratai barely five days ago."
  },
  {
    "headline": "Abuja: 36 Governors To Hold NGF Meeting Tuesday",
    "summarized_story": "The Chairman of the Nigeria Governors’ Forum and Governor of Ekiti State, Dr Kayode Fayemi, has invited all the other 35 Governors to a “very crucial meeting where pressing national concerns will be discussed.”The meeting is slated for 8:00 pm on Wednesday, January 19, 2022, at the NGF Secretariat in Abuja.\nThe Head, Media and Public Affairs, Nigeria Governors’ Forum Secretariat, Abdulrazaque Bello-Barkindo, disclosed this in a statement signed on Saturday titled ‘NGF Meeting’.\nAccording to an invitation issued by the Director-General of the Forum, Asishana Okauru, and sent to all the respective Governors, the meeting, which is the first in 2022, will be in-person as opposed to virtual.\nThis, he said, is to effectively convey the messages of the meeting which are all characterised under the second item of the agenda titled ‘matters arising.’To also feature prominently are the interventions programs such as the regular updates from the Nigeria Governors’ Forum State Fiscal Transparency, Accountability and Sustainability Program team and another on Coronavirus Aid, Relief and Economic Security as well as others.\nThe NGF Chairman, accompanied by all the 36 Governors, will thereafter address a press conference."
  },
  {
    "headline": "BREAKING: Super Eagles Qualify For AFCON 2021 Knockout Stage",
    "summarized_story": "Following a 3-1 win over Sudan on Saturday, Nigeria advanced to the knockout stages of the 2021 Africa Cup of Nations.\nThe Super Eagles had beaten Egypt 1-0 in their first Group D fixture.\nAgainst the Sudanese, goals from Samuel Chukwueze, Taiwo Awoniyi and Moses Simon gave the three-time champions a three-goal lead.\nAlthough Sudan pulled one back, it was merely a consolation goal.\nNigeria top the group with six points ahead of the Egypt vs Guinea-Bissau game."
  },
  {
    "headline": "BREAKING: Lekan Balogun Is Next Olubadan -Olubadan-In-Council",
    "summarized_story": "The kingmakers said they have collectively agreed that Senator Lekan Balogun should be appointed as the next Olubadan.\nLadoja said that the perceived controversy surrounding ascension to the Olubadan Stool has been amicably resolved.\nThe statement was titled, “Olubadan-In-Council clears air on succession, says Senator Lekan Balogun is next Olubadan”.\nThe Osi Olubadan further explained that Council members had met with Governor Makinde and agreed to the resolution that Senator Lekan Balogun who is next in line to the stool remained the authentic candidate for the Olubadan Stool.\nHe also promised that the Olubadan-in-Council would jointly make a public statement on their resolutions soonest."
  },
  {
    "headline": "Breaking: I’m disappointed, Novak Djokovic gives up, set to be deported, misses Australian Open",
    "summarized_story": "Tennis star Novak Djokovic has lost his last-ditch court bid to stay in Australia and is set to be deported.\nJudges rejected his appeal after the government cancelled the unvaccinated player’s visa for a second time this month on public health grounds.\nThe decision has ended the 34-year-old’s hopes of defending his Australian Open title and winning a record 21st Grand Slam.\nThere has been much public anger in Australia over Djokovic’s attempt to enter the country while unvaccinated.\nThe government has repeatedly said that no-one is above the strict rules in place to cope with the pandemic."
  },
  {
    "headline": "2023: Leaders North must reject, vote for – Ex-INEC scribe",
    "summarized_story": "“The North needs a major shift in its elite selection processes, which will allow it to put into power, competent, honest and visionary leaders at all levels.\n“The imperative of affecting major changes in the quality of leadership starting from the 2023 elections is beyond question.\n“Younger Northerners are angry, frustrated and alienated, with virtually no linkages with elders and leaders, unless they are hired thugs in the service of politicians.\n“We have wasted enough lives, blood, energy and resources blaming leaders who have reaped hugely from our misfortunes and injuries.\nThe North has to understand how a cultured, hardworking and intelligent people cannot produce good leaders who can build a strong economy from its huge potential."
  },
  {
    "headline": "Breaking: Chukwueze, Awoniyi, Simon score as rejuvenated Super Eagles down Sudan in second AFCON 2021 clash",
    "summarized_story": "Again, Nigeria’s Super Eagles stepped up the game in the ongoing Africa Cup of Nations group D encounter to beat Sudan 3-1 on Saturday.\nSamuel Chukwueze, Taiwo Awoniyi and Moses Simon scored the goals for the Nigerian team.\nDetails loading…"
  },
  {
    "headline": "SERAP Writes Buhari, Seeks ‘Copy Of Agreement With Twitter’",
    "summarized_story": "“This means that any conditions for lifting the suspension of Twitter must meet the requirements of regular legal processes and limit government discretion.\nThese open-ended terms and phrases may be used to suppress the legitimate exercise of human rights online.\n“SERAP notes the interdependence of human rights, such as the importance of privacy as a gateway to freedom of expression.\nThe decision to lift the suspension was reportedly based on the recommendations by the Technical Committee on Nigeria-Twitter Engagement.\n“SERAP notes that Alhaji Lai Mohammed on 5th June 2021, announced the suspension of operation of Twitter by the Federal Government, following which a seven-man Presidential Committee was set up to engage Twitter Inc."
  },
  {
    "headline": "Armed Forces Remembrance Day: Nigerians Honour Fallen Heroes",
    "summarized_story": "﻿Today is Armed Forces Remembrance Day in Nigeria, an annual event to commemorate the nation’s servicemen and fallen heroes.\nThe event, celebrated on January 15 each year, also honours veterans of World War I and II, as well as the Nigerian Civil War.\nIt is a day set aside for sober reflections on the significance of the armed forces to the country.\nWhile the Armed Forces Remembrance Day is celebrated on November 11 every year globally, it is known as the armistice day, commemorating the end of the first World War.\nAfter prayers were said in both Christian and Islamic ways, President Buhari who is the Special Guest of Honour at the event laid a wreath to honour the fallen heroes."
  },
  {
    "headline": "PHOTOS: Buhari, Osinbajo, Others Pay Tribute To Nigerian Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari on Saturday led a wreath-laying event to commemorate the 2022 Armed Forces Remembrance Day.\nHe was joined by the Vice President, Professor Yemi Osinbajo; the Senate President, Ahmad Lawan; and the Speaker of the House of Representatives, Femi Gbajabiamila.\nThereafter, Professor Osinbajo and others took turns to pay respect to the soldiers who paid the supreme price while protecting the nation’s territorial integrity.\nThe event, celebrated on January 15 each year, also honours veterans of World War I and II, as well as the Nigerian Civil War.\nIt is a day set aside for sober reflections on the significance of the armed forces to the country."
  },
  {
    "headline": "Gunmen Attack Police Station In Imo, Kill Inspector",
    "summarized_story": "Gunmen have attacked a police station in Mgbidi, the headquarters of Oru West Local Government Area of Imo State.\nThe Police Public Relations Officer in Imo, Michael Abattam, confirmed the attack on the security facility in a statement on Saturday.\nAlthough he said the police personnel on duty repelled the attack by the assailants, a police inspector was killed, and another policeman was injured.\nREAD ALSO: Nigeria Honours Fallen Heroes On Armed Forces Remembrance DayNarrating how the incident occurred, Abattam, a Chief Superintendent of Police, explained that the station came under attack on Friday night.\nBut the security operatives on duty, the command’s spokesman said, stood their ground and positioned themselves professionally to repel the gunmen."
  },
  {
    "headline": "Covax Delivers One Billionth COVID-19 Vaccine Dose",
    "summarized_story": "The Covax scheme aimed at equitable global access to Covid-19 vaccines hit a “key milestone” Saturday when it delivered its one billionth dose, one of its key backers said.\n“Covax has delivered its first billionth dose of Covid-19 vaccines to 144 countries & territories across the world,” Gavi chief executive Seth Berkley tweeted.\nCovax hit the one-billionth mark less than a year after delivering its first vaccine dose late last February — to Ghana.\nAll countries have been permitted to order doses through the mechanism, but lower-income countries have received the jabs free of charge.\nBerkley said in a statement Saturday that he was “proud that nearly 90 percent of the first billion doses Covax has delivered have been full-funded doses sent to the low and lower-middle countries”."
  },
  {
    "headline": "Tinubu visits Ogbomosho, commiserates with Soun, Akala's families",
    "summarized_story": "The national leader of the All Progressives Congress and 2023 Presidential aspirant, Asiwaju Bola Tinubu, has visited the family of the late Christopher Alao-Akala in Ogbomosho.\nThe visit was to commiserate with with his family over the demise of the former governor of Oyo state.\nHe also paid condolence visit to the family of late Soun of Ogbomosho, Oba Jimoh Oyewunmi Ajagungbade III."
  },
  {
    "headline": "Updated: Tinubu visits Zamfara, appeals for continued prayer for peace",
    "summarized_story": "The National Leader of the APC, Asiwaju Bola Tinubu has visited Zamfara to commiserate with Governor Bello Matawalle and residents of the State over the incessant killings by bandits.\nOla Awakan reports that the incessant killings by bandits in Zamfara has become a course of worry to Nigerians.\nWithin the first two weeks of January 2022 hundreds of people are reported to have been killed in Zamfara.\nNational leader of the APC, Asiwaju Bola Tinubu was received in the Government house as he condemned the killings by bandits.\nGovernor Bello Matawalle responded by thanking Bola Tinubu for his show of life."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Expect More Worrisome Variants after Omicron, Scientists Say",
    "summarized_story": "Scientists warn that omicron’s whirlwind advance practically ensures it won’t be the last version of the coronavirus to worry the world.\n“The faster omicron spreads, the more opportunities there are for mutation, potentially leading to more variants,” Leonardo Martinez, an infectious disease epidemiologist at Boston University, said.\nWhen new variants do develop, scientists said it’s still very difficult to know from genetic features which ones might take off.\nFor example, omicron has many more mutations than previous variants, around 30 in the spike protein that lets it attach to human cells.\nTo curb the emergence of variants, scientists stress continuing with public health measures such as masking and getting vaccinated."
  },
  {
    "headline": "Hostages Safe After Texas Synagogue Standoff; Captor Dead",
    "summarized_story": "But DeSarno said the agency’s investigation “will have global reach.”It wasn’t clear why the attacker chose the synagogue.\nShe said she heard the man rant against America and claim he had a bomb.\n“He was clearly in extreme distress.”Francis, who grew up near Colleyville, tuned in after she read about the hostage situation.\nYou know, it’s a small town and it’s a small congregation,” Eisen said as the hostage situation was ongoing.\n“No matter how it turns out it’s hard to fathom how we will all be changed by this, because surely we will be.”President Joe Biden issued a statement thanking law enforcement after the hostage situation ended."
  },
  {
    "headline": "Djokovic Loses Deportation Appeal in Australia",
    "summarized_story": "Novak Djokovic’s hopes of playing at the Australian Open were dashed Sunday after a court dismissed the top-ranked tennis star’s appeal against a deportation order.\nThree Federal Court judges upheld a decision made on Friday by the immigration minister to cancel the 34-year-old Serb’s visa on public interest grounds.\nThe decision likely means that Djokovic, who is not vaccinated against COVID-19, will remain in detention in Melbourne until he is deported.\nA deportation order usually also includes a three-year ban on returning to Australia.\nA border official cancelled his visa after deciding Djokovic didn’t qualify for a medical exemption from Australia’s rules for unvaccinated visitors."
  },
  {
    "headline": "Nigeria’s University Lecturers Extend Strike Deadline to February",
    "summarized_story": "ASUU had resolved to embark on industrial action to compel the federal government to meet its demands.\n“ASUU leadership has agreed to wait till February to give NIREC and other stakeholders enough room to address the union’s grievances,” he said.\nIts earlier statement had summed up the decisions reached at the emergency National Executive Council (NEC) of the union held at its National Secretariat, University of Abuja.\nOne of the issues in contention is the delay in approving the University Transparency Accountability Solution (UTAS) developed by ASUU.\n“NEC concluded that government has failed to satisfactorily address all the issues raised in the 2009 FGN-ASUU Agreement and subsequent MoUs and MoAs."
  },
  {
    "headline": "Nigeria: My Meeting with Tinubu Not About Presidency, Governors’ Chairman Fayemi Says",
    "summarized_story": "This is as Oyo State Governor, Mr. Seyi Makinde, yesterday wished Tinubu well in his 2023 presidential ambition, adding that he would want the best for Nigeria.\nFayemi, who is also Chairman of the Nigeria Governors’ Forum, berated those he described as spin doctors, who claimed that he dropped his veiled presidential ambition at the meeting when nothing of such happened.\n“Asiwaju Tinubu is a former two-term governor of Lagos State and national leader of the APC, while Dr Fayemi, also a chieftain of the party, is the governor of Ekiti State and current Chairman of Nigeria Governors’ Forum.\n“Fayemi sees Tinubu as his leader in politics and reserves respect for him as a national leader of his party.\nMeanwhile, Oyo State Governor, Makinde, has wished Tinubu, well in his 2023 presidential ambition, but added that he would want the best for Nigeria."
  }
]