[
  {
    "headline": "Labour induction poses risk of maternal, neonatal deaths, Gynaecologists warn",
    "summarized_story": "According to the experts, labour induction is never an emergency procedure, noting that it can lead to maternal and neonatal deaths when poorly performed.\nThe maternal health experts stated that labour induction is usually planned and also done based on certain reasons and indications.\nIf labour induction is poorly managed, it can lead to maternal and neonatal deaths.”According to the World Health Organisation, induction of labour is the process of artificially stimulating the uterus to start labour.\nThe American College of Obstetricians and Gynaecologists says sometimes, labour induction does not work.\nIt is not even a labour that you do without the presence of a gynaecologist or an obstetrician because it is a high risk labour."
  },
  {
    "headline": "Labour induction poses risk of maternal, neonatal deaths, Gynaecologists warn",
    "summarized_story": "According to the experts, labour induction is never an emergency procedure, noting that it can lead to maternal and neonatal deaths when poorly performed.\nThe maternal health experts stated that labour induction is usually planned and also done based on certain reasons and indications.\nIf labour induction is poorly managed, it can lead to maternal and neonatal deaths.”According to the World Health Organisation, induction of labour is the process of artificially stimulating the uterus to start labour.\nThe American College of Obstetricians and Gynaecologists says sometimes, labour induction does not work.\nIt is not even a labour that you do without the presence of a gynaecologist or an obstetrician because it is a high risk labour."
  },
  {
    "headline": "Mental health consequences of sexual assault",
    "summarized_story": "Sexual assault is an emotionally charged issue with medical, social, political and legal undertones.\nThe terms childhood sexual abuse and adulthood sexual violence are based on definitions developed by the American Medical Association (1992); childhood sexual abuse consists of contact abuse ranging from fondling to rape and non-contact abuse; such as modeling inappropriate sexual behavior, forced involvement in child pornography or indiscriminate exposure of the genitals.\nThere are many different terms for sexual violence but I prefer sexual trauma which refers to one or multiple sexual violations that invoke significant mental distress.\nSexual assault is not only a physical experience but has concomitant psychological consequences.\nAdult survivors of childhood sexual abuse report problems with low sexual interest and few close relationships."
  },
  {
    "headline": "Mental health consequences of sexual assault",
    "summarized_story": "Sexual assault is an emotionally charged issue with medical, social, political and legal undertones.\nThe terms childhood sexual abuse and adulthood sexual violence are based on definitions developed by the American Medical Association (1992); childhood sexual abuse consists of contact abuse ranging from fondling to rape and non-contact abuse; such as modeling inappropriate sexual behavior, forced involvement in child pornography or indiscriminate exposure of the genitals.\nThere are many different terms for sexual violence but I prefer sexual trauma which refers to one or multiple sexual violations that invoke significant mental distress.\nSexual assault is not only a physical experience but has concomitant psychological consequences.\nAdult survivors of childhood sexual abuse report problems with low sexual interest and few close relationships."
  },
  {
    "headline": "COPA AMERICA: Neymar on form as Brasil rout Venezuela 3-0",
    "summarized_story": "Brasilian superstar Neymar ran the show as he scored one and assisted another in Brasil’s 3-0 Copa America opener victory against Venezuela at the Estadio Nacional.\nPSG defender Marquinhos set La Selecao going, netting Brasil’s first and his third international goal before teammate Neymar added a second from the penalty spot in the 64th minute.\nALSO READ: Abia: No soldier killed in Ohafia, troops not on revenge mission ― ArmyBrasil dominated proceedings, finishing the game with eighteen shots to Venezuela’s three, with Gabriel Barbosa sealing the win with a late strike.\nBrazil started on the front foot and twice went close early on, Joel Graterol keeping out Richarlison and Eder Militao heading wide from a teasing Renan Lodi cross.\nLate on Neymar turned provider for Brazil’s third in the 89th minute, rounding Graterol and crossing for Barbosa to chest home from almost on the line."
  },
  {
    "headline": "Branch offers 20% returns on investment, free unlimited transfers",
    "summarized_story": "By Babajide KomolafeBranch international, a digital bank, has assured investors of 20 per cent annual returns on investment made through its Branch digital app, and free unlimited transfers as well as instant loans.\nManaging Director/Chief Executive of Branch Nigeria, Adedayo Ademola, disclosed this during a virtual press conference where she announced the transformation of Branch to a full financial service digital bank.\nREAD ALSOInvestments in FG’s treasury bills weaken, sales fall 19% to N1.35trnThe company’s Branch app already has over 20 million downloads across Nigeria, Kenya, Tanzania and India.\nShe stressed that investments made through the Branch app are channeled into low-risk financial instruments with capital preservation as the ultimate goal.\nBranch remains perfectly poised to take on the challenge of providing access to affordable financial services for all”."
  },
  {
    "headline": "NDDC Board: Former Bayelsa commissioner flays group 7-days ultimatum to Sylva over nominee",
    "summarized_story": "By Emem IdioA former Commissioner in Bayelsa State and Public Affairs Commentator, Chief Nathan Egba-Ologo, has described the 7-day ultimatum, recently issued to the Hon.\nChief Egba-Ologo warned against the ugly trend, stating that if allowed to continue, the actions of such individuals and groups would destroy the string of unity and brotherhood that bind Bayelsa people together.\nHis words: “Quite a number of people in Bayelsa State have become so used to the idea of relegating Bayelsa East Senatorial District to the background, in the scheme of things in the State, that if anything good comes to the area, they automatically become hostile and seek all possible avenues to destroy it.\nThe former Commissioner who called on the Petroleum Minister, Chief Timipre Sylva to remain firm and focused on nominating people of the State into federal positions based on qualifications and need for balance, also advised Bayelsans to continue to give the leaders all necessary support to enable them work for the growth and development of the State.\nVanguard News Nigeria"
  },
  {
    "headline": "2023: No better youth to lead Nigeria than Yahaya Bello — Mikel",
    "summarized_story": "Arogbonlo IsraelFormer Super Eagles captain cum Chelsea legend, Mikel Obi has called for youth leadership in Nigeria ahead of the 2023 presidential election.\nThe Stoke City player made this call during a courtesy visit to the Kogi State Governor, Yahaya Bello on Sunday.\nHe commended Governor Bello for his achievement in Kogi in the areas of security, healthcare, infrastructure, education and agriculture.\nHe further stated that when such projects are carried out at the federal level, it would bring further development for Nigeria.\nBello in his response, appreciated the footballer for his visit, noting that the security and welfare of his people and Nigerians remained his priority."
  },
  {
    "headline": "CEOs anticipate increase in tax obligations — PwC",
    "summarized_story": "NestoilBy Elizabeth AdegbesanChief Executive Officers (CEOs) across Africa are anticipating increase in taxes caused by government efforts to address rising public debts.\nREAD ALSOFIRS introduces online naira tax-filing platformsSpeaking at the virtual media presentation of the report, Taiwo Oyedele, Fiscal Policy Partner & PwC Africa Tax Leader, said: “Plummeting government revenues and fragile economic growth are fuelling an increase in government debt across Africa.\nThis could result in tax aggression by government, increases in tax rates or introduction of new taxes.\nIt stated: “56 percent of CEOs in Africa are extremely concerned about tax policy uncertainty (Global: 31 percent).\nHe said: “In the light of the concerns that Africa’s CEOs have on policy uncertainty, tax policy uncertainty, cyber threats, and over-regulation, this is an opportunity for African business leaders to re-imagine every aspect of their operating model."
  },
  {
    "headline": "Zambia’s President collapses at Defence Day ceremony",
    "summarized_story": "President Edgar Lungu of Zambia on Sunday collapsed during the 45th Defense Forces Day Commemoration and Investiture ceremony held at the nation’s capital, Lusaka.\nSimon Miti, Private Secretary to the Zambia President, who confirmed the incident in a statement said Lungu recovered immediately after experiencing sudden dizziness.\nThe government assured the general public, all concerned citizens and the international community that the President is well and has continued to discharge his duties since the incident.\nThe statement read, “The President of the Republic of Zambia, Dr Edgar Chagwa Lungu, this afternoon experienced sudden dizziness whilst officiating at the 45th Defence Force Day Commemoration and Investiture Ceremony.\n“His Excellency recovered immediately and walked to the official car and returned to his residence at State House.”"
  },
  {
    "headline": "Gov Mohammed appoints new Chief of Staff",
    "summarized_story": "Governor Bala Mohammed of Bauchi State has appointed Aminu Gamawa as the new Chief of Staff, Government House, Bauchi.\nGamawa replaces Ladan Salihu, who was sacked on June 9, alongside commissioners and other political appointees and Secretary to the Bauchi Government.\nMr Mukhtar Gidado, the Special Adviser on Media and Publicity to Mohammed, disclosed this in a statement on Monday.\n“Gamawa worked across a wide range of organisations, government agencies, educational institutions and non-profitable entities.\n“He’s the Chairman, Bauchi State COVID-19 Economic Recovery Committee 2020, and Vice Chairman, World Bank States Fiscal Transparency, Accountability and Sustainability (SFTAS) in the state,” the statement read in part."
  },
  {
    "headline": "Ogun: Gov Abiodun under fire for taking photos to Buhari in Abuja",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has come under serious bashing on social media immediately after saying he took photos of his projects to President Muhammadu Buhari at the Aso Rock Villa in Abuja.\nHe should have branched in Ogun State to do the same, not you carrying paper to Abuja.\nIn fact, I am short of words.”Oladimeji Tosin: “You can deceive him, but you can’t deceive those of us staying here in Ogun State.\nI will implore you to change and prove to the people of Ogun State that you are capable.\nMr President will be so proud of you sir.”Babarinde Oyewole: “Photo speaks, as you can see Mr Governor, Buhari is just looking at it for looking sake."
  },
  {
    "headline": "Social critic describes constitution amendment as unpatriotic",
    "summarized_story": "Adewale Adebisi, a social commentator, has said referendum, rather than constitution review, is the way to go in settling agitations for secession in Nigeria.\nAdebisi, who claimed that the 1999 Constitution was a product of the military era, stated that it created a unitary federalism which empowered the centre in detriment to the states.\nHe revealed that the 1963 Republican Constitution was the best so far even as he lambasted the political elite and accused them of being beneficiaries of the 1999 Constitution.\n“There is nothing stopping this present government from conducting a plebiscite to determine whether this present constitution is useful or not.\nOn the June 12 Democracy Day celebration, he explained that it was a procession and not a protest."
  },
  {
    "headline": "Insecurity: Niger needs urgent help",
    "summarized_story": "A retired senior Police officer, Abdulmajid Ali says Niger State needs timely local and foreign assistance.\nIn a statement, the retired Deputy Inspector-General (Operations) decried the destruction of people’s valuables and loss of lives.\nAli said with recurring attacks in Wushishi, Zungeru, Kontagora, Rijau, Tegina, up to parts of Kaduna territory, it is clear that the government and people of Niger are suffering.\nAli commended the Police and troops from other security forces who have been at battle theatres in Niger State.\nHe urged the Federal Government to rise to its responsibility and rescue all Nigerians in places riddled with crises."
  },
  {
    "headline": "Toyin Abraham reconcile Mercy Aigbe, Iyabo Ojo at Toyin Lawani’s wedding",
    "summarized_story": "By Ekaete BasseyNollywood actresses, Iyabo Ojo and Mercy Aigbe have sheathed their swords and embraced peace.\nBoth movie stars were guests at Toyin Lawani’s wedding ceremony on Saturday, June 12 and showed up in stunning outfits.\nRecall that last year, a popular Instagram blog revealed there was a silent beef between Mercy and Iyabo Ojo.\nIt was reported Mercy got angry because Iyabo didn’t acknowledge her when she posted the photo of her late mother.\nREAD ALSO: Toyin Abraham weighs in on bad friendsHowever, that has been quelled now with the recent photo they shared."
  },
  {
    "headline": "Lateef Adedimeji, Tunde Kelani shine as ‘Ayinla’ premieres",
    "summarized_story": "By Gbenga BadaThe highly anticipated film ‘Ayinla’ by veteran filmmaker, Tunde Kelani, featuring Lateef Adedimeji as lead character premiered on Sunday, June 13.\nLateef Adedimeji, who plays the role of Ayinla, in the film that narrates the life and time of late Nigerian musician, Ayinla Omowura, shone like a bright star at the premiere.\nADVERTISEMENTLooking regal in his full traditional attire, the film star couldn’t help smiling and thanking fans as well as Kelani for the opportunity.\nThe premiere had several guests treated to a night of good food and drinks.\nThe film, which is the collaboration between two generations of filmmakers, Kelani and Jade Osiberu, had several film stars and corporate world gurus in attendance."
  },
  {
    "headline": "With N800b extra budget, no excuse for military, says Ndume",
    "summarized_story": "By Sanni Onogu, AbujaWith N800 billion proposed as supplementary budget for defence, the military has no excuse not to decisively prosecute the war against insurgency and rid the country of all forms of criminality, Senate Committee on Army Chairman Ali Ndume said yesterday.\nThe N800 billion request is to support the military in its war against Boko Haram in the Northeast.\nHe congratulated Nigerians on the commemoration of the June 12 Democracy Day, and urged the President to continue to update Nigerians on issues of national importance on quarterly basis.\nThe borrowings should be spent on purchase of farm implements and other farming machinery and make it available to farmers.\n“The external loans should also be used to fund moribund industries especially textile and spare part manufacturing among others."
  },
  {
    "headline": "2021 UTME: JAMB gives update on candidates with incomplete registration",
    "summarized_story": "Agency ReporterJoint Admissions and Matriculations Board (JAMB) has advised candidates whose registration process is incomplete to visit special centres to finish the process.\nBenjamin said the advice affected only those who could not complete their registration during the earlier scheduled registration period.\nHe said only candidates whose names were compiled after giving reasons for the incomplete registration process and had been contacted “are expected to visit the centres”.\nThe Registrar of the board, Prof. Ishaq Oloyede, however, disclosed the possibility of conducting a second UTME for candidates with genuine registration challenges.\nOloyede made disclosed this on Wednesday in Lagos while monitoring profiling of candidates with 2021 UTME registration challenges."
  },
  {
    "headline": "No soldier killed in Abia, troops not on revenge mission – Army",
    "summarized_story": "Agency ReporterThe Nigerian Army has dismissed reports that troops were on revenge missions in some communities in Abia following the alleged killing of six soldiers in a clash with ESN/IPOB terrorists.\nThe Director, Army Public Relations, Brig.-Gen. Mohammed Yerima, in a statement on Monday, said contrary to reports, no soldier was killed in the Ohafia Local Government Area of the state.\nHe described the allegation as a baseless fabrication aimed at tarnishing the good image of the Nigerian army as well as creating distrust between the public and security agents in the state.\nREAD ALSO: Pandemonium in Abia communities as army clash with gunmenYerima explained that troops only carried out routine clearance operations in the area in line with the rules of engagement and respect for the fundamental human rights of citizens.\n“Consequently, we wish to reassure the good people of Abia of the safety of their lives and property."
  },
  {
    "headline": "Uproar over plan to reopen grazing route",
    "summarized_story": "As far as the Northern Elders Forum (NEF) is concerned, reactivating open grazing routes may cause legal and security problems.\n“The reactivation of open grazing routes in southern part or any other parts of the country is problematic both in legal terms and security.\nThe Federal Government can actually sue governors that ban open grazing and the court will rule whether they are right or wrong.\nAt what time in our history did our founding fathers gather to designate specific routes from the north to the south as ‘grazing routes’?\nSince most governors in the country have outlawed open grazing in their respective states, on which land does the Federal Government want to ‘open’ or ‘re-open’ its vaunted grazing routes?"
  },
  {
    "headline": "Insecurity: Don’t abdicate your responsibility, Masari tells Buhari",
    "summarized_story": "From Agaju Madugba, KatsinaKatsina Governor, Aminu Bello Masari, has faulted President Muhammadu Buhari on reasons for worsening insecurity in the country.\nBut citing Constitutional provisions, Masari said it was wrong for anybody to blame states and local governments.\nWhen you look at the Constitution of the Federal Republic of Nigeria, the issue of security is under the Exclusive List.\n“From the local governments, we assist the police, the DSS, the NSDC.\nIf you devolve, states and local governments will have more financial independence."
  },
  {
    "headline": "Buhari, APC must address separatist agitations, not use of military –Odigie-Oyegun",
    "summarized_story": "From Romanus Ugwu, AbujaFormer national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun, has asked President Muhammadu Buhari and the ruling party to address the separatist agitations in the country through democratic means instead of deployment of military.\nHe said the fact that things are bad and people hungry and angry was not questionable, saying that these were worldwide phenomenon.\nHowever, Odigie-Oyegun decried the current security challenge in the country.\n“It is my hope that we will begin to get control of the security of this nation,” he said.\nThe executive of the party, the NWC, the Caucus, the NEC which is the highest organ of the party."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service tomorrow",
    "summarized_story": "Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan tomorrow.\nThe company stated this, yesterday, in a statement by its Lagos District Manager, Mr Jerry Oche, assuring that as from Tuesday (tomorrow) morning the Lagos – Ibadan train services will be available to the public.\n“Lagos to Ibadan takes off at 8am from Mobolaji Johnson Station at Alogomegi, Ebute Meta Lagos, while the train will depart Ibadan to Lagos at 8am from Obafemi Awolowo Station at Moniya.\nLagos to Ibadan ia at 4pm from Mobolaji Johnson Station Alagomji, while from Ibadan to Lagos is by 4pm from Obafemi Awolowo Station at Moniya.\nHe said the Alagomeji, Abeokuta, and Moniya remained the stop stations of the Lagos Ibadan train services."
  },
  {
    "headline": "Twitter ban: Govt officials, others switch to Indian app, Koo",
    "summarized_story": "By Lukman OlabiyiFollowing the ban on US microblogging platform, Twitter, the Federal Government, President Muhammadu Buhari, Vice President Yemi Osinbajo, and public office holders have switched to Indian App, Koo.\nApart from Federal Government officials that are already active on the new platform, some state governments officials have also discarded their Twitter accounts and switched to Koo.\nThe verified account of the Federal Government on the app is @Nigeriagov, and it has over 20 posts.\nPresident Buhari who also joined the new app in June already has 7, 374 followers and following none.\nAhmad, the president’s aide on new media, was already getting closer to hitting 10, 000 followers."
  },
  {
    "headline": "States Unveil Plans to Implement Financial Autonomy for Legislature, Judiciary",
    "summarized_story": "Our ReportersStates have unveiled strategies to implement the Memorandum of Action (MoA) to ensure financial autonomy for the legislature and judiciary, THISDAY has learnt.\nEbonyi State Chairman of PASAN, Mrs. Uche Edene, told THISDAY that the state had gradually started the implementation of the financial autonomy even before the strike started.\nShe stated that the state had enacted Fund Management Law in 2016 which gave birth to the State House of Assembly Commission.\nAminu Masari, said the state government had concluded plans to inaugurate SAAC and State Assembly Service Commission in order to enable the two arms of government to receive their statutory allocations directly from the federal government.\nSpokesman of the Speaker of the Kaduna State House of Assembly, Mr. Ibrahim Danfulani, said the lawmakers would debate the issue this week."
  },
  {
    "headline": "N’Assembly to Conclude Constitution Review by July",
    "summarized_story": "Deji Elumoye in AbujaThe two chambers of the National Assembly are poised to pass the bill for the alteration of 1999 Constitution as altered before proceeding on annual break in July.\nTowards the early passage of the bill, the National Assembly committees working on the bill will conclude their assignments and present the bill for clause-by-clause consideration before the lawmakers proceed on annual recess in July.\nAlready, the constitution review committees of both the Senate and House of Representatives are collating reports from the zonal public hearings held last month across the six geo-political zones.\nThe Senate Ad-hoc Committee on Constitution Review, headed by the Deputy President of the Senate, Senator Ovie Omo-Agege, and that of the House of Representatives, headed by Deputy Speaker, Hon.\nIdris Wase, had in May held public hearings in 12 cities, at the rate of two per each of the six geo-political zones."
  },
  {
    "headline": "Report: $15bn Investments Lost Annually to Non-passage of PIB",
    "summarized_story": "“Its delay has sparked a great deal of uncertainty and led to an estimated loss of over $15 billion annually in lost investments to Nigeria’s oil and gas industry.\nOPEC: Nigeria’s Oil Production Hit Record Low in MayMeanwhile, Nigeria’s crude oil production output hit record low levels in May, the June Monthly Oil Market Report (MOMR) of the Organisation of Petroleum Exporting Countries (OPEC), has shown.\nThe monthly report indicated that in the first quarter of 2021, Nigeria’s average production was 1.410 million barrels per day.\nThe country’s average crude oil production based on secondary sources was 1.78 Mbpd in 2019 and 1.57mbpd in 2020, while total OPEC 13-member crude oil production averaged 25.46 mb/d during May.\nThe OPEC report showed that Africa’s demand for crude oil was 3.43 million bpd in 2019, which fell to a 4.37million bpd in Q1, 2020."
  },
  {
    "headline": "Oyegun: FG Must Prioritise Restructuring for Nigeria’s Survival",
    "summarized_story": "The former Edo State governor said it was vital that these issues should be addressed as the country cannot continue to allow the subject to become a recurring threat.\nAlso, National Leader of APC, Senator Bola Tinubu, said the public perception of President Muhammadu Buhari had changed after his interview with ARISE NEWS Channel.\nHe added that the face-off between Odigie-Oyegun’s successor, Mr. Adams Oshiomhole, and Edo State Governor, Mr. Godwin Obaseki, was a collateral damage for the party.\nAccording to him, the forces of economics have made things, not quite the way the party wanted them to be.\nIt must be mandatory in the interest of the survival of our nation, that these issues be addressed."
  },
  {
    "headline": "Falana Asks Police to Apologise to Arrested June 12 Protesters",
    "summarized_story": "Alex Enumah in AbujaHuman rights lawyer, Mr. Femi Falana (SAN), has asked the Nigeria Police Force to apologise for violating the fundamental right of protesters to freedom of expression.\nFalana said in a statement yesterday that peaceful protests are fundamental rights of Nigerians as provided for in the 1999 constitution.\nAs if the unprovoked attack was not enough the Police brutalised and arrested scores of protesters in Lagos, Abuja and Calabar.\n“Since the protesters who were arrested during the peaceful rallies did not commit any offence, they have since regained their liberty.\nBut the Police Authorities ought to apologise for violating the fundamental right of the protesters to freedom of expression."
  },
  {
    "headline": "Nigeria's Commanding Officer Of 231 Battalion In Borno Has Unjustly Dismissed 15 Soldiers In 2 Years—Source",
    "summarized_story": "The Commanding Officer of the 231 Battalion, Biu, in Borno State, Lt. Col. M. E. Obi has allegedly unjustly dismissed about 15 soldiers from the Nigerian Army.\nThe source said even though the Nigerian Army has other disciplinary actions to use in correcting errant soldiers, Obi prefers to dismiss soldiers in his battalion.\n“As a commanding officer, he was supposed to call the soldier and inquire why the soldier didn’t want to work with him.\nBut, our commanding officer is not like that.\n“Having been frustrated, the soldier said if he would fire his commanding officer if he continued working with him."
  },
  {
    "headline": "Nigeria's Commanding Officer Of 231 Battalion In Borno Has Unjustly Dismissed 15 Soldiers In 2 Years—Source",
    "summarized_story": "The Commanding Officer of the 231 Battalion, Biu, in Borno State, Lt. Col. M. E. Obi has allegedly unjustly dismissed about 15 soldiers from the Nigerian Army.\nThe source said even though the Nigerian Army has other disciplinary actions to use in correcting errant soldiers, Obi prefers to dismiss soldiers in his battalion.\n“As a commanding officer, he was supposed to call the soldier and inquire why the soldier didn’t want to work with him.\nBut, our commanding officer is not like that.\n“Having been frustrated, the soldier said if he would fire his commanding officer if he continued working with him."
  },
  {
    "headline": "Nigerian Minister, Northern Governor Visit Egypt To Aquire Security Platform For Monitoring People's Calls",
    "summarized_story": "A Nigerian minister and a governor of a northern state recently visited Egypt to get security platforms to monitor people's calls, text messages and other forms of communication.\nThe governor and the minister are both controversial and have also been in the news lately for the wrong reasons.\n\"A minister and a governor went to Egypt this week to get a security platform for monitoring calls of citizens.\nThe internet firewall is a way of having a separate network for the Nigerian Internet that will give the government control over social media platforms such as Twitter and Facebook.\nThe Nigerian government seeks to establish the Nigerian Internet, which it will also control likewise."
  },
  {
    "headline": "Nigerian Minister, Northern Governor Visit Egypt To Aquire Security Platform For Monitoring People's Calls",
    "summarized_story": "A Nigerian minister and a governor of a northern state recently visited Egypt to get security platforms to monitor people's calls, text messages and other forms of communication.\nThe governor and the minister are both controversial and have also been in the news lately for the wrong reasons.\n\"A minister and a governor went to Egypt this week to get a security platform for monitoring calls of citizens.\nThe internet firewall is a way of having a separate network for the Nigerian Internet that will give the government control over social media platforms such as Twitter and Facebook.\nThe Nigerian government seeks to establish the Nigerian Internet, which it will also control likewise."
  },
  {
    "headline": "12 Killed In Herdsmen Attack On Plateau Community",
    "summarized_story": "No fewer than 12 persons were killed on Sunday night by suspected Fulani herdsmen in Kushe community and Kuru District of Jos South Local Government Area of Plateau State.\nIt was gathered that the killing took place around 9:30 pm when suspected Fulani herdsmen stormed the community and shot sporadically at residents.\nAbout three women and nine men were killed while five persons survived the attack with gunshots injuries.\nThe member representing Jos South/Jos East Federal Constituency in the House of Representatives, Dachung Musa Bagos wept when he sighted the corpses littered the community.\n“I, therefore, urge my people to defend themselves because the government has failed in their responsibility of defending the people.”"
  },
  {
    "headline": "Garri N17k, bread N320... Nigerians hit hard as global food prices also hit 10-year high",
    "summarized_story": "A visit by TheCable to some markets in Lagos and Ogun states have shown a greater increase in food prices in the last six months.\nIn its latest monthly price index, the Food and Agriculture Organisation (FAO) said the world food price index increased in May — highest level since 2011.\nIt also noted a jump in vegetable oil index by 7.8 percent in May — lifted by rising palm oil, soya.\nFAO: COUNTRIES LIKE NIGERIA TO FEEL THE IMPACT MOREThe FAO noted that food prices are expected to rise in developed and least developed countries this year on food import cost.\nAccording to the National Bureau of Statistics (NBS), the composite food index rose by 22.72 percent in April 2021 compared to 22.95 percent in March 2021."
  },
  {
    "headline": "Garri N17k, bread N320... Nigerians hit hard as global food prices also hit 10-year high",
    "summarized_story": "A visit by TheCable to some markets in Lagos and Ogun states have shown a greater increase in food prices in the last six months.\nIn its latest monthly price index, the Food and Agriculture Organisation (FAO) said the world food price index increased in May — highest level since 2011.\nIt also noted a jump in vegetable oil index by 7.8 percent in May — lifted by rising palm oil, soya.\nFAO: COUNTRIES LIKE NIGERIA TO FEEL THE IMPACT MOREThe FAO noted that food prices are expected to rise in developed and least developed countries this year on food import cost.\nAccording to the National Bureau of Statistics (NBS), the composite food index rose by 22.72 percent in April 2021 compared to 22.95 percent in March 2021."
  },
  {
    "headline": "Kemi Adeosun reemerges with 'Dash Me Store' -- online thrift-for-charity initiative",
    "summarized_story": "The Dash Me Foundation founded by Kemi Adeosun, former minister of finance, has launched “Dash Me Store”, an online thrift-for-charity initiative.\nAdvertisementThe store, inaugurated on Sunday, was established to mobilise resources for distribution to vulnerable people in society via grassroots charities.\nAdvertisementIn her remarks, Adeosun said the organisation will work closely with charitable organisations in the grassroots to ensure that funds and other materials donated via the Dash Me Store get to actual beneficiaries.\nAdvertisementThe vice-president lauded Adeosun for the initiative which he described as the first of its kind in the country.\nAdvertisement“The idea of this thrift-for-charity store is brilliant and the first of its kind in Nigeria."
  },
  {
    "headline": "Kemi Adeosun reemerges with 'Dash Me Store' -- online thrift-for-charity initiative",
    "summarized_story": "The Dash Me Foundation founded by Kemi Adeosun, former minister of finance, has launched “Dash Me Store”, an online thrift-for-charity initiative.\nAdvertisementThe store, inaugurated on Sunday, was established to mobilise resources for distribution to vulnerable people in society via grassroots charities.\nAdvertisementIn her remarks, Adeosun said the organisation will work closely with charitable organisations in the grassroots to ensure that funds and other materials donated via the Dash Me Store get to actual beneficiaries.\nAdvertisementThe vice-president lauded Adeosun for the initiative which he described as the first of its kind in the country.\nAdvertisement“The idea of this thrift-for-charity store is brilliant and the first of its kind in Nigeria."
  },
  {
    "headline": "After Congo returned 1.3m vaccine doses, hospitals overwhelmed by COVID cases",
    "summarized_story": "President Felix Tshisekedi of the Democratic Republic of Congo (DRC) says hospitals in Kinshasa, the country’s capital, are overwhelmed by COVID infections.\nThe statement by the president comes after the country in April said it would return 1.3 million doses of the AstraZeneca COVID-19 vaccine to COVAX after determining it cannot administer them before they expire in June.\nIn March, Congo received 1.7 million doses of the AstraZeneca COVID-19 vaccine through the COVAX initiative.\nAdvertisement“You know very well that the AstraZeneca vaccine has been and continues to be problematic, both in terms of side effects but also in terms of trust with the population,” Tshisekedi said.\nThe country recorded 439 confirmed COVID-19 cases on Saturday, one of the highest daily tallies since the pandemic began."
  },
  {
    "headline": "The Next Wave: ‘Show me the risks’",
    "summarized_story": "According to KPMG, the 2020/21 top 10 business risks in Nigeria are as follows: regulatory; financial and monetary policy; foreign exchange volatility; cybersecurity; political; technology infrastructure; customer attrition; talent shortage/attrition; business continuity; governance.\nRegulatory risk has become more prominent over time.\nCustomer attrition, cybersecurity and foreign exchange volatility risks are most pressing, while regulatory risk was ranked sixth.\nBut Yoneyama, who has a fresh $18 million to invest across Africa, says “market potential and tenacity of Nigerian founders surpass such risks, so we’ll keep investing.”And why not?\nBut those rewards are for those who, looking at the risks above, still dive in."
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "Why Digital Banking Is The Key To Transforming Nigeria’s Financial Landscape",
    "summarized_story": "Ever since then, it has been a case of innovative solutions, for example, USSD, Online/Web payments, Mobile Money, and then the most disruptive form of banking – Digital Banking.\nIt found that the pandemic has produced consumers for whom digital and mobile banking services have become a necessity.\nIn 2017, it launched ALAT, a full-service digital bank that helps customers access financial services without visiting a physical bank.\nBut will digital banking continue to define Nigeria’s financial landscape?\nThe future of digital banking is already with us, and only apps that catch the buzz and stay innovative will win!"
  },
  {
    "headline": "The New Normal: TalkCounsel Introduces The Gig Economy in The Nigerian Legal Sector",
    "summarized_story": "The legal profession is no exception, with TalkCounsel at the helm redefining the legal experience for countless Nigerians.\nThe inability to do so prompted a decline in legal services requests, which affected the revenue stream for attorneys in Nigeria.\nBy merging the two, quality legal services can be made accessible to the average Nigerian and prospective foreign clients in need of legal services in Nigeria during this challenging time and beyond.\nIn altering the Nigerian legal landscape, TalkCounsel seeks to ensure that Nigeria’s legal digital future is more robust coming out of COVID-19 than it was coming in.\nMoreover, our strategic partnership with partners in North America and Europe will, in turn, boost the income stream for Nigerian lawyers, as well as the nation’s GDP."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "5 platforms to get collateral-free loans for your small business in Nigeria",
    "summarized_story": "As a small business owner, growing your business and meeting your customers’ needs should be your top priorities.\nI hear you, and I’ve received mail from small business owners with the same needs.\nCarbon’s SME loansCarbon’s SME loans is a product that allows you to “grow your small business with affordable, collateral-free loans.” SMEs can access up to ₦1,000,000 without collateral, guarantors, or paperwork.\nFastCreditFastCredit offers business loans to micro, small, and medium enterprises to support business growth.\nLearn more about how to launch, market and grow your business at SME Clinic 2021Are you a small business owner?"
  },
  {
    "headline": "South Africa regulating cryptocurrency, Nigeria’s new International Termination Rates, Toptal sues Andela",
    "summarized_story": "Good day,Today I’m discussing,South Africa regulating cryptocurrencyNigeria’s new International Termination RatesToptal suing AndelaSouth Africa inching closer to regulating cryptocurrencySouth Africa’s Intergovernmental Fintech Working Group (IFWG) has released a position paper calling for the regulation of the country’s cryptocurrency ecosystem.\nSeveral African countries — Nigeria, Ghana, Mauritius, Kenya and South Africa — have been known to take a critical stance in the cryptocurrency arena.\nFor a more in-depth read, Check out South Africa Working Group Releases New Position Paper Calling for Regulation of Crypto Asset ProvidersNigeria’s new International Termination RatesThe Nigerian Communication Commission (NCC) has concluded plans to roll out a new Mobile International Termination Rate (ITR).\nThe Commission has finalised the process of determining the cost-based price of ITR to ensure healthy competition on traffic handling for voice services between local and international operators in Nigeria.\nThey are charges paid to local operators by international operators to terminate calls in Nigeria."
  },
  {
    "headline": "From ballot paper to blockchain ledger, can the tech behind Bitcoin heal Nigeria’s democracy?",
    "summarized_story": "Blockchain technology is often tied to the flagship cryptocurrency — Bitcoin.\nIn a Forbes article, Frank Palermo advocated blockchain voting in the US after an alleged hack of the current voting system in 2016.\nIn May 2018, according to NBC News, West Virginians living abroad were able to send their votes in for a primary election with a blockchain voting system.\ni-Elect is a blockchain voting platform with a use case in Nigeria created by blockchain developer and designer Jerry Ojumah.\nIt also says the growing proposals for blockchain elections is borne out of the enthusiasm to improve and modernise elections."
  },
  {
    "headline": "Nigeria outshines peers as largest real estate investment by country",
    "summarized_story": "An analysis of institutional acquisitions and disposals in real estate investment valued at $1.8 billion across Africa in the past two decades reveals that Nigeria has the largest real estate investments by country.\nThe country has, within this period, attracted $523 million investment into the sector, ranking ahead of Mozambique and Mauritius that were ranked second and third with $268 million and $256 million investment, respectively.\nWhat this means is that opportunities abound in the Nigerian real estate market and savvy investors are not glossing over that.\nThe size/value of real estate opportunity in the country is estimated at $56 billion.\nThe real estate sector in Nigeria is not doing badly despite economic headwinds in the country."
  },
  {
    "headline": "Nigeria’s high political risk puts energy sector on life-support",
    "summarized_story": "From kidnappings and jihadist rebellion by Boko Haram to homicide by notorious “unknown gunmen,” the growing rate of insecurities and increasing political risk under the administration of President Muhammadu Buhari is causing more uncertainties in Nigeria’s energy sector, the economic heartbeat plagued with teething challenges.\nAn active oil and gas sector draws investments and acts…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Policy uncertainty, over-regulation top CEOs’ concerns for Africa growth",
    "summarized_story": "While CEOs in other parts of the world recognized COVID-19 as the top threat to their business growth in 2021, CEOs in Africa say the pandemic and other health crises are the least of their worries.\nCEOs in the world’s second-largest continent are more concerned about the threat from the perennial challenges of policy and…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "138 Rounds Of AK47 Magazines, Guns Stocks In Bag Of Rice Intercepts By Police In Delta – Nigerian Observer",
    "summarized_story": "138 Rounds Of AK47 Magazines, Guns Stocks In Bag Of Rice Intercepts By Police In DeltaShare FacebookTwitterStumbleuponLinkedInPinterestLagos – The Delta State Police Command has discovered 138 rounds of AK47 live ammunition, one AK47 magazine, one Baretta pistol magazine and a knife in a bag of rice along Ughelli – PortHarcourt Road.\nGiving insight on how the exhibits were recovered,Delta State Police Spokesman, DSP Bright Edafe who gave the insight on how the exhibits were recovered said, “at about 4.30 am while team Eagle-net special squad was on routine patrol/stop and search along Ughelli-Porthacourt road,“The team intercepted a Mazda 626 saloon car, dark green in colour with registration number UGH722 AA, with six occupants of two males and four females all occupants were asked to come down from the vehicle for searching”.\n“In the process of searching, a sack containing rice, a man whose name is not yet known among the occupants jumped into a nearby stream running while a hot chase ensued, but all efforts to catch up with him proved abortive as he escaped into the forest.\n“The bag of rice bag identified by other passengers as the runaway man’s own, when search was conducted on the bag, 138 rounds of AK47 live ammunition, one AK47 magazine, one Baretta pistol magazine, and a knife were recovered“Preliminary investigation revealed that the occupants are all passengers that boarded the cab from Eleyele PHC heading to Ughelli, Investigation is ongoing while all effort is being putin place to arrest the fleeing suspect”, he revealed."
  },
  {
    "headline": "Obaseki assures sustained support for people with albinism – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured of continued support for people with albinism in the state, calling for collaboration among stakeholders to end marginalisation and stigmatisation against people with albinism.\nObaseki gave the assurance in commemoration of the International Albinism Awareness Day, marked on June 13, each year.\nHe said: “As the world marks the International Albinism Awareness Day, it is important to stress the need for coordinated efforts among stakeholders in supporting people with albinism and enable them achieve their potential in different life endeavours.\n“Coordinated response is desirable to drive awareness which will lead to attitudinal change towards people with albinism.\nThere is need for awareness and advocacy programmes against myths and false beliefs that encourage marginalisation and stigmatisation, which could endanger the lives of people with albinism.”On the 2021 theme to mark the Albinism Awareness Day “Strength Beyond All Odds,” the governor noted, “My administration will continue to provide support and opportunities that will inspire persons with albinism to contribute to the growth and development of Edo State in their chosen fields of endeavours despite their peculiar needs.”He noted that the state government will prioritise implementation of policies and programmes that encourage social inclusion for vulnerable persons including people with albinism, noting, “My administration will prioritise the implementation of reforms to check discrimination against people with albinism and encourage them to deploy their potentials to contribute to the growth and development of the state.”The United Nations General Assembly in 2014, adopted a Resolution proclaiming, with effect from 2015, 13 June as International Albinism Awareness Day."
  },
  {
    "headline": "COVID-19: Edo intensifies second dose vaccination, insists on use of facemasks, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the vaccination of eligible persons in the state with the second dose of the Oxford-AstraZeneca coronavirus vaccine, as part of efforts to contain the pandemic and ensure the safety of citizens.\nObi said the second dose vaccination exercise, which commenced on June 01, 2020 will last for 40 days, urging those who took the first dose to make themselves available for the booster dose meant to provide full protection against the virus.\n“While the second dose vaccination continues across all communities to inoculate eligible persons with the booster dose, we have noticed a high disregard to guidelines to contain the pandemic, especially the compulsory use of facemasks in public places.\n“We urge everyone to support the government’s efforts at containing the pandemic by complying with preventive protocols to curtail the spread of the virus.\nWe must continue to wear our facemasks when in public; wash your hands regularly under running water, use alcohol-based hand sanitizers and observe social distancing.”..."
  },
  {
    "headline": "Obaseki, Shaibu visit injured Bendel Insurance players attacked at match with Remo Stars …insist on punishment for perpetrators – Nigerian Observer",
    "summarized_story": "Osaigbovo Iyoha, at the weekend, visited injured Bendel Insurance Football Club Players at the Central Hospital, Benin City.\nObaseki expressed shock that the Nigeria Football Federation (NFF) was yet to sanction those that perpetrated the dastardly act.\nLook at the way Bendel Insurance Players were wounded because they went to play in a league match with Remo Football Club in Ogun State.\nOur players are covered by our insurance scheme in the State.”On his part, Permanent Secretary, Edo State Hospital Management Board, Dr. Izielen Asogun, said Bendel Insurance Football Club Players were attacked on Sunday 6th of June 2021, when they went to play a league game with Remo football Club in Ogun State.\n“Our players were freely attacked and wounded as the security could not check the attack; it was a mob action."
  },
  {
    "headline": "JOB SCAM (2): How fly-by-night firms fleece unemployed graduates, lure them into ‘marketing’",
    "summarized_story": "Since this reporter did not get the invitation directly, he was advised to “gate-crash” ––a popular catchphrase among job seekers, which implores one to attend a job interview even when uninvited for such–– but declined.\nMany desperate job seekers do ‘gate-crash’ quite often, and a few lucky ones get picked for job opportunities.\nMeanwhile, further checks by PREMIUM TIMES showed that Primix Consult has no digital footprint whatsoever.\n“Many unsuspecting job seekers are likely to fall victim to the antics of the same fraudulent recruitment firm more than once,” he said.\nPREMIUM TIMES’ findings revealed that they recruit young unemployed people and convince them to become distributors who would then purchase the products on discounted rates."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Tanzanian president urges African nations to adopt cryptocurrencies",
    "summarized_story": "Samia Suluhu Hassan, president of Tanzania, has urged African countries to consider adopting cryptocurrencies, noting that while African citizens have been using crypto assets for P2P transactions, the nations are yet to fully adopt other greater possibilities.\nShe told the Bank of Tanzania on Sunday to be vigilant amid a rising interest and adoption of cryptocurrencies around the globe.\n“I know that many countries around the world have not accepted or started using digital currencies.\nHowever, I call upon the Bank of Tanzania to start looking into these developments just to be prepared,” she said.\nPanama and Paraguay have begun hinting at possibly adopting Bitcoin and cryptos as well."
  },
  {
    "headline": "Osun 2022: Our focus is to keep APC’s flag flying high – Opomulero Osun",
    "summarized_story": "By Sunday Oguntuyi, OsogboA sociopolitical group in Osun APC, Opomulero, has said its mandate is to keep the flag of the party in the state flying high.\nThe group said this while paying courtesy visit to the former Governor of Osun State and Interim National Chairman of All Progressives Congress (APC) Chief Adebisi Akande in his Ila Orangun country home on Sunday.\nAccording to the chairman of the group, Rt Hon.\nHe said the membership of the group covers all the local governments in the state.\nIn his response, Chief Adebisi Akande commended members of the team for rising up to be counted in the effort to strengthen and reposition the APC in Osun State."
  },
  {
    "headline": "T. B Joshua’s death sparks cries of woes",
    "summarized_story": "Prophet Joshua, it would be recalled, died in the early morning of Sunday, June 6th 2021 after falling ill during a church service.\nBH reliably gathered that the late prophet bought and installed most of the electrical transformers around Ikotun-Egbe, Egbeda, Idimu and environs.\nIt is not only in Lagos that the impacts of the late prophet was felt.\nThe four local governments are Akoko South-West (Oka), Akoko North-East (Ikare), Akoko South-East (Isua) and Akoko North-West (Oke Agbe).\nThe traditional ruler of Arigidi Akoko, Oba Yisa Olanipekun; lamented that all the plans the late prophet had for Akokoland are now all gone."
  },
  {
    "headline": "S/East and the ominous orgy of violence",
    "summarized_story": "So when suddenly the police command and the Correctional centre were attacked, followed by frequent killings of policemen and other security agents, there was immediate cause for concern.\nWho are those killing security agents?\nIs there a nexus between his killing and the violence in the region?\nMeanwhile, the region has been on lockdown as attacks on security agents spiraled.\nAlthough no situation could justify violence, yet it makes secessionist agitations attractive, which is the excuse being used by government to militarize the region."
  },
  {
    "headline": "June 12: Issa Aremu Hails Buhari’s Statesmanship Stance",
    "summarized_story": "He said Pesident Buhari’s decision made the point that never again would Nigerians allow violation of peoples’ mandate through annulment and non- democratic usurpation of power.\nAremu added that with six democratic transitional elections since 1999, Nigeria is now a democracy destination in Africa.\nThe frontline labour activist said June 12 celebration has assumed special importance as it marks 22nd anniversary of uninterrupted democratic process in the country.\nAremu expressed the preparedness of MINILS to complement the efforts of President Buhari in delivering good governance in the context of insecurity and economic crisis.\nADVERTISEMENT“MINILS agrees with President Buhari in his Democracy speech that ‘the twin underlying drivers of insecurity namely poverty and youth unemployment’."
  },
  {
    "headline": "June 12: Issa Aremu Hails Buhari’s Statesmanship Stance",
    "summarized_story": "He said Pesident Buhari’s decision made the point that never again would Nigerians allow violation of peoples’ mandate through annulment and non- democratic usurpation of power.\nAremu added that with six democratic transitional elections since 1999, Nigeria is now a democracy destination in Africa.\nThe frontline labour activist said June 12 celebration has assumed special importance as it marks 22nd anniversary of uninterrupted democratic process in the country.\nAremu expressed the preparedness of MINILS to complement the efforts of President Buhari in delivering good governance in the context of insecurity and economic crisis.\nADVERTISEMENT“MINILS agrees with President Buhari in his Democracy speech that ‘the twin underlying drivers of insecurity namely poverty and youth unemployment’."
  },
  {
    "headline": "Surrender Now, Army Tells Boko Haram/ISWAP Terrorists",
    "summarized_story": "The Nigerian Army has called on Boko Haram/ISWAP terrorists to put down their weapons and embrace peace, saying an end to the war was in sight.\nAdvertisementsThe General Officer Commanding (GOC), 7 Division, Nigerian Army, Brigadier General Abdulwahad Eyitayo, made the call at a party organised for journalists by the Army on Sunday in Maiduguri.\nEyitayo, who is also the Sector 1 Commander, Operation Hadin Kai, said the recent military attack on the insurgents dealt a decisive blow to the terrorists, leaving their remnants in disarray.\nEyitayo said, “We are not here for bloodletting, no one is happy that people are dying.\nIt is to appreciate the media for the positive reporting.”In his remarks, Mohammed Ibrahim, secretary of the Nigerian Union of Journalists (NUJ), Borno State Council, commended the Nigerian Army for appreciating the media and assured it of more support and cooperation."
  },
  {
    "headline": "Surrender Now, Army Tells Boko Haram/ISWAP Terrorists",
    "summarized_story": "The Nigerian Army has called on Boko Haram/ISWAP terrorists to put down their weapons and embrace peace, saying an end to the war was in sight.\nAdvertisementsThe General Officer Commanding (GOC), 7 Division, Nigerian Army, Brigadier General Abdulwahad Eyitayo, made the call at a party organised for journalists by the Army on Sunday in Maiduguri.\nEyitayo, who is also the Sector 1 Commander, Operation Hadin Kai, said the recent military attack on the insurgents dealt a decisive blow to the terrorists, leaving their remnants in disarray.\nEyitayo said, “We are not here for bloodletting, no one is happy that people are dying.\nIt is to appreciate the media for the positive reporting.”In his remarks, Mohammed Ibrahim, secretary of the Nigerian Union of Journalists (NUJ), Borno State Council, commended the Nigerian Army for appreciating the media and assured it of more support and cooperation."
  },
  {
    "headline": "No Soldier Was Killed In Abia, Says Army",
    "summarized_story": "The Nigerian Army has said no soldier was in killed in Ohafia local government area of Abia State and that soldiers were not vengeance mission contrary to social media reports.\nAdvertisementsThe director, Army Public Relations, Brig.\nGen. Mohammed Yerima, said the troops carried out routine operations in the State in line with rules of engagement.\nHe stated this while reacting to a report alleging clash between soldiers and members of Eastern Security Network (ESN).\n“The attention of the Nigerian Army has been drawn to a story making rounds in the social media that troops are on vengeance mission in some communities in Abia State following the death of six soldiers in a clash with ESN/IPOB terrorists."
  },
  {
    "headline": "A new tribe has emerged: We are now Northern Igbos- Igbos in Northern Nigeria",
    "summarized_story": "Nasir El-Rufai, the governor of Kaduna state, met with the Igbo Delegate Assembly, which is made up of Igbo leaders from the 19 northern states and the Federal Capital Territory, at Government House in Abuja on Tuesday.\nThe South East leaders said the courtesy visit was to express gratitude to the Federal Government, Kaduna State Government, and the Northern Governors Forum for cooling the situation after a group of Northern Youths handed Igbos an ultimatum to leave the North.\nThe Igbo leaders have said unequivocally that they oppose Nigeria’s split.\nOn behalf of the Northern Governors, Governor El-Rufai assured the Igbo Leaders that everyone in the North is safe.\nThey also urged the government to enable the southeast to secede peacefully and resurrect the long-abandoned Republic of Biafra."
  },
  {
    "headline": "Pastor Bakare: Nigeria’s 1999 constitution a fraud, military imposition",
    "summarized_story": "The Serving Overseer of the Citadel Global Community Church, Pastor Tunde Bakare, has described Nigeria’s 1999 constitution as a fraud.\nBakare said the 1999 constitution is inconsistent and a military imposition.\nBakare said the 1999 constitution should be replaced with a new one put together by Nigerians.\nIt’s a military imposed constitution.”READ ALSO: DashMe: Osinbajo praises NYSC certificate forger Kemi AdeosunThe National Assembly has been conducting a constitutional review with town hall meetings across the country.\nBuhari had made the remark while throwing his weight behind restructuring which he said was a constitutional matter for the National Assembly to handle."
  },
  {
    "headline": "MURIC: Compares Buhari to Jesus and claims that June 12 protesters are ungrateful after being ‘healed’",
    "summarized_story": "The Muslim Rights Concern (MURIC), an Islamic human rights organization, has claimed that the June 12 demonstrators were ungrateful to President Muhammadu Buhari after he acknowledged June 12 in the same way as nine lepers were ungrateful to Jesus Christ.\nThe South-West area was also chastised for participating in the June 12 protest against President Muhammadu Buhari’s administration, according to the group.\nNigerians in many regions of the country, mainly in the south-west, held demonstrations on June 12 to commemorate Democracy Day.\n“It was a northerner, a Fulani, President Muhammadu Buhari, who eventually proclaimed June 12 as Nigeria’s Democracy Day.\n“MURIC calls on President Muhammadu Buhari to ignore those who are ungrateful to him."
  },
  {
    "headline": "DashMe: Osinbajo praises NYSC certificate forger Kemi Adeosun",
    "summarized_story": "Vice President Yemi Osinbajo has praised NYSC certificate forger Kemi Adeosun, Nigeria’s ex-finance minister, for her DashMe initiative.\nMs Adeosun resigned and fled to the UK after she was found out for using a fake NYSC exemption certificate to secure jobs in Nigeria and a political appointment in President Muhammadu Buhari’s regime.\nThough she committed a crime, Mr Buhari and the country’s security agencies turned a blind eye and Ms Adeosun fled to the UK.\nREAD ALSO: Family gives date for T.B Joshua’s burialOn Sunday, notwithstanding her criminal record, Mr Osinbajo praised Ms Adeosun for helping orphans, vulnerable children, and less privileged people at the inauguration of DashMe Store, an online component of Dashme Foundation.\n“This is why as a minister, she prioritised the social investment programme when for the first time, we voted almost N500 billion of our annual budget to welfare programmes for the poor,” said Mr Osinbajo."
  },
  {
    "headline": "Bauchi cholera death toll reaches 37",
    "summarized_story": "Seventeen more deaths have been recorded in Bauchi State since the first outbreak was announced by the Ministry of Health.\nHowever, the Executive Chairman, Bauchi State Primary Healthcare Development Agency, Dr Rilwan Mohammed, in a cholera data sent to our correspondent, said that the disease had spread to 15 local government areas of the state from the initial nine.\nHe listed that the affected LGAs as Ganjuwa, Dass, Bauchi, Giade, Jama’are, Darazo, Misau, Ningi and Shira, Warji, Zaki, Alkaleri, Tafawa Balewa, Shira and Kirfi.\nMohammed said Bauchi LGA was worst hit with 1,334 cases and 18 deaths while Toro had 165 cases, Ningi 91 cases and Dass 60 cases with four, three and two deaths respectively.\nHe added that Misau LGA recorded 44 cases with four deaths, while Tafawa Balewa LGA recorded 41 cases also with four deaths."
  },
  {
    "headline": "Bauchi cholera death toll reaches 37",
    "summarized_story": "Seventeen more deaths have been recorded in Bauchi State since the first outbreak was announced by the Ministry of Health.\nHowever, the Executive Chairman, Bauchi State Primary Healthcare Development Agency, Dr Rilwan Mohammed, in a cholera data sent to our correspondent, said that the disease had spread to 15 local government areas of the state from the initial nine.\nHe listed that the affected LGAs as Ganjuwa, Dass, Bauchi, Giade, Jama’are, Darazo, Misau, Ningi and Shira, Warji, Zaki, Alkaleri, Tafawa Balewa, Shira and Kirfi.\nMohammed said Bauchi LGA was worst hit with 1,334 cases and 18 deaths while Toro had 165 cases, Ningi 91 cases and Dass 60 cases with four, three and two deaths respectively.\nHe added that Misau LGA recorded 44 cases with four deaths, while Tafawa Balewa LGA recorded 41 cases also with four deaths."
  },
  {
    "headline": "June 12: Govt considers pension for MKO’s next of kin, Kingibe",
    "summarized_story": "Wives of the late Chief MKO Abiola, winner of the June 12 1993 presidential election, are likely to be put on pension, highly-placed government source said at the weekend.\nAlso to benefit from the plan is Bashorun Abiola’s running mate in the historic election, Ambassador Babagana Kingibe.\nKingibe was awarded the second national honour, The Grand Commander of the Order of the Niger (GCON).\nAt the weekend, Kola, the late Abiola first son, said the democracy we are practicing is not what his father died for.\n“Those (past heads of state) who are living get their entitlement and when they are dead, their next of kin get certain benefits from the government."
  },
  {
    "headline": "June 12: Govt considers pension for MKO’s next of kin, Kingibe",
    "summarized_story": "Wives of the late Chief MKO Abiola, winner of the June 12 1993 presidential election, are likely to be put on pension, highly-placed government source said at the weekend.\nAlso to benefit from the plan is Bashorun Abiola’s running mate in the historic election, Ambassador Babagana Kingibe.\nKingibe was awarded the second national honour, The Grand Commander of the Order of the Niger (GCON).\nAt the weekend, Kola, the late Abiola first son, said the democracy we are practicing is not what his father died for.\n“Those (past heads of state) who are living get their entitlement and when they are dead, their next of kin get certain benefits from the government."
  },
  {
    "headline": "Gunmen move from house-to-house in Plateau, kill 12",
    "summarized_story": "By Polycarp Auta/NANGunmen killed 12 persons and injured five others in the Kushe community, Kuru District of Jos South Local Government of Plateau on Sunday.\nConfirming the incident, Da Patrick Mandung, the District Head of Kuru, said the incident occurred on Sunday night.\nMandung, who described the incident as unfortunate, called on governments and security agencies to intensify efforts at securing the people.\n“This is a very unfortunate situation; that 12 persons were murdered in cold blood for no reason.\nBagos, who visited the scene on described the incident as “sad and unfortunate’’."
  },
  {
    "headline": "2023 presidency: Crowd hits Abuja streets for Tinubu",
    "summarized_story": "A group that calls itself “Disciples of Jagaban” flooded the streets of the Federal Capital Territory on Sunday to campaign for Bola Ahmed Tinubu.\nMembers were seen, with colourful pictures of Tinubu and campaign posters, at areas which include highbrow Maitama District, the Central Business District.\nSome of the posters carried inscriptions such as “TinubuNe”, “Happy Democracy Day, Tinubu Advocates Group,” “Jagaban Nigeria” among others.\nWe need somebody that will continue and consolidate the achievements President Buhari is making.\nWe need somebody that knows the house, and that is Bola Tinubu.”"
  },
  {
    "headline": "Ortom to Buhari: No grazing routes in Benue",
    "summarized_story": "Agency ReportsBenue State Governor Samuel Ortom has debunked President Muhammadu Buhari’s statement asking his attorney general to reopen all grazing routes as gazetted in the past.\nBut Ortom said there is no grazing reserves or cattle routes in Benue State to be opened.\n“Grazing reserves are not in the Constitution.\nThere is anti-open grazing law in Benue State and anyone who contravenes it would be arrested and prosecuted”, he said.\nHe advised the people of Benue State to use legal means and defend themselves as they have cried enough."
  },
  {
    "headline": "Zamfara Police Repel Bandits’ Attack, Kill Scores",
    "summarized_story": "The operatives of Zamfara State police command have foiled an armed attack on Dogon Large community of Bakura Local Government Area of Zamfara State.\nThe operation, which took place on Sunday along Gusau-Sokoto road, resulted to the killing of many bandits who engaged the police for about four hours.\nShehu further stated that the corpses of the bandits killed have been properly taken care of by the police command.\nHe disclosed that the road was now cleared for motorists and other road users with rigorous confidence-building patrol being intensified to avert hitches.\n“Tactical operatives, including special forces personnel are still combing the surrounding forests to ensure that the fleeing bandits were either arrested or killed,” he said."
  },
  {
    "headline": "If Buhari Doesn’t Change His Ways, He Will Be Removed From Office — Apostle Okikijesu",
    "summarized_story": "Apostle Paul Okikijesu, Senior Pastor of the Christ Apostolic Miracle Ministry, says President Muhammadu Buhari would not complete his term unless he changes his ways.\n“Thus says the Lord: If the President refuses to quickly make amendments during this period, I will change hands concerning his government, says the Lord God of hosts,” Okikijesu said.\nSpeaking further, the cleric said that the activities of the Presidents of Nigeria, Ivory Coast and Ghana do not please God.\n“Thus says the Lord: If these leaders refuse to take steps of rectification, My judgment will come upon them mightily.\nIf they refuse to take all these steps, then, they will be removed from office, and their positions will be given to their neighbours who are better than them."
  },
  {
    "headline": "2023 Presidency: Despite Denials, Tinubu’s Posters Flood Abuja Again",
    "summarized_story": "Despite sustained disapproval and denials from his camp, the posters of former Lagos State governor, Bola Ahmed Tinubu for the next presidential race have again surfaced in Abuja.\nThe posters have since flooded prominent areas within the Federal Capital Territory of Abuja: Garki, Central Area, Maitama and Wuse 11.\nBut one of his loyalists and serving member of the House of Representatives, representing Ikeja Federal Constituency, Abiodun James Faleke, has been linked with sprawling offices in Abuja aimed at promoting the Bola Tinubu 2023 Presidency.\n“We are supporting Tinubu and calling on him, begging him, inviting him to contest the 2023 presidential election for the benefit of Nigeria and Nigerians.\nWe are out for the Tinubu 2023 project because we love Nigeria and we believe in the progress of this country."
  },
  {
    "headline": "Gunmen Kidnap Eight Family Members In Kaduna",
    "summarized_story": "A family of eight, as well as a few other residents in Zaria’s Kofar Gayan neighborhood, has been kidnapped by gunmen.\nThe raid came just two days after eight students and two teachers at Zaria’s Nuhu Bamalli Polytechnic were kidnapped.\nAccording to NAN, the incident occurred at about 12am on Saturday night around Government Girls Secondary School, Kofar Gayan area of the state.\nShe added that the bandits, who were about seven in number and carrying guns and marchets, took away eight members of her family, including her parents and siblings.\nKusfa, however, said her parents, as well as some of the kidnapped victims, were later released through the efforts of security men who intercepted the hoodlums."
  },
  {
    "headline": "Pictures: PDP governors meet in Uyo over National issues",
    "summarized_story": "PreviousNo rift between Wike and I – Secondus"
  },
  {
    "headline": "Gunmen invade church, kidnap woman, Rev Sister",
    "summarized_story": "The spate of insecurity in Imo state worsened at the weekend when two women, including a Reverend Sister, were Sunday morning kidnapped at various points across the state.\nAt one of the scenes, a reverend sister was abducted at Dim na Nume, Isu in Nwangele local government area of the state, just moments after a kidnap incident took place at Ohii.\nThe yet-to-be identified Reverend Sister; Blueprint gathered, was driving when her captors dashed into the middle of the road and halted her car.\nThere was some level of confusion as Orogwe Archdeaconry youth holding their camp/conference at the church premises, ran in different directions for safety.\nIt was gathered that his captors, who wielded guns, had contacted the Olodan family and demanded a N30million ransom."
  },
  {
    "headline": "Ndume to Buhari: Don’t spend foreign loans on salaries, overhead",
    "summarized_story": "Chairman Senate Committee on Army Ali Ndume has counselled the Muhammadu Buhari-led administration against using foreign loans to finance recurrent expenditure like salaries and overhead.\nNdume warnsSounding some warning, however, the former Senate Leader, Senator Ndume said, there was absolutely nothing wrong with a country taking foreign loans but that such should be spent to boost agriculture and the revival o moribund industries.\nNdume also said the loans meant to provide infrastructure should be obtained from international lending agencies with favourable terms.\n“The concentration on infrastructural development by the Buhari administration, especially in the area of railway and road infrastructure is commendable.\nThe lawmaker commended the Buhari administration for the move to fund the nation’s security and military services for the purpose of tackling insecurity."
  },
  {
    "headline": "Democracy: NABTEB reschedules two subjects due to public holiday -NigPilot",
    "summarized_story": "rescheduling of two papers, Chemistry and Literature in English in the upcoming 2021 NBC/NTC Examinations earlier fixed forMonday, (Today),14th June, 2021.\nThis is due to the declaration of Monday, 14th June as publicholiday by the Federal Government to mark this year’s Democracy Day.\nThe Registrar/Chief Executive, NABTEB, Professor (Mrs.) Ifeoma Isiugo-Abanihe, whomade the announcement at the weekend, said the affected papers will now holdon Saturday, 26th June, 2021.\nShe said all NABTEB State and Zonal Coordinators have been directed to inform allsupervisors, proprietors and stakeholders in their States and Zones, respectively.\nIn a related development, it was"
  },
  {
    "headline": "Democracy Day: Bayelsa youths urged to explore modern technology -NigPilot",
    "summarized_story": "Bayelsa youths have urged to explore the opportunities accrued to modern communication and technology to enrich their lives, and avoid acts capable of ruining their future.\nHe appealed to the youths to go for ICT development training to aquire more knowledge, for the purpose of their future.\nIn his address, the Vice Chancellor Medical University, Prof. Ebitimitula Etebu, said no society can develop without the involvement of the youths.\nHe said that the Bayelsa Government, has established a medical university to train the youths in the medical field.\n“Bayelsa youths should dedicate their minds to science and technology as the way forward, that will enable them become useful to the society."
  },
  {
    "headline": "Oyegun to Buhari: Don’t wait till agitations for restructuring becomes threat to national unity -NigPilot",
    "summarized_story": "Former governor of Edo State and One-time National Chairman of the All Progressives Congress, APC, John Odigie Oyegun, has warned President Muhammadu Buhari and the leadership of the ruling party not to wait till agitations from different sections of the country on restructuring snowball into a threat to national unity before addressing them.\n“It is vital that it is in fact, mandatory in the interest of the survival of our nation, that these issues be addressed.\nLukman, said APC leaders have been working to address some of the foundational issues of democracy and that the book “is a contribution to support initiatives of our leaders.\nLike President Muhammadu Buhari himself has acknowledged, there are no doubt challenges facing the country, but no administration since 1999 has succeeded in completing projects, whether initiated by previous or current governments.\n“Just on Thursday, June 10, 2021, President Buhari commissioned the Lagos – Ibadan railway, a project started and completed by his administration."
  },
  {
    "headline": "STAKEHOLDERS CANVASS FOR MORE PARTICIPATION OF DIASPORANS IN DEMOCRATIC PROCESS -NigPilot",
    "summarized_story": "A cross-section of stakeholders across the globe has canvassed for more inclusion and participation of Nigerians in the Diaspora in the democratic process in Nigeria.\nArkwright, who was one of the panelists, however, listed four areas of improvement to include an increase in representation of women and youth in the democratic process in Nigeria., reduction in take-home pay of National Assembly and Political office holders, reduction in the influence of money in Politics and adequate representation of all ethnic groups, especially the minority groups in the electoral and democratic process.\nCommending the role of NIDCOM so far, the envoy emphasised the role of the Nigerians in the Diaspora and their contributions to national development, stresing that they must be involved in the democratic process.\nShe echoed the need for diaspora voting, adding that the issue was exhaustively tabled at the recent Public hearing on Constitutional amendment.\nMr Bayo Adedosu, a resident in Canada, stressed the need for Nigerians to show patriotism, while calling on leaders to be accountable."
  },
  {
    "headline": "Gunmen Kill 12, Injure Five Locals In Plateau Attack",
    "summarized_story": "Gunmen suspected to be herdsmen have killed 12 people in an attack on Kuru community in Jos South Local Government Area of Plateau State.\nNo fewer than five other locals were injured during the incident, eyewitnesses told Channels Television on Monday morning during a visit to the scene of the attack.\nPolice authorities in Plateau have confirmed the incident, but they gave a lesser number of those killed by the gunmen.\nMr Musa Bagos, the lawmaker representing Jos South/ Jos East Federal Constituency in the House of Representatives, was among those who visited the community where residents narrated their ordeal in the unprovoked attack.\nThe Management Committee Chairman of Jos South LGA, Gideon Davou, who was also at the scene, appealed to the residents to allow the security agencies to carry out a proper investigation into the incident."
  },
  {
    "headline": "70 Civil Groups Ask FG To Reverse Twitter Ban, Withdraw Prosecution Threat",
    "summarized_story": "Civil society organisations numbering 70 have called on the Federal Government to reverse the ban placed on Twitter and withdraw the threat to prosecute anyone using the app in the country.\n“We strongly condemn the arbitrary and unlawful suspension of Twitter in Nigeria, by the authorities, and the resulting restrictions on the human rights of people, as well as the threat to prosecute anyone using Twitter in Nigeria.\nThe groups also condemn the “directive” issued by the Nigerian Broadcasting Commission (NBC) for all broadcast stations to deactivate their Twitter accounts.\nAccording to the groups, Social media platforms have helped Nigerians to receive information, impart the same, hold useful conversations, and hold the Nigerian authorities to account.\nA clear example is how social media was used to drive police accountability in the #EndSARs protests last year."
  },
  {
    "headline": "EU Congratulates New Israeli Prime Minister Bennett",
    "summarized_story": "EU Council President Charles Michel congratulated the new Israeli Prime Minister Naftali Bennett in a message posted on Twitter on Sunday after an alliance of parties ousted Benjamin Netanyahu.\nBennett, a right-wing Jewish nationalist, and former tech millionaire takes over at the helm of an Israeli government pieced together by an eight-party coalition.\nBennett, a former defence minister under Netanyahu, vowed to keep Israel safe from Iran, promising that “Israel won’t let Iran have nuclear weapons”, a goal the Islamic republic denies pursuing.\nREAD ALSO: Netanyahu Ousted As Israel Approves New GovtThe diverse anti-Netanyahu bloc was cobbled together by the secular centrist Yair Lapid, a former TV presenter.\nIt spans the political spectrum, with three right-wing, two centrists, and two left-wing parties, and even an Arab Islamic conservative party."
  },
  {
    "headline": "JAMB Asks Applicants To Complete UTME Registration By Tuesday",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has called on applicants who have been cleared to complete their registration for the 2021 Unified Tertiary Matriculation Examination (UTME) by Tuesday.\nHe noted that JAMB had extended the registration period by another two weeks up to May 29 after the period originally scheduled for 2021/2022 UTME/DE registration lapsed on May 15.\n“The candidates who have not registered but have secured the profile codes and initiated the registration process are expected to visit specially designated registration centres to complete the registration on Tuesday, June 15, 2021,” Benjamin said.\nAccording to him, only candidates who have secured their profile codes are expected to visit the centres.\n“Each candidate posted to any non-JAMB-owned CBT centre is expected to pay the registration fee of N1,000 to such CBT centre,” he said."
  },
  {
    "headline": "Allegation Of Vengeance Mission In Abia Is Baseless – Army",
    "summarized_story": "The Nigerian Army (NA) has denied a claim that troops are on a vengeance mission in some communities in Abia State.\nIn a statement on Monday, the Director of Army Public Relations, Brigadier General Mohammed Yerima, also faulted an allegation that six soldiers were killed.\nHe noted that the army was aware of a report trending on social media that the soldiers were killed in a clash with members of the Eastern Security Network (ESN)/ Indigenous People of Biafra (IPOB).\nThe report, according to Yerima, alleged that as a result, residents of Elu, Amangwu, and Amaekpu in Ohafia Local Government Area of the state embarked on mass exodus out of fear.\n“The NA wishes to debunk the allegation as a baseless fabrication aimed at not only tarnishing the good image of the NA but to create distrust between the public and security agents in the state,” he said."
  },
  {
    "headline": "Police arrest woman for selling two daughters for N300,000 in Ogun State",
    "summarized_story": "A 35-year-old woman from Ogun State, identified as Blessing Ebuneku Agoro, has been arrested for selling her two biological daughters, Semilore Agoro (4 years) and Deborah Agoro (2 years) for N300,000.\nThe lady allegedly sold the children without her husband’s knowledge, according to Oluwaseyi Agoro, who reported the incident to the police.\n“She sold the two daughters to the couple at the rate of 300,000,” Oyeyemi said.\nOgun Commissioner of Police, Edward Ajogun, directed that the suspects be sent to the state CIID’s anti-human trafficking and child labor section.\nHe also stated that the sold girls must be recovered and returned to their parents as soon as feasible."
  },
  {
    "headline": "Gov Yahaya Bello congratulates ace Journalist, Sam Omatseye at 60",
    "summarized_story": "The governor of Kogi State, Yahaya Bello has congratulated renowned Journalist, poet, novelist and playwright, Mr. Sam Oritsetimeyin Omatseye, on the occasion of his 60th birthday anniversary.\nGovernor Bello in a press statement signed on Monday by his Chief Press Secretary described the celebrator, who is also the Chairman Editorial Board of the Nation Newspaper as a thoroughbred among the journalism practice who has overtime carved a niche for himself as one worthy of emulation.\nHe noted that Sam Omatseye was an household name in the profession and other areas of creative writing particularly his avalanche of critical opinions through his columns and other platforms on topical issues of International, National as well as regional concerns.\nThe Governor alluded that his critical and nationalistic opinions among other things were significant contributions to Nation growth and development as the celebrant was a well respected opinion molder in the country.\nHe noted that the Delta born journalist and media administrator had also mentored an array of younger practitioners while he engages in the academic venture both within and outside the country noting that his wealth of experience within his field was enormous and many have tapped from such in the decades of his professional sojournAdvertisementWhile praying for the celebrant to continue to grow in good health and wealth, the Governor implored him not to relent in contributing positively to National discuss with the ultimate desire of a better, greater and prosperous Nigeria."
  },
  {
    "headline": "Odigie-Oyegun charges FG on agitations as Bagudu makes case for expanded budget at book launch",
    "summarized_story": "He said: “Let me refer to just one aspect of what the governor (Bagudu) said.\nAdvertisementThe former Edo State governor, however, commended the President Muhammadu Buhari APC-led administration, saying if Nigerians could look wider, they would see that the incumbent administration had done a lot.\nBagudu added that the Governor Nasir el-Rufai Committee Report on True Federalism could help produce an amended constitution for Nigeria.\nBagudu said: “When one compares it (Nigerian budget) with the United States, a country with 331 million people, you find that in 2019, the United States federal budget was over $3.5 trillion and 1 per cent of $3.5 trillion is $35 billion.\n‘’That means our budget is less than 1 per cent of the United States budget and yet, we are looking after a population that is about 70 per cent of the United States population."
  },
  {
    "headline": "China to Launch First Human Spaceflight Since 2016",
    "summarized_story": "Shenzhou-12, meaning “Divine Vessel”, will be the third of 11 missions needed to complete China’s space station by 2022.\nAmong them, four will be missions with people on board, potentially propelling up to 12 Chinese astronauts into space – more than the 11 men and women that China has sent since 2003.\nChina Manned Space did not respond to a Reuters news agency fax request for comment.\nWhile no women are scheduled for the Shenzhou-12 mission, they are expected to participate in every following mission, Yang told the Global Times.\nChina began building its space station in April with the launch of Tianhe, the first and largest of its three modules."
  },
  {
    "headline": "Myanmar’s Detained Aung San Suu Kyi to Face Court",
    "summarized_story": "There is a sense of finality about this showdown between Aung San Suu Kyi, and army chief and coup leader, Min Aung Hlaing.\nAung San Suu Kyi’s education and international recognition was also a source of admiration for many of her followers.\nIt was not just during the Rohingya crisis where Aung San Suu Kyi failed to live up to expectations.\nFor the Supreme Court case, he said the court marked Aung San Suu Kyi down as defending herself, something Khin Maung Zaw said was done “without her knowledge and consent”.\nGiven the nature of the trials, Thinzar Shunlei Yi has encouraged Aung San Suu Kyi to “join CDM” by “boycotting the judicial system”."
  },
  {
    "headline": "CNN: Twitter Needs India and Nigeria to Grow. It’s Running into Trouble in Both",
    "summarized_story": "The restrictions in India and the ban in Nigeria are troublesome for Twitter.\n“You may see more calls for banning Twitter in India, if it continues to defy the government,” Pahwa told CNN Business.\nThe social media company blasted the move as “intimidation tactics” and said that it was “concerned” about the safety its employees in the country.\nIndia’s new rules for social media have only intensified the chill.\n“Most social media majors spend the largest share of their operational bandwidth on developed markets."
  },
  {
    "headline": "With Military Victory Elusive, West African Nations Quietly Back Talks with Islamists",
    "summarized_story": "Hundreds of soldiers have been killed since militants first seized control of swathes of Mali in 2012.\nNow, in the worst-hit parts of Burkina Faso and neighbouring Mali, local leaders are pursuing unofficial talks with militants.\nThe governments do not publicly acknowledge the discussions, but five sources involved in them told Reuters the authorities have been quietly supportive.\n“The jihadists came with lots of weapons.”They met seven times before both sides agreed to more formal talks.\nMali’s leaders have publicly endorsed the idea of talks, but they have kept concrete moves to pursue negotiations quiet."
  },
  {
    "headline": "Nigeria Transport Minister Amaechi on Impact of Proposed Deep Blue Project – Arise News",
    "summarized_story": "The Nigerian government recently flagged off the Deep Blue project aimed at providing comprehensive monitoring of the country’s exclusive economic zone.\nRotimi Amaechi, the country’s Minister for Transportation while appearing on ARISE News on Monday said privately-owned security companies prior to 2015 were contracted to provide security for oil companies in the water which appeared to be very challenging financially.\nHe told ARISE News that the project will enable both the protection of Nigeria from illegal activities and piracy and the protection of the country’s natural resources and assets.\nWatch the interview."
  }
]