[
  {
    "headline": "Labour induction poses risk of maternal, neonatal deaths, Gynaecologists warn",
    "summarized_story": "According to the experts, labour induction is never an emergency procedure, noting that it can lead to maternal and neonatal deaths when poorly performed.\nThe maternal health experts stated that labour induction is usually planned and also done based on certain reasons and indications.\nIf labour induction is poorly managed, it can lead to maternal and neonatal deaths.”According to the World Health Organisation, induction of labour is the process of artificially stimulating the uterus to start labour.\nThe American College of Obstetricians and Gynaecologists says sometimes, labour induction does not work.\nIt is not even a labour that you do without the presence of a gynaecologist or an obstetrician because it is a high risk labour."
  },
  {
    "headline": "Labour induction poses risk of maternal, neonatal deaths, Gynaecologists warn",
    "summarized_story": "According to the experts, labour induction is never an emergency procedure, noting that it can lead to maternal and neonatal deaths when poorly performed.\nThe maternal health experts stated that labour induction is usually planned and also done based on certain reasons and indications.\nIf labour induction is poorly managed, it can lead to maternal and neonatal deaths.”According to the World Health Organisation, induction of labour is the process of artificially stimulating the uterus to start labour.\nThe American College of Obstetricians and Gynaecologists says sometimes, labour induction does not work.\nIt is not even a labour that you do without the presence of a gynaecologist or an obstetrician because it is a high risk labour."
  },
  {
    "headline": "World Blood Donor Day: FG recognises voluntary donors for consistency",
    "summarized_story": "The Minister of Health, Dr. Osagie Ehanire, has recognised some voluntary blood donors for their consistency and timely donations to the blood bank of the National Blood Transfusion Service (NBTS).\nEhanire made the recognition on Monday, in Abuja, at a news conference in commemoration of the 2021 World Blood Donor Day.\nThe News Agency of Nigeria reports that World Blood Donor Day set aside to raise global awareness on the need for safe blood and blood products for transfusion, is celebrated annually on June 14.\nIn addition, it is also aimed at recognising the contributions of voluntary, unpaid blood donors to national health systems.\nThe minister also said that about 118.5 million blood units were annually collected worldwide, with only 15 percent from voluntary unpaid donors."
  },
  {
    "headline": "World Blood Donor Day: FG recognises voluntary donors for consistency",
    "summarized_story": "The Minister of Health, Dr. Osagie Ehanire, has recognised some voluntary blood donors for their consistency and timely donations to the blood bank of the National Blood Transfusion Service (NBTS).\nEhanire made the recognition on Monday, in Abuja, at a news conference in commemoration of the 2021 World Blood Donor Day.\nThe News Agency of Nigeria reports that World Blood Donor Day set aside to raise global awareness on the need for safe blood and blood products for transfusion, is celebrated annually on June 14.\nIn addition, it is also aimed at recognising the contributions of voluntary, unpaid blood donors to national health systems.\nThe minister also said that about 118.5 million blood units were annually collected worldwide, with only 15 percent from voluntary unpaid donors."
  },
  {
    "headline": "Why there is trouble in South- East — Ngige",
    "summarized_story": "Also Read: Democracy Day: Protests sponsored, uncalled for — IdahosaAddressing the participants, Ngige said Buhari has shown friendship to Ndigbo, maintaining that the South East has gotten a fair share of what is due to the zone, especially infrastructure wise.\nSo, the South East is effectively represented to ensure justice is done to our people.\nIt is a work in progress.”The Minister recalled that the Buhari government had paid off all the gratuity and pensions of all the police pensioners in the South East that were neglected since after the war, which no government did before.\nAccording to him, the Governors in the South-East zone received the support even though at the time, the zone was a PDP zone.\n“Infrastructure wise, if you go to the South East, from Enugu-Okigwe and Umuahia-Aba-Port Harcourt expressways, three companies, the Chinese Company, the Arab Contractors and RCC are there."
  },
  {
    "headline": "Nigerians in S’Africa pledge to boost image of fatherland abroad",
    "summarized_story": "The Nigerian Citizens Association in South Africa (NICASA) on Monday pledged to continue to work closely with compatriots, to promote unity and boost the image of their fatherland abroad.\nThe President-General of NICASA, Mr Ben Okoli, made the pledge in an interview with the News Agency of Nigeria (NAN).\n“Although we did not celebrate officially, we sensitised compatriots in South Africa to the need to be law abiding and to always portray the image of our fatherland in good light.\n“We also met with the Nigeria Consul-General in Johannesburg, Mr Abdukmalik Ahmed, and talked about our welfare and the need for protection of Nigerians living in South Africa.\n“The meeting was attended by all Nigerian communities in South Africa and we pledged to work closely together to continue to foster unity among fellow compatriots abroad,” Okoli said."
  },
  {
    "headline": "Power generation falls 23% to 3,172MW",
    "summarized_story": "According to the data, most power plants were operating far below capacity due to gas shortage with Olorunsogo power plant, 335MW capacity, and Sapele power plant, 450MW capacity, completely out.\nEgbin was generating at 746MW, Omoku 37.20, Omotosho (NIPP) at 105MW while Afam was generating at 80MW.\nAlso Read: 2023: Tinubu’s posters flood AbujaInternational Oil Companies, IOCs, had last warned that despite Nigeria’s huge gas reserves a lot needs to be done to attract investment to the sector to develop gas reserves to boost power generation in the country.\n“The challenge is not just growing the reserves but in producing these reserves for the benefits of our country.\nEssentially growing the reserves and delivering on the production is a function of two or three elements."
  },
  {
    "headline": "Bandits abduct over 10 people in Kaduna Community",
    "summarized_story": "By Ibrahim wuyoAgain, bandits on Saturday night struck at the residential area of Kofar Gayan -kofar kona in Zaria ,Kaduna state,where they adducted over 10 residents.\nAlthough the Police Public Relations Officer in Kaduna ,Mr.Mohammed Jalige confirmed the latest kidnap incident but said they were still waiting for a comprehensive report, journalists were told that the bandits invaded the community at midnight, forcing their way into people’s houses and threatened them with guns and machetes.\nAn eye witness who said she was allowed by the bandits to stay back and take care of younger children, said about 7 bandits raided their compound speaking in Fulani.\n” We also, saw the bandits bringing out people from neighbouring houses.\nThey took my parents,sisters and brothers but allowed me and my step mother to stay and take care of the children."
  },
  {
    "headline": "Ned Nwoko blames insecurity on collapse of LG system",
    "summarized_story": "Ned Nwoko, has blamed the worsening insecurity in the country, on lack of functional local government system.\nThe Founder of Ned Nwoko Foundation , gave this opinion in Abuja when he delivered a Democracy Day lecture titled ” Getting It Right Ahead of 2023″ organised by the Nigeria Union of Journalists (NUJ) FCT Correspondent Chapel.\n“All the chairmen I have spoken with, are eager to ensure that they have independence.”Besides, the Independent National Electoral Commission (INEC) is not operating as an independent body and according to its mandate.\nHe explained that only a true independent electoral body woold guarantee the free and fair of election in 2023.\nWhile speaking on the rift between Twitter and the Federal government, Hon Nwoko, commended the decision of the government on the suspension of Twitter operation in Nigeria."
  },
  {
    "headline": "Google removes Adamu Garba’s Crowwe app from Play Store",
    "summarized_story": "Adamu Garba’s Crowwe social media app has been deleted from Google play store.\nJoin us @CrowweApp now!”Following the development, Nigerians took to google play store to drop horrible reviews on the instant messaging app, which imitates Twitter.\n“Google removes from the Play Store, applications that are perceived to have violated its policy.\n“Once your app is removed, the published version of your app won’t be available on Google Play until a compliant update is submitted.\n“Until a policy violation has been fixed, don’t republish a removed app,” the app store policy said."
  },
  {
    "headline": "Labour urges sustenance as industrial harmony returns to PRODA Enugu",
    "summarized_story": "The Senior Staff Association of Universities, Teaching Hospitals, Research Institutes and Associated Institutions (SSAUTHRIAI) has expressed delight as industrial harmony finally returns at the Project Development Institute (PRODA).\nThe National Executive Council (NEC) of SSAUTHRIAI, made the observation during a meeting hosted by her PRODA Branch Union, Enugu.\nLed by its national President, Dr. Benjamin Akintola and the General Secretary, Dr. E.O.\nBut the leadership of SSAUTHRIAI stated that with the board chairman, Onjeh and the new management led by Dr. Okonkwo, PRODA was experiencing a new lease of life.\nThe PRODA SSAUTHRIAI Branch Chairman, Gabriel Ohiemi also eulogized the Director, noting his gentle but giant steps taken in the right direction."
  },
  {
    "headline": "We’ve no problem with judicial financial autonomy – Gov Ganduje",
    "summarized_story": "Governor Abdullahi Ganduje of Kano State says his administration has no problem with granting financial autonomy to the judicial arm of the government in the State.\nGanduje made the remarks during an interactive session with newsmen as part of the event to mark `Democracy Day’ in Kano on Monday.\nHere in Kano, we have no problem with the financial autonomy of the judiciary.\nThe Judicial Staff Union of Nigeria (JUSUN) had on April 6 embarked on strike to press their demand for implementation of financial autonomy for the judicial arm of government.\nI support autonomy for judiciary, legislature – Gov Ortom"
  },
  {
    "headline": "Biafra agitation: Shehu Sani hails Ngige over support for united Nigeria",
    "summarized_story": "Former Kaduna South lawmaker, Senator Shehu Sani has reacted to the comments made by the Minister of Labour and Employment, Dr. Christ Ngige against secessionist agitation in the Southeast region.\nOn his Facebook page, Sani hailed Ngige’s courage for backing one Nigeria.\n“Much more importantly, the propaganda against this government in the Southeast should stop”, Ngige warned.\nReacting, Senator Sani wrote, “Dr.\nAccording to Senator Shehu Sani, times like this call on everyone to take a position and not to hide out of fear of consequences of opinion."
  },
  {
    "headline": "CNN anchor, Christiane Amanpour diagnosed with cancer",
    "summarized_story": "CNN’s chief international anchor, Christiane Amanpour has revealed that she has been diagnosed with ovarian cancer.\nAmanpour, who broke the news on Monday, told viewers that the illness was the reason she recently took a break from work.\nShe added that she’s confident about the outcome, as she begins her chemotherapy journey to deal with the cancer even though doctors weren’t able to surgically remove it.\nThe 63-year-old Amanpour has been a longtime news anchor at CNN, where she worked from 1983 to 2010.\nShe, however, left for a brief stint at ABC News but returned to CNN in 2012."
  },
  {
    "headline": "2021 Africa Women Handball Championship: Nigeria, Cameroon battle for World’s slot",
    "summarized_story": "Nigeria’s women handball team will today take on hosts Cameroon in the battle for one of the slots in the World Championships as both teams clash in the quarter-final of the ongoing African Women’s Handball Championship.\nThe News Agency of Nigeria (NAN) reports that a win against Cameroon will not only ensure Nigeria’s qualification for the championship’s semi-finals but the World Championships billed for Spain.\nADVERTISEMENTNigeria last qualified for a spot in the top four at the 1992 edition of the championship, held in Morocco.\nNigeria’s qualification, however, was on the basis of the two games played and not the win over Kenya, as Guinea’s win over Madagascar on game day three did not count.\nGuinea and Nigeria were ranked on the strength of the games they played against the top two qualifying teams in their groups."
  },
  {
    "headline": "Nigeria 3-3 Portugal: Falcons’ performance excites coach",
    "summarized_story": "By Tunde LiadiSuper Falcons’ coach Randy Waldrum has hailed the performance of the players for the dramatic comeback against Portugal at the Summer Series Invitational Tournament in the United States.\n“I’m so proud of you girls with the fight we had and the way we came back,” Waldrum said.\nYou were down by two goals two times in the game and you still mustered a comeback.\nIt is a very difficult task to do but you stayed on and kept on pushing.\nThat we are always in the team until the end of the game.”"
  },
  {
    "headline": "Buhari, Gbajabiamila, Omo-Agege, Lalong salute Omatseye at 60",
    "summarized_story": "By Bolaji Ogundele, Sanni Onogu, Abuja and Kolade Adeyemi, JosPresident Muhammadu Buhari, House Speaker Femi Gbajabiamila, Deputy Senate president Ovie Omo-Agege and Plateau State Governor Simon Lalong, have extended their best wishes to The Nation Editorial Board Chairman Sam Omatseye, on his 60th birthday.\nThe statement said: “President Muhammadu Buhari extends his best wishes to the Chairman of the Editorial Board of The Nation, Sam Omatseye, on the occasion of his 60th birthday.\n“President Buhari joins members of the Fourth Estate of the Realm and the literati in celebrating one of their own, who has distinguished himself in his career and gained recognition nationally and internationally for diligence, excellence and professionalism.\nDeputy Senate President Ovie Omo-Agege described Omatseye as a personification of the popular saying about the pen being mightier than the sword,.\nLalong, in a statement by his spokesman, Dr. Makut Simon Macham, wished him many more years of God’s protection and favour."
  },
  {
    "headline": "LMC fines Pillars over pitch invasion, others",
    "summarized_story": "By Taofeek BabalolaKano Pillars have been fined for breaching Nigeria Professional Football League (NPFL) Framework and Rules following the infraction in their Matchday 27 fixture against Akwa Utd at the Ahmadu Bello Stadium, Kaduna on Sunday.\nIn line with the Nigeria Football Federation (NFF) directives, the League Management Company (LMC) fined the Kano team N5 million for breaching the COVID-19 Protocol, while they were also fined N2.5m for a pitch invasion by their fans which led to the abandonment of the match.\nThe league body has however directed the club to submit a revised security plan within seven days, while they must also comply strictly with COVID-19 Protocol which is subject to approval by the LMC.\nADVERTISEMENTMeanwhile, NFF has directed LMC to go tough on clubs breaching the COVID-19 protocols.\nIn a communique issued by a virtual Emergency Committee meeting to deliberate on pressing matters regarding disciplinary issues and clear rule breaches in the NPFL and Nigeria National League (NNL)."
  },
  {
    "headline": "Uproar over plan to reopen grazing route",
    "summarized_story": "As far as the Northern Elders Forum (NEF) is concerned, reactivating open grazing routes may cause legal and security problems.\n“The reactivation of open grazing routes in southern part or any other parts of the country is problematic both in legal terms and security.\nThe Federal Government can actually sue governors that ban open grazing and the court will rule whether they are right or wrong.\nAt what time in our history did our founding fathers gather to designate specific routes from the north to the south as ‘grazing routes’?\nSince most governors in the country have outlawed open grazing in their respective states, on which land does the Federal Government want to ‘open’ or ‘re-open’ its vaunted grazing routes?"
  },
  {
    "headline": "Insecurity: Don’t abdicate your responsibility, Masari tells Buhari",
    "summarized_story": "From Agaju Madugba, KatsinaKatsina Governor, Aminu Bello Masari, has faulted President Muhammadu Buhari on reasons for worsening insecurity in the country.\nBut citing Constitutional provisions, Masari said it was wrong for anybody to blame states and local governments.\nWhen you look at the Constitution of the Federal Republic of Nigeria, the issue of security is under the Exclusive List.\n“From the local governments, we assist the police, the DSS, the NSDC.\nIf you devolve, states and local governments will have more financial independence."
  },
  {
    "headline": "Buhari, APC must address separatist agitations, not use of military –Odigie-Oyegun",
    "summarized_story": "From Romanus Ugwu, AbujaFormer national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun, has asked President Muhammadu Buhari and the ruling party to address the separatist agitations in the country through democratic means instead of deployment of military.\nHe said the fact that things are bad and people hungry and angry was not questionable, saying that these were worldwide phenomenon.\nHowever, Odigie-Oyegun decried the current security challenge in the country.\n“It is my hope that we will begin to get control of the security of this nation,” he said.\nThe executive of the party, the NWC, the Caucus, the NEC which is the highest organ of the party."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service tomorrow",
    "summarized_story": "Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan tomorrow.\nThe company stated this, yesterday, in a statement by its Lagos District Manager, Mr Jerry Oche, assuring that as from Tuesday (tomorrow) morning the Lagos – Ibadan train services will be available to the public.\n“Lagos to Ibadan takes off at 8am from Mobolaji Johnson Station at Alogomegi, Ebute Meta Lagos, while the train will depart Ibadan to Lagos at 8am from Obafemi Awolowo Station at Moniya.\nLagos to Ibadan ia at 4pm from Mobolaji Johnson Station Alagomji, while from Ibadan to Lagos is by 4pm from Obafemi Awolowo Station at Moniya.\nHe said the Alagomeji, Abeokuta, and Moniya remained the stop stations of the Lagos Ibadan train services."
  },
  {
    "headline": "Twitter ban: Govt officials, others switch to Indian app, Koo",
    "summarized_story": "By Lukman OlabiyiFollowing the ban on US microblogging platform, Twitter, the Federal Government, President Muhammadu Buhari, Vice President Yemi Osinbajo, and public office holders have switched to Indian App, Koo.\nApart from Federal Government officials that are already active on the new platform, some state governments officials have also discarded their Twitter accounts and switched to Koo.\nThe verified account of the Federal Government on the app is @Nigeriagov, and it has over 20 posts.\nPresident Buhari who also joined the new app in June already has 7, 374 followers and following none.\nAhmad, the president’s aide on new media, was already getting closer to hitting 10, 000 followers."
  },
  {
    "headline": "Clark Chastises President, Northern Elders for Silence over Jihadists’ Threat to Delta",
    "summarized_story": "He told reporters in Abuja that given their promptness in reacting to similar threats to herdsmen, he had expected Buhari and the Northern elders to condemn the threats to Delta State.\nThe group, on Sunday, had given Delta State a 72-hour ultimatum to review its ban on open grazing or risk an attack.\nClark, while condemning the silence of the federal government and Northern elders said open grazing was buried for good in all the 17 Southern states.\nBe warned!”However, the Delta State Police Command, in a statement by its spokesman, Mr.\nThe statement said the police were unwavering in their commitment to the security of lives and property of the people of Delta State."
  },
  {
    "headline": "Nigeria Must Decentralise Now or Risk Disintegration, Soyinka Warns",
    "summarized_story": "“If it (Nigeria) fails to decentralise, some people use the word reconstruction, some use whatever.\nBut if Nigeria fails to decentralise as fast as possible, manifestly, not as rhetoric, then Nigeria cannot stay together,” he warned, adding: “Again, it’s not Wole Soyinka saying this.\nOn how to make the system work again, he said: “It relates to what I was saying earlier.\nIf you study the constitution very carefully, you will find out that they have certain powers which they haven’t touched.\nI want to say this, it was a very instructive interview, and no doubt there was nothing new."
  },
  {
    "headline": "Despite Public Outcry, Nigeria to Borrow More for Railways Expansion",
    "summarized_story": "However, Amaechi said Nigeria had been fulfilling its loan obligations as it had never defaulted in the repayment of loans, especially for the railway projects.\nThe minister added that monthly revenue from the Abuja-Kaduna railway operation has increased from N70 million to N350 million as of May.\nHe also refuted the suggestion that some obnoxious clauses in the Chinese loan agreements may lead to mortgaging Nigeria’s assets in the case of default.\n“Under the regime of former President Goodluck Jonathan, the loan for Abuja – Kaduna was about $500 million.\nWe’ve not even commenced negotiation.”Amaechi said more Chinese loans would be needed to extend the railway services to other states."
  },
  {
    "headline": "Amaechi: Buhari’s Visit Has Shown Apapa Port’s Problem is Inefficiency",
    "summarized_story": "He also said that terminal operators must contribute to the total reconstruction and reorganisation of the Apapa Seaport.\nHe said: “What I’ve done, was to have a meeting with the terminal operators, and I told them that they have to contribute to the reconstruction of the Apapa Seaport.\nHe stressed that, “before we came, various contractors were contracted to provide security for oil companies in the water.\nSo, we are able to provide security in the coastal region, both on land and on the sea.\nThat’s the impact it will have when it comes to the Deep Blue project."
  },
  {
    "headline": "States Unveil Plans to Implement Financial Autonomy for Legislature, Judiciary",
    "summarized_story": "Our ReportersStates have unveiled strategies to implement the Memorandum of Action (MoA) to ensure financial autonomy for the legislature and judiciary, THISDAY has learnt.\nEbonyi State Chairman of PASAN, Mrs. Uche Edene, told THISDAY that the state had gradually started the implementation of the financial autonomy even before the strike started.\nShe stated that the state had enacted Fund Management Law in 2016 which gave birth to the State House of Assembly Commission.\nAminu Masari, said the state government had concluded plans to inaugurate SAAC and State Assembly Service Commission in order to enable the two arms of government to receive their statutory allocations directly from the federal government.\nSpokesman of the Speaker of the Kaduna State House of Assembly, Mr. Ibrahim Danfulani, said the lawmakers would debate the issue this week."
  },
  {
    "headline": "BREAKING: Kano Now Has Five Emirates As Ganduje Gives Assent To Bill",
    "summarized_story": "Abdullahi Ganduje, governor of Kano state, has given assent to the bill passed by the Kano house of assembly which breaks up the emirate in the state.\nWith the development, Kano now has five emirates: Kano, Rano, Gaya, Karaye and Bichi, while the domain of HRH Sanusi Lamido Sanusi, the emir of Kano, has been diminished.\nWith this decision the governor has redeemed the pledge he made earlier today that he would not waste time to give assent to the bill immediately it is transmitted to him.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Kano Now Has Five Emirates As Ganduje Gives Assent To Bill",
    "summarized_story": "Abdullahi Ganduje, governor of Kano state, has given assent to the bill passed by the Kano house of assembly which breaks up the emirate in the state.\nWith the development, Kano now has five emirates: Kano, Rano, Gaya, Karaye and Bichi, while the domain of HRH Sanusi Lamido Sanusi, the emir of Kano, has been diminished.\nWith this decision the governor has redeemed the pledge he made earlier today that he would not waste time to give assent to the bill immediately it is transmitted to him.\nMore to follow…"
  },
  {
    "headline": "VIDEO: Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action'",
    "summarized_story": "Since late Thursday night, the media has been agog with news of the announcement of Naomi Silekunola Oluwaseyi as the new queen of Ooni of Ife, Oba Adeyeye Enitan Ogunmusi.\nNaomi, 25, is based in Akure, the Ondo State capital, where she is an evangelist and Founder/President of EN-HERALDS, a prophetic mandate and an interdenominational ministry based in Akure, the Ondo state capital.\nHere’s a sample — courtesy of Ochuwa Lexie Idode — of what the new Queen looks like in her spiritual elements.\nVideo of Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action' Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action' Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action'...Not like the king minds, anyway, having already written: “I waited patiently upon the Almighty the King of kings, he eventually did it in the midst of many trials.\nYou are welcome home my beautiful and adorable queen, #OoniOfIfe #Otisese.”"
  },
  {
    "headline": "VIDEO: Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action'",
    "summarized_story": "Since late Thursday night, the media has been agog with news of the announcement of Naomi Silekunola Oluwaseyi as the new queen of Ooni of Ife, Oba Adeyeye Enitan Ogunmusi.\nNaomi, 25, is based in Akure, the Ondo State capital, where she is an evangelist and Founder/President of EN-HERALDS, a prophetic mandate and an interdenominational ministry based in Akure, the Ondo state capital.\nHere’s a sample — courtesy of Ochuwa Lexie Idode — of what the new Queen looks like in her spiritual elements.\nVideo of Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action' Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action' Naomi Oluwaseyi, Ooni Of Ife's New Queen, In 'Spiritual Action'...Not like the king minds, anyway, having already written: “I waited patiently upon the Almighty the King of kings, he eventually did it in the midst of many trials.\nYou are welcome home my beautiful and adorable queen, #OoniOfIfe #Otisese.”"
  },
  {
    "headline": "My In-laws Pressurising Me To Drink Water Used To Bathe My Late Husband—Widow Cries Out",
    "summarized_story": "A 34-year-old widow, Chioma Asomugha from Ubahuekwem in the Ihiala area of Anambra, has raised the alarm that her in-laws were forcing her to drink water used in bathing her dead husband’s corpse.\nSpeaking with NAN in Awka on Sunday, Asomugha alleged that the brothers of Charles, her late husband, said she must drink the water to prove that she was not responsible for her husband’s death.\nThe widow, who stated that she lived with her late husband in Lagos before his death, however, added that she would not do it.\n“I have four children with my husband and we lived at Ajangbadi in Ojo area of Lagos before his demise,” she said.\nShe said efforts made to handle the matter did not yield positive results as the family members were not cooperating."
  },
  {
    "headline": "Umahi on restructuring: Let's have six vice-presidents -- one from each region",
    "summarized_story": "AdvertisementSpeaking in an interview with Channels TV, on Monday, Umahi said the adoption of six vice-presidents will be a major step towards restructuring the country.\nRecently, the concept of restructuring has dominated the Nigerian political space with many stakeholders coming out to offer their views about the concept.\nMy position about restructuring — for example: there are certain valid suggestions that have been made, to have six vice-presidents in the country,” he said.\nThis is very important.”He also advocated for what he described as “administrative restructuring”, in which more powers and responsibilities will be devolved to sub-national governments.\nAdvertisement“Now, I will recommend administrative restructuring, which is making sub-national governments to be strengthened — devolving power and responsibilities to sub-national governments; abolishing the local governments,” he added."
  },
  {
    "headline": "Umahi on restructuring: Let's have six vice-presidents -- one from each region",
    "summarized_story": "AdvertisementSpeaking in an interview with Channels TV, on Monday, Umahi said the adoption of six vice-presidents will be a major step towards restructuring the country.\nRecently, the concept of restructuring has dominated the Nigerian political space with many stakeholders coming out to offer their views about the concept.\nMy position about restructuring — for example: there are certain valid suggestions that have been made, to have six vice-presidents in the country,” he said.\nThis is very important.”He also advocated for what he described as “administrative restructuring”, in which more powers and responsibilities will be devolved to sub-national governments.\nAdvertisement“Now, I will recommend administrative restructuring, which is making sub-national governments to be strengthened — devolving power and responsibilities to sub-national governments; abolishing the local governments,” he added."
  },
  {
    "headline": "Christiane Amanpour, CNN TV host, diagnosed with ovarian cancer",
    "summarized_story": "Christiane Amanpour, anchor of Amanpour, a global affairs interview programme on CNN International, says she has been diagnosed with ovarian cancer.\nAdvertisementAmanpour disclosed this during a live broadcast on Monday.\nAccording to her, she was absent from the programme for the past four weeks due to the diagnosis, adding that she is now undergoing chemotherapy.\nAdvertisement“I have had successful major surgery to remove it, and I’m now undergoing several months of chemotherapy for the very best possible long-term prognosis and I am confident.\nAmanpour is an international journalist known for war and conflict reporting."
  },
  {
    "headline": "Christiane Amanpour, CNN TV host, diagnosed with ovarian cancer",
    "summarized_story": "Christiane Amanpour, anchor of Amanpour, a global affairs interview programme on CNN International, says she has been diagnosed with ovarian cancer.\nAdvertisementAmanpour disclosed this during a live broadcast on Monday.\nAccording to her, she was absent from the programme for the past four weeks due to the diagnosis, adding that she is now undergoing chemotherapy.\nAdvertisement“I have had successful major surgery to remove it, and I’m now undergoing several months of chemotherapy for the very best possible long-term prognosis and I am confident.\nAmanpour is an international journalist known for war and conflict reporting."
  },
  {
    "headline": "Ita Enang: Hoarding of LG funds by state governors, cause of insecurity in Nigeria",
    "summarized_story": "Ita Enang, senior special assistant to the president on Niger Delta affairs, says the failure of governors to release funds to local governments is the cause of security challenges in the country.\nAccording to him, the efforts of President Muhammadu Buhari to tackle insecurity have been frustrated by governors, who are spending funds that should be allocated to their local governments.\nThe governors have interfered and kidnapped the funds of the local governments through what is called the state/local government joint account,” he said.\nWhat happens today is that chairmen of local governments and local government officers only go to work when there is allocation.\n“If governors would take the monies of local governments, and when they face insecurity, they say ‘President Buhari’."
  },
  {
    "headline": "Ethiopia opens process to sell 40% stake in Ethio Telecom",
    "summarized_story": "Ethiopia has announced a tender process for the sale of a 40% stake in state-owned telecommunications company, Ethio Telecom.\nThis is the first stage in a lengthy process that will lead to the selection of a successful bidder.\nIn May, the government awarded one of the two available private operating licences to break up Ethio Telecom’s monopoly on the sector.\nAccording to Brook Taye, a senior advisor at the finance ministry, the 40% in Ethio Telecom will be sold as a single stake to a single investor.\nFounded in November 2010, Ethio Telecom currently has around 53 million subscribers and has since December generated a revenue of around $600 million."
  },
  {
    "headline": "Here are ten VPNs you can use in Nigeria",
    "summarized_story": "Virtual private networks (VPNs) have been around for a long time but have become more popular recently.\nExpress VPNExpressVPN is rated highly because of its very fast speeds across over 3,000 remote servers in 160 locations and 94 countries.\nUnlike NordVPN and ExpressVPN, the first subscription tier of ProtonVPN is its free VPN offering, which includes just three VPN server locations (Japan, Netherlands, and the US).\nWindscribe VPNJust like TunnelBear, Windscribe VPN has a free version and it gives 10GB free every month.\nWhich other VPNs do you use and what do you like or don’t like about them?"
  },
  {
    "headline": "Product policy managers are at the centre of Big Tech companies",
    "summarized_story": "The app is perfect for hyper-creative content creators who know their way around editing tools and special effects.\nHe uses animated videos to address sensitive topics and create content that is easy to digest and understand.\nPearlé: Watching TikTok videos inspires me to keep going and encourages me to do more at work.\nPearlé: For us, as product policy managers, we are at the centre of every company.\nBig tech companies still have a long way to go where product policy is concerned."
  },
  {
    "headline": "Top Three Nigerian Stocks for Sustainable Investors",
    "summarized_story": "They choose stocks of corporations known for fair and sustainable practices.\nSo, which stocks are sustainable?\nSterling BankThe sustainable policies of Sterling Bank allow it to prevent credit fraud and reduce its own carbon footprint.\nThese include The Nigerian Sustainable Banking Principles (NSBP), Equator Principles and theInternational Finance Corporations (IFC) Performance Standards.\nSustainable Investment in NigeriaThese are three examples of sustainable stocks in Nigeria."
  },
  {
    "headline": "Catalyst to Breakthrough: How Wema Bank Boosts Startups with Digital Innovations",
    "summarized_story": "Nigeria’s leading innovative and digital financial institution, Wema Bank, has become a main attraction for these categories of Nigerians due to its provision of accessible, seamless, timely and flexible digital services.\nResolved to become Nigeria’s financial institution of choice, Wema Bank has built several digital products and offerings like ALAT, Sara, Gender Loan Offering, Hackaholics, SME solutions and lots more.\nALAT by Wema, for instance, is Nigeria’s first digital bank that blazed the trail for others in the sector.\nIts Hackaholics, an initiative for tech startups is also a trailblazer by organizing trainings for businesses to solve societal challenges.\nThe Bank recently presented N2,187,500.00 to four startups for emerging as the winners during the Hackaholics Bootcamp 2.0."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "#WorldBloodDonorDay: 5 startups improving access to safe blood in Africa",
    "summarized_story": "AdvertisementThis is not sustainable as family and friends of accident victims, for example, may not be readily available to donate blood.\nIn 2016, Bime started Infiuss, a blood bank management system that connects hospitals with blood banks with hospitals without a blood bank.\nIt connects hospitals with blood banks or donors and assists in screening, tracking, storage, distribution, preparation of blood products, and inventory management.\nIt only provides information on which blood banks have the blood that is needed.\nWe can’t all build startups that save lives, but we can donate blood regularly and save lives in our little way."
  },
  {
    "headline": "5 online platforms to get collateral-free loans for your small business in Nigeria",
    "summarized_story": "As a small business owner, growing your business and meeting your customers’ needs should be your top priorities.\nI hear you, and I’ve received mail from small business owners with the same needs.\nCarbon’s SME loansCarbon’s SME loans is a product that allows you to “grow your small business with affordable, collateral-free loans.” SMEs can access up to ₦1,000,000 without collateral, guarantors, or paperwork.\nFastCreditFastCredit offers business loans to micro, small, and medium enterprises to support business growth.\nLearn more about how to launch, market and grow your business at SME Clinic 2021Are you a small business owner?"
  },
  {
    "headline": "South Africa regulating cryptocurrency, Nigeria’s new International Termination Rates, Toptal sues Andela",
    "summarized_story": "Good day,Today I’m discussing,South Africa regulating cryptocurrencyNigeria’s new International Termination RatesToptal suing AndelaSouth Africa inching closer to regulating cryptocurrencySouth Africa’s Intergovernmental Fintech Working Group (IFWG) has released a position paper calling for the regulation of the country’s cryptocurrency ecosystem.\nSeveral African countries — Nigeria, Ghana, Mauritius, Kenya and South Africa — have been known to take a critical stance in the cryptocurrency arena.\nFor a more in-depth read, Check out South Africa Working Group Releases New Position Paper Calling for Regulation of Crypto Asset ProvidersNigeria’s new International Termination RatesThe Nigerian Communication Commission (NCC) has concluded plans to roll out a new Mobile International Termination Rate (ITR).\nThe Commission has finalised the process of determining the cost-based price of ITR to ensure healthy competition on traffic handling for voice services between local and international operators in Nigeria.\nThey are charges paid to local operators by international operators to terminate calls in Nigeria."
  },
  {
    "headline": "Data fails to justify Buhari’s claim of lifting 10.5m out of poverty",
    "summarized_story": "Data fails to justify Buhari’s claim of lifting 10.5m out of povertyNigeria’s President Muhammadu Buhari, during his Democracy Day speech on Saturday, claimed that his administration has successfully lifted 10.5 million Nigerians out of poverty in the last two years but data shows Nigerians have been worse off during this period.\n“In the last two years we lifted 10.5 million people out of poverty – farmers,…"
  },
  {
    "headline": "Nigeria’s textile import rises by 258% in Q1 despite FX restriction",
    "summarized_story": "Nigeria’s textile import rises by 258% in Q1 despite FX restrictionDespite the Central Bank of Nigeria’s (CBN) restriction of Foreign Exchange (FX) for textile products imports since 2019, its import has skyrocketed.\nAccording to the National Bureau of Statistics (NBS) trade report, importation of textile and textile articles rose year-on-year by 257.9 percent in the first three months of 2021 to N171.8 billion from N48…"
  },
  {
    "headline": "Multi-billion naira ranching opportunity beckons on Nigerian investors",
    "summarized_story": "The recent ban on open grazing in Southern Nigeria by the governors has presented billion-dollar investment opportunity in ranching for entrepreneurs to tap into.\n“Total ban on open grazing in the country creates huge investment opportunity for investors.\nHe notes that entrepreneurs can only tap from the huge investment opportunity ranching creates when government at all levels puts an end to open grazing and ensure that ranching becomes a business.\nRearing herds of cattle within the confines of a ranch with all needed facilities help in boosting their milk production productivity, which according to experts, in turn, will reduce the country’s milk importation.\n“Botswana is an example we can learn from in ranching as their economic growth is mainly from livestock production,” Mogaji says."
  },
  {
    "headline": "Edo Museum: US to return two Bronze pieces – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Metropolitan Museum of Art in New York City, United States, has said it will return two Benin Bronze from its collection to its place of origin, further boosting the prospects of American museums to repatriate looted art pieces to the Governor Godwin Obaseki-backed Edo Museum of West African Art (EMOWAA).\nThe two works to be returned are “Warrior Chief” and “Junior Court Official,” a pair of 16th-century brass plaques from the Oba Palace in Benin City.\nThe museum project is part of Governor Obaseki’s legacy for the state’s burgeoning arts and tourism space.\nDirector at the Met Museum, Max Hollein, in a statement, said “The retention of these works within Nigeria’s National Collections is critical to the well-being of the museum community and to fostering ongoing cooperation and dialogue between The Met and our Nigerian counterparts.”He added that the Museum was in support of the forthcoming Edo Museum of West African Art.\nErin L. Thompson, a professor of art crime at John Jay College, said “The Metropolitan is repatriating two artifacts stolen from Nigeria in the 20th century, but not the many other artifacts stolen from that territory in the 19th century in its collections.”“These artifacts — key parts of the sacred and political workings of the Kingdom of Benin — were taken during an orgy of violence intended to steal not just the kingdom’s treasures, but the kingdom itself,” She added."
  },
  {
    "headline": "2021 WNT Summer Series : Three takeaways from Nigeria’s thrilling 3-3 draw with Portugal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Super Falcons drew against Portugal in their second game of the 2021 WNT Summer Series in Houston, Texas, USA in the early hours of Monday morning in Nigeria.\nThe Super Falcons improved in the second halfThe performance of the Super Falcons massively improved in the second half as they noticeably harried the Europeans into making mistakes.\nThe captain of the team Asisat Oshoala only joined the team on the morning of the game but still had a good game.\nUnited Falcons, Good Signs For The New GirlsThe way the Super Falcons celebrated their third goal against Portugal was great to witness.\nThis sends positive vibes to other players of Nigerian descent in diaspora who may have been contemplating whether to represent Nigeria or not."
  },
  {
    "headline": "World Donor Day: Obaseki hails donors, urges increased awareness to ensure stable supply of safe blood – Nigerian Observer",
    "summarized_story": "Obaseki gave the commendation in commemoration of this year’s World Blood Donor Day, with the theme; “Give blood and keep the world beating”, marked by the World Health Organisation (WHO), every June 14, across the globe.\nAccording to the WHO, “World Blood Donor Day aims to raise global awareness of the need for safe blood and blood products for transfusion and of the critical contribution voluntary, unpaid blood donors make to national health systems.\n“Safe blood and blood products and their transfusion are a critical aspect of care and public health.\n“To ensure that everyone who needs safe blood has access to it, all countries need voluntary, unpaid donors who give blood regularly.\nThroughout the COVID-19 pandemic, despite limited mobility and other challenges, blood donors in many countries have continued to donate blood and plasma to patients who need transfusion.”..."
  },
  {
    "headline": "ISIBOR EWUARE Install Pa. Obazee As Odionwere Amid Wide Jubilations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEGOR – It was pomp and ceremony recently in Isibor Ewuare Village, Egor Local Government Area of Edo State as sons and daughters of the Village, both at home and in diaspora joined the elders of the town to install Pa. Imafodon Okhionkpamwonyi Obazee as Odionwere of Isibor Ewuare.\nThe installation event which was held under the cordiality of friendly atmosphere at the village witnessed wide jubilations amongst the people as they danced and sang praises of Pa. Obazee.\nWe are very ready to join hands with our new Odionwere to push for a better, purposeful and globally cherished Isibor Ewuare Village.\nOther top executive members of the village who reacted include Pa. Felix Igbinosun (Ozukpogieha); Pa. Ogieriakhi Okpugie ( Ozukpogieha); Pa. Anthony Aimufua (Ozukpogiene) and Mr. Stanley .O.\nHigh point of the ceremony was the commissioning of bohole donated to the people by Pa. Obazee."
  },
  {
    "headline": "Yadda wata Uwa ta siyar da ya’yanta biyu naira N300,000 saboda tsananin talauci",
    "summarized_story": ""
  },
  {
    "headline": "Yadda wata Uwa ta siyar da ya’yanta biyu naira N300,000 saboda tsananin talauci",
    "summarized_story": ""
  },
  {
    "headline": "Yadda ‘yan uwan mijina suka tilasta ni na sha ruwar da aka wanke gawar mijina – Matar mamaci",
    "summarized_story": ""
  },
  {
    "headline": "Yadda ‘yan uwan mijina suka tilasta ni na sha ruwar da aka wanke gawar mijina – Matar mamaci",
    "summarized_story": ""
  },
  {
    "headline": "Gwamna Balan Bauchi ya naɗa Aminu Gamawa sabon shugaban ma’aikata fadar gwamnatin jihar",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "‘You can’t ban Twitter to satisfy your ego’ – PDP govs tell Buhari",
    "summarized_story": "Governors of Nigeria’s main opposition party, the Peoples Democratic Party (PDP), have kicked against the decision of President Muhammadu Buhari administration to indefinitely suspend Twitter in Nigeria.\nThe governors who registered their displeasure with ban in a communique issued after their meeting in Akwa Ibom on Monday, said the ban was only to satisfy the president’s ego, and will worsen the country’s unemployment crisis.\nIn the communique read by chairman of the PDP governors forum and Sokoto State governor, Aminu Tambuwal, the governors maintained that the ban was not in the interest of Nigeria.\n“The meeting examined the suspension of Twitter from operating in Nigeria, and condemned the personalised reasons given for the action,” the communique read.\n“Nigerian youths do not have adequate access to employment and a lot of Nigerians rely on Twitter for their livelihood, businesses and self-employment."
  },
  {
    "headline": "Gov Okowa hails Okonjo-Iweala at 67",
    "summarized_story": "Delta State governor, Dr. Ifeanyi Okowa, has hailed the director-general of World Trade Organisation (WTO), Dr Ngozi Okonjo-Iweala on the occasion of her 67th birthday, describing her as a brilliant, competent, world-class economist and international development expert.\nIn a statement by his chief press secretary, Mr Olisa Ifeajika, in Asaba, the governor congratulated her as she clocks 67 years, stating that her works over the years had distinguished her internationally.\nOkonjo-Iweala, an illustrious Deltan from Ogwashi-Uku, is the first female director-general and first African to lead the global trade body in its 25-year history.\n“Proudly, your rich profile has continued to soar, and I recall that you were named ‘Euro-money Global Finance Minister’ in 2005 after you led Nigeria’s economy to exit foreign debt obligations during your first term under President Obasanjo.\nThese feats remain largely unprecedented till date,” he said"
  },
  {
    "headline": "Nigeria paid $642.43m foreign debt in Q1 2021 – DMO",
    "summarized_story": "Hence, external debt service payments fell to N126.02 billion (or $332.07 million) in the first quarter (Q1) 2021 from N170.60 billion (or $472.57 million) printed in Q1 2020.\nAccording to DMO, bilateral loan accounted for 12.73 per cent ($4.18 billion) of which loan from China (Exim Bank of China) was $3.40 billion and loan from France was $0.49 billion in Q1 2021.\nLocal debt stock increased by 10.71 per cent to N20.64 trillion in Q1 2021 (from N18.64 trillion in Q1 2020).\nFurther breakdown of the domestic debt figure showed that federal government (FG’s) domestic debt stock rose to N16.51 trillion in Q1 2021 (from N14.53 trillion in Q1 2020).\nDespite the significant rise in FG’s domestic loan, local debt service payment increased marginally by 0.59 per cent to N612 billion in Q1 2021 from N609.13 billion recorded in Q1 2020 amid a relatively low rate."
  },
  {
    "headline": "Access Bank plots N200bn digital loan growth with DBA Lite launch",
    "summarized_story": "Access Bank Plc., says it is planning to double the size of its digital loans to N200 billion at the end of the year with the launch of DBA Lite, a business solution targeted at youth entrepreneurs.\nThe Executive Director, Retail Banking of the bank, Mr. Victor Etuokwu, disclosed this at a press conference to announce the launch of the product.\nMore so, they stand a chance of enjoying access to information and training as well as business registration for intending young business owners among other value propositions.\n“Access Bank has always pride itself on being a facilitator of economic growth in the nation.\nAyodele Olojode, Group Head, Emerging Businesses, Access Bank, speaking, said: “What we are trying to do is to help the young entrepreneurs to leverage the digital skills that they have."
  },
  {
    "headline": "FMDQ Securities Exchange Lists N12.38bn Coronation Merchant Bank, Mixta Real Estate CP",
    "summarized_story": "FMDQ Securities Exchange Limited has approved the quotation of N12.38 billion Coronation Merchant Bank and Mixta Real Estate Plc Commercial Papers (CP) Issuance Programme on its platform.\nAdvertisementsThe Issuances comprise of Coronation Merchant Bank Limited N11.36 billion Series 18 CP under its N100.00 billion CP Issuance Programme and Mixta Real Estate N1.02 billion Series 36 Commercial Paper under its N20.00 billion CP.\nCoronation Merchant Bank has joined the league of other companies whose debt profiles have been raised via the value-packed quotations service offered by FMDQ Exchange, while, Mixta Real Estate, a subsidiary of Mixta Africa, is a real estate development company in Nigeria with a strong track record, diverse real estate portfolio, and operations spanning the residential, commercial, and retail sectors of the Nigerian real estate industry.\nFMDQ Securities Exchange said: “the continuous admission of securities to FMDQ Exchange’s platform is reflective of the potential of the Nigerian debt capital market and the commendable level of confidence demonstrated by both issuers and investors in the market.”The Exchange said, the proceeds from the quotation of this CP will be used to finance the Issuer’s working capital requirements.\nIt added that, “the admission of Mixta Real Estate CP on FMDQ Exchange, which is sponsored by FBNQuest Merchant Bank, a Registration Member (Quotation), serves to re-affirm FMDQ Exchange’s efforts in boosting investor confidence and reinventing the Nigerian CP market."
  },
  {
    "headline": "Katsina Watch: Repositioning Education In Katsina",
    "summarized_story": "AdvertisementsGovernor Aminu Bello Masari of Katsina State, has prioritised education since inception of his administration in 2015 to date.\nThis was why his government has allocated 22 per cent of the state’s annual budget for the past three years.\nOver N15 billion has been expended on numerous interventions in the sector, especially at the primary and secondary school levels which have been unprecedented.\nThe interventions were not limited to infrastructure development, but also in training and retraining of staff, recruitment, promotion, payment of salary and other welfare packages as and when due to teachers.\n10,000 units of furniture, comprising double seater chairs and desks have been procured and distributed."
  },
  {
    "headline": "Onyekuru Rejects Olympiacos, Eyes Galatasaray Permanent Deal",
    "summarized_story": "Super Eagles winger, Henry Onyekuru, is keen to join Galatasaray on a permanent deal instead of linking up with Greek giants Olympiacos.\nAdvertisementsOnyekuru spent the second part of the 2020/21 campaign on loan at Galatasaray, his third loan stint with the Turkish club.\nGalatasaray failed to exercise the option to sign the 23-year-old on a permanent basis which expired last week opening the door to other suitors.\nAccording to aksam.com.tr, Onyekuru made a request to Monaco’s sporting director Paul Mitchell to wait for Galatasaray’s presidential election slated for June 19 before deciding his next move.\nOnyekuru scored 22 goals and provided 12 assists in 71 appearances across three loan spells at Galatasaray."
  },
  {
    "headline": "Euro 2020: France Stronger Than Germany Only On Paper – Rudiger",
    "summarized_story": "Chelsea defender Antonio Rudiger says France are stronger than Germany only on paper ahead of their clash in Group F Euro 2020, today.\nAdvertisementsWorld champions France are among the favourites for this year’s European Championship.\nTheir group at Euro 2020, though, includes the Germans and Portugal, who won the 2016 competition, beating France in the final, while Hungary make up the numbers.\nIt’s being called the ‘group of death’ but the Chelsea Champions League winner isn’t paying attention to the hype.\n“France looks stronger on paper, but that’s just on paper,” Rudiger told a press conference."
  },
  {
    "headline": "AfDB Launches $463.9m Bond in Australia",
    "summarized_story": "The African Development Bank (AfDB) has launched a 600 million Australian Dollar (AUD), translating to $463.9 million, 5.5-year Kangaroo social bond, marking its return to the Australian dollar bond market.\nThese included a strong cohort of Australian investors, while fund managers were the major investor type.\nCommenting on the bond, AfDB Treasurer, Hassatou N’sele said the Covid-19 pandemic had led to a rise in global issuances of social bonds.\nRecent data shows that the African Development Bank had AUD1.75 billion of bonds mature between its 2015 benchmark deal and its most recent.\nIn December 2016, the African Development Bank launched its inaugural Kangaroo Green Bond."
  },
  {
    "headline": "‘Nigeria loses over N100bn yearly in tax-related frauds’ —",
    "summarized_story": "Success NwoguNigeria loses not less than N100 billion every year in tax related frauds, experts have said.\nThe Chairman of the conference was Prof Sadiq Raddah while key note address was delivered by Mr Femi Falana SAN.\nSuraju said corruption remained a teething problem in Nigeria with grave consequences on political stability, poverty, lack of jobs, growing wave of violence and extremism.\nThe participants, in a communique, issued at the end of the day long event said, “Corruption cannot be fought effectively unless Nigeria deals with tax fraud.\nNigeria as a signatory to various international and regional conventions on freedom of speech should desist from any action that threatens media freedom,” the participants said."
  },
  {
    "headline": "Delta youths threaten massive reprisals against alleged planned Fulani...",
    "summarized_story": "By Nosa Akenzua, AsabaThere is currently a raging war between the Ukwani Local Government officials and Fulani herdsmen, who through their indiscriminate grazing have allegedly destroyed farmers’ crops in the recent times.\nHe added that the council was working out plans to possibly relocate the cattle traders from landforce to obiaruku community to do their business in town and not in an isolated location.\nHe noted that he had severally appealed to the leadership of the cattle dealers to ensure that his men were under control or check but wondered why they had allegedly continued to do otherwise, giving frivolous excuses over the mindless acts of the cattle rearers.\nHe said, “We have been at war with the cattle rearers who have been destroying our farm crops and they did promised during our meeting that they will do everything possible to arrest the situation to no avail.\nWe have been facing difficulties in their hands."
  },
  {
    "headline": "NNPC, Egbin collaborate to boost gas-to-power programme —",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) and the Egbin Power Plc have pledged to deepen collaboration to ensure the success of the Federal Government’s gas-to-power programme.\nThe Chief Operating Officer, Gas, NNPC, Mr Yusuf Usman and Chairman, Board of Directors, Egbin Power Plc, Mr Temitope Sonubi, made the pledge during a facility visit of the NNPC team to the power plant on Monday in Lagos.\nHe said there was need to ensure undisrupted supply of gas to Egbin Power Plant, which was the biggest in Sub Saharan Africa.\nWe are going to support you to make sure that the power supply is steady.\nSonubi appealed to the NNPC to sustain effort towards gas development and supply of the product to keep turbines at Egbin working productively at optimal capacity."
  },
  {
    "headline": "Gunmen kill police inspector, 24 others — Daily Times Nigeria",
    "summarized_story": "According to a source, the attack, which happened on Sunday, was carried out by gunmen driving vehicles allegedly given to “repentant” bandits by the State Governor, Bello Matawalle.\nOur correspondent gathered that the killing took place at about 9:30pm when suspected Fulani herdsmen storm the community and shot on the people sporadically.\nIt was gathered that five persons sustained gunshots injuries and are receiving treatment at various hospitals in the state.\n“I don’t know why people will come from different places to come and kill people and just go.\nThe CP has ordered a discreet investigation into the incident with the aim of apprehending the perpetrators of the act."
  },
  {
    "headline": "Two killed as ‘hoodlums’ hijack masquerade festival in Oyo",
    "summarized_story": "The National President of Soludero Hunters Association, Oba Nureni Ajijola Anabi has said “hoodlums” at Oja Igbo area of Ibadan have hijacked the ongoing masquerade festival killing and maiming innocent people.\n“When the Egungun festival began, these hoodlums killed one man at Oja Igbo and Ita Ege areas of Ibadan.\n“They killed a man four days ago.\nThe man challenged them why they wanted to set his family house on fire.\n“The deceased said he wasn’t the one with the masquerade and that it was his brother."
  },
  {
    "headline": "Two killed as ‘hoodlums’ hijack masquerade festival in Oyo",
    "summarized_story": "The National President of Soludero Hunters Association, Oba Nureni Ajijola Anabi has said “hoodlums” at Oja Igbo area of Ibadan have hijacked the ongoing masquerade festival killing and maiming innocent people.\n“When the Egungun festival began, these hoodlums killed one man at Oja Igbo and Ita Ege areas of Ibadan.\n“They killed a man four days ago.\nThe man challenged them why they wanted to set his family house on fire.\n“The deceased said he wasn’t the one with the masquerade and that it was his brother."
  },
  {
    "headline": "Falana: Old grazing reserves law applied only to northern states",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), says the Grazing Reserves Act of 1964 which President, Major General Muhammadu Buhari (retd.\nThe senior advocate said this in a statement on Sunday titled, ‘President Buhari Should Embrace Ranching’.\nThe activist stated that in 2016, the Federal Government announced that it had acquired 55,000 hectares of land in 11 states for grazing of cattle.\nBut due to the opposition which greeted the concept of cattle colony in many quarters the Federal Government jettisoned the policy and adopted the Livestock Transformation Policy including ranching in 2018,” Falana recalled.\nLalong was quoted as saying that some states had begun processes to end open grazing in their states."
  },
  {
    "headline": "Falana: Old grazing reserves law applied only to northern states",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), says the Grazing Reserves Act of 1964 which President, Major General Muhammadu Buhari (retd.\nThe senior advocate said this in a statement on Sunday titled, ‘President Buhari Should Embrace Ranching’.\nThe activist stated that in 2016, the Federal Government announced that it had acquired 55,000 hectares of land in 11 states for grazing of cattle.\nBut due to the opposition which greeted the concept of cattle colony in many quarters the Federal Government jettisoned the policy and adopted the Livestock Transformation Policy including ranching in 2018,” Falana recalled.\nLalong was quoted as saying that some states had begun processes to end open grazing in their states."
  },
  {
    "headline": "Forget it, Ebonyi has no land for ranching – Umahi",
    "summarized_story": "Ebonyi State Governor, David Umahi has said the state has no land to give Fulani herdsmen for ranching as the people have kicked against it.\nUmahi, who spoke in an interview on Channels TV’s Politics Today on Sunday, said the issue at hand was not about the governors, but about the people.\nUmahi summed it up: “My people said they have no land for ranching.\nIf I have one acre of land and I am talking about giving land for ranching, I should be talking about that particular land.\nYes, constitutionally, I have control over the land but you have to kill all the people to get the land.”"
  },
  {
    "headline": "Nationalist flag march in Jerusalem triggers fears",
    "summarized_story": "Agency ReportIsrael was bracing Tuesday for a controversial flag march through Jerusalem, with fears of a fresh outbreak of violence in the contested city prompting a massive security presence.\nSome 5,000 right-wing nationalists were due to parade through Jerusalem’s Old City waving Israel’s blue and white flag, with 2,000 police officers present.\nPalestinians see the late afternoon march, which passes through the Muslim quarter of the Old City, as a provocation.\nAirstrikes and rocket attacks followed violent clashes over access to the Jerusalem holy site known as the Temple Mount to Jews and the Noble Sanctuary to Muslims.\nPalestinians see it as their future capital, while Israel claims all of Jerusalem as its own capital."
  },
  {
    "headline": "Buhari plunges Nigeria into bankruptcy with N36T debt — Governors",
    "summarized_story": "By Okafor Ofiebor/Port HarcourtPeoples Democratic Party (PDP) Governors’ Forum said President Muhammadu Buhari’s government has plunged Nigeria into bankruptcy, as the humongous N36 trillion debt has become clearly unsustainable.\nIn a 14-point communiqué read by Governor Aminu Tambuwal of Sokoto State, who chaired the meeting, the PDP Governors frowned at the rising and seemingly uncontrollable debt profile of Nigeria with over 80% of normal Appropriation spent on debt servicing.\n“All the gains of the PDP Government under Chief Olusegun Obasanjo, GCFR, where Nigeria exited its foreign debt obligations has been destroyed.\nThe governors knocked the NNPC for starving the States and Local Governments and indeed Nigerians of funds needed for employment, development and general well-being.\nThe PDP governors, who also examined the suspension of Twitter in Nigeria, condemned the personalised reasons given for the action by the presidency and demanded a review of the action in national interest."
  },
  {
    "headline": "Why I Told Google To Take Down My Crowwe App — Adamu Garba",
    "summarized_story": "Adamu Garba, the CEO of IPI Group, claims he asked Google to remove his social media platform, Crowwe App, from the Google Playstore because he wanted to update the code.\nGarba, a senior member of the All Progressives Congress, revealed as much in an interview with The PUNCH on Monday.\nAs a result, Garba revealed that he asked Google to remove the app in order to make some modifications.\nGarba added, “We took down Crowwe App because we are trying to update the codes and then put it back up.\n“The app being installed has nothing to do with the user but has everything to do with the app itself."
  },
  {
    "headline": "Ahead Of Saturday’s Bye–Election In Jigawa, APC Party Supporters Publicly Display Guns, Cutlasses",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have threatened to attack members of the opposition ahead of the state’s Gwaram Federal Constituency bye-election on Saturday.\nThe members were seen with rifles, cutlasses, and other weapons in a video seen by NewsDirect, chanting the name of the APC candidate, Yusuf Galambi.\nThe poll was set for June 19 by the Independent National Electoral Commission (INEC).\nFollowing the death of Yuguda Hassan Kila, the last holder of the position, on March 4, the Speaker of the House of Representatives, Femi Gbajabiamila, declared the seat vacant.\n“Political parties shall conduct their primaries between 18th and 24th May, 2021."
  },
  {
    "headline": "Activist Refuses After Channels TV Asked Him To Remove #BuhariMustGo Shirt Before Going On Air",
    "summarized_story": "Adeyeye Olorunfemi, an anti-President Muhammadu Buhari activist, walked out of a Channels Television show on Monday after refusing to take off his #BuhariMustGo T-shirt.\n“There is no small oppression.\n”The civil rights movement in America has a history and the ‘small’ defiant role of Rosa Parks cannot be discarded.\n”Should we say it wouldn’t have mattered if Rosa Parks had allowed the white man sitting in the bus?\n”The right for blacks to sit in a bus at that time was not recognised anyway, but it was fought for, due to Rosa Parks’ intolerable attitude towards ‘small oppression’."
  },
  {
    "headline": "Buhari Now More Determined To Tackle Division — Garba Shehu",
    "summarized_story": "Mr Shehu, appearing on state-run broadcaster NTA, believes that the regime’s adversary is the outlawed microblogging site Twitter, which is used to spew hate messages and endanger Nigeria’s business survival.\n“I think in the last few days, we are seeing a firmer determination by the administration of President Muhammadu Buhari to tackle artificial divisions that are standing in the way of national cohesion and progress of the country,” Mr Shehu said.\nMany citizens accused the president of infringing on citizens’ right to free speech and depriving them of their primary source of income.\nBut, in justifying the ban, Mr Shehu claimed that it was the proper method in ensuring that the country’s “rising heat” was put to an end.\nMeanwhile, the Buhari dictatorship has been extensively chastised for gross human rights violations, increasing insecurity and the economy, corruption, and nepotism, among other things."
  },
  {
    "headline": "After 5-month captivity, ISWAP frees UN staff, 9 others",
    "summarized_story": "The council on foreign relations’ security tracker says over 37,000 people were killed and millions displaced by the Boko Haram conflict.\nPlateauAnd from Plateau state, there are reports that 14 people were confirmed dead in two separate attacks by gunmen.\n11 killed in BenueIn a related development, 11 people were killed in two separate incidents in Agatu local government area of Benue state.\nThe incident came barely one week after gunmen attacked and killed 27 people in Odugbeho community of the same local government area.\nThe council boss further said the suspects invaded the community Sunday night, killed the two people and burnt 21 houses."
  },
  {
    "headline": "PDP govs to NNPC: You’re starving States, LGs of funds",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) have accused the Nigeria National Petroleum Corporation (NNPC) of not making its statutory contributions to the Federation Allocation Account (FAAC) thereby starving the states and local governments and indeed Nigerians of funds.\nThis was contained in a communiqué issued Monday at the end of PDP Governors’ Forum meeting held in Uyo, Akwa Ibom state.\nChairman of the forum and Sokoto state Governor Aminu Waziri Tambuwal made the positions known at the end of the meeting.\nHe said: “The Forum examined the operations of the Nigeria National Petroleum Corporation (NNPC), and expressed alarm at the opaque manner it carries out its operations.\nThe federal government through the NNPC is a manager of our oil wealth merely as trustee for all Nigerians."
  },
  {
    "headline": "VIDEO: Super Falcons train ahead of US clash in 4-nation tourney",
    "summarized_story": "PreviousImproved regional Navy cooperation in focus at Gulf of Guinea forum"
  },
  {
    "headline": "Chief Tompolo did not demand inauguration of new NDDC Board- VATLAD -NigPilot",
    "summarized_story": "High Chief Tompolo has not compromised his demands of the Constitution and inauguration of the substantive board of NDDC as contained in the 7-day Ultimatum he issued on May 31, 2021, after the Minister of Niger Delta Affairs visited his Gbaramatu Kingdom in Warri, Delta State.\n“Instead, in his May 31, 2021 Statement giving 7-Day Ultimatum and his June 3, 2021, 30-Day Extension, he deliberately and consistently demanded, on behalf of the nine Oil-Producing States of NDDC, the immediate: “constitution of THE SUBSTANTIVE BOARD OF NDDC”.\nHe did not demand the constitution and inauguration of A BOARD of NDDC.\n“It will be against his commitment to restoring Peace, Order and Security in our Oil Producing South-South Region if he allows himself to be misled to further delay the inauguration of this substantive Board of NDDC.\n“As High Chief Tompolo rightly stated in his Statement, the renewed demand for the inauguration of the substantive Board of NDDC is for the Love of our Region and Country, Nigeria."
  },
  {
    "headline": "NAF college of Nursing gets accreditation -NigPilot",
    "summarized_story": "The National Board for Technical Education (NBTE) has granted approval for the commencement of National Diploma (ND) in Nursing Training at the Nigerian Air Force College of Nursing (NAFCON) Kaduna with effect from January 2021, the Nigeria Air Force has said in a statement.\nThe statement noted that the approval implies that NAFCON will terminate the three years nursing training and switch to ND in General Nursing.\nDirector of Public Relations and InformationNigerian Air Force, Air Commodore Edward Gabkwet in a statement explained that the Joint Admission and Matriculation Board (JAMB) has included NAFCON in its year 2022 brochure for candidates.\nThe service recalled that the Nigerian Air Force (NAF), in October 2019, commissioned the NAF School of Medical Sciences and Aviation Medicine (NAFSMSAM) at the NAF Base, Kaduna.\nThe School also organizes upgrading and refresher courses for various categories of NAF Medical Services personnel aimed at exposing them to global best practices in aviation medicine,” the statement concluded."
  },
  {
    "headline": "Re: 1,500 Christian Killed in 6 Months in Nigeria -NigPilot",
    "summarized_story": "He stated that at least 1,500 Christians have been killed in Nigeria in the last six months.\nYes, there are several issues of insecurity rocking the nation, but it is not nearly as bad as Mike Pompeo paints it to be.\nIslamic State West Africa Province, ISWAP, is all over African countries and has registered their presence through different attacks.\nThe Vienna Police Department confirmed that the attacker was an Islamic State sympathiser, and that the attack was motivated by Islamic extremism.\nIslamic State of Iraq and the Levant targeted Shia Muslims on 21 January 2021 in a clothing market in Tayaran Square, Baghdad."
  },
  {
    "headline": "African Centre for Supply Chain honours NITT chairman -NigPilot",
    "summarized_story": "Chairman, Governing Council of the Nigerian Institute of Transport Technology, NITT, Zaria in Kaduna State, Olorogun John Ejovwoke Onojeharho has been conferred with the Fellowship of the African Centre for Supply Chain, ACSC.\nThe Centre is an umbrella networking body of logistics and supply chain professionals across Africa established with the prime objective to provide a platform for in-depth research, education and training for the logistics and supply chain industry.\nIn his acceptance speech at the occasion, the NITT chairman expressed joy that his modest contributions to the transport and logistics industry had been recognized and thanked the ACSC Governing Council for the honour done to him.\n“I feel highly elated not just because I was offered the fellowship, but beyond the recognition, supply chain management is an emerging area in our economy and to be a pioneer fellow of a centre that is working assiduously to push that frontier of our economy is a great honour.\nHe attended many senior management courses both in Nigeria and outside the country including the EP Leadership Programmes for high flyers."
  },
  {
    "headline": "VIDEO: My People Say They Have No Land For Ranching – Umahi",
    "summarized_story": "Ebonyi State Governor, Dave Umahi, says his people have no land to give out for cattle ranching.\nGovernor Umahi stated this on Monday evening while appearing as a guest on Channels Television’s ‘Politics Today’.\nSo, the land is a different ball game altogether,” Umahi stated when asked whether he would provide land for ranching as a governor.\nREAD ALSO: Herders’ Threat: What Is Going On In Nigeria Is Unconstitutional, Clark Tells BuhariSpeaking further Umahi noted that his people have “said they have no land for ranching.\nIf I have one acre of land and I am talking about giving land for ranching, I should be talking about that particular land."
  },
  {
    "headline": "Unchecked Borrowing May Force Nigeria Into Avoidable Bankruptcy – PDP Governors",
    "summarized_story": "This formed part of the resolutions reached at the end of the meeting of the PDP Governors’ Forum held in Uyo, the Akwa Ibom State capital.\nThe borrowing spree of the APC administration if unchecked will certainly lead Nigeria into avoidable bankruptcy,” a communique issued at the end of the meeting read in part.\nThe governors decried that the debt profile of Nigeria with over 80 per cent of normal appropriation spent on debt servicing was rising and becoming uncontrollable.\nThe governors decried that President Muhammadu Buhari seemed not to be aware that the coercive instruments of state security were firmly within his hands and not the governors, considering his recent media interview on the subject.\nThey stated that despite being on the Exclusive List, the states spend huge sums of money to support the police and other security agencies to carry out their duties."
  },
  {
    "headline": "Gunmen Kill 12, Injure Five Locals In Plateau Attack",
    "summarized_story": "Gunmen suspected to be herdsmen have killed 12 people in an attack on Kuru community in Jos South Local Government Area of Plateau State.\nNo fewer than five other locals were injured during the incident, eyewitnesses told Channels Television on Monday morning during a visit to the scene of the attack.\nThey said following the attack, the injured victims were taken to a primary healthcare facility within the community for medical attention.\nMr Musa Bagos, the lawmaker representing Jos South/ Jos East Federal Constituency in the House of Representatives, was among those who visited the community where residents narrated their ordeal in the unprovoked attack.\nThe Management Committee Chairman of Jos South LGA, Gideon Davou, who was also at the scene, appealed to the residents to allow the security agencies to carry out a proper investigation into the incident."
  },
  {
    "headline": "70 Civil Groups Ask FG To Reverse Twitter Ban, Withdraw Prosecution Threat",
    "summarized_story": "Civil society organisations numbering 70 have called on the Federal Government to reverse the ban placed on Twitter and withdraw the threat to prosecute anyone using the app in the country.\n“We strongly condemn the arbitrary and unlawful suspension of Twitter in Nigeria, by the authorities, and the resulting restrictions on the human rights of people, as well as the threat to prosecute anyone using Twitter in Nigeria.\nThe groups also condemn the “directive” issued by the Nigerian Broadcasting Commission (NBC) for all broadcast stations to deactivate their Twitter accounts.\nAccording to the groups, Social media platforms have helped Nigerians to receive information, impart the same, hold useful conversations, and hold the Nigerian authorities to account.\nA clear example is how social media was used to drive police accountability in the #EndSARs protests last year."
  },
  {
    "headline": "Buhari Is A Willing Horse Nigerians Want To Ride To Death – Ngige",
    "summarized_story": "﻿Minister of Labour and Employment Dr Chris Ngige says President Muhammadu Buhari has tolerated a lot from critics, reiterating that many Nigerians want to stretch him (Buhari) beyond reasonable limits.\nSo, this president (Buhari) is a willing horse and you people (Nigerians) want to ride him to death,” Ngige said during the show.\nCalls for the presidential seat to be zoned to the southeast region have gathered momentum and sharply divided opinion in Africa’s most populous nation.\nBut Ngige has concurred with those who see the 2023 election as a time for the Igbos to get the seat.\nREAD ALSO: Open Grazing: Buhari Threatening To Override State Is Unacceptable – ClarkA Marginalized Region?"
  },
  {
    "headline": "Christine Amanpour announces cancer diagnosis, treatment course to viewers",
    "summarized_story": "CNN’s chief international anchor Christiane Amanpour told viewers Monday that she has been diagnosed with ovarian cancer.\nAmanpour, 63, is one of the best-known journalists in the world, in part due to her fearless coverage of international conflicts.\n“I want to applaud Christiane Amanpour for her candor, bravery and always working towards the greater good,” he said in a statement.\n“As a cancer survivor, I too encourage people to listen to their bodies and get all early cancer screenings available to them.\n“Thank you for being open” about the diagnosis, NBC’s chief foreign affairs correspondent and anchor Andrea Mitchell wrote to Amanpour on Twitter."
  },
  {
    "headline": "ISWAP releases UN staff, 9 Other captives",
    "summarized_story": "The sources also revealed that a businessman, Muazu Bawa, who was also kidnapped on that same day was also released along eight other captives all undergoing debriefing by the military.\nExecutive Director of Yobe State Network of Civil Society, Abubakar Baba Shehu, who also confirmed the release, prayed for more captives to be freed.\n“I was together with someone who called a family member of Alooma and he has confirmed the release of his brother.\nThis is encouraging news and we pray that more captives should be released soon,” Baba Shehu said.\nAdvertisementMeanwhile, friends of the freed captives have taken to facebook and other social media platforms to celebrate the release of their friends from Boko haram captivity."
  },
  {
    "headline": "Naftali Bennett succeeds Netanyahu as Israel’s Prime Minister",
    "summarized_story": "Israel’s parliament has narrowly voted in favor of a new coalition government, putting an end to Prime Minister Benjamin Netanyahu’s unprecedented 12-year rule.\nNaftali Bennett, a former Netanyahu ally turned bitter rival, took over as Prime Minister, presiding over a diverse and fragile coalition of eight parties with profound ideological differences.\nNetanyahu will continue to lead the Likud party and will serve as opposition leader.\nDuring the vote, Netanyahu remained silent.\nA dejected Netanyahu then sat in the opposition leader’s chair, wearing a black medical mask."
  },
  {
    "headline": "UK PM Johnson Delays Lockdown Easing for England by 4 Weeks",
    "summarized_story": "Under the government’s plan for coming out of lockdown, all restrictions on social contact were set to be lifted next Monday.\nThe delta variant first found in India is estimated by scientists advising the government to be between 40% and 80% more transmissible than the previous dominant strain.\nAcross Europe, many countries, including France, have tightened restrictions for British travelers to prevent the delta variant from spreading.\nDespite concerns about the delta variant, the U.K.’s vaccine rollout has won plaudits as one of the world’s speediest and most coherent.\nThe rapid rollout of vaccines and a strict months-long lockdown helped drive down the number of virus-related deaths in the U.K. in recent months."
  },
  {
    "headline": "NATO Leaders Declare China a Global Security Challenge",
    "summarized_story": "NATO leaders on Monday declared China a constant security challenge and said the Chinese are working to undermine global order, a message in sync with President Joe Biden’s efforts to get allies to speak out with a more unified voice against China’s trade, military and human rights practices.\nThe president said he was satisfied with the communique, although differences remain among the allies about how forcefully to criticize Beijing.\nChina is Germany’s top trading partner and is heavily dependent on Russia in fulfilling the country’s energy needs.\nBelgium Prime Minister Alexander de Croo said Biden’s presence “emphasizes the renewal of the transatlantic partnership.” De Croo said NATO allies were looking to get beyond four stormy years under the Trump administration and infighting among member countries.\nBiden’s itinerary in Europe has been shaped so that he would first gather with G-7 leaders and then with NATO allies in Brussels before his much-anticipated meeting with Putin in Geneva on Wednesday."
  },
  {
    "headline": "Bobi Wine Supporters Released After Six Months in Detention",
    "summarized_story": "Eighteen supporters of Uganda’s opposition politician Robert Kyagulanyi have been released by the military court in Kampala has released on bail.\nThe supporters of Mr Kyagulanyi, also known as Bobi Wine were arrested at an election campaign rally in December 2020.\nThey include Bobi Wine’s personal bodyguard Edward Sebuwufu, Eddie Mutwe, and his musician colleague Bukeni Ali known as Nubian Li.\nThey had been arrested in the Lake Victoria island district of Kalangala, during a rally at which Bobi Wine was also picked up and flown against his will to his home in Kampala in a military helicopter.\nDuring the election campaign season and the months following the January polls, Uganda witnessed a wave of arrests and alleged kidnaps of what are believed to be hundreds of opposition supporters."
  },
  {
    "headline": "Wole Soyinka Speaks on Open Grazing, Democracy Day and 2023 Elections",
    "summarized_story": "Nobel laureate Wole Soyinka was a guest on ARISE News on Monday to speak on burning national issues.\nHe reacted to a recent exclusive interview on ARISE NEWS by President Muhammadu Buhari.\nAccording to Soyinka, the President is not listening.\nSoyinka also said Nigeria may not celebrate another Democracy Day, while he also shared his thoughts on the forthcoming 2023 elections.\nWatch the engaging in interview…"
  },
  {
    "headline": "‘Buhari Isn’t Listening’: Soyinka Criticises President on Grazing Routes, Says Nigeria on a Nosedive",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has displayed his inability to listen to citizens and respect the decisions of the southern governors when he directed the Attorney General of the Federation, Abubakar Malami to produce a gazette, which drafted grazing routes in all parts of the country in the First Republic, that’s according to noble laureate Wole Soyinka.\nIn an appearance on ARISE News on Monday, Professor Soyinka faulted President Buhari’s stance on digging up a colonial law he says is meant to recover lands on behalf of certain private businesses.\nHe says the language of the President is disturbing because he may have felt that through his utterances he was on a roll while in actuality the nation is on a nosedive.\nWatch the interview."
  }
]