[
  {
    "headline": "Lecturer sues Sanwo-Olu, CP over COVID-19 test, demands N65m damages",
    "summarized_story": "Also joined in the suit are the Commissioner of Police in Lagos State (Fifth responder), Attorney General and Commissioner for Justice (fourth), and Dr Bowale, the Medical Director, OPD Mainland Hospital, Lagos State (third).\nShe prayed for an order of the court restraining Lagos State, its agents and the police from arresting her or making inimical publications against her pending the determination of the suit.\nShe also prayed to court for damages of N65m for her ordeal.\n“An order compelling the first, second, third and fourth respondents to pay to the applicant the sum of N10,000,000.00 (Ten million naira) as special damages to the applicant.\n“An order of general damages of N5,000,000.00 (five million naira) against the first, second, third and fourth respondents in favour of the applicant.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Set up judicial panel on UNILAG, others’ finances —Babalakin",
    "summarized_story": "Aformer Pro-Chancellor and chairman, Governing Council of University of Lagos, Dr Wale Babalakin, has advised the Federal Government to set up a judicial panel to look into the finances of UNILAG and other universities across Nigeria.\nHe added, “I am happy that the visitation panel recommended that an international accounting firm should look at the affairs of UNILAG.\nBabalakin-led Governing Council accused Ogundipe of misappropriation of funds and a panel was setup by the FG to investigate the allegations.\nHowever, while the panel was about completing his report, Babalakin resigned in September 2020, while Ogundipe was reinstated in November 2020.\nThe university system has completely collapsed; and I refused to be one of the boys."
  },
  {
    "headline": "Friends, families shower encomium on Mudirakat Thompson at 70",
    "summarized_story": "By Elizabeth UshieIt was an atmosphere of prise and blessings as children, families’ members, relatives and friends rallied around Alhaja Mudirakat Thompson on her 70th birthday.\nSpeaking to WO, children, friends, family members and relatives had so much to say about this amiable jewel and mother of three daughters.\nMy mum’s accommodating—Joke, first daughter Her first daughter Joke Thompson Yesufu said, “My mum deserves to be celebrated.\nShe’s a very hardworking woman, honest and highly disciplined—-Thompson, husbandHer husband, Alhaji Rauf Thompson said, “We have been married for 45 years.\nShe is a member of Kasunmu Ekemode by the virtue of her maternal grandfather."
  },
  {
    "headline": "Insecurity: FG is duty-bound to reintegrate bandits, kidnappers who surrender — Buhari’s Minister",
    "summarized_story": "Speaking on Tuesday night as a guest on Channels Television programme ‘Politics Today’, Dinyadi said there was still room for bandits to surrender to the government and be reintegrated into the wider society.\nAlso Read:He however stated that the ongoing onslaught against bandits in the North-West states of Katsina, Zamfara, Sokoto, amongst others by security forces will continue against the bandits, with security agencies working in synergy.\nOn whether the window of amnesty is still open for bandits willing to surrender, he said, “The issue of amnesty is a relative term.\n“Let us chronicle them, let us receive them, we cannot just throw these people away because they are all Nigerians.\n“With all pleasure, anybody willing to surrender and do it honourably and honestly, the government is ready to listen."
  },
  {
    "headline": "Rep Member Adefisoye awards bursaries to Constituents",
    "summarized_story": "Tajudeen AdefisoyeMember representing Idanre/Ifedore federal constituency at the National Assembly, Hon.\nTajudeen Adefisoye has set a new record with the award of bursaries and scholarships to 500 of his constituents in tertiary institutions across the country.\nAdefisoye approved the bursaries and scholarships payment to his deserving constituents on Tuesday, September 14, 2021.\nREAD ALSO:Reps member builds 3 schools, disburses 54 motorcycles, 66 arm wheel chairs to his constituents in KebbiThe federal lawmaker however, emphasize that the scheme would only be for students from Idanre/Idanre federal constituency.\nSpeaking on what informed the uncommon gesture of bursaries and scholarships, Adefisoye said it was borne out of his commitment to give lifelines to his constituents."
  },
  {
    "headline": "Competition: APWEN disburses cash to winners",
    "summarized_story": "Felicia Agubata Science Competition and Scholarship for girls in primary schools FASCOS, organized by the Association of Professional Women Engineers of Nigeria, APWEN Lagos Chapter under the leadership of Engr.\nMary Afolayan, the much-awaited cash disbursement to the winners of the competition was held at Vetland Primary School.\nwas witnessed by parents of the winners, teachers, the Ifako/Ijaye Local Government Education Board, as well as Association of Women Engineering of Nigeria, APWEN.\nSpeaking to the winners, the Vice President, APWEN, National, Engr.\nWe do not want out 0f school children."
  },
  {
    "headline": "Ensure fairness in addressing our demands — Health workers urge FG",
    "summarized_story": "By Chioma ObinnaHealth workers under the aegis of the Joint Health Sector Unions, JOHESU, has urged the Federal Government to ensure fairness in addressing the welfare demands of its members.\nThis was sequel to understandings at the heart of the rules of engagement the FG and JOHESU had in 2009 which the 2014 CBA simply amplified.\n“The NMA often suggests that the golden rule in health care in Nigeria remains that anything it does not endorse does not exist.\nJOHESU leadership will give your Ministry another opportunity to clean this stinking Augean stable in public interest,” he added.\n“As far back as July, 2015, the FMOH issued a Residency training circular for Pharmacists undergoing post-graduate training at the West Africa Post-Graduate College of Pharmacists (WAPCP).”Vanguard News Nigeria"
  },
  {
    "headline": "Army chief, Attahiru: AIB submits interim report on plane crash to Air Force",
    "summarized_story": "The Accident Investigation Bureau (AIB) has submitted an interim report on the plane crash that killed ex-Nigerian Army chief, Lt-Gen Ibrahim Attahiru and other officers.\nAkin Olateru presented the document to the Chief of Air Staff (CAS), Air Marshal Amao at the NAF Headquarters, Abuja.\nA NAF King Air 350 aircraft crashed at the Kaduna airport on May 21, 2021.\nA statement on Wednesday by NAF Director of Information, Edward Gabkwet and AIB image-maker, Tunji Oketunbi gave a brief insight into the report.\nIt said after the incident, Amao directed that a joint investigative body consisting of experienced NAF safety officers and the AIB be constituted to investigate."
  },
  {
    "headline": "Abia Assembly summons IPMAN over increased cost of fuel",
    "summarized_story": "The Abia State House of Assembly has expressed concern on the exorbitant increase of the petroleum products in the state.\nThe chairman of the committee, Hon.\nThe development has brought hardship on the people who groan under the arbitrary increase thereby causing the Abia state House of Assembly to intervene by directing that the leadership of the petroleum marketers be summoned.\nThe MDAs that appeared before the Committee on Wednesday, are the Ministry of Industry, Office of the Secretary to the State Government, Abia State Environmental Protection Agency (ASEPA) and the Abia State Open Spaces Development Commission.\nMembers of the house committee on Public Accounts, Due Process and Anti Corruption are; Hon Paul Tharibo, Hon Abraham Oba, Hon Godwin Adiele and Hon Emmanuel Ndubuisi."
  },
  {
    "headline": "Gbajabiamila denies comparing IPOB, Yoruba Nation agitators with Boko Haram, ISWAP",
    "summarized_story": "House of Representatives Speaker, Femi Gbajabiamila, has denied comparing the Indigenous People of Biafra (IPOB) and Yoruba Nation agitators to Boko Haram and Islamic State’s West Africa Province (ISWAP).\nThe representative of the Surulere area of Lagos is under fire for his comments at Wednesday’s plenary.\nA statement Wednesday night by his spokesman, Lanre Fasasi insisted there was no mention of any group during Gbaja’s address.\nHe noted that the Speaker condemned miscreants and criminals for taking advantage of the separatist agitations to carry out unscrupulous acts.\nFasasi said his principal expressed concern about emerging threats that present the clear and present danger."
  },
  {
    "headline": "Kwara condemns poor performance of wastes managers in Ilorin metropolis",
    "summarized_story": "The Kwara State Environment Commissioner, Remilekun Banigbe, has condemned social wastes managers for their poor performance in the evacuation of wastes within Ilorin metropolis.\nSpeaking at a meeting with the social wastes managers in her office in Ilorin, the commissioner said despite several warnings to the wastes managers to be alive to their responsibilities, the reverse has been the case.\nShe said the state government could no longer tolerate the lackadaisical attitude of the wastes managers.\nBanigbe charged them to synergize with the ministry of environment as a team to make the state hygienically safe for the citizens.\nThe Permanent Secretary of the ministry, Pastor Abraham Kola Ojo, said the wastes remained an eyesore, hence the urgent need for evacuation to ensure cleanliness of Ilorin metropolis."
  },
  {
    "headline": "Ex-Rivers Governor, Peter Odili placed on EFCC watchlist",
    "summarized_story": "Former Rivers State Governor, Peter Odili, has been placed on the watch list of the Economic and Financial Crimes Commission (EFCC ) over an alleged economic issues.\nHowever, in a counter affidavit by the Immigration Service, It was revealed that Odili passport was seized because he is on the watch list of the EFCC.\nThe affidavit deposed to by one Okwe Ernest of the Legal Department of the Immigration Service averred that Odili was watch listed at the request of the EFCC.\nThe Immigration Service claimed that the former governor was not entitled to the request presented before the court and that his suit should be dismissed for being premature.\nThe affidavit said that since the passport was seized, Odili has never for once demanded for its release or cared to know why it was seized."
  },
  {
    "headline": "Speaker: secession agitators not different from Boko Haram",
    "summarized_story": "By Tony Akowe and Nicholas Kalu, Abuja- Advertisement -Secession agitators are not different from Boko Haram and Islamic State West African Province (ISWAP) members, House of Representatives Speaker Femi Gbajabiamila has said.\nHe described them as criminals masquerading as secession activists to unleash mayhem on innocent Nigerians and engage in economic sabotage.\nHe used the opportunity to read a letter by President Muhammadu Buhari seeking approval to borrow $4 billion and €710 million loans to fund the 2021 budget.\n“Thus far, we have rightly focused our national security concerns on the machinations of extremist insurgents who seek to remake our world in the image of their discredited theocracy and bandits who maraud and terrorise whole regions for profit.\nThe Speaker said the House would prioritise national security bills that seek to implement the recommendations of the security summit organised by the House during the new legislative session."
  },
  {
    "headline": "Presidency warns on Yoruba agitators, IPOB alliance",
    "summarized_story": "By Bolaji Ogundele, Abuja• UN should ignore demands• Speaker: secession agitators not different from Boko Haram- Advertisement -The Presidency on Wednesday warned Yoruba Nation agitators against an alliance with the Indigenous People of Biafra (IPOB).\nThe Presidency asked the United Nations to ignore the demands made by the Yoruba Nation agitators, IPOB members in the Diaspora and Middle Belt activists for not being in line with the global body’s values.\nThe Yoruba Nation agitators, in collaboration with IPOB members in the Diaspora on Tuesday, stage a protest at the UN headquarters in New York, United States.\n“It was, however shocking, to see “Yoruba Nation” advocates yesterday (Tuesday) unequivocally throw their lot in with IPOB.\n“Without doubt, Nigerians and the entire world will judge Yoruba Nation by the company it keeps."
  },
  {
    "headline": "Governors meet in Enugu over VAT, others",
    "summarized_story": "By Bassey Anthony, Uyo; Damian Duruiheoma, Enugu; Toba Adedeji, Osogbo• Oyetola, Udom sign Anti-Open Grazing Bill- Advertisement -The Value Added Tax (VAT), Inter State boundary and security will top the agenda of the southern governors’ meeting on Thursday in Enugu.\nHowever, in the Southeast, only Enugu State has a law against open grazing.\nIgbo youths on Wednesday urged the Southern governors to prevail on Southest governors to legalise the ban on open grazing in the region.\nIn a statement in Enugu, the President-General of Ohanaeze Youth Congress (OYC), Okwu Nnabuike, urged the Southern governors, who are meeting in Enugu today to prevail on other Southeast governors to legalise the ban.\nHe lamented that Southeast governors were only paying lip service to their resolutions."
  },
  {
    "headline": "Buhari presides over FEC meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is current presiding over a virtual meeting of the Federal Executive Council (FEC) at the conference room of the First Lady’s office, State House Abuja.\nVice President Yemi Osinbajo and Secretary to Government of the Federation Boss Mustapha are among those physically present at the meeting.\nThe day’s meeting was preceded by the swearing-in of three National Commissioners of the Independent National Electoral Commission (INEC).\nThose sworn-in are Dr Baba Bila representing the North East zone, Professor Sani Adam, North Central and Professor Abdullahi Abdu, representing North West.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "How Zamfara Emir was kidnapped – Police",
    "summarized_story": "(NAN)The Kaduna Police Command has confirmed the abduction of the Emir of Bungudu, Zamfara State, Alhaji Hassan Atto, and an unspecified number of commuters, along the Kaduna – Abuja highway.\n“An unspecified number of people were suspected to have been kidnapped, while two others sustained varying degrees of injuries and are currently receiving medical treatment.\n“Equally, available information indicated that the Emir of Bungudu, Zamfara State, His Royal Highness (HRH) Alhaji Hassan Atto, is among the people abducted to an unknown destination,” he said.\nJalige added that four vehicles were recovered from the scene, but that the exact number of persons kidnapped was yet to be ascertained.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "UAE names 6 Nigerians among global terrorists sponsors",
    "summarized_story": "By Louis IbahThe United Arab Emirates (UAE), yesterday, named six Nigerians among 35 other nationals and 15 organisations allegedly financing terrorism.\n83 of 2021 issued by the UAE cabinet after accusing the persons and those organisations of supporting terrorism.\nThe other nationals were from Yemen, Afghanistan, Saudi Arabia, Syria, Iran, Iraq, UK, Saint Kitts and Nevis,Russia, India, UAE and Lebanon.\nThe list comes amid criticisms by a cross section of Nigerians on the failure of the Federal Government to name sponsors of terrorists attacks in the country.\nThe former military commodore said terrorists arrested in the past years had mentioned their names as their sponsors."
  },
  {
    "headline": "Wike, Kyari, Ganduje, Bello, Buni, Onyema, Cubana, Ado, Shaibu clinch The Sun Awards 2020",
    "summarized_story": "The Sun Publishing Limited, publishers of Daily Sun, Saturday Sun, Sunday Sun and Sporting Sun, has announced winners of The Sun Awards for 2020.\nGen. Mohammed Buba Marwa (retd), Chairman, National Drug Law Enforcement Agency (NDLEA) and Brig.\nHospitality impressiaro, Chief Obinna Iyiegbu (Obi Cubana), will receive the Hospitality Icon award, while Mr. Kanayo O. Kanaya, MFR, won the Nollywood Icon award.\nAlhaji Mustapha Ado, Chairman, Ammasco International Limited, Kano and Chief Ebuka Onunkwo, Chairman, Seahorse Lubricant Industries, Ozubulu will receive Industrialist of the Year award.\nDeputy Governor of Edo State, Comrade Philip Shaibu, is the winner of Sports Personality of the Year Award."
  },
  {
    "headline": "Ugwuanyi signs anti-open grazing bill into law",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State has signed the anti-open grazing bill into law, at the Government House, Enugu.\nThe bill which is for a law to prohibit open grazing, regulate cattle ranching, and for connected purposes was recently passed by the Enugu State House of Assembly.\nLeader of the House, Ikechukwu Ezeugwu, had explained after the passage of the bill, that it would be cited as the “Prohibition of Open Grazing and Cattle Ranching Law of Enugu State” after the governor’s assent.\nGovernor Ugwuanyi’s assent to this bill is expected to improve security and peace in the state.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Odili Sues Immigration over Seized Passport, NIS Says Ex-gov on EFCC’s Watch List",
    "summarized_story": "In the fundermental rights enforcement suit, he claimed that the international passport with numbers B50031305 was seized from him on June 20, 2021 by operatives of the Immigration Service and had since been witheld.\nHowever in a counter affidavit by the Immigration Service, It was revealed that Odili’s passport was seized because he was on the watch list of the EFCC.\nThe affidavit deposed to by one Okwe Ernest of the Legal Department of the Immigration Service averred that Odili was watch listed at the request of the EFCC.\nThe Immigration Service claimed that the former governor was not entitled to the request presented before the court and that his suit should be dismissed for being premature.\nThe affidavit said that since the passport was seized, Odili had never for once demanded for its release or cared to know why it was seized."
  },
  {
    "headline": "Twitter Ban to be Lifted Soon, Says Information Minister",
    "summarized_story": "By Deji ElumoyeThe Federal Government has disclosed that the suspension placed on the operations of the microblogging platform, Twitter, in Nigeria will be lifted soon.\nInformation and Culture Minister, Lai Mohammed, told newsmen Wednesday at the end of the weekly Federal Executive Council (FEC) meeting presided over by President Muhammadu Buhari at the State House, Abuja that the issue was almost being resolved between the government and the microblogging site.\nAccording to him: “We have gone very far, I won’t be specific but we have gone very far, and honestly, it’s just going to be very, very soon, just take my word for that.\n“Honestly, I can’t be more specific than what I’ve told you that lifting of the suspension is going to be very soon.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Malami Writes Govs over Stamp Duty, Says No Recoveries Yet",
    "summarized_story": "Says no recoveries yetBy Alex EnumahThe Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami (SAN), has written the 36 state governors of the federation regarding the state of stamp duty collection and remittance in the country.\nGwandu noted that Section 111 of the Stamp Duty Act granted the AGF an exclusive power to recover any outstanding payment or remittances related to stamp duty.\nHe explained that what the AGF did was to activate those powers, conduct the audit and recovery of back years stamp duty in collaboration with stakeholders.\nOnly last month, the attorneys-general of the 36 states have sued Malami over the alleged failure of the federal government to remit funds generated from stamp duties into states’ accounts.\nThe states argued that they are the sole authority to collect stamp duties and not the federal government."
  },
  {
    "headline": "News in Photographs: Buhari Swears in New INEC Commissioners",
    "summarized_story": "President Muhammadu Buhari has sworn in new Independent National Election Commission (INEC) Commissioners.\nThe new INEC Commissioners were sworn in at the State House Abuja where Buhari presided over the weekly Federal Executive Council meeting WednesdayThe three new INEC Commissioners are Dr. Baba Bila, Prof Abdullahi Abdu Zuru and Prof Sani Mohammad Adam (SAN).\nSee photos.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Nigeria Surpasses 200,000 COVID-19 Infections, 18 Months After First Reported Case",
    "summarized_story": "The NCDC, via its verified website Wednesday morning, said that Nigeria’s COVID-19 cases had jumped to 200,057.\nThe Public Health agency registered 519 additional COVID-19 infections on Tuesday from 14 states and the Federal Capital Territory (FCT).\nIt stated that the 519 additional new cases in the country represented an increase from the 387 cases reported on Monday.\n“Today’s report includes: Four states with zero cases reported: Ekiti, Nasarawa, Osun and Sokoto.\nThe agency also said that the COVID-19 pandemic killed 18 Nigerians on Tuesday, to push the tally of total fatalities in the country to 2,637."
  },
  {
    "headline": "BREAKING: Nigeria's Accident Investigation Bureau Submits 27 Findings On Crash That Killed Ex-Chief Of Army Staff, Others",
    "summarized_story": "Three months after the unfortunate incident that claimed the lives of 11 military personnel, including former Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, the Accident Investigation Bureau (AIB), Nigeria has submitted its interim report to the Nigerian Air Force.\nFollowing the crash, AIB was directed by NAF to break away from protocol and investigate the crash.\nThe statement was titled, ‘Accident Investigation Bureau Submits Interim Report On Aircraft Accident Involving Nigerian Air Force King Air-350 Aircraft To The Chief Of Air Staff’.\nAccording to him, the successful collaboration is a clear indication of the potency of collaboration in aircraft accident investigation, which must be encouraged.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented."
  },
  {
    "headline": "BREAKING: Nigeria's Accident Investigation Bureau Submits 27 Findings On Crash That Killed Ex-Chief Of Army Staff, Others",
    "summarized_story": "Three months after the unfortunate incident that claimed the lives of 11 military personnel, including former Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, the Accident Investigation Bureau (AIB), Nigeria has submitted its interim report to the Nigerian Air Force.\nFollowing the crash, AIB was directed by NAF to break away from protocol and investigate the crash.\nThe statement was titled, ‘Accident Investigation Bureau Submits Interim Report On Aircraft Accident Involving Nigerian Air Force King Air-350 Aircraft To The Chief Of Air Staff’.\nAccording to him, the successful collaboration is a clear indication of the potency of collaboration in aircraft accident investigation, which must be encouraged.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented."
  },
  {
    "headline": "Ten Dead As Nigerian Air Force Fighter Jet Targeting Boko Haram ‘Accidentally’ Bombs Yobe Village",
    "summarized_story": "The Chairman of Yunusari Local Government Area, Alhaji Bukar Gaji also confirmed the incident.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\nRecently, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments."
  },
  {
    "headline": "Ten Dead As Nigerian Air Force Fighter Jet Targeting Boko Haram ‘Accidentally’ Bombs Yobe Village",
    "summarized_story": "The Chairman of Yunusari Local Government Area, Alhaji Bukar Gaji also confirmed the incident.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\nRecently, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments."
  },
  {
    "headline": "Ten Dead As Nigerian Air Force Fighter Jet Targeting Boko Haram ‘Accidentally’ Bombs Yobe Village",
    "summarized_story": "The Chairman of Yunusari Local Government Area, Alhaji Bukar Gaji also confirmed the incident.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\nRecently, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments."
  },
  {
    "headline": "UK records 125% increase in sponsored study grants for Nigerians -- 11,361 visas in one year",
    "summarized_story": "The number of Nigerian students granted sponsored study visas to the UK has increased by over 100 percent in one year.\nWithin a year — June 2020 to June 2021 — the number of Nigerian students in the UK who received sponsored grants doubled by 125 percent, with over 11,000 study visas granted within the period under review.\nAdvertisementIn terms of percentage increase, Nigeria has the third highest number of nationalities on sponsored visa grants, after China and India.\n“While many nationalities saw decreases in Sponsored study grants in the latest year, some experienced substantial increases,” information from the UK government website reads.\n“Nigerian nationals continue to see an increase in Sponsored Study grants compared to the previous year, increasing to a record high of 20,427, making them the third largest nationality group granted Sponsored study visas this year, an increase of 11,361 (+125%) on the year ending June 2020."
  },
  {
    "headline": "UK records 125% increase in sponsored study grants for Nigerians -- 11,361 visas in one year",
    "summarized_story": "The number of Nigerian students granted sponsored study visas to the UK has increased by over 100 percent in one year.\nWithin a year — June 2020 to June 2021 — the number of Nigerian students in the UK who received sponsored grants doubled by 125 percent, with over 11,000 study visas granted within the period under review.\nAdvertisementIn terms of percentage increase, Nigeria has the third highest number of nationalities on sponsored visa grants, after China and India.\n“While many nationalities saw decreases in Sponsored study grants in the latest year, some experienced substantial increases,” information from the UK government website reads.\n“Nigerian nationals continue to see an increase in Sponsored Study grants compared to the previous year, increasing to a record high of 20,427, making them the third largest nationality group granted Sponsored study visas this year, an increase of 11,361 (+125%) on the year ending June 2020."
  },
  {
    "headline": "Umahi: Only Buhari can decide who becomes APC national chairman",
    "summarized_story": "David Umahi, governor of Ebonyi, says President Muhammadu Buhari has a significant role to play on who becomes the national chairman of the All Progressives Congress (APC).\nUmahi, who said Buhari will decide how the next APC chairman will emerge, added that he will support Sheriff if the contest is thrown open.\n“I thank you (Sheriff) for informing us of your decision to contest the APC national chairmanship, but the president, who is the leader of the party, has a role to play.\nThe former Borno governor commended Umahi for his governance efforts, adding that the APC is proud of his achievements in the state.\nSheriff also said the next Nigerian president can come from any part of the country, adding that Buhari should be supported to complete his tenure."
  },
  {
    "headline": "Umahi: Only Buhari can decide who becomes APC national chairman",
    "summarized_story": "David Umahi, governor of Ebonyi, says President Muhammadu Buhari has a significant role to play on who becomes the national chairman of the All Progressives Congress (APC).\nUmahi, who said Buhari will decide how the next APC chairman will emerge, added that he will support Sheriff if the contest is thrown open.\n“I thank you (Sheriff) for informing us of your decision to contest the APC national chairmanship, but the president, who is the leader of the party, has a role to play.\nThe former Borno governor commended Umahi for his governance efforts, adding that the APC is proud of his achievements in the state.\nSheriff also said the next Nigerian president can come from any part of the country, adding that Buhari should be supported to complete his tenure."
  },
  {
    "headline": "Insecurity: One million Nigerian children afraid to return to school, says UNICEF",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) says at least one million children in Nigeria are unable to return to school over fear of attacks.\n“As more than 37 million Nigerian children start the new school year this month, at least one million are being left behind, afraid to return to school due to insecurity,” the statement reads.\n“So far, this year, there have been 20 attacks on schools in Nigeria, with 1,436 children abducted and 16 children dead.\n“For the most vulnerable children, including children affected by conflict, girl children, and children with disabilities, their risk of never stepping into a classroom in their lifetime is skyrocketing,” he said.\nThis moment is being stolen from around a million Nigerian children this year, as insecurity threatens their safety and education."
  },
  {
    "headline": "How BFree is improving trust in the lending space",
    "summarized_story": "This incident is one out of many which indicate that digital lenders will go the extra mile, sometimes using unethical methods, to get their loans back.\nThe sanction served as a clarion call for digital lenders to use ethical alternative methods to collect loans.\nBut it didn’t take long to see that there were some cracks in the collection process.\nAt BFree customers are appraised based on two factors: willingness and capability to pay.\nFlosbach believes that BFree’s ultimate goal is to increase trust in the African lending space."
  },
  {
    "headline": "Goldman Sachs-backed Jumo launches its first loan product in Ivory Coast",
    "summarized_story": "South Africa-based Jumo has partnered with MANSA Bank and MTN Mobile Financial Services to provide loans to entrepreneurs and small businesses in Ivory Coast.\nIn Ivory Coast, which is Jumo’s most recent market, the collaboration will see the company introduce its new short-term and small-scale loan product, VitKash, built in partnership with MANSA and offered through MTN’s mobile money platform.\nThe recent expansion was driven by a number of factors, which according to Kone make the West African nation an “attractive market” for Jumo.\n“Ivory Coast has all the characteristics of an attractive market with high growth potential.\n“In the WAMU (West African Monetary Union) zone, there is a strong will from the BCEAO (the central bank of 8 Francophone West African States) to improve financial inclusion and financial literacy,” Kone said."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "DMO finalises plan to restructure CBN’s over N10trn ‘ways, means’ advances to govt",
    "summarized_story": "But Nigeria’s public debt stock grew by 7.75 percent to N35.465 trillion by the end of June 2021 from N32.916 trillion in December 2020, new figures from the DMO show.\nIn terms of the mix, external borrowing was 38.66%, while domestic was 61.34 percent.\nTotal public debt stock comprises the Domestic and External Debts of the FGN, 36 State Governments and the FCT.\nAnd the third is new borrowings that may come from those stand-alones like those that may be in the medium term external borrowing plan.\nThe third component of external borrowing is the commercial loans, including the Eurobonds, Diaspora bond which account for 31.88 percent."
  },
  {
    "headline": "Access Bank’s $500m Eurobond makes history with record subscription",
    "summarized_story": "Foreign investors’ confidence in Nigeria’s biggest lender, Access Bank, has earned the lender a record as the first to attract the largest order book ever for a Nigerian bank Eurobond transaction.\nAccess Bank issued a $500 million Senior Unsecured Eurobond from the international debt capital market, a notice from the financial institution to the Nigeria Exchange Group (NGX) on Wednesday confirmed.\nRead Also: Access Bank to issue Eurobond this weekListed on the main market of the London Stock Exchange, the 5-year unsecured bond will mature in September 2026.\nRecall that Access Bank recently launched an African expansion strategy to accomplish its vision to be the World’s Most Respected African Bank.\nThis feat was achieved through Access Bank’s unique business model that supports the corporate and retail value chains throughout the African continent and beyond."
  },
  {
    "headline": "Nigerians canvass integrity of the ballot on World Democracy Day",
    "summarized_story": "They also canvassed the enthronement of the two pillars of democracy, which are the rule of law and the integrity of the ballot.\n“If this was a democracy, I can guarantee you that by the nature of democracy, the interest of the people would be taken care of.\nIf you look at the poverty data as at the day Buhari took over power, you would see that we were not the global capital of extreme poverty, but with Buhari we became the global capital of extreme poverty.\nIf you look at our Transparent International Corruption Perception Index reading, as at the day Buhari took over, I think we were 136th, today we are 149th.\nWhen Buhari took over, it was 197."
  },
  {
    "headline": "COVID-19 infection in Edo rises to 1098, mortalities hit 54, as govt urges vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the vaccination of citizens across the state’s 18 local government areas, urging those who have been inoculated to get vaccinated in order to remain healthy and protected against the deadly virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nHe said the state recorded the death of another person who has not been inoculated with the COVID-19 vaccine, as the state confirmed 63 new cases.\nThe total number of mortalities in the third wave of the pandemic stands at 54.\nReassuring the government’s commitment to containing the pandemic and protecting Edo citizens, the Incident Manager said Edo has inoculated over 68,533 persons since the commencement of the second phase vaccination exercise, with 56,482 persons vaccinated with Moderna, while 12,051 others were inoculated with the AstraZeneca vaccines."
  },
  {
    "headline": "Ekewan Road Project to be completed Sept 2022 – Edo Govt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State government has assured commuters and residents of Ekewan Road axis of Benin City that government would complete the ongoing construction and dualisation of the road by September next year.\nFerguson Enabule gave the assurance in Benin City during an inspection visit to the area to assess the level of work done so far by the contractor.\nHe appealed to the residents to be patient with government, noting that work on the project would resume after the rains.\nAccording to him, the contract has cash backing as government was not owing the contractor, a position attested to by Mr. Yehya.\nThe youths expressed satisfaction with the state of work done on the project so far, and lauded the developmental strides of the state Governor, Mr Godwin Obaseki in the area."
  },
  {
    "headline": "COVID-19 3rd wave: Edo enforces ‘no proof of vaccination, no entry’ in govt offices …insists on compliance with non-pharmaceutical interventions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, in the early hours of Wednesday, deployed special teams to various government-owned facilities across the state to enforce the restriction on access to large public gatherings for persons without evidence of COVID-19 vaccination.\nAccording to him, “Today’s enforcement has shown that the government is committed to ensuring the health and safety of Edo residents.\nThis move by the Edo State Government is for the interest of the people; to save them from being infected by the virus.\n“I encourage everyone to form the habit of going around with their vaccination cards so they will not be embarrassed.\nWe will continue to enforce the State laws as it concerns the safety of our people in Edo State,” Haruna added."
  },
  {
    "headline": "BETSY OBASEKI WOMEN FOOTBALL TOURNAMENT: Twelve Clubs Confirm Participation …as Tourney kicks off September 27 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAs the commencement of the maiden edition of Betsy Obaseki Women Football Tournament, BOWFT approaches, twelve national women football clubs have written to confirm their participation in the tournament.\nThe women football extravaganza, according to the organisers is scheduled to hold in the ancient city of Benin, Edo State beginning from September 27, 2021 and runs till October 4, 2021.\nA statement from the Head, Media and Communications, LOC, Comrade Ebomhiana Musa says the 12 clubs are Edo Queens FC, Rivers Angels FC, Bayelsa Queens FC, Sunshine Queens FC, Robo FC, Heartland Queens FC, Royal Queens FC, Confluence Queens FC, Kaduna Queens FC, Naija Ratels FC, Fortress Ladies FC and Rolly FC.\nThe statement added that the preseason tournament which attracts big names in the football World across the country is expected to be played in four different venues in Benin.\nSo, for the organisers and the participating clubs, it is a win win opportunity, the statement added."
  },
  {
    "headline": "AIB submits report on crash that killed Nigeria’s army chief Attahiru",
    "summarized_story": "ADVERTISEMENTThe Accident Investigation Bureau (AIB) has submitted an interim report on the Air Force aircraft, King Air 350, that crashed killing then chief of army staff, Ibrahim Attahiru, and 10 others.\nPresenting the report to the Chief of Air Staff, Isyaka Amao, on Wednesday, the Chief Executive Officer of AIB, Akin Olateru, said the report contained 27 findings and eight recommendations for immediate implementation.\nPREMIUM TIMES had reported how an air force aircraft conveying Mr Attahiru and other senior officers of the army crashed around Kaduna airport.\nAccording to him, the successful collaboration is a clear indication of the potency of collaboration in aircraft accident investigation, which must be encouraged.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Lagos-Ota Road ready in December – Abiodun assures",
    "summarized_story": "Abiodun noted that the palliative work on the roads is to reduce the hardship being experienced by commuters.\nThe governor also said the failed portions, which would be reconstructed by the Federal Road Maintenance Agency (FERMA), would cost N13.4bn and would be part of the N56bn contract sum.\n“In the meantime, the Minister has graciously instructed that FERMA fixes those places and immediately begin to carry out palliative works on that road,” he said.\nPapalanto is almost N70 billion and also the Epe-Ijebu-Ode road going through Odogbolu road, it is another road he has accepted to do”.\nOn the Ota- Idi-Iroko road, the Minister said measurements, designs and office work were going on just as the State government was committed to clearing the road for construction of gutters to commence."
  },
  {
    "headline": "Bamidele, Obokun East LCDA Chair hails Senator Iyiola Omisore on his birthday",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Caretaker Chairman of Obokun East Local Council Development Area (LCDA) of Osun State, Hon.\nBello Saliu Bamidele, has joined other well wishers in rejoicing with former Deputy Governor of the state, Senator Iyiola Omisore on the occasion of his birthday anniversary, describing him as a political Juggernaut.\nHe described Senator Omisore as a grassroot politician and a lover of his people whose priority remains how to make people happy .\nAs a lover of democracy, Bamidele attested to the steadfastness of Senator Iyiola Omisore and his investment in promoting democracy and good governance through sharing of wisdom and experience with his political associates.\n“On behalf of the good people of Obokun East LCDA, I joined your family, friends, political associates and well wishers to congratulate you on the special day of yours."
  },
  {
    "headline": "$34b untapped remittances: Experts seek BDC involvement",
    "summarized_story": "Findings have also shown that forex remittances from Nigerians in the Diaspora far exceeded the country’s earnings from crude oil export last year.\nDiaspora Remittances and BDCsThe BDCs have for years supported Nigeria’s growth agenda and CBN’s commitment to exchange rate stability.\nGwadabe explained that Diaspora remittances represent household income from foreign economies arising mainly from the temporary or permanent movement of people to those economies.\nConnecting BDCs’ to Remittance BusinessFinancial pundits have continued to give reasons why BDCs should be brought into the Diaspora remittance business.\nThe reason for establishing these institutions in 1989 was to broaden the forex market and improve accessibility to hard currency."
  },
  {
    "headline": "Access Bank launches $500m Senior Unsecured Eurobond.",
    "summarized_story": "Nigeria’s largest bank by assets base, Access Bank Plc, has announced successful launch of a $500 million 144A/RegS Senior Unsecured Eurobond – 5-year unsecured note under the Bank’s $1.5billion Global Note programme – as part of its Global Medium-Term Note Programme.\nThe offering achieved the lowest (outstanding) Nigerian bank Eurobond coupon, supported by an over 3x oversubscribed orderbook of over $1.6 billion, which represents the largest orderbook ever for a Nigerian bank Eurobond transaction.\nThe coupon of 6.125% is another first in the corporate Eurobond issuance space.\nCommenting on the Eurobond Issuance, the Group Managing Director of Access Bank, Dr Herbert Wigwe said: ’’At Access Bank we remain committed to our vision to become the World’s Most Respected African Bank and Africa’s Gateway to the World.\nThe success of our US$500 million Senior Unsecured Eurobond is yet another stride towards the realisation of that vision and underscores our investors’ confidence in the Access Bank story."
  },
  {
    "headline": "Ethnic Youths Alert On Plot To Discredit CBN Gov",
    "summarized_story": "The council of Ethnic youth leaders of Nigeria has raised the alarm over plots to discredit the Central Bank Of Nigeria ( CBN) governor, Godwin Emiefele.\nThe youth ethnic group is made up of Oduduwa Youth Council, Arewa Consultative Youth Movement, Middle Belt Youth Council, Ohaneze Youth movement, and Niger Delta Council of Youths.\nADVERTISEMENTIn a press conference, the President of the Middle belt youth movement, Maliga Godwin who read the speech on behalf of the group in Abuja, said they were approached on this sinister plan to solicit their help.\nAccording to him, the belief is that this disruption would be enormous to bring the economy down, crash it completely and thereby put the President under pressure to sack the CBN Governor.\n“We agreed that the economic and monetary policies of the government being championed by the CBN Governor have stabilized the economy and provided jobs for Nigerian youths more than any other CBN leadership in Nigeria’s history."
  },
  {
    "headline": "Ethnic Youths Alert On Plot To Discredit CBN Gov",
    "summarized_story": "The council of Ethnic youth leaders of Nigeria has raised the alarm over plots to discredit the Central Bank Of Nigeria ( CBN) governor, Godwin Emiefele.\nThe youth ethnic group is made up of Oduduwa Youth Council, Arewa Consultative Youth Movement, Middle Belt Youth Council, Ohaneze Youth movement, and Niger Delta Council of Youths.\nADVERTISEMENTIn a press conference, the President of the Middle belt youth movement, Maliga Godwin who read the speech on behalf of the group in Abuja, said they were approached on this sinister plan to solicit their help.\nAccording to him, the belief is that this disruption would be enormous to bring the economy down, crash it completely and thereby put the President under pressure to sack the CBN Governor.\n“We agreed that the economic and monetary policies of the government being championed by the CBN Governor have stabilized the economy and provided jobs for Nigerian youths more than any other CBN leadership in Nigeria’s history."
  },
  {
    "headline": "Arewa Youths Dissociate Selves From Plot To Smear CBN Gov",
    "summarized_story": "The leadership of the Arewa Consultative Youths Movement has noted with dismay the orchestrated negative media campaign being spearheaded by a certain Mohammed Salihu, who parades himself as the Speaker of the Arewa Youths Assembly.\n“The several billions of Naira invested by the CBN in agricultural and manufacturing sectors for the benefit of the Nigerian masses would have ended in their pockets and used to fund their political ambitions.\n“We are therefore, by this statement, disowning Salihu, his sponsors, his unsuspecting followers and his false claims that cannot be proved.\n“We reinstate our supports for the CBN governor and members of his team because we are satisfied that the various reforms already introduced have been stabilizing the economy and will continue to improve on it.\n“We urge Mr. Emefiele and his team not to be distracted by what we have come to realize as mere market noise by disgruntled politicians who can best be described as enemies of the Nigerian people."
  },
  {
    "headline": "Arewa Youths Dissociate Selves From Plot To Smear CBN Gov",
    "summarized_story": "The leadership of the Arewa Consultative Youths Movement has noted with dismay the orchestrated negative media campaign being spearheaded by a certain Mohammed Salihu, who parades himself as the Speaker of the Arewa Youths Assembly.\n“The several billions of Naira invested by the CBN in agricultural and manufacturing sectors for the benefit of the Nigerian masses would have ended in their pockets and used to fund their political ambitions.\n“We are therefore, by this statement, disowning Salihu, his sponsors, his unsuspecting followers and his false claims that cannot be proved.\n“We reinstate our supports for the CBN governor and members of his team because we are satisfied that the various reforms already introduced have been stabilizing the economy and will continue to improve on it.\n“We urge Mr. Emefiele and his team not to be distracted by what we have come to realize as mere market noise by disgruntled politicians who can best be described as enemies of the Nigerian people."
  },
  {
    "headline": "Kaduna Crash: AIB Submits Interim Report To Chief Of Air Staff",
    "summarized_story": "The Accident Investigation Bureau (AIB) has submitted an interim report on the ill-fated Nigerian Air Force King Air-350 aircraft, to the Chief of the Air Staff, Air Marshal Oladayo Amao.\nLEADERSHIP reported that a Chief of Army Staff, Lit Gen Ibrahim Attahiru, and some senior Army officers including NAF cabin crew, lost their lives in the May 31, 2021 crash.\nAir Marshal Amao had following the unfortunate incident involving a Nigerian Air Force (NAF) King Air -350 aircraft at the vicinity of Kaduna Airport, directed that a joint investigative body consisting of experienced NAF safety officers and the AIB be constituted to investigate the circumstances surrounding the air crash.\nADVERTISEMENTAIB Set For Digital Accident Report SystemA statement jointly signed by the director of public relations and information of NAF, Air Cdre Edward Gabkwet, and the general manager, public affairs, AIB, Tunji Oketunbi, said the Chief Executive Officer of AIB, Engr Akin Olateru, had submitted an interim report on the sad incident to Air Marshal Amao, at his office at NAF Headquarters in Abuja.\nHe said the successful collaboration was a clear indication of the potency of collaboration in aircraft accident investigation, which must be encouraged."
  },
  {
    "headline": "IPOB warns Ghana: Stop collaborating with Nigeria to suppress Biafra",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised the alarm over the alleged arrest, intimidation, harassment and incessant torture and the humiliation of Biafrans living in Ghana by the Ghanaian government and its security agencies.\nGhana arrested 2 years citizens of Biafra and detained her incommunicado for two weeks in Ghana prison yards without taken them to court.\nSince 2019 till date Ghana government and her partners in crime have been clamping down on Biafra businesses in Ghana.\n“It is only shameful for Ghana government and her security operatives to arrested IPOB members thinking that their support to Fulani government of Nigeria would save them when Biafra comes.\n“We are calling on Ghanaians and friends of Ghana President to inform him that he should stop collaborating with the Federal government of Nigeria to oppress Biafra."
  },
  {
    "headline": "IPOB warns Ghana: Stop collaborating with Nigeria to suppress Biafra",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised the alarm over the alleged arrest, intimidation, harassment and incessant torture and the humiliation of Biafrans living in Ghana by the Ghanaian government and its security agencies.\nGhana arrested 2 years citizens of Biafra and detained her incommunicado for two weeks in Ghana prison yards without taken them to court.\nSince 2019 till date Ghana government and her partners in crime have been clamping down on Biafra businesses in Ghana.\n“It is only shameful for Ghana government and her security operatives to arrested IPOB members thinking that their support to Fulani government of Nigeria would save them when Biafra comes.\n“We are calling on Ghanaians and friends of Ghana President to inform him that he should stop collaborating with the Federal government of Nigeria to oppress Biafra."
  },
  {
    "headline": "Alleged witchcraft: Villagers flee as seven killed in Adamawa community",
    "summarized_story": "Alleged witchcraft: Villagers flee as seven killed in Adamawa communityAlleged witchcraft: Villagers flee as seven killed in Adamawa communityPolice in Adamawa have confirmed the killing of seven people over allegation of witchcraft at Dasin Bwate village in Fufore Local Government Area of the state.\n“Seven people were killed in Dasin Bwate village in Fufore LGA over witchcraft allegation.\n“The police have deployed investigation team into the village,’’ Nguroje said.\nNguroje said the team found the seven unidentified corpses in one of the houses in the village.\n“We are calling on the neighbouring villages to assist the police with useful information on the whereabouts of the residents of Dasin Bwate,’’ Nguroje pleaded."
  },
  {
    "headline": "Alleged witchcraft: Villagers flee as seven killed in Adamawa community",
    "summarized_story": "Alleged witchcraft: Villagers flee as seven killed in Adamawa communityAlleged witchcraft: Villagers flee as seven killed in Adamawa communityPolice in Adamawa have confirmed the killing of seven people over allegation of witchcraft at Dasin Bwate village in Fufore Local Government Area of the state.\n“Seven people were killed in Dasin Bwate village in Fufore LGA over witchcraft allegation.\n“The police have deployed investigation team into the village,’’ Nguroje said.\nNguroje said the team found the seven unidentified corpses in one of the houses in the village.\n“We are calling on the neighbouring villages to assist the police with useful information on the whereabouts of the residents of Dasin Bwate,’’ Nguroje pleaded."
  },
  {
    "headline": "Dangote seeks loans for Lagos giant refinery as costs balloon to $19B",
    "summarized_story": "President of Dangote Group, Aliko Dangote is in talks with some of the world’s biggest oil traders to help finance his mega refinery project in Lekki, Lagos, Reuters has reported quoting close sources to the project.\nThe refinery has been delayed by several years and the cost has ballooned to $19 billion from Dangote’s earlier estimates of $12-14 billion.\nHit by economic consequences of the COVID-19 pandemic and soaring construction costs, Dangote needs a cash injection.\nNigeria’s state oil firm NNPC has agreed to buy a 20% stake in the refinery for about $2.8 billion but Dangote is looking for outside cash.\nThe billionaire has held talks as recently as a month ago with executives from the world’s top two oil traders – Trafigura and Vitol."
  },
  {
    "headline": "House urges FG extend rail to TinCan Island, Ijegun ports",
    "summarized_story": "By Femi OgunsholaThe House of Representatives has urged the Federal Government to extend the railway line in Apapa Port to Tincan and Ijegun ports in Lagos State.\nSpeaking on the motion, Egoh noted that the Tincan Port was the second busiest port in Nigeria after the Apapa Port.\nHe said that an extension of 15 kilometers railway line from the Apapa Port to Tincan Island Port and Ijegun Port in Satellite town would be of huge economic benefits to the nation.\nThe lawmakers adopted the motion and urged the federal government to extend the rail line from Apapa Port through Tincan Port to Ijegun Port tankers terminal in Satellite town.\nThey also urged the Ministry of Transportation and the Nigerian Railway Corporation to include the construction of a railway line from Apapa Port to Ijegun Port through Tincan Port in the 2022 budget."
  },
  {
    "headline": "BREAKING: AIB Submits Report On Crash That Killed Ex-Army Chief, Lists 27 Findings",
    "summarized_story": "On May 31, 2021, the Nigerian Air Force received an interim report from the Accident Investigation Bureau on the crash that killed 11 military personnel, including a serving Chief of Army Staff, Lt. Gen Ibrahim Attahiru.\nThe investigator also provided a list of 27 preliminary findings and eight safety suggestions that should be implemented right once.\nThe statement was titled, ‘Accident Investigation Bureau Submits Interim Report On Aircraft Accident Involving Nigerian Air Force King Air-350 Aircraft To The Chief Of Air Staff’.\nAccording to him, the successful collaboration is a clear indication of the potency of collaboration in aircraft accident investigation, which must be encouraged.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented."
  },
  {
    "headline": "UNIBEN Bows After Students’ Protest, Agrees To Remove N20,000 Late Payment Fee",
    "summarized_story": "After a Tuesday protest, the University of Benin (UNIBEN) has finally yielded to the demands of students.\nAs a result, students demonstrated against the N20,000 tuition raise on Tuesday.\nHe said: “After the students forced the VC out, she made the following agreement: Total removal of the N20,000 late payment charge.\nThe university management led by the Vice-Chancellor, Salami, increased tuition from N41,400 to N45,000 at the resumption of the ongoing academic session.\nHowever less than a month later, tuition was again hiked with an increment of N20,000, bringing the school fees to N65,000."
  },
  {
    "headline": "BREAKING: FG Reacts To Ongoing Protest By Nigerian Separatists At UN Headquarters",
    "summarized_story": "The Nigerian government has reacted to the ongoing demonstration at the United Nations headquarters in New York, United States of America, by a coalition of separatist organizations.\nIt was, however shocking, to see ‘Yoruba Nation’ advocates yesterday unequivocally throw their lot in with Indigenous People of Biafra (IPOB).\n“Without doubt, Nigerians and the entire world will judge Yoruba Nation by the company it keeps.\n“The cooperation is a worrying development, once parsed with Yoruba Nation’s increasingly violent rallies in Nigeria.\nYoruba Nation’s talk of human rights promotion must therefore be ignored."
  },
  {
    "headline": "Again, Yoruba Nation Agitators, Other Nigerian Separatists Storm UN Headquarters To Demand Referendum",
    "summarized_story": "Members of the Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS) stormed the United Nations headquarters in New York, pressing international leaders to make it easier for Nigeria to have a referendum.\nOn Tuesday, agitators assembled at the UN offices, and on Wednesday, they returned to press their demand for a referendum.\nSoutherners and Middle Belt people are represented in the coalition of self-determination agitators led by Ilana Omo Oodua, the Lower Niger Congress, and the Middle Belt Movement, respectively, by Prof Banji Akintoye, Tony Nnadi, and Yusuf Turaki.\nProtesters on the streets of New York, photographed by SaharaReporters, are demanding a vote to allow them to form their own countries.\n'Deliver Us From Union Of Death In Nigeria'—Yoruba Nation Agitators, Others Protest At UN Headquarters To Demand Referendum | Sahara Reporters https://t.co/OLYzBrTlDK pic.twitter.com/GLlThXFY6Q — Sahara Reporters (@SaharaReporters) September 14, 2021Some of the protesters carried placards bearing inscriptions such as, “End Nigeria to save lives”, ”Nigerian Army killing Nigerians, Buhari is a tyrant leader”, and “We demand a referendum to decide our nationhood now”."
  },
  {
    "headline": "Aisha Buhari Cup: Super Falcons cruise to 2-0 victory over Mali in the opening game (Pictures)",
    "summarized_story": "Previous$34bn untapped remittances: Why BDCs should be involved"
  },
  {
    "headline": "Breaking: Like in Ondo, Osun governor signs anti-grazing bill into law",
    "summarized_story": "Governor Adegboyega Oyetola has signed into law the bill seeking ban on open grazing in Osun state.\nThe Chief Press Secretary to the governor Ismail Omipidan disclosed this in Osogbo, the state capital.\nOsun state Assembly had passed the bill to regulate animal grazing and establishments of cattle ranches and other related matters.\nDetails loading…"
  },
  {
    "headline": "Breaking: Inflation has declined to 17.01 in Nigeria – NBS",
    "summarized_story": "For the fifth consecutive month, the Consumer Price Index (CPI) , which measures inflation rates dropped to 17.01 per cent in August as against 17.38 per cent recorded in June.\nAccording to the National Bureau of Statistics (NBS) in its CPI Report for August released Wednesday morning in Abuja, the figure represents a 0.37 per cent drop.\nNigeria’s inflation figures have been a steady decline since March 2021.\nDetails loading…"
  },
  {
    "headline": "GX gallery series OLED TV feels completely natural – Ahn -NigPilot",
    "summarized_story": "Home Entertainment, TV Division Product Manager, LG Electronics West Africa Division, Mr. Mike Ahn has described it GX Gallery series OLED TV as completely natural making daily life better through technological innovation and design.\n“Like all great designs, the design of the GX Gallery series feels completely natural and entirely unforced”.\n“Introducing LG GX Gallery series OLED TV, available in 65- and 77-inch screen sizes, LG’s GX Gallery series TVs deliver everything that was cutting-edge about the wallpaper TV without the need for a separate soundbar to house all the electronics.\nA triumph of human-centered industrial design, the GX Gallery lineup would not look out of place in an art gallery exhibit, displayed as a series of understated, ultra-modern sculptures.\nFeatured in the OLED Gallery Series is the α (Alpha) 9 Gen 3 AI Processor."
  },
  {
    "headline": "COAS vows to hold Commanders responsible for security bridge on facilities -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS), Lt Gen Faruk Yahaya on Wednesday in Abuja vowed that he will henceforth hold Commanders at all levels responsible for attacks on military facilities including bases, barracks and Cantonments.\n“I want to remind Formation and Unit Commanders on the need to ensure adequate security of their bases, h barracks, and cantonment.\nCommanders would be held responsible for any security breach.\nThe COAS added, “in the conduct of our operations, Commanders must ensure that their troops maintain a state of constant alertness and vigilance at all times to avoid any surprise attack by the adversary.\nI assure Nigerians that in days ahead, there shall be more visible signs of improved security across the country."
  },
  {
    "headline": "CAS revives interim reports on air mishap that killed COAS, others -NigPilot",
    "summarized_story": "The Chief of Air Staff (CAS), Air Marshal Oladayo Amao on Wednesday received the interim reports of the joint investigation into the remote and immediate cause of the air mishap that involved Nigerian Air Force (NAF) King Air -350 which killed all passengers and crew members on board including the former Chief of Army Staff COAS Lt Gen Ibrahim Attahiru and ten other top military brass.\nA development martial analysts applauded, saying that this is a deviation from the military secrecy of receiving such reports behind closed doors.\nHe also noted that copies of the report, with the endorsement of the CAS, will also be submitted to the Hon.\nMinister of Aviation and Nigerian Civil Aviation Authority (NCAA) to ensure that the recommendations addressed to aviation agencies are implemented.\nHe added that the involvement of AIB in the investigation by the Nigerian Air Force would help in closing the gaps on the civil aviation side."
  },
  {
    "headline": "NAF refutes alleged killing of civilians in Yobe -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF), on Wednesday, denied the trending reports that its fighters jet mistakingly bombed a wrong location killing many civilians at Buhari village in Yobe State, Northeast Nigeria.\nResponding to the trending report, the Director of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a one paragraph statement dismissed the report as false.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\nRecall that a similar event happened in 2017 when the Nigerian Air Force mistakenly bombed an Internal Displaced Persons’ camp in Rann, Borno State”.\n“This area is in the northern part of Yobe, close to BH/ISWAP’s area of operation, so it is possible that the jets were on anti-BH operation."
  },
  {
    "headline": "‘We Are Not Unmindful Of The Anxiety:’ FG Promises To Restore Twitter",
    "summarized_story": "﻿The Federal Government has again pledged to restore Twitter services in the country, hundred days after the tech giant was banned in Nigeria.\nHe said that the government is working hard to restore Twitter’s operations in Nigeria.\nAs to how soon is soon, if the operation has been successful for hundred days now, we are just talking about a few more days.\nThe country joins nations like North Korea, China, and Iran in halting operations of the social media platform.\nIn spite of the development, many in the country have devised means to sidestep the ban including the use of Virtual Private Networks (VPNs)."
  },
  {
    "headline": "AIB Submits Interim Report On Crash That Killed Attahiru, 10 Others",
    "summarized_story": "The Accident Investigation Bureau (AIB) on Wednesday submitted its interim report on the Air Force plane crash that killed the former Chief of Army Staff, Lieutenant General Ibrahim Attahiru and 10 other military officers.\nAIB Commissioner and Chief Executive Officer, Akin Olateru submitted the report to the Chief of Air Staff, Air Marshal Oladayo Amao in Abuja, four months after the tragic incident that occurred in Kaduna State.\nThis was disclosed in a statement jointly signed by the Air Force Director of Public Relations and Information, Air Commodore Edward Gabkwet and AIB General Manager of Public Affairs, Tunji Oketunbi.\nAccording to him, the successful collaboration is a clear indication of the potency of partnership in aircraft accident investigation which must be encouraged.\nAir Marshal Amao also noted that such collaborative efforts make accident investigations more transparent while stating that the outcome of the investigation is not necessarily aimed at punitive measures but essentially at improving safety in the aviation industry."
  },
  {
    "headline": "Many Feared Dead, Others Injured As Jet Reportedly Bombs Yobe Community",
    "summarized_story": "Several persons have reportedly been killed and others injured in an aerial bombardment in Buwari community, Yunusari Local Government Area of Yobe State on Wednesday.\nA source in the community confirmed the incident to Channels Television, explaining that those injured in the incident are receiving treatment at the General Hospitals in Geidam and Gashua.\nAnother source, Haruna Ali, said that three Toyota Hilux brought the injured victims to Geidam General Hospital.\nThe community is located 20 kilometres away from Kannamma, the headquarters of Yunusari Local Government Area of the North East state.\nBut as security forces continue to battle the criminals, calls to grant them amnesty have sharply divided opinion in the country."
  },
  {
    "headline": "Buhari Swears In Three INEC National Commissioners As FEC Commences",
    "summarized_story": "President Muhammadu Buhari has sworn in three National Commissioners of the Independent National Electoral Commission (INEC).\nThey include Dr Baba Bila representing the North-East zone, Professor Sani Adam, representing the North-Central zone and Professor Abdullahi Abdu, representing the North-West zone.\nVice President Yemi Osinbajo and Secretary to Government of the Federation, Boss Mustapha are among those physically in attendance.\nOthers include Ministers of Finance, Budget and National Planning, Zainab Ahmed; Works and Housing, Babtunde Fashola and Interior, Rauf Aregbeshola.\nThe Head of Civil Service of the Federation, Folashade Yemi-Esan and other Ministers are attending virtually from their various offices in Abuja."
  },
  {
    "headline": "Man City Hit Leipzig For Six In Champions League",
    "summarized_story": "Jack Grealish scored a superb first Champions League goal as Manchester City survived Christopher Nkunku’s hat-trick to beat RB Leipzig 6-3 in a pulsating Group A opener on Wednesday.\nGrealish admits the lure of playing on the Champions League stage convinced him to leave his boyhood club Aston Villa to join City in a club record £100 million ($138 million) move in the close-season.\nGrealish also set up City’s first goal for Nathan Ake with a pin-point corner.\nGuardiola led City to their first Champions League final last season, but the Premier League champions were denied a maiden European Cup crown in a limp 1-0 loss against Chelsea.\nIt was Ake’s first City goal since September 2020 and his first ever in the Champions League."
  },
  {
    "headline": "Kaduna State Assembly impeaches Majority Leader",
    "summarized_story": "The majority leader of the Kaduna state House of Assembly, Haruna Inuwa, has been Impeached.\nHe represents Doka/Gabasawa constituency at the state assembly.\nHaruna Inuwa was impeached on Wednesday after seventeen state lawmakers belonging to the All Progressives Congress (APC) unanimously passed a vote of no confidence in him and signed his impeachment letter.\nThe Kaduna state House of Assembly consists of thirty four members."
  },
  {
    "headline": "Yobe Community says Airforce strike kills 10, injure 32 -",
    "summarized_story": "Ten persons have been confirmed dead by the collateral damage.\nResidents of Buwari village have been left displaced by the unfortunate incident, while thirty two persons who are confirmed seriously injured are receiving medical treatment at the Geidam General hospital.\nEye witness who spoke with Tvc News Correspondent says the air strike was orchestrated after some suspected Boko Haram fighters were sighted by some residents of the affected village and subsequently alerted security operatives for immediate action.\nThe Nigerian Air Force has been accused of allegedly bombarding innocent residents of Buwari village near kanama community of Yunusari local government area in Yobe state.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided."
  },
  {
    "headline": "Osun State Governor, Gboyega Oyetola, signs anti open grazing bill -",
    "summarized_story": "Osun State Governor Adegboyega Oyetola has signed the bill banning the practice of open grazing in the state into law.\nThe Osun State House of Assembly passed the bill to regulate animal grazing and establishments of cattle ranches and other related matters.\nOyetola’s Chief Press Secretary Ismail Omipidan confirmed that Governor has signed the anti-open grazing bill into law.\nHe said: “Mr Governor has signed the anti-open grazing bill into law immediately the bill was transmitted from the House of Assembly to the office of his Excellency.\n“We have notified the security agencies that will enforce the law in every part of the state, so, it is a crime to practice open grazing in Osun state."
  },
  {
    "headline": "Tanker Drivers Suspend strike in Imo State",
    "summarized_story": "Tanker Drivers Association has suspended it’s strike following the resolution of a 15 member committee set up by Governor Hope Uzodinma to resolve all lingering issues that led to the industrial action.\nAs a result of the strike action, petroleum products in the past two weeks have been scarce as the available products have been sold for three hundred naira per litre causing untold hardship to the people.\nAfter a meeting between Government delegation and the concerned union on Wednesday in Owerri the Imo State capital, they resolved among other things to immediately resume supply of petroleum products to the South East."
  },
  {
    "headline": "FIFA President Infantino Lands in Lagos, Speaks on Aisha Buhari Cup",
    "summarized_story": "FIFA President Gianni Infantino has just landed here in Lagos, as he prepares to join other dignitaries to witness the kick-off of the Aisha Buhari Cup, an invitational tournament for selected female national football teams.\nThe ARISE Crew was at the Lagos Airport to get his thoughts on the competition and other football-related matters…"
  },
  {
    "headline": "Trending: Ganduje’s Wife Shuns EFCC Invitation Over Fraud Case",
    "summarized_story": ""
  },
  {
    "headline": "North and South Korea Conduct Duelling Missile Tests as Arms Race Heats Up",
    "summarized_story": "South Korea President Moon was attending that test firing when word came of the North Korean launches, its first ballistic missile tests since March.\n“South Korea would face many political and legal obstacles to develop nuclear weapons, both internal and external,” he said.\nUnlike the South, North Korea’s ballistic missile systems have been banned by U.N. Security Council resolutions.\n“North Korea continues to prioritise military modernisation,” said Leif-Eric Easley, international studies professor at Ewha Womans University in Seoul.\nThe United States wants North Korea to give up its nuclear and missile programmes in exchange for sanctions relief."
  },
  {
    "headline": "China’s UK Ambassador Banned from Parliament Over Sanctions",
    "summarized_story": "China’s ambassador to the United Kingdom has been banned from the British parliament because Beijing imposed sanctions on legislators after they spoke out against alleged human rights abuses directed at the minority Uighurs in the far western region of Xinjiang.\nChina imposed sanctions on nine British politicians, lawyers and an academic in March for spreading what it said were “lies and disinformation” over the treatment of the mostly Muslim Uighurs.\nHoyle said the ambassador would be banned while the sanctions remained in place.\nThe Times said it was the first time an ambassador had been barred from parliament.\nTim Loughton, a politician with the ruling Conservative party, also who was also subjected to the sanctions, welcomed the decision."
  },
  {
    "headline": "Haiti Prime Minister Henry Sacks Prosecutor Who Accused Him of Links to President Moise’s Assassination",
    "summarized_story": "Haiti’s political crisis has worsened after Prime Minister Ariel Henry on Tuesday sacked the chief public prosecutor who had accused him of links to the assassination of President Jovenel Moise on July 7.\nClaude was sacked hours after he asked the judge investigating Moise’s murder to charge the prime minister with involvement in the case.\nHe was formally appointed to the rule days after Moise’s assassination.\nHe also wrote to immigration telling them not to let Henry leave the country “due to serious presumption relative to the assassination of the president”.\nSome in government circles had also called in recent days for the prime minister to resign over the allegations."
  }
]