[
  {
    "headline": "VAT: Be your brothers’ keeper, Gombe govt tells Lagos, Rivers",
    "summarized_story": "The Gombe State government has appealed to the governments of Lagos and Rivers concerning their decision on the collection of Value Added Tax.\nThe Governor of Rivers State, Nyesom Wike, had signed a bill on VAT followed by an order requiring businesses to henceforth pay VAT to the state and not to the Federal Inland Revenue Service.\nThe Lagos State government, in line with the judgment, also passed a VAT bill and asked the FIRS to stop collecting VAT from businesses in the state.\nReacting, the Gombe State Commissioner of Finance and Economic Development, Muhammad Magaji, appealed to Lagos and Rivers to be their brothers’ keeper by contributing to the centre.\nHe was quoted by TheCable, “The VAT issue will have adverse effects not only on Gombe state but almost all the states of the federation."
  },
  {
    "headline": "70% revenue to state, 30% for LGs, things to know about Rivers VAT Law 2021",
    "summarized_story": "Rivers State is leading the fight in the country to stop the Federal Inland Revenue Service from collecting Value Added Tax generated by states.\nHe also insisted that Rivers VAT does not belong to “Abuja people”.\nWike had assented to the Rivers State Value Added Tax Law 2021 in August after it was passed by the state House of Assembly.\nSection 7 of the law specified that the Rivers State Board of Internal Revenue shall administer and implement the law including the collection of VAT from all taxable persons and companies.\nSection 9 of the law noted that non-resident companies transacting businesses in the state are also required to pay 7.5% VAT on taxable goods and services to the Board."
  },
  {
    "headline": "Police arrest 4 suspected robbers in Kogi",
    "summarized_story": "The police command in Kogi, has arrested four suspected armed robbers, terrorising residents of Bassa Local Government Area (LGA) of the state.\nDSP William Aya, the command spokesman, said this in a statement in Lokoja on Thursday.\nAya said that the suspects were arrested based on intelligence report at a compound in new Jerusalem Oguma in Bassa LGA.\n“Operatives of the Nigeria Police Force attached to Bassa Division led by the Divisional Police Officer promptly swung into action, stormed the compound and arrested the suspects.\n“The suspected kidnappers/armed robbers have been terrorising residents of the LGA and its environs for long,” he said."
  },
  {
    "headline": "Applicant jailed 4 months for hacking into people’s Facebook accounts",
    "summarized_story": "Justice Darius Khobo of the Kaduna State High Court, Kaduna on Thursday, sentenced an applicant, David Kingsley, to four months imprisonment for hacking into people’s Facebook amounts and fraud.\nThe Economic and Financial Crimes Commission (EFCC), Kaduna Zonal Office charged Kingsley with fraud and impersonation.\nJustice Khobo sentenced Kingsley after he pleaded guilty to the charge.\nThe prosecutor said investigations revealed that the convict fraudulently hacked into the Facebook accounts of unsuspecting persons and used the accounts for fraudulent schemes.\nHe stated that the offence contravened Section 308 of the Kaduna State Penal Code Law 2017."
  },
  {
    "headline": "Decade of blackout: Rescue us, Ondo South begs Buhari, Akeredolu",
    "summarized_story": "“There can’t be an industry in Ondo South where the people have been living in darkness for about 15 years.\n“We will be happy if this injustice against Ondo South is corrected immediately.\n’Power supply to Ondo south zone has always been grossly inadequate due largely to availability from Ondo 132/33KV injection substation which is the only source of supply now.\n“Ondo TCN where Ondo south currently gets supply is about 150km away, with network traversing thick vegetation and farmlands which results to low quality of supply.\n“Not until TCN embarks on the prompt repair of the faulty breaker, the challenge in Ondo south would persist."
  },
  {
    "headline": "NDE to train, empower 50 women graduates in different skills in Enugu",
    "summarized_story": "The training programme which is put together by the Directorate under the Women Employment Branch tagged: “Women Empowerment Collaboration Scheme, WECS,” is a new scheme designed to improve the socio-economic development of women in their communities.\nAzubuike said that the role of women in economic development of any nation, including Nigeria, cannot be overemphasised, hence the conceptualisation of the programme to empower women in order to empower others.\n” You are enjoined to avail yourselves of the opportunity provided by NDE to master all aspects of the skills being taught.\nThe NDE Enugu boss expressed happiness with collaboration of National League of Women Voters, NLOWV and the Federal Ministry of Women Affairs with the Directorate to empower the women.\nFikpo urged the beneficiaries to be serious with the training to avail themselves the opportunity to empower themselves for life."
  },
  {
    "headline": "Student in court for stealing cable",
    "summarized_story": "A 26-year-old student, Monday Omale, on Thursday appeared at an Ikeja Chief Magistrates’ Court for allegedly stealing 10 rolls of cable worth N140,000.\nThe police charged Omale, whose address was not provided, with conspiracy and theft, but he pleaded not guilty.\nHe said the defendant stole 10 rolls of cable worth N140,000 which was property of Aitel Nigeria Limited.\nThe offence, he said, contravened section 411 and 287 of the Criminal Law of Lagos State, 2015.\nThe News Agency of Nigeria (NAN) reports that section 278 of the criminal law prescribed three years’ imprisonment for stealing, while section 411 prescribe two years for conspiracy."
  },
  {
    "headline": "I’ll use my powers to help Uzodinma fight insecurity in Imo – Buhari",
    "summarized_story": "President Muhammadu Buhari has pledged to help the Imo State Governor, Hope Uzodinma fight insecurity.\nBuhari said he would use his constitutional powers to assist Uzodinma in fighting insecurity in the state.\nHe spoke during the commissioning of Egbeada-Onitsha bypass road in Owerri, the Imo State capital.\nThe president also pledged to help Uzodinma deal with infrastructural deficits of the state.\nA society without security and infrastructure will not progress and luckily this is where my vision has tallied with the governor of Imo State."
  },
  {
    "headline": "N250,000 promotion assessment fee for senior lecturers fraudulent – ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU), Calabar zone, has described as an aberration and fraudulent, the N250,000 senior lecturers that should be promoted to professors are required to pay an assessment fee.\nThe union insisted that there is no clause in the act establishing the universities where a lecturer should pay for his own assessment.\nAccording to Brown, “there is no place that a lecturer should pay for his assessment.\nSecondly, what do you mean I pay such huge sum and I don’t get favorable assessment?\nIPPIS is illiterate because it cannot read and understand the peculiarities of the Nigerian universities system."
  },
  {
    "headline": "Crowd as Buhari commissions projects in Imo",
    "summarized_story": "Despite the heavy presence of security operatives in every part of Owerri, the Imo State capital, mammoth crowd were on ground to receive President Muhammadu Buhari during his one-day working visit to Imo State on Thursday.\nDAILY POST correspondent gathered that Buhari has already commissioned projects such as Nekede Road, Egbeada Bypass, Balloon drainage system and New Exco Chamber and Lounge in the State.\nGovernor iof Ebonyi State, Dave Umahi, and Abia State Deputy Governor were present at the event.\nSpeaking at the commissioning of the Egbeada Bypass at Owerri North Local Government Area, Buhari commended Governor Hope Uzodinma.\nHe said all projects commissioned were in line with his administration policy."
  },
  {
    "headline": "Roads deserted, banks, others shut down as Buhari lands in Imo [PHOTOS]",
    "summarized_story": "Economic activities in Owerri and other parts of Imo State have been shut down following the arrival of President Muhammadu Buhari in the state.\nDAILY POST had reported that the President arrived in the state on Thursday morning for the commissioning of some projects executed by Governor Hope Uzodinma.\nBuhari’s decision to visit the state had stimulated tension in the entire Southeastern region following the declaration of sit-at-home by the Indigenous People of Biafra, IPOB, in solidarity for its leader, Mazi Nnamdi Kanu, who is currently in the custody of the Department of State Services, DSS.\nAlthough the secessionist group had subsequently denied issuing the order, places such as banks and shops have been shut over fear of attacks by the unknown gunmen wreaking havoc in the region.\nContrary to calls by some separatists and critics of Buhari, the President received a warm welcome by some citizens of the state upon his arrival."
  },
  {
    "headline": "Abia Speaker mourns ex-commissioner, Uche Mpamah",
    "summarized_story": "The speaker of the Abia State House of Assembly, Rt.\nHon Chinedum Orji, has expressed sadness at the passing of a former Commissioner for Sports in the state, Chief Uche Mpamah.\nDAILY POST reported that a former Commissioner for Sports in Abia State, Uche Mpamah was confirmed dead after an undisclosed illness on Saturday.\nThe deceased is the wife of Professor Anthony Agbazuere, the Chief of Staff to Governor Okezie Ikpeazu of Abia State.\nEx-Abia Commissioner of Sports, Uche Mpamah is dead"
  },
  {
    "headline": "Comic Actor Okele recovers from illness",
    "summarized_story": "After days of battle with ill-health, popular comic actor Babatunde Usman aka Okele has made a rebound from illness.\nThe Nation reports a viral video shared by Okele’s colleague Saliu Gbolagade aka Ogbuleke, had captured Okele being hospitalised over an unknown ailmentSharing the video, Ogbuleke wrote: “thank God, olorun koni je ki aye suku nitori e @okele_2”But Okele in an appreciation message shared on his Instagram page on Sunday, thanked his numerous fans and colleagues for their support.\nHe said, “There have been so many speculations on social media over my health, I want to thank everybody, here I am, I’m stronger.\n“I thank my senior colleagues, my fans, my family and God most importantly.\nThis is me, I’m fine, I have gone, and now I’m back”The 42-year-old actor who hails from Kwara state, has over 20 years experience in the movie industry."
  },
  {
    "headline": "Kaduna LG polls: PDP wins Jaba LG",
    "summarized_story": "Kaduna State Independent Electoral Commission has declared Mr Phillip Gwada (PDP) as winner of Saturday’s chairmanship election in Jaba Local Government Area of the state.\nThe Returning Officer, Prof. Peter Omale, made the declaration on Monday at the State Independent Electoral Commission (SIEC) office in Kwoi.\nOmale said Gwada polled 9,012 votes to defeat APC’s candidate, Mr Benjamin Jock, who polled 5,640 votes.\nADVERTISEMENTHe said that the candidate of Action Democratic Party, Mr Alhamdu Gyet, placed third with 2,732 votes.\n“Mr Phillip Gwada of the PDP, having satisfied the requirements of the law and having scored the highest number of votes is hereby declared winner of the election and returned elected,’’ Omale said."
  },
  {
    "headline": "Conflicting orders: Summoned CJs to appear before CJN Monday",
    "summarized_story": "The seven Chief Judges (CJs) summoned last month by the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, for allegedly issuing conflicting court orders, are to appear before him today in Abuja.\nA source at the Supreme Court told The Nation that the affected judges are to first meet with the CJN in preparation for their eventual appearance before the National Judicial Council (NJC).\nIt was also learnt that the CJN plans to meet with the leadership of the Nigerian Bar Association (NBA) during the week.\nRead Also: Babel of exparte orders“You recall the CJN issued the summons on August 30 to halt what has become an embarrassment to the Judiciary in the past few weeks.\nThe summons reads: “My attention has been drawn to media reports to the effect that some courts of coordinate jurisdiction were granting conflicting ex parte orders on the same subject matter."
  },
  {
    "headline": "Germany’s envoy to China dies 2 weeks into job",
    "summarized_story": "Germany’s new ambassador to China, Jan Hecker, has died shortly after taking up his post, the Foreign Office confirmed Monday.\n“It is with deep sadness and consternation that we heard of the sudden death of the German ambassador to China, Prof., Dr Jan Hecker.\n“At this moment, our thoughts are with his family and the people who were close to him,’’ the Foreign Office said in a statement.\nA native of the northern port city of Kiel, Hecker trained as a lawyer and had worked as an attorney and a judge.\nHecker was a university lecturer before becoming a foreign policy advisor to Chancellor Angela Merkel ahead of his appointment as ambassador."
  },
  {
    "headline": "Breaking: Empty streets as Buhari arrives Imo",
    "summarized_story": "From Stanley Uzoaru,OwerriImo residents stayed back at their homes today even as President Muhammadu Buhari’s arrives the State to commission some projects.\nThe residents totally complied to the directive of the Indigenous People of Biafra(IPOB) made through the Directorate of States of the group.\nAs early as 8 am, our correspondent who visited some of the major busy places in the Owerri metropolis reported that the places were like a ghost town,completely deserted.\nNo vehicular movements on the roads even as banks ,filling stations,schools and markets were completely shutdown.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "VAT: Wike, corporate bodies interface as law takes effect Sept",
    "summarized_story": "From Tony John, Port HarcourtRivers Governor, Nyesom Wike, yesterday, said that with the infraction of the constitutional provision on collection of Valued Added Tax (VAT) addressed, his administration has commenced full implementation of the state’s VAT law without hesitation.\nWike said FIRS had in the past collected VAT in the state with impunity, knowing it was unconstitutional for them to do so.\nIn the month of June, 2021, which we shared in July, VAT collected in Rivers State was N15.1 billion.\nSee the gross injustice and these money includes contracts awarded by the Rivers State Government.\n“The attention of the Rivers State Government has been drawn to a false online publication credited to Governor Nyesom Wike."
  },
  {
    "headline": "UNICEF expresses worry as Cholera kills 2,035 in 2 months",
    "summarized_story": "From Isaac Anumihe, AbujaUnited Nations Children’s Fund (UNICEF) has raised alarm over the ravaging effect of cholera across the country, saying over 58,000 cases have been reported with 2,035 deaths in 24 states in two months.\nIn cases where there are, they are poorly managed and the hygiene situation is nothing to write home about.\n“Schools and health centres equally suffer from lack or inadequate toilet, safe water and hygiene facilities” he lamented.\nTo this end, UNICEF, said it is providing water chlorination for 1,799 patients, 2,735 houses and 20,765 schoolchildren with access to potable water.\nThis is largely due to our collective behaviour and attitude towards environmental sanitation and hygiene practices which are very poor."
  },
  {
    "headline": "NNPC releases 2020 audited financial statement",
    "summarized_story": "By Adewale SanyaoluLiving up to its Transparency, Accountability and Performance Excellence (TAPE) mission, the Nigerian National Petroleum Corporation (NNPC), yesterday, released its 2020 audited financial statement.\nThe release of the 2020 AFS follows similar feat recorded in 2018 and 2019.\nThe NNPC for the first time in its 44 years of operation released its first AFS to the admiration of stakeholders in 2018.\nThe 2020 AFS reported a group profit which rose from a loss position of N1.7billion in 2019 to a profit of N287 billion in 2020, for the first time 44 years.\nThe group working capital remained below the line at N4.56 trillion in 2020 as against N4.44 trillion in 2019, the AFS further revealed."
  },
  {
    "headline": "Robbers stole Igboho’s aides’ case file, DSS tells court",
    "summarized_story": "The Department of State Services (DSS), yesterday, told the Federal High Court, Abuja, that its case-file was stolen by criminal elements, popularly known as “one chance’’.\nThe DSS said the case file contained the fundamental rights enforcement suit filed by the 12 associates of Yoruba nation agitator, Sunday Adeyemo, also known as Sunday Igboho.\nWhen the matter was called yesterday, counsel to DSS, Mr Idowu Awo, said the file, which contained the court processes served on the DSS by the aides, was stolen from a member of the service legal team.\nThe 12 associates of Igboho instituted the rights enforcement suit against the DSS for parading them in the media as common criminals.\nThe judge, Justice Obiora Egwuatu, however, ruled that the case file be returned to the registry for reassignment to a regular court."
  },
  {
    "headline": "NNPC’s Assets Rise by 18.7% as Corporation Publishes 2020 Audited Results",
    "summarized_story": "Emmanuel AddehFor the third time since it was established 44 years ago, the Nigerian National Petroleum Corporation (NNPC) yesterday officially released its Audited Financial Statement (AFS) for year 2020.\nWith the development, the corporation has now joined other state-owned global oil concerns that publish the details of their operations, to among others, boost investors’ confidence and enhance business transparency.\nIn addition, the group’s working capital remained below the line at N4.56 trillion in 2020, as against N4.44 trillion in 2019, while the corporation’s group revenue for the 2020 financial year stood at N3.718 trillion as against N4.634 trillion in 2019.\nThe corporation first published its AFS last year, the first being for 2018 and the second dealing was on its activities for 2019.\nThe auditors stressed that though the NNPC announced a profit of N287 billion, but the large discrepancy between assets and liabilities cast some uncertainty on the corporation’s operations."
  },
  {
    "headline": "FIRS: Why We Are Against States’ Collection of VAT",
    "summarized_story": "Just like the Rivers State government, which recently enacted its VAT Law 2021 to regulate the effective administration of VAT in the state, Lagos and Ekiti states have taken steps to enact similar laws on VAT collection.\nOn its part, FIRS has maintained that the decision of the Federal High Court to grant powers to states to administer VAT could be counterproductive.\nHe said where the output VAT exceeded the recoverable input VAT; the taxpayer was expected to remit the excess to the FIRS.\nHis words, “As to the incidence of VAT, VAT is practiced on an input and output mechanism.\nHe said he had already assented to the Rivers State VAT law passed by the State House of Assembly."
  },
  {
    "headline": "Report: Terrorists Launched 500 Attacks on MNJTF, Killed 2,368 Soldiers Using State Weapons",
    "summarized_story": "“Official data concerning attacks on security sector personnel is difficult to obtain, but reports suggest that more than 2,000 uniformed security sector personnel have died in the conflict.\n“As alarming as these numbers are, they likely under-estimate the true scale and scope of the losses incurred concerning the security personnel of the four Lake Chad Basin countries.\n“The levels of loss of uniformed personnel and lethal materiel from state stockpiles in the Lake Chad region are astonishingly high.\n“We are winning the war in the North East and North West and the terrorists are surrendering in large numbers.\nWhy is it that it is now that we are clearly winning the war that such report is coming up to drag us back."
  },
  {
    "headline": "Breaking: ECOWAS Suspends Guinea",
    "summarized_story": "“At the end of that mission, ECOWAS should be able to re-examine its position,” Barry told reporters.\nHe did not announce any immediate economic sanctions against Guinea, as ECOWAS imposed against Mali following a coup there in August 2020.\nActivists say this has contributed to West Africans’ loss of faith in democracy and made military coups more likely.\nECOWAS said on Tuesday it was concerned transitional authorities there had not made sufficient progress toward organising elections next February as promised.\nAluminium hit a fresh 10-year high on Monday after news broke of unrest in Guinea, which holds the world’s largest bauxite reserves."
  },
  {
    "headline": "THISDAY Law Editor, Onikepo Braithwaite, 129 Other Lawyers Shortlisted for Award of SAN Rank",
    "summarized_story": "By Alex EnumahTHISDAY Law Editor, Onikepo Braithwaite, amd 129 other lawyers have been shortlisted by the Legal Practitioners’ Privileges Committee (LPPC) for the award of the prestigious rank of Senior Advocate of Nigeria (SAN).\nSome in the Advocate category are; Offia Ota, Nwafor-Orizu Orji, Adeniyi Ademuyiwa, Ovrawah Ogaga, Abubakar Adamu and West-Idahosa Ehiogie.\nSee full listLIST OF SHORTLISTED CANDIDATES FOR THE RANK OF SENIOR ADVOCATE OF NIGERIA (SAN) ADVOCATE CATEGORY FOR 2021.\nLIST OF SHORTLISTED CANDIDATES FOR THE RANK OF SENIOR ADVOCATE OF NIGERIA (SAN) ACADEMIC CATEGORY FOR 2021.\nMAIYAKI THEODORE BALA PROF. ISAH MOHAMMED DR. ONI BABATUNDE ADETUNJI DR. AGABA JAMES ATTA PROF. ABDULQADIR IBRAHIM ABIKAN PROF. GBADAMOSI OLAIDE ABASS PROF DAWUD KAMAL ALHAJIA/PROF."
  },
  {
    "headline": "BREAKING: Buhari Arrives Imo As Residents Comply With IPOB's Initial Sit-At-Home Directive",
    "summarized_story": "President Muhammadu Buhari has arrived the Sam Mbakwe International Cargo Airport in Owerri, Imo State.\nImo streets desertedThere was also a heavy security presence at the airport.\nSaharaReporters had on Saturday reported that the Imo State Governor, Hope Uzodinma, disclosed that President Buhari would visit the state on Thursday.\nSaharaReporters gathered that residents of Owerri, the state capital complied fully with the directive initially given by IPOB.\nImo State deserted as Buhari Visits Imo State ð\u009f¤£ pic.twitter.com/LgxWpSrlTp — Uche Ezeonye Official (@uche_ezeonye) September 9, 2021042 no ney Carry last."
  },
  {
    "headline": "BREAKING: Buhari Arrives Imo As Residents Comply With IPOB's Initial Sit-At-Home Directive",
    "summarized_story": "President Muhammadu Buhari has arrived the Sam Mbakwe International Cargo Airport in Owerri, Imo State.\nImo streets desertedThere was also a heavy security presence at the airport.\nSaharaReporters had on Saturday reported that the Imo State Governor, Hope Uzodinma, disclosed that President Buhari would visit the state on Thursday.\nSaharaReporters gathered that residents of Owerri, the state capital complied fully with the directive initially given by IPOB.\nImo State deserted as Buhari Visits Imo State ð\u009f¤£ pic.twitter.com/LgxWpSrlTp — Uche Ezeonye Official (@uche_ezeonye) September 9, 2021042 no ney Carry last."
  },
  {
    "headline": "BREAKING: Buhari Government Approves 5G Deployment In Nigeria",
    "summarized_story": "The Federal Executive Council has approved the National Policy on Fifth Generation (5G) Networks in Nigeria.\nIllustrationIn a statement signed by the Technical Assistant on Information Technology to the Minister, Femi Adeluyi, the implementation of the National Policy is with immediate effect.\nThe report critically reviewed and studied the health and security implications of deploying 5G in Nigeria.\nAccording to experts, 5G networks offer significant advantages over the current technologies.\nThey include the United States, United Kingdom, Republic of Korea, South Africa and Lesotho among others."
  },
  {
    "headline": "BREAKING: Buhari Government Approves 5G Deployment In Nigeria",
    "summarized_story": "The Federal Executive Council has approved the National Policy on Fifth Generation (5G) Networks in Nigeria.\nIllustrationIn a statement signed by the Technical Assistant on Information Technology to the Minister, Femi Adeluyi, the implementation of the National Policy is with immediate effect.\nThe report critically reviewed and studied the health and security implications of deploying 5G in Nigeria.\nAccording to experts, 5G networks offer significant advantages over the current technologies.\nThey include the United States, United Kingdom, Republic of Korea, South Africa and Lesotho among others."
  },
  {
    "headline": "Panic As Heavy Militarisation, Helicopters, Armoured Carriers, Other 'War Weapons' Accompany Buhari To Imo",
    "summarized_story": "There is apprehension in Imo State as many residents of Owerri in Imo State have stayed behind closed doors due to the heavy military presence that accompanied President Muhammadu Buhari to the state.\nSaharaReporters had on Saturday reported that the Imo State Governor, Hope Uzodinma, disclosed that President Buhari would visit the state on Thursday.\nResidents of the state told SaharaReporters that the President's visit has given Imo State an appearance of a war zone with military presence all over the place.\n“Please, Imo State, particularly Owerri is currently heavily militarised.\nFrom the airport at Ngor-Okpala to Owerri, there are armoured personnel carriers, and any other military weapons you can think of."
  },
  {
    "headline": "Buhari: Uzodimma and I share similar vision on infrastructure development",
    "summarized_story": "President Muhammadu Buhari says the vision of Hope Uzodimma, governor of Imo, on infrastructure development coincides with his own.\nAdvertisementBuhari said this on Thursday during the inauguration of some projects in Imo state.\nThe president said he is impressed by the infrastructural projects built by Uzodimma, adding that the development justifies the integrity of the Imo governor.\nAdvertisement“Our commitment to the peace and unity of Nigeria is irrevocable, through our inclusive government, we have accommodated every Nigerian resident in Imo state,” Uzodimma said.\nOur aim is to build a mini Nigeria in Imo state, where everyone will have a sense of not only belonging but unfettered accommodation.”"
  },
  {
    "headline": "Buhari: Uzodimma and I share similar vision on infrastructure development",
    "summarized_story": "President Muhammadu Buhari says the vision of Hope Uzodimma, governor of Imo, on infrastructure development coincides with his own.\nAdvertisementBuhari said this on Thursday during the inauguration of some projects in Imo state.\nThe president said he is impressed by the infrastructural projects built by Uzodimma, adding that the development justifies the integrity of the Imo governor.\nAdvertisement“Our commitment to the peace and unity of Nigeria is irrevocable, through our inclusive government, we have accommodated every Nigerian resident in Imo state,” Uzodimma said.\nOur aim is to build a mini Nigeria in Imo state, where everyone will have a sense of not only belonging but unfettered accommodation.”"
  },
  {
    "headline": "Nigerian Gas Company spends N31.88bn on 264 employees",
    "summarized_story": "The Nigerian Gas Company Limited (NGC) spent N31.88 billion on salaries, welfare and other personnel expenses in 2020.\nIn 2020, NGC spent N5.4 billion on the payment of salaries, allowances gulped N5.1 billion, while management monetised benefit was N941 million.\nA total of N12.7 billion was spent by NGC on employees welfare in the same year.\nMeanwhile, the total figure of N31.8 billion is lower than the N36.4 billion expended on NGC personnel expenses in 2019.\nIn terms of revenue, NGC generated N109.1 billion in 2020, representing a 21 percent increase from N90.2 billion in 2019."
  },
  {
    "headline": "Nigerian Gas Company spends N31.88bn on 264 employees",
    "summarized_story": "The Nigerian Gas Company Limited (NGC) spent N31.88 billion on salaries, welfare and other personnel expenses in 2020.\nIn 2020, NGC spent N5.4 billion on the payment of salaries, allowances gulped N5.1 billion, while management monetised benefit was N941 million.\nA total of N12.7 billion was spent by NGC on employees welfare in the same year.\nMeanwhile, the total figure of N31.8 billion is lower than the N36.4 billion expended on NGC personnel expenses in 2019.\nIn terms of revenue, NGC generated N109.1 billion in 2020, representing a 21 percent increase from N90.2 billion in 2019."
  },
  {
    "headline": "Gunmen abduct 18 Lagos-bound passengers in Ondo",
    "summarized_story": "Gunmen suspected to be kidnappers have attacked an 18-passenger commercial bus in Ondo state.\nAdvertisementTheCable understands that the Lagos-bound bus was attacked along Ido Ani-Ifira-Akoko Expressway on Wednesday evening.\nThe incident reportedly occurred on the failed portion of the expressway.\nAll the passengers of the bus were said to have been abducted by the gunmen.\nTheCable learned that the kidnappers have demanded N10 million naira ransom for the release of the abducted passengers."
  },
  {
    "headline": "MTN Group, Africa’s largest telecom, reportedly in talks to sell Afghanistan arm",
    "summarized_story": "Africa’s largest telecom company MTN Group is reportedly in talks with potential international buyers for its wireless business in Afghanistan per Bloomberg.\nThe South Africa headquartered company is currently the market leader in Afghanistan with a 40% share and is in discussions with several parties in ongoing negotiations to sell its Afghanistan arm.\nA writedown of MTN’s Afghanistan business without any proceeds from disposal is estimated to cost about R700 million ($49 million) according to undisclosed sources familiar with the negotiations.\nThe sale of its Afghanistan unit is crucial to MTN as it plans to raise about R15 billion ($1 billion) from shareholding sales in markets outside Africa.\nMTN currently serves over six million customers in Afghanistan, its planned exit could serve as an opportunity for other Afghanistan telecom players to expand their market share, while MTN does the same in Africa."
  },
  {
    "headline": "How Wave became Francophone Africa’s first unicorn startup with \"radically affordable\" money transfers",
    "summarized_story": "Taking on incumbentsSenegal is one of Africa’s fastest-growing mobile money markets, according to a 2020 GSMA report.\nExpresso Telecom, a unit of the UAE’s Expresso Telecom Group Limited, holds 22% of the market share, with over 3 million subscribers.\nAll three telecom firms provide mobile money services under the Orange Money, Free Money, and E-Money brands respectively, and along with banks, dominate the digital financial services space.\nAccording to co-founder Drew Durbin, Wave is building a mobile money service that is “radically affordable”.\nThe startup’s low-cost transaction service has helped it take on incumbents, eat into their market share, and turn the entire mobile money industry on its head."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Businesses suffer over soaring cost, poor services at inland ports",
    "summarized_story": "Importers and manufacturers are now counting losses due to the high cost of doing business and poor service delivery at inland dry ports, popularly known as bonded terminals or inland container depots (ICDs).\nConsequently, importers that have their containers transferred to these terminals end up experiencing delays that result in payment of extra cost as demurrage to shipping companies.\nThis is such that an importer could pay as much as N3 million per container to cover transfer charges and demurrage to shipping companies due to the longer dwell time of the container.\nGiving an insight into the problems associated with doing business at inland ports, Tony Anakebe, a maritime analyst, says it takes time for containers to be assigned from the mother port to inland ports.\nWhen they finally do, they charge transfer charges to cargoes, which is an extra cost to the importer."
  },
  {
    "headline": "Nigeria’s private sector credit struggles to catch up with peers",
    "summarized_story": "Nigeria’s private sector credit struggles to catch up with peersThere has been recent expansion in credit to the private sector in Africa’s largest economy but the pace of growth remains too weak to match what is obtainable in peer countries, leaving a sizable funding gap for millions of businesses.\nTotal lending to the private sector in Nigeria hit N33 trillion ($8bn) in July 2021,…"
  },
  {
    "headline": "DisCos to roll out over 2m new meters by year end",
    "summarized_story": "DisCos to roll out over 2m new meters by year endNigeria’s electricity distribution companies (DisCos) are on course to roll out more than 2 million meters by the end of the year under the meter distribution programme of the Federal Government.\nThe planned roll out is to happen under the second phase of the National Mass Metering Programme funded by the Central Bank of Nigeria…"
  },
  {
    "headline": "We’re open to serve Edo people – JARA Stores – Nigerian Observer",
    "summarized_story": "JARA stores in Edo State is operated under a Memorandum of Understanding (MoU) between the Edo Development and Property Agency (EDPA) and EDLP Nigeria Limited.\nAccording to her, “JARA, as we all know, is the first discount store in South-South.\n“We have unbeatable prices you can’t get anywhere except JARA stores.\nWe thank the Edo State Government for providing an enabling environment for businesses to thrive.\nIn less than two years, we are opening a second store and we give God the glory.”..."
  },
  {
    "headline": "AAU MATRICULATES 11,538 FRESH STUDENTS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – The Ambrose Alli University (AAU), Ekpoma, Edo State has matriculated 11,538 fresh students admitted for the 2020/2021 Academic Session.\nActing vice chancellor of the university Prof. Benson Osadolor, also during the matriculation ceremony, launched the celebration of AAU 40th Anniversary.\nProf. Osadolor disclosed that only 5,226 out of the 11,538 admitted students had paid their school fees.\n” Do not fail society.\n“Do not be led astray by bad friends; use the Social Media with wisdom and shun all evil associations”, he advised."
  },
  {
    "headline": "We’re building strong institutions to restore Edo’s lost glory – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government is building stronger institutions to restore the state’s lost glory and reposition it for sustainable growth and development.\nThe governor noted that “to restore Edo to its God’s given position in the country and in the subcontinent, there are certain things we need to do.\nWe have to build institutions to build human capacity to explore and exploit our national resources.”According to him, “That is why we carefully selected the people who will now select those to run the institutions for us.\nWe need to build institutions.\nPlease, have that in mind as you consider the candidates, because that is one thing that we are passionate about,” Obaseki charged."
  },
  {
    "headline": "COVID-19 3rd wave: Four more unvaccinated persons die in Edo, as fatality hits 30, confirmed cases reach 840 – Nigerian Observer",
    "summarized_story": "The State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nHe said the state also confirmed 65 new cases, bringing the number of confirmed cases in the state to 840.\nObi, who decried the rising number of infections and deaths in the state, expressed worry that more unvaccinated persons have continued to die from the virus.\nAccording to him, “Edo State, in the last 24 hours, recorded the death of four more persons who were unvaccinated with the COVID-19 vaccines, bringing the total number of fatalities recorded in the state to 30.\n“We also confirmed 65 new cases from the 339 samples collected within the 24-hour timeframe, with a case positivity rate of 19.2 percent."
  },
  {
    "headline": "Police apprehend killers of ex-Governor Dariye’s father",
    "summarized_story": "The Nigeria Police has announced that its officers of the Intelligence Response Unit have arrested eight suspects who allegedly kidnapped and murdered 92-year-old Dariye Dafwan, father of a former Governor of Plateau State, Joshua Dariye.\nThe police spokesperson also noted that most of the kidnappers were indigenes of Bokkos, where Mr Dariye was kidnapped“This crime is laced with wickedness.\nHe was kept and treated in a manner that was unbefitting of his status and age,” the police statement said.\n“Rather than let the innocent old man go home, the kidnappers, in addition to the trauma they made Pa Dariye to go through, in addition to the extortion of N10 million that they had successfully executed, they went on to murder Pa Dariye in cold blood.\nHe advised users of the social media to remain circumspect and protect themselves from cyber crooks masquerading as online friends."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari arrives Imo State on working visit",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has arrived Owerri, Imo State capital on a working visit to the state government.\nThe president is to commission projects executed by the state governor, Senator Hope Uzodinma.\nHe landed at the Sam Mbakwe Airport in Owerri, the state capital where he was received by dignitaries.\n“It is with a heart full of gratitude that I, on behalf of the good people of Imo State, welcome His Excellency President Muhammadu Buhari GCFR to the Eastern Heartland on a working visit to commission some of our completed people-oriented projects,” he wrote.\n“Mr President, we are delighted to have you in Imo State on this august occasion despite your tight schedules and it’s our pleasure that while in Imo State, you will enjoy the hospitality and conviviality of our people."
  },
  {
    "headline": "Nigeria records 5 deaths, 559 new cases of Covid-19",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Wednesday disclosed that the country suffered five more deaths from Covid-19 pandemic, bringing the total fatality rate to 2,578.\nLagos State, the epicenter of the pandemic recorded the highest infections in Nigeria with 232 cases out of 597 infections.\nOyo State recorded 28 infections to rank fourth on the chart while Kaduna ranked 5th with 25 cases.\nAkwa Ibom recorded 19 cases, followed by Kwara and Ekiti State with 18 and 13 cases respectively.\nMeanwhile, both Bayelsa and Cross River states recorded nine cases each while Ogun reported six; Kano, three and Gombe State recorded two cases as the state with the lowest figure"
  },
  {
    "headline": "Air Peace CEO, Allen Onyema gifts Super Eagles N20m",
    "summarized_story": "Mr Allen Onyema, Chairman and CEO of West Africa’s leading airline, Air Peace, has fulfilled his N20 million promise to the Super Eagles, Nigeria’s national football team.\nAhead of the match against the Blue Sharks of Cape Verde, Onyema had promised to gift N20 million to the Nigerian team if they emerged victorious.\nThe Nigerian team defeated their opponent 2-1 in the game which held on Tuesday.\nThe Air Peace boss said he was delighted that the Eagles did not disappoint the nation.\nThere were celebrations all over the country- North, South, East and West,” Onyema stated."
  },
  {
    "headline": "First Bank launches revolutionary mobile banking app, restates commitment to put customers first",
    "summarized_story": "The banking app is the first of its kind in the industry, exposing customers to a wealth of opportunities to promote their safety, convenience whilst ensuring they are at an edge in today’s digital banking world.\nIt is a mobile banking app developed and owned by the Bank and configured with a wide range of exciting features to meet the needs of its dynamic customers.\nWith the LIT app, customers are also able to log and manage their complaint(s) without having to visit the branch.\nThe LIT app is not all about usage but rewards as users (customers) are rewarded for using the application.\nThe LIT App is the latest addition to the Bank’s robust electronic banking family, with others being the multiple global award-winning FirstMobile, *894# USSD Banking, FirstOnline internet banking, WhatsApp chat banking, amongst many others.”"
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap 18 Lagos-bound Passengers In Ondo",
    "summarized_story": "Unknown gunmen have kidnapped 18 passengers heading to Lagos in Ondo State.\nLEADERSHIP learnt that the travellers were attacked and kidnapped along the Idoani-Ifira road in Akoko axis of the state on Wednesday evening.\nThe incident occurred at a failed portion of the Idoani-Ifira road in Akoko South-East local government area of the state.\nADVERTISEMENTIt was learnt that there were sporadic shootings while the gunmen carried out their nefarious activities, causing other road users to run helter-skelter for their safety.\nIt was also gathered that the passengers were robbed of their valuables before they were taken into the forest."
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap 18 Lagos-bound Passengers In Ondo",
    "summarized_story": "Unknown gunmen have kidnapped 18 passengers heading to Lagos in Ondo State.\nLEADERSHIP learnt that the travellers were attacked and kidnapped along the Idoani-Ifira road in Akoko axis of the state on Wednesday evening.\nThe incident occurred at a failed portion of the Idoani-Ifira road in Akoko South-East local government area of the state.\nADVERTISEMENTIt was learnt that there were sporadic shootings while the gunmen carried out their nefarious activities, causing other road users to run helter-skelter for their safety.\nIt was also gathered that the passengers were robbed of their valuables before they were taken into the forest."
  },
  {
    "headline": "BREAKING: Emir Of Kontagora Is Dead",
    "summarized_story": "The Emir of Kontagora in Niger State, Alhaji Saidu Namaska, is dead.\nHe reigned for 47 years.\nHe was the vice chairman of Niger State Council of Traditional Rulers.\nDetails Later…"
  },
  {
    "headline": "BREAKING: Emir Of Kontagora Is Dead",
    "summarized_story": "The Emir of Kontagora in Niger State, Alhaji Saidu Namaska, is dead.\nHe reigned for 47 years.\nHe was the vice chairman of Niger State Council of Traditional Rulers.\nDetails Later…"
  },
  {
    "headline": "Research, Innovation, Essential Tools In Driving Economic Growth – DG NITDA",
    "summarized_story": "Research, innovation and human capital development has been described as ladder of achieving optimal economic growth of the nation, especially through harnessing the potential of youths, in order to have a technologically advanced country driven by digital economy.\n“It is exciting to know that academic institutions are realising the need to collaborate with Federal Government organisations in symbiotically pulling resources together for the growth of the nation”, the DG noted.\n“Investing in research and development will grow the economy of our country because all administrative strategies and frameworks are built on the basics and fundamentals of research and innovations”, the DG stated.\nHe assured the visitors of a possible collaboration on human capital development which falls under the Digital Literacy and Skills pillar of the SRAP.\nThe DG averred that the world is going digital and it was important for institutes of learning to constantly engage in research and innovations as it is the bedrock of economic growth of any nation."
  },
  {
    "headline": "GDP rising, inflation falling, yet poverty worsening – Rewane",
    "summarized_story": "The Chief Executive Officer of Financial Derivatives Company Limited, Mr Bismarck Rewane, has said Nigeria’s Gross Domestic Product is rising and inflation rate is falling, but more people are living below the poverty line.\nBeans 122.22 per cent, pepper 100 per cent, flour 61.54 per cent but inflation falling!\nRewane noted that in Q2, out of 46 activities, 34 expanded, eight slowed and four contracted.\n“Real GDP (2.7 per cent) still below potential GDP (8.3 per cent).\nHe said, “Rising concerns on debt sustainability suggest Nigeria is quickly falling into a debt trap."
  },
  {
    "headline": "GDP rising, inflation falling, yet poverty worsening – Rewane",
    "summarized_story": "The Chief Executive Officer of Financial Derivatives Company Limited, Mr Bismarck Rewane, has said Nigeria’s Gross Domestic Product is rising and inflation rate is falling, but more people are living below the poverty line.\nBeans 122.22 per cent, pepper 100 per cent, flour 61.54 per cent but inflation falling!\nRewane noted that in Q2, out of 46 activities, 34 expanded, eight slowed and four contracted.\n“Real GDP (2.7 per cent) still below potential GDP (8.3 per cent).\nHe said, “Rising concerns on debt sustainability suggest Nigeria is quickly falling into a debt trap."
  },
  {
    "headline": "Heartless passengers strangle Lagos doctor-turned Uber driver, steal car",
    "summarized_story": "A medical doctor, Morenikeji Oluwaniyi, has been reportedly strangled by a four-man gang in the Abule Egba area of Lagos State.\nAs the vehicle got to the Underbridge area in Abule Egba, the hoodlums reportedly pounced on him and strangled him.\n“They took us to where the crime was committed at the Underbridge in Abule Egba and that was where we found his corpse.\nHe said, “The suspects, Rilwan Nasiru, 27; Sodiq Taiwo, 23 and Oladimeji, 20, booked a Uber service online, lured the driver to the Meiran area and strangled him.\nThe suspects, after the dastardly act, dumped his body on the Abule Egba Bridge, along the Lagos-Abeokuta Expressway and made away with his Toyota Corolla saloon car."
  },
  {
    "headline": "Heartless passengers strangle Lagos doctor-turned Uber driver, steal car",
    "summarized_story": "A medical doctor, Morenikeji Oluwaniyi, has been reportedly strangled by a four-man gang in the Abule Egba area of Lagos State.\nAs the vehicle got to the Underbridge area in Abule Egba, the hoodlums reportedly pounced on him and strangled him.\n“They took us to where the crime was committed at the Underbridge in Abule Egba and that was where we found his corpse.\nHe said, “The suspects, Rilwan Nasiru, 27; Sodiq Taiwo, 23 and Oladimeji, 20, booked a Uber service online, lured the driver to the Meiran area and strangled him.\nThe suspects, after the dastardly act, dumped his body on the Abule Egba Bridge, along the Lagos-Abeokuta Expressway and made away with his Toyota Corolla saloon car."
  },
  {
    "headline": "Video: President Buhari lands in Imo",
    "summarized_story": "President Muhammadu Buhari has arrived in Imo State for the inauguration of key projects.\nBuhari landed at the Sam Mbakwe Airport in Owerri on Thursday, where he was received by dignitaries.\nIn a post on Facebook, Governor Hope Uzodinma joyously welcomed the President to the state whilst thanking him for honoring his invitation.\nHe wrote, “It is with a heart full of gratitude that I, on behalf of the good people of Imo State, welcome His Excellency President Muhammadu Buhari GCFR to the Eastern Heartland on a working visit to commission some of our completed people-oriented projects.\n“Mr President, we are delighted to have you in Imo State on this august occasion despite your tight schedules and it’s our pleasure that while in Imo State, you will enjoy the hospitality and conviviality of our people.”"
  },
  {
    "headline": "Just In: Gunmen kidnap 18 travellers in Ondo",
    "summarized_story": "Gunmen have abducted 18 travellers in Ondo State.\nThe Commander of Ondo State Security Outfit, codenamed Amotekun, Adetunji Adeleye, confirmed the incident on Thursday.\nHe said the victims were abducted on Wednesday night along the Ifira-Akoko/Idoani road in the state.\nHowever, the police have yet to confirm the incident.\nThe police spokesperson in the state, Tee-Leo Ikoro, also didn’t respond to calls from PM News."
  },
  {
    "headline": "BREAKING: Emir Of Kontagora, Alhaji Saidu Umaru Namaska Is Dead",
    "summarized_story": "Alhaji Saidu Umaru Namaska, the Sarkin Sudan of Kontagora, Niger State, has died.\nAlso, no official statement has been issued from the family and palace but a source confirmed the demise of the monarch.\nHis death comes three months after bandits gunned down his son, Alhaji Bashar Saidu Namaska, during an attack on the monarch’s farm.\nNEWS DIRECT reports that the deceased was on the farm along Zuru road in Kontagora Local Government Area when the bandits struck.\nAlso, other people working with him were said to have been shot dead while an unspecified number of cows were rustled."
  },
  {
    "headline": "VAT: Adamawa Becomes First Northern State To Support Reform",
    "summarized_story": "Adamawa State has stated that it is willing to accept Rivers State Governor Nyesom Wike’s position on the collection of Value Added Tax (VAT) in the state, making it the first northern state to do so.\nThe court noted that the Rivers administration, not the Federal Inland Revenue Service (FIRS), was authorized to collect VAT.\nFollowing that, Mr Wike signed the state’s VAT collection measure into law.\n“Whatever will bring improvement to the IGR is a welcome idea for an insurgency ravaged state like Adamawa,” he reiterated.\nSurely it’s a case of interest to us and we would like to be joined.”Gombe State governor, Muhammad Inuwa YahayaGombe State governor, Muhammad Inuwa YahayaMeanwhile, Gombe state governor admonished Mr Wike to reconsider his stance on tax collection, arguing that it will have adverse effects on his state and others."
  },
  {
    "headline": "BREAKING: Buhari Lands In Imo Despite IPOB’s Warning [PHOTOS+ VIDEO]",
    "summarized_story": "President Muhammadu Buhari has arrived in Owerri, the Imo state capital.\nBuhari who landed at the Sam Mbakwe Airport was received by dignitaries.\nThe President is set to commission several projects by the state governor, Hope Uzodinma.\nGovernor Hope Uzodinma, in a post on Facebook, stated that the President is in the state to commission some projects.\nPolice gave the warning after Indigenous People of Biafra, IPOB, issued a sit-at-home order in Imo and four other southeastern states in apparent disapproval of Buhari’s visit."
  },
  {
    "headline": "[EXPOSED] VAT Controversy: FG Plots To Move Case File To Abuja",
    "summarized_story": "Justice Pam made the assertion while delivering judgement in Suit No.\nFHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant).\nThe judge dismissed the preliminary objections filed by the defendants that the Court lacks jurisdiction to hear the suit and that the case should be transferred to Court of Appeal for interpretation.\nAlso, the court declared that the defendants are not constitutionally entitled to charge or impose levies, charges or rates (under any guise or by whatever name called) on the residents of Rivers State and indeed any state of the federation.\n“The court noted that the application is like asking the Federal High Court to transfer the entire case to the Court of Appeal."
  },
  {
    "headline": "Breaking: First class Emir, Sarkin Sundan of Kontagora, is dead",
    "summarized_story": "The Sarkin Sudan, Kontagora in Niger state, Alhaji Saidu Namaska, on Thursday passed on.\nThe monarch who until his death was the Vice-Chairman, Niger State Council of Traditional Rulers spent 47 years on the throne having ascended to the stool in 1974 as the sixth Sarkin Sudan, Kontagora.\nHe said, “the late Sarkin Sudan of Kontagora was a bridge-builder who reached across ethnic, cultural, and religious divides to promote peace and unity not only in his domain but the State as a whole.\nThe contributions of late Saidu Namaska to the development of Kontagora Emirate, the entire State and indeed Nigeria are unparalleled”.\n“The government and people of Niger State expressed their heartfelt condolences to the Chairman, Niger State Council of Traditional Rulers, Alhaji Yahaya Abubakar, the Etsu Nupe, family of late Alhaji Saidu Namaska and the people of Kontagora Emirate.”Late emir of Kontagora, Saidu NamaskaSent from Yahoo Mail on Android"
  },
  {
    "headline": "Breaking: First class Emir, Sarkin Sundan of Kontagora, is dead",
    "summarized_story": "The Sarkin Sudan, Kontagora in Niger state, Alhaji Saidu Namaska, on Thursday passed on.\nThe monarch who until his death was the Vice-Chairman, Niger State Council of Traditional Rulers spent 47 years on the throne having ascended to the stool in 1974 as the sixth Sarkin Sudan, Kontagora.\nHe said, “the late Sarkin Sudan of Kontagora was a bridge-builder who reached across ethnic, cultural, and religious divides to promote peace and unity not only in his domain but the State as a whole.\nThe contributions of late Saidu Namaska to the development of Kontagora Emirate, the entire State and indeed Nigeria are unparalleled”.\n“The government and people of Niger State expressed their heartfelt condolences to the Chairman, Niger State Council of Traditional Rulers, Alhaji Yahaya Abubakar, the Etsu Nupe, family of late Alhaji Saidu Namaska and the people of Kontagora Emirate.”I"
  },
  {
    "headline": "VIDEO: How President Muhammadu Buhari was welcomed in Imo state",
    "summarized_story": "NextBreaking: First class Emir, Sarkin Sundan of Kontagora, is dead"
  },
  {
    "headline": "PFN urges Christians to leverage on electronic process",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) has called on Christians to take advantage of the electronic voting system introduced by Independent National Electoral Commission to elect credible members to power.\nThe PFN Chairman South-South, Apostle Zilly Aggrey of Royal House of Grace made the call at the Social Security Outreach program, at Greater Evangelism worldwide Crusade, Opolo Yenagoa.\nHe said, “the christians should take advantage of having a voters card, most especially now, they have started electronic registration of voters card, and INEC came to explain point by point how our people can access the site and the form is registration.\nI want to appreciate the INEC for this initiative."
  },
  {
    "headline": "Fulani group dares southern governors, says anti opening grazing law satanic – NigPilot",
    "summarized_story": "Fulani socio-cultural group, Miyetti Allah Kautal Hore has described the anti-opening grazing law as satanic and a unanimous decision of southern governors to destroy pastoralists means of livelihood.\nMiyetti Allah group disclosed this in Masaka community, Abuja suburb on Monday at a press briefing, jointly delivered by its national president, Alh.\nHe further called for proper funding of the National Commission for Nomadic Education and the expansion of its mandate.\n“This oppressive laws and hostile policies being enacted by state governors are fundamentally going against the Fulani Pastoralist culture, economic interest and constitutional rights.\n“To this effect any action taken by any state Assembly that is in conflict with an above section of the 1999 Constitution as amended is null and void."
  },
  {
    "headline": "NITDA graduates 200 kids in emerging technologies – NigPilot",
    "summarized_story": "National Information Technology Development Agency, NITDA has graduated 200 kids from its Science, Technology, Engineering and Mathematics (STEM) Boot Camp for Kids (SB4KIDS) 2021 edition to further ensure that Nigeria becomes a digitally proficient economy.\nKashifu said NITDA had through its National Centre for Artificial Intelligence and Robotics (NCAIR) embarked on a two weeks training for kids on STEM Education, which is a yearly initiative, normally conducted during the summer school holidays.\n‘‘We at NITDA believe that the early involvement of youngsters in technology and innovation will accelerate the development of the technology sector and create future technology leaders who will transform the Nigerian technology space and boost the Nigerian Digital Economy.\nThe first three (3) from each batch will receive a laptop, while all the twenty (20) selected winners will receive a STEM kit that will help them with their STEM education journeys.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Katsina Banditry: 19 LGA flashpoints identified as phone charging business outlets suspended – NigPilot",
    "summarized_story": "AS part of continuous measures in tackling insecurity, Governor Aminu Bello Masari of Katsina State has an Executive order No 4, announced the suspension of business outlets engaging in phone charging business in the banditry prone areas of the state.\nHe also identified Nineteen, 19, local government areas as bandit’s flashpoints.\nThe Governor made this known while inaugurating the committee on Monitoring and Enforcement of the Security Challenges (Containment) Order today, Monday.\nThe Nineteen local government areas that were identified by Governor Masari as the flashpoint areas are where the committee is expected to beam their searchlight.\nThe Katsina State Commissioner of Police, CP Sanusi Buba is the Chairman while the Secretary to the State Government, Mustapha Inuwa will serve as secretary of the committee respectively."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap 18 Travellers In Ondo",
    "summarized_story": "Gunmen have abducted 18 travellers in Ondo State.\nThe victims were abducted on Wednesday night along the Ifira-Akoko/Idoani road in Akoko South East Local Government Area of the state.\nThe abductors were said to have fired gunshots into the air to scare the passengers before taking them into a nearby forest.\nThe Commander of Ondo State Security Outfit, codenamed Amotekun, Adetunji Adeleye, confirmed the incident to Channels Television on Thursday.\nAdeleye, however, said 14 of the victims have been rescued by men of the agency while efforts are ongoing to rescue the rest."
  },
  {
    "headline": "How NDLEA Intercepted N6bn Insurgents’ Drugs In Lagos Port — Marwa",
    "summarized_story": "﻿Chairman of the National Drug Law Enforcement Agency (NDLEA), Brig.\nGen. Mohammed Buba Marwa on Wednesday said N6 billion worth of drugs meant for insurgents were intercepted by the agency.\nMarwa, who spoke at a media briefing to update the public on the seizure, said loads of Captagon, a brand of Amphetamine were intercepted by operatives of the agency at the Apapa Port in Lagos State.\nThe container passed through three countries and was trans-loaded in a North African country, but the NDLEA kept track of it along with its partners, he explained.\nThe Chief Executive Officer of the NDLEA vowed that the agency would not rest until everyone connected to the consignment was arrested and prosecuted."
  },
  {
    "headline": "Bandits Kill Police Officer, Abduct 23 Others In Kaduna",
    "summarized_story": "A police officer has been killed with 23 others abducted when bandits attacked Ungwan Maje and Ungwan Laka villages in the Chikun Local Government Area of Kaduna State.\nEyewitnesses told Channels Television that the gunmen first attacked Ungwan Maje where they abducted 16 persons, majorly women and children.\nThey later proceeded to the Ungwan Laka community where they killed a mobile police officer identified as Joshua Markus.\nThe spokesman of the Kaduna State Police Command, Mohammed Jalige, also confirmed the incident to Channels Television.\nHe said security operatives were on the trail of the bandits with a view to arresting them and rescuing the kidnapped victims."
  },
  {
    "headline": "FG Approves National Policy On 5G Network",
    "summarized_story": "The Federal Government has approved the National Policy on the fifth-generation (5G) network in Nigeria.\nHe explained that the benefits that accrue from using the 5G network include larger capacity, higher data rates, among others.\nThat is the National Policy on Fifth Generation Networks for Nigeria’s digital economy, the national policy on 5G,” he said.\nOn May 19, the Senate asked the Federal Government to suspend plans to deploy the 5G network pending a six-month investigation into possible health risks associated with the technology.\nAway from the 5G network, the Minister also reacted to the security situation in the North-West."
  },
  {
    "headline": "Afghans Fear For Jobs And Money After Taliban Takeover",
    "summarized_story": "This is impossible,” she told AFP at a street market in Kabul.\n“It is up to you if you want to continue your job, or quit,” the Taliban told him.\nHe told AFP that some soldiers like him could not access their salaries in the months leading up to the Taliban takeover in mid-August.\nOther members of the security forces complained of not getting paid at all in the months leading up to the Taliban takeover.\nA kitchenware shopkeeper in the capital, who did not want to give his name for security reasons, told AFP had no customers."
  },
  {
    "headline": "Bandits kill police officer, abduct 23 others in Chikun LGA",
    "summarized_story": "A police officer has been killed and at least 23 persons abducted when bandits attacked Ungwan Maje and Ungwan Laka villages in Chikun Local Government Area, Kaduna State.\nThe gunmen invaded the villages in their numbers in the early hours of Wednesday and shot intermittently to cause panic.\nAccording to eyewitnesses, they blocked all exit routes before storming Ungwan Maje, where 16 people were abducted, the majority of whom were women and children.\nThey eventually relocated to Ungwan Laka, where they shot and killed a mobile police officer before kidnapping his wife, daughter, and othersMohammed Jalige, the spokesperson for the Kaduna State Police Command, confirmed the event but reassured civilians that security personnel are on the trail of the bandits with the goal of apprehending them and rescuing the kidnapped victims."
  },
  {
    "headline": "Niger Govt mourns Emir of Kontagora Saidu Namaska, describes him as a man of peace",
    "summarized_story": "The Niger state government has expressed sadness over the death of Emir of Kontagora, Alhaji Saidu Namaska.\nIn a statement issued by his chief press secretary, state governor Abubakar Sani Bello eulogized the traditional ruler, describing him as a man of peace who secured peace and tranquility in his emirate throughout his reign.\nThe late monarch was turbaned as Sarkin Sudan Kontagora, Emir of Kontagora and designated as the 6th Emir in 1974.\nSarkin Sudan Kontagora was the longest-surviving traditional ruler in Northern Nigeria till his death in the early hours of this morning in Abuja."
  },
  {
    "headline": "Tackling sexual assault: Mirabel Centre names Duchess of Cornwall Rosemary Shand as patron",
    "summarized_story": "Camilla Rosemary Shand, Duchess of Cornwall, has become the first patron of Nigeria’s Sexual Assault Referral Centre (SARC), The Mirabel Centre.\nThe British deputy high commissioner to Nigeria, Ben Llewellyn-Jones said the duchess was delighted to become Patron of the Mirabel Centre in Lagos.\nThe Chief Medical Director of LASUTH, Prof Fabanwo also noted that this partnership will help on addressing under-reporting of sexual assault cases.\nThe Mirabel Centre was founded in July 2013 to support survivors of sexual violence, including persons with disabilities.\nIt is Nigeria’s first SARC Centre and has provided free medical services to over six thousand survivors since its inception."
  },
  {
    "headline": "Breaking: Gunmen kidnap 18 passengers in Ondo",
    "summarized_story": "A Lagos bound bus with 18 passengers has been attacked by armed men and unspecified number of travellers kidnapped between Idoani Ifira axis of Ondo state.\nThe incident occurred on the failed portion of the Idoani-Ifira road in Akoko Southeast local government area of the state.\nIt was gathered that there were sporadic shootings while the gunmen carried out their nefarious activities causing the passengers to run helter skelter on the road.\nConfirming the incident, the divisional police officer for Isua Akoko, Hakeem Sadiq said the case had been reported and that the anti-kidnapping unit.\nHe called on Federal government through the minister of works Babatunde Fashola to look into all federal roads in ondo state as many are now in state of disrepair."
  },
  {
    "headline": "Chinese Gaming Stocks Tumble after Regulators Summon Firms",
    "summarized_story": "Chinese gaming and media stocks including Tencent Holdings and NetEase fell on Thursday a day after authorities summoned them and other gaming firms to ensure they implemented new rules for the sector.\nTencent shares shed 4% in Asia trade.\nNetEase’s Hong Kong-listed shares dropped 6.45% after a 5% decline in the company’s U.S. shares overnight.\nBilibili’s Hong Kong-listed shares shed more than 7%, also tracking an overnight fall in the U.S. shares of the short video sharing and gaming company.\nSeparately on Thursday, Chinese state media cautioned investors against blindly buying Chinese stocks hoping to profit from the so-called Metaverse, saying that they will likely end up in tears."
  },
  {
    "headline": "UK Says It’s Ready to Send Migrant Boats Back to France",
    "summarized_story": "Hundreds of small boats have attempted the journey from France to England so far this year, across one of the world’s busiest shipping lanes.\nMichael Ellis, Britain’s acting attorney-general, will draw up a legal basis for border officials to deploy the new strategy, the official said.\nDarmanin protested that “safeguarding human lives at sea takes priority over considerations of nationality, status and migratory policy”, the reports said.\nFrance and Britain agreed in July to deploy more police and invest in detection technology to stop Channel crossings.\nFrench police have confiscated more dinghies but they say they can only reduce the flow of departures."
  },
  {
    "headline": "Morocco’s Ruling Party Suffers Crushing Defeat to Liberal Rivals",
    "summarized_story": "Morocco’s long-ruling party has suffered a crushing defeat to liberal rivals in parliamentary elections, according to provisional results announced by the interior minister.\nThe Justice and Development Party (PJD) saw its support collapse from 125 seats to just 12, far behind its main liberal opponents, the National Rally of Independents (NRI) and the Authenticity and Modernity Party (PAM), and the centre-right Istiqlal Party (PI).\nHe picks the prime minister from the party that wins the most seats in the 395-member parliament and appoints key ministers.\nThe new voting rules, seen by PJD leaders as having been introduced specifically to target their majority share, change the way seats are allocated.\nIn a statement on Wednesday, the PJD accused rivals of electoral violations including buying votes, without providing any details."
  },
  {
    "headline": "ECOWAS Suspends Guinea after Coup, Says It Will Send Mediators",
    "summarized_story": "West Africa’s main regional bloc has suspended Guinea’s membership, days after a military coup that removed President Alpha Conde.\nThe ECOWAS leaders also agreed to send a high-level mission to Guinea as soon as Thursday.\nThis week, a team of special forces arrested Guinea’s President Conde and seized power in a coup.\nDoumbouya, Guinea’s coup leader, has pledged to install a unified, transitional government but has not said when or how that will happen.\nSince the coup, life in the streets of Conakry appears to have returned to normal, with some military checkpoints removed."
  },
  {
    "headline": "Nigeria’s Central Bank Governor Calls for Urgent Action to Address Food Crisis",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele, on Wednesday, warned that the food crisis being experienced in the country could worsen if urgent and resilient steps were not taken to address the situation.\nEmefiele made the assertion while presenting a keynote address at the 2021 CBN Executive Seminar in Uyo.\nThe CBN governor expressed worry over severe disruptions to the agricultural value chain due to security challenges in the country and the COVID-19 health crisis.\nThe CBN governor said the fact that the United Nations projected Nigeria’s population to be 398 million by 2050 challenged Nigeria’s common will to implement strategies targeted at achieving food security.\nOne of the defining elements of the social contract, apart from physical security and shelter, is food security."
  }
]