[
  {
    "headline": "Yellow fever outbreak in Nigeria, a pandemic, says WHO",
    "summarized_story": "The World Health Organisation has said Nigeria is currently undergoing an outbreak of yellow fever with a total of 172 deaths reported across five states in the country.\nThe body made this known in a recent report titled, ‘WHO supports Nigeria in responding to the yellow fever outbreak amidst an ongoing pandemic’.\nAccording to the WHO, a total of 530 suspected cases have also been reported by the Nigeria Centre for Disease Control.\nIt stated, “The World Health Organisation is supporting Nigeria to respond to the outbreak.\nWorkers at selected hospitals in each of the five affected states have been trained and provided with supplies to treat yellow fever patients."
  },
  {
    "headline": "Late Edo youth wandered into military checkpoint naked, mother picked him up alive – Army",
    "summarized_story": "The Nigerian Army has denied torturing one Christian Ehima to death in Edo as claimed by the deceased’s mother.\nGen Onyema Nwachukwu, in a statement on Sunday and made available to journalists in Benin, described as misleading the report on social media alleging that troops tortured one Ehima to death in Igbake, Edo State.\n“The incident was recorded both on video and audio, showing the behaviour of Christian Ehima and his mother commending the soldiers for their kind intervention.\n“The evidence, including audio recordings of the police officer and her son, are there for all to peruse,” he said.\nRecall that there had been report on social media in which Christian’s mother, Ehima Mercy, alleged that her son died as a result of torture in the hands of soldiers."
  },
  {
    "headline": "APM Terminals Apapa handles 8.1 million TEUs in 15 years",
    "summarized_story": "By Godwin OritseNigeria’s largest container terminal, APM Terminals Apapa handled a little above 8.1 million twenty equivalent units (TEU) of containers in the past 15 years.\nTerminal Manager of APM Terminals Apapa, Steen Knudsen, said container volumes at the terminal have increased by an average of 23 percent annually over the past five years.\nHe said the strategy of APM Terminals Apapa is to be the preferred logistics gateway into the Nigerian economy, and in doing so – to provide world-class services.\nAPM Terminals is a global company, and as such we bring in international practices and best standards when it comes to facilitating the international flow and international trade into the market.\nAPM Terminals Apapa is the largest container terminal in West Africa."
  },
  {
    "headline": "Electoral Bill: Reps set to override Buhari, pass document into law",
    "summarized_story": "By Levinus Nwabughiogu-AbujaHouse of Representatives may not bat an eyelid in overriding President Muhammadu Buhari on the yet-to-be assented electoral amended bill.\nIf two-thirds majority in each House pass the Bill, then that Bill becomes law and the Presidents’ assent i.e.\nHis problem with the electoral act is not the direct primaries but the direct transmission of results from the units.\nThey do not want direct transmission and are only using the direct party primaries as an excuse.\nSection 58 of the Constitution is the provision that guides and regulates passage of bills and assent or veto override.”"
  },
  {
    "headline": "Jonathan consoles Ezeife over wife’s death",
    "summarized_story": "Ex-President Dr Goodluck Ebele Jonathan has commiserated with former Anambra State Governor, Dr Chukwuemeka Ezeife over the passing on of his wife Njideka Ezeife, describing her death as a sad loss.\nDr Jonathan in a message of condolence to the former Governor and the people of Anambra State stated that the late Mrs Ezeife played a key role in the growth and development of the State, having served as the First Lady to the first elected governor of the State.\nThe former president stated: “I am deeply saddened by the news of the passing on of your dear wife, Mrs Njideka Ezeife, who transited to eternal glory after a brief illness.\n“The death of a close relation is always a painful experience for which, as mortals, we are encouraged to draw solace from God’s abiding grace and abundant love.\n“Mrs Ezeife was a well-loved and devout woman who diligently served the people of Anambra State and humanity and left behind worthy legacies that will continue to endure."
  },
  {
    "headline": "BREAKING: Prominent Itsekiri female leader, Ugbogbo Ebebe is dead",
    "summarized_story": "By Jimitota OnoyumeProminent Itsekiri female Chief widely known more by the name Ugbogbo Ebebe, Chief Agnes Onesanden Enonuwewu is dead.\nShe was a Philosopher , the Miriam Makeba of Itsekiri.\nBut was great in Itsekiri”.\nSecretary Itsekiri Leaders of Thought, ILoT, Sir Sunny Mene remembered her for her great lyrics.\n“She was a popular Itsekiri singer whose songs calmed nerves during turbulent times in Itsekiri ."
  },
  {
    "headline": "Rep member Ereyitomi empowers constituents with starter packs",
    "summarized_story": "As they drum support for Ereyitomi’s continuation 2023The House of Representatives member representing Warri Federal Federal Constituency, Hon.\nThomas Ereyitomi as part of his continuous Human Capital Development program has empowered more constituents of the three Warri LGAs, Delta State.\nwho noted that within a spell of a month after delivering a huge training and empowerment for Warri Federal constituency, in Koko and Warri, Hon.\nHe called on all who mean well for the Warri federal constituency to continue supporting Dr. Ereyitomi in his quest to sure delivering of quality representation to Warri South, Warri North, and Warri South-West LGAs.\nPersonal Assistant to Chief Ereyitomi, Seth Doupregha disclosed that since the history of the Warri federal constituency it has not been so good as Hon."
  },
  {
    "headline": "Adoration Ministry has enjoyed peace, good governance under Gov Ugwuanyi’s administration – Fr. Mbaka",
    "summarized_story": "Ugwuanyi on arrival amid loud ovation and cheers from the large crowd, the Spiritual Director of the Adoration Ministry, Rev.\nEjike Mbaka, applauded the governor for his commitment to peace and good governance, as well as his solidarity, brotherly love, friendship and paternal support to the Ministry.\nMbaka, who described Gov.\nAddressing the Adorers, Gov.\nUgwuanyi, the Chieftaincy title of “Ifezulumba”, in recognition of his “contributions towards the development of Ukpo and mankind”."
  },
  {
    "headline": "We’re winning fight against insecurity in Imo – Uzodinma",
    "summarized_story": "The Governor of Imo State, Senator Hope Uzodinma, has assured residents that his administration is winning the fight against insecurity.\nRepresented by the Commissioner for Information and Strategy; Declan Emelumba, he stated this while delivering his speech during the grand finale of the 2021 Press Week which was held at the council’s new secretariat, Owerri, Imo State capital.\nThe governor thanked Imo journalists for being partners in progress with the reconstruction, recovery and rehabilitation of the present administration.\nThe state Chairman of NUJ, Imo chapter, Chief Chris Akaraonye, in his opening speech commended planning committee members of 2021 press week for the arrangements that made the ceremony a successful outing.\nAkaraonye described the theme: “Media Participation In Security & Economic Development” as timely especially now Imo is being bedevilled with security challenges; and therefore applauded the Commissioner of Police, Imo State Command, CP Rabiu Hussain for exclusively doing justice to the topic."
  },
  {
    "headline": "Kogi govt repatriates 34 trafficked children back to Plateau",
    "summarized_story": "The Kogi State Government has repatriated 34 children trafficked from Ogun back to Plateau State.\nThe state Commissioner for Women Affairs and Social Development, Hajia Fatima Kabir Buba disclosed this on Sunday during a press briefing in Lokoja, the state capital.\nSpeaking to journalists on Sunday, Buba said the repatriated children are within the age of nine to 19 years respectively.\nContinuing, Buba said, “After several interviews and investigations by the Ministry of Women Affairs and Social Development in Kogi State, we were made to understand that all the trafficked children are from Plateau State.\nThe issue is still under investigation and the children were repatriated to their state (Plateau) and handed over to their Ministry of Women Affairs to reunite with their parents."
  },
  {
    "headline": "2023: President of Igbo extraction will heal, unite Nigeria – Ohanaeze Ndigbo",
    "summarized_story": "The apex socio-cultural organization in Igboland, Ohanaeze Ndigbo, has reaffirmed the belief of the Igbo people in the unity of Nigeria.\nHe also maintained that a Nigerian President of Igbo extraction has become imperative and an idea whose time has come, adding that it is a national necessity that is anchored on equity, justice and fairness.\nObiozor further reiterated that a Nigerian President of Igbo extraction is politically justifiable and morally defensible, positing also that it would heal and unite the nation.\nHe disclosed that Ohanaeze Ndigbo will soon announce a political action committee to canvass for the support and understanding of other Nigerians towards the actualization of a President of the Igbo bloc.\nObiozor partly stated, “In fact, no people in recent history have been unfortunate or at best had a mixed fortune or blessings as Ndigbo in Nigeria politics and governance."
  },
  {
    "headline": "Military urges media to portray Nigeria in good light",
    "summarized_story": "The Nigerian military has urged media organisations to always project the country in good light as being done by their counterparts in other societies in the general interest of the country.\nIt argued that the way local media portrays the country often contributes to shaping how the country and its citizens are perceived by the international community, including foreign investors.\n“For example, you have the CNN projecting the image of the Americans; you have the BBC projecting the image of the United Kingdom; you have the Voice of America projecting the image of America.\n“Here, in Nigeria, those who are working in the media must project the image of Nigeria positively, because it is the way you project your country that others will take it,” Sawyerr, who was also an awardee, said.\nHe commended those behind the initiative and expressed the hope that they too would one day be recognised for the good works they are doing."
  },
  {
    "headline": "BOOK OF THE YEAR: A FRONT ROW PARTICIPANT’S ACCOUNT",
    "summarized_story": "It began as a book presentation, and the bigwigs of the Nigerian political firmament gathered, especially of the APC hue.\nThe president, Muhammadu Buhari, in his full light-blue babaringa and loosed-limbed with humour, was accompanied by a raft of governors.\nThe book reviewer and this newspaper’s Editor-at-Large, Segun Ayobolu, pronounced what was to come.\nAkande’s My Participations will shake and echo in the political world for a long time.\nFor telling a story that has spun a spool stories, My Participations is our book of the year."
  },
  {
    "headline": "TRAGEDY OF THE YEAR: IKOYI FOURSCORE TOWER COLLAPSE",
    "summarized_story": "It was a tragedy not only because the dead included the ambitious builder of the ambitious residential tower and CEO of Fourscore Homes, Femi Osibona.\n“They are flats, but we make it feel like you are living in a seven-star hotel.\nEverything that is in a seven-star hotel, you will have there.\nPractically everything you have in a seven-star hotel.”- Advertisement -It was a tragedy not only because the building collapse raised questions about structural integrity and the builder’s integrity.\nIt was a tragedy not only because the crumbled tower was said to lack insurance cover."
  },
  {
    "headline": "JUDGEMENT OF THE YEAR: A VERDICT LIKE NO OTHER",
    "summarized_story": "Self-determination is a fundamental right…that cannot be subjugated – Justice AkintolaAgitations for self-determination are not new.\nThe struggle is usually long and tortuous wherever this set of people seeks to quit a nation state.\nIn some cases, the state labels them as rebels and go all out to kill their struggle.\nNo, says Justice Ladiran Akintola of the Ibadan High Court, in his verdict on the case of Yoruba Nation agitator Chief Sunday Adeyemo popularly known as Sunday Igboho against the Federal Government.\nSelf-determination is one of the fundamental human rights of the citizens that cannot be subjugated’’."
  },
  {
    "headline": "CONTROVERSY OF THE YEAR: THE WAR OVER VAT",
    "summarized_story": "Yet, it is one controversy that has refused to go away as it is yet before the judiciary for adjudication.\nRivers generated N90 billion, but was allocatedN47 billion, behind Kano that generated N24 billion and got allocated N47 billion.\nOver the years, the VAT that was first introduced under the Babangida administration has grown to become a major funding source for state governments.\nIn the past four years, about N10 trillion was generated as VAT and shared.\nIn 2020, this accounted for 22.7 per cent of the VAT, while foreign non-import VAT amounted to 27.4 per cent."
  },
  {
    "headline": "SCANDALS OF THE YEAR: TIWA SAVAGE AND DCP ABBA KYARI",
    "summarized_story": "Nigerians will not forget in a hurry, the scandals involving music diva, Tiwa Savage, and widely acclaimed ‘super cop’ DCP Abba Kyari.\nFirst was music diva, Tiwa Savage, whose sex tape set cyberspace agog.\nSocial media pulsed with outrage as fans of the music artiste and her critics went to war soon before and after the release of a sex video featuring Savage.\nSavage stated that she could release the video herself because she is ‘that crazy’.\nKyari said he introduced the tailor to Abbas after the latter expressed the desire to buy some native attires he (Kyari) shared on his Facebook page."
  },
  {
    "headline": "Again, blood flows in Kaduna as bandits kill over 20, burn several houses",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 20 persons have been killed and several property destroyed by bandits on Sunday in Giwa local government area of Kaduna State.\nThis killings came on the heels of nine persons killed by bandits in Kaduna communities about three days ago.\n“According to the report, bandits attacked Kauran Fawa, Marke and Riheya villages in Idasu, Giwa LGA, leaving more than 20 residents dead as of the time of this update.\n“The Governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief.\n“The identities of the victims will be published once further details are confirmed by the Kaduna State Government."
  },
  {
    "headline": "Yoruba groups kick against FG’s failure to declare bandits terrorists",
    "summarized_story": "By Lukman OlabiyiCoalition of Yoruba groups in the Diaspora under the auspices of Yoruba One Voice (YOV) has held that the Federal Government’s failure to officially designate bandits as terrorists, was deliberate and an attempt to realise Fulani’s agenda of recolonisation of Nigeria.\nYOV in a communiqué issued on Saturday, at the end of its international webinar conference, with the theme, “Foreign Banditry Effect on Farming and Farmers in Yorubaland,” knocked Federal Government for its alleged deliberate inaction of making the court’s order effective.\nAccording to the communiqué, the conference was attended by over 1,000 members of the group, who bemoaned the shortage of food supply in South West region as a result of insecurity in Yorubaland.\nAmong the people who signed the communiqué included YOV’s grand patron, Aare Gani Adams; the Secretary-General, Dr. Sina Okanlomo, and Olori Ladun Orolugbagbe, Publicity Secretary.\nThey lamented that farmers in Yorubaland were leaving their farms in droves due to no fault of theirs, but because of coordinated, drastic, maximum and ruinous attacks by bandits/terrorists."
  },
  {
    "headline": "Electoral Amendment bill: Buhari set to reply NASS on assent –Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has said that President Muhammadu Buhari would soon let the National Assembly know whether or not he would assent to the Electoral Act Amendment Bill 2021.\nAccording to the Senior Special Assistant on Media and Publicity to the president, Garba Shehu, Buhari has been fully briefed on the bill, especially on the contentious areas, adding that his position would be communicated to the National Assembly soon.\nSunday Sun had asked Shehu if President Buhari will sign the Electoral Amendment Bill as today (Sunday) is the last day for him to give his assent or heed to the Attorney General of the Federation and Minister of Justice, Abubakar Malami’s warning that direct primaries would throw Nigeria to chaos and the president should not sign the bill.\nThe coalition had expressed concern that President Buhari is yet to assent to the bill since it was passed and transmitted to him by the National Assembly.\nThe Senate also passed the harmonized version of the Electoral Act (Amendment) Bill, 2021."
  },
  {
    "headline": "Men pester me for marriage despite knowing I’m married –Ngozi Ezeh, actress",
    "summarized_story": "What differentiates the social media acting from the real Nollywood acting?\nWhat good or harm would you say social media has done to the movie industry?\nSocial media has helped the movie industry in mitigating copyright and piracy.\nWho exactly is Ngozi Ezeh aside the one always acting the good role in movies?\nDespite knowing that I’m married, some fans still tell me ‘I love you and I want to marry you’."
  },
  {
    "headline": "2023 presidency: Edwin Clark insists it’s turn of Southeast",
    "summarized_story": "By Agatha EmeadiElder statesman and leader of Pan-Niger Delta Forum (PANDEF), Chief Edwin Clark, has insisted that the presidency in 2023 should go to the Southeast geo-political zone.\nChief Clark reaffirmed his stand on the 2023 presidency when frontline presidential aspirant, Senator Anyim Pius Anyim, visited him in Abuja at the weekend in continuation of his consultations for the plum job.\nThe statesman encouraged Anyim to work hard with other leaders across the country to build consensus for equity and unity in Nigeria, saying that “the presidency of Nigeria in 2023 should go to the Southern part of Nigeria and indeed to the Southeast zone.\nAnyim also took the opportunity to consult with Clark on the state of the nation and his plan for the future.\n“I thank God that Chief Edwin Clark will soon be 95 years old and yet he is blessed with phenomenal memory, lucid and curious mind, a benevolent heart and boundless goodwill for all men."
  },
  {
    "headline": "Anxiety Mounts as Deadline for Buhari to Sign Electoral Bill Expires Today",
    "summarized_story": "It was learnt that he might refuse to sign the bill and ask the National Assembly to consider some of the major issues.\n“There is already a Supreme Court judgment that political parties should be allowed to decide their internal affairs.\nThe presidency source further explained that Buhari is also concerned with the cost and security implications of direct primary.\nBecause the Electoral Act (Amendment) Bill, 2021 introduces the direct primary, you should kill the whole Electoral Act (Amendment) Bill?\n“I don’t see the present rather ‘friendly’ leadership of the National Assembly galvanising the National Assembly members to override him”, he said."
  },
  {
    "headline": "Buhari Rallies International Support against Terrorism",
    "summarized_story": "Deji Elumoye in Abuja and George Okoh in MakurdiPresident Muhammadu Buhari has called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\nBenue State Governor, Dr. Samuel Ortom, also yesterday again drew the attention of Buhari to the fact Nigeria is collapsing due to terrorists’ activities.\nPresident Buhari also expressed delight that the Summit convened by Turkish President, Recep Tayyip Erdogan, has given due consideration to the issue of terrorism, while also focusing on development and infrastructure in Africa.\nBuhari advised that the partnership should also focus on the global challenge of climate change which is impacting Nigeria, Turkey, and indeed the world at large.\n“To contribute to the resolution of this issue, within our means, we plan to share 15 million vaccine doses in the period ahead,” he said."
  },
  {
    "headline": "DMO: Nigeria Didn’t Mortgage National Assets as Collateral for Chinese Loans",
    "summarized_story": "Festus AkanbiThe Debt Management Office (DMO) has clarified that loans from China to Nigeria, which presently stood at $3.59billion were largely concessional as no national asset was tagged as collateral.\n“Nigeria’s total debt stock as at September 30 was $37.9 billion; this figure comprised the external debt stock of the federal government, 36 state governments and the Federal Capital Territory (FCT).\n“But total loans from China stands at $3.59 billion, which is 9.47 per cent of the total external debt.\nThe loans did not require any national asset as collateral; they were largely concessional,’’ she said.\nShe explained that before foreign loans were contracted, very sensitive steps were taken by multiple institutions of government to ensure that they were beneficial to the nation."
  },
  {
    "headline": "Osinbajo, Lawan, Govs, Ministers Grace Installation of Buhari’s Son, Yusuf, as Talban Daura",
    "summarized_story": "This is just as the Emir of Daura, Alhaji Umar Farouk Umar, lauded the President for his leadership qualities while describing Osinbajo as a noble man and trusted person.\nSpeaking at the occasion, the Emir of Daura, Alhaji Umar, praised President Buhari for his leadership qualities, adding that power belongs to God and He gives it to whoever He pleases.\nCommending both the State and Federal Governments, the traditional ruler testified that the Katsina State Government had been working hard to end the difficulties of the masses.\nHe added also that Daura had been transformed under the leadership of the President, lauding him for the developmental strides witnessed so far.\nThe Emir of Daura also extended his appreciation to the Vice President who represented the President at the occasion."
  },
  {
    "headline": "Turkey to Help Nigeria Tackle Insecurity; Buhari, Erdogan Strengthen Defence Ties",
    "summarized_story": "“I am happy Nigeria is stepping up cooperation with other nations in areas of defence and health, and we are ready to cooperate with you on these areas and more,” said Erdogan.\nPresident Buhari had earlier said Nigeria would partner with the Republic of Turkey in dealing with the current security challenges facing the nation.\nPresident Gets Surprise Birthday Cake in IstanbulPresident Buhari, at a surprise 79th birthday reception organised for him in Istanbul yesterday promised to advance the interest of Nigerians and that of the nation as he prepares to leave office in May, 2023.\nAs he stepped out of his suite, moving to the meeting room, President Buhari met a surprise lineup of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\n“I look forward to the year 2023 when I finish, to go home to take charge of my farm."
  },
  {
    "headline": "Nigerian Government Confirms SaharaReporters' Stories, Says Presidential Jet Under Repairs In Germany Flown Back To Nigeria",
    "summarized_story": "A Boeing Business Jet (Boeing 737-700) marked 5N-FGT and owned by the Nigerian Government that was earlier taken to Germany for repairs is back in Nigeria after three months.\nTo avoid any backlash, SaharaReporters gathered that the registration of the 5N-FGT aircraft was done using AMACGND“The Presidential Boeing Business Jet registration number 5N-FGT developed a fault during his trip from New York.\n“The one that developed (a) fault has been moved to Euro Airport Basel Mulhouse Freiburg, Germany, for repairs since September.\nIn 2017, the cost of maintenance of the Presidential aircraft rose to N4.37billion (19.6 per cent).\nBut in 2021, the budget for the Presidential fleet saw its sharpest Buhari-era jump to N12.550billion (243.6 per cent)."
  },
  {
    "headline": "Nigerian Government Confirms SaharaReporters' Stories, Says Presidential Jet Under Repairs In Germany Flown Back To Nigeria",
    "summarized_story": "A Boeing Business Jet (Boeing 737-700) marked 5N-FGT and owned by the Nigerian Government that was earlier taken to Germany for repairs is back in Nigeria after three months.\nTo avoid any backlash, SaharaReporters gathered that the registration of the 5N-FGT aircraft was done using AMACGND“The Presidential Boeing Business Jet registration number 5N-FGT developed a fault during his trip from New York.\n“The one that developed (a) fault has been moved to Euro Airport Basel Mulhouse Freiburg, Germany, for repairs since September.\nIn 2017, the cost of maintenance of the Presidential aircraft rose to N4.37billion (19.6 per cent).\nBut in 2021, the budget for the Presidential fleet saw its sharpest Buhari-era jump to N12.550billion (243.6 per cent)."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS, Invites Another Activist Over Planned Protest Against Insecurity In Kaduna",
    "summarized_story": "The Department of State Services has invited Comrade Sani Saeed Altukry, one of the leaders of #ZariaPeaceWalKAgainstInsecurity protest in Zaria, Kaduna State, for questioning.\nThe protest was organised to draw the attention of government over escalating insecurity in Zaria following the frequent killings of residents by bandits.\nSaharaReporters had earlier reported how Co-convener of #SaveTheNorth and #NoMoreBloodshed protest, Zainab Naseer Ahmed, were interrogated by the DSS.\nAnother activist, Musa Bayi Muhammed, was asked to report at the DSS office in Bauchi State on December 13 for interrogation.\nIt put the blame on President Buhari because of his failure to address the security challenges in the country."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS, Invites Another Activist Over Planned Protest Against Insecurity In Kaduna",
    "summarized_story": "The Department of State Services has invited Comrade Sani Saeed Altukry, one of the leaders of #ZariaPeaceWalKAgainstInsecurity protest in Zaria, Kaduna State, for questioning.\nThe protest was organised to draw the attention of government over escalating insecurity in Zaria following the frequent killings of residents by bandits.\nSaharaReporters had earlier reported how Co-convener of #SaveTheNorth and #NoMoreBloodshed protest, Zainab Naseer Ahmed, were interrogated by the DSS.\nAnother activist, Musa Bayi Muhammed, was asked to report at the DSS office in Bauchi State on December 13 for interrogation.\nIt put the blame on President Buhari because of his failure to address the security challenges in the country."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS, Invites Another Activist Over Planned Protest Against Insecurity In Kaduna",
    "summarized_story": "The Department of State Services has invited Comrade Sani Saeed Altukry, one of the leaders of #ZariaPeaceWalKAgainstInsecurity protest in Zaria, Kaduna State, for questioning.\nThe protest was organised to draw the attention of government over escalating insecurity in Zaria following the frequent killings of residents by bandits.\nSaharaReporters had earlier reported how Co-convener of #SaveTheNorth and #NoMoreBloodshed protest, Zainab Naseer Ahmed, were interrogated by the DSS.\nAnother activist, Musa Bayi Muhammed, was asked to report at the DSS office in Bauchi State on December 13 for interrogation.\nIt put the blame on President Buhari because of his failure to address the security challenges in the country."
  },
  {
    "headline": "Kukah: God did not make a mistake with Nigeria's diversity",
    "summarized_story": "Matthew Kukah, Catholic bishop of Sokoto diocese, says God did not make a mistake in making Nigeria one nation with diversity.\nAdvertisementKukah said this on Sunday during the celebration to mark his 45th anniversary as a priest and 10 years as bishop of Sokoto diocese.\nAdvertisement“God did not make a mistake for making us a nation of diverse cultures, religions and ethnicities,” he said.\nAdvertisementEarlier this year, the bishop said it is cheaper for Nigeria to remain as one country rather than breaking up into smaller units.\nA few months before, Kukah had declared that nobody stands to gain anything if Nigeria breaks up."
  },
  {
    "headline": "Kukah: God did not make a mistake with Nigeria's diversity",
    "summarized_story": "Matthew Kukah, Catholic bishop of Sokoto diocese, says God did not make a mistake in making Nigeria one nation with diversity.\nAdvertisementKukah said this on Sunday during the celebration to mark his 45th anniversary as a priest and 10 years as bishop of Sokoto diocese.\nAdvertisement“God did not make a mistake for making us a nation of diverse cultures, religions and ethnicities,” he said.\nAdvertisementEarlier this year, the bishop said it is cheaper for Nigeria to remain as one country rather than breaking up into smaller units.\nA few months before, Kukah had declared that nobody stands to gain anything if Nigeria breaks up."
  },
  {
    "headline": "Army detains soldier who accepted corps member’s proposal",
    "summarized_story": "The Nigerian army has confirmed the detention of a female soldier who accepted the marriage proposal from a corps member at the Yikpata orientation camp of the National Youth Service Corps (NYSC) in Kwara.\nIn a statement sent to TheCable Lifestyle on Sunday, Onyema Nwachukwu, army spokesman, said the soldier violated several of the military’s rules of engagement.\nAdvertisementThe army spokesman added that the soldier’s conduct was prejudicial to good order and military discipline.\n“The female soldier in question violated the following rules of the NA.\nAs a personnel, her task was to train the Youth Corps members and not to indulge in amorous relationship with any of them."
  },
  {
    "headline": "Army detains soldier who accepted corps member’s proposal",
    "summarized_story": "The Nigerian army has confirmed the detention of a female soldier who accepted the marriage proposal from a corps member at the Yikpata orientation camp of the National Youth Service Corps (NYSC) in Kwara.\nIn a statement sent to TheCable Lifestyle on Sunday, Onyema Nwachukwu, army spokesman, said the soldier violated several of the military’s rules of engagement.\nAdvertisementThe army spokesman added that the soldier’s conduct was prejudicial to good order and military discipline.\n“The female soldier in question violated the following rules of the NA.\nAs a personnel, her task was to train the Youth Corps members and not to indulge in amorous relationship with any of them."
  },
  {
    "headline": "Kaduna killings: Do everything to destroy remaining terrorists, Buhari tells security agencies",
    "summarized_story": "President Muhammadu Buhari has condemned the recent attacks on communities across Kaduna, describing the perpetrators as “terrorists”.\nAdvertisementA total of 38 people were confirmed dead following attacks by suspected bandits in communities across Giwa LGA of Kaduna over the weekend.\nIn a statement by Garba Shehu, presidential spokesman, Buhari said the attackers are “feeling the heat” of recent security operations and as such, focusing on “soft targets”.\nAdvertisementHe, however, directed security agencies to intensify operations and “destroy the terrorists”.\n“Bandits within the week have also killed citizens in Zangon Kataf, Chikun, Birnin Gwari, Igabi and Kauru LGAs of Kaduna State."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 reasons you should care about the next frontier",
    "summarized_story": "Since then, we’ve explored The Next Frontier as it relates to edtech and fintech.\nAPI healthtech startupsPhoto by National Cancer Institute on UnsplashThe fintech industry has benefited a great deal from the presence of API fintech startups as they have eased interoperability.\nCurrently, there are no African startups providing healthtech startups with an API.\nWithout API startups, the process of getting your medical history has to begin afresh, but with an API startup, all that information could be gotten in seconds.\nHolding on January 22, 2022, it will feature startup competitions and exhibitions in addition to conversations on The next frontier."
  },
  {
    "headline": "A Zimbabwean Data Protection Act to rule them all. Or not",
    "summarized_story": "Other laws included the Consumer Protection Act, Census and Statistics Act, and the Interception of Communication Act, among others.\nInitially, The Cybercrimes and Data Protection Bill was to cover all things incidental to Cybercrime and Data Protection.\nAdvertisementThe current state of affairsThe Data Protection Act, as it is known now, is styled after the Southern Africa Development Community (SADC) model law on data protection.\nAnd it might be easier than starting afresh.”Following the recommendation of the Parliamentary Joint Committee, the new act was renamed the Data Protection Act instead of the Cybercrimes and Data Protection Act.\nThe European Union’s General Data Protection Regulation — the first comprehensive data protection law — provides for this."
  },
  {
    "headline": "Nigeria-based logistics company launches HELP, to provide ambulance services with its Uber-like model",
    "summarized_story": "Our people are scared for their lives, because what happens in the case of a health emergency?\nHow it worksThe HELP mobile app is currently available for Android users on the Play Store and is soon to be available on the App Store.\nThere are two levels of external partners at HELP, Service Partners and Client Partners.\nService partners on the HELP platform include hospitals, health facilities, and private ambulance owners in the country.\nInterestingly, a random person can access the HELP service with the code."
  },
  {
    "headline": "2021 IN REVIEW: Political will drag Nigeria’s energy gains in 2021",
    "summarized_story": "The year 2021 was predicted to herald a return to normalcy marked by oil price recovery, accelerated push towards energy transition and bold reforms that will transform Nigeria’s floundering oil sector, but the absence of political will rained on planned reforms.\n“It brought certainty and investors can evaluate its impacts on the existing and future investments,” notes Chiwendu Enechi, associate director, oil, gas and power at Anderson.\nNigeria’s new quota is 1.683 million bpd for January, but it has struggled to meet previous lower quotas in 2021.\nPower sector challenges continueIn the power sector, old troubles persisted with the power grid collapsing half a dozen times.\nThe renewable energy space saw a flurry of new investments from private investors and multilateral organisations."
  },
  {
    "headline": "Pension sector braces for competition on new investors",
    "summarized_story": "Nigeria’s pension industry will see increased competition in service delivery and returns on investment after the ongoing recapitalisation of the sector with new investors taking position.\nThis is as 11 Pension Fund Administrators (PFAs), out of the 22 registered operators, are said to have met the capital requirement ahead of next year’s recapitalisation deadline.\nRead also: Competition grows in pension sector as new investors take positionsIn addition, the Commission granted “No Objection” for the merger between Tangerine Pensions Limited and APT Pension Funds Managers Limited, while FCMB Pensions Limited, one of the subsidiaries of the First City Monument Bank Group plc, also acquired a 60 percent stake in AIICO Pension Managers Limited.\nThis is according to the African Private Equity and Venture Capital Association (AVCA) and the Pension Fund Operators Association of Nigeria (PenOp) first ever report on Nigerian Pension funds engagement with private equity released recently, which incorporated responses from Nigeria’s leading pension fund managers.\nAisha Dahir-Umar, director-general, PenCom, says the maintenance of a consistent growth trajectory continues to justify the Commission’s overriding investment philosophy of ensuring the safety of pension fund assets."
  },
  {
    "headline": "BusinessDay wins Best Designed Media Website at 30th DAME awards",
    "summarized_story": "BusinessDay has emerged winner of the Best Designed Media Website at the Diamond Awards for Media Excellence (DAME) held at the Muson Centre on Sunday.\nwins 2019 PEARL Media Award for Quality Capital Market ReportingThe Diamond Awards for Media Excellence was set up in 1991 to “reward superior performance to boost public confidence in the media.” And it is the only media award that covers print journalism, broadcasting, and advertising.\nDAME awards and Media Review, the publication, are a platform to honour the best in media.\nDAME has presented over 500 awards in different categories have been awarded since 1991BusinessDay was among 14 news media organisations nominated for thirteen categories such as best designed paper, education, judicial nutrition and investigative reporting.\nAlso known as Ladbone, he “transformed rookies into respected news hunters and opinion moulders.”Veteran and young media professionals from traditional and online media organisations were gathered at the 550-seater Shell Hall to mark the 30th edition of the DAME awards."
  },
  {
    "headline": "NAPVID distributes Xmas packages to PWDs in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – No fewer than 70 less privileged persons living with disabilities in Edo State has benefited from the Network for the Advancement of Persons With Visible Disabilities (NAPVID) Christmas packages.\nThe packages which were distributed to the beneficiaries on Saturday in Benin city, Edo State capital, include rice, groundnut oil, tin tomatoes, amongst other things.\nAccording to the executive director of NAPVID, Barr Melody Omosah, the gesture was to reach out to unemployed people with disabilities who can not provide for themselves the things they need to celebrate Christmas.\nWe feel there was a need to extend that hand of fellowship to them and give them items that would aid the Christmas celebration.\nHighpoint of the event was distribution of the items to the beneficiaries who came from different parts of the state."
  },
  {
    "headline": "Int’l Migrants Day: Obaseki urges youths to take advantage of tech revolution, agriculture – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Governor, Mr. Godwin Obaseki has urged youths to take advantage of the ongoing tech revolution in the state through programmes offered by the Edo Tech Park, to acquire technical skills in software engineering to become world-class developers.\nThe governor made the call in commemoration of the International Migrants Day, marked every December 18, by the United Nations and its sister agencies.\nHe said, “As part of our plans to end the scourge of illegal migration, we will continue to implement policies and reforms that would guarantee more economic opportunities for our youths, so they can realize their potentials and compete for top jobs as developers across the globe.”On the theme of the 2021 International Migrants Day, ‘Harnessing the Potential of Human Mobility,’ Obaseki noted, “The state government will not relent in its drive to make Edo State a digital hub that will provide youths with highly sought-after skills and create opportunities for them to be employed and work from the state for companies located anywhere in the world.\n“We have commenced the training of youths at the Edo Tech Park.\nOur plan is to train about 15,000 youths to become software engineers and equip them with the required skills to migrate legally to work in any part of the globe.”He urged youths to also embrace opportunities in the agriculture value chain by deploying innovative approaches to create wealth, noting that “the state government is building a world-class college of agriculture in the state to assist youths take advantage of opportunities in the agricultural sector.”Obaseki assured that his administration will collaborate with local and international partners to support youths to grow businesses in the state by creating the enabling environment for businesses to thrive and reducing investment risks."
  },
  {
    "headline": "Over 10,000 youths to benefit as Edo, MasterCard Foundation launch entrepreneurship programme – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – No fewer than 10,000 youths in Edo State are expected to benefit from the Transforming Nigeria Youths (TNY) Entrepreneurship programme, recently inaugurated by the state government in partnership with the Enterprise Development Centre and MasterCard Foundation.\nManaging Director, Edo Skills Development Agency, EdoJobs, Ukinebo Dare, said the programme will further boost business activities in the state, especially for Micro Small and Medium Enterprises (MSMEs).\nAnifowose noted that the youths would form the first-year beneficiaries of a five-year entrepreneurship training that would run in the state, adding that they will be exposed to three months of online training with a free data plan.\nHe added that there will be one-on-one free business mentorship, as well as access to funding for youths that would complete the three months training.\nAccording to him, “The three key objectives of the programme are to create the correct mindset about entrepreneurship, provide access to market and direct services, as well as provide access to funding opportunities."
  },
  {
    "headline": "Obaseki to upgrade 12 medical facilities, expand health insurance to rural communities in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration plans to upgrade 12 medical facilities in the state and expand the health insurance scheme to rural and hard-to-reach communities.\nObaseki, who spoke to journalists in Benin City, said his government is committed to sustaining investment in the healthcare sector, ensuring quality, efficient and affordable health services to Edo people.\nStating that the government is committed to ensuring that every Edo citizen has access to quality healthcare without having to worry about the financial burden, the governor added that health is a fundamental right.\nAccording to him, “We are determined to achieve Universal Health Coverage in Edo, ensuring quality healthcare delivery that is accessible to all citizens.\nWith the health insurance scheme now operational, we are building a superstructure to provide a strong capital base for the sustenance of the healthcare system, while providing our people with a more democratized system of accessing quality and affordable healthcare.”..."
  },
  {
    "headline": "Kuda, V Banks threaten DMBs domination",
    "summarized_story": "Some of the challenger banks giving the DMBs a run for their money are Kuda Bank Sparkle Bank, V FD Bank, Eyowo and Rubies Digital Bank.\nDespite their impressive showing, challenger banks, particularly Kuda Bank, have made significant inroads into the retail banking space as they offer incentives to younger Nigerians to abandon the more traditional banks.\nTraditional banks, however, are not allowing the challenger banks to take over their market without offering a fight.\nWEMA Bank’s savings account and Savings Goal offers about three times more than what other conventional banks offer.\n“To have a chance of having a piece of this massive deposit mine, challenger banks embark on a massive expansion of the operations."
  },
  {
    "headline": "5G spectrum auction; Stakeholders decry cost",
    "summarized_story": "The three companies participated in the 5G auction and the bidding began at $199.37m, as against the reserve price of $197.4m set by the NCC.\nBut NCC, at a stakeholders’ forum on the 3.5GHz spectrum in Lagos, disclosed that it arrived at the spectrum price by observing global best practices.\n“The exact price for the spectrum auction in 2022 will give the federal government N300 billion.\nAccording to Danbatta, the N632 billion targeted revenue will comprise expected proceeds from 5G spectrum auction.\n“The exact price for the spectrum auction in 2022 will give the federal government N300bn."
  },
  {
    "headline": "Stanbic IBTC invests in football devt, signs N2.3bn annual partnership deal with NFF",
    "summarized_story": "Stanbic IBTC Holdings PLC in bid to help to further develop football in Nigeria, has signed N2.3 billion partnership deal with the Nigerian Football Federation (NFF).\nThe signed MoU between Stanbic IBTC and NFF is slated to be effective from 2022.\nDr. Demola Sogunle, Chief Executive, Stanbic IBTC Holdings PLC, spoke of the landmark agreement.\nOver the years, various Nigerian football teams have made their marks in various international competitions.\nWe believe the Nigerian football teams will only get better and will dominate the beautiful game in the future."
  },
  {
    "headline": "First Bank launches 2021 DECEMBERISSAVYBE Calendar, reinforces commitment to enabling Dreams",
    "summarized_story": "The campaign which started in 2018 has been making waves across the cities in the country and Nigerians across ages have started Vybing, enamored in excitement.\nFirstBank DecemberIssaVybe is also designed to inspire kindness in all stakeholders.\nDecember is a season for giving and given FirstBank’s culture of showing kindness through initiatives such as SPARK (Start Performing Acts of Random Kindness), DecemberIssaVybe campaign integrates kindness and spreads its message of transforming lives.\nExcited about the 2021 DecemberIssaVybe, the Group Head of Marketing & Corporate Communications, FirstBank, Ms Folake Ani-Mumuney said “we are delighted to be back with DecemberIssaVybe.\nThe FirstBank #DecemberIssaVybe and #FirstBankIssaVybe giveaway fest is open to everyone."
  },
  {
    "headline": "Army Recruits: Be Ready To Serve Anywhere – COAS",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant-General Faruk Yahaya charged recruit intakes at the passing out parade of the 81 Regular of Nigerian Army, Chindit Barracks Cantonment, Zaria; charging them to obey all legitimate orders issued by their superior officers, no matter how unpleasant.\nHe reminded them that Nigeria is currently facing numerous security challenges, amongst them Boko Haram terrorists, armed bandits, kidnappers, secessionist agitators and other criminal elements.\n“These challenges can only be surmounted by collective resolves and efforts of every officer and soldiers of the Nigerian Army, including those of you passing out today.\n“I, therefore, urge you all to apply the mental, physical and moral training acquired over the past few months, at your respective units, formations and corps,” he said.\nWhile tasking them to upload the Nigerian Army core values, the COAS also directed them to maintain professionalism and high standard, as well as be good ambassadors of the Nigerian Army."
  },
  {
    "headline": "Fatal Auto Crash Claims 8 Lives In Bauchi",
    "summarized_story": "Yusuf Abdullahi, Sector Commander, Federal Road Safety Corps (FRSC) in Bauchi, says no fewer than eight persons lost their lives in a road accident that occurred in Bauchi on Saturday.\nAccording to him, the accident which involved an Opel Vectra car with plate number AA 954 GYD and one Tipper Mercedes Benz with number plate NIN 279 SA, happened in Goltukurwa village along Dass-Bauchi road at 9:30 pm.\nHe explained that nine people were involved in the crash, comprising two males, six females and a male child.\nAbdullahi, however, revealed that all the eight passengers in the Opel Vectra car which ran into the tipper, lost their lives while only the driver of the tipper, whose name was simply identified as Abubakar Mohammed was unscathed.\n“They should also remember that only the living souls, not the dead, would live to celebrate the Christmas and new year festivities,” he stated."
  },
  {
    "headline": "Nembe Spill: Ijaw Diaspora Council Seeks Ministry’s Intervention",
    "summarized_story": "The Ijàw Diaspora Congress (IDC) is seeking the intervention of the Federal Ministry of Humanitarian Affairs and Disaster Management in the recent oil spill at Oil Mining Lease (OML) 29 at Nembe, Bayelsa.\nThe diaspora group with headquarters in Newark, New Jersy, US, requested the intervention in a letter dated Dec. 17 and made available on Saturday to reporters.\nThe group said while the Bayelsa government and the community attributed the spill to equipment failure, it was awaiting the official position of the National Oil Spill Detection and Response Agency (NOSDRA).\nIDC also urged the Federal Government to declare the spillage a humanitarian disaster in Ijawland and act accordingly.\n“The lethargic response pace forced the victims into an immediate humanitarian crisis of epic proportions."
  },
  {
    "headline": "Nembe Spill: Ijaw Diaspora Council Seeks Ministry’s Intervention",
    "summarized_story": "The Ijàw Diaspora Congress (IDC) is seeking the intervention of the Federal Ministry of Humanitarian Affairs and Disaster Management in the recent oil spill at Oil Mining Lease (OML) 29 at Nembe, Bayelsa.\nThe diaspora group with headquarters in Newark, New Jersy, US, requested the intervention in a letter dated Dec. 17 and made available on Saturday to reporters.\nThe group said while the Bayelsa government and the community attributed the spill to equipment failure, it was awaiting the official position of the National Oil Spill Detection and Response Agency (NOSDRA).\nIDC also urged the Federal Government to declare the spillage a humanitarian disaster in Ijawland and act accordingly.\n“The lethargic response pace forced the victims into an immediate humanitarian crisis of epic proportions."
  },
  {
    "headline": "It Is President Buhari’s Prerogative To Sign Electoral Bill — Malami",
    "summarized_story": "Abubakar Malami, Minister of Justice and Attorney-General of the Federation (AGF), has said it is the prerogative of President Muhammadu Buhari to either accent to the Electoral Act Amendment Bill or not, as the constitutional timeline expires on Sunday, December 19.\nAGF who spoke on the imbroglio that has trailed the bill since it was transmitted to the President by the National Assembly three weeks ago, said his office had officially written its legal opinion to President Buhari on the Bill and the onus was on the President to either sign the Bill into law or not.\nHe made this known on Saturday through his Special Adviser on Media and Public Relations, Dr Umar Jibrilu Gwandu, Malami said though it was premature of him to comment on a process involving official communication between the office of the President and the office of the Attorney General of Federation and Minister of Justice without allowing the conclusion of the adminsitration cycle, the general public would be adequately and timely informed by the Office of the President on the decision.\nPresident Buhari has till Sunday to either assent to the Bill or not, and in the event he refuses, the National Assembly may decide to exercise its veto power to transmute the Bill into law.\nBut the general feeling in the country is that the National Assembly may not want to exercise its veto power over the contentious Bill so as not to jeopardize its relationship with the Executive."
  },
  {
    "headline": "Bob Manuel-Udokwu back at Gulder Ultimate Search",
    "summarized_story": "By AZUH AMATUSReliable but unconfirmed information reaching DAYLIGHTng has it that top actor and former anchor of TV reality show, Gulder Ultimate Search, Bob Manuel Udokwu is sensationally back on the programme.\nDAYLIGHTng gathered that viewers complained bitterly that the show was very boring, hence Bob’s return.\n“The organisers had to bring Bob back to spice it up.\nHe started recording the concluding part with the last four standing a few days ago”, hinted an insider.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Bob Manuel-Udokwu back at Gulder Ultimate Search",
    "summarized_story": "By AZUH AMATUSReliable but unconfirmed information reaching DAYLIGHTng has it that top actor and former anchor of TV reality show, Gulder Ultimate Search, Bob Manuel Udokwu is sensationally back on the programme.\nDAYLIGHTng gathered that viewers complained bitterly that the show was very boring, hence Bob’s return.\n“The organisers had to bring Bob back to spice it up.\nHe started recording the concluding part with the last four standing a few days ago”, hinted an insider.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Lawan begs Nigerians: Don’t believe PDP again – Daylight",
    "summarized_story": "Senate President Ahmad Lawan has urged Gombe youths and Nigerian youths not to believe the Peoples Democratic Party.\nYouths should not believe PDP again.”Speaking further, the Senate President noted that the President, Major General Muhammadu Buhari (retd.\n“We thank President Muhammadu Buhari.\nMr President has never rested for a second,” Lawan said.\nWhile assuring the Executive of the National Assembly’s support, Lawan noted that despite the current administration’s efforts, a lot was been desired."
  },
  {
    "headline": "Lawan begs Nigerians: Don’t believe PDP again – Daylight",
    "summarized_story": "Senate President Ahmad Lawan has urged Gombe youths and Nigerian youths not to believe the Peoples Democratic Party.\nYouths should not believe PDP again.”Speaking further, the Senate President noted that the President, Major General Muhammadu Buhari (retd.\n“We thank President Muhammadu Buhari.\nMr President has never rested for a second,” Lawan said.\nWhile assuring the Executive of the National Assembly’s support, Lawan noted that despite the current administration’s efforts, a lot was been desired."
  },
  {
    "headline": "Buhari condemns gruesome killings in Kaduna: Aso Rock Statement",
    "summarized_story": "President Muhammadu Buhari has condemned the renewed terrorist killings in Kaduna State, saying they were unacceptable.\nBandits within the week have also killed citizens in Zangon Kataf, Chikun, Birnin Gwari, Igabi and Kauru LGAs of Kaduna State.\nThe President expressed the nation’s condolences to the Government of Kaduna State, the people of Zonkwa Chiefdom and the family of His Highness Nuhu Bature, the Agwam Kajju on his demise.\nPresident Buhari affirmed that our security forces have turned the heat on the terrorists who are getting frustrated and are soft-targeting innocent citizens, looting their assets, burning their homes and killing them indiscriminately.\nHe has reiterated his directive to the security and intelligence chiefs to do everything they can to destroy the remaining vestiges of the terrorists."
  },
  {
    "headline": "Bishop Kukah marks 45 years of priesthood",
    "summarized_story": "By Muhammad Nasir/SokotoCatholic Bishop of Sokoto Diocese, Matthew Kukah, on Sunday, celebrated 45 years of priesthood and 10 years as bishop of the diocese.\nAddressing the congregation at Catholic Church in Sokoto, Kukah used the occasion to thank his parents and the Catholic family for giving him the opportunity to be what he is.\n“I talk about Nigeria with pride because before our very eyes, God will do a great thing that we will all rejoice with,” he added.\nKukah also expressed happiness that aside preaching the gospel, he had, in the last 20 years, positively impacted numerous lives through his scholarship programme to students across the federation.\n“Today I am very happy that sometimes, people stop me and say thank you Bishop Kukah for making a huge impact in our lives."
  },
  {
    "headline": "Dowen College: Syvester Oromoni’s Body Released For Burial",
    "summarized_story": "The remains of Sylvester Oromoni, a late Dowen College student, has been released to his family following an autopsy, according to the Lagos State Police Authority.\nThe autopsy results, however, have not been disclosed because the police investigation into the 12-year-old schoolboy’s death is still ongoing, according to spokesman Adekunle Ajisebutu.\n“Sylvester Oromoni: autopsy done.\nDespite video evidence and young Oromoni’s admission that he was tortured by his classmates who forced him to join a cult at the school, the school maintained its claim.\nDowen College claimed he died as a result of a leg injury sustained while playing football."
  },
  {
    "headline": "BREAKING: Bandits Attack Kaduna Villages, Kill 20, Raze Houses, Vehicles",
    "summarized_story": "According to Samuel Aruwan, the Kaduna State Commissioner of Internal Security and Home Affairs, several bandits have raided three communities in the state’s Giwa Local Government Area, killing at least 20 people.\nKauran Fawa, Marke, and Riheya were among the communities attacked, according to the commissioner.\nSeveral residences, vehicles, and other goods worth millions of naira were damaged by the hoodlums during the raids, according to Aruwan, who did not specify when the attack occurred.\n“According to the report, bandits attacked Kauran Fawa, Marke and Riheya villages in Idasu, Giwa LGA, leaving more than 20 residents dead as of the time of this update.\n“The Governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief“The identities of the victims will be published once further details are confirmed by the Kaduna State Government."
  },
  {
    "headline": "Pictorial: Actor Adedimeji Lateef Marries Adebimpe Oyebade",
    "summarized_story": "Nigerian actor, Adedimeji Lateef, on Saturday tied the knot with a fellow Nollywood star, Adebimpe Oyebade.\nThe duo took to their respective Instagram pages to share pictures from the wedding.\nSharing a picture of herself and her husband, the actress wrote, “Today I marry my best friend.”The actor also wrote, “The grace of the Almighty is sufficient.\nToday I marry my best friend.”See pictures of the couple below:"
  },
  {
    "headline": "PHOTOS: Yusuf Buhari’s Day Of Honour In Daura",
    "summarized_story": "President Muhammadu Buhari’s son, Yusuf, has been turbaned Talban Daura, making him the District Head of Kwasarawa.\nThe event, which held in the president’s hometown of Daura in Katsina State, had Vice-President Yemi Osinbajo; Senate President Ahmad Lawan; Governor Abdullahi Ganduje of Kano State; Aviation Minister, Senator Hadi Sirika, his Niger Delta and Science and Technology counterparts as well as many other Senators.\nAlso in attendance was the father-in-law of the new Talba, the Emir of Bichi, Alhaji Nasiru Ado Bayero.\nSee photos below:"
  },
  {
    "headline": "‘Yan jarida suna da rawar da za su taka wajen magance ta’addanci a ƙasa – Farfesa Khalid Zaria",
    "summarized_story": ""
  },
  {
    "headline": "Kwararowar makiyaya: Ana zaman ɗarɗar a arewacin Jihar Bauchi",
    "summarized_story": ""
  },
  {
    "headline": "’Yan bindiga ko ’yan ta’adda: Canja matsayinsu zai kawo ƙarshen matsalar tsaro?",
    "summarized_story": ""
  },
  {
    "headline": "Mawaƙi M. Shareef ya zama Ambasadan gidan talabijin na Qausain TV",
    "summarized_story": ""
  },
  {
    "headline": "Buhari Condemns Gruesome Killings In Kaduna",
    "summarized_story": "President Muhammadu Buhari has condemned the renewed killings by gunmen in Kaduna State.\nRead Also: Death Toll In Kaduna Gunmen Attack Rises To 38Bandits within the week had also killed residents in Zangon Kataf, Chikun, Birnin Gwari, Igabi and Kauru local governments of the state.\nHe also extended his condolences to the Government of Kaduna State and the people in the affected local governments.\nSpeaking further, President Buhari affirmed that the security forces have turned the heat on the terrorists who are getting frustrated and are soft-targeting innocent citizens, looting their assets, burning their homes and killing them indiscriminately.\nHe also reiterated his directive to the security and intelligence chiefs to do everything they can to destroy the remaining vestiges of the terrorists."
  },
  {
    "headline": "Death Toll In Kaduna Gunmen Attack Rises To 38",
    "summarized_story": "The death toll from three separate attacks in villages in Giwa Local Government Area of Kaduna State has risen to 38.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, disclosed this on Sunday evening.\nThe three villages involved in the attack are Kauran Fawa, Marke and Riheya.\nAruwan, however, stated that security operatives have been deployed to sustain patrols in the general area.\nGovernor Nasir El-Rufai on his part has expressed sadness over the attack and has directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief to the victims."
  },
  {
    "headline": "Nigeria’s COVID-19 Cases Rise With 828 New Infections",
    "summarized_story": "The latest statistics by the Nigeria Centre for Disease Control (NCDC) have revealed that the number of confirmed COVID-19 cases in Nigeria increased to 223,483 with 828 additional cases confirmed on Saturday.\nRivers State had the highest number of cases with 188 infections confirmed in the state.\nThe Federal Government on Thursday warned Nigerians to take responsibility for their health as COVID-19 cases continued to rise in the country.\nMamora said this as COVID-19 cases continued to increase, with the country recording 5,398 infections between December 6 and 15.\nFind below a tab showing current statistics of confirmed cases according to states…Confirmed Cases by State"
  },
  {
    "headline": "Revenue Generation: Abuja-Kaduna Rail Line Makes N300m A Month – Amaechi",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi, has said that the Abuja-Kaduna train service generates at least three hundred million naira (N300,000,000) for the country every month.\nSpeaking as a guest on Channels Television’s Hard Copy, Amaechi said his ministry is beginning to contribute to the nation’s economic growth.\n“We make N300million per month from the Abuja-Kaduna train,” the minister declared.\nWhen questioned about the cost implications for developments experienced on the rail system, the minister said the country is capable of meeting its loan requirements.\nAccording to Mr Amaechi, work on the Kano-Maradi line and Port Harcourt-Maiduguri rails are expected to commence by the end of January."
  },
  {
    "headline": "COVID-19: Israel To Ban Travel To US",
    "summarized_story": "Bennett said Israel was in the midst of its fifth wave of Covid-19.\nREAD ALSO: Paris Cancels New Year Fireworks Over Omicron FearsSpeaking earlier, Bennett reiterated that he would continue to restrict travel in order to avoid further lockdowns.\nHe said Israel had gained “precious time” by curbing travel immediately after the Omicron variant was detected in South Africa last month.\n“European countries are either in lockdown or are heading that way,” he said, stressing that for Israel “time is running out”.\nIn addition to the US, the health ministry recommended that Canada, Belgium, Italy, Germany, Hungary, Morocco, Portugal, Switzerland and Turkey be red-listed, guidance that is awaiting approval from the government and lawmakers."
  },
  {
    "headline": "PDP calls out APC on alleged connection with killings, demands Buhari visits troubled areas",
    "summarized_story": "The All Progressives Congress (APC), has been fiercely criticised by the Peoples Democratic Party (PDP) for its unforgivable indifference to terrorist assaults in Sokoto, Niger, Katsina, Kaduna, Plateau, and other parts of the country.\n“Is it also not provocative, vexatious and indeed the height of heartlessness that APC and its leaders party while Nigeria burns?\n“The PDP, standing in solidarity with Nigerians, calls out the APC to come clean on its alleged connection to killings, the benefit it derives from violence and bloodletting and why it attaches no value to human lives.\nThe APC has also not explained the continued presence of a self-confessed terrorism apologist in its government.\n“Unfortunately, the APC as a party of selfish and blood thirsty “political bandits” does not have the commitment, readiness or capacity to do so."
  },
  {
    "headline": "Group vows to go to court to ensure Asiwaju Tinubu contest in 2023 -",
    "summarized_story": "A group, known as the Disciples of Jagaban (DOJ), has vowed to drag the National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu to court if he declined contesting for Presidency in the next general elections.\nThe leader of the group, Abdulhakeem Alawuje, noted that the main reason is because the suffering in the country has gotten out of control and the National Leader of the APC, has the capacity and strategy to change the situation.\nHe further explained that the giant strides Bola Ahmed Tinubu made as governor of Lagos State is enough proof that he can stabilize the nation if he becomes president in 2023.\nThe group went on to flagg off a continuous voter registration campaign in Kaduna state to sensitize youths and the general public on the need to get registered to vote.\nThey hope the campaign will also help raise the quality of participation in Politics in Nigeria"
  },
  {
    "headline": "PGF Secretariat greets PGF DG, Salihu Lukman at 59",
    "summarized_story": "The Progressive Governors Forum (PGF) Secretariat has congratulated the Director General of the Progressives Governor Forum, Salihu Lukman, on his 59th birthday.\nThe statement reads partly thus: “We appreciate your leadership style and personal commitment to the ideals of progressivism.\nAs the Director General of PGF Secretariat, we celebrate your doggedness and uncommon contributions to the development of policies across the APC controlled States and Nigeria as a whole.\n“Here in the secretariat, you always put your time and energy to make staff members be at their best.\n“Once again, congratulations and Happy Birthday, Comrade Salihu Lukman,” the statement said."
  },
  {
    "headline": "Buhari postpones official visit to Ogun",
    "summarized_story": "Ogun State Government has announced the postponement of the official visit of President Muhammadu Buhari to the State initially scheduled for Tuesday, 21st December 2021.\nIn a statement issued on Friday in Abeokuta by Tokunbo Talabi, Secretary to Ogun State Government, the government said a new date for the visit and commissioning of some of the landmark projects of Prince Dapo Abiodun Administration will be announced in due course.\nThe Government regrets any inconvenience the postponement might cause the invited guests, the statement concluded."
  },
  {
    "headline": "Nigeria: VAT Revenue Hits N196.175bn as FAAC Shares N675.946bn for November",
    "summarized_story": "“The N675.946 billion total distributable revenue comprised distributable statutory revenue of N488.674 billion; distributable VAT revenue of N182.678 billion, Exchange Gain of N4.156 billion and Excess Bank Charges Recovered of N0.438 billion,” he said.\n“From this, the federal government received N231.863 billion, the state governments received N117.604 billion and the local government councils received N90.668 billion.\n“The sum of N5.650 billion allocation to NEDC and N7.847 billion cost of collection were deducted from the N196.175 billion gross VAT revenue, resulting in the distributable VAT revenue of N182.678 billion,” Ogubike said.\nFrom the N182.678 billion distributable VAT revenue, he revealed that the federal government received N27.402 billion, the state governments received N91.339 billion and the local government councils received N63.937 billion.\nOf the N0.438 billion excess bank charges recovered, the federal government received N0.231billion, the state governments received N0.117billionm, and the local government councils received N0.090 billion."
  },
  {
    "headline": "Turkey’s Erdogan Pledges 15m Covid Vaccine Doses for Africa",
    "summarized_story": "Speaking on Saturday at a major summit of African leaders, President Reycep Tayyip Erdogan said Turkey would send 15 million Covid-19 vaccine doses to Africa, adding that the low vaccination rates there was a blot on humanity.\n“We are aware of the global injustice in accessing the Covid-19 vaccine and Africa’s unjust treatment,” Erdogan said.\n“It is disgraceful for humanity that only six per cent of Africa’s population has been vaccinated.”Turkey is developing its vaccine, known as Turkovac, which is in the process of receiving emergency use approval.\nIt was not immediately clear from his remarks whether Turkey would first send some doses of the internationally approved vaccines it was currently using, including those developed by Pfizer-BioNTech.\n“To contribute to the resolution of this issue, within our means, we plan to share 15 million vaccine doses in the period ahead,” he said."
  },
  {
    "headline": "DMO: Nigeria Didn’t Mortgage National Assets as Collateral for Chinese Loans",
    "summarized_story": "The Debt Management Office (DMO) has clarified that loans from China to Nigeria, which presently stood at $3.59billion were largely concessional as no national asset was tagged as collateral.\n“Nigeria’s total debt stock as at September 30 was $37.9 billion; this figure comprised the external debt stock of the federal government, 36 state governments and the Federal Capital Territory (FCT).\n“But total loans from China stands at $3.59 billion, which is 9.47 per cent of the total external debt.\nThe loans did not require any national asset as collateral; they were largely concessional,’’ she said.\nShe explained that before foreign loans were contracted, very sensitive steps were taken by multiple institutions of government to ensure that they were beneficial to the nation."
  },
  {
    "headline": "Nigeria is Collapsing, Benue Governor Ortom Tells Buhari in Birthday Message",
    "summarized_story": "Governor of Benue State in Nigeria’s North-Central Benue State, Samuel Ortom, on Saturday again drew Buhari’s attention to the fact that Nigeria is collapsing due to the activities of terrorists.\nOrtom said the president is a grandfather who should understand that people are dying daily unnecessarily in the hands of terrorists.\nAccording to the statement, the governor, who said he loves Buhari, urged him to take urgent action to secure the country before he leaves office.\n“I join your family, friends, political associates, and all Nigerians to congratulate you on the occasion of your 79th birthday,” he said.\n“All is not well with Nigeria right now, Mr. President."
  },
  {
    "headline": "Nigeria’s Buhari Rallies International Support against Terrorism",
    "summarized_story": "Nigeria President Muhammadu Buhari has called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\nBenue State Governor, Dr. Samuel Ortom, also on Saturday again drew the attention of Buhari to the fact Nigeria is collapsing due to terrorists’ activities.\nPresident Buhari also expressed delight that the Summit convened by Turkish President, Recep Tayyip Erdogan, has given due consideration to the issue of terrorism, while also focusing on development and infrastructure in Africa.\nBuhari advised that the partnership should also focus on the global challenge of climate change which is impacting Nigeria, Turkey, and indeed the world at large.\nNot only has there been mutual support to respond to the pandemic but also mutual support to build resilience and sustainable development in other sectors."
  }
]