[
  {
    "headline": "BREAKING: Court orders FG to pay Nnamdi Kanu N1bn, recommends political solution",
    "summarized_story": "Kanu had approached the Court demanding N5 billion over the invasion of his father’s house by the military on September 10, 2017.\nThe Court also recommended political solution to the agitation for the restoration of the defunct Biafra Republic championed by IPOB.\nKanu’s lawyer made this known in a tweet, saying, “Mazi Nnamdi Kanu WINS as Abia High Court rules that the Federal Government violated his fundamental rights.\nOrders the Federal government to pay N1b to him and issue a letter of apology to him.\n“Most importantly, the Court recommended political solution to the #Biafran agitation.”Copyright PUNCH."
  },
  {
    "headline": "I suffered pain for 11 years, says comedian Josh2funny after surgery",
    "summarized_story": "Social media comedian and skit maker, Josh Alfred, also known as Josh2funny, has revealed that he suffered pain from an undisclosed illness for 11 years.\nThe comedian revealed this on his Instagram page on Wednesday, as he appreciated God for a successful surgery and for quick recovery.\nThe funnyman also prayed for his fans, stating that if any of them were sick, they would receive their healing.\nLong story short, thank God for a successful surgery and quick recovery.\nAmen.”The comedian had taken to his Instagram story a couple of weeks ago to share pictures of himself at the hospital during the surgery."
  },
  {
    "headline": "Terrorism charge: I'm not guilty, says Nnamdi Kanu",
    "summarized_story": "The leader of the Indigenous People of Biafra, Mazi Nnamdi Kanu, on Wednesday, pleaded not guilty to the fresh amended 15-count charge of treasonable felony filed against him by the Federal Government.\nKanu, who was brought into the courtroom around 10.15am, said he was innocent of all the allegations levelled against him.\nHe also complained from the dock that some counts in the amended charge were similar.\n“We are further asking that the defendant should be discharged and acquitted as there is nothing in this charge.\n“As for the second motion (on the issue of bail), I don’t even want to talk about it, at least not at this stage,” Justice Nyako held."
  },
  {
    "headline": "Reps relist electoral bill, enter executive session",
    "summarized_story": "…most likely to pass bill todayBy Levinus NwabughioguElectoral Act (Amendment) Bill is taking the front burner in the House of Representatives at the plenary today.\nRecall that the Speaker of the House, Femi Gbajabiamila, Tuesday, said the bill would be reintroduced Wednesday.\nTrue to his words, the bill is listed in the Order Paper containing lists of items to be discussed at plenary.\nTitled “Recommital of Electoral Act (Amendment) Bill 2021”, the bill is standing in the name of the Chairman, House Committee on Rules and Business, Hon.\n“The House resolves to commit section 84(2) of the Electoral Act (Amendment) bill, 2021 to the Committee of the Whole for reconsideration in accordance with Order 12, Rule 20 (1-3) of the Standing Order of the House”, the Order Paper stated."
  },
  {
    "headline": "Breaking: Army ordered to pay N1bn, apologize to Nnamdi Kanu for invading his house",
    "summarized_story": "Nnamdi Kanu, IPOB leaderBy Steve OkoAn Umuahia High Court has ordered the Federal Government and the Nigeria Army to pay N1billion to the Leader of the Indigenous People of Biafra Mazi Nnamdi Kanu for invading his house in September 2017.\nThey federal government and the Army were also ordered to apologise to Kanu for the violation of his Fundamental Rights.\nJustice Benson Anya made the order today while delivering judgement on the suit filed by Kanu against the federal government, the Army and others.\nDetails later…"
  },
  {
    "headline": "Kanu refused new clothes, DSS tells court; that’s a lie, Ozekhome fires back",
    "summarized_story": "File image of Nnamdi Kanu when he was first brought to court after his extradition to Nigeria from Kenya.\nHowever, Kanu’s lead counsel, Chief Mike Ozekhome(SAN) told the court that it was not true that his client insisted on wearing his designer’s clothes.\nthe prosecution counsel, Mr Shuaibu Labaran, told the court that Kanu was the one that chose to wear his designer Fendi clothes.\n“As for his appearance, he chose to wear this particular one because he said that it is designers.”Reacting, Ozekhome told the court that it was not true that his client insisted on wearing his designer’s clothes.\n“I want to commend the DSS and the court for ensuring that it was done,” the SAN said."
  },
  {
    "headline": "Breaking: Kanu pleads innocence to fresh terrorism charge, objects to commencement of trial",
    "summarized_story": "….insists on hearing of his preliminary objection challenging competence of chargeABUJA–The detained leader of the Indegenious People of Biafra, IPOB, Nnamdi Kanu, on Wednesday, pleaded not guilty to the fresh amended 15-count treasonable felony charge the Federal Government preferred against him.\nHowever, Kanu’s lead counsel, Chief Mike Ozekhome, SAN, told the court that he had on Tuesday evening, filed a 43-paged Preliminary Objection for the charge to be quashed and struck out without the matter proceeding to trial.\n“We are further asking that the Defendant should be discharged and acquitted as there is nothing in this charge.\n“We also have a motion requesting the court to grant bail to the Defendant”, Ozekhome added.\n“In essence, business of the day cannot be allowed to be truncated by these applications”, he argued."
  },
  {
    "headline": "BREAKING: Despite court order, Nnamdi Kanu returns for trial in same Fendi designers clothes",
    "summarized_story": "Justice Nyako had on Tuesday, ordered the Department of State Services, DSS, to allow Kanu to have a change of cloth.\nAlso, make sure that you allow him to exercise and give him a good mattress”, Justice Nyako had ordered.\nMeanwhile, when the matter was called up on Wednesday, the Prosecution counsel, Mr Shuaibu Labaran, told the court that Kanu was the one that chose to wear his designer Fendi clothes.\nAlso Read:I don’t want to see Kanu in these clothes again, Justice Nyako provokesHe said: “My lord, based on your order yesterday, we provided Defendant with a new Orthopedic mattress, pillows and blankets.\nIn his response, Kanu’s lead counsel, Chief Mike Ozekhome, SAN, told the court that it was not true that his client insisted on wearing his designer’s clothes."
  },
  {
    "headline": "BREAKING: Senate dumps direct mode of primary elections",
    "summarized_story": "The Nigerian Senate on Wednesday dumped the direct mode of primary elections.\nThe Senate’s stand followed an amendment by the conference committee which recommended that “the direct primary mode of election be expunged.”The direct primary has been replaced with three options, including direct, indirect and consensus in clause 85 of the Electoral Act Amendment Bill, 2021.\nDetails shortly…"
  },
  {
    "headline": "President Buhari didn’t reject Electoral Act Amendment Bill – Senator Adetunmbi",
    "summarized_story": "Senator representing Ekiti North Senatorial District, Olubunmi Adetunmbi, said on Wednesday that President Muhammadu Buhari did not reject the Electoral Act as being perceived in various quarters.\nHe said the president understood the collaborative need of the executive and parliament and he requested for the amendment to clauses that deal with ‘direct or indirect’ mode of the party primaries and not a rejection of the bill.\nSenator Adetunmbi’s statement comes after plans to amend the copy of the bill earlier vetoed by the President and which was returned to the National Assembly before lawmakers went on Christmas recess.\nHe warned the Senators not to make laws that put Nigeria’s democracy in jeopardy, insisting that the party primaries is a step down of freedom in favour of political parties.\nHe said: “Most political parties have in their Constitution, the exercise of discretion in the use of direct or indirect and consensus approaches to candidates selection.”"
  },
  {
    "headline": "NCC: Don’t rest on your oars, sustain effective service delivery – Danbatta tasks Ibadan Zonal Office",
    "summarized_story": "The staff of the Ibadan Zonal Office (IBZO) of the Nigerian Communications Commission (NCC) have been tasked by the Executive Vice Chairman of NCC, Prof. Umar Danbatta, to sustain their commitment to regulatory effectiveness in keeping with the Commission’s strategic objectives.\nThe EVC, management and other staff in his entourage, were earlier received on arrival at Ibadan by the Controller, Ibadan Zonal Office of the Commission, Yomi Arowosafe, who led the EVC and his team on a tour of the Zonal Office.\nThe IBZO was established in October 2005 to bring the Commission’s regulatory services closer to the South-West geopolitical zone, except Lagos and Ogun which are in the purview of Lagos ZonalOffice.\nHowever, the jurisdictional sphere of the Ibadan Zonal Office, however includes other South-West states and Kwara State.\nThe recently constructed NCC Zonal Office building at Ibadan became fully functional in 2015 when the Commission’s Management directed staff to commence operational activities from the new complex."
  },
  {
    "headline": "Nigeria would’ve collapsed if not for Buhari’s military background – Ayade",
    "summarized_story": "Governor Ben Ayade of Cross River State has claimed that Nigeria would have collapsed if not for President Muhammadu Buhari’s military background.\nThe governor said, “Perhaps, if it was not Buhari’s administration with his military background, Nigeria would have collapsed at this stage.\nI think the situation could have been worse.”Ayade urged Nigerians to look beyond party lines and put the nation first in whatever they do.\n“Party lines is what has kept this country backwards.\nWe should think like a country; we should think like a nation,” the former Peoples Democratic Party (PDP) member noted."
  },
  {
    "headline": "Kanu to challenge terrorism charges Feb 16",
    "summarized_story": "Justice Binta Nyako of the Federal High Court in Abuja has granted February 16 for the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, to challenge the competence of the terrorism charges against him.\nThe Judge fixed the date after turning down the request of the Federal Government to open the trial.\nKanu is asking the court to discharge and acquit him without standing trial in the heinous crime because the charges are incurably defective and have no force of law.\nHowever, he has been returned to the detention facility of the Department of State Services (DSS) till the issue of his request for bail is resolved.\nDetails later…"
  },
  {
    "headline": "BREAKING: Court orders FG to pay Kanu N1bn",
    "summarized_story": "An Abia State High Court presided over by Hon.\nJustice Benson Anya in Umuahia, the state capital on Wednesday awarded N1bn damage in favour of the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu against the Federal Government.\nKanu, through his lawyer, Aloy Ejimakor had approached the court seeking N5bn damage against the Federal Government over the alleged invasion of his father’s house on September 10, 2017 by the military.\nHe however struck out other reliefs sought by Kanu’s legal team, including his repatriation from Kenya and continued detention by the DSS.\nHe also advised the Federal Government to adopt a political resolution in dealing with issues involving Kanu."
  },
  {
    "headline": "JUST IN: Osinbajo presides over FEC meeting",
    "summarized_story": "Vice President Yemi Osinbajo is currently presiding over the weekly Federal Executive Council (FEC) meeting at the Presidential Villa, Abuja.\nPresident Muhammadu Buhari has headed off to The Gambia to attend the inauguration ceremony of the country’s President, Adama Barrow, who was re-elected for a second five-year term.\nThose attending the FEC meeting in-person include Ministers of Health, Adeleke Mamora; Information and Culture, Lai Mohammed, Science and Technology, Ogbonnaya Onu; FCT, Mohammed Bello; Secretary to the Government of the Federation, Boss Mustapha; Chief of Staff to the President, Prof. Ibrahim Gambari, amongst others.\n- Advertisement -Those attending virtually include Ministers of Interior, Rauf Aregbesola; Communications and Digital Economy; Ali Pantami; Special Duties, George Akume; Sports, Sunday Dare; Police Affairs, Maigari Dingyadi.\nOthers are the Minister of Agriculture, Mines and Steel, State for Science and Technology, State for Mines and Steel."
  },
  {
    "headline": "BREAKING: IPOB’s Kanu pleads not guilty to charges",
    "summarized_story": "Detained leader of the Indigenous People of Biafra (IPOB) Nnamdi Kani has pleaded not guilty to the amended 15-count charge of treasonable felony.\nRead Also:When the charges were read to him on Wednesday during the trial, the IPOB leader pleaded not guilty.\nDetails shortly…"
  },
  {
    "headline": "BREAKING: Kanu spots same attire for trial despite Judge’s order",
    "summarized_story": "“My lord, based on your order yesterday, we provided the defendant with a new orthopedic mattress, pillows and blankets.\nThe prosecution brought into the courtroom bundles of documents and compact disks, indicating its readiness to commence trial today.\nMeanwhile, the security situation in around the court remains the same as it was yesterday.\nArmed SSS and police personnel have taken over security in and around the court’s premises.\nAdjoining streets to the court are deserted as security agents cordoned off the streets, restricting vehicular and human movements."
  },
  {
    "headline": "Why I resigned as PGF DG, by Lukman",
    "summarized_story": "“Some party leaders in the bid to emerge as candidates of the party for offices became hostile.\nViews of party leaders became decisions of the party.\nRead Also: PGF DG resigns over APC national convention controversy“This is expected to produce a new leadership, which should emerge at the party’s National Convention.\nHe said following the news of his resignation, many party leaders and members called to express these worries.\nHe declared his support to all decisions of President Muhammadu Buhari to ensure that APC Convention holds in February 2022,” the ex-PGF DG said."
  },
  {
    "headline": "Prices of Rice, Other Food Items to Crash Soon, Buhari Assures",
    "summarized_story": "The president said: “Today rice production in Nigeria has increased to over 7.5 million metric tons annually.\nPrior to the introduction of APB, the average production in Nigeria between 1999 to 2015 was less than four metric tons annually.\nThe measure will aid our efforts at reducing the price of rice in Nigeria.\n“This has resulted in bridging our rice consumption gap, a significant reduction in rice imports, and saved us foreign exchange,’’ he added.\nPresident Buhari said in May 2021, the CBN unveiled the first rice pyramids in the South-west in Ado Ekiti, Ekiti State."
  },
  {
    "headline": "Feb. 26 APC Convention: All Eyes on These Men",
    "summarized_story": "•We should make it a policy convention, says FayemiAdedayo AkinwaleAfter weeks of apprehension, accentuated by orchestrated uncertainties, the National Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC), yesterday, affirmed February 26 as the date for the party’s national convention, apparently, with the approval of President Muhammadu Buhari.\nOstensibly excited by the news of the convention, Chairman of Nigerian Governors’ Forum (NGF), and governor of Ekiti State, Dr. Kayode Fayemi, said there was a need to make the party’s convention a policy convention.\nIn another development, a group, the APC Rebirth Group, berated the party’s governors for, allegedly, forcing the director-general of Progressive Governors’ Forum (PGF), Dr. Salihu Lukman, to resign.\nKalu suggested that the presidential primary and the convention of the party be conducted the same day.\nI would like to plead with the chairman that we should make this a policy convention."
  },
  {
    "headline": "Can APC Afford an Elective Convention?",
    "summarized_story": "But as is fast turning out, the fragile status of the ruling APC, especially, in the states, would make an elective convention for the party an acid test.\nContenders for APC National Chairman•Who among these men will lead the ruling party?\nWEAKNESS:Al-Makura has running battles with the Economic and Financial Crimes Commission (EFCC) and may make a negative brand for the APC as party national chairman.\nAPC members are wary of the imposition of party officials and Akume’s antecedents in that regard is not pleasant.\nHe appeals to the majority of party members, because of his unique qualities and unifying role in the party."
  },
  {
    "headline": "The Thrills of Buhari’s Visit to Ogun",
    "summarized_story": "By Bolu AdeosunThere are many reasons President Muhammadu Buhari’s visit to Nigeria’s Gateway State on Thursday is a memory to treasure.\nAnd recently when he postponed his visit, the naysayers jubilated to no end, saying that they had aborted the visit with their influence.\nOf course, there are many projects awaiting completion, including the first phase of the Ogun State International Agro Cargo Airport at Ilishan and the Atan-LUSADA-Agbara expressway which leads to Agbara Industrial Estate, the industrial nerve center of Ogun State, Nigeria and indeed, the entire ECOWAS Sub-region.\nHis words: ‘‘It is significant to note that the two road projects being commissioned today are federal roads.\nIt is no surprise that Ogun State now ranks 4th on the scale of Ease-of-Doing-Business in Nigeria."
  },
  {
    "headline": "It’s Official! APC Convention Holds Feb. 26",
    "summarized_story": "The Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) and the Governor of Yobe State, Mai Mala Buni, has confirmed that the national convention of the party will be held on February 26.\nBuni disclosed this Tuesday in Abuja while delivering a speech at the Progressives Women Congress held in Abuja."
  },
  {
    "headline": "EXCLUSIVE: Photos Of Tax Receipts Issued By Boko Haram To Farmers, Herdsmen In Borno Controlled Territories",
    "summarized_story": "Some of the tax receipts issued by the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), to farmers and herdsman in the North-East states have been obtained by SaharaReporters.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the terror group after collection of levies and taxes from them.\nSaharaReporters had in several reports in 2021 reported how the insurgents had been taxing residents of Borno, Adamawa and Yobe State.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "EXCLUSIVE: Photos Of Tax Receipts Issued By Boko Haram To Farmers, Herdsmen In Borno Controlled Territories",
    "summarized_story": "Some of the tax receipts issued by the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), to farmers and herdsman in the North-East states have been obtained by SaharaReporters.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the terror group after collection of levies and taxes from them.\nSaharaReporters had in several reports in 2021 reported how the insurgents had been taxing residents of Borno, Adamawa and Yobe State.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "How Three Governors Colluded With Security Operatives Who Killed Over 1,000 South-East Residents – Report",
    "summarized_story": "According to the group, about 1000 people could also not be accounted for as they had been abducted by the security agents.\nIntersociety disclosed that three governors, Hope Uzodinma, Dave Umahi and Nyesom Wike of Imo, Ebonyi and Rivers states respectively are complicit in the atrocities.\nThe statement read partly, \"The Nigerian security forces deployed in Eastern Nigeria had in fourteen months or between late October 2020 and Dec 2021 killed not less than 1,150 defenseless citizens of Eastern Nigeria.\n\"On the other hand, the widely believed Nigerian State protected herdsmen are responsible for hacking to death in 2021 alone of at least 270 Igbos.\n\"Their death had majorly occurred in Ebonyi, Enugu, Anambra, Imo, Abia and Igbo parts of Delta, Edo (Obiaruku and Igbo-Akiri), Benue and Kogi states.”"
  },
  {
    "headline": "How Three Governors Colluded With Security Operatives Who Killed Over 1,000 South-East Residents – Report",
    "summarized_story": "According to the group, about 1000 people could also not be accounted for as they had been abducted by the security agents.\nIntersociety disclosed that three governors, Hope Uzodinma, Dave Umahi and Nyesom Wike of Imo, Ebonyi and Rivers states respectively are complicit in the atrocities.\nThe statement read partly, \"The Nigerian security forces deployed in Eastern Nigeria had in fourteen months or between late October 2020 and Dec 2021 killed not less than 1,150 defenseless citizens of Eastern Nigeria.\n\"On the other hand, the widely believed Nigerian State protected herdsmen are responsible for hacking to death in 2021 alone of at least 270 Igbos.\n\"Their death had majorly occurred in Ebonyi, Enugu, Anambra, Imo, Abia and Igbo parts of Delta, Edo (Obiaruku and Igbo-Akiri), Benue and Kogi states.”"
  },
  {
    "headline": "Why IPOB Leader, Nnamdi Kanu Appeared In Same Clothes – Secret Police, DSS Tells Court",
    "summarized_story": "The operatives of the Department of State Services (DSS) have said the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, refused to wear another clothes to appear in court.\nNyako had ordered yesterday that the detained IPOB leader should not appear in court today in the same Fendi designers clothes he has been wearing since June last year when he was arrested.\nKanu was on same clothes today, sparking a debate over why her order was flouted.\nWhen the matter was called up, the prosecution counsel, Mr Shuaibu Labaran, told the court that Kanu was the one that chose to wear his designer Fendi clothes.\nHe said, “My lord, based on your order yesterday, we provided the defendant with a new orthopedic mattress, pillows and blankets."
  },
  {
    "headline": "BREAKING: Court orders FG to pay Nnamdi Kanu N1bn over rights violation",
    "summarized_story": "A high court in Umuahia, Abia state, has ordered the federal government to pay N1 billion to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), for violating his rights.\nAdvertisementHe also sought damages for the invasion of his father’s house on September 10, 2017, by the military.\nThe judge also ordered the federal government to issue a public apology to Kanu in three national dailies.\nAdvertisementHe also advised the federal government to adopt a political resolution in dealing with issues involving Kanu.\nHowever, the judge struck out other reliefs sought by Kanu’s legal team, including his repatriation from Kenya and continued detention by the DSS."
  },
  {
    "headline": "BREAKING: Court orders FG to pay Nnamdi Kanu N1bn over rights violation",
    "summarized_story": "A high court in Umuahia, Abia state, has ordered the federal government to pay N1 billion to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), for violating his rights.\nAdvertisementHe also sought damages for the invasion of his father’s house on September 10, 2017, by the military.\nThe judge also ordered the federal government to issue a public apology to Kanu in three national dailies.\nAdvertisementHe also advised the federal government to adopt a political resolution in dealing with issues involving Kanu.\nHowever, the judge struck out other reliefs sought by Kanu’s legal team, including his repatriation from Kenya and continued detention by the DSS."
  },
  {
    "headline": "Lagos 'completes purchase' of two Talgo trains originally designed for US city",
    "summarized_story": "AdvertisementThe Blue Line is designed to start from Okokomaiko and terminate at Marina, while the Red Line runs from Agbado to Marina.\n“The Red Line, a 37 km track with 11 stations, will be the first operational metro system in West Africa,” according to a statement.\n“Construction of the Red Line was originally approved in 2008; However, the project was delayed by a previous administration.\nIn light of this, Sanwo-Olu has committed to bringing the Red Line project to fruition during his administration.\nAdvertisement“Upon completion of the second phase, the Red Line will serve Lagos’ Murtala Muhammed International Airport."
  },
  {
    "headline": "Lagos 'completes purchase' of two Talgo trains originally designed for US city",
    "summarized_story": "AdvertisementThe Blue Line is designed to start from Okokomaiko and terminate at Marina, while the Red Line runs from Agbado to Marina.\n“The Red Line, a 37 km track with 11 stations, will be the first operational metro system in West Africa,” according to a statement.\n“Construction of the Red Line was originally approved in 2008; However, the project was delayed by a previous administration.\nIn light of this, Sanwo-Olu has committed to bringing the Red Line project to fruition during his administration.\nAdvertisement“Upon completion of the second phase, the Red Line will serve Lagos’ Murtala Muhammed International Airport."
  },
  {
    "headline": "Nnamdi Kanu pleads not guilty to treasonable felony charges",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has been re-arraigned on a 15-count charge of treasonable felony.\nWhen the charges were read to him on Wednesday, the IPOB leader pleaded not guilty.\nIn the amended charge, the federal government accused Kanu of attempting to use his broadcasts to “destabilise the fundamental political and economic structures of Nigeria”.\nHowever, Mike Ozekhome, Kanu’s lead counsel, informed the court that he filed a 43-paged preliminary objection opposing the charges.\n“As for the second motion (on the issue of bail), I don’t even want to talk about it, at least not at this stage,” Nyako held."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build Spotlight: Tramango is helping Africans explore the world",
    "summarized_story": "Today on Techpoint Build Spotlight, we’re catching up with Akinnuga Ayobami, COO of Tramango, one of Africa’s innovators in the travel space and the official travel partner for Techpoint Build 2021.\nTechpoint Build is helping African entrepreneurs showcase their ideas to the world and funding opportunities through Pitchstorm, the startup competition.\nAdvertisementWhat impact do you envisage following Techpoint Build conversations on the next frontier?\nGrab your ticket (physical or online) for Techpoint Build now.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain is hard, but Crevatal wants to make it easy",
    "summarized_story": "Share this article:The complexities that come with using blockchain or crypto platforms is one of the many reasons most people tend to stay away from it.\nOluchi Enebeli and Clement Hugbo, Co-founders of Crevatal, are combining years of experience in the blockchain space to simplify blockchain and foster mainstream adoption.\nThis, however, isn’t a problem for Crevatal as it doesn’t actively recruit ready-made blockchain talents.\nSide note: Web2 talents are tech talents that build Internet-based products for the current Internet iteration.\nCrevatal websiteInterestingly, the absence of Web3 and blockchain talents isn’t the only reason Crevatal has chosen to train its own talents."
  },
  {
    "headline": "Orda’s pre-seed, Affordable Internet for Africans, Finclusion Group’s pre-Series A",
    "summarized_story": "Orda plans to expand to other African countries and become the leading platform for cloud-based restaurant management in the country.\nToo many Africans still can’t afford an Internet connection due to the high cost of data services on the continent.\nPoa Internet provides low-cost Internet services to individuals and businesses in Kenya, starting with low and middle-income neighbourhoods.\nAdvertisementUnlike their competitors, who put a cap on data volume, the startup offers unlimited data connectivity to its customers.\nHowever, their ability to offer similar services to competitors at half the price may suggest there is still room for more affordable Internet."
  },
  {
    "headline": "Oil racing to $90 a barrel after explosion at crucial Iraqi pipeline",
    "summarized_story": "Oil is racing towards ninety dollars a barrel after extending gains in Asia Wednesday from the highest close since 2014 following an explosion at a key pipeline running from Iraq to Turkey.\nBrent, the internationally traded benchmark crude is at $88.69 after the disruption to the Iraqi oil movement took out crucial supply from an already tight market.\nFutures in New York rallied above $87 a barrel in early trading before paring some gains and is now trading at $86.68.\nThe fire has been brought under control but the cause of the blast remains unknown, pipeline operator Botas said.\nThe global oil market has tightened in recent weeks due to outages in OPEC+ producers including Libya, with buyers in Asia paying sharply higher premiums for spot cargoes."
  },
  {
    "headline": "10 years after protest, over $60bn on subsidy, no change",
    "summarized_story": "Ten years after the #OccupyNigeria protest against petrol subsidy removal, the Nigerian government has only abolished it on paper.\nLast year alone, Nigeria spent $4.5 billion on petrol subsidy, according to the World Bank, and during the subsidy scandal in 2011, Nigeria spent $6.8 billion on subsidy.\nRather than eliminate the subsidy, the government succeeded in increasing the petrol price from N65 to N141 per litre.\nLogic failsAs was true in 2012, petrol subsidy was a drain on the country.\nRead also: Group plans protest against petrol subsidy removal, excise duty on soft drinksNigeria with highly-rated security agencies cannot curtail smuggling, and though petrol is imported, government charges at the port add to the cost per litre."
  },
  {
    "headline": "China, India freight cost declines as container scarcity abates",
    "summarized_story": "Currently, moving a 20-foot and 40-foot container from India to Nigeria now costs between $4,000 and $7,000, down from between $7,500 and $15,000 previously charged by shipping companies in September 2021.\nFrom China, moving a 20-foot and 40-foot container to Nigeria now costs between $7,000 and $11,000 instead of $8,000 and $16,000 that were charged in September 2021, when the cost of freight was at a record high.\nConfirming this, Tony Anakebe, managing director of Gold-Link Investment Limited, states that importers are beginning to see a reduction in the cost of freight from countries like India and China to Nigeria.\nAccording to Anakebe, moving 20-foot and 40-foot containers from India to Nigeria that used to cost between $7,500 and $15,000 now costs a little above $4,000 and $7,000, respectively.\nIt states that the current freight cost in China can be attributed to the COVID-19 variant, the changing purchasing patterns, the Chinese New Year that is around the corner, and the restocking of supplies that followed due to the rising number of COVID-19 cases in China."
  },
  {
    "headline": "Group Slams Buhari over failed promises, vows to resist anti people policies – Nigerian Observer",
    "summarized_story": "Dr. Obayuwana regretted that while Nigerians were buying imported petroleum products at cutthroat prices, “Buhari as the president and minister of petroleum has allowed his few local and international friends to profit maximally from what our country is blessed with”.\nAccording to him ” we the Nigerian people protested against this in 2012.\nBuhari asked for our votes in 2014, and made all kinds of promises which he has refused to keep.\nWe cannot and must not allow this to continue at the expense of our lives and those of our children, our today and our tomorrow”.\n“We must fight for our right and reject this proposed increase in the hardship we already face” they charged."
  },
  {
    "headline": "Senate sets agenda for 2022 legislative activities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…promises to expidite action on Passage of Electoral Bill, 2021.\nThe Nigerian Senate resumed plenary 18th January, as it sets agenda for the 2022 legislative agenda which include expediting action on the passage of the Electoral Bill, 2021 after a three weeks Christmas recess.\n“Like we all know, the Senate and indeed the National Assembly worked so hard on the Bill.\nOn the issue of the security challenges facing the country, the Senate President said the Security situation in the country is still dire.\nWe have to construct and provide infrastructure, in all parts of our country because infrastructure is needed for our nation to develop”."
  },
  {
    "headline": "Edo keen on exploiting mining, oil, gas resources – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state government is determined to exploit its mining, oil and gas assets to boost economic growth.\nNoting that there was a need to expand the state’s economic base, Obaseki said the state is focused on exploring the opportunities in mining, oil and gas sectors.\nAccording to him, “We have done a lot in the oil palm sector with the Edo Oil Palm Programme (ESOPP), but we know there is a lot to be done in the mining, oil and gas sectors.\nWe want to participate in that sector as well.”“On mining, Edo State has the third largest number of licences for mining, only behind Kaduna and Nasarawa.\nWe need to know how many of the licences available in the state are not being exploited,” he noted."
  },
  {
    "headline": "Obaseki rallies Edo entertainers, to grow economy, create more jobs with creative hub – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge when he led Edo entertainers, including Osaronkhae Lawrence (MC Casino) and Gbadamasi Jonathan (Edo Pikin), among others on a guided tour of the hub in Benin City.\nOsaigbovo Iyoha, reassured that his government will sustain projects and programmes to enhance the growth of the state’s entertainment industry, ensuring that Edo youths realise their fullest potentials.\nAccording to him, “We have brought our own in the entertainment industry to inspect this hub as they have made an impact in the industry.\nOn his part, Head, Edo Creative Hub, Charles Nzeribe said, “This hub, when in proper use, will generate more jobs for Edo people.\nThe governor has brought the dreams of entertainers to reality with the building of this entertainment hub."
  },
  {
    "headline": "Court declares Kanu’s arrest illegal, orders federal government to pay him N1bn",
    "summarized_story": "An Abia State High Court on Wednesday ruled that the invasion by security agents of residence of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, in 2017 was unlawful and an infringement on his human rights.\nThe presiding judge, Justice Benson Anya who delivered the judgment, also decided that his abduction and forceful return to Nigeria was “illegal” under local and international laws.\nJustice Anya ruled that the Nigerian government should pay Kanu a sum of N1billion as a compensation for the violation of his fundamental human rights.\nRecall that Kanu’s Special Counsel, Aloy Ejimakor filed the lawsuit against the Nigerian government on August 27, 2021 before the Abia court.\nThe judge had rejected the challenge by the Nigerian government on the jurisdiction to hear Kanu’s case."
  },
  {
    "headline": "Sanwo-Olu acquires two trains from U.S. for Lagos metro line",
    "summarized_story": "Lagos State governor, Mr. Babajide Sanwo-Olu has secured two unused high-speed rail trains from Wisconsin in the United States for the state’s metro line train system.\nThe trains which were originally meant to connect railroads between Madison and Milwaukee, United States, were purchased on Tuesday when Mr Sanwo-Olu visited Milwaukee.\nThe new trains are to be used for the Lagos metro line in December.\nSanwo-Olu in a statement said the Talgo’s Series 8 trains are for Lagos’ red line system.\nThe Lagos blue line project was inaugurated in 2003 under the Bola Tinubu administration and has seen multiple delays."
  },
  {
    "headline": "Parallex Bank transits from MFB to commercial bank",
    "summarized_story": "Parallex Bank Limited has transitioned from a microfinance bank to commercial banking, becoming the latest entrant into the competitive commercial banking industry in Nigeria.\nThe bank’s chairman, Adeola Phillips, in her introduction, said the bank is delving into the commercial banking space to drive consumer-centric innovation that will propel the banking industry to greater heights.\nThis will undoubtedly position us further to meet the needs of modern banking customers,” she said.\n“Parallex Bank Limited will disrupt the market and delight customers with very attractive offers.\nHe also said the vision of Parallex Bank is to be the preferred financial solution provider redefining customer experience through innovation."
  },
  {
    "headline": "Gunmen attack APC meeting in Enugu, kill two chieftains, abduct one",
    "summarized_story": "Two chieftains of the All Progressives Congress (APC) in Enugu State were on Tuesday evening murdered by gunmen who invaded the party’s meeting in Enugu South LGA.\nThe deceased and others were having a reconciliation meeting at the party office at Ward III Obeagu Awkunanaw, Enugu South when the gunmen attacked.\nThe attackers who were about seven in number also abducted another chieftain of the party while others sustained bullet wounds.\n“The meeting was underway when these men invaded the place and shot and killed the immediate past Enugu South local government chairman of the party,” a source at the meeting said.\n“Ezeoha was also elected as the incumbent state youth leader in one of the factions of the party."
  },
  {
    "headline": "2023 Presidency: Group Dumps Atiku For Saraki",
    "summarized_story": "Atiku Ambassadors, a defunct pro-Atiku Abubakar support group, has pledged its total support for former Senate President, Dr. Bukola Saraki, in the 2023 presidential race.\nLeader of the group, Mufra Jibrin, disclosed this on Tuesday when he led a delegation to the national coordinator of ‘Saraki Is Coming Door To Door’ organisation, Umar Faringado Kazaure, at his residence in Abuja.\nJibrin, a Kafanchan-born businessman, said his former group has now merged with ‘Saraki Is Coming Door To Door’ organisation for the realisation of Dr. Saraki’s presidential ambition in 2023.\nIt’s now the turn of a much younger, energetic and experienced candidate in the person of Saraki, to become Nigeria’s next president in 2023.\nResponding, Faringado welcomed members of the defunct Atiku Ambassadors to the Saraki support group, saying like-minds particularly young Nigerians like them were critical to salvaging the country from its current challenges."
  },
  {
    "headline": "Declare Full Scale War Against Terrorists, Senate Tells Federal Govt",
    "summarized_story": "The Senate has called on the Federal Government to, as a matter of urgency, declare full fledged war against elements involved in terrorist activities in the country.\nAccording to the Senate, doing so would also safeguard the Shiroro Hydro-electric Power Dam, a National Asset located within the area.\nADVERTISEMENTThe motion was sponsored by Senator Mohammed Sani Musa (Niger East) and co-sponsored by Senator Sadiq Suleiman Umar (Kwara North).\nAccording to the lawmaker, on Friday 14th January, 2022, five vigilante members were killed in an attack on a local market and some communities in Shiroro Local Government Area of Niger State.\nThe chamber urged the National Emergency Management Agency (NEMA) to provide relief materials and medical team to the victims immediately."
  },
  {
    "headline": "Visa Brings Digital Payments To AFCON 2021 In Cameroon",
    "summarized_story": "Visa, the exclusive digital payment service provider of the TotalEnergies Africa Cup of Nations (AFCON) 2021, is marking this year’s competition in Cameroon by creating new one-of-a-kind experiences for cardholders and football fans and looking to further help expand access to the financial system in Africa.\n“Visa is committed to enhancing the fan experience at sporting venues around the world and AFCON is no exception,” said Kemi Okusanya, Vice President, Visa West Africa.\nWe are thrilled to offer Nigerians a unique opportunity to enjoy all the excitement of AFCON, and to be the exclusive payments provider at this exciting tournament,” Okusanya further stated.\nVisa began its partnership with the Confédération Africaine de Football (CAF) in 2018 to provide support for the AFCON tournament in 2019 and 2021.\nVisa is the exclusive digital payment provider at all venues during the football tournament and the preferred payment option for tickets bought both in-person and online."
  },
  {
    "headline": "Visa Brings Digital Payments To AFCON 2021 In Cameroon",
    "summarized_story": "Visa, the exclusive digital payment service provider of the TotalEnergies Africa Cup of Nations (AFCON) 2021, is marking this year’s competition in Cameroon by creating new one-of-a-kind experiences for cardholders and football fans and looking to further help expand access to the financial system in Africa.\n“Visa is committed to enhancing the fan experience at sporting venues around the world and AFCON is no exception,” said Kemi Okusanya, Vice President, Visa West Africa.\nWe are thrilled to offer Nigerians a unique opportunity to enjoy all the excitement of AFCON, and to be the exclusive payments provider at this exciting tournament,” Okusanya further stated.\nVisa began its partnership with the Confédération Africaine de Football (CAF) in 2018 to provide support for the AFCON tournament in 2019 and 2021.\nVisa is the exclusive digital payment provider at all venues during the football tournament and the preferred payment option for tickets bought both in-person and online."
  },
  {
    "headline": "Why Many Political Elites Want Buhari’s Tenure To End – Presidency",
    "summarized_story": "The presidency has explained reasons why so many political elites want President Muhammadu Buhari’s second term in office to end.\nPresidential spokesman, Garba Shehu, in a statement on Tuesday, said the elites yearn for a return to the “good old days” of helping themselves to public funds with abandon.\nAccording to him, the last thing they want is another person in the mould of President Buhari.\nHe said, “So many in the political elites of this country cannot wait for the President’s second term in office to end.\nInstead, they have witnessed how, when the state owes to them nothing, it provides for the people,” he added."
  },
  {
    "headline": "Wizkid, Fireboy, Tiwa Savage, Omah Lay bag 2022 NAACP award nominations",
    "summarized_story": "Nigerian music stars, Wizkid, Fireboy, Tiwa Savage, Omah Lay and Ghanaian singer Kidi, were on Tuesday night nominated for the NAACP Image Awards in the Outstanding International Song category, organised by the National Association for Advancement of Coloured People.\nTiwa Savage’s “Somebody’s Son”, featuring Brandy, gained her nomination, while Kidi and Omah Lay received nominations for their song, “Touch it”, and “Understand” respectively.\nThe 53rd NAACP Image Awards celebrate outstanding achievements and performances of people of colour across more than 80 competitive categories from film, television; plus streaming, music, literature, and podcasts.\nThe 2022 NAACP Image Awards were announced Tuesday in a virtual event on NAACP’s Instagram channel, hosted by actress Kyla Pratt, Black-ish actor, Marcus Scribner, and singer Tinashe.\nNetflix leads nominations across motion picture and television plus streaming categories while “Insecure” received the most nominations in the television plus streaming categories."
  },
  {
    "headline": "Wizkid, Fireboy, Tiwa Savage, Omah Lay bag 2022 NAACP award nominations",
    "summarized_story": "Nigerian music stars, Wizkid, Fireboy, Tiwa Savage, Omah Lay and Ghanaian singer Kidi, were on Tuesday night nominated for the NAACP Image Awards in the Outstanding International Song category, organised by the National Association for Advancement of Coloured People.\nTiwa Savage’s “Somebody’s Son”, featuring Brandy, gained her nomination, while Kidi and Omah Lay received nominations for their song, “Touch it”, and “Understand” respectively.\nThe 53rd NAACP Image Awards celebrate outstanding achievements and performances of people of colour across more than 80 competitive categories from film, television; plus streaming, music, literature, and podcasts.\nThe 2022 NAACP Image Awards were announced Tuesday in a virtual event on NAACP’s Instagram channel, hosted by actress Kyla Pratt, Black-ish actor, Marcus Scribner, and singer Tinashe.\nNetflix leads nominations across motion picture and television plus streaming categories while “Insecure” received the most nominations in the television plus streaming categories."
  },
  {
    "headline": "Anyaoku at 89: Peter Obi hails his fatherly role in Anambra",
    "summarized_story": "Peter Obi of Anambra, has felicitated with the former Commonwealth Secretary-General, Chief Emeka Anyaoku, as he clocks 89.\nObi also hailed the elder statesman for his great fatherly role in Anambra and his think-home philosophy.\nObi described Anyaoku as an exemplary ambassador of Nigeria and Anambra, on the global stage.\nHe said that Anyaoku has continued to contribute to the peace and development of Nigeria, and indeed Anambra, his home state.\n“Also as the then Chairman of South Eastern Governors, I co-hosted the 80th birthday celebration of Chief Anyaoku at Obosi."
  },
  {
    "headline": "Anyaoku at 89: Peter Obi hails his fatherly role in Anambra",
    "summarized_story": "Peter Obi of Anambra, has felicitated with the former Commonwealth Secretary-General, Chief Emeka Anyaoku, as he clocks 89.\nObi also hailed the elder statesman for his great fatherly role in Anambra and his think-home philosophy.\nObi described Anyaoku as an exemplary ambassador of Nigeria and Anambra, on the global stage.\nHe said that Anyaoku has continued to contribute to the peace and development of Nigeria, and indeed Anambra, his home state.\n“Also as the then Chairman of South Eastern Governors, I co-hosted the 80th birthday celebration of Chief Anyaoku at Obosi."
  },
  {
    "headline": "BREAKING: Court Declares Nnamdi Kanu’s Arrest As Illegal, Orders Nigerian Government To Pay Him N1billion",
    "summarized_story": "On Wednesday, the judge determined that his kidnapping and forced return to Nigeria were “illegal” under both local and international law.\nAnya further ordered the Nigerian government to compensate Kanu for the infringement of his fundamental human rights with an amount of N1 billion.\nOn August 27, 2021, Kanu’s Special Counsel, Aloy Ejimakor, filed a complaint against the Nigerian government in the Abia court.\nAccording to previous reports, the judge dismissed the Nigerian government’s objection to Kanu’s case’s jurisdiction.\nHe went on to say that the Nigerian government worked with Kenya to kidnap him and return him to Nigeria."
  },
  {
    "headline": "[BREAKING] Nnamdi Kanu: Police Disperse Sowore, Others With ‘Tear Gas’, Bullets At Abuja Court",
    "summarized_story": "Operatives of the Nigerian Police Force have dispersed a former presidential aspirant and activist Omoyele Sowore and other individuals who were present at the Federal High Court to monitor the arraignment of the leader of the proscribed group, the Indigenous People of Biafra, Nnamdi Kanu, The PUNCH has observed.\nThe PUNCH reports that Sowore who arrived at the Federal High Court in Abuja on Wednesday morning was barred from accessing the court premises and was attacked by some hoodlums.\nAfter which the Security operatives began to fire live ammunition into the air creating an environment of fear and disarray.\nThe PUNCH reports that Sowore, an activist had on October 21, 2021, visited the Federal High Court to witness the ongoing trial of Kanu.\nSowore who was also attacked then blamed the operatives of the Department of State Services for the attack on him."
  },
  {
    "headline": "2023: We’ll Pay Your Children’s WAEC Fees – Tinubu",
    "summarized_story": "If elected president in 2023, Asiwaju Bola Tinubu, the National Leader of the All Progressives Congress (APC), has offered to pay Nigerians’ West African Examination Council (WAEC) tuition.\n“Your children’s West African examination fees is paid by us so that no one no matter how poor is left behind,” he said.\n”Highlighting the problem of banditry, Tinubu noted that the country needs peace and stability in order to move forward.\n“Without peace and stability we can’t build a nation as rapidly as we want,” Tinubu said.\nSee video belowIf elected as President, your children’s west African examination fee is paid by us – Bola Tinubu pic.twitter.com/fbVSBfYlCy — GistReel.Com (@GistReel) January 19, 2022"
  },
  {
    "headline": "JUST IN: Nnamdi Kanu Pleads Innocence To Fresh Terrorism Charge, Objects To Commencement Of Trial",
    "summarized_story": "JUST IN: Nnamdi Kanu Pleads Innocence To Fresh Terrorism Charge, Objects To Commencement Of TrialNnamdi Kanu, the jailed leader of the Indigenous People of Biafra, IPOB, pleaded not guilty on Wednesday to the Federal Government’s newly modified 15-count treasonable felony allegation.\n“We are further asking that the Defendant should be discharged and acquitted as there is nothing in this charge.\n“We also have a motion requesting the court to grant bail to the Defendant”, Ozekhome added.\n“In essence, business of the day cannot be allowed to be truncated by these applications”, he argued.\n“As for the second motion (on the issue of bail), I don’t even want to talk about it, at least not at this stage”, Justice Nyako held."
  },
  {
    "headline": "VIDEO: Despite Judge’s order, Nnamdi Kanu still wears same clothes",
    "summarized_story": "About 24 hours after Justice Binta Nyako gave order for the detained Leader of the Indigenous People of Biafra(IPOB) Nnamdi Kanu to be allowed to change clothes, he was spotted wearing same apparel at the resumed trial on Wednesday.\nJustice Nyako had during the resumption of trial on Tuesday gave the order after complaints by the accused’s lead counsel Chief Mike Ozekhome that he was being kept in solitary confinement.\nKanu has been spotting the same Fendi designers clothes since he was arrested in June, 2021."
  },
  {
    "headline": "VIDEO: Watch as IPOB leader, Nnamdi Kanu, kisses new baby",
    "summarized_story": "NextVIDEO: Despite Judge’s order, Nnamdi Kanu still wears same clothes"
  },
  {
    "headline": "Breaking: Again, court adjourns Nnamdi Kanu’s trial as IPOB leader pleads not guilty over treason felony charges",
    "summarized_story": "The trial of leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, over terrorism charges has been adjourned to February 16, 2022.\nInside the court room, Kanu pleaded not guilty to the amended treasonable felony charges.\nDetails loading…"
  },
  {
    "headline": "BREAKING: Senate Makes U-Turn On Direct Primaries",
    "summarized_story": "The Nigerian Senate on Wednesday rescinded its earlier decision on making direct primaries the only method of electing candidates by political parties.\nThe House has now amended Clause 84 to allow for direct, indirect, and consensus options of nominating party candidates for party elections.\nThe direct primary clause had earlier hindered the assent to the bill, however, President Muhammadu Buhari in an exclusive interview with Channels Television, earlier this year, said that he was willing to sign if only the legislators will effect changes which must include the addition of consensus candidates and indirect primary options to the mode of selecting a candidate for an election.\nMore to follow…"
  },
  {
    "headline": "Alleged Treasonable Felony: Nnamdi Kanu Pleads Not Guilty, Court Adjourns Till Feb",
    "summarized_story": "﻿Leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, has pleaded not guilty to the 15 charges bordering on treasonable felony and terrorism, preferred against him by the Federal Government.\nHe pleaded not guilty before Justice Binta Nyako when the case resumed at the Federal High Court in Abuja on Wednesday.\nJustice Nyako had on Tuesday, ordered the Department of State Services (DSS), to allow Kanu to have a change of clothes.\nHe added that the DSS has provided Kanu with a new Orthopedic mattress, pillows, and blankets.\nBefore allowing Kanu to be re-arraigned on the amended 15-count treasonable felony charges, Justice Nyako reiterated her demand for the defendant to have a change of clothes."
  },
  {
    "headline": "Insecurity: Nigeria Would Have Collapsed If Not For Buhari, Says Ayade",
    "summarized_story": "Governor Ben Ayade of Cross Rivers State has lauded President Muhammadu Buhari’s efforts at addressing insecurity in Nigeria, saying the country would have collapsed if not for his drive.\nWe have 42 billion tonnes of bitumen deposit in Nigeria, making us the third after Canada and Venezuela.\nNigerians, he said, should look beyond party lines and put the nation first in whatever they do.\n“I will not want to speak on party lines because party lines is what has kept this country backward.\n“There is nothing wrong with a PDP government; the PDP people making inputs to bring value.”"
  },
  {
    "headline": "Niger Communities Still Paying Levies To Bandits, Governor Bello Laments",
    "summarized_story": "﻿Residents of some communities in Niger have continued to pay levies to terrorists in exchange for protection against attacks on their settlements, authorities in the state have said.\nREAD ALSO: Yellow Buses, Cabs, Others To Pay N800 Levy From February – Lagos Govt“We still have some communities where ransoms are being collected,” the governor said.\n“We will try to discourage them (residents) from paying such ransoms because even when they pay ransoms, it doesn’t stop bandits from attacking them again.\nGovernor Bello also urged states sharing borders with Niger, including Kebbi and Kaduna to collaborate with his administration to ensure sustainability in the fight against criminals in their domains.\nIn the last few days, there have been a lot of activities in Niger State and hopefully, in the next few weeks, we will see some relief with regard to banditry.”"
  },
  {
    "headline": "Alleged N29bn Fraud: Nyako, Son Lose Bid To Stop Charges At Appeal Court",
    "summarized_story": "Former Adamawa State Governor, Vice Admiral Muritala Nyako and his son, Abdulaziz Nyako have lost their bid to stop the N29billion money laundering charges brought against them by the Federal Government.\nIn a unanimous judgment of a 3-man panel of Justices of the Court of Appeal, the former Adamawa Governor and his son were ordered to go and defend themselves in the N29billion fraud against them.\nThe appellate court said the appeal of the former governor and his son were devoid of merit, liable for dismissal and were consequently dismissed.\nThe court ordered them to return to the Federal High court in Abuja and prove their innocence in the 37 counts criminal charges against them.\nThe EFCC had instituted 37-count criminal charges against Nyako and his son at the federal high court in Abuja bothering on alleged fraud that ran into N29billion."
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition."
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "Wrong version of Electoral Act Amendment bill sent to President Buhari",
    "summarized_story": "The House of Representatives will re-introduce the Electoral Act Amendment Bill at Wednesday plenary.\nSpeaker of the House, Femi Gbajabiamila, made this known as he welcomed his colleagues to 2022 legislative business.\nThe Speaker also expressed concerns about the errors purported to be in the Bill sent to Mr. President for assent, insisting a different version might have been transmitted.\nHe assured Nigerians the Constitution Amendment Bill would be ready for the concurrence of the States Houses of Assembly before end of February."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "CBN Spends 1 Trillion Naira On Farmers",
    "summarized_story": "Nigeria will soon commence the export of rice.\nThis was announced at the unveiling of the largest rice pyramids in Nigeria’s history.\nArise Correspondent Amaka Udeh, tells us more."
  },
  {
    "headline": "UK PM Johnson Faces Plot to Trigger Leadership Challenge",
    "summarized_story": "Propelled into the top job to “get Brexit done”, Johnson in 2019 won his party’s biggest majority in more than 30 years but now faces calls to resign after a series of revelations about gatherings in Downing Street during COVID lockdowns.\nTo trigger a leadership challenge, 54 of the 360 Conservative MPs in parliament must write letters of no confidence to the chairman of the party’s 1922 Committee.\nAs many as 20 Conservative lawmakers who won their seats at the last general election in 2019 plan to submit letters of no confidence in Johnson, the Telegraph reported.\n“Group of 2019 MPs to submit letters to try to hit threshold of 54 to trigger a contest,” BBC Political Editor Laura Kuenssberg said.\n“They might hit 54.”An analysis by The Times newspaper showed that 58 Conservative lawmakers had criticised the prime minister."
  },
  {
    "headline": "Airlines Worldwide Rush to Change Flights Over US 5G Dispute",
    "summarized_story": "Airlines across the world, including the long-haul carrier Emirates, rushed Wednesday to cancel or change flights heading into the U.S. over an ongoing dispute about the rollout of 5G mobile phone technology near American airports.\nTwo Japanese airlines directly named the aircraft as being particularly affected by the 5G signals as they announced cancellations and changes to their schedules.\nBut in the U.S., the Federal Aviation Administration worries that the C-Band strand of 5G could interfere with aviation equipment.\nOf particular concern in the 5G rollout appears to be the Boeing 777, a major workhorse for Emirates.\nAir India also announced on Twitter it would cancel flights to Chicago, Newark, New York and San Francisco “due to deployment of the 5G communications” equipment."
  },
  {
    "headline": "New York AG Says Trump’s Company Misled Banks, Tax Officials",
    "summarized_story": "The New York attorney general’s office late Tuesday told a court its investigators had uncovered evidence that former President Donald Trump’s company used “fraudulent or misleading” asset valuations to get loans and tax benefits.\nThe Trump Organization, it said, had overstated the value of land donations made in New York and California on paperwork submitted to the IRS to justify several million dollars in tax deductions.\nOne judge has previously sided with James on an earlier request to question another Trump son, Trump Organization executive Eric Trump, who ultimately sat for a deposition but declined to answer some questions.\nLast year, the Manhattan district attorney brought tax fraud charges against the Trump Organization and Weisselberg, its longtime chief financial officer.\nWeisselberg pleaded not guilty to charges alleging he and the company evaded taxes on lucrative fringe benefits paid to executives."
  },
  {
    "headline": "OPEC: Nigeria’s Production Underperformance Hit 2.4m Barrels in December",
    "summarized_story": "With a daily underperformance figure of 78,000 barrels per day in December, Nigeria lost as much as 2.418 million barrels of crude in the last month of 2021, data released by the Organisation of Petroleum Exporting Countries (OPEC) showed on Tuesday.\nHowever, Brent oil, Nigeria’s benchmark, rose further yesterday to close at $88 a barrel, having earlier hit $88.13, the highest since October 2014.\nThe month of December, according to the OPEC report, also saw Nigeria slump lower than other previous production performances, compared to for instance, October, in which 1.228 barrels were pumped per day, and November during which 1.275 million barrels were produced per day.\nPromises by the Minister of State, Mr. Timipre Sylva and the NNPC Group Managing Director, Mallam Mele Kyari, that the country would hit between 1.7 million barrels per day and 1.8 million barrels per day by the end of 2021 remained largely unrealised.\nThe report showed OPEC output in December rose by 170,000 bpd to 27.88 million bpd, undershooting the rise OPEC was expecting."
  }
]