[
  {
    "headline": "IPOB alleges house-to-house abduction, killing of South-East youths",
    "summarized_story": "The Indigenous People of Biafra has accused security operatives of house-to-house abduction and killing of youths in the South-East.\nWhile denying any involvement in the killing of 128 security personnel in Imo State as alleged, the secessionist group said neither IPOB nor its security outfit, Eastern Security Network, had been involved in any attack on security personnel in Imo or any part of the country.\nHow could IPOB that is not armed be able to kill as many as 128 security personnel in one state?\n“We therefore wish to declare for the records that IPOB did not kill any security personnel in Imo or any state for that matter.\n“Importantly, the Eastern Security Network set up in December 2020 has no relationship whatsoever with the unknown gunmen."
  },
  {
    "headline": "TB Joshua: Monarchs insist burial must hold in Ondo",
    "summarized_story": "The monarchs in the four local government areas in Akokoland of Ondo State have restated their call that the remains of the founder of the Synagogue Church of All Nations, Pastor Temitope Joshua, be buried in his hometown, Arigidi Akoko.\nThe family of the deceased, who are in Lagos to make decision on the burial arrangement of the late cleric, had said the decision would be taken at the meeting scheduled to hold on Friday.\nIn the communique issued at the end of the meeting, the traditional rulers, said Joshua had done well for the people of the Akokoland and deserved to be buried in Arigidi Akoko.\nThe communique was signed by the monarchs of Oka Akoko and that of Ikaramu Akoko, Oba Yusuf Adeleye and Oba Andrew Momodu, respectively.\nHe was a great philanthropist whose death has created a vacuum difficult to fill."
  },
  {
    "headline": "Nnamdi Kanu replies Buhari, describes his Arise TV interview as pathetic",
    "summarized_story": "By Chimaobi Nwaiwu, NnewiThe leader of the Indigenous People of Biafra, IPOB, and Director of Radio Biafra, Mazi Nnamdi Kanu, Thursday evening replied President Muhammadu Buhari, over his alleged description of Biafra as a dot in Nigeria.\nMazi Kanu, in a statement he personally signed and made available to newsmen through IPOB’s Media and Publicity Secretary, Emma Powerful, described Buhari interview in the Arise TV as pathetic.\nAlso Read: President’s Interview: Afenifere blast Buhari says he’s unrepentant tribalistAccording to Mazi Kanu, “In his pre-recorded AriseTV interview, the pathetic passing off as BUHARI described Biafra as a “dot within Nigeria”“Well, hear this: The Earth is also a dot within the galaxy.\nBut it is still as great a dot as BIAFRA shall soon be amongst the comity of nations.”Vanguard News Nigeria"
  },
  {
    "headline": "Insecurity: El-Rufai calls for inter-agency cooperation",
    "summarized_story": "Nasir El-Rufai has said that tackling insecurity requires cooperation of all states and for security managers as well as intelligence agencies to share information.\nThe governor gave the advice during the 2021 second quarter meeting of Directors of the Directorate of State Security (DSS) in North West states, on Thursday in Kaduna.\nEl-Rufai said that the governors of the North west and Niger state appreciated the salient fact of inter-state cooperation as far back as 2015.\n“Similarly, all our successful operations are made possible and easy through the requisite working tools provided by the State Government.\nAhmed-Koya, however, appealed to the governor to provide the command with operational vehicles to help in carrying out operations."
  },
  {
    "headline": "MTN shareholders to receive N9.40 dividend per share",
    "summarized_story": "By Providence AdeyinkaMTN Nigeria Communications Plc has announced the payment of N9.40 as total dividend for the year ended December 31, 2020, representing 18.7 percent over N7.92 declared in 2019.\nHe said that the performance demonstrates the success of cost optimisation measures initiated during the year and strong operational execution of its people and resilience in its business.\n“Following from our good operating results and in line with our dividend policy, the board has recommended a final dividend of N5.90 per share to be paid out of distributable net income.\nThis brings the total dividend for the year to N9.40 per share, representing an increase of 18.7 percent.”Earlier in the fiscal year, the company had paid an interim dividend of N3.50, which now brings the total dividend for the year ended 31st December 2020 to N9.40.\nIts mobile subscribers increased by 12.2million to 76.5 million, while its active data users grew by 7.4 million to 32.6 million."
  },
  {
    "headline": "Reps ask FG to end abuses in Orphanages, ensure protection of children",
    "summarized_story": "The House also urged the ministry to regularly monitor and review the operational activities of orphanage operators.\nThe resolutions followed the consideration and adoption of a motion on the incessant abuse of orphanage centers in Nigeria, sponsored by Hon.\nMoving the motion, Owolabi said that many orphanages were, a situation that makes it difficult to ascertain the total number of orphans under their custody.\n“The unregistered orphanages centers are involved in illegal operations such as child trafficking and nocturnal abuse of the orphans, hence the government should ensure protection of lives of orphans.\n“There’s need to register and monitor the operations of all orphanage venters across the country.”Adopting the motion, the House mandated its Committee on Women Affairs to ensure the compliance of the motion."
  },
  {
    "headline": "Buhari: We’ll tackle those attacking security personnel, wielding AK-47s",
    "summarized_story": "President Muhammadu BuhariPresident Muhammadu Buhari says his directive to security agencies to shoot any person or persons found illegally wielding AK-47s and other assault weapons, remains in place.\nThe president also vowed that his administration would act firmly and decisively ‘‘against any and all persons found attacking our Police Force and other security personnel”.\nMr Femi Adesina, the president’s spokesman, in a statement, said that Buhari spoke on Thursday in Lagos at the handing over of security equipment by Lagos state governor Babajide Sanwo-Olu, to the Police Command in the south-western state.\n‘‘As Commander-in-Chief, my primary responsibility remains the security of the country and the safety of all citizens.\n‘‘I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund."
  },
  {
    "headline": "You're unrepentant tribalist, your interview full of lies",
    "summarized_story": "A leading Yoruba socio-political group, Afenifere has lambasted Muhammadu Buhari, describing the Nigrrian President as an unrepentant tribalist.\nAfenifere noted that Buhari’s interview on Arise Television on Thursday was full of lies, inconsistencies, contradictions and utter disrespect for other ethnic nationalities.\nThe group’s Secretary General, Chief Sola Ebiseni said this in a statement in Akure, the Ondo State capital on Thursday, in reaction to the President’s interview on Arise.\nBuhari’s govt is disorganized – Afenifere”Even his latest appointment of the Chief of Army Staff, is flawed particularly on seniority,” Afenifere said.\nIt was after his death that many Nigerians knew Idiagbon was Fulani of Ilorin,” it further stated."
  },
  {
    "headline": "Spray naira notes, go to jail",
    "summarized_story": "The Central Bank of Nigeria, CBN, has warned Nigerians against spraying the Naira notes in parties and other events.\nAccording to the spokesman, the CBN has concluded the decision to establish mobile courts to prosecute those abusing the Naira notes.\nHe noted that the security agencies particularly the police operatives would be involved in monitoring the Naira users and ensure that the order is enforced across the nation.\n“If a celebrant is dancing and you spray him/her, you may go to jail from the party venue, because the law enforcement agents will be there, waiting to arrest you.\nThe CBN spokesman urged Nigerians to ensure that monies being gifted to their loved ones either in an event or not are properly enveloped to avoid abusing the note."
  },
  {
    "headline": "June 12: Gov Ayade reads riot act, says no public procession",
    "summarized_story": "Cross River State Governor, Prof Ben Ayade has read the riot act, warning residents not to embark on public procession to mark democracy day on June 12.\nIn a statement issued on Thursday, the Special Adviser, Media and Publicity to the Governor, Christian Ita reminded the general public that the ban on public procession and gathering in the State was still very much in force.\n“Parents are hereby advised to keep a firm grip on their kids and wards to prevent them from falling prey to agents of destabilisation.\n“Government warns that it will not allow anyone or group to breach the peace being enjoyed in the state.”The statement added, “Therefore, the full weight of the law will be brought to bear on violators of the ban on procession.\n“As a responsible and people-oriented government, the Cross River state government under Professor Ayade wishes to assure all citizens that it will continue to protect lives and properties in the State.”"
  },
  {
    "headline": "Why I slapped President Macron",
    "summarized_story": "Twenty-year-old Frenchman, Damien Tarel has explained to the court the reason behind his decision to slap the country’s President, Emmanuel Macron.\nHowever, his explanation could not stop the court from handing him a four month jail for slapping his president.\nDespite the presence of security personnel, Tarel had attacked the French president when he (Macron) was exchanging pleasantries with members of the public during a trip in France’s Drome region.\nBystander slaps President of France, Emmanuel Macron at public eventTarel said he had thought about throwing an egg or a cream tart at the president, but added the slap was not premeditated.\n“I think that Macron represents very neatly the decay of our country,” he told the court, according to BFM TV."
  },
  {
    "headline": "Nigeria vs Twitter: Buhari under fire as lawyers condemn social media censorship",
    "summarized_story": "Legal practitioners have decried the ongoing social media censorship in Nigeria amid President Muhammadu Buhari administration’s action against Twitter.\nThe National Broadcasting Commission (NBC) has been directed to license all social media operations, while television and radio stations are barred from tweeting.\nFestus Ogun, a human rights activist told DAILY POST he agrees with other stakeholders that social media should be regulated to prevent abuse.\nThe legal analyst, however, noted that Nigeria’s social media space is already regulated with laws like the Cybercrime Act.\n“I see it as a backdoor implementation of the widely rejected Social Media Bill."
  },
  {
    "headline": "157km Lagos-Ibadan rail line opens for operations",
    "summarized_story": "By Adeyinka Aderibigbe, Oyebola Owolabi and Faith YahayaPresident Muhammadu Buhari on Thursday opened the 157 kilometre-Lagos-Ibadan Standard Gauge Railway Line for full commercial operations.\nHe described the project as another milestone to revitalise the rail infrastructure and improve socio-economic activities.\n“Further to other ongoing railway infrastructure projects, we have embarked on the completion of the outstanding segment of the Lagos-Kano railway (Ibadan-Kano).\nAmaechi said approval to begin construction of the Kano-Kaduna rail line has been secured.\nAccording to him, stations along the Lagos-Ibadan rail line were named after notable personalities, and 1,000 houses were demolished in Ogun State in the course of construction."
  },
  {
    "headline": "Ex-leaders, monarchs, labour leaders, others meet over insecurity",
    "summarized_story": "Former Catholic archbishop of Abuja, Cardinal John Onaiyekan, also joined the meeting.\nIt was learnt that the meeting also deliberated on other national issues, such as unity, peace, integration, economic revitalisation and development.\nLast Sunday, Obasanjo asked Nigerians to seek divine intervention to end the security crisis in the country.\nOne of the organisers, who spoke in confidence, told our correspondent that media houses were not invited to cover the event.\nADVERTISEMENTAfter several promptings, Obasanjo told reporters that a communiqué would be issued later."
  },
  {
    "headline": "Army redeploys 11 Generals in shakeup",
    "summarized_story": "By Okodili Ndidi, AbujaThe Nigerian Army has announced the redeployment of 11 Generals and other senior officers in a major shakeup, following the appointment of the new Chief of Army Staff (COAS), Maj.-Gen. Farouk Yahaya.\nA statement on Thursday in Abuja by the Director of Army Public Relations, Brig.-Gen. Mohammed Yerima, reads: “The Nigerian Army has released postings and appointments of senior officers.\nThis is in line with the Chief of Army Staff’s vision to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nI. M. Jallo, from Defence Space Administration to Headquarters, Theatre Command, Operation Hadin Kai and appointed Deputy Theatre Commander 1.\n“The COAS, Maj.-Gen. Faruk Yahaya, urged all the affected senior officers to justify the confidence reposed in them."
  },
  {
    "headline": "Insecurity: shoot-on-sight still in force, says Buhari",
    "summarized_story": "He said his shooting-on-sight order for illegal bearers of AK 47 rifles and other assault weapons remained in force.\n“It is commendable that Lagos State, the Centre of Excellence, has shown a truly resilient spirit, in the face of the massive destruction it suffered last October.\n“I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund.\nWe’ll organise the police and the military to pursue them.”Gazettes on open grazing, cattle routes to be dustedThe President said farmer-herder clashes had persisted because old cattle routes and grazing areas had been affected by development.\nThere are cattle routes and grazing areas."
  },
  {
    "headline": "Again, Buhari restates shoot-on-sight order",
    "summarized_story": "‘‘As Commander-in-Chief, my primary responsibility remains the security of the country and the safety of all citizens.\nDespite the many challenges we are facing, I want Nigerians to rest assured that we will secure this country.\n‘‘I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund.\nBuhari declared that no federal government, since 1999, had been as committed as his administration toward reforming and repositioning the Nigeria Police Force and national policing architecture.\n‘‘In 2020, I assented to the Bill amending the Nigeria Police Act, which was originally enacted in 1943."
  },
  {
    "headline": "…Vows to restore cattle routes, grazing areas across the country",
    "summarized_story": "President Muhammadu Buhari has said his administration would reinstate cattle routes and grazing areas across the country to ensure that herders have free access for their animals.\nIn apparent response to the ban on open cattle grazing by the 17 Southern governors, he said when the governors gave the directive that open grazing would be banned, he referred them to the gazette that makes provisions for cattle routes and open grazing areas.\nThere are certain routes and grazing areas so that when cattle rearers were moving from the north to the west, they were allowed to go through there.\nThose who encroach on these cattle routes and grazing areas would be dispossessed.\nHe said the local governments which are under the control of state governors are dead, which he says is bad for the country."
  },
  {
    "headline": "PDP, Ohanaeze, MBF, MASSOB, Kokori, Kanu, others react",
    "summarized_story": "The Peoples Democratic Party (PDP) accused President Muhammadu Buhari of attempting to claim projects executed by previous administration headed by the opposition party .\nThe PDP noted that President Buhari bulged an opportunity to address salient issues confronting the country, by allegedly being evasive during the Arise interview.\nReacting, Ohanaeze Ndigbo said Buhari has a choice between dialogue and waging an avoidable war against Ndigbo.\n“President Buhari has a choice between dialogue on one hand and an avoidable war against the Igbo on the other.\nReacting in a statement through the group’s media and publicity secretary, Emma Powerful, Kanu: “The earth is also a dot within the galaxy."
  },
  {
    "headline": "Catholic Bishops unhappy over multiple mention of Islam in 1999 Constitution",
    "summarized_story": "From Fred Ezeh, AbujaThe Catholic Bishops’ Conference of Nigeria (CBCN) has registered discontent with the level of recognition accorded Islam in the 1999 Constitution.\nThe bishops observed that Islam was mentioned many times in the Constitution, while no mention was made of Christianity, or any other religion.\nThe 1999 Constitution of the Federal Republic of Nigeria is a product of an imposition of the military.”Akubueze said by granting recognition to only Islam in a secular state, the 1999 Constitution, had put adherents of other religions in a disadvantaged position.\nIn particular, there have been complaints about the special bias, recognition and prominence accorded to Islam in the Constitution of Nigeria.\nSenate should see this constitution review exercise as an opportunity to give sincere listening ear to Nigerians to whom the 1999 Constitution of the Federal Republic of Nigeria (as amended) was imposed on.”"
  },
  {
    "headline": "Man who slapped French president gets 4-month prison sentence",
    "summarized_story": "The man who slapped French President, Emmanuel Macron has been given four months jail term after he admitted to the crime.\nDamien Tarel told the court it was an act of impulse, but the prosecutor said it was a “deliberate act of violence”.\nThe court heard that Tarel, a medieval combat enthusiast subscribed to right-wing or far-right politics and was close to the yellow-vest movement.\nAs he slapped the president, Tarel was heard shouting “Montjoie and Saint-Denis!\nThe three judges said Tarel should be given 18 months, with 14 months suspended."
  },
  {
    "headline": "The Return to Igangan",
    "summarized_story": "There was a time that some of our leaders especially in the military era would glibly tell us that Nigerian unity is non-negotiable.\nO. AnyaWhatever becomes of the spiralling inter-ethnic (mutually assured destruction) cycle of violence in Nigeria, Igangan, Ibarapa in Oyo State, will be remembered as a turning point.\nSymbolically, Igangan has always been associated with critical phases of Yoruba history.\nThe question then arises, is the Seriki Fulani of Igangan a foreigner?\nThat any evil is justified in the self-serving pursuit of the distorted notion of national unity as an end unto itself?"
  },
  {
    "headline": "Buhari: My Order to Security Operatives to Shoot Anybody Carrying AK47 Stands",
    "summarized_story": "President Muhammadu Buhari Thursday said his order to security agencies to shoot at anyone carrying AK47 or any assault rifle remains in place.\nPresident Buhari said this at the Nigeria Police College, Ikeja where he commissioned security equipment bought for the Lagos State Command of the Nigeria Police by the state government.\nDetals later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Democracy Day: FG Declares Monday Public Holiday",
    "summarized_story": "Michael Olugbode in AbujaThe federal government has declared Monday, June 14, 2021 as public holiday to mark this year’s Democracy Day celebration.\nHe said the space known as Nigeria would be a haven of peace, unity and progress if all citizens love his or her neighbour and embrace the spirit of brotherliness.\nThe minister said: “As we mark another Democracy Day in the history of our dear country, let us reflect on the efforts of our founding fathers and ensure that Nigeria remains one united and indivisible entity.\nAregbesola said: “There will surely be light at the end of the tunnel,” even as he wishes all Nigerians a happy Democracy Day celebration.\nThis year’s celebration falls on a Saturday, making the federal government to declare Monday, June 14 a public holiday."
  },
  {
    "headline": "Buhari Commissions Security Equipment in Lagos",
    "summarized_story": "President Muhammadu Buhari has arrived at the Nigerian Police College, Ikeja to Commission security equipment bought for the Lagos State Command of the Nigeria Police by the state government.\nApart from the host governor, Babajide Sanwo-Olu, Governor Dapo Abiodun of Ogun State and Speaker of the House of Representatives, Femi Gbajabiamila, are also attending the event.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: I Hope for APC to be at the Centre Beyond 2023",
    "summarized_story": "Says nobody should sit in Lagos to decide party’s fateBy Deji ElumoyePresident Muhammadu Buhari has expressed his desire for the ruling All Progressives Congress (APC) at the centre to outlive his government after 2023.\nThe President, who spoke while featuring Thursday morning on Arise TV, the broadcast arm of THISDAY, also said it will be unfair for someone to sit in Lagos and dictate the party’s zoning formula for the 2023 general poll.\nBuhari said: “The hope of this administration is to see APC last beyond it.\n“You cannot sit here in Lagos, for instance, and decide on the fate of APC on zoning.\nNo single member of the party will be allowed to go against the wish of the party.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Students Association President, Asefon Meets Police Inspector General, Vows To Disrupt June 12 Planned Protest",
    "summarized_story": "The President of the National Association of Nigerian Students (NANS), Sunday Asefon has vowed to disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“That’s a fallacy, I met the IGP based on the insecurity in the country and I reported to him the stand of Nigerian students.\nI told him we want the police to be more proactive in protecting Nigerian students.\nOur agitation is safe campus for Nigerian students.”"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Students Association President, Asefon Meets Police Inspector General, Vows To Disrupt June 12 Planned Protest",
    "summarized_story": "The President of the National Association of Nigerian Students (NANS), Sunday Asefon has vowed to disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“That’s a fallacy, I met the IGP based on the insecurity in the country and I reported to him the stand of Nigerian students.\nI told him we want the police to be more proactive in protecting Nigerian students.\nOur agitation is safe campus for Nigerian students.”"
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "Onyema Nwachukwu is new spokesman as army carries out major reshuffle",
    "summarized_story": "The Nigerian army has appointed Onyema Nwachukwu as its new director of public relations.\nAdvertisement“Those affected in the reorganisation include; Brigadier General O. Nwachukwu from Defence Headquarters (Director Defence Information) to Headquarters, Directorate of Army Public Relations, and appointed Director; Brigadier General A.E.\nMusa from Nigerian Army Resource Centre to Headquarters, Theatre Command Operation Hadin Kai and appointed Theatre Commander.\nAll posting and appointments are with immediate effect.”AdvertisementUntil his appointment, Nwachukwu was the acting director of defence information at the defence headquarters.\nHe also has a postgraduate diploma in advertising and public relations from the International Institute of Journalism, Abuja."
  },
  {
    "headline": "Onyema Nwachukwu is new spokesman as army carries out major reshuffle",
    "summarized_story": "The Nigerian army has appointed Onyema Nwachukwu as its new director of public relations.\nAdvertisement“Those affected in the reorganisation include; Brigadier General O. Nwachukwu from Defence Headquarters (Director Defence Information) to Headquarters, Directorate of Army Public Relations, and appointed Director; Brigadier General A.E.\nMusa from Nigerian Army Resource Centre to Headquarters, Theatre Command Operation Hadin Kai and appointed Theatre Commander.\nAll posting and appointments are with immediate effect.”AdvertisementUntil his appointment, Nwachukwu was the acting director of defence information at the defence headquarters.\nHe also has a postgraduate diploma in advertising and public relations from the International Institute of Journalism, Abuja."
  },
  {
    "headline": "'You can't claim projects you didn't start' -- PDP hits Buhari over interview",
    "summarized_story": "The Peoples Democratic Party (PDP) says it is wrong for President Muhammadu Buhari to “claim” projects started by previous administrations.\nAdvertisementBuhari highlighted some of his administration’s projects in an interview with Arise TV, which was broadcast on Thursday.\n“President Buhari also needs to accept the bitter fact that the current drawback in infrastructural development in our country started with his administration.\nLike a relay race, successive PDP administrations furthered infrastructural development only for him to run the opposite direction when the baton was passed to him.\nAdvertisement“It is important to state that only the on-going refurbishing of Akwanga-Maiduguri road that President Buhari can lay claim to as the singular and only project in which he has demonstrated capacity.”"
  },
  {
    "headline": "'You can't claim projects you didn't start' -- PDP hits Buhari over interview",
    "summarized_story": "The Peoples Democratic Party (PDP) says it is wrong for President Muhammadu Buhari to “claim” projects started by previous administrations.\nAdvertisementBuhari highlighted some of his administration’s projects in an interview with Arise TV, which was broadcast on Thursday.\n“President Buhari also needs to accept the bitter fact that the current drawback in infrastructural development in our country started with his administration.\nLike a relay race, successive PDP administrations furthered infrastructural development only for him to run the opposite direction when the baton was passed to him.\nAdvertisement“It is important to state that only the on-going refurbishing of Akwanga-Maiduguri road that President Buhari can lay claim to as the singular and only project in which he has demonstrated capacity.”"
  },
  {
    "headline": "Insecurity remains a snag, but Buhari has done well on infrastructure",
    "summarized_story": "And truly so, there were always reasons – good reasons.\nInsecurity remains a detraction to the achievements of the Buhari administration.\nAdvertisementThe Buhari administration has done well on infrastructure.\nAdvertisementYet it appears insecurity is eclipsing the achievements of the Buhari administration in this area.\nThe Buhari administration must do well to address insecurity – for its own reckoning."
  },
  {
    "headline": "#TwitterBanNigeria: Is it even legal?",
    "summarized_story": "This came after Twitter deleted a tweet by the country’s president where he threatened “civil war” type violence on citizens of the country.\nWith this we suddenly have two things to be addressed: was blocking Twitter legal and should people be prosecuted for carrying on tweeting with their VPNs.\nBut the fact that a directive is issued does not make it entirely legal.\nThe directive issued by the attorney general is unlawful.\nThe attorney general falls into the class of the former but in this regard, he has no law to enforce."
  },
  {
    "headline": "Electric vehicles: Bolt’s answer to carbon emissions, fuel price headaches in Kenya",
    "summarized_story": "Kenya, this week, became the first and only African market where Bolt has introduced electric bikes, tuk tuks (tricycles) and scooters on its platform.\nThis comes as the on-demand transport company looks to tackle the twin challenge of fuel price fluctuations and environmental pollution in the East African country.\nFor now, the electric bicycles and tuk tuks will be used by Bolt Food couriers only.\nOur customers will now have more Eco-friendly and sustainable options to choose from,” Bolt Food Country Manager, Edgar Kipngetich Kitur, said.\nAccording to Bolt, electric vehicles will also help evade challenges associated with a fuel price crisis that has greatly affected its drivers and couriers."
  },
  {
    "headline": "How seamless customer onboarding is transforming fintech growth",
    "summarized_story": "Yet, beyond marketing spend, there’s another simple way that fintech startups are ensuring that people want to use their products, and it is through onboarding.\nThe event had Babs Ogundeyi, the CEO of Kuda Bank, Dayo Ademola, the Managing director of Branch Nigeria, and Esigie Aguele, the co-founder and CEO.\nOne of the critical things in onboarding a customer is the Know Your Customer (KYC) requirement.\nWhat does the onboarding process look like at Kuda bank?\nIn a nutshell, the more documents you have to corroborate, the better your onboarding process."
  },
  {
    "headline": "A Global Tech Review on the New Infinix Note 10",
    "summarized_story": "The latest smartphone in the product line of the Note series, the Infinix Note 10, is a device that was built to ‘Meet Beauty with Strength’.\nThe elements of the new Note 10 are Speed, Beauty, Power, and Strength.\nInfinix has gone a step further to bring upgraded and improved features to the new Note 10, while still maintaining affordable pricing for consumers.\nThe Infinix Note 10 Pro won the IF design award 2021 for its iconic design and flattering colour variants.\nThe Infinix Note 10 Pro will certainly satisfy with its whopper of a 6.95inch IPS display."
  },
  {
    "headline": "Africa Fintech Foundry launches digital academy with Women In Tech Fireside Chat",
    "summarized_story": "Africa Fintech Foundry (AFF), will be hosting a Women In Tech Fireside on Friday, June 11 to launch its female digital academy.\n5 lucky participants at the fireside chat will get direct admission into AFF’s female digital academy.\nThis summer, AFF will be launching a digital academy to empower women in tech.\nThrough the Women In Tech fireside chat, AFF hopes to lay the groundwork for the academy.\nInterested participants can register for the event using this linkFollow Africa Tech Foundry on social media to get the latest on new developmentsIG: @africafintechfoundryTwitter: @AFFoundryFacebook: @africafintechfoundry"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "An insight into how Texas-based VC, Sputnik ATX, invests in African startups",
    "summarized_story": "In May 2021, CribMD, a Nigerian healthtech startup, closed a $2.6 million seed round led by US-based venture capital firm, Sputnik ATX.\nTell us how Sputnik ATX came aboutMy business partner, Oksana Malysheva, and I founded ATX in 2017 after we had managed a fund together.\nWe founded Sputnik ATX so that we could do that.\nWhat does VC investment mean to Sputnik ATX?\nTell us what market(s) Sputnik ATX is interested in and why?"
  },
  {
    "headline": "#TechpointDigest 100th edition, More on #TwitterBan, iOS, Android’s new features",
    "summarized_story": "Good day,Today marks the 100th edition of Techpoint Digest, Techpoint Africa‘s daily newsletter.\nMention two.”On a non-Twitter related note, Apple has announced the new features coming to its new iOS 15.\nThe event, dedicated to software, is held annually to showcase new features coming to operating systems across Apple’s ecosystem.\nAnother interesting feature coming to the new iOS is Live Text.\nLaunched Wednesday, June 9, 2021, the second version will come with more of the features promised at the Google I/O event in May."
  },
  {
    "headline": "Update on #Twitter ban, Nigerian e-hailing drivers go local, Bolt’s e-bikes in Kenya",
    "summarized_story": "Various bodies, including High Commissions and Embassies of foreign nations spoke out against the Twitter ban.\nUber and Bolt drivers set to partner with local companiesFighting back?\nRecall that in April 2021, riders on Uber and Bolt drivers embarked on a week long warning strike.\nGo deeper with this article: Uber, Bolt drivers move to dump ride hailing companies, partner with indigenous firmsBolt unveils electric tuk-tuks in KenyaBolt Foods electric motorcycles.\nSource: TechishBolt has unveiled electric tuk-tuks — tricycles — and e-bicycles in Kenya."
  },
  {
    "headline": "How digital currency will ease transaction cost",
    "summarized_story": "Nigerians would begin to enjoy reduced cost of transaction and cash management as the Central Bank of Nigeria (CBN) is finalising plans to roll out its own digital currency before the end of the year, as it finds ways to regulate the virtual currency space in the country.\nCBN Director, Information Technology, Rukiyat Mohammed, announced…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "5 takeaways from Buhari’s Arise TV interview",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration would be decisive in dealing with terrorist hoodlums causing unrest in the country, in an interview on Thursday with Arise TV, his first since he was re-elected in 2019.\nPresident Buhari spoke on a wide range of issues bordering on infrastructural development, appointments, insecurity, farmers/herders clashes, etc.\nHe dismissed the secessionist agitations of Indigenous People of Biafra (IPOB) and other groups, saying that security forces had been instructed to use force against them.\nBuilding infrastructure to Niger RepublicPresident Buhari justified the continued building of roads, railways and other infrastructure projects to connect the country to Niger Republic, noting that Niger Republic and other neighbouring countries were crucial to the country’s fight against terrorism and insurgency.\nThe President advised the youths to shun violence and maintain peace, stressing that the recent EndSARS protests across the country had further complicated the security situation and affected investors’ confidence in Nigeria."
  },
  {
    "headline": "Against forecasts, COVID-19 in Africa remains a puzzle",
    "summarized_story": "Against early forecasts that COVID-19 infection and mortality rates in Africa might spell mind-boggling catastrophe, the pandemic on the continent remains a puzzle that Africa Centre for Disease Control (ACDC) has not yet found answers.\nMaking the case for vaccine equity, Tedros Ghebreyesus, director-general, World Health Organisation, said although Africa had not yet seen the same scale of devastation from the COVID-19 pandemic as some parts of the world.\nSo far, Africa has administered just over 31 million COVID-19 vaccines doses or 2 percent of the global total, he stated, noting that the final solution will be to build health capacities, not only for COVID-19 vaccines but for other vaccines.\n“Africa has not escaped COVID-19 and we cannot let down our guard.\nBut it is clear that Africa cannot rely solely on imported vaccines from the rest of the world,” Ghebreyesus said."
  },
  {
    "headline": "Obaseki approves redeployment of all health workers in local councils – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…begins physical verification Monday, June 15BENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the transfer of all Primary Health Care Staff of the Local Government Service Commission to the Edo State Primary Health Care Development Agency, as part of ongoing reforms to improve access to quality healthcare services across the state.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie Esq., said all the affected staff are to present themselves for physical verification exercise from Monday, June 15 to Friday, June 18, 2021.\nHe said, “In line with the Health Sector Reform Agenda of the Government of Edo State, which is anchored on its commitment to effective service delivery and in accordance with the Edo State Primary Health Care Development Agency Law, the Governor of Edo State, Mr. Godwin Nogheghase Obaseki, has approved with effect from 1st of June, 2021, the transfer of all Primary Health Care Staff of the Local Government Service Commission to the Edo State Primary Health Care Development Agency.\n“Pursuant to the foregoing, the Primary Health Care Agency will, in conjunction with the Local Government Service Commission, carry out physical verification of all affected staff from Monday 15 to Friday, 18 June, 2021.”Ogie said the verification exercise will take place in the three Senatorial Districts of Edo State.\nHe added that the exercise for Edo South Senatorial District will hold at the John Odigie Oyegun Public Service Academy (Staff Training Centre) Benin City as folllows, “Egor 16/06/2021; Ikpoba-Okha 17/06/2021; Oredo 18/06/2021; Orhionmwon 16/06/2021; Ovia North East 15/06/2021; Ovia South West 15/06/2021; Uhunmwode 17/06/2021.”According to him, the verification exercise for staff in Edo Central Senatorial will take place at the Esan Central Local Government Council Hall, Irrua, with the schedule slated as follows, “Esan Central LGA 18/06/21; Esan North East 16/06/21; Esan South East 17/06/21; Esan West 15/06/21; Igueben 18/06/21.”He said in Edo North, the verification of the staff will hold at the Etsako West Local Government Council Hall, Auchi, in the following order: “Etsako Central LGA 15/06/21; Etsako East 15/06/21; Etsako West 18/06/21; Owan East 16/06/21; Owan West 16/06/21; Akoko Edo 17/06/21.”..."
  },
  {
    "headline": "CBN may launch digital currency end of 2021 – official – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Central Bank of Nigeria (CBN) on Thursday in Lagos said that its digital currency might be launched by the end of 2021.\nMrs Rakiya Mohammed, an Information Technology Specialist with CBN, made the disclosure at an online news briefing at the end of Bankers Committee meeting.\nAccording to Muhammed, another reason the apex bank plans to come up with digital currency is to make remittances travel easier from abroad to Nigeria.\nShe said that digital currency would accelerate the ability to meet the target, regardless of one’s country of residence.\nOthers are: Nneka Onyeali-Ikpe, Managing Director/CEO, Fidelity Bank; Mr Abubakar Suleiman, Managing Director/CEO, Sterling Bank Plc; Mr Haruna Mustafa, Director, Banking Supervision, CBN, and Mr Osita Nwanisobi, Acting Director, Corporate Communication Department, CBN."
  },
  {
    "headline": "Scrapping of NYSC: Scapegoating Only Aggravates Our Woes – Nigerian Observer",
    "summarized_story": "The activities of these anti-state actors have imperiled farmers, traders, students, political leaders, travelers and ofcourse corps members who are entrusted with the patriotic mandate of rendering selfless service to the motherland.\nIt is this existential question that has birthed a precipitous bill seeking to scrap National Youth Service Corps (NYSC).\nSponsored by Awayi Abiante from Rivers State, the bill has now reached the second reading at the Green Chamber.\nIt is worthy to note that since the inception of nysc itself in 1973 the program has been trailed by waves of protest .\n___________________________________________________________________________________________________________________Sinafi Omanga is a serving corps member with the Nigerian Observer."
  },
  {
    "headline": "We’re in govt to midwife process of change in Edo politics – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has posited that his involvement in politics is a divine arrangement by God, to help drive the process of change in Edo politics.\nObaseki, who spoke to journalists in Benin City, said the last seven months of his second term has been spent on separating governance from politics and re-strategizing to ensure that the state works better for citizens.\n“I am into politics in the state, to midwife the process of change, as change is a constant thing in life.\nTherefore, the politics of Edo State must change: The narrative must change.\nThe governor further stated that the connection between politics and development is in fulfilling the promises made to the electorate during our electioneering campaign."
  },
  {
    "headline": "Nigerian govt ditches China, seeks $14.4 billion rail loan from Standard Chartered",
    "summarized_story": "The railway infrastructure will be constructed by China Civil Engineering Construction Corp (CCECC), which has entered pact with the government.\nNigeria spent about 12.6 per cent or $195.5 million of the entire money it used to service its external debt last year to pay part of its debt to China.\nMr Amaechi’s spokesperson did not respond to phone calls by PREMIUM TIMES, requesting comment.\nState-owned CCECC inked a deal valued at $11.2 billion with Nigeria in 2014 for the building of the Coastal Line that would link Lagos with Calabar in the South-South.\nPresident Muhammadu Buhari disclosed in 2017 China’s Export-Import Bank would soon endorse a $3.5 billion facility to help tee off the development of the standard-gauge line, spanning 1,400 kilometres, planned to be constructed in segments."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Arise Interview: Afenifere blasts Buhari, says he’s a tribalist who takes delight in ridiculing Igbo people",
    "summarized_story": "Apex Yoruba sociopolitical group, Afenifere, has berated President Muhammadu Buhari over the comments he made during his interview with Arise TV, noting that the president only takes delight in ridiculing Igbo people, and is un-presidential in his utterances.\n”The President takes delight in ridiculing the Ndigbo which he used IPOB to represent,” the statement said.\n“He couldn’t have been reacting to the IPOB but the Igbo who he said had businesses everywhere.\nAfenifere described the president as a tribalist who holds the rest of Nigeria in contempt, noting that his interview is full of of lies and inconsistencies.\n“Specifically, Section 217 (3) provides that the composition of the officer corps and other ranks of the armed forces of the federation shall reflect the Federal character of Nigeria."
  },
  {
    "headline": "US condemns Buhari’s Twitter ban, says suppression of free speech has no place in democracy",
    "summarized_story": "OBINNA EZUGWUThe United States government, has condemned President Muhammadu Buhari’s ban on social media platform, Twitter, just as it expressed concern over threat to prosecute Nigerians for using the platform.\n“The United States condemns the ongoing suspension of Twitter by the Nigerian government and subsequent threats to arrest and prosecute Nigerians who use Twitter.\nThe United States is likewise concerned that the Nigerian National Broadcasting Commission ordered all television and radio broadcasters to cease using Twitter,” the statement said.\n“Unduly restricting the ability of Nigerians to report, gather, and disseminate opinions and information has no place in a democracy.\nAs its partner, we call on the government to respect its citizens’ right to freedom of expression by reversing this suspension.”"
  },
  {
    "headline": "Why we are honouring Daily Times icons – Fidelis Anosike",
    "summarized_story": "Daily Times Bid Bond then was N100 million.\nAt one time, Alhaji Jose was asked if he would run for president, and he said he was already chairman of Daily Times.\nHis mandate was to revive Daily Times, and put it on the same pedestal as the New York Times.\nYes, in the run up to our 100 anniversary, we have created an event to celebrate icons of Daily Times – our heroes; Times Heroes.\nWe will celebrate Ernest Ikoli, the first ever indigenous and founding editor of the Daily Times."
  },
  {
    "headline": "Buhari categorises all Igbo as IPOB, says he’s mobilized the military to go after them",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has said that the Indigenous People of Biafra (IPOB), has businesses everywhere, adding that his government had mobilised and would continue to mobilise the military and the police to go after them.\nBuhari who spoke in in a pre-recorded interview on Arise News Television, categorized all Igbo People as IPOB members, noting that despite having businesses everywhere, nobody is disturbing the group.\nHe said some leaders of the South South, had approached him to say they have no business with IPOB, which according to him, means that they will be encircled.\n“IPOB is just like a dot in a circle and they have nowhere to turn to.\nThey are spread everywhere and they have investments and properties everywhere and in other areas,” Buhari said."
  },
  {
    "headline": "Stockbrokers Call For Reintroduction Of Margin Facility To Improve Liquidity",
    "summarized_story": "Stockbrokers, under the auspices of the association of securities dealing houses of Nigeria (ASHON) have called for reintroduction of the margin facility to help improve liquidity in the Nigerian capital market.\nThe chairman of ASHON, Chief Onyenwechukwu Ezeagu, stated that the Central Bank of Nigeria (CBN) should reintroduce the margin facility to help improve liquidity in the market.\nAccording to him, it should, in conjunction with capital market operators, design effective guidelines that will de-risk the product to avert past experiences in margin lending in the market while margin terms and conditions should also be reviewed in line with the current realities.\n“Government should patronise the capital market; the taste of the pudding is in the eating.\nWe all need to tone down our words and actions for our country to avert catastrophe and ensure that our economy is sustained.”"
  },
  {
    "headline": "Nigeria’s Proven Gas Reserves Rise To 206.53tcf – DPR",
    "summarized_story": "The Department of Petroleum Resources (DPR) says Nigeria has recorded an increase in its proven natural gas reserves to 206.53 trillion cubic feet (tcf) as at Jan.1, 2021 up from 203.16tcf in the previous year.\nAuwalu said: “Nigeria attained the target of 200tcf of natural gas reserves by the reserve declaration as at Jan.1, 2019, before the 2020 target“Thereafter, the government set a target to attain a reserves position of 2020tcf by 2030.\n“It is, therefore, my pleasure to formally declare the national gas reserves position as at Jan. 1, 2021 at this important forum.\n“Nigeria’s natural gas reserves as at Jan. 1, 2021, stands at 206.53tcf.\nAssociated gas is 100.73tcf and non-associated gas is 105.80tcf, making a total of 206.53tcf.’’"
  },
  {
    "headline": "PMB Commissions Lagos-Ibadan Rail Project",
    "summarized_story": "The president explained that the project is part of the Lagos-Kano railway project, with the Abuja-Kaduna leg already operational.\nAccording to him, the railway project is receiving the attention it deserves and when the Lagos-Kano project is completed, it will link Maradi in Niger Republic.\nHe commended the minister of transportation, Rotimi Amaechi, for his determination towards completing the railway project.\nAmaechi said the Lagos-Ibadan rail project is the third that the president has commissioned.\n“The first was the Abuja-Kaduna, followed by Warri-Itakpe, and now the Lagos-Ibadan project."
  },
  {
    "headline": "Branch International Processes N40bn Loans To Nigerians",
    "summarized_story": "The company is achieving this by leveraging technology to offer a range of unique financial services to customers, announced recently at a virtual round table held in Lagos.\nAccording to the company, the quest to make formal financial services accessible at an affordable rate to individuals and businesses is critical in systematically driving economic development.\nThus, their unique range of offerings are designed to offer value to customers whilst enabling them make payments and granting access to loans and investment opportunities.\nBranch remains perfectly poised to take on the challenge of providing access to affordable financial services for all,” she added.\nWith support from world-class investors such as VISA, IFC and Andreessen Horowitz, Branch continues to deliver superior customer value."
  },
  {
    "headline": "Dangote Volunteers Plant Trees To Boost Ecosystem Restoration",
    "summarized_story": "To help realise the global objective of a better and safer ecosystem, the Dangote Group has initiated a tree planting campaign through an Employee Volunteering initiative.\nAmong the Dangote Volunteers were the GM/Head of Sustainability Dangote Cement, Mrs. Eunice Sampson; Head, Community Affairs and Environment, Dangote Cement, Engr.\nSpeaking on the World Environment Day and tree-planting exercise, GM/Head of Sustainability Dangote Cement, Mrs. Eunice Sampson said, “The theme of this year, ‘Ecosystem Restoration’ is very apt and timely.\nAlso, head, Community Affairs and Environment, Dangote Cement, Engr.\nTukur Lawal said, “This year we have embarked on strategic activities to commemorate the 2021 World Environment Day."
  },
  {
    "headline": "Buhari warns secessionists, attackers of security personnel, facilities...",
    "summarized_story": "Despite the many challenges we are facing, I want Nigerians to rest assured that we will secure this country.\n‘‘I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund.\nPresident Buhari declared that no Federal Government since 1999 has been as committed as his administration in reforming and repositioning the Nigeria Police Force and national policing architecture.\n‘‘This new scheme will build confidence within our local communities and make them active stakeholders in the safety and security of their environs.\n‘‘We are currently recruiting 10,000 new Police officers to reinforce our personnel capacity across the country."
  },
  {
    "headline": "Itsekiri get new crown to replace missing 378-year-old one —",
    "summarized_story": "*Uduaghan wades into kingship feudBy Gabriel OmonhinminIn the absence of the 378 years old missing Itsekiri crown, the Ginuwa Princes have settled for a new one for the throne, clearing way for the official coronation of Omoba Tsola Emiko on Saturday, August 21, 2021.\nIt is this riddle that men like the former Governor of Delta State, Dr. Emmanuel Uduaghan, who is an Itsekiri chief, have been making frantic efforts to solve.\nHe added that the process that threw up the candidature of Tsola Emiko and his eventual selection as the Olu-designate was faulty and a complete violation of the law, and cannot stand.\nHe said that what most people don’t understand is that Chief Emami usually briefed the Ologbotsere descendants about all that happened in all the meetings he attended.\nYemi Emiko was said to have intervened at this juncture, saying, “if the missing crown is not found before the coronation date, we are already making a new and more beautified crown than the missing crown, which we will use to crown Omoba Tsola Emiko as the 21st Olu of Warri Kingdom come August 21st 2021."
  },
  {
    "headline": "ICT can transform energy sector",
    "summarized_story": "There was a lowering of oil reserves because production was halted in some countries and, therefore, production became low.\n“If you do a comparative analysis between Nigeria and other countries, cost of production per barrel in Nigeria is significantly very high.\nI believe it is time for the oil and gas industry to embrace more ICT.\nICT innovations are coming up to help tackle most of the challenges in the industry.\nI know Huawei Technologies has been coming up with some new solutions for the petroleum industry,” he added."
  },
  {
    "headline": "JUST IN: IG of Police escapes death in Lagos as Canopy collapses",
    "summarized_story": "Usman Alkali Baba, the inspector-general of Police, IGP, narrowly escaped death as a canopy nearly collapsed on him during an official function on Wednesday, June 9, 2021.\nThe incident took place at the Lagos State Police Headquarter Ikeja when the newly confirmed IGP, who was on his first official visit to the state, was about to address senior police officers.\nIt was about 2:15 p.m. when he came down from office of the state Commissioner of Police, Azeez Odumosu, when a heavy wind started blowing.\nAt about 2:30 p.m. the rain and wind became heavier just as the IGP was being introduced.\nThis development forced the IGP and other senior officers to run to the conference room while others and journalists sought safety in available."
  },
  {
    "headline": "Herders kill six in Benue community, abduct women",
    "summarized_story": "Six people were killed by armed herdsmen in Wednesday afternoon’s attack on Anyom community of Mbatyula Council Ward in Katsina-Ala Local Government Area of Benue State.\nMedia aide to the Chairman of Katsina Ala Local Government, Terseer Benga, confirmed this to newsmen.\nBenga said that the attackers invaded the victims’ farmlands with their cows, killed the farmers and took away some women, while the whereabouts of others remained unknown.\nThe media aide said: “The invasion by the herders took place between 3p.m.\non Wednesday in Anyom, a Kastina-Ala community, which borders Taraba State."
  },
  {
    "headline": "Herders kill six in Benue community, abduct women",
    "summarized_story": "Six people were killed by armed herdsmen in Wednesday afternoon’s attack on Anyom community of Mbatyula Council Ward in Katsina-Ala Local Government Area of Benue State.\nMedia aide to the Chairman of Katsina Ala Local Government, Terseer Benga, confirmed this to newsmen.\nBenga said that the attackers invaded the victims’ farmlands with their cows, killed the farmers and took away some women, while the whereabouts of others remained unknown.\nThe media aide said: “The invasion by the herders took place between 3p.m.\non Wednesday in Anyom, a Kastina-Ala community, which borders Taraba State."
  },
  {
    "headline": "Reps urge FG: Rescue abducted Niger Islamiyya students now",
    "summarized_story": "The House of Representatives has called on the Federal Government to collaborate with the Niger State Government to secure the rescue of over 130 students of Islamiyyah students of Salihu Tanko Islamic School Tegina in Rafi Local Government Area of the state abducted on May 30, 2021.\nThe call was sequel to a motion unanimously adopted by the lawmakers at the plenary on Thursday, which was sponsored by members from the state.\nThe Niger lawmakers decried that two weeks after the abduction, the children were still in captivity.\nThe aftermath is an aggravation of food insecurity and threats to the peaceful co-existence and socio-economic stability of the country.\n“No fewer than 50 communities across Munya and Shiroro Local Government Areas of Niger State were sacked and over 3,000 people were displaced from their ancestral homes to seek refuge in IDPs Camps recently."
  },
  {
    "headline": "Reps urge FG: Rescue abducted Niger Islamiyya students now",
    "summarized_story": "The House of Representatives has called on the Federal Government to collaborate with the Niger State Government to secure the rescue of over 130 students of Islamiyyah students of Salihu Tanko Islamic School Tegina in Rafi Local Government Area of the state abducted on May 30, 2021.\nThe call was sequel to a motion unanimously adopted by the lawmakers at the plenary on Thursday, which was sponsored by members from the state.\nThe Niger lawmakers decried that two weeks after the abduction, the children were still in captivity.\nThe aftermath is an aggravation of food insecurity and threats to the peaceful co-existence and socio-economic stability of the country.\n“No fewer than 50 communities across Munya and Shiroro Local Government Areas of Niger State were sacked and over 3,000 people were displaced from their ancestral homes to seek refuge in IDPs Camps recently."
  },
  {
    "headline": "Femi Adesina: Nigerians lack honour, rejoice at iniquity, evil",
    "summarized_story": "According to the presidential aide, many Nigerians are not like Ayade who saw character, honour, commitment, selflessness, transparency in President Muhammadu Buhari.\nAdesina added that Ayade joined APC because of his love for Nigeria.\nAccording to Adesina, Nigerians celebrate when terrorrists kill soldiers, when students are being kidnapped but keep mute when the economy makes a gain.\nThey rejoice at iniquity, at evil, and they think somebody is being done in, not knowing that the land is the ultimate loser.\n“I’m starting with the man in the mirror, I’m asking him to change his ways.”Yes, Nigerians are the men in the mirror."
  },
  {
    "headline": "Nigeria shops for new lenders for Ibadan-Kano rail, dumps China offer",
    "summarized_story": "The Federal Government is shopping for new loans to finance its Ibadan-Kano rail project which will cost about $11 billion.\nUnlike Buhari, he said government is shopping for funds for two rail line projects expected to cost about $14.4 billion.\nIncluded is the Port Harcourt-Maiduguri narrow gauge line, which has been awarded to CCECC at a cost of $3billion.\nFinance Minister Zainab Ahmed is overseeing the talks with the emerging markets-focused financial institution about arranging the infrastructure loans,’’ Amaechi said.\nIn March, Amaechi disclosed that Nigeria borrowed about $2.5billion from China-Exim Bank for the Lagos-Ibadan rail."
  },
  {
    "headline": "Army appoints Musa head of Operation Hadin Kai, top officers shuffled",
    "summarized_story": "The Nigerian Army has announced Maj.-Gen. Chris Musa, as the new Theatre Commander of Operation HADIN KAI (OPHK), the counter-terrorism operation in the North East.\nYerima said that Maj.-Gen. Musa was redeployed from Nigerian Army Resource Centre while Maj.-Gen. F.O.\nAiyenigba was redeployed from Defence Headquarters to Nigerian Army Corps of Military Police as Provost Marshal (Army), while Maj.-Gen. I.M.\nA.M. Umar from Army War College Nigeria moves to Office of the Chief of Army Staff and appointed Chief of Staff to the Chief of Army Staff.\n“The Chief of Army Staff, Maj.-Gen. Faruk Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "APC: Buhari’s mention of Lagos not reference to Tinubu, says Presidency",
    "summarized_story": "President Muhammadu Buhari’s reference to Lagos while speaking on the future of the All Progressives Congress (APC) has nothing to do with party stalwart Asiwaju Bola Tinubu, the Presidency said last night.\nYou cannot sit there in Lagos, for instance, and decide on the fate of APC on zoning.\n“The mention he made of Lagos was not a reference to the respected party leader, Senator Bola Tinubu, as the opposition party’s predatory designs would put it in order to damage the excellent relationship between the two of them.\n“The President, the Asiwaju and the rapidly growing members of the party, want a dynastic succession of elected leaders.\n“The APC should not be distracted from its progress as a democratic party.”"
  },
  {
    "headline": "Democracy Day: Nigerian Govt Declares Monday Public Holiday",
    "summarized_story": "To commemorate this year’s Democracy Day, the Nigerian government has announced Monday, June 14 as a national holiday.\n‘FG declares Monday, June 14, 2021, as a public holiday to commemorate this year’s Democracy Day celebrations,’ read the announcement.\nThe minister also asked Nigerians to back the current administration’s efforts to keep the country unified and wealthy.\n“As we mark another Democracy Day in the history of our dear country, let us reflect on the efforts of our founding fathers and ensure that Nigeria remains one united and indivisible entity.\n“No development can take place in an acrimonious environment,“ the statement read in part."
  },
  {
    "headline": "NBA Demands Justice Over EFCC’s Alleged Attack On Colleague",
    "summarized_story": "The Abuja chapter of the Nigerian Bar Association (NBA) has said it will continue to stand in unity against any brutality until “normalcy is restored in the country and Nigerians lawyers and indeed citizens are treated with utmost respect.”The association said this in a statement made available to Newsmen on Wednesday.\nIt expressed dismay over the inhuman treatment meted out on the Chairman, Makurdi branch of the NBA, Justin Gbagir, by men of the Economic and Financial Crime Commission (EFCC).\nThe association also called for the immediate orientation of all law enforcement agencies in Nigeria on rules of engagement within citizens.\nAccording to them “the canker warm bath steadily eats deep into the fabric of our dear nation has constantly been that of police brutality.\nHowever, presently, the efcc brutality is gradually becoming a thing of grave concern.”"
  },
  {
    "headline": "Buhari Claims Fulani Herders With AK-47s Are Not Nigerians",
    "summarized_story": "President Muhammadu Buhari has alleged that Fulani herders attacking farmers with sophisticated firearms such as AK-47 rifles are not Nigerians.\nBuhari said the Nigerian Fulani herders only carry sticks and machetes to harvest herbs for their cattle in an interview with Arise TV on Thursday.\n“The Nigerian cattle rearers do not carry anything more than a stick.\nSometimes they carry machetes to just cut some herbs for the cattle,” he said.\n“From the Saharan area, people run to Nigeria and Fulani from Kenya and other Central Africa look the same so when you see them you think they are Nigerian Fulani."
  },
  {
    "headline": "BUHARI at Arise TV: We’ll return to First Republic’s open grazing practice",
    "summarized_story": "President Muhammadu Buhari has approved the country’s return to open grazing as obtained during the First Republic where herdsmen used designated grazing routes to move their cattle to all parts of the country.\nHe said the grazing routes were designated in the 1st Republic when “Nigerians used to obey laws.”Buhari was reacting to a question on the decision by 17 southern governors to ban open grazing.\nThere were cattle routes and grazing areas.\nCattle routes were for when they (herdsmen) are moving up country, north to south or east to west, they had to go through there.\nThere are Kanuris, there are Hausas, there are Fulanis in Niger Republic just as there are Yorubas in Benin."
  },
  {
    "headline": "Insecurity: Nigeria faces looming food crisis – El-Rufai",
    "summarized_story": "Governor Nasir el-Rufai of Kaduna state has urged security agencies to engage in interagency synergy and collaboration to address the spate of insecurity in Nigeria, if the country is to avoid a looming food crisis.\nAccording to the governor, there is immense security challenges across the Northwest states, which have led to devastation of rural economy, displacement of farmers from their communities, loss of lives and properties and travel challenge.\n“Addressing this grave problem and restoring order require that security managers and intelligence agencies constantly share information and experiences.\n“This is an urgent priority, in the face of the looming food crisis that we face if our farmers do not go to the farms.\nThat the criminal gangs have become more daring and dangerous since recovering from their near defeat in 2015 is obvious across the country."
  },
  {
    "headline": "Pictures: President Buhari commissions Lagos-Ibadan standard guage rail project in Lagos",
    "summarized_story": ""
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "Show empathy to IDPs, Lawan charges Nigerian leaders -NigPilot",
    "summarized_story": "The Senate delegation during the visit donated food items and other materials worth N10 million to the IDPs.\nLawan said: “This is an Internally Displaced Persons Camp.\nNone of our sisters and brothers in this camp wanted to be here or wish to be here.\n“That is to say, there must be sufficient security presence here and, indeed, across the country to protect them.\nLawan disclosed that the National Assembly has been working closely with the executive arm of government to provide more resources to the armed forces and security agencies in the fight against insecurity."
  },
  {
    "headline": "Army appoints new Spokesperson, Theatre Commander -NigPilot",
    "summarized_story": "The Nigerian Army has appointed Brigadier General Onyema Nwachukwu as the new Spokesperson of the Service.\nHe equally served as the Deputy Director Public Relations, Headquarters Theatre Command Operation Lafiya Dole, now Operation Hadin Kai.\nDescribed as a seasoned and trained Public Relations Officer, the new Image Maker of the Nigerian Army is an alumnus of the University of Ibadan and a member of the Nigerian Institute of Public Relations.\nThe new Army Spokesperson has equally served in various Units and Commands within and outside the Nigerian Army.\nGen. Nwachukwu before now served as Assistant Director Defence Information (NA), at the DHQ, Chief of Staff Headquarters, Directorate of Army Public Relations and Public Relations Officer of Nigeria Defence Academy."
  },
  {
    "headline": "Idumuje crises: Asia denies purported voice notes with Azuka Jebose -NigPilot",
    "summarized_story": "Onicha Ugbo indigene, Eze Asia has disowned a purported voice conversation with Azuka Jebose on Idumuje Ugboko crisis.\n“The recorded voice sent to social media and everywhere, I was not the one who recorded it.\nAzuka Jebose did it, because the first time I traveled down here (Turkey) was after three days he called me on phone.\nHow do you think they will kill an Onicha Ugbo man when I am working with Hon.\nThat if not for the man Ned Nwoko I would have been a dead man by now."
  },
  {
    "headline": "Respect Citizens’ Right And Reverse Suspension Of Twitter, US Tells FG",
    "summarized_story": "The US has called on the Nigerian government to respect the rights of its citizens to freely express themselves by reversing its suspension of Twitter’s operations in the West African country.\n“Unduly restricting the ability of Nigerians to report, gather, and disseminate opinions and information has no place in a democracy.\n“The United States condemns the ongoing suspension of Twitter by the Nigerian government and subsequent threats to arrest and prosecute Nigerians who use Twitter,” it said.\nInformation and Culture Minister Lai Mohammed who is a leading figure in Nigeria’s battle with the US-based technology firm on Wednesday maintained that social media platforms will be regulated in the country.\nHe explained that all social media platforms must be registered before doing business in Africa’s most populous nation."
  },
  {
    "headline": "Buhari Returns To Abuja After One-Day Visit To Lagos",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja after a one-day working visit to the country’s commercial hub, Lagos.\n“President Muhammadu Buhari has returned to Abuja after a one-day working visit to Lagos State,” his personal assistant on new media, Bashir Ahmad wrote on his Facebook page.\nThe 78-year-old Nigerian leader visited Lagos to commission some projects including the 157-kilometre Lagos-Ibadan standard rail project at the Mobolaji Johnson railway station in Ebutte Metta.\nA PriorityDuring the event held at the Mobolaji Johnson Railway Station, Buhari reiterated that his administration will continue to prioritise the railway system.\nDuring the visit, Buhari also commissioned the Integrated National Security and Waterways Protection Infrastructure, otherwise known as the Deep Blue Project."
  },
  {
    "headline": "Again, Buhari Restates Order For Security Operatives To Shoot Anyone Wielding AK-47",
    "summarized_story": "﻿President Muhammadu Buhari Thursday in Lagos reiterated that his directive to security agencies, to shoot any person or persons found illegally wielding AK-47s and other assault weapons, remains in place.\nDespite the many challenges we are facing, I want Nigerians to rest assured that we will secure this country.\n‘‘I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund.\nPresident Buhari declared that no Federal government since 1999 has been as committed as his administration in reforming and repositioning the Nigeria Police Force and national policing architecture.\n‘‘In September 2020, I assented to the Bill amending the Nigeria Police Act, which was originally enacted in 1943."
  },
  {
    "headline": "FG Declares June 14 Public Holiday To Mark Democracy Day",
    "summarized_story": "The Federal Government has declared Monday, June 14 as a public holiday to mark this year’s Democracy Day celebration.\nThe Minister of Interior, Rauf Aregbesola made the announcement in a statement on behalf of the Federal Government.\nHe congratulated Nigerians on the occasion and urged all citizens to support the present administration in its efforts at ensuring a united and prosperous nation.\n“As we mark another Democracy Day in the history of our dear country, let us reflect on the efforts of our founding fathers and ensure that Nigeria remains one united and indivisible entity.\nThe minister wished all Nigerians a Happy Democracy Day celebration, saying “there will surely be light at the end of the tunnel.”"
  },
  {
    "headline": "Army Releases New Postings, Appointments Of Senior Officers",
    "summarized_story": "There’s been a major shake-up in the Nigerian Army following the new postings and appointments of senior officers.\nThe Nigerian Army released the list of the appointees in a statement signed on Thursday, by the Director Army Public Relations, Brigadier General, MM Yerima.\nThis, according to the statement is in line with the vision of the Chief of Army Staff to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nThe shake-up comes days after President Muhammadu Buhari appointed Major-General Farouk Yahaya as the new Chief of Army Staff following the death of Lieutenant-General Ibrahim Attahiru.\nGeneral Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "Ondo doctors begin two-week warning strike",
    "summarized_story": "Doctors in Ondo State under the aegis of the National Association of Government General Medical and Dental Practitioners began on a two-week warning strike on Thursday.\nSpecifically, the doctors alleged that the government has failed to pay their salary arrears for some months.\nThe doctors also alleged that the state government failed to resolve the issue of exodus of doctors and other health workers among other issues.\nThe association in a letter sent to the state government, complained about poor welfare of its members.\nAdvertisementThe letter was signed by the chairman and secretary of the association, Dr Roland Arohunmolase and Dr Richard Obe, respectively."
  },
  {
    "headline": "Igangan Attack: Oyo South Senator visits Community, demands adoption of state policing",
    "summarized_story": "Senator representing Oyo South, Kola Balogun has called for full equipping of local security outfits with arms to defeat insecurity in the state.\nThe lawmaker made this call while speaking with residents of the Igangan Community.\nSenator Balogun who also demanded the adoption of state policing in the country said that is the only way through which crisis and other criminal activities can be defeated in the country.\nHe added that this would also allow security agencies respond swiftly to crisis in their various jurisdictions.\nThe Asigangan of Igangan land, Oba Adewuyi Olaoye called on relevant authorities to come to their aid as they can no longer sleep with their two eyes closed."
  },
  {
    "headline": "Ondo partners firm, commences N5.5B LPG Inland terminal",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has performed the groundbreaking of the first privately owned Inland Terminal LPG Storage Facility in the country.\nThe facility sited within the Ore Industrial Hub by Alles Charis will gulp over #5.5Billion with over 300 jobs to be created initially.\nWhen the first phase is completed within the last quarter of 2021, over 2000Metric Tonnes of Liquefied Petroleum Gas ( LPG) will be produced.\nAdvertisementWhile calling on all other genuine investors to come over to do business in the Sunshine State, Governor Akeredolu stated categorically that the three industrial hubs established by his administration will turn around the economy of the state.\nAlso speaking on the Red Gold Project of the state designed to revolutionise the Oil Palm sector, the Governor said the dwindling economy of the country predicated upon the monolithic nature of its earnings has made diversification inevitableGovernor Akeredolu used the occasion to highlight the various value chains of Oil Palm to include both domestic consumption and industrial uses."
  },
  {
    "headline": "Buhari Blames Nigerian Elite for Allowing Secessionists Have a Voice",
    "summarized_story": "Nigerian President Muhammadu Buhari is disappointed in the elite who he says allows “ignorant people talk anyhow”.\nIn an exclusive interview with ARISE NEWS, Buhari said those pushing for their own republic haven’t thought it through, including how national assets will be shared.\nWatch the video for more…"
  },
  {
    "headline": "‘Language They Understand’: Buhari Charges Security Forces to Be Ruthless with Bandits Ravaging Northwest Nigeria",
    "summarized_story": "Nigeria’s President Muhammadu Buhari spoke exclusively to ARISE NEWS in the first interview he has granted since beginning his second term in office more than two years ago.\nHe spoke on a wide range of issues, including the worrying security situation in the country.\nAccording to him, the northwestern part is his biggest concern, because of killings going on among people of the same culture.\nPresident Buhari however revealed that he’s given the police and military the power to be ruthless with those behind the insecurity in the region."
  },
  {
    "headline": "‘I Have Not Abandoned My Farm, I Still Have Cattle’: Buhari Reveals Retirement Plans. But Before Then…",
    "summarized_story": "During an exclusive interview with ARISE NEWS, Nigeria President Muhammadu Buhari gave a sneak peek into what he plans on doing after he leaves office in 2023.\nHe didn’t reveal any grand plans.\nRather he would like to retire to his farm.\nHowever, he still has two years to go.\nListen to what he would like to achieve before then."
  },
  {
    "headline": "‘Go Back, Sort Out Yourselves’: Buhari Tells Southwest Governors to Handle Killer Herdsmen, Despite No State Police",
    "summarized_story": "During an exclusive interview with ARISE NEWS, Nigeria’s President Muhammadu Buhari revealed how he put the responsibility of security in the states squarely on the shoulders of governors, despite no legal backing for state policing.\nBuhari believes engagement at the local level as was done in the past when “monthly or quarterly meetings” were held between herders, traders and traditional rulers will suffice in tackling criminality.\nThe governors should quit looking to the federal government for help since they wanted the job so bad, he quipped."
  },
  {
    "headline": "CAR PM Announces Resignation on Twitter",
    "summarized_story": "Firmin Ngrebada, the prime minister of the Central African Republic (CAR), has announced on Twitter that he and his government have resigned.\nA presidential spokesperson, Albert Yaloke Mokpeme, told the AFP news agency that the prime minister might be asked to stay in the role and form a new government.\nEarlier this week, France suspended budgetary aid and military cooperation with the CAR government.\nCAR has been unstable for decades but was plunged into serious turmoil in 2013 when predominately Muslim rebels seized power and Christian militias rose to counter them.\nDespite an UN-backed transition, there have recently been clashes between a coalition of fighters and the army, which is supported by the UN and Russian military companies."
  }
]