[
  {
    "headline": "Agro-mechanisation will boost food security, says Sanwo-Olu",
    "summarized_story": "The Lagos State Governor, Babajide Sanwo-Olu, has said the ‘Eko Agro Mechanisation Programme’ of the state government will boost food security in the state.\nA statement on Sunday said Sanwo-Olu said this during the grand finale of the 2021 World Food Day celebration in Lagos.\nHe said, “The mechanisation programme is tagged, ‘Eko Agro Mechanisation Programme,’ with the procurement of 14 brand new tractors and ancillary equipment for farmers in the state.\n“It is worth mentioning that this programme is expected to impact about 15,000 households, make significant contributions to the state food basket and create not less than 25,000 jobs,” he said.\nThe Commissioner for Agriculture, Ms Abisola Olusanya who was represented by the Director, Agricultural Services, Mrs Abiola Ayoade, noted that the World Food Day was to sensitise people to the importance of food security and access to nutrition."
  },
  {
    "headline": "20,000 women benefit from Arise skill acquisition",
    "summarized_story": "Arise, a non-governmental organisation, has said its skills acquisition and empowerment programmes have economically empowered thousands of women.\nIluyomade said, “Arise has empowered over 20,000 women, lending a hand to people living in extreme poverty.\nWe have provided skill acquisition and empowerment for women by sending them to learn leather works, millinery, soap, pomade and insecticide making, bead making and event planning.\n“At the end of their training, Arise supported these women with modest financial resources and equipment.”The convener of the humanitarian organisation added that there are plans in place to build Arise village for women to access skill acquisition and health care.\n“Another milestone we hope to achieve is the proposed building of Arise village in Lagos State."
  },
  {
    "headline": "Buhari mourns Sheikh Gumi’s widow",
    "summarized_story": "By Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari has extended heartfelt condolences to the family of the late Muslim scholar, Sheikh Abubakar Mahmud Gumi over the death of his widow and matriarch of the family, Hajiya Aminatu Bintu Gumi.\nA statement by the Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu said in a message to the family in Kaduna delivered by the Minister of Agriculture and Rural Development, Dr. Mahmud Mohammed, President Buhari recalled the late Aminatu’s simplicity and warmth and described her demise as “indeed very touching.”“I am deeply saddened to learn about the demise of your mother.\nMy heartfelt condolences are with you in this intense hour of grief,” the President said to the step children, General Abdulkadir Gumi (rtd), the Kaduna – based cleric Dr Ahmed Abubakar Gumi and the other children.\nHe prayed to Allah to grant them strength and fortitude to bear the loss."
  },
  {
    "headline": "Anambra Govt consoles Ihiala people over market fire",
    "summarized_story": "…Pledges to help build a Standard MarketThe Anambra State Government has consoled Ihiala people over the fire which destroyed their major market this afternoon, promising to lead the mobilization of the people in planning, designing and building a modern market in the town.\nThe fire, noted the governor, claimed not just buildings and market stalls but also vital goods and perhaps even raw cash.\nChief Obiano described a standard market well planned with sanitary facilities, an efficient fire service and state of the art electricity as a “desideratum”.\nHe announced that the state government would work with the Ihiala Progress Union, the Igwe in Council, the Ihiala Local Government, prominent people from the town and other stakeholders like the traders union and the Anambra State Ministry of Trade and Commerce to provide a befitting market.\nHe asked some other communities to learn from Ihiala youth and cooperate with firefighters rather than block their work."
  },
  {
    "headline": "Plateau APC: Bature emerges chairman, as Dabang keeps mum",
    "summarized_story": "By Marie-Therese NanlongThe immediate past Secretary of the Plateau State Government, Rufus Bature has emerged the new State Chairman of the All Progressives Congress, APC following a State Congress of the Party held on Saturday in Jos.\nWhen contacted for comment on the exercise, Dabang said, “I was not involved so I will have anything to say.\nI will not know that people are not happy because nobody has reported anything to me.\nI am not even on ground for the past three days I am not even in Jos so I don’t know what is going on there.\nSince my suspension, I have not been involved in any Party activities, they have not called me and I have respected myself and keep my distance.”Vanguard News Nigeria"
  },
  {
    "headline": "PDP reign in Delta’ll expire in 2023 — Omo-Agege vows",
    "summarized_story": "…receives over 5,000 decampees into APCBy Festus Ahon & Ochuko Akuopha, UGHELLIDEPUTY President of the Nigerian Senate, Senator Ovie Omo-Agege, Sunday, said the reign of the ruling Peoples Democratic Party, PDP in Delta State would end in 2023.\nInsisting that the terminal date for the PDP in the state is already very near, he said; “although 2023 is still far Omo-Agege is coming.\nThings that our party, the party we worked for, the party we delivered cannot do for us he has done for us.\nAt the Ughelli urban, Mr David Okorare who spoke on behalf of the decampees, spoke in the same vein, adding that they were proud of the leadership style of Senator Ovie Omo-Agege.\nOkorare said their decision to dump their former political party was stemmed from the purposeful representation and leadership of the Deputy President of the Senate, Senator Ovie Omo-Agege."
  },
  {
    "headline": "Police rescue kidnapped twin children of traditional ruler, 3 domestic staff in Kwara",
    "summarized_story": "The Police Command in Kwara has rescued the kidnapped twin girls and three domestic staff of Oba Samuel Adelodun, the Owalobo of Obbo Ayegunle, in Ekiti Local Government area of the State.\nThe Police Public Relations Officer, SP Okasanmi Ajayi, disclosed this on Sunday in Ilorin.\nHe added that the victims were thereafter rescued unhurt, medically examined, found healthy and handed over to their families.\n“Command is pleased to inform the members of the Public of the successful search and rescue operations conducted in the kidnap incidents involving the twins and three domestic staff on October 14, 2021.\nHe assured the citizens and residents of uninterrupted security and safety of their lives and property at all times."
  },
  {
    "headline": "Ex-federal lawmaker, Acho Obioma emerges APC chairman in Abia",
    "summarized_story": "Hon Acho Obioma, former member of the House of Representatives, has emerged as the chairman of the All Progressives Congress (APC), in Abia State.\nIn a keenly contested congress participated by mammoth of party leaders and members held at Umuahia Township Stadium, the chairman of APC congress Committee, Rt.\nSpeaking shortly after the announcement of the results, Aliu Ugbanne, a national officer from the APC National Secretariat, Abuja, affirmed the declaration of Hon Acho Obioma, as duly elected chairman of the party in Abia state.\nIn his acceptance speech, the new Abia Chairman of the All Progressive Congress (APC), and ex-federal lawmaker, Hon Acho Obioma, appreciated the leaders, members and mammoth supporters in the state for the confidence reposed in him, promising not to disappoint them.\nHis words, “APC will rejoice more when they win the forces in the state and committed himself to the progress of the party, assuring that APC will take Abia State government come 2023”."
  },
  {
    "headline": "Insecurity: Sokoto flags off registration of motorcycles, tricycles operators",
    "summarized_story": "The Sokoto State Government on Sunday, flagged off the registration and verification of motorcycles and tricycle riders across the state.\nIn a statement, the Special Adviser to the Governor on Special Duties, Alhaji Saidu Gumburawa, said the registration is to ensure the safety and security of members of the riders association and the passengers.\nAccording to him, the registration became necessary due to the security situation in the state.\nThe statement further said the contribution of the Amalgamated Motorcycle and Tricycle Riders Association to the socio-economic development of Sokoto State is enormous, and therefore, there is a need for them to support policies and programmes of government.\nIt called on the members to ensure they register and collect their identification cards to avoid any unpleasant situation."
  },
  {
    "headline": "Supreme Court affirms appointment of Imo first female chief judge",
    "summarized_story": "The Supreme Court has affirmed the appointment of Justice Ijeoma Aguguo as Chief Judge of Imo State.\nJustice Brown against the National Judicial Council (NJC), challenging the appointment of Justice Aguguo.\nThe court discovered the supposed Justice Brown was a fictitious name used to institute the suit and struck it out.\nAgugua, being the highest ranking Judge in the state Judiciary was repeatedly denied the post of Chief Judge until Governor Hope Uzodimma announced her nomination after the retirement of Justice Paschal Nnadi in March 2020.\nThere had been stiff opposition to Agugua’s appointment hence she has been in acting capacity for over a year."
  },
  {
    "headline": "‘Its sacrifice’ – Joe Igbokwe reveals why his house was burnt down",
    "summarized_story": "Joe Igbokwe, a chieftain of the All Progressives Congress, APC, has disclosed the reason for the latest attack on his house in Anambra State.\nIgbokwe said the burning of his house was part of his sacrifice for speaking against violence in the Southeast.\nHe also disclosed that his house was burnt in an attempt to gag him.\nThe APC Stewart, who is based in Lagos State alleged that the Indigenous People of Biafra, IPOB carried out the action.\n“And I said, if that is going to be the sacrifice I’m going to pay for things to be okay, then let it be.”"
  },
  {
    "headline": "2023 presidency: Northern youths begin 20 million vote mobilization for Osinbajo",
    "summarized_story": "A coalition of Northern Youth has launched awareness campaign to galvanise support for Vice President Professor Yemi Osinbajo ahead of 2023 presidential election in Kano.\nThe coordinator reminded that Professor Osinbajo has demonstrated competence and loyalty to manage the complex entity like Nigeria, cited how he diligently stabilized the nation’s economy while holding brief for president Muhammadu Buhari.\nBesides the mobilization program, Haruna disclosed that the group will soon start collecting public opinion and data towards setting grassroots-oriented public agenda for the 2023 Osinbajo presidential ambition.\n“We are launching the awareness campaign across the Northern states to mobilize support for Vice President Professor Yemi Osinbajo towards making him our next president.\nHaruna asserted that APC should rather consider power shift to the South if the party truly believes in sustaining a very united federation."
  },
  {
    "headline": "11 die in Kwara road accident",
    "summarized_story": "Eleven persons on Sunday died in a road crash in Kwara.\nThe accident, which happened about 4pm along Jebba-Bode-Saadu Road, involved two vehicles, it was learnt.\n- Advertisement -Read Also: Seven die in Ebonyi road accident- Advertisement -The vehicles involved were a Corolla Salon private car and Toyota Hiace commercial bus.\n- Advertisement -Sector Command of the Federal Road Safety Corps (FRSC) Jonathan Owoade confirmed the incident.\n- Advertisement -He added the injured were recuperating in two private hospitals in Jebba, Moro local government area of the state."
  },
  {
    "headline": "We didn’t pay N20m to bandits to recover seized weapons, says NAF",
    "summarized_story": "The Nigerian Air Force (NAF) has denied paying N20 mllion to bandits in exchange for anti-aircraft gun seized from its personnel by the insurgents.\nIt said the viral report was false and intended to soil its image.\n“The report also stated that the reason for the payment was to retrieve the anti-aircraft gun which, it alleged, the NAF feared could be used against aircraft operating within Katsina State.\nSimilar successes were recorded at Fakai Dutsin Anfare, an area in Jibia Local Government Area, known for its high incidents of bandits’ activities.\n“The public is enjoined to disregard the falsehood emanating from some sections of the social and mainstream media."
  },
  {
    "headline": "Buhari’s wife urges Nigerians to take action against cancer",
    "summarized_story": "Wife of the President, Mrs. Aisha Buhari, has urged Nigerians to take action against cancer.\nMrs. Buhari spoke at the annual five-kilometre “Walk Away Cancer” organised by Medicaid Cancer Foundation (MCF) at the weekend in Abuja.\n- Advertisement -“Cancer screening is for people without symptoms.\nKebbi State Governor Abubakar Bagudu said for over the years, Medicaid Cancer Foundation had championed cancer awareness across the country.\n- Advertisement -He said his wife and founder of Medicaid Cancer Foundation had advocated the inclusion of cancer treatment in the National Health Insurance Scheme (NHIS)."
  },
  {
    "headline": "NNPC remains transparent, accountable, says Kyari",
    "summarized_story": "Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Malam Mele Kyari, has promised that the corporation will remain transparent and accountable to Nigerians.\n- Advertisement -NNPC Group General Manager, Group Public Affairs Division, Malam Garba Deen Muhammad, announced Kyari’s award in a statement yesterday in Abuja.\nThe statement said those at the ceremony included a former Secretary to the Government of the Federation (SGF), Ambassador Babagana Kingibe; Kano State Governor Abdullahi Umar Ganduje; Ondo State Governor Rotimi Akeredolu; Edo State Governor Godwin Obaseki; former Abia State Governor Orji Uzor Kalu; captains of industries and seasoned public servants.\n- Advertisement -- Advertisement -Ukeh said: “Take Mele Kyari and dissect.\nIt was trailblasing and a whiff of good fortune in a beleaguered entity and time.”Responding, Kyari said the NNPC remained committed to conducting its operations with transparency and accountability."
  },
  {
    "headline": "KALU HAILS OONI OF IFE, OBA ADEYEYE OGUNWUSI AT 47",
    "summarized_story": "Former Governor of Abia state and Chief Whip of the Senate, Dr Orji Kalu has felicitated with the Ooni of Ife, Oba Adeyeye Ogunwusi on the occasion of his 47th birthday anniversary.\nKalu, who admonished the Ooni of Ife not to relent in his efforts to advance the cause of the people, added that traditional rulers play key roles in promoting unity and harmony across the country.\nHe said, ” on behalf of the people of Abia North Senatorial, I convey my best wishes to the Ooni of Ife, Oba Adeyeye Ogunwusi on the occasion of his 47th birthday anniversary.\n“The Ooni of Ife is a role model to his contemporaries and the younger generation owing to his contributions to humanity.\n“As the paramount ruler marks his 47th birthday anniversary, I wish the Ooni of Ife longer reign on the stool of his forefathers”."
  },
  {
    "headline": "At The Sun Awards: Nigeria’s unity negotiable –Kingibe",
    "summarized_story": "The ceremony is indisputably adjudged the biggest media event in Nigeria.\nGovernors, state and federal legislators, politicians across parties, captains of industry, business moguls, and academics, among others, were in attendance.\nThe night was not only restricted to speeches, handing out awards and honours to those who deserved them.\nWhile the seated guests were waiting for the event to officially begin, the Shuga Band crew sang their hearts out.\nBabagana Kingibe, former SGF (Lifetime Achievement); Chief Frank Okafor, chairman of Marco Polo Group Limited and Prince Chris Igwe, chairman, Mainland Oil Limited (Investor of the Year)."
  },
  {
    "headline": "Sun Awards: We’re building for present, future generations –Wike, Man of the year",
    "summarized_story": "Neya Kalu, who represented her father, Senator Orji Uzor Kalu, commended the awardees for being singled out among millions of Nigerians for the award, saying it was a great feat.\nThe Sun Entrepreneur of the Year award winner, Nnamdi Ezeigbo, in his response, expressed gratitude to The Sun Management for the recognition.\nIn his acceptance speech, the Sun Hospitality Icon of the Year, Chief Obi Iyiegbu, popularly called Obi Cubana, expressed gratitude to God for placing him where he stands today.\nAlso, The Sun Entrepreneur of the Year award winner, Nnamdi Ezeigbo, in his response, expressed gratitude to The Sun Management for the recognition.\nIn his acceptance speech, the Sun Hospitality Icon of the Year, Chief Obi Iyiegbu, popularly called Obi Cubana, expressed gratitude to God for placing him where he stands today."
  },
  {
    "headline": "PDP presidential ticket: Governors, Atiku, others in final battle",
    "summarized_story": "All the gladiators have their eyes on the 2023 PDP presidential ticket.\nAtiku, Saraki, Aminu Tambuwal (Sokoto State governor), Ifeanyi Okowa ( Delta State governor), Nyesom Wike (Rivers State governor) and Bala Mohammed (Bauchi State governor), respectively are touted to be interested in the 2023 PDP presidential ticket.\nThe recent zoning formula for party offices was a fallout of the meeting of the PDP Governors Forum held in September.\nUncertainty over zoning of presidential ticketRegardless, with the national chairmanship position seemingly settled, attention has now shifted to the zoning of the presidential ticket.\nOrdinarily, with the PDP chairmanship position going to the North, the presidential candidate should automatically come from the South."
  },
  {
    "headline": "I’ve no regrets on how my tenure ended as Rivers governor – Celestine Omehia",
    "summarized_story": "Those issues that made you to vie for governor, have they been addressed by Amaechi and Governor Nyesom Wike?\nDo you have any regret not completing your tenure as governor of Rivers State?\nI have said I have no regrets on how my tenure ended and I am eternally grateful to God and the good people of Rivers State who gave me that opportunity to serve.\nWhat method did you deploy to tackle insecurity during your stint in Rivers State that you think the Federal Government can emulate?\nThis method brought in the needed peace and economic growth in Rivers State, Niger Delta and Nigeria as a whole."
  },
  {
    "headline": "In a Dramatic Shift, Kingibe Says Nigeria’s Unity Negotiable",
    "summarized_story": "Speaking yesterday at The Sun Newspaper Awards for 2020 held in Lagos, Kingibe however said even the union between a husband and wife is negotiable.\nKingibe, who received the newspaper’s ‘Lifetime Achievement Award,’ called on Nigerians to learn to respect one another.\n“However, I think that a few of my colleagues believe that the unity of Nigeria is not negotiable.\nSpeaking specifically on the issue of those agitating to leave the country, Kingibe said: “When we ever say we want to go away, I do not think they realise the going away.\nTambuwal stated this when the Chairman of the Christian Association of Nigeria (CAN), Rev."
  },
  {
    "headline": "Crisis Hits APC Congresses in Lagos, Abia, Akwa Ibom, Niger, Enugu, Kwara, Others",
    "summarized_story": "In Lagos State, the APC held three parallel congresses across the state.\nThe State Congress by loyalists of Chief Ikechi Emenike was organised at the Indoor Sports Hall of Umuahia Township Stadium.\nAt the congress held in Owerri, the state capital, Uzodimma’s aide and long-time loyalist, Macdonald Ebere emerged as the state chairman.\nIn Kano State, Governor Abdullahi Umar Ganduje has declared that only the congress held at Sani Abacha Stadium was legal.\nMr. Emeka Beke emerged as the Chairman of Rivers State APC, according to the results announced by the Chairman, Rivers APC Congress Screening Committee, Dr. Abubakar Idris."
  },
  {
    "headline": "Terror Attacks: UK Warns Citizens against Travelling to 12 Nigerian States",
    "summarized_story": "Ejiofor AlikeThe United Kingdom government has warned its citizens in Nigeria against visiting 12 states in the country over possible terror attacks.\nIt also cautioned UK citizens against travelling to the non-riverine areas of Delta, Bayelsa and Rivers states.\n“There may be protests and a heightened security presence in major cities such as Lagos and Abuja.\nThere may be additional protests and a heightened security presence in Abuja and in the South-east for this reason.\nProtests, including “Stay at Home” protests, are likely during October in the South-east region."
  },
  {
    "headline": "500,000 People at Risk of Starvation in North-east, Says UN",
    "summarized_story": "The region has been a mainstay of insurgency attacks for over a decade and the situation has been worsened by the impact of the COVID-19 pandemic and rising high food prices, the WFP said.\nThe UN agency also said the number of internally displaced persons surpassed two million in September.\nHe added that the number of internally displaced surpassed two million in September 2021, reaching another grim milestone.\n“Our food assistance is a lifeline for millions whose lives have been upended by conflict and have almost nothing to survive on.\n“To sustain humanitarian operations in the North-east Nigeria until March 2022, WFP urgently requires $197 million.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Pressure Mounts on Secondus to Withdraw Court Case over PDP Chairmanship",
    "summarized_story": "The High Court of Rivers State sitting in Degema had suspended Secondus as national chairman, but the suspension was set aside by a Kebbi State High Court.\nIn the last sitting of the Court of Appeal, the court in a dramatic manner announced the transfer of the Secondus’ appeal to Port Harcourt, stating that it was where the substantive suit originated.\nThe South-west PDP stakeholders have asked the National Vice Chairman, Ambassador Taofeek Arapaja, to seek re-election as the Deputy National Chairman for the South.\nIn compliance, Arapaja, at the weekend resigned as the vice national chairman for South-west and obtained a nomination form to seek election as the consensus deputy national chairman (South).\nBefore then, stakeholders of the PDP had scheduled Oyinlola as the deputy national chairman for South."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "Anti-graft Agency, EFCC Arraigns Two Men For Impersonating British-Nigerian Boxer, Anthony Joshua To Defraud Women",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arraigned two suspected Internet fraudsters for alleged impersonation of the British-Nigerian heavyweight boxer, Anthony Joshua.\nAccording to a statement by EFCC’s spokesperson, Wilson Uwujaren, on Tuesday, the accused are Ukhuriegbe Irekpitan and Onyekwa Chinedum.\nEach of the defendants faces two counts, EFCC said.\nTheir offences are said to be punishable under section 14 (2) of the Cybercrime (Prohibition Prevention, Etc) Act 2015.\nThe judge however adjourned the matter till October 21, and ordered that the defendants be remanded at the Nigerian Correctional Centre in Benin City."
  },
  {
    "headline": "Osita Chidoka: The north has benefitted from power rotation... no reason to stop now",
    "summarized_story": "Osita Chidoka, former minister of aviation, says the northern part of the country has benefitted from power rotation, and as such, the arrangement should be maintained.\nSpeaking in an interview with Channels Television on Sunday, Chidoka said Nigeria is faced with the question of whether to honour the presidency zoning arrangement between the north and the south.\nAdvertisement“In 2019, because the PDP agreed that it was the north’s turn to do eight years, we all zoned the presidency to the north,” he added.\nAdvertisementHe said there is no reason why zoning arrangements between the north and the south should be dismantled.\nAdvertisement“I do not see any reason why we should dismantle that consensus that power goes north and goes south."
  },
  {
    "headline": "Osita Chidoka: The north has benefitted from power rotation... no reason to stop now",
    "summarized_story": "Osita Chidoka, former minister of aviation, says the northern part of the country has benefitted from power rotation, and as such, the arrangement should be maintained.\nSpeaking in an interview with Channels Television on Sunday, Chidoka said Nigeria is faced with the question of whether to honour the presidency zoning arrangement between the north and the south.\nAdvertisement“In 2019, because the PDP agreed that it was the north’s turn to do eight years, we all zoned the presidency to the north,” he added.\nAdvertisementHe said there is no reason why zoning arrangements between the north and the south should be dismantled.\nAdvertisement“I do not see any reason why we should dismantle that consensus that power goes north and goes south."
  },
  {
    "headline": "Moghalu: I don't blame youths for leaving Nigeria -- there's economic frustration",
    "summarized_story": "Kingsley Moghalu, a former deputy governor of the Central Bank of Nigeria (CBN), says economic frustration and misery are among the factors driving youths out of Nigeria.\nSpeaking during a Channels Television programme on Sunday, he said although his children are based abroad, they look forward to coming back to Nigeria.\nAdvertisementHe said: “My family has always been international by virtue of my career and my kids all want to come home to Nigeria.\n“Look at young people in this country, everyone wants to go, leave the country because there is so much misery, so much economic frustration.\n“The vision I have for the people, I do not think these parties are able to accommodate it, I don’t think they are able to execute it."
  },
  {
    "headline": "Moghalu: I don't blame youths for leaving Nigeria -- there's economic frustration",
    "summarized_story": "Kingsley Moghalu, a former deputy governor of the Central Bank of Nigeria (CBN), says economic frustration and misery are among the factors driving youths out of Nigeria.\nSpeaking during a Channels Television programme on Sunday, he said although his children are based abroad, they look forward to coming back to Nigeria.\nAdvertisementHe said: “My family has always been international by virtue of my career and my kids all want to come home to Nigeria.\n“Look at young people in this country, everyone wants to go, leave the country because there is so much misery, so much economic frustration.\n“The vision I have for the people, I do not think these parties are able to accommodate it, I don’t think they are able to execute it."
  },
  {
    "headline": "'Harvest of confusion' -- PDP takes a dig at APC over parallel state congresses",
    "summarized_story": "The Peoples Democratic Party (PDP) has criticised the All Progressives Congress (APC) over the division which characterised its state congresses.\nAdvertisementSeveral APC state chapters held parallel congresses and produced two sets of executives on Saturday.\nKola Ologbondiyan, PDP national publicity secretary, on Sunday, described the APC congresses as a “harvest of confusion”.\nIf the APC congresses turned out this bad, one can only imagine the type of mayhem that would characterize its primaries as well as their involvement in the general election.\n“The APC state congresses present an unprecedented scenario in the history of our nation, where a party which produced the incumbent President, will have its ranks so torn down in shameful spectacle."
  },
  {
    "headline": "Why Nigerian neobank, Sparkle, preferred local investors in $3.1m funding",
    "summarized_story": "Sparkle, a mobile-based digital bank that provides a combination of financial, lifestyle, and business support services to Nigerians, on Thursday, announced a $3.1 million seed fundraise from entirely Nigerian investors.\nThe latest funding brings Sparkle’s total investment secured to $5.1 million, having previously raised $2 million in pre-seed from friends and family.\n“They all understand the real need for a digital-first platform such as Sparkle.”Get the best African tech newsletters in your inboxIt’s not common in the Nigerian tech ecosystem that a funding round of such value comprises only local investors.\nAccording to Dozie, the Sparkle team was “very deliberate” about having an all-Nigerian round as it always felt that having a selection of strategic local investors would be beneficial to the startup’s growth.\nWe wanted to make sure our investors really understood the market before committing to this round,” he told TechCabal."
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "M-Pesa, Opay, Telebirr, Palmpay: How Chinese tech is powering African fintech",
    "summarized_story": "These Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\nNotably, Wapi Pay, a Singapore-based Kenyan fintech startup powering the Africa-Asia cross-border payment, uses Huawei’s mobile money services.\nAn indication that contemporary fintech startups are also relying on Chinese tech.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "How agritech startups are helping to check food inflation in Nigeria",
    "summarized_story": "I tried painting a picture of what food inflation looks like, but this tweet about the increase in the price of sardines does a pretty good job.\nTo commemorate this year’s celebrations, we look at issues that affect food production and supply in Nigeria, highlighting the work of two agritech startups.\nIn addition, we spotlight the effects of food inflation and steps Nigeria can take to meet its food requirements but first, what is food inflation and what causes it?\nDemand outstripping supply and supply being affected are the two major causes of food inflation.\nThe role of agritech startups in tackling food inflationLike other areas of the Nigerian economy, tech and tech-enabled startups have sprung up to solve the problem of food inflation."
  },
  {
    "headline": "With $350k pre-seed, PaySika is building a neobank for the unbanked in Francophone Africa",
    "summarized_story": "After all, he’d left French-speaking Africa, where barely 20% of the population had access to banking services, so that was the obvious option.\nThe young man in this story is Roger Noel Nengwe, Co-founder and CEO of PaySika, a neobank looking to provide banking services to the unbanked in Francophone Africa.\nAlongside Stezen Bisselou-Nzengue, Co-founder and CEO, Nengwe is building PaySika on Francophone Africa’s existing mobile money infrastructure.\nIt offers banking services not just on an app like most neobanks but on their favourite messaging apps.\nBut everything was based on facts supplied by PaySika Co-founder, Roger Nengwe, and our research."
  },
  {
    "headline": "Tech-enabled sexual health, Sparkle’s $3.1 million seed, Facebook’s Policy Update",
    "summarized_story": "Share this article:Hello,Today I’m discussing:Improving your sexual health with technologySparkle’s $3.1 million seedFacebook’s policy on sexual harassment of public figuresImproving your sexual health with technologySexual health is an important aspect of our physical health and development.\nAdvertisementSexual health is critical to our overall health and well-being, and the social and economic development of communities and countries.\nHowever, in Africa, sexual health education is rarely discussed, leading to sexual dysfunction, endometriosis, Sexually Transmitted Infections (STIs), HIV, and unintended pregnancies.\nSo, I discussed sexual health and how technology can improve our sex lives.\nDavis said, “Public figures, either politicians, journalists, celebrities, or content creators use Facebook and Instagram to engage directly with their followers."
  },
  {
    "headline": "BusinessDay partners with MTN to distribute digital content",
    "summarized_story": "BusinessDay, West Africa’s leader in business and financial reporting across print, online, and mobile has entered into a partnership agreement with Africa’s largest telecommunication network, MTN to distribute its content to millions of Nigerians that subscribe to the network.\nFollowing this partnership, the over 70 million subscribers of MTN Nigeria can now access BusinessDay’s insightful stories and analysis via MTN’s platforms.\nMTN’s subscribers will access BusinessDay’s daily Portable Document Format (PDF) via MTN Zigi Chatbot, available on multiple channels, including WhatsApp, Facebook Messenger, Telegram, the official MTN website, and myMTN App.\nThe BusinessDay content now sits in the middle of other range of services offered by MTN, including account balance checks, airtime, data purchases, and answers to frequently asked questions.\n“We now live in a fast-paced digital age with new technological advancements driving the constantly changing landscape,” says Srinivas Rao, chief digital officer, MTN Nigeria."
  },
  {
    "headline": "Electric vehicle makers to face Nickel shortage making Nigeria’s deposit strategic",
    "summarized_story": "Global demand for high-grade nickel, an essential component in electric vehicle (EV) batteries, will outweigh supply by 2024, analysts at Oslo-based global energy research firm, Rystad, has said.\nIn addition, the deficit is likely to encourage automakers to assess alternative battery chemistries, as well as search for previously untapped nickel deposits, the analysts said.\n“According to our estimates, the stainless-steel industry accounts for more than 70 percent of current global nickel demand, with the battery market making up less than 10 percent of global nickel metal demand in 2020,” the report said.\nAs a result, automakers and battery manufacturers may seek alternative battery chemistries to meet demand, the report said.\nSolutionThe primary nickel-based battery chemistries are nickel manganese cobalt (NMC) and nickel cobalt aluminium (NCA), while the iron-based chemistries are lithium iron phosphate (LFP) and sodium-ion (Na-ion)."
  },
  {
    "headline": "Here are reasons there’s uptick in demand for small-size apartments",
    "summarized_story": "The company says that further analysis of the units sold, reveals that they comprised 38 percent of 1-bedroom apartments, 43 percent of 2-bedroom apartments and 19 percent of 3-bedroom apartments.\n“This has reduced the demand for yearly rentals by these companies by between 40 and 45 percent and, in turn, shifted the focus of investors to 1 & 2-bedroom apartments for short-let and short-stay apartments,” the MDS market survey explains.\nAccording to MKO Balogun, Group CEO of Global PFI, six in every 10 persons looking for homes to buy are looking for 2-bedroom apartments, thus authenticating MDS Properties’ findings that 2-bedroom apartments are the toast of home seekers.\nMDS Properties’ Coral Apartments in Victoria Island is also a premium collection of 1 & 2-bedroom apartments, offering great value to both owner-occupiers and investors.\n“For 2-bedroom apartments, the turnover is high, the demand is extremely high in terms of rentals whether for short let or normal rental."
  },
  {
    "headline": "Edo govt, NEMA, others sensitise residents on fire disaster mgt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government in partnership with the National Emergency Management Agency (NEMA) and the Nigerian Red Cross Society has intensified sensitisation on fire disaster management.\nAddressing journalists after a road show to mark the 2021 World Disaster Risk Reduction Day, with the theme, “Fire Outbreak and Mitigation Response Sensitization,” in Benin City, the Functioning Director, Edo State Emergency Management Agency (EDOSEMA), Mrs. Carol Odion said the state government will sustain the effort to enlighten residents on fire disaster management.\nThe Assistant Head, Edo Office of the National Emergency Management Agency (NEMA), Omeje Ifeanyi, said: “We are partnering with EDOSEMA to sensitise the public and bring the issue of management of fire outbreaks to the notice of Edo residents.\n“I urge residents in Edo State to do everything to avoid a fire rather than calling on the government for support.\nFire is nobody’s friend as the damage from an outbreak is unquantifiable."
  },
  {
    "headline": "Edo Poly sets for 3rd, 4th convocation, to honour Betsy Obaseki, Omobude, Ogbeifun, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, has unveiled plans to hold its 3rd and 4th convocation ceremony and confer honourary fellowship awards to four Nigerians for their contribution to the development of the state and the country.\nRector, Edo State Polytechnic, Prof. Abiodun Falodun, in a chat with journalists, said the convocation ceremony is billed to hold from October 26 to 28, at the polytechnic main auditorium in Usen, Ovia South-West Local Government Area of Edo State.\nProf. Falodun said the four Nigerians to be honoured at the school’s convocation ceremony include the First Lady of Edo State, Mrs. Betsy Obaseki; Managing Director/CEO of Starzs Marine and Engineering Limited, Engr.\nAccording to him, “We would be holding a combined convocation ceremony this year.\nAnother highlight of this year’s ceremony is the unveiling of the Gabriel Igbinedion administrative complex to the public,” he added."
  },
  {
    "headline": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta Apartment – Nigerian Observer",
    "summarized_story": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta ApartmentShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – A middle-aged lady, identified as Michelle Bazunu, has been allegedly gruesomely murdered at her residence in Bazunu Street, Warri South council area of Delta State.\nDetails of the incident were still sketchy as at Thursday, but it was gathered that the deceased was found with multiple stab wounds and her throat slit in the early hours of Wednesday, October 13, at No1 Bazunu Street, Warri.\nThe area which is close to the popular Igbudu Market in Warri, is notorious for some heinous crimes.\nSecurity operatives were said to have stormed the area in a raid, a while after the victim was gruesomely, murdered.\nWhen contacted, the Delta State Police Public Relations Officer (PPRO), DSP Bright Edafe, could not confirm the sad incident."
  },
  {
    "headline": "Obaseki, Igbinedion, others pay last respect to late Sir Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki; former Governor, Lucky Igbinedion; Edo State Chief Judge, Hon.\nOsaigbovo Iyoha were among dignitaries at the tribute/service of songs held in honour of late music icon, Prof. Sir Victor Uwaifo.\nGovernor Obaseki described Uwaifo as a legend who carved a niche for himself and portrayed Edo State positively to the global community.\nOn his part, Lucky Igbinedion described late Uwaifo as a cultural ambassador and a great musical icon that brought glory to Edo, Nigeria and Africa.\nI thank the Uwaifo family for allowing him to serve the state."
  },
  {
    "headline": "Police arrest unruly personnel in trending video extorting, assaulting travellers in Kogi",
    "summarized_story": "The Kogi State Police Command says it has arrested four of its personnel who were seen in a trending video extorting and assaulting travellers in a location in the state.\nA statement by the Command’s spokesperson, William Aya, said the personnel are currently in detention while an investigation is ongoing.\nThe arrest of the personnel comes a few hours after the Inspector-General of Police, Alkali Baba, ordered an immediate investigation into the matter.\nThe police personnel attached to Adogo Division were on patrol duty along Adogo-Okene road when the incident occurred.\n*DSP William Ovye Aya*,Police Public Relations Officer,*For*: Commissioner of Police,Kogi State Command"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "SERAP sues Buhari, wants court to declare ‘plan to monitor WhatsApp messages illegal’",
    "summarized_story": "It also fails to meet the requirements of legality, necessity, and proportionality.”According to SERAP, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\n“The lack of any safeguards against discriminatory decision-making, and access to an effective remedy shows the grave threats the purported plan poses to constitutionally and internationally recognized human rights.\n“Interference with privacy through targeted surveillance is designed to repress the exercise of the right to freedom of expression.\nSurveillance of journalists, activists, opposition figures, critics and others simply exercising their right to freedom of expression – would lead to violations of other human rights.\n“Targeted surveillance creates incentives for self-censorship and directly undermines the ability of journalists and human rights defenders to conduct investigations and build and maintain relationships with sources of information."
  },
  {
    "headline": "You’re a consistent politician,’ Akinleye Salutes B.T Salam @ 61",
    "summarized_story": "By Sunday Oguntuyi, OsogboA chieftain of People’s Democratic Party, PDP in Osun State, Alhaji Kazeem Akinleye has described Dr. Bashir Tokubo Salam as a consistent politician who works assiduously for the success of any course he believes in, just as he congratulate him on his 61st birthday anniversary.\nAkinleye in a congratulatory message issued and personally signed, copies of which were made available to newsmen in Osogbo on Sunday, saluted the doggedness of the astute politician in the area of community development.\nThe erstwhile chairman of Ede North local government described BT Salam who is also former chairman of Ede South, as grassroot mobiliser who has impacted positively on the people of his area and state at large.\n“On this occasion of your birthday today, I sincerely appreciate God on your behalf for the spirit of selfless service bestowed unto you,” he said.\n“I fervently prayed that God, the giver of wisdom will shower you more and spare your life to witness many birthday on the land of living, congratulations.”"
  },
  {
    "headline": "Court dissolves marriage over adultery, orders sharing of properties",
    "summarized_story": "The petitioner had approached the court for a Decree of Dissolution of Marriage against her husband, the respondent.\nShe stated that the marriage had broken and not retrievable, alleging that the respondent committed adultery, hence she finds it intolerable to live with him.\nThe petitioner sought an order of the court to have the custody of the second son of marriage and an order directing the respondent to contribute to the upkeep of the son.\nIn his ruling, Justice Ganiyu, granted the prayers of the petitioner and ordered the sale and sharing of the properties that are jointly owned by the couples.\nThe court ordered that tuition fee should be shared by the parties but maintenance fee of N250, 000 was to be paid by respondent till the boy is gainfully employed."
  },
  {
    "headline": "Two chairmen emerge as Osun APC holds parallel congresses",
    "summarized_story": "Rasaq Salinsile have emerged chairmen of the All Progressive Congress (APC) in Osun State, as party members today, held parallel congresses.\nAnnouncing the results of the Congress, the Chairman of the National Committee on the Osun State Congress, Hon.\n“The All Progressives Congress emerged on the strength of unity and progressive ideals.\nWe remain one united family, and we remain focused on delivering unprecedented progress and development to Osun”, Oyetola said.\nLet’s work for the perpetuation of our government in Osun State through all- known legitimate means”, Famodun said."
  },
  {
    "headline": "Abuja Church Honours UniAbuja Ex-Deputy VC",
    "summarized_story": "The Minister in charge of First Baptist Church, Gwagwalada, Abuja, Reverend Deji Oyelami, has admonished Christians to always dedicate their lives towards the service of God and humanity.\nOyelami gave the admonition during a special send-off service in honour of a former Deputy Vice Chancellor of the University of Abuja and his wife, Professor and Dr. Mrs Kayode Omole, on Sunday.\nSome members of the church, who gave testimonies about the duo, wished them well in their future endeavours.\nADVERTISEMENTThe special send-off service, which was attended by friends, colleagues and family members of the Omoles, featured prayers, thanksgiving and presentation of gifts to Prof. and Dr. Mrs Kayode Omole.\nIt would be recalled that Professor and Dr. Mrs Kayode Omole have served in different capacities in the church during their 30-year membership of the church."
  },
  {
    "headline": "Abuja Church Honours UniAbuja Ex-Deputy VC",
    "summarized_story": "The Minister in charge of First Baptist Church, Gwagwalada, Abuja, Reverend Deji Oyelami, has admonished Christians to always dedicate their lives towards the service of God and humanity.\nOyelami gave the admonition during a special send-off service in honour of a former Deputy Vice Chancellor of the University of Abuja and his wife, Professor and Dr. Mrs Kayode Omole, on Sunday.\nSome members of the church, who gave testimonies about the duo, wished them well in their future endeavours.\nADVERTISEMENTThe special send-off service, which was attended by friends, colleagues and family members of the Omoles, featured prayers, thanksgiving and presentation of gifts to Prof. and Dr. Mrs Kayode Omole.\nIt would be recalled that Professor and Dr. Mrs Kayode Omole have served in different capacities in the church during their 30-year membership of the church."
  },
  {
    "headline": "NDLEA, Army, Raid Drug Havens In Lagos, Arrest 663 Suspects",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) and the officers of the Nigeria Army (NA) have arrested suspected fake police officer, soldier, corps member and about 660 other suspects in a coordinated raids in notorious Lagos drug joints, in Ekiti and other states.\nThis is even as the NDLEA destroyed 153,256kg of assorted drugs in Ekiti forest.\nNDLEA spokesperson, Femi Babafemi, who confirmed the arrests, said the agency raided notorious drug joints in Lagos, Abuja, Benue and other parts of the country during which assorted illicit drugs weighing over 153,256.876 kilograms were either destroyed or seized in the past week.\nADVERTISEMENTThe operatives also raided drug joints in Ojo and Maryland areas of the state where six persons were arrested and different quantities of drugs seized.\nIn Ogun State, operatives on Friday, October 15, intercepted one Williams Esuabom along Ore-Shagamu expressway with 562.5kg Cannabis being conveyed in a Toyota sienna bus."
  },
  {
    "headline": "NDLEA, Army, Raid Drug Havens In Lagos, Arrest 663 Suspects",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) and the officers of the Nigeria Army (NA) have arrested suspected fake police officer, soldier, corps member and about 660 other suspects in a coordinated raids in notorious Lagos drug joints, in Ekiti and other states.\nThis is even as the NDLEA destroyed 153,256kg of assorted drugs in Ekiti forest.\nNDLEA spokesperson, Femi Babafemi, who confirmed the arrests, said the agency raided notorious drug joints in Lagos, Abuja, Benue and other parts of the country during which assorted illicit drugs weighing over 153,256.876 kilograms were either destroyed or seized in the past week.\nADVERTISEMENTThe operatives also raided drug joints in Ojo and Maryland areas of the state where six persons were arrested and different quantities of drugs seized.\nIn Ogun State, operatives on Friday, October 15, intercepted one Williams Esuabom along Ore-Shagamu expressway with 562.5kg Cannabis being conveyed in a Toyota sienna bus."
  },
  {
    "headline": "Co-regulation: NPAN Asks Media Houses To Set Up Ombudsman",
    "summarized_story": "The Newspaper Proprietors’ Association of Nigeria (NPAN) has set November 1, 2021 as the deadline for each member to empanel an Internal Ombudsman mechanism within the respective member-organisations.\nIt noted that the Internal Ombudsman will ensure that the news organisation keeps to the canons of journalism practice and the code of ethics.\nThe association said the Internal Ombudsman will also help to mediate in conflicts stemming from internal or external pressures.\nADVERTISEMENTThe communique further said the ombudsman will keep news organisations honest and accountable to the public for news reported.\n“The Council resolved to unfold soon, a global Ombudsman structure for the entire industry and the modalities for the same.”NPAN, therefore, reaffirmed its commitment to responsible journalism at all times."
  },
  {
    "headline": "20 AMAZING FACTS ABOUT WORKAHOLIC LAGOS GOVERNOR, BABAJIDE SANWO-OLU",
    "summarized_story": "By AZUH AMATUS1 Full name: Babajide Olushola Sanwo-Olu2 The amiable politician is the current governor of Lagos State, the centre of excellence.\n3 Workaholic Sanwo-Olu was sworn-in as the 15th Governor of Lagos State on Wednesday, May 29, 2019, amid plaudits and celebrations.\n10 Sanwo-Olu also served as the MD/CEO of the Lagos State Development and Property Corporation (LSDPC) during the Ambode administration.\n11 Very articulate Sanwo-Olu also set up and became the pioneer board chairman of the Lagos State Security Trust Fund.\n19 Sanwo-Olu who is currently and rapidly changing the face of Lagos State with developmental projects was born on June 25, 1965."
  },
  {
    "headline": "20 AMAZING FACTS ABOUT WORKAHOLIC LAGOS GOVERNOR, BABAJIDE SANWO-OLU",
    "summarized_story": "By AZUH AMATUS1 Full name: Babajide Olushola Sanwo-Olu2 The amiable politician is the current governor of Lagos State, the centre of excellence.\n3 Workaholic Sanwo-Olu was sworn-in as the 15th Governor of Lagos State on Wednesday, May 29, 2019, amid plaudits and celebrations.\n10 Sanwo-Olu also served as the MD/CEO of the Lagos State Development and Property Corporation (LSDPC) during the Ambode administration.\n11 Very articulate Sanwo-Olu also set up and became the pioneer board chairman of the Lagos State Security Trust Fund.\n19 Sanwo-Olu who is currently and rapidly changing the face of Lagos State with developmental projects was born on June 25, 1965."
  },
  {
    "headline": "12 QUICK FACTS ABOUT AMINA, NOLLYWOOD LATEST BIG BUDGET FILM ON NETFLIX",
    "summarized_story": "By AZUH AMATUS1 Pioneer filmmaker, Okey Ogunjiofor is the producer cum executive producer of Amina, while Izu Ojukwu directed the big budget film.\n2 Over 1000 Northern artistes and 86 Southern crew members worked on the set of Amina, in Jos, Plateau State.\n3 Amina is a feature film made with collaborations that spanned three continents of Africa, Europeand America.\n4 Amina is the captivating and thrilling story of the life and times of Queen Amina of Zazzau.\n8 Amazingly, Amina will be enjoying a global release as a Netflix original film on November 4, 2021."
  },
  {
    "headline": "12 QUICK FACTS ABOUT AMINA, NOLLYWOOD LATEST BIG BUDGET FILM ON NETFLIX",
    "summarized_story": "By AZUH AMATUS1 Pioneer filmmaker, Okey Ogunjiofor is the producer cum executive producer of Amina, while Izu Ojukwu directed the big budget film.\n2 Over 1000 Northern artistes and 86 Southern crew members worked on the set of Amina, in Jos, Plateau State.\n3 Amina is a feature film made with collaborations that spanned three continents of Africa, Europeand America.\n4 Amina is the captivating and thrilling story of the life and times of Queen Amina of Zazzau.\n8 Amazingly, Amina will be enjoying a global release as a Netflix original film on November 4, 2021."
  },
  {
    "headline": "I'll chew you raw if you talk negatively about Oyedepo: Ibiyeomie warns",
    "summarized_story": "Founder, Salvation Ministries, Port Harcourt, Pastor David Ibiyeomie has said he would chew anyone raw who speak negatively about Bishop David Oyedepo.\nIbiyeomie said Oyedepo and other top men of God are to be honoured and not to be disrespected or spoken evil against.\n“That you are close to somebody does not mean you honour the person.\nIt is heart to heart.\nI honour him to a point that you can’t talk about him negatively where I am."
  },
  {
    "headline": "CAF cups: Rivers United walk tightrope, Bayelsa in slim advantage",
    "summarized_story": "The chances of Rivers United FC qualifying for the group stage of the CAF Champions League dimmed on Sunday as they could only manage a 1-1 draw at home against Al Hilal of Sudan in Port Harcourt.\nThe loser of this tie will drop to the playoffs of the CAF Confederation Cup.\nIn the CAF Confederation Cup, Bayelsa United Football Club (FC) of Yenagoa recorded a slim 1-0 win over the CS Sfaxien FC of Tunisia in the first leg, second preliminary round of the 2020/2021 season.\nThe home team’s Victory Beniangha gave the Yenagoa side victory in the 55th minute, through a powerful shot that beat the CS Sfaxien goal keeper, Gaaloul Medheoi.\nThe Nigerian Aiteo Cup Champions came close to scoring in the 30th and 42nd minute of the game, but Okardi Inikurogha attempts were frustrated by the agile CS Sfaxien goalkeeper."
  },
  {
    "headline": "NBA Official Ubani Declare Compulsory Vaccination Illegal, To Sue Nigerian Govt",
    "summarized_story": "Monday Ubani, Chairman of the Nigerian Bar Association’s Section on Public Interest and Development Law (NBA-SPIDEL), has threatened to sue the Buhari administration over mandatory vaccination.\nThe directive, according to Ubani, breached existing labor terms as well as federal servants’ fundamental rights to privacy, life, movement, religious belief and faith, and liberty.\nAny mandatory vaccination edict, according to the NBA official, is immature, unnecessary, and undesirable, and should be completely rejected.\n“When these civil servants were employed, compulsory vaccinations and its attendant punishment for non compliance were not part of their terms of contract.\nUbani added that what should be made mandatory in Nigeria are free education, free healthcare and other social welfare policies"
  },
  {
    "headline": "SERAP Sues Buhari, Others Over Plan To Monitor WhatsApp Messages, Phone Calls.",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari, requesting that the court “declare illegal and unconstitutional the current administration’s plan to track, intercept, and monitor WhatsApp messages, phone calls, and text messages of Nigerians and others.”According to SERAP, it severely threatens and violates the right to the preservation of privacy.\nThe suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87 billions to monitor private calls and messages.\nThe suit partly read, “The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people.”Joined in the suit as Respondents are Abubakar Malami, the Minister of Justice and Attorney General of the Federation and Zainab Ahmed, the Minister of Finance, Budget and National Planning.\nHowever, the date for the hearing of the suit has not been fixed yet."
  },
  {
    "headline": "#EndSARS: How Buhari’s Regime, Lagos Governor Sanwo-Olu Mobilised Armed Thugs To Attack Unarmed Protesters — Sowore",
    "summarized_story": "Human rights activist, Omoyele Sowore has said President Muhammadu Buhari’s regime mobilised armed thugs to disrupt the #EndSARS protest which was organised by young Nigerians last year.\nAccording to him, Buhari’s regime conveyed thugs in government-registered vehicles to attack peaceful protesters, leading to the death of some of the demonstrators.\nHe further said the Lagos State governor, Babajide Sanwo-Olu gave out air-conditioned BRT buses to the hoodlums to invade a protest venue last October.\n#RevolutionNow #BuhariMustGo.”Buhari had in the past claimed last year’s #EndSARS protest against police brutality was aimed at removing him from office.\n“This question was answered last year when there was the #EndSARS protest."
  },
  {
    "headline": "Nigeria’s Anti-graft Agency, EFCC Invites Ex-Vice Presidential Candidate, Peter Obi For Questioning",
    "summarized_story": "The EFCC, Nigeria’s anti-corruption agency, has summoned Peter Obi, the former governor of Anambra State, for questioning over his secret and illegal offshore operations, which PREMIUM TIMES reported in the ongoing Pandora Papers series.\nSources separately said the invitation is in connection with revelations in our Pandora Papers report.\nMr Obi has, however, continued to claim no wrongdoing.\nOthers included Governor Abubakar Bagudu of Kebbi State, Governor Gboyega Oyetola of Osun State as well as his associates including former Lagos Bola Tinubu, and Ogun State Governor Dapo Abiodun.\nIt is not clear if the EFCC’s action on Mr Obi is connected to Mr Buhari’s directive."
  },
  {
    "headline": "At last, Police break silence on 2020 recruitment exercise",
    "summarized_story": "The Nigeria Police Force (NPF) in collaboration with the Police Service Commission (PSC) are set to conclude the ongoing 2020 recruitment exercise of 10,000 Police Constables as the recruitment portal is set to open on Monday, October 18, just as examinations are to commence on Friday, October 29.\nA press statement by the Force Public Relations Officer (FPRO), CP Frank Mba, Saturday in Abuja, said: “candidates are required to check their recruitment status on the recruitment portal, www.policerecruitment.gov.ng which will be opened from Monday, October 18, through to Tuesday, October 26, 2021.\n“Candidates who are qualified for the next stage of the recruitment exercise are to print out their examination slip which must be presented on the examination date scheduled for Friday, October 29, and Saturday, October 30, 2021, at designated centres across the country.\n“Candidates are equally advised to check their email and phone numbers for notifications.”Mba said the Force, while reiterating that the recruitment exercise is absolutely free of charge and without any pecuniary obligation, enjoins candidates to call 08100004507 for further enquiries about the recruitment exercise."
  },
  {
    "headline": "Breaking: Iheanacho torments Maguire as Leicester City outclass Manchester United, Man City labour to victory",
    "summarized_story": "Leicester City increased the pressure on Manchester United manager Ole Gunnar Solskjaer as they ran out fully deserved winners in a thriller at King Power Stadium.\nLeicester City were vastly superior after the break and went ahead when Caglar Soyuncu sparked a flurry of late goals when he pounced in a goalmouth scramble with 12 minutes to go.\nThe presence of Jonny Evans in defence provided reassurance and quality while Iheanacho tormented Maguire, who delivered a laboured and error-strewn display.\nOnce again, Leicester showed resolve and quality to hit United again within seconds and that was that.\nManchester City Labour vs BurnleyManchester City also defeated lowly-placed Burnley 2-0."
  },
  {
    "headline": "Uneasy calm as gunmen kidnap monarch’s twin children, maid, driver, guard",
    "summarized_story": "Suspected kidnappers have abducted six-year-old twin children of a prominent monarch in Kwara state, the Owalobo of Obbo-Aiyegunle, Oba Samuel Adelodun.\nThe suspected kidnappers also abducted the monarch’s driver, Kunle; a security man, Lawrence, and a maid, Bukunmi.\nSpokesperson of the Kwara state police command, Ajayi Okasanmi confirmed the development.\nBut the abductors were said to have left the Sienan bus the victims were driving in on the roadside.\nMeanwhile, the state police command said it has lauched a manhurnt to arrest and rescue the victims unhurt ."
  },
  {
    "headline": "E-transmission of results: Nigeria on threshold of economic, political prosperity – Elekima",
    "summarized_story": "ople’s Life Improvement Foundation, PLIF , has enthused that the passage of the electoral Act amendment that allows for electronic transmission of results by the national assembly will launch Nigeria into the era of economic and political prosperity.\nBecause, the constitution of Nigeria has vested the sovereignty of Nigeria on the people of Nigeria.\n“”Power belongs to the people” , unfortunately it has only been on the lips , while the strong, rich, thugs, guns is what dictates elections in Nigeria.\n“We, therefore embarked on a crusade to educate the people of the reasons for the leadership failure in Nigeria.\nNigeria is almost a failed State this is the opportunity and time of restoration.”"
  },
  {
    "headline": "E-transmission of results: Nigeria on threshold of economic, political prosperity – Elekima",
    "summarized_story": "ople’s Life Improvement Foundation, PLIF , has enthused that the passage of the electoral Act amendment that allows for electronic transmission of results by the national assembly will launch Nigeria into the era of economic and political prosperity.\nBecause, the constitution of Nigeria has vested the sovereignty of Nigeria on the people of Nigeria.\n“”Power belongs to the people” , unfortunately it has only been on the lips , while the strong, rich, thugs, guns is what dictates elections in Nigeria.\n“We, therefore embarked on a crusade to educate the people of the reasons for the leadership failure in Nigeria.\nNigeria is almost a failed State this is the opportunity and time of restoration.”"
  },
  {
    "headline": "Agriculture: Over 4million Nigerians out of poverty-Min -NigPilot",
    "summarized_story": "Honorable Minister of Agriculture and Rural Development, FMARD, Mohammad Mahmood Abubakar, says the ministry has lifted about 4,205,576 Nigerians out of poverty in the last two years.\nHe said this during his maiden press briefing with journalists in Abuja to mark the 2021 World Food Day, WFD, in partnership with Food and Agriculture Organisation, FAO, and other stakeholders.\nThe policy he said, when approved, will improve agricultural extension services in the country and help increase better production and better environment.\n“As part of our effort to ensure food security, a total of 446 potable water points were provided to rural communities nationwide with 286,500 households having access.\nThe aim he said, is for the country to be fully self-sufficient in rice and other crops that provide food to Nigerians."
  },
  {
    "headline": "Agriculture: Over 4million Nigerians out of poverty-Min -NigPilot",
    "summarized_story": "Honorable Minister of Agriculture and Rural Development, FMARD, Mohammad Mahmood Abubakar, says the ministry has lifted about 4,205,576 Nigerians out of poverty in the last two years.\nHe said this during his maiden press briefing with journalists in Abuja to mark the 2021 World Food Day, WFD, in partnership with Food and Agriculture Organisation, FAO, and other stakeholders.\nThe policy he said, when approved, will improve agricultural extension services in the country and help increase better production and better environment.\n“As part of our effort to ensure food security, a total of 446 potable water points were provided to rural communities nationwide with 286,500 households having access.\nThe aim he said, is for the country to be fully self-sufficient in rice and other crops that provide food to Nigerians."
  },
  {
    "headline": "IDRW: Helpline Foundation calls for empowerment of rural women -NigPilot",
    "summarized_story": "The group also advocates the inclusion of indigenous women, in enhancing agricultural and rural development, and eradicating rural poverty.\nThe President and Founder of the NGO, Dr. Jumai Ahmadu, made the call in a statement on Friday as part of activities to mark 2021 International Day of Rural Women IDRW, which is marked every 15th Oct to celebrate rural women all over the world.\nShe said this year’s International Day of Rural Women with the theme: Rural Women Cultivating Good Food for All” was in line with the ongoing programmes being carried out by the Helpline Foundation in recent times aimed at encouraging access to food and addressing hunger, malnutrition, and food insecurity.\n“The theme for this year being Rural Women Cultivating Good Food for All , was as a result of neglect to the rural women by the policymakers, as the government does not remember them.\nSome of the rural women organisation that benefited from our empowerment programmes includes Yeyedu women, Bwari women and Kurudu women."
  },
  {
    "headline": "11 Die In Auto Crash In Kwara",
    "summarized_story": "Eleven people have lost their lives in an auto crash said to have been caused by wrongful overtaking along the Jebba-Bode Saadu in the Moro local government area of Kwara State.\nAccording to eyewitnesses, the accident which occurred around 4:00pm on Sunday at Onipako village, involved two vehicles – a Toyota Corolla salon car and a commercial Toyota Hiace bus.\nRead Also: Four Dead, 19 Injured In Ondo Boat AccidentsHe said all six females died in the incident.\nOwoade also added that 15 other people suffered varying degrees of fracture.\nThe FRSC boss said those injured were taken to the Jebba Medical Centre and Emmanuel Hospital, Jebba, while the corpses of the deceased have been deposited at the University of Ilorin Teaching Hospital (UITH)."
  },
  {
    "headline": "Fake Policeman, Soldier, 661 Others Arrested As NDLEA Raids Notorious Drug Joints",
    "summarized_story": "A fake police officer and a soldier suspected to also be fake were among 663 drug traffickers and users arrested when operatives of the National Drug Law Enforcement Agency (NDLEA) raided notorious drug joints in Lagos, Abuja, Benue and other parts of the country.\nIn the raids which led to the seizure of assorted illicit drugs weighing over 153, 256.876 kilograms, a youth corps member was also arrested.\nAccording to a statement on Sunday by NDLEA spokesman, Femi Babafemi, the drugs seized were destroyed afterward.\nA day earlier, operatives also raided drug joints in Ojo and Maryland areas of the state where six persons were arrested and different quantities of drugs seized.\nHe called for continued collaboration between the NDLEA and other stakeholders especially the armed forces and other law enforcement agencies."
  },
  {
    "headline": "SERAP Sues Buhari, Wants Court To Declare ‘Plan To Monitor WhatsApp Messages Illegal’",
    "summarized_story": "“The Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people,” it said.\n“The lack of any safeguards against discriminatory decision-making, and access to an effective remedy shows the grave threats the purported plan poses to constitutionally and internationally recognized human rights.\nAn order setting aside the budget line of N4.87bn to monitor WhatsApp messages, phone calls and text messages of Nigerians and other people for being inconsistent and incompatible with constitutional provisions, and international human rights treaties.\nAn order mandating the 1st Respondent to redirect public funds in the sum of N4.87bn budgeted to monitor WhatsApp messages, phone calls and text messages of Nigerians and other people to improve the working conditions of healthcare practitioners and improve public healthcare facilities across Nigeria."
  },
  {
    "headline": "Nigeria Records 35 Deaths, 376 More Cases In 24 Hours",
    "summarized_story": "Nigeria has recorded 35 deaths from the coronavirus disease and 376 more cases within the last 24 hours.\nBased on the latest reports, the countries with the newest deaths were the United States with 1,659 new deaths, followed by Russia with 998 and Brazil with 525.\nAfter the US, the hardest-hit countries are Brazil with 602,099 deaths from 21,612,237 cases, India with 451,814 deaths from 34,037,592 cases, Mexico with 283,574 deaths from 3,744,574 cases, and Russia with 221,313 deaths from 7,925,176 cases.\nLatin America and the Caribbean overall has 1,506,032 deaths from 45,445,934 cases, Europe 1,346,943 deaths from 70,386,373 infections, and Asia 854,745 deaths from 54,951,304 cases.\nThe United States and Canada has reported 749,943 deaths from 46,439,525 cases, Africa 214,863 deaths from 8,419,477 cases, Middle East 203,742 deaths from 13,655,783 cases, and Oceania 2,451 deaths from 216,333 cases."
  },
  {
    "headline": "Four Dead, 19 Injured In Ondo Boat Accidents",
    "summarized_story": "Four persons have lost their lives while 19 others sustained injuries in boat accidents at different locations in Ilaje and Irele Local Government Areas of the Ondo State.\nThe Public Relations Officer of Ondo State Command of the Nigeria Security and Civil Defence Corps (NSCDC), Olufemi Omole, disclosed this in a statement made available to newsmen on Sunday, in Akure, the state capital.\nAccording to the statement, the State Commandant of the Corps, Hameed Abodunrin, lamented that the victims died in the mishaps due to their failure to put on their life jackets.\nIn another incident, in Irele local government, a small boat collided with a bigger wooden boat on the high sea in the night, leading to the death of a passenger while four others were terribly injured.\nAbodunrin warned that henceforth, the command’s Marine Special Force would be on patrol to arrest boat passengers who refuse to use the life jackets."
  },
  {
    "headline": "Senator Ekweremadu seeks true federalism as way out of Nigeria's insecurity challenges",
    "summarized_story": "Former Senate Deputy President, Senator Ike Ekweremadu has canvased for true federalism, heaping the myriads of security challenges on the existing nation’s wrong security system.\nHe wants state and municipal governments to be in charge of security in their jurisdictions.\nIn response to inquiries from reporters in Yola, Ekweremadu said that the federal government’s monopoly on security equipment is to blame for the continuous insecurity.\nHe believes that concentrating security in the center will be detrimental to the country.\nAccording to him, Nigeria is praticing unitary government rather than Federal System which he said is inimical to the present security situation of Nigeria."
  },
  {
    "headline": "NAF denies allegation of making payment to bandits in exchange for weapons",
    "summarized_story": "A statement issued by the Director of NAF Public Relations and Information Air Commodore Edward Gabkwet said that there is absolutely no iota of truth in the spurious allegation circulating on social media which is designed to cast aspersions on the good image of the Service.\nCommodore Gabkwet stated that the said report is totally false and should therefore be taken as fake news and disregarded.\nSimilar successes were recorded at Fakai Dutsin Anfare, an area in Jibia LGA known for its high incidences of bandits’ activities.\nThe public is enjoined to disregard the falsehood emanating from some sections of the social and mainstream media.\nWe remain resolute in performing our function and will continue to work in synergy with other sister Services and security agencies to rid the Country of all criminal elements”."
  },
  {
    "headline": "FG declares Tuesday public holiday to celebrate Eid-el-Maulud",
    "summarized_story": "To commemorate this year’s Eid-el-Maulud celebration in honor of the birth of the Holy Prophet Muhammad, the Federal Government has declared Tuesday, October 19th, 2021 as a public holiday.\nMinister of Interior, Ogbeni Rauf Aregbesola, who made the announcement on behalf of the Federal Government, congratulated the Muslim faithful at home and abroad for witnessing this year’s event.\nHe urged all Nigerians to acquire the Holy Prophet Muhammad’s (peace be upon him) characteristics of love, patience, and persistence, saying that doing so will ensure peace and security in the country.\nOgbeni Aregbesola enjoined Nigerians, particularly Muslims, at this moment, to “refrain from violence, lawlessness, wantonness and other acts of criminality.\nAs the indisputable leader of our race, we must show responsible leadership in Africa.”While calling for an end to all divisive tendencies throughout the country, the Minister urged all Nigerians, particularly the youth, to embrace peace and work with President Muhammadu Buhari’s administration to build a progressive and enviable country that all people can be proud of."
  },
  {
    "headline": "VP Osinbajo receives the Queen's Baton for 2022 commonwealth games",
    "summarized_story": "Vice President Yemi Osinbajo has been presented with the Queen’s Baton for the Birmingham 2022 Commonwealth Games.\nAlong with sports minister Sunday Dare, Osinbajo welcomed the baton at the State House on Saturday, on behalf of President Buhari.\nSports minister, Sunday Dare, described the Commonwealth Games Federation’ as “another significant milestone” that symbolized “peace, togetherness, and love” among Commonwealth members.\nHe expressed his delight at being associated with the historic occasion of hosting the Queen’s Baton relay as the first African country to do so.\nHe stated that the baton will return to the United Kingdom on July 28, 2022, for the games’ opening ceremony."
  },
  {
    "headline": "Kunle Afolayan on the Art of Cultural Filmmaking",
    "summarized_story": "Overwhelmed by life’s pressures in the 1980s, the lead character in Kunle Afolayan’s new Netflix film SWALLOW, becomes involved in drug smuggling with her streetwise friend and must face the fallout…Watch him speak on this and more in this riveting interview…"
  },
  {
    "headline": "Special Report: Rescuing Endangered Sea Turtles in Lagos",
    "summarized_story": "Seven species of sea turtles exist today and out of that figure, five can be found in Nigerian waters.\nUnfortunately, all species of these marine animals are considered threatened or endangered, due to human activities over the past two centuries.\nSea turtles are also supposed to be protected in Nigeria under national and international law.\nThis week on ‘Go Wild’, Arise News Environmental Correspondent, Laila Johnson-Salami, rescues a sea turtle from the illegal wildlife trade and takes us on a journey to understand why we need to conserve these animals for the benefit of our ecosystem and economy."
  },
  {
    "headline": "500,000 People at Risk of Starvation in Nigeria’s Northeast, UN Says",
    "summarized_story": "The United Nations World Food Programme (WFP) has warned that half a million women, men, and children in Borno, Yobe, and Adamawa states are at risk of starvation as its funding for the region dries up.\nThe UN agency also said the number of internally displaced persons surpassed two million in September.\nHe added that the number of internally displaced surpassed two million in September 2021, reaching another grim milestone.\n“Our food assistance is a lifeline for millions whose lives have been upended by conflict and have almost nothing to survive on.\n“To sustain humanitarian operations in the North-east Nigeria until March 2022, WFP urgently requires $197 million.”Michael Olugbode in Abuja"
  },
  {
    "headline": "UK Warns Citizens Against Possible Terror Attacks in 12 Nigerian States, #EndSARS Protests in Lagos, Abuja – Arise News",
    "summarized_story": "The United Kingdom government has warned its citizens in Nigeria against visiting 12 states in the country over possible terror attacks.\n“There may be protests and a heightened security presence in major cities such as Lagos and Abuja.\nThere may be additional protests and a heightened security presence in Abuja and in the South-east for this reason.\n“Since 9 August, there has been an increase in protests and demonstrations in the South-east region of Nigeria.\nProtests, including “Stay at Home” protests, are likely during October in the South-east region."
  },
  {
    "headline": "Melbourne to Ease World’s Longest Covid Lockdowns as Vaccinations Rise",
    "summarized_story": "More easing, including the reopening of many retailers, will come once 80% of eligible Victorians are fully vaccinated – estimated by Nov. 5 at the latest.\nEighty percent of the state’s people have been fully vaccinated.\nThe new strategy makes lockdowns highly unlikely once 80% of the population is fully vaccinated.\nThe government is also in discussions with Singapore about reopening travel between the two countries for the fully vaccinated.\nOn Saturday, New Zealand vaccinated more than 2.5% of its people as part of a government-led mass vaccination drive."
  }
]