[
  {
    "headline": "JUST IN: Buhari to sign electoral bill Friday -Presidential aide",
    "summarized_story": "JUST IN: Buhari to sign electoral bill Friday -Presidential aideThere are stong indications that the President, Major General Muhammadu Buhari (retd.\n), will sign the Electoral Act Amendment Bill, on Friday.\nAlso, the Special Adviser to the President on Media and Publicity, Femi Adesina, had earlier confirmed that the President could sign the bill on Thursday or Friday.\nAdesina said, “He (Buhari) will sign it (the bill) any moment from now.\nThe PUNCH reports that the President has in the last five years rejected electoral amendment bills five times."
  },
  {
    "headline": "Ukraine crisis different from Taiwan claims, says China",
    "summarized_story": "China on Wednesday dismissed comparisons between the Ukraine crisis and its own claim over Taiwan, after the self-ruled island’s president said evidence of Russian aggression was being used to hurt Taiwanese morale.\nBeijing said any comparison showed a “lack of the most basic understanding of the history of the Taiwan issue”.\n“Taiwan, of course, is not Ukraine,” foreign ministry spokeswoman Hua Chunying said at a regular press conference.\nTaiwan’s defence ministry said last year that China had launched a disinformation campaign aimed at seizing the island “without a fight”.\nTsai on Wednesday also told national security and military units to remain vigilant and step up surveillance of military activities around Taiwan."
  },
  {
    "headline": "Airfare Hike: Senate demands urgent rehabilitation of federal roads",
    "summarized_story": "The Senate has called on the Federal Government to urgently declare a state of emergency on the nation’s federal roads.\nThese were resolutions reached, yesterday, by the Senate, following a point of order raised to draw its attention to the increase in airfare and the implication for Nigerian roads.\nHe expressed worry that the increase in airfares would increase the pressure on the neglected and dilapidated Nigerian roads and further worsen their state.\nThe lawmaker noted that the Federal Roads Maintenance Agency, FERMA, had a budgetary approval of just 20 per cent of the funds the agency requires for the rehabilitation of about 35,000km of federal roads in 2022.\n“The humongous debt owed FERMA by the Federal Government has hampered the effective discharge of FERMA’s primary responsibility of road maintenance and rehabilitation,” he said."
  },
  {
    "headline": "Alleged N2.9bn Fraud: Ex-Imo Gov, Okorocha, evading charge — EFCC",
    "summarized_story": "The anti-graft agency told the Federal High Court sitting in Abuja that several efforts it made to effect service of the charge on Okorocha, failed.\n“We are therefore asking for a date to enable us to effect service on the 1st Defendant”, the Prosecution counsel added.\nOkorocha, who piloted affairs of Imo state from 2011 to 2019, was charged before the court following his alleged complicity in a N2.9billion fraud.\nEFCC alleged that the Defendants conspired and diverted public funds into private accounts for their personal use.\nIt alleged that the Defendants sequentially siphoned funds from the Imo State Government House account and Imo State Joint Local Government Project account, and diverted same into accounts of private firms."
  },
  {
    "headline": "Pastor in Police net for raping church member during deliverance",
    "summarized_story": "The suspectBy James OgunnaikeABEOKUTA – Operatives of Ogun State command of Nigeria Police have arrested a pastor in charge of Life and Power Bible Church, Ogijo, Pastor Mathew Oladapo, for ‘forcefully’ having unlawful carnal knowledge of a 19 year old member of the church (name withheld).\nOyeyemi said, the victim reported that “while attending the church service on the 20th of February 2022, the pastor told her that he saw a vision that she is having a spiritual husband which she needs to be delivered of”.\n“She stated further that the pastor told her she will undergo three nights of fasting and prayer in the church for total deliverance”.\n“In addition, she was asked to come to the church with 1,000 naira note and anointing oil”.\n“Upon the report, the DPO Ogijo division,CSP Onatufe Umoh, detailed his detectives to the scene where the randy pastor was promptly arrested”."
  },
  {
    "headline": "By-election: Imo APC unleashing violence, abducting our leaders — PDP",
    "summarized_story": "Allegation blatant falsehood — APCBy Chinonso Alozie – OwerriThe Imo State chapter of the Peoples Democratic Party, PDP, Tuesday, alleged that the All Progressives Congress, APC, has unleashed violence on leaders of the PDP and is plotting to abduct some of their leaders ahead of the Ngor Okpala by-election scheduled for Saturday.\nPDP raised the alarm, saying that the APC sent their thugs to cause havoc at a PDP rally in Ntu community in Ngor-Okpala, last Monday.\n“The APC in Imo, realizing how unpopular it is and that it cannot win any peacefully conducted election, has now resorted to violence.\nWhen Vanguard called the APC State Publicity Secretary, Cajetan Duke, he said he was in a meeting and would call back.\nBut reacting to the development, the Imo State Government rubbished the claim by the PDP."
  },
  {
    "headline": "Man, 36, sentenced to death for armed robbery in Akwa Ibom",
    "summarized_story": "By Chioma Onuegbu, UyoAkwa Ibom State High Court sitting in Uyo presided over by Justice Archibong Archibonghas sentenced a 36-year-old man, Destiny James Okon to death for armed robbery.\nJustice Archibong, in a two-hour judgement however discharged and acquitted two other accused persons, 40-year-old Ikechukwu Eme from Anambra State and Nwaigbo Kelechi, 36, from Ebonyi State, of the charges.\nThe trio were standing trial on a three-count of conspiracy, armed robbery, and unlawful possession of firearms.\n“From the total of the evidence, in this case, I can deduce that Musa is a fiction of the imagination of the accused persons.\nYou shall die in a manner to be directed by Akwa Ibom State Governor."
  },
  {
    "headline": "Property tussle: Late ex-COAS’ children agree out-of-court settlement with uncle",
    "summarized_story": "The children of the late former Chief of Army Staff (COAS), Lt. Gen. Luka N. Yusuf, and their uncle, Mr Emmanuel Yusuf, have agreed to an out of court settlement.\nThe children had dragged their uncle before a Kaduna Magistrate Court seeking the recovery of their father’s property in his custody.\nKDC/734/21, prayed that the court helps them recover their father’s property located at No.\n15, Bourmedience Road, Narayi High Cost, Kaduna, in possession of their uncle, Emmanuel Yusuf.\n15, Bourmedience Road, Narayi High Cost, Kaduna which the defendant occupied as a licensee and whose license was revoked on 25th October 2021."
  },
  {
    "headline": "Filling station queues vanish as fuel scarcity eases in Kaduna",
    "summarized_story": "Commercial bus and taxi drivers have also reduce transport fares which were increased for days while the scarcity lasted.\n“Before the fuel scarcity, I filled my motor tank with N13,500 and N14,000 respectively.\nMost filling stations; Oando, Jampet, Omapet, filling stations were selling at normal prices, as most drivers did not spend up to ten minutes before being attended to.\nAlhajji Salisu Magaji, a bus driver said, he only spent ten minutes before refilling his tank at Oando filling station.\nThe manager of the Oando filling station, Mr James Obochi told DAILYPOST that any fuel supply is carefully monitored, checked to ensure it’s not contaminated."
  },
  {
    "headline": "It’s not too late to reverse your anti-people policies – Pastor Giwa tells Buhari",
    "summarized_story": "The senior pastor of Awaiting The Second Coming Of Christ Ministry, Adewale Giwa has called on President Muhammadu Buhari to think twice and amend his mistakes on the anti-people policies introduced by his government since 2015 to date.\nGiwa, who stated this in Akure, Ondo State capital, while addressing his members, urged President Buhari to amend his ways.\nSpecifically, the fiery pastor questioned why President Buhari deliberately plunged the country into disorderliness since 2015 to date.\n“Let me also say this very clearly, before president Buhari runs out of time, he needs to amend his mistakes and think of his age.\n“President Buhari, by now, is 80 years of age."
  },
  {
    "headline": "Learn from Ugwuanyi – HURIWA tells Nigerian governors, condemns attack on commissioner",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has recommended the Governor of Enugu State for what it describes as the ‘Ifeanyi Ugwuanyi democracy model’.\nThe human rights advocacy group further hailed the administration for its zeal for consistent local government elections as currently practised in the state.\nIt said that Ugwuanyi’s leadership style should be replicated in the 36 states of the federation and the Federal Capital Territory.\nHURIWA said that the governors of the South-East must borrow a leaf on good governance and the ‘live and let live’ mantra of Governor Ugwuanyi as their leadership model.\nThe rights group further condemned the disquiet that happened in the state on Monday when the state Commissioner for Lands, Chidi Aroh, reportedly escaped death by the whiskers."
  },
  {
    "headline": "FG declares ASUU strike illegal after conciliatory meeting ends in deadlock",
    "summarized_story": "While the government insists that the demands raised by the union were already being met, ASUU thinks otherwise.\nAddressing stakeholders at the meeting, Ngige described the ongoing strike as a clear breach of the law, adding that the union did not go through the normal process before embarking on the industrial action.\nHe also faulted ASUU’s action, saying it did not give the Federal Government the minimum 14 days strike notice prescribed by the law, prior to the strike.\n“If you must notify us of intending strike action, you give us a minimum of 14 days’ notice.\nWe will meet again with them and the Nigeria Inter-Religious Council (NIREC) and we take it from there.” Ngige had stated."
  },
  {
    "headline": "Buhari swears-in six new INEC Commissioners",
    "summarized_story": "President Muhammadu Buhari has sworn in six new National Commissioners of the Independent National Electoral Commission (INEC).\nPresent at the inauguration of the Commissioners were Vice President Yemi Osinbajo; Senate President Senator Ahmad Lawan and Speaker Femi Gbajabiamila.\nThose sworn-in include Mohammed Haruna (Niger State); Mrs. Agbamuche Mbu (Delta); Okeagu Nnamdi (Abia); Major General Abubakar Alkali (Rtd.)\nSpeaking to State House Correspondents soon after the swearing-in ceremoney, Chairman of INEC, Professor Mahmood Yakubu, said Nigerians should expect the best out of INEC with the full complement of its commissioners.\n“Well, it’s a good day for the Commission, with the swearing in of the six National Commissioners, we have the full complements of 12 National Commissioners."
  },
  {
    "headline": "JUST IN: Court orders forfeiture of 10 properties, funds linked to ex-Zamfara Gov",
    "summarized_story": "JUST IN: Court orders forfeiture of 10 properties, funds linked to ex-Zamfara GovA Federal High Court in Abuja has ordered the interim forfeiture of about 10 properties and funds in banks allegedly owned by a former Zamfara Governor Abdulaziz Yari.\nJustice Obiora Egwuatu gave the order on Wednesday while ruling on an ex-parte application by a lawyer to the Independent Corrupt Practices and other related offences Commission (ICPC), Osuobeni Ekoi Akponimisingha.\nJustice Egwuatu said the interim order granted would last for 60 days to enable the ICPC to conclude its investigation, following which the commission could apply for final forfeiture.\nThe judge ordered the ICPC to publicise the order for any person or persons with interest in the affected properties to show cause within 14 days why they should not be permanently forfeited to the Federal Government.\nSome of the properties, according to the ICPC, are in Maryland (USA), Abuja, Kaduna, among others."
  },
  {
    "headline": "Police arrest three men for gang-rape",
    "summarized_story": "Three persons have been arrested in Lagos for allegedly gang-raping a minor.\nThe suspects, David Gideon, 21, Sodiq Olayitan, 24, and Mubarak Tajudeen, 23, were said to have abducted, gagged and took turns to rape a 14-year-old girl at Lakeview Estate, Phase Two, Amuwo Odofin.\nIt was learnt that the incident occurred around 5:30pm on February 14 and the boys who committed the crime were four.\nPolice spokesman Adekunle Ajisebutu said efforts were on to arrest the fourth suspect.\nAjisebutu said the police moved to the scene as soon as they received information, adding that they recovered a cutlass, dagger, hammer and charms from the suspects."
  },
  {
    "headline": "BREAKING: Aisha Buhari makes historic visit to Senate Chambers",
    "summarized_story": "The First Lady, Mrs Aisha Buhari is in the Senate Chambers.\nMrs Buhari’s visit to the Chambers is historical as she appears to be the first wife of a President to be received into the Senate Chambers.\nShe is in the Senate chambers to witness the laying of the report of the Senate Constitution Review Committee.\nThe Senate deferred the submission of the report to a later time during the proceedings to allow Mrs Buhari to arrive.\nThe First Lady is accompanied on the visit by the Minister of Women Affairs Mrs Pullen Tallen; Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed and some of her personal aides."
  },
  {
    "headline": "Oil hits $97 on Russia-Ukraine war game",
    "summarized_story": "- Advertisement -“Those who have bet on such a move anticipated the escalation of the conflict, ” said Tamas Varga of oil broker PVM.\nJulius Baer analyst, Norbert Rucker, added: “We see the oil market in a period of frothiness and nervousness, spiced up by geopolitical fears and emotions.\n..We therefore need to continue to assess the gas and energy market dynamics both in the short, medium, and long-term timeframe with the aim of taking market opportunities and collectively address the challenges.\nThe Ukraine crisis has added further support to an oil market that has surged on tight supplies as demand recovers from the COVID-19 pandemic.\nTalks are ongoing on renewing Iran’s nuclear agreement with world powers, which could eventually boost Iran’s oil exports by more than 1 million barrels per day."
  },
  {
    "headline": "BREAKING: Early morning fire guts Finance Ministry basement",
    "summarized_story": "From Uche Usim, AbujaAn early morning inferno on Wednesday razed some parts of the basement of the Finance Ministry headquarters.\nFrom the breached batteries came multiple sparks that eventually set the basement on fire.\nA fire service truck on the premises was immediately deployed to tend the fire, thereby avoiding a major disaster.\nAlthough no life was lost, the pungent smoke that billowed from the basement nearly choked a cleaner who was there at the time.\nA senior official at the ministry told Daily Sun that a full-blown investigation would be carried out to ascertain the immediate and remote cause of the fire."
  },
  {
    "headline": "National convention: Finally, APC agrees on zoning",
    "summarized_story": "The decision was part of the outcome of the meeting between President Muhammadu Buhari and APC governors in Abuja, yesterday.\nThe governors had tabled their decisions on the forthcoming national convention of the party before the president during the meeting which lasted for about 15 minutes.\nGoing by the agreement, the positions to be swapped to the north are National Chairman, National Organising Secretary, National Youth Leader, National Auditor and National Deputy Publicity Secretary.\nIn the same vein, the positions to be taken up by southerners in the party are National Secretary, National Treasurer, National Woman Leader, National Youth Leader, National Publicity Secretary, National Deputy Organising Secretary and National Special Leader.\nSo, by the grace of God, on the 26th of March, we would have done our national convention,”The Kaduna governor said the APC governors were divided over the timing of the national convention."
  },
  {
    "headline": "…Postponement: Kalu thanks Buhari, Buni for consideration of request",
    "summarized_story": "Chief Whip of the senate, Dr. Orji Uzor Kalu, has applauded President Muhammadu Buhari and Chairman, Caretaker/ Extraordinary Convention Planning Committee of the All Progressives Congress (APC), Governor Mai Mala Buni, for the postponement of the party’s national convention earlier scheduled for February 26.\nKalu, who recently returned from Germany, said the decision was in tandem with his earlier request to the president and National Caretaker Chairman of the party.\nHe noted that getting it right was more important than just holding a convention for the sake of it.\n“I was misunderstood in some quarters when I pleaded with the party to consider postponement of the convention.\nHowever, it is important to put into consideration, the consequences of these factions during and after elections."
  },
  {
    "headline": "Electoral bill: Buhari’ll sign in matter of hours –Presidency",
    "summarized_story": "President Muhammadu Buhari would assent the revised Electoral Act amendment bill in a matter of hours.\nIt could be signed today; it could be signed tomorrow.\nIn a matter of hours, not days.\nHours could be 24 hours, it could be 48 hours; not days, not weeks.”Nigerians can now work and earn dollars DAILY from home.\nAdesina said the bill was forwarded to the president nearly a month after the National Assembly passed it."
  },
  {
    "headline": "FG to spend N3.53trn on infrastructure, human capital development",
    "summarized_story": "From Aidoghie Paulinus, AbujaMinister of Finance, Budget and National Planning, Zainab Shamsuna Ahmed, has said the Federal Government would spend estimated N3.53 trillion on infrastructure and human capital development in 2022.\nShe stated this during a town hall meeting organised by the Ministry of Information and Culture on the achievements of the Federal Government in infrastructure development in Abuja, yesterday.\nAhmed recalled that the Road Infrastructure Development and Refurbishment Investment Tax Credit Scheme (RITCS) was launched in 2019 to leverage private sector capital and expertise to construct, repair and maintain critical road infrastructure in key economic corridors and industrial clusters in Nigeria.\nShe stated that the RITCS scheme was designed to complement and ameliorate the burden of funding significant capital outlays on road projects by the Federal Government.\n“The Scheme commenced in 2019, with the president’s approval of 19 Road Projects covering 769.16 km and located in 11 states across the six geopolitical zones."
  },
  {
    "headline": "Breaking: Aisha Buhari Witnesses Submission of Constitution Review Report in Senate",
    "summarized_story": "Sunday Aborisade, AbujaFirst Lady of Nigeria, Mrs Aisha Buhari, was welcomed into the chamber of the Senate at exactly 11.58am on Wednesday.\nShe was in the Red Chamber to witness the laying of the report on 1999 Constitution Review.\nIt was envisaged that one of the provisions in the amendment was on women political empowerment.\nSenate President, Ahmad Lawan, welcomed the First Lady and her entourage.\nOn her entourage were the Women Affairs Minister, Mrs. Pauline Tallen, and the Minister of Finance, Zainab Ahmad, among othersDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Citing Emergence of Previous Chairmen, Buhari Okays Consensus for APC Convention",
    "summarized_story": "And we have in the past done them with national convention, but nothing again in the constitution stops them from being done outside the national convention.\nOther positions zoned to the North-central are National Vice Chairman (NC), Deputy National Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader and Zonal Special (Persons with Disability- PWD) Leader.\nFor the North-west, the positions given are National Vice Chairman (NW), National Legal Adviser, National Organising Secretary, National Financial Secretary, Deputy National Youth Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, zonal Women Leader, and Zonal Special (Persons with Disability – PWD) Leader, among others.\nNorth-east would produce Deputy National Chairman (N), National Auditor, National Vice Chairman (NW), Deputy National Financial Secretary, Deputy National Women Leader, Zonal Secretary, Zonal Youth Leader, among others.\nDeputy National Youth Leader6."
  },
  {
    "headline": "News in Photographs: Buhari, APC Govs Meet",
    "summarized_story": "President Muhammadu Buhari Tuesday met with governors elected on the platform of the All Progressives Congress at the State House Abuja.\nThe meeting held in the Council Chamber was also attended by Vice President Yemi Osinbajo.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Senate Constitution Panel Submits Report Wednesday, Says Omo-Agege",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate Committee on the review of the 1999 constitution will submit its report on Wednesday.\nThe Chairman of the committee, Senator Ovie Omo-Agege, stated this on Tuesday.\nOmo-Agege, who is also the Deputy President of the Senate, made the announcement while presiding over plenary due to the absence of Senate President, Ahmad Lawan.\nHe, however, said Lawan would give further details on the matter on Wednesday.\nHe added that the lawmakers would take the reports home on Wednesday and return on Tuesday, March 1, to vote on the amendments."
  },
  {
    "headline": "Return Nigeria’s Artefacts in Your Possession, Buhari Pleads with Nations, Institutions",
    "summarized_story": "•Says 1,130 Benin bronzes due back from Germany this yearDeji Elumoye in AbujaPresident Muhammadu Buhari has appealed to countries, institutions, and bodies, both private and public, to return Nigeria’s artefacts in their possession.\nBuhari also disclosed that 1,130 Benin bronzes would be returned to Nigeria by the German government before the end of this year.\nThe artefacts were repatriated from the University of Cambridge and University of Aberdeen, respectively, in the United Kingdom, after 125 years of their leaving the territory of present day Nigeria.\nAccording to the president, “These artefacts are part of the records of the history of the Benin people.\nBuhari also appreciated the Federal Republic of Germany, which was planning the process of repatriating 1,130 Benin bronzes to Nigeria this year from many of Germany’s public museums."
  },
  {
    "headline": "Leaked Audio: How Zamfara Governor, Matawalle Wastes Taxpayers’ Money, Lures Relatives Of Political Opponent With N20 Million",
    "summarized_story": "Leaked audio has exposed how Zamfara State governor, Bello Matawalle splashed N20 million on five relatives of the former federal lawmaker, Senator Kabiru Garba Marafa in an apparent move to buy them over.\nThe Zamfara State chapter of the ruling All Progressives Congress (APC) had been splintered into two factions at the time, SaharaReporters gathered.\nGovernor Bello Matawalle of Zamfara-stateOne faction pledged loyalty to Governor Matawalle while the other belonged to the camp of Marafa.\nIn an audio recording obtained by SaharaReporters, about five relatives of Marafa were heard discussing in Hausa, how the governor lured them with N20 million.\n“Are you aware that the N20 million has been set aside by the governor for us?"
  },
  {
    "headline": "Leaked Audio: How Zamfara Governor, Matawalle Wastes Taxpayers’ Money, Lures Relatives Of Political Opponent With N20 Million",
    "summarized_story": "Leaked audio has exposed how Zamfara State governor, Bello Matawalle splashed N20 million on five relatives of the former federal lawmaker, Senator Kabiru Garba Marafa in an apparent move to buy them over.\nThe Zamfara State chapter of the ruling All Progressives Congress (APC) had been splintered into two factions at the time, SaharaReporters gathered.\nGovernor Bello Matawalle of Zamfara-stateOne faction pledged loyalty to Governor Matawalle while the other belonged to the camp of Marafa.\nIn an audio recording obtained by SaharaReporters, about five relatives of Marafa were heard discussing in Hausa, how the governor lured them with N20 million.\n“Are you aware that the N20 million has been set aside by the governor for us?"
  },
  {
    "headline": "Leaked Audio: How Zamfara Governor, Matawalle Wastes Taxpayers’ Money, Lures Relatives Of Political Opponent With N20 Million",
    "summarized_story": "Leaked audio has exposed how Zamfara State governor, Bello Matawalle splashed N20 million on five relatives of the former federal lawmaker, Senator Kabiru Garba Marafa in an apparent move to buy them over.\nThe Zamfara State chapter of the ruling All Progressives Congress (APC) had been splintered into two factions at the time, SaharaReporters gathered.\nGovernor Bello Matawalle of Zamfara-stateOne faction pledged loyalty to Governor Matawalle while the other belonged to the camp of Marafa.\nIn an audio recording obtained by SaharaReporters, about five relatives of Marafa were heard discussing in Hausa, how the governor lured them with N20 million.\n“Are you aware that the N20 million has been set aside by the governor for us?"
  },
  {
    "headline": "Amid Raging Controversies At Home, Buhari's Minister, Abubakar Malami Jets Out To US",
    "summarized_story": "Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, is currently the United States of America amid many controversies, SaharaReporters has gathered.\nAbubakar MalamiMalami however had a stopover at Atlanta, capital of the U.S. state of Georgia.\nThough the reason why the minister is in the US is not clear, sources said it might be connected to the 2023 presidential election.\nSee Also Politics APC Youth Group Demands Resignation Of Nigeria’s Attorney-General, Malami, Over Plot To Impose Candidates On Party“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nObservers say Buhari’s silence amid all the controversies surrounding his minister is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "Amid Raging Controversies At Home, Buhari's Minister, Abubakar Malami Jets Out To US",
    "summarized_story": "Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, is currently the United States of America amid many controversies, SaharaReporters has gathered.\nAbubakar MalamiMalami however had a stopover at Atlanta, capital of the U.S. state of Georgia.\nThough the reason why the minister is in the US is not clear, sources said it might be connected to the 2023 presidential election.\nSee Also Politics APC Youth Group Demands Resignation Of Nigeria’s Attorney-General, Malami, Over Plot To Impose Candidates On Party“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nObservers say Buhari’s silence amid all the controversies surrounding his minister is an endorsement of the atrocities of one of his most trusted lieutenants, Malami."
  },
  {
    "headline": "EXTRA: Power failure is a thing of the past, says minister",
    "summarized_story": "Goddy Jedy Agba, minister of state for power, says power failure is a thing of the past in the country.\nThe town hall meeting, organised by the federal ministry of information and culture, was meant to showcase the achievements of the Buhari administration on infrastructure development.\nAdvertisementThe minister said the federal government is working hard to ensure that all houses are metered in the country.\n“Power failure is a thing of the past,” he said.\nOn his part, Babatunde Fashola, minister of works and housing, said his ministry is managing over 1,019 contracts involving 958 bridges and road projects across the country."
  },
  {
    "headline": "EXTRA: Power failure is a thing of the past, says minister",
    "summarized_story": "Goddy Jedy Agba, minister of state for power, says power failure is a thing of the past in the country.\nThe town hall meeting, organised by the federal ministry of information and culture, was meant to showcase the achievements of the Buhari administration on infrastructure development.\nAdvertisementThe minister said the federal government is working hard to ensure that all houses are metered in the country.\n“Power failure is a thing of the past,” he said.\nOn his part, Babatunde Fashola, minister of works and housing, said his ministry is managing over 1,019 contracts involving 958 bridges and road projects across the country."
  },
  {
    "headline": "Wale Okediran: Bola Ige never taxed his political mentees -- he didn't make himself a godfather",
    "summarized_story": "Wale Okediran, former member of the house of representatives, says Bola Ige, former attorney-general of the federation, was a respected mentor who did not portray himself as a political godfather.\nAdvertisement“Bola Ige was a mentor and he never behaved, conducted or portrayed himself as a godfather.\nHe was the one who persuaded me and the likes of Professor Sola Adeyeye to join politics,” he said.\n“I met Chief Bola Ige at his home during one of the meetings of our Association of Nigerian Authors (ANA).\nTheir meetings used to amuse me and I used to laugh."
  },
  {
    "headline": "Wale Okediran: Bola Ige never taxed his political mentees -- he didn't make himself a godfather",
    "summarized_story": "Wale Okediran, former member of the house of representatives, says Bola Ige, former attorney-general of the federation, was a respected mentor who did not portray himself as a political godfather.\nAdvertisement“Bola Ige was a mentor and he never behaved, conducted or portrayed himself as a godfather.\nHe was the one who persuaded me and the likes of Professor Sola Adeyeye to join politics,” he said.\n“I met Chief Bola Ige at his home during one of the meetings of our Association of Nigerian Authors (ANA).\nTheir meetings used to amuse me and I used to laugh."
  },
  {
    "headline": "37 directors fail FG's promotion exam for permanent secretary",
    "summarized_story": "Thirty-seven directors in the federal civil service have failed a promotion examination for the position of permanent secretary.\nAccording to the Punch, 37 out of 74 directors who sat for the examination failed.\nThe other 37 candidates passed the examination and have been invited for an “ICT proficiency test” on Thursday in Abuja.\nThe office of head of service said the highest score was 74 percent while the least score was 26 percent.\nThe exercise was meant to fill vacancies for solicitor-general of the federation and permanent secretaries retiring in 2022."
  },
  {
    "headline": "Fintech Focus: Why KYC compliance is crucial for fintechs",
    "summarized_story": "This article focuses on Know Your Customer compliance and fraud.\nTypically, access is restricted for users that do not fulfil KYC requirements.”It’s important to note that KYC is a continuous process.\n“When drafting KYC compliance strategy, fintechs need to balance customer needs with risk management,” Bammeke says.\nMore so, as the company expands, it should continuously improve the KYC process in line with new risks.\nInnovation in KYC: A peek into the futureCompared to legacy institutions known for slower, more nuanced KYC compliance procedures, fintechs are nimble and have quicker, more accessible processes as their services are fully digital."
  },
  {
    "headline": "AfricaWorks’ ambition transcends being a coworking space",
    "summarized_story": "After a minute in the lobby, Gregoire Schwebig, founder and CEO of AfricaWorks came out to meet me.\nAs we exchanged pleasantries, one question lingered; why is this French man building a home-grown business in Africa?\nMore than just a coworking spaceFor AfricaWorks, as the African tech and business ecosystem grows, it will continue to grow to support them across the continent.\nBeyond being a pan-African coworking space, it now wants to do more as it slowly transitions into a tech company.\nAfricaWorks in NairobiAmong other places, the company is also planning to open new space at the Kotoka international airport in Accra, Ghana."
  },
  {
    "headline": "A virtual art gallery in DRC connects local artists with global clients",
    "summarized_story": "Welcome to the engine room of Bandombe Galerie, a virtual art gallery that is the brainchild of Sisqo Ndombe.\nBandombe showcases and connects contemporary African artists with potential clients, globally.\n“It has given access to many African artists and their works to a wider audience and market,” he said.\nOne of those who bought up into Ndombe’s virtual gallery initiative is Rwanda-based painter, Izere Antoine.\nNigerian artist Onofua Dennis, who has also signed on with Bandombe talks glowingly of the virtual gallery."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Digitising informal retail in Africa",
    "summarized_story": "Share this article:Hello there,Since inception, we at Techpoint Africa have contributed to the growth of the African tech ecosystem.\nWe’re discussing how to spot NFT scams and MarketForce’s $40 million war chest.\nFortunately, our reporter, Bolu Abiodun has some tips on identifying NFT scams, and you can read all about it in Wash trading scams and money laundering; why NFT traders should be careful.\nMarketForce is not the only startup digitising the informal retail experience, with TradeDepot, SokoWatch, Omnibiz, and Alerzo doing the same.\nWhat else I’m readingHere’s what actually happens to all your online shopping returnsThe moral calculations of a billionaireOpportunitiesAltSchool Africa is hiring."
  },
  {
    "headline": "Wash trading scams and money laundering; why NFT traders should be careful",
    "summarized_story": "What is NFT wash trading?\nHow to spot NFT wash tradingEtherscan screenshot that shows a completed wash trade.\nSource: ChainalysisKnowing how blockchain works is required to spot or track NFT wash trading.\nAdvertisementInterestingly, Chainalysis tracked wash trading activities with blockchain analysis, which revealed how sellers go about their wash trading activities.\nNFT wash trading is sort of like a WhatsApp vendor sending you money to buy their products to make it seem like they’re making sales."
  },
  {
    "headline": "Techpoint Pitch Friday is back!",
    "summarized_story": "Share this article:After a long hiatus, Techpoint Pitch Friday is back.\nPitch Friday takes place on the second Friday of every month and provides an avenue for aspiring and existing entrepreneurs to share their businesses or ideas with an audience.\nSome of them include Kelvin Umechukwu of Bumpa, Abolarinwa Adegunloye of Arteasy, winner of the Most Outstanding Marketplace award at Techpoint Awards 2021, and Femi Aiki of Foodlocker, a Techpoint Pitchstorm alumnus.\nFor example, say you’re looking to raise from investors, you could get feedback that could help you refine your pitch.\nAll you have to do is register to pitch your startup here or as a part of the audience here, then save the date in your calendar."
  },
  {
    "headline": "MTN goes tech: How data overtook voice revenue",
    "summarized_story": "MTN has been on a strong push in recent years to diversify its business, pursuing new revenue streams in mobile data, technology, and related communications services to businesses, wholesale network services, fintech, and digital services.\nRead also: MTN’s 2021 results in five numbersThe telco’s intensity is coming from impressive growth in the data business.\nWith people consuming more data than calls, it is no surprise therefore that MTN is prioritising the former over the latter.\n“MTN has over 277 million subscribers in over 20 African countries with Nigeria and South Africa being the largest market.\nIt is already among the companies in South Africa with the 5G licence and is deploying at speed."
  },
  {
    "headline": "MTN goes tech: How data overtook voice revenue",
    "summarized_story": "MTN has been on a strong push in recent years to diversify its business, pursuing new revenue streams in mobile data, technology, and related communications services to businesses, wholesale network services, fintech, and digital services.\nRead also: MTN’s 2021 results in five numbersThe telco’s intensity is coming from impressive growth in the data business.\nWith people consuming more data than calls, it is no surprise therefore that MTN is prioritising the former over the latter.\n“MTN has over 277 million subscribers in over 20 African countries with Nigeria and South Africa being the largest market.\nIt is already among the companies in South Africa with the 5G licence and is deploying at speed."
  },
  {
    "headline": "Five digital products propelling MTN towards tech",
    "summarized_story": "BusinessDay takes a look at five digital products propelling MTN towards being a technology company.\nMoMoMoMo is an acronym for mobile money, which allows registered agents to perform transactions for customers.\nMoMo is used to send money to any MTN mobile phone user, registered or not, as well as to mobile phone users on other local networks.\nAlso, it is used to withdraw cash at any authorised MTN Mobile Money agent, top-up MTN airtime, pay bills, buy and pay for insurance, payment of employee salaries, airline tickets, school fees, and other goods and services.\nIt has incorporated sophisticated end-to-end encryption to keep its users’ data safe and ensure their privacy."
  },
  {
    "headline": "Leave politics for politicians, do your jobs as professionals, Obaseki charges new Permanent Secretaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… preaches against disunity, disharmony in EdoBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, swore in nine new Permanent Secretaries with a charge to act responsibly in the discharge of their duties.\nThe newly sworn in Permanent Secretaries include: Iryn Omorogiuwa, Efosa Aisien, Nyamali Erumuse, Igbinomwanhia Abieyuwa, Imoihosen Oziegbe, Peter Osagie, Sabina Chikere, Osawemwenze Kayode-Iyasere and Bernard Aigbe.\nYou are not the political heads of these agencies and ministries; leave politics for politicians and do your jobs as professionals.\nEdo is one; whether you are Edo South, Edo Central or Edo North, Edo is one.\nResponding on behalf of the newly sworn-in Permanent Secretaries, Mr. Bernard Aigbe, thanked the governor for finding them worthy for the appointment, pledging not to fail in their duties."
  },
  {
    "headline": "Obaseki inaugurates eight-man private property protection c’ttee to improve land administration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated an eight-man Edo State Private Property Protection Law Implementation Committee charged with the responsibility of improving land administration in the state and supporting the government’s efforts at checking the activities of land grabbers and property speculators in communities across the state.\nObaseki, while inaugurating the committee at the Government House in Benin City, said his administration amended some aspects of the Edo State Private Property Protection Law to strengthen the committee’s capacity to effectively and efficiently deliver on its duties.\nHe said, “This committee was set up to arrest and restrain offenders who contravene provisions of the Edo State Private Property Protection Law 2021.\nThey are also to receive, screen and conduct preliminary review proceedings on public and private petitions relating to the subject of this law.\n“We will ensure peace in our communities and state, ensuring that the act of selling people’s land is a thing of the past in Edo.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts. – Nigerian Observer",
    "summarized_story": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts.\nShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Leadership and members of NBM of Africa Worldwide, Benin Zone, have congratulated the Benin Monarch, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, on the return of two looted Benin artifacts; bronze Cockerel (Okpa) and Uhunwun-alao (Head of Oba) by the Jesuit College of the University of Cambridge and University of Aberdeen, Scotland to the Oba of Benin.\nThe Benin Zone, NBM of Africa, in a statement issued by its Public Relations Officer (PRO), Comrade Idahosa Moses, on behalf of the President, Benin Zone, said that members of the movement heartily commended President Buhari and Oba Ewuare II for ensuring that the artifacts were returned safely to the Oba palace, where they were looted.\n“May God bless and keep safe His Royal Majesty and grant him good health, happiness, more wisdom and long life, Oba Gha Tokpere, Isee!!!”.\nThe Zonal PRO averred that the Benin artifacts transcend beyond mere artworks, as they are symbols of traditional heritage of the Great Benin Kingdom which must not be allowed to be domiciled outside the palace of the Oba."
  },
  {
    "headline": "Anti open grazing bill scales second reading in Edo assembly – Nigerian Observer",
    "summarized_story": "Hon.Okhuarobo said the bill also seeks to introduce modern methods of ranching.\nHon.Okiye noted that the bill, if passed would eliminate the dangers associated with open grazing.\nOther lawmakers unanimously supported the passage of the bill with a call on the security agencies in the state to step up their game especially in rural communities.\nWith no dissenting voice, the speaker thereafter subjected the bill to a voice vote and was unanimously supported by the lawmakers.\nThe speaker, directed the clerk, Yahaya Omogbai to forward copies of the bill to the house committee on food security."
  },
  {
    "headline": "Aisha Buhari attends as Omo-Agege submits constitution review report at senate",
    "summarized_story": "Wife of President Muhammadu Buhari, Mrs. Aisha Buhari, is currently at the senate to witness the presentation of a report on constitutional amendment by deputy senate president, Ovie Omo-Agege.\nMrs. Buhari walked into the red chamber alongside Pauline Tallen, minister of women affairs, at 12:00 noon on Wednesday.\nSenate President Ahmad Lawan who recognized her presence, said, “Let me on behalf of all of us welcome to the chamber the First Lady of the Federal Republic of Nigeria, the mother of the nation.\n“Let me recognise the presence of the honourable minister of women affairs who is a friend of the senate.”After she was settled in, Abdullahi Yahaya, senate leader, moved a motion for Ovie Omo-Agege, deputy president of the senate and chairman of the constitution review committee, to present the report.\nWhile presenting the report, Omo-Agege said there is a provision for 36 slots in the senate meant for only women."
  },
  {
    "headline": "Buhari Swears In New INEC National Commissioners",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has sworn in six new national commissioners for the Independent National and Electoral Commission (INEC).\nThe INEC national commissioners are Mohammed Haruna from Niger State, Mary Agbamuche-Mbu from Delta State, Ukaegbu Nnamdi from Abia State, Major General AB Alkali (Rtd) from Adamawa State, Professor Rhoda Gumus from Bayelsa State, and Mr Sam Olumekun from Ondo State.\nThe President swore in the national commissioners on Wednesday while presiding over the Federal Executive Council meeting at the State House in Abuja"
  },
  {
    "headline": "Osun APC Primary: West Senatorial District Congratulates Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboLeaders of All Progressives Congress in Osun West Senatorial District, have congratulated the governor of the state, Mr. Adegboyega Oyetola on his emergence as the flagbearer of the party for July 16th governorship election.\nThe district in a congratulatory message signed by its chairman, Hon.\nOmolaoye Akintola, attributed the landslide victory of Governor Oyetola at the primary poll to his selfless service he rendered to the people of the state.\nThe statement read, “I am using this medium as the Chairman and on behalf of Osun West Senatorial District to say congratulations to Your Excellency – Alh.\nMeaning that ,all aspirants are members of the larger APC family and there is NO victor, No vanquished but we all won together which remains the focus of this District ”” Finally,I appreciate all – Leaders, members of the Party, Political Office holders both elected and appointed in this District for their continued prayers, supports and love always accorded our Party-led Government headed by God’s chosen Gov–Alh Isiaka Adegboyega Oyetola”"
  },
  {
    "headline": "Buhari reportedly postpones signing of Electoral Act Amendment Bill till Friday",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has reportedly postponed signing of the re-worked Electoral Act Amendment Bill till Friday, February 25.\nA source close to the Presidency, who had earlier indicated that the President would assent to the bill on Wednesday, confirmed the new date to Channels Television.\nAccording to the source, the new date will be honoured by the President.\nThis comes at a time when President Buhari is presiding over the Federal Executive Council meeting at the State House in Abuja."
  },
  {
    "headline": "Babatunde Ogunnaike, Co-author Of National Anthem Dies At 65",
    "summarized_story": "Babatunde Ogunnaike, co-author of the national anthem, is dead.\nHe became a co-author of the national anthem after his submission for a competition organised by the federal government, calling for entries for lyrics for the new national anthem, was chosen.\nAderibigbe, John Ilechukwu, Sota Omoigui, and Eme Etim Akpan — were combined to form the new national anthem which was adopted in 1978.\nADVERTISEMENTOgunnaike, who was born on March 26, 1956, in Ogun state, attended the University of Lagos (UNILAG) for his bachelor’s degree, graduating with first-class honours in chemical engineering in 1976.\nHe later earned a master’s degree in statistics from the University of Wisconsin-Madison in 1981 and also graduated with a PhD in chemical engineering from the same university in 1981."
  },
  {
    "headline": "NSCDC Confiscates 201 Bags Of Cannabis Sativa Worth N200m In Lagos",
    "summarized_story": "Operatives of Lagos State Command of Nigerian Security and Civil Defence Corps (NSCDC) have said they have confiscated about two hundred and one bags of suspected Cannabis Sativa weighing approximately between 45 to 50kilogram per bag worth N200 million in Lagos.\nBriefing journalists in Lagos, the Lagos State Commandant of the NSCDC, Okoro Douglas, about nine Ghanaians National suspects were arrested during a sea patrol in the midnight by the Marines Unit of the state Command.\nThe suspects were identified as Victor Muda, 36; Freeman Gasu.\n25; Moses Soffie, 52; Adotete Joseph,31; Christian Tethe, 29; Kubu Okoripa, 25; Stephen Soffie, 26; Daniel Toyakoti, 35 and Kubu Natte, 36.\nDouglas said that the latest arrests were made on Monday when his men on a sea patrol intercepted the suspects with over 201 bags of suspected Cannabis sativa with nine foreigners from Ghana by the Marines Unit of the command."
  },
  {
    "headline": "Osinbajo, Lawan, Others Bid Angela Folarin Farewell At Burial",
    "summarized_story": "Prominent Nigerians including Vice President Yemi Osinbajo, Senate President Ahmed Lawan, Minister of Youths and Sports Development , Mr. Sunday Dare on Tuesday extolled the virtues of late Barrister Angela Folarin wife of a serving lawmaker, Senator Teslim Folarin.\nThey were among the top dignitaries that attended the burial of Mrs Angela Folarin who died on 28 January 28 in London at the age of 47.\nRev Father Felix Ethapeme, Dean North Deanery Diocese of ibadan in his short sermon described the late Angela as a loving, God fearing woman who committed her life to service to God and humanity.\n“She contributed immensely to the advancement of the church and the society during her lifetime”, the cleric said.\nADVERTISEMENTHe, however, urged the congregation to live to serve God and live an exemplary life that would glorify God and enhance a better society."
  },
  {
    "headline": "Court Jails Doctor 2 Years For Forgery",
    "summarized_story": "Justice Oluwatoyin Taiwo of the Lagos State Special Offenses Court in Ikeja has convicted and sentenced a medical practitioner, Wilfred Fajemisin to two years imprisonment for fraud and forgery.\nJustice Taiwo jailed Dr Fajemisin after she found him guilty of the three-count charge brought against him by the Economic and Financial Crimes Commission (EFCC).\nThe lead prosecution counsel, Samuel Daji called 7 seven witnesses including a handwriting expert, EFCC operative that investigated the case.\nThe judge held, “the prosecution must prove the ingredient of the alleged offence against the defendant.\nThere is substantial evidence that the defendant was found in the possession of the forged Deed of Assignment."
  },
  {
    "headline": "African Leaders Must Learn To Work With Good People In Opposition Parties – Jonathan",
    "summarized_story": "He noted that, the major challenges African leaders are having is that they have chosen not to work with members of the opposition parties while in office, because they see them as enemies.\n“Immediately you win the election you must be the president of everybody.\nADVERTISEMENT“It is not going to be a one-day business, it is going to be a business that we will do for one year.\nOther members will take over and maybe they will modify our action plan and also move on.\nThat will increase the opportunity of young people getting loans to develop businesses and also create jobs for others."
  },
  {
    "headline": "Buhari delivers 3 major projects too hard for Obasanjo, Jonathan",
    "summarized_story": "By Rotimi IjikanmiPresident Muhammadu Buhari administration has delivered three critical infrastructure projects, which for decades defied solutions from past administrations of Olusegun Obasanjo and Goodluck Jonathan.\nThe town hall meeting was organised by the Ministry of Information and Culture and the National Orientation Agency (NOA).\nIn a presentation, Fashola said that Apapa-Oworonshoki road in Lagos state which was notorious for gridlock and in bad shape for decades was one of the difficult projects.\nThe minister also identified Bodo-Bonny Bridge in Rivers which was the only access to the site of Nigeria Liquefied Natural Gas.\nThe minister said the administration awarded 1,019 infrastructure contracts covering 859 projects across the country and no state was left out without benefitting from the projects."
  },
  {
    "headline": "EU to admit travellers jabbed with WHO-approved shots",
    "summarized_story": "The EU has so far authorised vaccines produced by Pfizer-BioNTech, Moderna, AstraZeneca (when produced in Europe), Johnson & Johnson and Novavax.\nUntil now, most EU countries have not admitted people from outside the bloc travelling for non-essential reasons if they have been vaccinated with shots not approved in the EU.\n“Member states should lift the temporary restriction on non-essential travel to the EU for persons vaccinated with an EU- or WHO-approved vaccine,” said a recommendation adopted on Tuesday by EU governments which would be applicable from March 1.\nEU states also agreed to lift a temporary restriction on non-essential travel for people who have recovered from COVID-19 within 180 days prior to travelling to the EU.\nFor people inoculated with a WHO-approved vaccine, EU states could also require a negative PCR test taken at the earliest 72 hours before departure and could apply additional measures such as quarantine or isolation."
  },
  {
    "headline": "Smoke from Ekiti dumpsite sends 9 people to hospital",
    "summarized_story": "By Yinusa IsholaNo fewer than nine residents of Ilokun Government Reservation Area in Ado Ekiti have been hospitalised after inhaling thick smoke emanating from a dumpsite in the area.\nHeavy smoke generated from burning of the dumpsite was said to have enveloped the whole community few minutes after it was set ablaze.\nAjayi claimed she was rushed to the hospital, adding that she was restored to life with inhaler when she could not breathe properly after inhaling the smoke.\nShe said the best option was to relocate the dumpsite from the community.\nKeleku said the site was not set ablaze by workers of the agency as being speculated."
  },
  {
    "headline": "Buhari Swears-in 6 INEC Commissioners",
    "summarized_story": "PRESIDENT Muhammadu Buhari swore in the six newly appointed national commissioners of the Independent National Electoral Commission, INEC, on Wednesday.\nMallam Mohammed Haruna of Niger State, Mrs. May Agbamuche-Mbu of Delta, Ukaegbu Kenneth Nnamdi of Abia State, Major General A.\nB Alkali (retd) of Adamawa State, Prof. Rhoda Gumus of Bayelsa State, and Mr. Sam Olemekun of Ondo State are the six INEC Commissioners who took office.\nPresident Buhari held his weekly virtual Federal Executive Council, or FEC, meeting shortly after the ceremony.\nThe Head of Service, Folashade Yemi-Esan, and other ministers were virtually present at the meeting from their various Abuja offices."
  },
  {
    "headline": "Leaked Audio: How Zamfara Governor, Matawalle Wastes Taxpayers’ Money, Lures Relatives Of Political Opponent With N20 Million",
    "summarized_story": "According to leaked recordings, Bello Matawalle, the governor of Zamfara State, lavished N20 million on five relatives of Senator Kabiru Garba Marafa, a former federal legislator, in an apparent attempt to win them over.\nAt the time, the ruling All Progressives Congress (APC) in Zamfara State was split into two factions, according to SaharaReporters.\nIn an audio clip obtained by SaharaReporters, roughly five Marafa relatives were overheard in Hausa discussing how the governor enticed them with N20 million.\n“Are you aware that the N20 million has been set aside by the governor for us?\nMarafa is a descendant of Sambo Dan Ashafa, the founder of Gusau, the current capital of Zamfara State."
  },
  {
    "headline": "Abia Killing Meant To Provoke North, Don’t Retaliate — Islamic Group Tells Muslim Traders",
    "summarized_story": "The Muslim Rights Concern (MURIC) has reacted to the assassination of Northern businessmen in an Abia State cattle market.\nMURIC advised Northerners not to retaliate in Abia State, where roughly eight traders and cows were slain last week.\nThe event occurred at Omumauzor, Ukwa West Local Government Area of the State, at the New Cattle Market.\nA statement by MURIC’s Director, Professor Ishaq Akintola, said: “About fifteen (15) Northern traders and 150 cows belonging to the victims were killed in Abia State last week.\n“Our records show that this has occurred several times particularly in the last seven years without the North attempting to retaliate once."
  },
  {
    "headline": "Federal Ministry Of Finance Building On Fire",
    "summarized_story": "JUST IN: Federal Ministry Of Finance Building On Fire [PHOTO]The Federal Ministry of Finance building located in the Central Area of Abuja is currently on fire.\nBlack smoke was billowing from a part of the building on Wednesday.\nEyewitnesses said that the fire was caused by an explosion of expired inverter batteries in the basement of the Minister’s building.\nIt was learnt that the was no casualty nor any major damage to the building as security officers in the premises promptly put out the fire.\nAn official of the ministry described it as “a minor fire incident.”Our reporter gathered that the fire extinguishers strategically located in the premises were used to successfully fight the fire, even before the arrival of the Fire Service men."
  },
  {
    "headline": "Revealed! Real cause of fire incident at Federal Ministry of Finance",
    "summarized_story": "The Federal Ministry of Finance has clarified the major cause of the fire which erupted at its building in Abuja on Wednesday morning.\nAccording to a press statement by Yunusa Tanko Abdullahi, Special Adviser, Media and Communications to the Minister of Finance, Budget and National Planning, “The Federal Ministry of Finance is not on fire as reported on the social media.\nRather there was an incident on the corridor on the basement involving an isolated battery pack and it was quickly put out by the security personnel on duty.”The fire incident early Wednesday had caused panic among Abuja residents."
  },
  {
    "headline": "Happening now: Confusion as fire guts Federal Ministry of Finance headquarters",
    "summarized_story": "Fire is currently raging inside the headquarters of the Nigeria’s Federal Ministry of Finance in Abuja.\nThe Ministry’s building located within the Central Business District is also adjacent Federal Secretariat in the nation’s capital.\nAn eyewitness disclosed that operatives of the federal fire service are yet to arrive as at time of filling this report on Wednesday morning.\nDetails loading…"
  },
  {
    "headline": "APC Chairmanship: Consensus our best option, Buhari declares",
    "summarized_story": "Chairman of the APC Governors Forum and Kebbi state Governor Abubakar Atiku Bagudu said this Tuesday while briefing State House correspondents at the end of a meeting between the APC governors and President Buhari at the Presidential Villa in Abuja.\n“We have produced a number of national chairmen by consensus; Bisi Akande emerge as the pioneer chairman of the APC through consensus, John Oyegun emerged by consensus, Adama Oshiomhole emerged by consensus.\nHe said the APC governors had officially informed the president of the new date for the party’s national convention where officials are expected to be elected.\nAnd we have in the past done them with National Convention, but nothing again in the constitution, stops them from being done outside the national convention.\nHe said contrary to insinuations in some quarters, the APC governors are not divided."
  },
  {
    "headline": "BREAKING: Aisha Buhari Attends Plenary At National Assembly",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, on Wednesday attended the plenary sessions in both chambers of the Senate and the House of Representatives.\nMrs Buhari was at the National Assembly to throw her weight behind an item for amendment in the 1999 Constitution which seeks specific seats to be created for female legislators in the country.\nShe was accompanied to Senate Chamber by the Minister of Women Affairs, Pauline Tallen; and the Minister of Finance, Budget, and National Planning, Mrs Zainab Ahmed.\nSpeaker Femi Gbajabiamila announced to the House that the First Lady was in plenary to show support for women, in certain areas of the Constitution amendment which would benefit women.\nFirst Lady, Mrs Aisha @MBuhari, visits, admitted into House of Representatives Chamber."
  },
  {
    "headline": "UPDATED: Signing Of Electoral Act Amendment Bill Postponed Till Friday",
    "summarized_story": "President Muhammadu Buhari will now sign the re-worked Electoral Act Amendment Bill on Friday, February 25.\nThis comes at a time when President Buhari presides over the Federal Executive Council meeting held at the State House in Abuja.\nThe harmonised version was received by President Buhari a week later, as confirmed by his Senior Special Assistant on NASS Matters (Senate), Senator Babajide Omoworare.\nThe House had re-amended the bill to include the direct and indirect primary options while the Senate re-adjusted it to include the direct, indirect, and consensus modes of selecting political parties’ candidates.\nBoth chambers later passed the harmonised version – the final agreed version of the amendment to Clause 84 which included the direct, indirect, and consensus primary modes."
  },
  {
    "headline": "Russia ‘Highly Likely’ To Attack Kyiv – UK",
    "summarized_story": "Russian President Vladimir Putin is highly likely to launch a full-scale invasion of Ukraine and attack Kyiv, UK foreign minister Liz Truss said Wednesday.\nThe UK and US have repeatedly over the last weeks cited intelligence as indicating that Russia is planning an invasion of Ukraine.\n“We think it’s highly likely that he (Putin) will follow through on his plan for a full-scale invasion of Ukraine”, Truss told Sky News.\nPrime Minister Boris Johnson on Tuesday announced the first tranche of UK sanctions targeting five Russian banks and three billionaire oligarchs.\nTruss said Wednesday that the UK needed to “retain some sanctions in the locker” and had “more individuals that we will target in the event of a full-scale invasion”."
  },
  {
    "headline": "Strike: FG’s Meeting With ASUU Ends Inconclusive, Negotiation Rescheduled",
    "summarized_story": "The reconciliatory meeting between the Federal Government and the Academic Staff Union of Universities has ended inconclusively.\nAmid a warning strike declared by the lecturers, both parties failed to reach an agreement at the meeting held on Tuesday in Abuja.\nThe nation’s education sector was hit with another setback last Monday when Professor Osodeke announced that the union had embarked on a warning strike.\nASUU declared the strike to re-echo its demands of revitalisation of public universities, payment of earned allowances, improved funding of state universities, and promotion arrears for members.\nA week after the strike commenced, Ngige, while addressing Tuesday’s meeting, said the government was surprised that the lecturers could take such a decision."
  },
  {
    "headline": "Ukraine Mobilises Reserves As Moscow Doubles Down On Demands",
    "summarized_story": "Ukraine mobilised its military reserve Wednesday and urged its citizens to leave Russian territory as Moscow sharpened its demands, increasing fears of all-out war.\nMeanwhile, Ukraine urged its approximately three million citizens living in Russia to leave, as the crisis deepened despite intense international pressure on Moscow, backed by new economic sanctions.\nUS President Joe Biden later announced tough new sanctions against Russia for “beginning” an invasion of Ukraine, but said there was still time to avoid war.\nJapan and Australia followed suit early Wednesday with their own stringent penalties for Moscow and individuals connected with the aggression against Ukraine.\nBut he left the door open to a final effort at diplomacy to avert a full-scale Russian invasion."
  },
  {
    "headline": "Zamfara Impeachment Panel submits report on deputy Governor to Assembly -",
    "summarized_story": "The seven man investigative panel set up by the Zamfara State Chief Judge Kulu Aliyu to investigate allegations leveled against the state Deputy Governor Mahadi Aliyu Gusau has submitted it’s report to the state House of Assembly amidst tight SecurityAdvertisementAdvertisementSeven witnesses from the Complainant testified before the panel during it’s two days public hearing, though the deputy Governor did not appear before the fact finding CommitteeAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of bridge of the Constitution, Misappropriation of funds, gross misconduct and abuse of officeSubmitting its report to the principal officers of the Zamfara State House of Assembly, Chairman of the panel retired Justice Halidu Tanko Soba says the panel has done justice to all allegations tendered before itAdvertisementRepresented by Oladipo Okpeseyi, the Chairman says only two copies of the report was Produced by the panelHe urge the House to keep the report as secret as possible to the HouseAdvertisementResponding, the Speaker Zamfara State House of Assembly Nasiru Magarya assures the panel that the House will ensure fairness while considering the reportThe Speaker adds that the report will be treated according to the provisions of the Nigerian Constitution as amendedAdvertisementSubmission of the report is coming less than twenty four hours after the panel Concludes it’s public hearing with assurances that it will be fair to all partiesThe Deputy Governor had a few days ago at a press conference in Abuja says he has no confidence in the panel and any move to Impeach him remains illegalAdvertisementThe Panel has the following as MembersJustice Halidu Tanko Sabo (rtd) Oladipo Okpeseyi (SAN) , Abdul Atadoga Ibrahim (SAN) , Hussaini Zakariya’u (SAN) others are Amina Tanimu Marafa, Sani Mande and Ahmad Buhari Rabah while Barrister Ashiru Tsafe serves as the Secretary."
  },
  {
    "headline": "7 Man panel concludes sitting on Zamfara Deputy Governor, Mahdi Gusau -",
    "summarized_story": "A Public hearing on the allegations levelled against the Zamfara State Deputy Governor Mahdi Aliyu Gusau by the Seven Man Panel of Investigation set up by the state Chief Judge has endedThe panel says they are aware that the deputy Governor was notified to appear before it via email, watsapp, hard copies of the letter and other electronic meansAdvertisementThe panel also insisted that it was not served nor made aware of any restraining order preventing it from carrying out the exerciseThe Zamfara State House of Assembly is accusing deputy Governor Mahdai Aliyu Gusau of Misappropriation of funds, breach of the Constitution, Gross misconduct and abuse of OfficeAdvertisementIt has according kick-started the process of Impeaching the Deputy GovernorAdvertisementAdvertisementThe lawmakers had earlier this month requested the state chief judge Kulu Aliyu to set up a panel to Investigate the deputy Governor on allegations against himA few days later, the Chief Judge set up a seven man fact finding panelAdvertisementAdvertisementAt the first day of the public hearing, Seven Witnesses from the Complainant testified before the panel but no representative came from the respondentAdvertisementAbdul Ibrahim a Senior Advocate of Nigeria who is also a member of the Panel while addressing Newsmen at the end of the public hearing said the panel will be fair to all partiesHe adds that the panel is saddled with the responsibility to Investigate the allegations on the Deputy Governor and not declare anyone guilty of any offenceAdvertisementThe panel insists that the deputy Governor was duly served a notice to appear before it through available meansCounsel to the Zamfara State House of Assembly Nasiru Jangebe expressed Confidence in the panelAdvertisementThe Zamfara State Deputy Governor Mahdi Aliyu recently at a press conference described the impeachment exercise as illegal because a competent court of law had restrained any moves being made to Impeach himBut, the Panel says they are yet to be served with such an order from any Court of LawAdvertisementThe panel has three months to Submit it’s Report to the Zamfara State House of Assembly."
  },
  {
    "headline": "APC zones 2023 Presidency to Southern Nigeria",
    "summarized_story": "The All Progressives Congress will most likely choose its National chairman by consensus rather than by the ballot.\nThis was disclosed by the chairman of the progressives governors forum after a closed door meeting between the 22 APC governors and president Muhammadu Buhari in the presidential villa.\nAdvertisementAtiku Bagudu says Mr. President is disposed to the emergence of a consensus candidate and believes this will be in the interest of the party, but also says other aspirants who have indicated interest in the contest are also competent and qualified to occupy the office of national chairman.\nThe governors have unanimously agreed that zoning and consensus should be incorporated as part of arrangements for the national convention.\nAdvertisementGovernor of Kaduna state Nasir El-Rufai also revealed that the party has agreed on a zoning formula for all six geopolitical zones and the positions occupied by the northern zones in the last eight years will be swapped with the southern zones."
  },
  {
    "headline": "Youths threaten to sue female Engineer if she fails to join 2023 presidential race",
    "summarized_story": "A group of youths under the aegis of Ondo State Youth for Good Governance have vowed to drag a renowned engineer, Dr. Funmilayo Waheed-Adekojo to court if she fails to join the 2023 Presidential race.\nRising from its meeting in Akure, the Ondo state, the group said the Arigidi-Akoko born philanthropist has what it takes to transform Nigeria.\nAdvertisementThe youths said Funmilayo Waheed-Adekojo would be charged to court if she refuses to contest for the presidential election in 2023.\nThey pointed out that Nigeria needs a woman with wealth of experience in the business world and humanitarian gesture to change the face of politics in NigeriaAdvertisementAccording to a statement issued at the end of the meeting and signed by Organizing Secretary of the group, Abiloro Feranmi and Publicity Secretary, Alade Sunday Olumide, Funmilayo Waheed-Adekojo will serve Nigeria better if given chance to serve Nigeria."
  },
  {
    "headline": "ECOWAS Rejects Mali’s Five-year Transition Proposal",
    "summarized_story": "He spoke on Tuesday in Lagos during a press conference at the end of a two-day strategic retreat of the ECOWAS Council of the Wise.\nJonathan stressed that the proposal for a five-year transition period for the military regime by the Malian parliament was unacceptable because the time was not only too long, but also untenable.\nThe president stated, “If the parliament approves that, I don’t believe ECOWAS will accept it.\nECOWAS Authority of Heads of State will discuss it, but I believe ECOWAS may not accept it.\nThey are not elected members of the parliament and that is why ECOWAS parliament won’t even accept them to meet with the ECOWAS parliament."
  },
  {
    "headline": "Nigeria: Citing Emergence of Previous Chairmen, Buhari Okays Consensus for APC Convention",
    "summarized_story": "And we have in the past done them with national convention, but nothing again in the constitution stops them from being done outside the national convention.\nOther positions zoned to the North-central are National Vice Chairman (NC), Deputy National Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader and Zonal Special (Persons with Disability- PWD) Leader.\nFor the North-west, the positions given are National Vice Chairman (NW), National Legal Adviser, National Organising Secretary, National Financial Secretary, Deputy National Youth Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, zonal Women Leader, and Zonal Special (Persons with Disability – PWD) Leader, among others.\nNorth-east would produce Deputy National Chairman (N), National Auditor, National Vice Chairman (NW), Deputy National Financial Secretary, Deputy National Women Leader, Zonal Secretary, Zonal Youth Leader, among others.\nDeputy National Youth Leader6."
  },
  {
    "headline": "Nigeria, Iraq Kick Against Hike in OPEC Oil Output as Prices Surge Towards $100",
    "summarized_story": "Nigeria and Iraq have said the strategy employed by the Organisation of Petroleum Exporting Countries (OPEC) and its allies, OPEC+, to gradually raise oil production is enough to balance the market.\nThe country should meet its quota for February of around 4.3 million barrels a day, he noted.\nMeanwhile, the Chief Executive of Vitol, one of the world’s biggest oil traders, expects oil prices to climb to $100 and remain at that level for an extended period of time.\nThis bullish prediction, he said, was driven by a belief that global demand would surge in the second half of the year and could surpass 100 million barrels per day.\nOil prices will go higher, and they would stay there for an extended period of time, said the chief executive of Vitol, Russell Hardy."
  },
  {
    "headline": "‘Rest in Power’: Arbery’s Killers Guilty on All Federal Hate-Crime Charges",
    "summarized_story": "The three white men convicted of chasing down and murdering a young Black man, Ahmaud Arbery, as he was out jogging in their suburban Georgia community, were found guilty on Tuesday of committing federal hate crimes and other offenses in the 2020 killing.\nRelatedStories No Content Available“Ahmaud will continue to rest in peace but he will now begin to rest in power,” Wanda Cooper-Jones, Ahmaud’s mother, said outside the courthouse after the verdict was read.\nThe hate-crimes felony, the most serious of the charges the defendants faced, carries a maximum penalty of life in prison.\nIn a rare move, the judge last month rejected the plea deal after Ahmaud’s family implored her not to accept it.\n“What we got today, we wouldn’t have gotten today if it wasn’t for the fight that the family put up,” Cooper-Jones said."
  },
  {
    "headline": "West Unveils Sanctions with More Ready If Russia Launches Full-Scale Ukraine Invasion",
    "summarized_story": "The United States dismisses that justification as “nonsense”.\n“To put it simply Russia just announced that it is carving out a big chunk of Ukraine,” U.S. Presidnt Joe Biden said on Tuesday.\nRussia’s two largest commercial lenders, Sberbank and VTB, would face American sanctions if Moscow proceeded with its invasion of Ukraine, a U.S. official said.\nA U.S. State Department official said sanctions that could be imposed in the near future “will not target oil and gas flows”.\nBritain announced sanctions on three billionaires with close links to Putin, and five smaller lenders including Promsvyazbank."
  }
]