[
  {
    "headline": "Police, residents differ over terrorist attack on Katsina community",
    "summarized_story": "The Katsina State Police Command confirmed on Wednesday that its operatives, made up of mainly mobile police, on Tuesday evening repelled a terrorist attack at Mararabar-Kankara community, Kankara Local Government Area of the state.\nThe police Area Commander for Dutsin-ma was also said to have led a reinforcement team to ward off the terrorists.\nThe spokesman also said that the police team was able to recover all the rustled animals from the terrorists.\nThe residents claimed that the terrorists attacked at least five communities including Gidan Dankunda, Kungiya, Gidan Kurty, Centan Dangera, and Gidan Malumfashi, all in the council.\n“They gathered together at Gidan Dankunda where they moved from community to community, killing and maiming people."
  },
  {
    "headline": "16 soldiers die, 18 wounded in Mali attacks",
    "summarized_story": "Twin attacks in Mali this week left 16 soldiers killed and wounded 18, the army said on Tuesday.\nThe statement of the army lifted a former toll of four soldiers dead and 17 injured, to the latest toll recorded on Tuesday.\nThe army said that thirty-seven “terrorists” were also killed during the attacks, with weapons and munitions captured.\nThe Islamic State group claimed responsibility for one of Monday’s attacks, on a military outpost in northeastern Mali.\nThousands of soldiers and civilians had been killed in the brutal conflict and hundreds of thousands of people had fled their homes."
  },
  {
    "headline": "Forget zoning, give ticket to who can win — Tambuwal tells PDP",
    "summarized_story": "The Sokoto State Governor, Aminu Tambuwal says the Peoples Democratic Party should give its presidential ticket to a candidate that can win the election, not minding what part of the country the candidate comes from.\n“I’m appealing to my party that we should be talking about how to win the election.\nNot just not zoning of where the President is coming from,” Mr Tambuwal said.\n“Because they believe they can win the election with him.\nThe governor’s comment comes amid agitation for the PDP to zone its presidential ticket to the south."
  },
  {
    "headline": "Hushpuppi: Court shifts hearing on Abba Kyari’s extradition to US till April 27",
    "summarized_story": "Kyari is wanted in the U.S. to stand trial for conspiracy to commit wire fraud, money laundering, and identity theft.\nThe application for his extradition was brought before the court by the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami, SAN.\nMalami said the extradition application was based on a request by the Diplomatic Representative of the U.S. Embassy in Abuja for Kyari to be surrendered for trial.\nThe AGF, in an affidavit that was filed in support of the extradition application, said he was satisfied that the offence in respect of which Kyari’s surrender was sought, is not political or trivial.\nThe court held that upon service of the processes, Kyari, would be at liberty to file his response within 14 days."
  },
  {
    "headline": "2023: PDP zoning committee for inauguration Thursday",
    "summarized_story": "By Dirisu YakubuAhead of May 28 Presidential convention of the Peoples Democratic Party, PDP; a 37-member zoning committee set up at the end of its 95th National Executive Committee, NEC, meeting will be inaugurated Thursday.\nThe committee is expected to recommend to the party whether zoning would help it return to power at the centre in 2023 or not.\nAppointed to serve in the committee are Governor Samuel Ortom of Benue state, his Enugu State counterpart, Ifeanyi Ugwuanyi, Taraba state governor, Darius Ishaku, former Adamawa state governor, Boni Haruna and chairman PDP disciplinary committee, Chief Tom Ikimi (Edo state).\nThe committee also has Omotayo Dairo (Ondo), Adewale Oladipo (Osun), Hosea Agboola (Oyo), David Jang ) Plateau) Austin Opara (Rivers), Attahiru Bafarawa (Sokoto), Adamu Maina Waziri (Yobe) and Mahadi Gusau (Zamfara).\nA chairman and secretary is expected to be named for the committee at the event."
  },
  {
    "headline": "Building Collapse: Lagos, insurance industry to enforce occupiers’ liability insurance",
    "summarized_story": "…As 480 buildings collapse in LagosBy Rosemary IwunzeTo curb the menace of building collapse, the Lagos State Government, in partnership with the insurance industry, is putting modalities in place to implement and enforce ‘Occupiers’ Liability Insurance’ in the state.\nThis came as the state government lamented that no fewer than 480 buildings had collapsed in Lagos State alone, in the last 44 years.\nSpeaking at a press briefing at the end of a stakeholders’ meeting on compulsory insurance (Public Buildings), in Alausa, Ikeja, Lagos, yesterday, the Director-General/CEO of the Lagos State Safety Commission, Mr. Lanre Mojola, said that the state government will ensure that Lagosians are safe and protected through the implementation of the Occupiers’ Liability Insurance.\nMojola said: “There is a need to enforce insurance of public buildings.\nOver 480 buildings have collapsed in Lagos State in the last 44 years."
  },
  {
    "headline": "Mother to sweep son's school premises 6 months for invading with thugs",
    "summarized_story": "A Magistrates’ Court in Ota, Ogun on Wednesday ordered a 40-year-old housewife, Biola Joshua, to sweep Iju-Ebiye High School premises for six months for invading her son ‘s school with thugs.\nDelivering a ruling, Magistrate Shotunde Shotayo ordered the convict to sweep the school from 8 a m. to 11 a.m. every day.\nEjezie said the convict and her accomplices assaulted the school principal and health officer of the school, causing them bodily injuries’.\nShe added that they also conducted themselves in a manner likely to cause breach of peace by invading and disrupting the academic activities of the school with thugs.\nThe prosecutor said that the offence contravened the provisions of sections 249(d),355 and 516 of the Criminal Code, Laws of Ogun,2006."
  },
  {
    "headline": "Court okays contempt charges against Amaechi in dispute over cargo tracking contract",
    "summarized_story": "A Federal High Court in Abuja on Wednesday directed the initiation of contempt proceedings against the Minister of Transportation, Rotimi Amaechi, following complaints that he flouted an earlier order made by the court.\nIn the suit, CASER alleged among others, that Amaechi has manipulated the appointment process to the benefit of two local and inexperienced firms – Medtech Scientific Ltd and Rozi International Nigeria Ltd.\n“In order to protect the sanctity of this honourable court, we have issued Form 48 against the Minister of Transportation.\n“The approval by Mr. President cannot waive the procurement process stipulated under the Public Procurement Act.\nAn order nullifying the entire process of appointing the 4th and 5th defendant as operator of the international cargo tracking note in the country."
  },
  {
    "headline": "Senate may challenge court verdict on Electoral Act, warns of negative precedence",
    "summarized_story": "The Upper Chamber of the National Assembly has warned that a crisis might be brewing if nothing is done to challenge the judgment of the Federal High Court sitting in Umuahia, which recently nullified the provisions of Section 84 (12) of the Electoral Act.\nIn a motion sponsored by Senator Thompson Sekibo (Rivers East), he described the judgment as a threat to the “legitimate functions” of the National Assembly.\nThe motion which got the support of 78 others Senators, cautioned that if the judgment is left unchallenged, “it will become a precedence on which any person approach the court and obtain judgment to ridicule the good intentions of the National Assembly as an institution.”The lawmakers also criticised the non-involvement of the Senate in the suit, emphasizing the need for the Senate to “show concern on the judgment especially when it was not given opportunity to represent itself in a matter that emanates from her legitimate functions.”Senator Sekibo said beyond laying precedence for any person to use the court to ridicule the good intentions of the National Assembly as an institution; noted that the law “was widely appreciated by the citizens of the country.”Citing the sections of the 1999 Constitution relied upon by the Court in reaching the judgment, the motion explained that Sections 228 (a, b and d) of the Constitution “confers more powers on the National Assembly, particularly on political parties and effective management of the electoral process by the Independent National Electoral Commission (INEC).”It further added that the meanings given to ‘civil service’ and ‘public service’ by Part IV of the Constitution is unambiguous, calling on the Court to set aside the judgment as it was reached “without due consideration of the Constitutional interpretation in Section 318 of the 1999 Constitution as amended.”Recall that Justice Evelyn Anyadike of the Federal High Court sitting in Umuahia recently declared as null, void, illegal and unconstitutional, Section 84 (12) of the Electoral Act, 2022 as amended; and asked the Attorney General of the Federation (AGF) and Minister of Justice to expunge the affected section from the Electoral Act, 2022, as amended"
  },
  {
    "headline": "Non-service of court papers stalls hearing of suit to extradite Abba Kyari to US",
    "summarized_story": "The non-service of the application by the Attorney General of the Federal (AGF) on the suspended Deputy Commissioner of Police (DCP), Abba Kyari on Wednesday stalled hearing in the extradition proceedings against him.\nThe extradition suit was filed at the Federal High Court in Abuja by the AGF.\nAt the mention of the case on Wednesday, lawyer to Kyari, Nureini Jimoh (SAN), told the court that his client was not yet served with the extradition application filed by the AGF.\nAkutah said the applicant could not serve before now because of Kyari’s involvement with the National Drug Law Enforcement Agency (NDLEA).\nHe assured the court that the applicant would effect service on the respondent (Kyari) by March 24 and prayed the court for an adjournment."
  },
  {
    "headline": "Real reasons I saved money for Anambra – Peter Obi",
    "summarized_story": "Former Anambra State Governor, Mr Peter Obi has explained why he saved money for the state during his tenure.\nObi had, during the twilight of his tenure as governor of Anambra State, announced that he was leaving behind N75 biliion for his successor, Chief Willie Obiano.\nObi stated the reason he saved massively for the state in a press release by his media aide, Mr Valentine Obienyem.\n“I often express surprise at their viewpoints, because even among animals, we see the practice of saving for tomorrow out of today’s surplus.\n“If, for example, one plans to buy a car next year, would one not start saving money for that?"
  },
  {
    "headline": "Boko Haram/ISWAP: 7,000 terrorists surrender in one week, will be rehabilitated – Nigerian Army",
    "summarized_story": "More than 7,000 Boko Haram and Islamic State’s West Africa Province (ISWAP) terrorists have turned themselves in.\nThe Nigerian Army said they surrendered in the past one week.\nMaj.- Gen. Christopher Musa, Theatre Commander, Operation Hadin Kai (OPHK) spoke to the News Agency of Nigeria (NAN) in Maiduguri on Wednesday.\nThe General said sustained operations against the ISWAP and Boko Haram led to significant successes.\nThe repentants and their families are to be profiled by the Army and others before they undergo rehabilitation processes, the commander disclosed."
  },
  {
    "headline": "Court okays contempt proceedings against Amaechi",
    "summarized_story": "A Federal High Court in Abuja has directed the initiation of contempt proceedings against the Minister of Transportation, Rotimi Amaechi following complaint that he flouted an earlier order made by the court.\nIn the suit, CASER alleged among others, that the Amaechi has manipulated the appointment process to the benefit of two local and inexperienced firms – Medtech Scientific Ltd and.\n“In order to protect the sanctity of this honourable court, we have issued Form 48 against the Minister of Transportation.\nRuling, Justice Okorowo agreed to suspend proceedings in the main suit, noting that: “Once the issue of contempt is raised, the court must suspend proceedings.\n“The approval by Mr. President cannot waive the procurement process stipulated under the Public Procurement Act."
  },
  {
    "headline": "Who emerges as APC national chairman?",
    "summarized_story": "As at the last count, only seven of the 15 aspirants that initially threw their hats to the ring for the converted position of the national chairman will be on the ballot paper.\nWhile former Deputy National Secretary, Victor Giadom is being sponsored by Rotimi Amaechi, the Minister of State Petroleum Resources, Timprye Silva is also alleged to be backing the aspiration of former Deputy National Publicity Secretary, Yekini Nabena to become the party’s national vice-chairman.\nFrom the Northeast, the fate of Jagaban Jimeta and one-time national chairmanship aspirant, Chief Sunny Sylvester Mondiafe now aspiring to be the Deputy National Chairman (North) is shaky.\nThey include Senator Abdullahi Adamu, who is being tipped for the position of the National Chairman; Senator Ken Nnamani, Deputy National Chairman (South) and former House of Representatives Speaker, Yakubu Dogara, who may be coming on board as Deputy Chairman (North).\nOthers are Senator Iyiola Omisore, National Secretary; Victor Gaidom, National Vice Chairman South-south; and Osita Medener, National Vice Chairman, Southeast."
  },
  {
    "headline": "Defection: Court fixes April 11 for judgment in suit seeking Dogara’s sack",
    "summarized_story": "A Federal High Court, Abuja, on Wednesday, fixed April 11 for judgment in suit seeking for the declaration of the seat of Rep Yakubu Dogara vacant on account of his defection to the All Progressives Congress (APC).\nJustice Donatus Okorowo, who fixed the date, said though the judgment was earlier scheduled for today, it was not ready.\nDogara had, on July 24, 2020, defected from the PDP to the APC when he submitted a resignation letter to the chairman of the Bogoro ‘C’ Ward in the state.\nIn a related development, Justice Taiwo Taiwo had also, on Monday, ordered the 20 lawmakers from Cross River to vacate their seats following their defection from the PDP to APC.\nThe lawmakers comprises two House of Representatives members and 18 state’s House of Assembly members."
  },
  {
    "headline": "2023: Ortom, Ishaku, Ugwuanyi, 34 others in PDP zoning committee",
    "summarized_story": "The leadership of the Peoples Democratic Party (PDP) has nominated three Governors Samuel Ortom (Benue), Darius Ishaku (Taraba) and Ifeanyi Ugwuanyi (Enugu) as members of its 37-member committee to determine the zoning of the party’s 2023 presidential ticket.\nThe decision to set up the committee was taken at the party’s National Executive Committee (NEC) meeting on March 16, 2022.\nOther members include Chief Tom Ikimi (Edo), Mao Ohuabunwa (Abia), Emmanuel Ibokessien (A/Ibom), Prof. A.\nAlso on the list are Chief Olabode George (Lagos), Mike Abdul (Nasarawa), Prof Jerry Gana (Niger), Hon.\nThe party said the committee will be inaugurated on Thursday (tomorrow) at the Abuja national secretariat of the PDP at 11am."
  },
  {
    "headline": "Non-service stalls hearing in Abba Kyari’s extradition proceedings",
    "summarized_story": "The non-service of the application by the Attorney General of the Federal (AGF) on the suspended Deputy Commissioner of Police (DCP), Abba Kyari stalled hearing on Wednesday before a Federal High Court in Abuja in the extradition proceedings against Kyari.\nAt the mention of the case on Wednesday, lawyer to Kyari, Nureini Jimoh (SAN) told the court that his client was not yet served with the extradition application filed by the AGF.\nAGF’s lawyer, Pius Akutah, the Head of the Central Authority Unit (CAU) at the Federal Ministry of Justice, confirmed that the applicant was yet to effect service on the respondent.\nRead Also: Malami makes further clarifications on DCP Abba KyariAkutah said the applicant could not serve before now because of Kyari’s involvement with the National Drug Law Enforcement Agency (NDLEA).\nHe assured the court that the applicant would effect service on the respondent (Kyari) by March 24 and prayed the court for an adjournment."
  },
  {
    "headline": "BREAKING: Fire destroys Apongbon bridge in Lagos",
    "summarized_story": "An early morning fire has destroyed the Apongbon bridge , the main access route into Lagos Island.\nMany shops located under the bridge were destroyed in the fire outbreak at Apongbon market on Lagos Island.\nThe fire, which broke out on Wednesday morning, has caused a gridlock on the Eko Bridge.\nIt tweeted: “There’s currently fire incidence underneath Eko Bridge which has resulted to slow movement of motorists.\n“Motorists who are yet to connect Eko Bridge are advised to use alternative routes such as Third-Mainland Bridge and Carter Bridge."
  },
  {
    "headline": "Court judgment on Electoral Act splits Senate",
    "summarized_story": "Relying on Order 10 and 11 of the Senate Standing Rules, Sekibo urged his colleagues to suspend other activities and debate the issue.\nThose who went to court to challenge our action, didn’t include us as an interested party.\nHowever, Deputy President of the Senate, Ovie Omo-Agege, who presided, urged his colleagues to defer the issue until the President of the Senate, Ahmad Lawan, takes over on Wednesday.\nSenator Uche Ekwunife from Anambra State, however, argued that based on the Standing Rules, the deputy senate president, by law, becomes the president, anytime he was presiding.\nThe senate is expected to exhaustively debate the issue on Wednesday, after which their position would be made known."
  },
  {
    "headline": "FG commences investigation into crude oil theft",
    "summarized_story": "The task primarily seeks to ascertain the actual volume of crude oil stolen by vandals and saboteurs against recent allegations by some industry stakeholders regarding the volume of crude stolen on a daily basis from their operations.\nIn a statement signed by Gbenga Komolafe, the Chief Executive of Officer at NUPRC, the panel is to carry out a forensic investigation to cover the technical and commercial operations of oil companies involved in drilling and selling of crude oil.\n“Worried by incessant acts of sabotage by criminals and some unscrupulous persons within the industry, President Muhammadu Buhari had directed that all necessary mechanisms be activated to curb oil theft in particular and immediately end other forms of economic sabotage in the oil and gas industry.\n“The Commission thus considers worrisome, the crude loss figures recently being quoted in the media by some operators, given actions taken so far on the issue.\nHe also noted that the Commission was working with relevant security agencies to tackle oil theft."
  },
  {
    "headline": "George, Tambuwal clash over zoning of Presidency",
    "summarized_story": "From Ndubuisi Orji, Abuja and Chinwendu ObienyiBoard of Trustees (BoT) member of the Peoples Democratic Party (PDP), Chief Olabode George, and chairman of the PDP Governors Forum, Aminu Tambuwal, yesterday, exchanged fireworks over zoning of the presidency in 2023.\nThe Nigeria of 1998 is different from the Nigeria of 2022.”However, Chief George accused Tambuwal of beating the gun, as the party was yet to take a decision on zoning.\nHow do you win an election first and then come back to zoning?\nPut together in that state election, governorship, we had about 220,000 votes in between four political parties.\nBut you must plan to win election.”"
  },
  {
    "headline": "FG reiterates commitment to enhance security, capacity development in maritime industry",
    "summarized_story": "The Federal Government has reiterated its commitment to collaborate with relevant stakeholders to enhance security and capacity development in the maritime industry.\nThe Minister of State for Transportation, Sen. Gbemisola Saraki made this known at the inauguration of the Joint Committee on Security and Capacity Development for the Maritime Industry in Abuja.\nSaraki in a statement on Wednesday said the collaboration would improve security and strategies for the advancement of the maritime industry in the country.\n”It is aimed at improving security and strategies for the advancement of the maritime industry in line with global best practices.\nAjani said the committee would work toward building an efficient maritime industry that would guarantee sustainable socio-economic development."
  },
  {
    "headline": "NUPRC Sets Up Investigative Panel to Tackle Rising Oil Theft",
    "summarized_story": "The commission stated that the move was to ascertain the actual volume of crude oil stolen by vandals and saboteurs, against recent allegations by some industry operators regarding the volume of crude theft on a daily basis.\nThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, had on Monday lamented the unprecedented rate of oil theft recorded in recent times and its debilitating effect on government revenue and accretion to reserves.\nHe had revealed that up to 80 per cent of oil pumped in the country, particularly in the east, were stolen.\nKomolafe stated that commission was not unaware of the, “tragedy of oil theft” which he noted has been a plague on the industry and had last year triggered an industry-wide initiative aimed at curbing it.\nWhile stepping up efforts to deal with the issue of oil theft in collaboration with the military and other relevant agencies, the commission, he added, has mandated the newly constituted panel to investigate the claims regarding the volume of theft from the various oils fields."
  },
  {
    "headline": "Buhari: Nigeria’s Huge Dependence on Imported Agricultural Products to End Soon",
    "summarized_story": "The fertiliser plant, with installed capacity of three million metric tonnes of urea per annum, is located in Ibeju-Lekki, within the Lekki Free Trade Zone.\nAt the Dangote fertiliser plant, the president declared that the plant would further advance his administration’s drive towards self-sufficiency in food production in the country.\nIts integrated cement plants (quarry to bagging) have effectively ended Nigeria’s dependence on imported cement products.\n“This Dangote fertiliser plant with an installed capacity of over three million metric tons per annum is a very significant feat in the diversification agenda of Mr. President.\nThe Dangote Fertiliser Plant goes a long way in realising this vision not just for Nigeria, but for the entire continent."
  },
  {
    "headline": "Soludo: We’ll Get Water Out of Stone, With Anambra People Behind Us",
    "summarized_story": "Soludo explained that from the records at his disposal, Anambra had a debt of about N109 billion and between N300 million to N400 million in cash.\nWe’ll get water out of the stone, with the people working with us, mobilising with us, we will be able to get water out of stone.\nSoludo pledged that with on-going the discussions with all stakeholders, including the Indigenous People of Biafra (IPOB), the weekly forced stay-at-home will be a thing of the past soon.\nLaw and order are going to be the very first essence; it is at the foundation of everything, of every society.\nThe former CBN governor said, “But everybody knows that the state finances are not quite robust, to put it mildly."
  },
  {
    "headline": "Buhari Commissions $2.5bn Dangote Fertiliser Plant, Says It Will Boost Forex Earnings, Economic Growth",
    "summarized_story": "President Muhammadu Buhari says the 2.5 billion dollar Dangote Fertiliser Plant in Ibeju Lekki, Lagos, will boost Nigeria’s foreign exchange earnings and accelerate economic growth.\nHe said: “This fertiliser plant is further expected to enhance our administration’s drive towards achieving self-sufficiency in food production in the country.\n“I commend the Chairman, Board and Management of Dangote Industries Ltd., for their business initiative in establishing this plant.\nHe said the free trade zone today was host to Dangote Fertiliser Plant, which was the largest fertiliser plant in Africa and the second largest in the world.\nEarlier, Alhaji Aliko Dangote, President, Dangote Industries Ltd., said the fertiliser plant would drastically reduce the level of unemployment and youth restiveness through generation of direct and indirect employments."
  },
  {
    "headline": "Emefiele: Unprecedented Oil Theft Affecting Economy",
    "summarized_story": "Emefiele said this while briefing journalists at the end of the Monetary Policy Committee (MPC) meeting in Abuja.\nThe company sated, “AEEPCO remains gravely concerned about the persistent heightened attack on our production facilities and the NCTL.\nMPR is the rate at which the CBN lends to commercial banks and it often determines the cost of borrowing in the economy.\nEmefiele, who read the committee’s communiqué, however expressed worry that whereas global oil prices had gone up, this had been compounded by shortage of supply of petroleum products.\nMembers noted that the on-going war and the resultant sanctions against Russia will continue to have a considerable impact on the global supply chain as both countries are major players in the global commodities market."
  },
  {
    "headline": "BREAKING: Alleged IPOB Links: Enslaved Woman, Gloria Okolie Released On Bail After Over 9 Months Of Illegal Police Detention",
    "summarized_story": "A 21-year-old young woman, Gloria Okolie, has perfected her bail conditions and regained her freedom.\nSaharaReporters learnt that she regained her freedom on Wednesday after over 150 days of illegal detention by the Nigerian police before being taken to court.\nOkolie was arrested and had been enslaved since June 17, 2021, by the operatives of the Inspector-General of Police’s Intelligence Response Team (IRT) in Imo State.\nWhile reacting to the bail conditions her lawyers, Ihensekhien Samuel commended the judge for admitting her to bail though the terms were stringent but they would apply for variation in due course.\nOkolie and her co-defendant had remained in Suleja Correctional Centre custody pending the fulfilment of their bail conditions."
  },
  {
    "headline": "BREAKING: Alleged IPOB Links: Enslaved Woman, Gloria Okolie Released On Bail After Over 9 Months Of Illegal Police Detention",
    "summarized_story": "A 21-year-old young woman, Gloria Okolie, has perfected her bail conditions and regained her freedom.\nSaharaReporters learnt that she regained her freedom on Wednesday after over 150 days of illegal detention by the Nigerian police before being taken to court.\nOkolie was arrested and had been enslaved since June 17, 2021, by the operatives of the Inspector-General of Police’s Intelligence Response Team (IRT) in Imo State.\nWhile reacting to the bail conditions her lawyers, Ihensekhien Samuel commended the judge for admitting her to bail though the terms were stringent but they would apply for variation in due course.\nOkolie and her co-defendant had remained in Suleja Correctional Centre custody pending the fulfilment of their bail conditions."
  },
  {
    "headline": "How Amnesty International Turns Blind Eye To Human Rights Abuses In Nigeria, Bullies Staff",
    "summarized_story": "She then visited Amnesty International Nigeria, AIN, seeking help to get justice for her late husband.\n“This is not Amnesty International that we used to know,” said Ijeoma, the Executive Director, International Human Rights and Equity Defense Foundation (I-REF).\n“We are campaigning for a world where human rights are enjoyed by all,” Amnesty International declares on its website.\nThe situation in Amnesty International Nigeria is disappointing, “especially for those of us dealing with the Amnesty International before the Nigerian office was set up, said Ijeoma.\nHe explained that he visits media houses and human rights organisations as Commissioner for Internal Security and Home Affairs, either to disseminate security reports or present the Kaduna State government’s position on human rights violation investigations."
  },
  {
    "headline": "How Amnesty International Turns Blind Eye To Human Rights Abuses In Nigeria, Bullies Staff",
    "summarized_story": "She then visited Amnesty International Nigeria, AIN, seeking help to get justice for her late husband.\n“This is not Amnesty International that we used to know,” said Ijeoma, the Executive Director, International Human Rights and Equity Defense Foundation (I-REF).\n“We are campaigning for a world where human rights are enjoyed by all,” Amnesty International declares on its website.\nThe situation in Amnesty International Nigeria is disappointing, “especially for those of us dealing with the Amnesty International before the Nigerian office was set up, said Ijeoma.\nHe explained that he visits media houses and human rights organisations as Commissioner for Internal Security and Home Affairs, either to disseminate security reports or present the Kaduna State government’s position on human rights violation investigations."
  },
  {
    "headline": "ECOWAS Court Restrains Nigerian Government, Agencies From Stopping Peaceful Protests By Citizens",
    "summarized_story": "A civil society organisation, Faculty of Peace, and three others filed the suit marked: ECW/CCJ/APP/30/21 against the Nigerian Government.\nThe applicants had sued following a peaceful protest on March 28, 2021, to raise awareness on the hike in prices of fuel, sachet water and cement.\nHe said this at the opening of the 11th external court session of the court in Accra on Monday.\nThe chairman added, “Unless member states comply with the judgments of the ECOWAS Community Court of Justice, it will be difficult to build public confidence in the court.\n“I appeal to all member states to ensure that they comply with their treaty obligations by serving and obeying judgments of the court.”"
  },
  {
    "headline": "'APC haunted by its failures' -- PDP hits Femi Adesina",
    "summarized_story": "The Peoples Democratic Party (PDP) says the All Progressives Congress (APC) is unconcerned about the “suffering and agony” of Nigerians.\nIn a statement on Wednesday, Debo Ologunagba, PDP spokesperson, said the ruling party is “frustrated and haunted” by its failures in governance.\nOlogunagba said the APC “is running from their shadows and haunted by their failures in governance”.\n“The PDP holds that the EndSARS peaceful protest signifies the resilience of Nigerian youths against injustice, suppression and insensitive system being foisted on our nation by the APC administration.\nOur Party therefore cautions the APC to perish the thought of venting its frustration on the PDP and Nigerian youths."
  },
  {
    "headline": "'APC haunted by its failures' -- PDP hits Femi Adesina",
    "summarized_story": "The Peoples Democratic Party (PDP) says the All Progressives Congress (APC) is unconcerned about the “suffering and agony” of Nigerians.\nIn a statement on Wednesday, Debo Ologunagba, PDP spokesperson, said the ruling party is “frustrated and haunted” by its failures in governance.\nOlogunagba said the APC “is running from their shadows and haunted by their failures in governance”.\n“The PDP holds that the EndSARS peaceful protest signifies the resilience of Nigerian youths against injustice, suppression and insensitive system being foisted on our nation by the APC administration.\nOur Party therefore cautions the APC to perish the thought of venting its frustration on the PDP and Nigerian youths."
  },
  {
    "headline": "INTERVIEW: Growing up in ghetto motivated me to work harder, says Azuh Arinze",
    "summarized_story": "For Azuh Arinze, the ace Nigerian journalist and author, where there is a will, there is always a way.\nWhen it was time for me to fill out my JAMB form, I went for mass communication instead of law.\nHowever, the magazine came ahead of its time so much later I was recalled to Encomium magazine.\nI worked in Encomium for 14 years, and out of the 14 years, I was the editor for eight years.\nI think God just loves me extraordinarily."
  },
  {
    "headline": "INTERVIEW: Growing up in ghetto motivated me to work harder, says Azuh Arinze",
    "summarized_story": "For Azuh Arinze, the ace Nigerian journalist and author, where there is a will, there is always a way.\nWhen it was time for me to fill out my JAMB form, I went for mass communication instead of law.\nHowever, the magazine came ahead of its time so much later I was recalled to Encomium magazine.\nI worked in Encomium for 14 years, and out of the 14 years, I was the editor for eight years.\nI think God just loves me extraordinarily."
  },
  {
    "headline": "EXCLUSIVE: Petrol subsidy to cross N300bn as NNPC again delivers ZERO FAAC remittance",
    "summarized_story": "The costly petroleum subsidy bill may cross N300 billion next month as the landing cost of importing fuel skyrocketed amid the Russia-Ukraine crisis.\nSubsidy or under-recovery is the underpriced sales of premium motor spirit (PMS), better known as petrol.\nAdvertisementIn 2021, NNPC deducted N1.43 trillion which depleted FAAC revenue to N542 billion from a projected N2.51 trillion for the year.\nThe Nigerian Upstream Petroleum Regulatory Commission (NUPRC) remitted 109 billion, FIRS (Oil tax collection) at N105.3 billion (non-oil) N90.9 billion, while customs contributed N124.2 billion.\nAdvertisementThis year, the federal government has planned to spend up to N3 trillion to settle the petrol subsidy."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "The untold story of how ThriveAgric survived a turbulent 2020",
    "summarized_story": "He was one out of hundreds of ThriveAgric’s retail investors who hadn’t received the payments.\nThis affected ThriveAgric’s communication with its retail investors as it repeatedly failed to fulfil the promises it made to its retail investors.\nAll through this turbulent phase, the company maintains it didn’t take its retail investors for granted.\nUnexpected support and lessonsDuring the turbulent period, there was a lot of pushback from retail investors but also surprisingly a lot of support from investors, financiers, and friends.\n“Essentially, I ensured that the core business operations ran smoothly and built a system to ensure that the defaulting offtakers paid,” Eje said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Lessons from Egypt",
    "summarized_story": "With this raise, the startup intends to expand its operations to other African countries, starting with Ghana, Kenya, and Zambia.\nLessons from EgyptOver the past year, the Egyptian startup ecosystem has received more attention as its startups attract multi-million dollar investments.\nThe banks include the National Bank of Egypt, Banque du Caire, eFinance Investment Group, Egyptian Banks Company, and Banque Misr.\nHowever, this approach by Egypt’s biggest banks is a welcome development and could foster collaboration between banks and fintech startups in the country.\nRather than stifle growth, other African countries will do well to borrow a leaf from Egypt."
  },
  {
    "headline": "Speaking against toxic work cultures",
    "summarized_story": "Eventually, some ex-staff and current workers at the startup contributed to the piece either anonymously or with full disclosure.\nFor a moment, it appears we’re moving away from the reality that protecting employee interest in the Nigerian tech space is harder than it looks.\nSo far, the founder claims that Lendsqr already has over 100 lenders offering credit to almost half a million users.\nMonths before that, five other eCommerce startups have raised $275m combined in VC fund and debt financing.\nWith this raise, Apollo plans to spread its tentacles into West Africa and other parts of East Africa."
  },
  {
    "headline": "Lendsqr is building the Shopify for lending in Africa",
    "summarized_story": "Tying into his ambition to democratise banking in Nigeria, he is currently building Lendsqr, a startup that would create large-scale lending infrastructure in Africa.\nAdedeji OloweOlowe, who is on the boards of Sparkle and Paystack, has been neck-deep in Nigeria’s financial space, having previously been the chairman of TeamApt.\nHowever, building any lending solution is tough, but what the fintech mogul has planned with Lendsqr is a different beast entirely.\nLendsqr has painstakingly assembled a team of engineers and data experts with experience in Nigeria’s credit and tech space.\nConsidering this, any keen observer can guess Lendsqr will earnestly chase growth and try to corner the lending market."
  },
  {
    "headline": "Nigeria’s 32m-ton annual solid waste ripe for investments",
    "summarized_story": "The objectives of the national policy on waste include promoting a clean and healthy environment, promoting private sector investments in solid waste management, and creating wealth and employment from waste management.\nRead also: How strategic waste recycling can promote green LagosEfforts by industries to contain solid waste are showing results.\nWhile these are commendable, experts say they may be inadequate if Nigeria would extract the most value from its solid waste.\nChallengesAccording to Nigeria’s solid waste policy, a lack of a legislative framework to control the incidence of unsound waste management practices; and the inadequacy of existing infrastructure to adequately manage the amount and types of waste generated are key challenges to formalising the sector.\nThere are also poor monitoring and evaluation mechanisms to guide the environmentally safe and sound practices in solid waste management."
  },
  {
    "headline": "Nigeria’s 32m-ton annual solid waste ripe for investments",
    "summarized_story": "The objectives of the national policy on waste include promoting a clean and healthy environment, promoting private sector investments in solid waste management, and creating wealth and employment from waste management.\nRead also: How strategic waste recycling can promote green LagosEfforts by industries to contain solid waste are showing results.\nWhile these are commendable, experts say they may be inadequate if Nigeria would extract the most value from its solid waste.\nChallengesAccording to Nigeria’s solid waste policy, a lack of a legislative framework to control the incidence of unsound waste management practices; and the inadequacy of existing infrastructure to adequately manage the amount and types of waste generated are key challenges to formalising the sector.\nThere are also poor monitoring and evaluation mechanisms to guide the environmentally safe and sound practices in solid waste management."
  },
  {
    "headline": "Lagos sets pace in turning trash to treasure",
    "summarized_story": "From creating local equipment to aid waste disposal to forming partnerships with the private sector, Lagos State is setting up a winning model on how to formalise waste management in Nigeria.\nThe Lagos Waste Management Authority (LAWMA), a parastatal under the Ministry of Environment, serves as regulator and is headed by an investment banker, Ibrahim Odumboni, who used to head the agency’s business development drive.\nThere is also the Lagos Recycling initiative, which is aimed at encouraging the separation of waste from the point of generation for recycling purposes and encouraging waste to wealth.\nLagos is encouraging investors to develop solutions that will harness methane gas from waste at landfills to generate electricity.\nAdvocacy activities towards proper waste management have been ramped up."
  },
  {
    "headline": "Edo Para-Powerlifters Commence Training Ahead of Maiden National Para Games In Abuja – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Ahead of the commencement of the 1st ever National Para Games in Nigeria, Para-powerlifters in Edo State have commenced intense preparations for the Championship.\nThe maiden National Para Games scheduled to hold between April 9–16, 2022, at the MKO National Stadium, Abuja, is aimed at keeping the athletes in shape ahead of the next All African and Commonwealth Games as well as other international championships.\nShe assured that the state Para-Powerlifters would surpass the 2nd position feat achieved by the powerlifters at the just conducted South-South Para-Powerlifting Championship held in Benin City, Edo State.\nOn his part Mr. Omogbai Deniel George, a 107kg category Para-Powerlifter, assured sports enthusiasts in the state of winning a medal ( Gold) at the forthcoming National Para Games.\nHe disclosed that the state para-power lifters are fully preparing seriously in order to do Edo proud at the maiden Para games."
  },
  {
    "headline": "Police, NYSC strengthen ties in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Police Command and the National Youth Service Corps (NYSC) have again strengthened existing relationship towards improved security of corps members and their property in Edo State.\nThis came to the fore when the Edo State Coordinator of NYSC Mrs Abiodun Olubukola visited the police command headquarters, GRA, Benin City, yesterday.\nShe also lauded efforts of men and officers of the command at providing the needed protection for corps members in Edo.\nResponding, the acting Commissioner of Police in Edo State DCP Miller Dantawaye assured the Edo State Coordinator of NYSC of police continued support at all times.\nDCP Miller who is also incharge of operations at the command thanked the NYSC state coordinator for finding time to appreciate police efforts."
  },
  {
    "headline": "Obaseki: Edo deepening investment in tech, infrastructure, culture, people to withstand future pandemics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said that the state is deepening investment in technology, healthcare, infrastructure, culture and the people to withstand the shocks of future pandemics.\nObaseki said this during a virtual session at the 2022 Smart Cities Mayor’s Summit held in Taipei, the capital of Taiwan.\nMost of our strategy in terms of thinking of our future has been drastically changed as a result of the pandemic.\n“Our aspiration is to plan our cities and take the opportunity of the post-COVID-19 era to build infrastructure.\nThe Summit, which is the world’s largest networking platform among smart city governments, provides a high-level dialogue platform for global mayors and city leaders to exchange innovative strategies and visions on future city developments."
  },
  {
    "headline": "Nigeria can adopt solutions from Edo govt’s interventions to stem the slide – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… chides political elite for failing to engender devt… Edo attracts $500m investment into agric sectorBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said Nigeria can adopt the novel interventions and radical changes implemented in Edo State in tackling the myriad of challenges and stem the country’s current slide to economic and socio-political crisis.\n“In Edo, we had to take deliberate and intentional steps to retool our politics to engender development.\nThis has led to the introduction of people-centric policies and programmes which have won our administration significant public trust,” he said.\nCurrently, there is stable electricity to power public institutions and infrastructure in metropolitan Benin City.\n“In agriculture, we have attracted almost $500 million investment into palm oil cultivation, having allocated the first phase of 60,000 hectares of land under the Edo State Oil Palm Production Program (ESOPP)."
  },
  {
    "headline": "Inflation: Reps instructs CBN to for Nigerians to use coins",
    "summarized_story": "The House of Representatives has asked the Central Bank of Nigeria (CBN) to enforce the use of coins as a legal tender in the country in bid to check inflation.\nAccording to the lawmakers, the use of coins will tackle price inflation and stabilise the economy.\nAccording to Umar, the non-usage of coins has had a negative impact on daily business transactions in the country.\n“The coin should be brought back into circulation to be a legal tender like bank notes that we have in circulation.\nSubsequently, the lawmakers asked the CBN to ensure that banks comply with the “use of coins to the fullest”."
  },
  {
    "headline": "W/C Playoff: Leicester forward, Ademola Lookman finally arrives Eagles camp",
    "summarized_story": "Leicester City forward, Ademola Lookman who recently pledged allegiance to Nigeria, has arrived Super Eagles camp ahead of Ghana clash on Friday.\nHis arrival was announced via the official Twitter handle on the Super Eagles on Wednesday.\nHe now joins nearly about 20 other players who have already arrived camp, including Kenneth Omeruo, Emmanuel Dennis, Jo Aribo, Calvin Bassey and new invitee, Innocent Bonke.\nEagles interim coach Austin Eguavoen had released a provisional list of 32 players, with 25 on the main list, while seven more were placed on standby.\nThe 25-man main list is expected to be pruned to 23 before the qualifiersFacebook Notice for EU!"
  },
  {
    "headline": "Attack on Southern Kaduna: Death toll rises to 34",
    "summarized_story": "The death toll from an attack by gunmen at various communities in Kaura local government of Kaduna State on Sunday, has risen to 34.\nKaura is in the Southern part of Kaduna, an area that has continued to witness persistent attacks by bandits.\nHowever, Samuel Aruwan, Kaduna commissioner for internal security and home affairs, said more corpses were recovered after search operations by security agencies.\n“Security agencies have reported to the Kaduna state government that after search operations and detailed checks, 34 people have been confirmed dead following Sunday’s attack in Kaura local government area,” Aruwan said.\n“The Kaduna state government enjoins all residents to carefully observe the 24-hour curfew in force in the area."
  },
  {
    "headline": "Prince Emeka Obasi: Family announces final burial rites",
    "summarized_story": "Prince Emeka Obasi, an award-winning journalist and publisher of Business Hallmark Newspaper, who passed away on Tuesday March 15, will be buried on Thursday, April 14 at his country home in Umuaroko, Ndume Ibeku, Umuahia North Local Government of Abia State.\nAccording to a programme of event announced by Prince Emeka Obasi Jnr, on behalf of his family, the funeral rites will commence on Friday, April 8.\nThis will be followed by another service of songs on Wednesday April 13, 2022 at his home in Umuaroko, Ndume Ibeku, Abia State.\nAn interdenominational service will hold on Thursday, April 14 at Community Primary School, Ahiaeke Ndume, Ibeku, before interment.\nUntil his death, Prince Obasi who passed away at 58 after an illness, was the pounder, Public Policy Research and Analysis Centre, organizers of the Zik Prize in Leadership Awards."
  },
  {
    "headline": "Defection: C’River Gov, Ayade, Knows Fate March 25",
    "summarized_story": "Justice Taiwo Taiwo of a Federal High Court in Abuja, has fixed March 25, 2022 to deliver judgment in a suit filed by the Peoples Democratic Party (PDP) against Governor Ben Ayade of Cross River.\nThe PDP had dragged the governor to court seeking an order directing him and his deputy, Prof. Ivara Esu, to vacate their offices over their defection to the All Progressives Congress (APC) from PDP.\nThe governor and his deputy were elected on the platform of the PDP in 2015 and 2019 respectively, but defected to the APC on May 20, 2021.\nEarlier on Monday, Justice Taiwo sacked 20 lawmakers from Cross River State who defected alongside the governor to the APC.\nADVERTISEMENTIn the suit filed by the PDP, the party is praying the court for “a declaration that in view of the provisions of Section 221 of the Constitution of the Federal Republic of Nigeria, 1999 (as amended) and the democratic system of governance operated in Nigeria, votes at the elections are won by political parties and not their candidate or the candidates sponsored at the election by the political parties.”ADVERTISEMENT"
  },
  {
    "headline": "Youths Threaten To Disrupt 2023 Elections In Warri Over Electoral Wards",
    "summarized_story": "A group known as Itsekiri National Youth Council (INYC), has threatened to disrupt the 2023 elections in Warri, Delta State should the Independent National Electoral Commission (INEC) fail to honour a subsisting court judgment delivered in Benin City, Edo State, and an agreement entered into in 2019 to implement the recognised 10 electoral Wards in Warri South local government area instead of the 12 that is currently in use.\nAccording to him, as at 1999, Warri South had 10 electoral wards shared between Itsekiri people and other ethnic groups that make up the local government area, but INEC “mischievously” merged some of the wards dominated by Itsekiri and divided those of the non-Itsekiri to increase the number to 12 electoral wards so as to give the other groups undue political advantage over the Itsekiri people.\nAgbateyiniro revealed that they went to court against INEC and others and the judgment was in their favour, but INEC has refused to honour the court judgement, which was delivered since May 19, 2006 before the Hon.\nJustice P.F.\nOlayiwola of the Federal High Court, Benin Judicial Division."
  },
  {
    "headline": "Kwara Gov Moves To Grant Judiciary, Legislature Autonomy",
    "summarized_story": "Kwara State governor, AbdulRahaman AbdulRazaq, on Tuesday, sent two Executive Bills to the State House of Assembly, seeking to grant financial autonomy to both legislative and judicial arms of the state government.\nThe Bills are Kwara State Legislative Fund Management Bill 2022 and Kwara State Judiciary Fund Management Bill 2022.\nYakubu Danladi-Salihu, read the two separate messages from the governor on the Executive Bills during Tuesday’s plenary.\nThe Bills seek to confer autonomy on the state legislature and judiciary for the management and control of recurrent and capital expenditures in line with the provision of the Nigerian Constitution as amendedADVERTISEMENTGovernor AbdulRazaq urged the House to give the Bills the usual quick consideration and passage.\nSpeaker Danladi-Salihu later referred the two Bills to Business and Rules Committee of the House, asking the committee to slate the Bills for first reading at the appropriate time."
  },
  {
    "headline": "Kwara Gov Moves To Grant Judiciary, Legislature Autonomy",
    "summarized_story": "Kwara State governor, AbdulRahaman AbdulRazaq, on Tuesday, sent two Executive Bills to the State House of Assembly, seeking to grant financial autonomy to both legislative and judicial arms of the state government.\nThe Bills are Kwara State Legislative Fund Management Bill 2022 and Kwara State Judiciary Fund Management Bill 2022.\nYakubu Danladi-Salihu, read the two separate messages from the governor on the Executive Bills during Tuesday’s plenary.\nThe Bills seek to confer autonomy on the state legislature and judiciary for the management and control of recurrent and capital expenditures in line with the provision of the Nigerian Constitution as amendedADVERTISEMENTGovernor AbdulRazaq urged the House to give the Bills the usual quick consideration and passage.\nSpeaker Danladi-Salihu later referred the two Bills to Business and Rules Committee of the House, asking the committee to slate the Bills for first reading at the appropriate time."
  },
  {
    "headline": "Fourth Industrial Revolution Crucial For Nigeria’s Survival – Foundation",
    "summarized_story": "The Fourth Industrial Revolution(4IR) has been identified as crucial to the survival of Nigeria and other African countries which if utilized maximally will help to bridge the technology gap between Africa and the developed countries.\nThis development emerged during an event to showcase ‘4IR Education Africa’ organised Abuja recently where students from four government secondary schools displayed their knowledge on the 4IR.\nThe event was in line with the Foundations’ mission which is “To Keep implementing innovative socio-cultural and socio economic initiatives/interventions to transform African socio cultural values towards achieving a highly socio economically developed Africa.\nNow, the world is in the Fourth Industrial Revolution and most countries in Africa seem not to know what is happening.\nHe added that the foundation is giving the children technology knowledge and that is being done free of charge."
  },
  {
    "headline": "Buhari inaugurates terminal with 66 check-in counters for MMIA in Lagos",
    "summarized_story": "President Muhammadu Buhari has inaugurated the new Terminal Building of the Murtala Muhammed International Airport, Lagos.\nThe terminal has sixty-six check-in-counters, sixteen Immigration desks at arrival, twenty-eight Immigration desks at departure, and eight security screening points, among others.\n‘‘Similar projects at both the Nnamdi Azikiwe International Airport and Port Harcourt International Airport were completed and commissioned by this administration and our people have since been benefiting from the positive economic impacts of those magnificent terminals.\nThe Governor of Lagos State Babajide Sanwo-Olu said it was instructive that Lagos State in one day had witnessed the evolution of three major infrastructure development projects that will change the Nigerian landscape while commending President Buhari for the infrastructural renewal and redevelopment necessary for a city like Lagos.\nThe signing of the agreement for the partnership was later done by the officials of the Lagos State Government and FAAN."
  },
  {
    "headline": "Osun governorship: Why I chose Adewusi as my running mate",
    "summarized_story": "The candidate of the Peoples Democratic Party (PDP), Ademola Adeleke has given the reason he chose Prince Kola Adewusi as his running mate for the forthcoming Osun governorship election.\nThe Osun governorship election will take place on July 16, 2022.\nHe said he and Adewusi shared a common goal, which is to rescue Osun State from bad governance.\nAdeleke wrote: “I choose HON.PRINCE KOLA ADEWUSI as my running mate for the forthcoming gubernatorial election.\nSo I urge all party loyalists and the great people of Osun to support us.”The PDP governorship candidate is looking to unseat the incumbent governor, Adegboyega Oyetola, whom many people said has performed creditably."
  },
  {
    "headline": "7,000 terrorists surrender in one week",
    "summarized_story": "By Hamza SuleimanNo fewer than 7,000 Boko Haram/Islamic State West Africa Province (ISWAP) terrorists have surrendered to the Nigerian Army in the past one week.\nMusa said that the military onslaught against the ISWAP and Boko Haram terrorists in the North-East Region has continued to record significant successes.\nNAN reports that authorities said 30,000 insurgents and their families had so far surrendered to the Nigerian military in the last nine months.\nThe army renamed operation Lafiya Dole, the codename for its operation against Boko Haram, to operation Hadin Kai.\nTukur Buratai, the immediate past army chief, had in 2015 changed the name from operation Zaman Lafiya to operation Lafiya Dole."
  },
  {
    "headline": "Actress Toyin Adewale celebrates son, Mayorkun on his birthday",
    "summarized_story": "Veteran Nollywood actress Toyin Adewale, has taken to social media to celebrate her son and famous singer, Adewale Mayowa Emmanuel professionally known as Mayorkun on his birthday.\nThe poet, literary critic cum actress took to her Instagram page to share a video of Mayorkun who turns 28 today, March 23, 2022.\nThe doting mother in her post was full of joy as she showered praises on her son.\nShe wrote: “Happy birthday my big baby!\nMayorkun has a degree in accounting from the University of Lagos and was working as a banker, before he delved into music 2016."
  },
  {
    "headline": "Gunmen Invade Abuja Community, Kidnap Pastor, Two Siblings",
    "summarized_story": "Rev Yohana Joshua of the Evangelical Church Winning All (ECWA) and two sons of Danladi Bulus, the former secretary of the Local Education Authority (LEA) in Kuje Area Council of the FCT, have been kidnapped.\nFelix Bulus and Victor Bulus are the two siblings who have been kidnapped.\nThe ex-education writer was kidnapped for the third time in the previous two years, according to the Daily Trust.\nHe went on to say that the kidnappers went to the pastor’s house and kidnapped him as well.\nDSP Adeh Josephine, the FCT police command’s spokesperson, said she hated to accept that such an incidence occurred."
  },
  {
    "headline": "BREAKING: Many Policemen Feared Dead As Terrorists Attack Security Checkpoint In Katsina",
    "summarized_story": "BREAKING: Many Policemen Feared Dead As Terrorists Attack Security Checkpoint In KatsinaThere are worries that seven mobile police officers were killed late Tuesday evening in Katsina State when terrorists, often known as bandits, stormed a security post.\nAccording to SaharaReporters, the incident occurred around 11 p.m. on Sheme-Kankara road in the Kankara Local Government Area of the state.\nAs the policeman battled the terrorists numbering in the hundreds in a violent struggle, some citizens were alleged to have been killed by stray bullets.\nDespite being President Muhammadu Buhari’s home state, Katsina has seen intermittent attacks by bandits and kidnappers that have taken many lives.\nOn the same day, 84 Islamiyya students from Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area, were kidnapped but later rescued."
  },
  {
    "headline": "BREAKING: Fire Guts Popular Apongbon Lagos Market, Apongbon Bridge",
    "summarized_story": "An early morning fire outbreak on Wednesday has razed some shops at the Apongbon Under Bridge Market in Lagos.\nAccording to Ibrahim Farinloye, south West coordination of the National Emergency Management Agency, NEMA, ” the bridge has been physically damaged.\nFederal Ministry of Works have been called upon to close the bridge and carry out integrity tests to determine the safety of the bridge for further usage”.\nSome vehicles parked under the bridge were also gutted by the fire which has enveloped a large section of the bridge.\nOfficials of the Federal and Lagos State Fire Service are currently at the market trying to put out the fire."
  },
  {
    "headline": "OAU VC: Give Peace A Chance, Oyetola Appeals To Protesting Ife Citizens",
    "summarized_story": "Governor Adegboyega Oyetola of Osun has appealed to citizens of Ile-Ife who are protesting the choice of the new Vice Chancellor for the Obafemi Awolowo University to give peace a chance and stop the protest forthwith.\nTo this end, he urged all protesting citizens to exercise restraint and allow peace to reign.\n“By their nature and functionality, universities are rules- and convention-based conservative institutions premised on academic and governance autonomy.\n“If we have any reason to believe that these rules are circumvented, there are laid-down procedures to remedy such situations rather than resorting to self-help.\nWe must therefore not do anything to tarnish that enviable reputation, “ Oyetola added."
  },
  {
    "headline": "Tambuwal on 2023: Demography not zoning ‘ll determine Nigeria’s next president – Blueprint Newspapers Limited",
    "summarized_story": "The Chairman Peoples Democratic Party (PDP) Governors’ Forum and Sokoto state Governor Aminu Waziri Tambuwal has said more than anything, the factor of demography would determine who becomes president in 2023.\nHe said, “As leaders of our party, who are working towards winning election, not zoning, not winning tickets.\nBut you must plan to win election.\n“So we must accept these realities as a party and work with these realities to win election.\nWin election first, don’t win zoning, win the election and then we’ll come and share power, because the President and the Vice President cannot come from the same zone."
  },
  {
    "headline": "Buhari orders concession of Abuja, Lagos, Kano, Portharcourt airports",
    "summarized_story": "President Muhammadu Buhari has ordered the speedy concession of four new airport terminals constructed by a Chinese company at the international airports in Lagos, Abuja, Kano and Port Harcourt.\nHe explained that there would be air-rail connectivity between the domestic and international airports to shorten the traffic time between both terminals.\nHe appealed to President Buhari to direct the Nigerian National Petroleum Corporation (NNPC) to import Jet fuel in good quantity for operators in the industry.\nThe new Lagos terminal has the capacity to process 14 million passengers per annum and built on a land mass of approximately 56,000 square metres with 66 check-in counters.\nCCECC commenced construction of four new terminals at Lagos, Abuja, Kano and Port Harcourt airports in 2013 with completion period fixed for 20 months."
  },
  {
    "headline": "FG, States, LGs share N695.033bn for Feb 2022",
    "summarized_story": "The Federation Accounts Allocation Committee (FAAC), has shared a total sum of N695.033 billion to the three tiers of government for the month of February, 2022.\nAt its virtual meeting held Tuesday, the federal government received N236.177 billion, the States got N190.007 billion, and the Local Government Councils took home N140.612 billion.\nThe oil producing states received N23.750 billion as their share of 13 per cent derivation the sum of N23.989 billion was spent as Cost of Collection, just as N80.498 billion went to Transfers/Refunds.\nFederal government got N24.845 billion, States received N82.818 billion, Local Government Councils got N57.972 billion, while Cost of Collection to FIRS and NCS got N7.115 billion and Allocation to NEDC project received N5.123 billion.\nHowever, Import and Excise Duties, Companies Income Tax (CIT) and Value Added Tax (VAT) recorded considerable decreases."
  },
  {
    "headline": "Senate Asks IGP To Investigate, Prosecute Foreigners Maltreating Nigerians",
    "summarized_story": "The Senate has called on the Inspector General of Police, Usman Baba, to investigate and prosecute foreigners who maltreat Nigerians in various parts of the country.\nThey made the call in reaction to a motion by Senator Biobarakuma Degi-Eremienyo during Tuesday’s plenary in the upper chamber of the National Assembly in Abuja.\nSenator Degi-Eremienyo raised the motion for the urgent need to check the alarming trend of inhuman treatment and torture of Nigerian citizens by foreign nationals.\nCurb The TrendIn his contribution to the motion, Senator Isah Jibrin informed his colleagues that several cases of such have occurred.\nThey also want the Ministry of Labour and Employment, as well as relevant Ministries, Departments, and Agencies (MDAs) to take adequate steps to address the labour-related issues in respect of the incident and similar cases to curb the trend."
  },
  {
    "headline": "Panic As Fire Razes Shops At Apongbon Market",
    "summarized_story": "﻿An early Wednesday morning fire outbreak at Apongbon market has caused panic among road users and motorists around the area in Lagos.\nMany shops which were majorly constructed with planks were destroyed in the fire.\nThe fire outbreak led to a gridlock on the Eko and Carter Bridge.\nThe Lagos State Traffic Management Authority (LASTMA) announced via a tweet that the fire outbreak has resulted in the slow movement of motorists and advised that they use alternative routes.\n“Motorists who are yet to connect Eko Bridge are advised to use alternative routes such as Third-Mainland Bridge and Carter Bridge."
  },
  {
    "headline": "Kaduna Bandit Attacks: Death Toll Rises To 34",
    "summarized_story": "The number of people killed by bandits in Kaura local government area of Kaduna State during a series of attacks on Sunday has risen to 34.\nThis toll was confirmed by the Kaduna State Government on Tuesday.\nChairman of Kaura local government council, Matthias Siman, had pegged the figure at 26 on Monday.\nMeanwhile, the Kaduna state Governor, Nasir El-Rufai has expressed his grief over the attack, and sends his condolences to the families of the those who were killed.\nThe Governor also condoled the Military High Command, and the families of the military personnel who paid the ultimate price in the line of duty during the attack."
  },
  {
    "headline": "Buhari Commissions $2.5bn Dangote Fertiliser Plant In Lagos",
    "summarized_story": "﻿President Muhammadu Buhari has commissioned the Dangote Fertiliser Plant in the Ibeju-Lekki area of Lagos.\nPresident Buhari inaugurated the facility as part of activities lined up for his working visit to Lagos.\nThe Dangote Fertiliser Plant is Africa’s largest granulated urea fertiliser complex.\nIt is expected to help Nigeria retain $125 million in import substitution and provide $625 million from exports of products from the fertiliser plant.\nRise Of AgropreneursNigeria, President Buhari stated, also stands to gain extensively in earnings of foreign exchange from the excess production and export from the plant."
  },
  {
    "headline": "Black Box Of Crashed China Eastern Jet Recovered",
    "summarized_story": "A black box from the crashed China Eastern airliner was recovered on Wednesday as investigators try to piece together what made a jet carrying 132 passengers nosedive into a mountainside in southern China.\nA flight recorder “from China Eastern MU5735 was found,” on Wednesday Liu Lusong, a spokesman for China’s aviation authority, told reporters, although state media later said it was badly damaged.\nThe Boeing 737-800 is equipped with two flight recorders: one in the rear passenger cabin tracking flight data, and the other a cockpit voice recorder.\n“At present, it is unclear whether it is a data recorder or a cockpit voice recorder,” that has been found, Mao Yanfeng, an official at the Civil Aviation Administration of China (CAAC), said according to state media.\nThe Boeing 737-800 plane went down near Wuzhou in southern China on Monday afternoon after losing contact with air traffic control."
  },
  {
    "headline": "SouthWest PDP Leaders insist on Southern Presidency -",
    "summarized_story": "Some Southwest leaders of the People’s Democratic Party says it is in support of the southern governor’s forum agreement that the next Nigerian President should come from the south.\nThe PDP stakeholders made this known through a communique read at the end of a meeting held by the Extended Zonal caucus of the party in Ibadan.\nThe communique which was read by the Southwest Vice Chairman of the People’s Democratic Party Soji Adagunodo also reaffirmed the position of the leaders in the unity of Nigeria.\nAccording to him, the Southwest Zone is in support of the Southern Governors’ Forum that the next President of the federal Republic of Nigeria should come from the south.\nPresent at the stakeholders meeting were the former governor of Ekiti state Ayodele Fayose, former Ondo state governor, Olusegun Mimiko, a Chieftain of the Party, Bode George and other big wigs of the party."
  },
  {
    "headline": "House to revisit rejected bills within seven legislative days",
    "summarized_story": "The House of Representatives on Tuesday promised to revisit the gender bills earlier rejected.\nHouse Leader, Alhassan Ado-Doguwa, made the promise while addressing protesting women at the National Assembly.\nThe Speaker’s delegation appealed to the women groups to sheathed their sword and stop the daily protest.\nThe women agreed to suspend their daily protest to allow the two chambers fulfil their promise of revisiting the bills in the next two weeks."
  },
  {
    "headline": "Electoral Act: Senate set to debate court ruling on contentious clause 84 (12) -",
    "summarized_story": "The Nigerian Senate will deliberate on a recent High Court Judgment in Abia State that granted an order for the Contentious clause 84(12) to be removed from the 2022 Electoral Act.\nSenator Sekibo came under orders 10 & 11 urging the Parliament to treat the matter with a sense of urgency and debate it immediately.\nBut the Deputy Senate President, Senator Omo Agege who presided over Tuesday’s Plenary suggested that lawmaker delay the debate until the next legislative sitting.\nHe said this is to allow the Senate President preside over the matter and also give an opportunity to other senators to participate.\nAfter listening to the Contributions of other lawmakers, the Senate agreed to suspend the debate until it’s next Plenary Sitting on Wednesday."
  },
  {
    "headline": "Youth group protests, demands extension of registration for PVC in Ekiti -",
    "summarized_story": "A concerned Youth Group under the umbrella of the Ekiti Freedom Movement has Staged a walk to the Office of the Independent National Electoral Commission (INEC) in Ado-Ekiti for extension of time for Registration and Collection of Permanent Voters card in the State.\nThe deadline for the collection of voters card elapsed on the14th of March and they are pleading that since the state is having it’s Gubernatorial Election in June, there will be a good number of citizens who will be DisenfranchisedThey argued that Most people who had their data captured online could not collect their PVC before the date elapsed.\nSimilarly, because of the large number of residents who wants to register, most of them were not attended to at the INEC officeThe Legal officer of INEC told the Protesting Youths that it is less likely that their request of registering for PVC will be granted especially with the Governorship Election to hold less than 90 days time"
  },
  {
    "headline": "Nigerian Lawmakers Lambast Power Minister Over Grid Collapse",
    "summarized_story": "This, he said had led to the collapse of the national grid and as well what the ministry was doing to salvage the situation.\n“It may be recalled that Nigerians whom we represent experience one of the worst moment of electricity supply across the country.\n“It has caused collapse of small businesses whose operations depend on stable electricity supply.\nThe situation has also aggravated increased process in commodities and services especially those that require electricity supply.\n“The overheated socio-economic environment due to very poor electricity supply attracted huge public outcry for immediate solutions, especially given the contractual nature of provision of power and energy services in the post privatization era by the Nigerian Power Supply Industry."
  },
  {
    "headline": "World Bank: Deep Structural Reforms Urgently Needed to Lift Millions of Nigerians Out of Poverty",
    "summarized_story": "The World Bank has identified sluggish growth, low human capital, labor market weaknesses and exposure to shocks as factors holding Nigeria’s poverty reduction back.\nThe Washington-based institution stated this in its latest report titled: “A Better Future for All Nigerians: Nigeria Poverty Assessment 2022,” obtained Tuesday.\nThe report represented the culmination of the World Bank’s engagement on poverty- and inequality-relevant data and analytics in Nigeria in the past two years.\nThe surveys were implemented by Nigeria’s National Bureau of Statistics (NBS) in collaboration with the World Bank.\nBy investing in data, Nigeria could build trust, accountability, and transparency, taking substantial strides on its pathway to poverty reduction."
  },
  {
    "headline": "Nigeria: Anambra Governor Soludo Reveals State Has About N109bn in Debt, N300m Cash",
    "summarized_story": "The new governor of Anambra State, Professor Chukwuma Soludo, on Tuesday said although the problems confronting the state remained daunting, with the backing of the people, the new government was poised to record huge successes.\nSoludo explained that from the records at his disposal, Anambra had a debt of about N109 billion and between N300 million to N400 million in cash.\nLaw and order are going to be the very first essence; it is at the foundation of everything, of every society.\nThe former CBN governor said, “But everybody knows that the state finances are not quite robust, to put it mildly.\nAnd actually, it’s three years and eight months, that’s why we are not going to miss any one minute."
  },
  {
    "headline": "Buhari Says Nigeria’s Huge Dependence on Imported Agricultural Products to End Soon",
    "summarized_story": "President Muhammadu Buhari inaugurated the $2.5 billion Dangote fertiliser plant on Monday in Lagos, with an assurance that the country was poised to end its massive dependence on imported agricultural products soon.\nThe fertiliser plant, with installed capacity of three million metric tonnes of urea per annum, is located in Ibeju-Lekki, within the Lekki Free Trade Zone.\n“Job creation by private sector operators is vital to security, as it takes thousands of youths off the street.\nHe said the government was focused on providing an enabling environment for private sector investors to thrive.\nThe Dangote Fertiliser Plant goes a long way in realising this vision not just for Nigeria, but for the entire continent."
  },
  {
    "headline": "Nigeria’s Petroleum Regulator Sets Up Investigative Panel to Tackle Rising Oil Theft",
    "summarized_story": "The commission stated that the move was to ascertain the actual volume of crude oil stolen by vandals and saboteurs, against recent allegations by some industry operators regarding the volume of crude theft on a daily basis.\nThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, had on Monday lamented the unprecedented rate of oil theft recorded in recent times and its debilitating effect on government revenue and accretion to reserves.\nHe had revealed that up to 80 per cent of oil pumped in the country, particularly in the east, were stolen.\nKomolafe stated that commission was not unaware of the, “tragedy of oil theft” which he noted has been a plague on the industry and had last year triggered an industry-wide initiative aimed at curbing it.\nThis, he said, was to help increase crude production levels; a development which he said followed an express presidential directive."
  }
]