[
  {
    "headline": "Correct past mistakes in 2023, cleric tells Nigerians",
    "summarized_story": "THE Catholic Secretariat of Nigeria has called on Nigerians to correct what it described as “past mistakes” in choosing the country’s next president during the 2023 elections.\nThe CSN said Nigerians inflicted the present pains on themselves because of previous errors.\nAccording to the CSN, the errors of the previous election circle was what plunged Nigeria into serious pains.\nIt is time to wise up and correct mistakes of the past that have plunged the nation into the excruciating pains we now experience.\nHe encouraged Nigerians to get their voter cards."
  },
  {
    "headline": "Ekiti APC primary didn’t hold, we’ll challenge outcome – Bamidele",
    "summarized_story": "A National Assembly member and All Progressives Congress governorship aspirant in Ekiti State, Senator Opeyemi Bamidele, said on Sunday that the alleged abortion of democracy in Thursday’s APC primary election in the state would be subjected to legal scrutiny.\nBamidele insisted that no election was held on January 27 and that the figures reeled out by Governor Abubakar Badaru-led Primary Election Committee were allegedly fabricated.\nThe National Assembly member, in a statement titled, ‘I will challenge Ekiti APC gov primary legally’, said, “We are of course taking immediate steps within the confines of our party constitution and the law to seek redress for this blatant abuse of trust and due process by the state actors”.\nHowever, Badaru had on Thursday night announced the results of the election and declared a former Secretary to Ekiti State Government, Biodun Oyebanji, winner of the exercise and returned him as the APC candidate.\nHe said, “It is public knowledge that no primary election took place on Thursday, 27th January 2022, but yet, rather disappointedly, results were announced based on concocted and fictitious vote counts."
  },
  {
    "headline": "2023: Utomi, Na’Abba, Agbakoba’s mega party issues APC, PDP quit notice",
    "summarized_story": "Adebayo is seeking to occupy the nation’s number one position under a political party to be unveiled soon by the National Consultative Front, NCFront.\nHe said after terrible performance records of PDP and incumbent APC administrations, admitted that Nigerians need a new leadership would offer them that hope of getting other things.\n“They don’t believe the ordinary Nigerian, can come out and vie for any office in the country and offer a platform.\nThe insecurity is now worse and taking a new dimension – banditry, killing and all sorts of threat to human life.\n“So let us come back and run another bad government for you because we have a franchise for running a bad government."
  },
  {
    "headline": "Attacks on Adeleke can destroy Osun PDP — Party Chieftain warns",
    "summarized_story": "Shina Abubakar, OsogboA chieftain of the Peoples Democratic Party (PDP), Hon David Ayodele Asalu has disclosed that those leading campaign of calumny against Senator Ademola Adeleke is capable of weakening the party chances in the July 2022 governorship election in the state.\nHon Asalu who blamed fifth columnists for the turn of events in the party, however called on PDP leaders across board to weigh the price of a fragmented party into the election and speak out against those with destructive mission.\n“Those who want our Party (PDP) to fail in the upcoming election are busy spewing falsehoods against Senator Adeleke and ignite a crisis that will make it impossible for us to focus.\nThis will never benefit anyone except for the marauders who are obviously working for the APC.\n“Embarking on campaign of calumny would amount to a betrayal to the sacrifices of members and multitude of Osun people who daily anticipate the return of a PDP government."
  },
  {
    "headline": "Senate Constitution Review Committee bows to Buhari, rejects State Police",
    "summarized_story": "By Henry UmoruAHEAD of the presentation of the report of the Senate Committee on Constitution Review, Senators have bowed to President Muhammadu Buhari, thereby rejecting the creation of State Police.\nThe Senate Constitution Review Committee while it rejected state Police, it has resolved that President and the thirty- Six State Governors will constitute Federal and State Executive Councils respectively within 6o days after being sworn in.\nAccording to the report which Vanguard sighted, the Committee has voted for no more joint account of Local government Councils with the State Governments.\nPresident and Governors to constitute Federal and State Executive Councils respectively within 6o days after being sworn in.\nOmo-Agege had said, ” by the time the window for receiving these memoranda closed, the Committee had received over 250 memoranda."
  },
  {
    "headline": "Yobe govt debunks report of crisis, churches burning",
    "summarized_story": "By Ndahi Marama, DamaturuYobe State Government has on Sunday morning debunked claims purportedly in circulation in some social media platforms that the state boiling as churches are been set ablaze.\n“The was contained The attention of Yobe state government has been drawn to a fake, absolutely false and misleading post in the social media purportedly from CAN Abuja, claiming that Yobe state is boiling.\n“The post mischievously claimed that Yobe state in Nigeria is boiling now.\nAs a journalist, l had then received several calls from colleagues residing outside Yobe state seeking for details and clarifications.\n“The public is hereby advised to disregard this mischievous post as Yobe state is very peaceful.” Mamman stated."
  },
  {
    "headline": "Gunmen burn 10 sleeping locals in Southern Kaduna",
    "summarized_story": "Raze houses‘There was an attack but no details now’ ― LG BossBy Ibrahim Hassan-WuyoNot fewer then 10 locals were allegedly, burnt to death while sleeping when Gunmen set fire on the Atak Mawai community in Zaman Dabo village, Atyap Chiefdom of Zangon Kataf Local Government Area of Kaduna state on Sunday.\n” We were attacked in the early hours of today( Sunday)by unknown gunmen, they killed about ten 10 people.The attackers also burnt down about ten (10) houses,” a native who craved for anonymity has alleged.\n“People’s foodstuffs have also been destroyed, other valuables were also burnt .”“Security personnel later,came to ensure calmness and avoid further attack by the attackers,” he said.\nJournalists were still awaiting thePolice Public Relations Officer( PPRO) in Kaduna State,ASP Mohammed Jalige, to react on the carnage.\nFrancis Angwa Sani, Executive Chairman of Zangon Kataf Local Government Council told journalists on phone that there was an attack on the community."
  },
  {
    "headline": "2023: Gov Emmanuel anoints successor",
    "summarized_story": "Governor Udom Emmanuel of Akwa Ibom State has anointed the state’s Commissioner for Lands and Water Resources, Pastor Uno Eno, as a preferred candidate that would succeed him in 2023.\nThis was made known at the end of PDP stakeholders’ meeting on Sunday evening.\nThe former Governor, Obong (Arc) Victor Attah, made the formal presentation of Pastor Eno to the stakeholders, which comprised major and leading political chieftains from the three senatorial districts of the state.\nAll the stakeholders present lauded the governor for picking Pastor Eno as his successor and promised to work towards his emergence as the governor of the state in 2023.\nResponding, Pastor Eno thanked God and the governor for finding him worthy of the onerous task to lead the people of the state and continue the people-focused and developmental strides of Governor Udom Emmanuel."
  },
  {
    "headline": "Ex-Head of State Babangida trends over death rumor",
    "summarized_story": "There are speculations on social media about the “death” of former Head of State, Ibrahim Badamasi Babangida (IBB).\nBabangida, this afternoon, had a sort of meeting and political consultations with some friends and politicians who visited his Hill Top residence”, the source said.\n80-year-old IBB recently received former Lagos State Governor, Bola Tinubu, at his residence in Minna.\nThe All Progressives Congress (APC) national leader explained that the trip was about the security challenges in Niger and his presidential ambition.\n“I can’t stop by without paying a courtesy call to the enigma, General Ibrahim Badamasi Babangida, retired”."
  },
  {
    "headline": "Bandits now officially terrorists, expect changes in insecurity – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said bandits have now been officially declared as terrorists, to enable security agencies take more stringent measures against them.\nOsinbajo made the declaration while at the Katsina Emir’s palace on a condolence visit over the passing of Dahiru Mangal’s mother, Hajiya Murja, recently.\nThe Katsina Emir, HRH Abdulmumini Kabir, in his remarks said, I am happy now that they have been officially declared terrorists.\nHe said, “I was informed that since she died, there has been sadness everywhere and is because of the kind of person that she was.\nA woman who served her community throughout her life.”Osinbajo also prayed for God’s comfort and strength for the business mogul."
  },
  {
    "headline": "Nigeria will explode under Okorocha if he becomes president – Gov Uzodinma’s aide, Nwamkpa",
    "summarized_story": "Modestus Nwamkpa, the Senior Special Assistant to the Governor of Imo State on Print media, has mocked the Senator representing Imo West Senatorial District, Owell Rochas Okorocha, over his decision to run for the position of President of the Federal Republic of Nigeria.\nDAILY POST reported that Senator Rochas Okorocha, who represents Imo West on the platform of the All Progressives Congress (APC), announced his intention last Wednesday, in a letter to the Senate President, which was read by Ahmad Lawan at plenary.\n“Oga, please don’t be offended ooo, do you mean you really want to be Nigerian President?\nYou know we had such an experience with you in Imo state.\n“Your outing as Governor is a morrow to what you will do if given the opportunity."
  },
  {
    "headline": "Buhari didn’t cancel Zamfara trip because of insecurity – Presidency",
    "summarized_story": "The Presidency on Sunday further clarified why President Muhammadu Buhari canceled his trip to Zamfara State, last Thursday.\nShehu noted that it is not unusual for flights to get cancelled when there is bad weather was the case.\nThe presidency said the situation was unsafe in the absence of precise instrument approaches that provide guidance for the pilots.\nHe lambasted the Peoples Democratic Party (PDP) for saying Buhari failed to use Sokoto-Gusau by road, “a distance of about 200 kilometres”, due to insecurity.\nThe presidential aide reiterated that as promised in his address, Buhari will visit Gusau in matter of time."
  },
  {
    "headline": "AFCON 2021: CAF lifts suspension on Olembe Stadium",
    "summarized_story": "The Confederation of Africa Football (CAF) has lifted the suspension on Olembe Stadium, Yaounde after it received a report compiled by CAF Safety and Security Department with COCAN in regard to the tragedy that occurred at the stadium last Monday.\nCAF president, Dr Patrice Motsepe,suspended the stadium temporarily following a stampede which left eight persons died with many others sustain injuries.\nThe report also dealt with and highlighted the tragic circumstances which led to thirty-eight people being injured and eight fatalities.\nIt further emphasised the recommendations and interventions to ensure that a tragedy of this nature should never be repeated.\n- Advertisement -“In conclusion, CAF, the Local Organising Committee and the Government of Cameroon having significantly increased security and resources at the Olembé Stadium, are confident that the safety and security of spectators and visitors will be assured,” the statement said."
  },
  {
    "headline": "BREAKING: Rumpus as Gov Emmanuel unveils preferred successor",
    "summarized_story": "Akwa Ibom Governor Udom Emmanuel has unveiled Commissioner for Lands and Water Resources Mr Umo Eno as his preferred successor, The Nation can authoritatively reveal.\nThe Nation gathered that Emmanuel unveiled Eno on Sunday night during a meeting with some selected leaders in the State and interested aspirants for the governorship post, including National Assembly members.\nThe announcement ended months of speculations and tension in the State over Emmanuel’s preferred successor.\nFormer Governor Victor Attah and some fathers of Faith, an association of influential church leaders in the State, it was gathered, influenced the Governor’s preference for the Commissioner.\nWhen asked if there were some dissenting voices at the meeting on the choice of Eno, Udo said he wasn’t aware of any."
  },
  {
    "headline": "Buhari celebrates Onyeka Onwenu at 70",
    "summarized_story": "President Muhammadu Buhari has joined the entertainment and media industries to celebrate renowned musician Onyeka Onwenu as she turns 70.\nA statement by Special Adviser to the President on Media and Publicity, Mr Femi Adesina, expressed Buhari’s appreciation of Onwenu’s contributions to both the media and entertainment industry.\n“President Muhammadu Buhari joins the entertainment industry in sharing the joyous occasion of 70th birthday with renowned songwriter, singer and journalist, Onyeka Onwenu, congratulating the multiple award-winning artiste and actress for leading a life that keeps inspiring both the old and young.\n“As the journalist and activist turns 70, the President believes her many recognitions and awards, at home and abroad, were well deserved, particularly in directing her energy into global movies with historic contexts, and sharing the gospel of Christ.\n“President Buhari prays that the Almighty God will continue to bless Onwenu, singer of ‘One Love’, who is also known as the ‘Elegant Stallion’, with long life and good health,” the statement reads."
  },
  {
    "headline": "11 killed, 30 houses burnt as gunmen attack Zangon Kataf",
    "summarized_story": "No fewer than 11 persons have been confirmed killed and several other left with bullet wounds when gunmen launched an attack on two communities of Kurmin Masara area of Zangon Kataf local government area in Kaduna State.\nKaduna Commissioner for Internal Security and Home Affairs, Samuel Aruwan, who confirmed the attack on Sunday, revealed identities of the eleven villagers killed in the attack.\nSources from the area had earlier said Kurmin Masara and Zaman Dabo villages came under attack in the early hours of Sunday by gunmen who killed 16 people and set almost 40 houses ablaze.\n“As of 4:30PM, eleven residents were confirmed killed, and some inflicted with gunshot injuries.\n“The victims confirmed killed are listed as follows: Elizabeth Ayuba, Veronica Auta, Bege Daniel, Kephas Waje, Promise Jacob, Damaris istifanus, Hauwa Joshua, Dogara Gambo, Lidia Ishaya,Michael Achi and Gabriel Michael."
  },
  {
    "headline": "Man arrested after Man Utd suspend Mason Greenwood",
    "summarized_story": "A man in his 20s has been arrested on suspicion of rape and assault after Manchester United suspended footballer Mason Greenwood following allegations on social media.\nGreater Manchester Police said it was made aware of “social media images and videos posted by a woman reporting incidents of physical violence”.\nIt added “we can confirm a man in his 20s has since been arrested on suspicion of rape and assault”.\nREAD ALSO: Rangnick reveals secrets for Man United revival- Advertisement -Manchester United earlier said the player would not return to training or matches until further notice.\nMason Greenwood has not responded to the social media allegations."
  },
  {
    "headline": "Gunmen go haywire in Niger, kill 11 joint security taskforce members, several others injured",
    "summarized_story": "Several other members of the Joint Security TaskForce were serious injured and are currently in government facilities in Minna, the state capital receiving treatments.\nAlso killed in the attack, are four members of the newly recruited local vigilantes to reinforce the operation of the Security TaskForce operating in communities in the area.\nThe gunmen were said to have lunched the attack on the Joint Security TaskForce camp in Galadiman Kogo community on Saturday afternoon at about 3:00pm when they were all in the camp.\nThe gunmen, according to a source close to the community took the advantage of the rowdy market day in the community to lunch the attack on the camp of the Joint Security TaskForce.\n“They came through Galape and Kudodo where they confiscated a vehicle and asked the driver to bring them to Galadiman Kogo."
  },
  {
    "headline": "2023 elections: Mixed feelings over insecurity",
    "summarized_story": "Holding elections in 2023 is a matter that cannot be compromised.”Security experts express fearsBut experts in security matters are expressing fears.\n“After my thorough analysis of the situation,” he says, “my conclusion is that the security situation ahead of 2023 elections looks gloomy.\nThe number of policemen and other security agencies cannot police what is going on now.\nThey can supply information to our security agencies and that will be a good collaborative effort.\n“But we have a situation where the security personnel are not working with private security personnel; that is not very good,” he said."
  },
  {
    "headline": "Controversy trails Abuja rice pyramid show",
    "summarized_story": "Speaking with Sunday Sun in a telephone interview, he dismissed the unveiling of the rice pyramid in Abuja as a scam.\nIf it was produced here in Nigeria, how did a bag of rice jump from N10,000 to N28,000 or N29,000 during Christmas?\nBetween 2017 and 2019, the CBN through RIFAN, Niger State chapter, approved and disbursed the said amount as loans to 32,500 rice farmers in the state.\n“All items were given to the coordinator, who served as guarantor between the farmers, CBN and RIFAN.\nAbini said about 65,000 hectares of rice farms is being cultivated by farmers in the state every year, producing an estimated 260,000 metric tons of rice in the state."
  },
  {
    "headline": "I want a man who can make love with me 10 times a day –Kudirat Ogunro, actress/filmmaker",
    "summarized_story": "By Damilola FatunmiseKudirat Ogunro popularly known as Kudi Alagbo is a screen diva with lots of energy.\nIn this interview, Kudi talks about her career, crashed relationship, sex, kind of man, and plans for the year.\nWhat do you look out for in the man you want to spend the rest of your life with?\nI love respectful, God fearing man.\nMost importantly, I love when a man is able to satisfy me on bed at least 10 times in a day!"
  },
  {
    "headline": "President I want for Nigeria in 2023 –Prof Tunde Adeniran",
    "summarized_story": "By Daniel KanuRenowned academic and tactical politician, Prof Tunde Adeniran, was former Minister of Education, former Ambassador of Nigeria to Germany, as well as the chairman of the defunct Directorate for Social Mobilization (MAMSER).\nSo, I think it is an issue we really need to tackle head-on.\nWhat do we really need to do?\nDo we really need a Third Force if there must be something different?\nWhat exactly is your take on zoning concerning the country today and the different strategies from different zones?"
  },
  {
    "headline": "NNPC Pays $452.5m Cash Call Arrears to IOCs in One Year",
    "summarized_story": "Aside from Mobil and Chevron, other oil majors that are being owed arrears by the NNPC include Shell Petroleum Development Company (SPDC), Total Energies and Nigerian Agip Oil Company (NAOC).\nFurthermore, with an initial debt of $774.6 million owed NAOC, payment to date made to the oil company was $522.6 million, with an outstanding of $252 million.\nThe NNPC, in 2016, signed a cash call repayment agreement with its JV partners to defray cash-call arrears within five years after many years of its indebtedness to its partners.\n“NNPC has fully repaid its cash call arrears to MPN and all incremental barrels have reverted to base,” the company said.\n“When we were elected into office in 2015, the industry was in a very dire situation worsened by a backlog of Joint Venture (JV) Cash Call arrears."
  },
  {
    "headline": "Outrage over Plot in PDP to Shun Power Shift to South",
    "summarized_story": "National Publicity Secretary of the main opposition party, Mr Debo Ologunagba, had reportedly declared that the party would not stop northern presidential aspirants from contesting, adding that the party would leave the presidential ticket open to all the geopolitical zones.\nHe vowed that the Middle Belt and South regions would mobilise against any political party that selects a northerner as its presidential candidate.\n“The PDP statement, I understand was from the Publicity Secretary of the party.\nThe final statement will come from its National Chairman after a National Working Committee (NWC) or National Executive Council (NEC) meeting.\nAnd today, the best way to pay us back is for the party to throw its ticket open."
  },
  {
    "headline": "APC Caretaker Committee Meets This Week to Decide Zoning of Offices",
    "summarized_story": "A member of the CECPC told THISDAY at the weekend that the caretaker committee would also set up a zoning committee to address the issue of the zoning of the party’s elective positions.\nAccording to him, the zoning committee will consider equity and justice before coming up with its position on zoning.\nHe said that the expected zoning committee would be guided by justice and fairness by ensuring that all zones and states are fairly represented.\nWelfare of Average Nigerian Paramount to Ruling Party, Says OsinbajoMeanwhile, Vice President Osinbajo has disclosed that the ruling APC would remain committed to the welfare of the common man.\nOsinbajo, according to a statement issued yesterday by his Media Assistant, Mr Laolu Akande, made this disclosure when he played host to a delegation of the APC Professionals Forum at the State House, Abuja."
  },
  {
    "headline": "407 Killed, 332 Abducted in 72 Boko Haram Attacks, Chibok People Cry out",
    "summarized_story": "Chibok got famous when on April 14, 2014 Boko Haram invaded a school in the community, abducting over 270 schoolgirls.\nThe group, which was led to the press conference by the National President of KADA, Dauda Iliya said: “We are on behalf of the entire Chibok Community, using this medium to once again call on President Muhammadu Buhari to rescue Chibok Community, an ethnic nationality, from total annihilation by the Boko Haram Terrorists.\n“The parents and the Community have continued to be subjected to persistent and sustained attacks, killings, abductions, maiming, arsons and other myriads of criminality without adequate government protection.\nChibok has been for all intents and purposes abandoned to its own devices by all layers of government in Nigeria.\nJust this year (2022) alone, Kautikari (second largest town in Chibok area) was attacked on January 14 with five girls abducted, three persons killed, many houses and churches burnt, etc."
  },
  {
    "headline": "Osinbajo: Only Leaders Not Inspired by Personal Profit Can Bring about National Transformation",
    "summarized_story": "He added that as a model of leadership, transformational leadership operates by serving and uplifting others because it is servant leadership.\nThis is a model of leadership that is inseparable from our conception of the common good.\n“Transformational leadership is, therefore, the pursuit of the common good.\nBut the pursuit of the common good itself is not as easy as it sounds.\n“Fulfilling the immense promise of our nation requires men and women of goodwill from various communities and faiths to collaborate in advancing the common good."
  },
  {
    "headline": "How Some Northerners Made It Impossible For Ex-President Jonathan To Defeat Boko Haram --Former Niger Governor, Aliyu",
    "summarized_story": "Babangida Aliyu, former governor of Niger State, has said some Northerners made it impossible for former President Goodluck Jonathan to defeat Boko Haram.\nAccording to PUNCH, the former governor said it was unfortunate that insecurity had been allowed to escalate.\nEx-President Goodluck JonathanHe said, “When Boko Haram started and Umaru Musa Yar’Adua and Goodluck Jonathan’s government started doing something about it, it fell on former President Jonathan to carry on.\nI think based on the thinking that probably former President Jonathan wouldn’t have handed over power even if they had won, but he handed over.\n“If the governors had really done a lot from 2015 to date, we would have got rid of the banditry."
  },
  {
    "headline": "How Some Northerners Made It Impossible For Ex-President Jonathan To Defeat Boko Haram --Former Niger Governor, Aliyu",
    "summarized_story": "Babangida Aliyu, former governor of Niger State, has said some Northerners made it impossible for former President Goodluck Jonathan to defeat Boko Haram.\nAccording to PUNCH, the former governor said it was unfortunate that insecurity had been allowed to escalate.\nEx-President Goodluck JonathanHe said, “When Boko Haram started and Umaru Musa Yar’Adua and Goodluck Jonathan’s government started doing something about it, it fell on former President Jonathan to carry on.\nI think based on the thinking that probably former President Jonathan wouldn’t have handed over power even if they had won, but he handed over.\n“If the governors had really done a lot from 2015 to date, we would have got rid of the banditry."
  },
  {
    "headline": "Again, Court Adjourns Ondo Oil Communities Suit Against Nigerian Government Over Failure To Compose NDDC Board",
    "summarized_story": "An Abuja high court has again adjourned further proceedings in the case filed by some oil producing communities in Ondo State over the refusal of the Nigerian Government to constitute a substantial board for the Niger Delta Development Commission.\nThe communities had taken the government to court over what it described as ongoing illegality following the running of the NDDC by a sole administrator.\nThe communities said the action had also enabled certain officials of government to divert attention from the collective legitimate demands of Niger Delta stakeholders for the inauguration of the NDDC Governing Board.\nIt was later adjourned to January 19, the judge too refused to come and then adjourned to January 25 which is today.\n“Minister of Niger Delta, Godswill Akpabio, has been bragging that the judge is under his belt,” a source told SaharaReporters."
  },
  {
    "headline": "Again, Court Adjourns Ondo Oil Communities Suit Against Nigerian Government Over Failure To Compose NDDC Board",
    "summarized_story": "An Abuja high court has again adjourned further proceedings in the case filed by some oil producing communities in Ondo State over the refusal of the Nigerian Government to constitute a substantial board for the Niger Delta Development Commission.\nThe communities had taken the government to court over what it described as ongoing illegality following the running of the NDDC by a sole administrator.\nThe communities said the action had also enabled certain officials of government to divert attention from the collective legitimate demands of Niger Delta stakeholders for the inauguration of the NDDC Governing Board.\nIt was later adjourned to January 19, the judge too refused to come and then adjourned to January 25 which is today.\n“Minister of Niger Delta, Godswill Akpabio, has been bragging that the judge is under his belt,” a source told SaharaReporters."
  },
  {
    "headline": "Why We Can’t Support Tinubu, Any Other Southern Candidate For Presidency --Miyetti Allah",
    "summarized_story": "National President of Miyetti Allah Kautal Hore, Bello Bodejo, has said that the association will not support any Southern candidate for the presidency in 2023.\nBola TinubuIn an interview with The Sun, Bodejo said Northerners manage the country better than their counterparts in the South.\nHe said, “Even though Nigeria is one, we are not going to support a southerner as president.\nA president from the North is better because Northerners are better managers of the nation than southerners.\nNorthern people have managed the country better than Southerners."
  },
  {
    "headline": "Asari Dokubo: South-east residents obey sit-at-home order over fear of being killed",
    "summarized_story": "Asari Dokubo, leader of the Niger Delta Peoples Salvation Force (NDPSF), says people in the south-east obey the sit-at-home order by the Indigenous People of Biafra (IPOB) out of fear of being killed.\nIPOB had ordered a sit-at-home order every Monday across the south-east but had suspended the directive in September 2021.\nDespite the suspension of the directive, there have been incidents of violence in the region reportedly linked to the sit-at-home order.\nAdvertisementSpeaking on Sunday during a Facebook live, Dokubo accused Nnamdi Kanu, leader of IPOB, of causing the closure of schools and businesses in the south-east.\nHe added that people only obey the order out of fear of being killed, and not because they love the IPOB leader."
  },
  {
    "headline": "Asari Dokubo: South-east residents obey sit-at-home order over fear of being killed",
    "summarized_story": "Asari Dokubo, leader of the Niger Delta Peoples Salvation Force (NDPSF), says people in the south-east obey the sit-at-home order by the Indigenous People of Biafra (IPOB) out of fear of being killed.\nIPOB had ordered a sit-at-home order every Monday across the south-east but had suspended the directive in September 2021.\nDespite the suspension of the directive, there have been incidents of violence in the region reportedly linked to the sit-at-home order.\nAdvertisementSpeaking on Sunday during a Facebook live, Dokubo accused Nnamdi Kanu, leader of IPOB, of causing the closure of schools and businesses in the south-east.\nHe added that people only obey the order out of fear of being killed, and not because they love the IPOB leader."
  },
  {
    "headline": "Lai: FG to seek review of $35k business registration fee for Nigerians in Egypt",
    "summarized_story": "According to NAN, the minister said this during a recent meeting with the Nigerian community in Cairo, Egypt’s capital.\nThere are different fees for registering various categories of businesses in Egypt, including a limited liability company (LLC) nominee option said to cost $34,350.\nThe LLC alternative is said to be the most common in Egypt and “can be 100% foreign owned”.\nThey said no fewer than 7,000 Nigerian children in Egypt were out of school, and appealed for the construction of a Nigerian school in Cairo.\nAdvertisementMohammed further appealed to the Nigerian community in Egypt to disregard most of the negative news about Nigeria, especially on social media."
  },
  {
    "headline": "Lai: FG to seek review of $35k business registration fee for Nigerians in Egypt",
    "summarized_story": "According to NAN, the minister said this during a recent meeting with the Nigerian community in Cairo, Egypt’s capital.\nThere are different fees for registering various categories of businesses in Egypt, including a limited liability company (LLC) nominee option said to cost $34,350.\nThe LLC alternative is said to be the most common in Egypt and “can be 100% foreign owned”.\nThey said no fewer than 7,000 Nigerian children in Egypt were out of school, and appealed for the construction of a Nigerian school in Cairo.\nAdvertisementMohammed further appealed to the Nigerian community in Egypt to disregard most of the negative news about Nigeria, especially on social media."
  },
  {
    "headline": "Opeyemi Bamidele: There was no APC guber primary in Ekiti -- I was allotted votes",
    "summarized_story": "Opeyemi Bamidele, a serving senator and governorship aspirant in Ekiti, says there was no primary election for the All Progressives Congress (APC) in the state.\nThe senator had called for the cancellation of the exercise after alleging that the primary election committee was made up of loyalists of Kayode Fayemi, Ekiti governor.\nHe and other aspirants withdrew from the exercise, while Biodun Oyebanji, a former secretary to the Ekiti state government, was later declared winner of the poll.\nIn a statement issued on Sunday, Bamidele thanked his supporters but described the exercise as “a fraudulent and fictitious vote count”.\n“It is public knowledge that no primary election took place on Thursday, 27th January, 2022 but yet, rather disappointedly, results were announced based on concocted and fictitious vote counts."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "Nigerian musician Buju wanted to reward his fans, so he created an NFT project",
    "summarized_story": "After learning extensively about ethereum and NFTs, he started selling the idea of an NFT project to several Nigerian music artistes.\nBefore he knew it, it was making waves and, unknown to his many fans jamming to the song, the colourful art cover is in fact an unreleased NFT project.\nBuju had seen the NFT project as an opportunity to build a community around his fans, reward and connect with them like never before.\nI feel like it is the best way I could reward people that enjoy my music,” Buju said.\nIn this quarter, the “HeadsByBuju” project will be minted publicly and pre-sale will start."
  },
  {
    "headline": "Zimbabwean James Manyika, becomes Google’s first Senior Vice President of Technology and Society",
    "summarized_story": "Google has appointed Zimbabwean James Manyika as the company’s first Senior Vice President of Technology and Society.\nManyika will report directly to Alphabet’s (Google’s parent company) CEO Sundar Pichai and will be working on the impact of technology on society and the environment.\n“I’m thrilled that James Manyika will be joining Google’s leadership team,” Pichai said in a statement.\n“He’s spent decades working at the intersection of technology and society and has advised a number of businesses, academic institutions and governments along the way.\nManyika has advised the chief executives and founders of many of the world’s leading tech companies on strategy and growth, product, and business innovation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "roHealth officially launches in Nigeria, provides free Health Insurance for SMBs",
    "summarized_story": "Share this article:Nigeria-based healthtech, roHealth has rolled out a free health plan coverage for SMBs in Nigeria.\n“We are a platform that gives employees greater decision-making control over their health insurance with cashback when it is not used.\nEmployees can choose from over 100 Health Plans from top HMOs in Nigeria” Olude told Techpoint at the event.\n” roHealth is on a mission to increase access to healthcare in Nigerians by providing free health Insurance for a limited period.\nSince its inception 4 months ago, over 7000 lives and 500 businesses actively use roHealth for making their health coverage decisions."
  },
  {
    "headline": "Using its credit analytics solution, Periculum wants to improve financial inclusion for Nigerians",
    "summarized_story": "Improving access to credit for underserved marketsNot all organisations have this capability, and this is where Periculum believes it has found its sweet spot.\nWhile working at these banks, he researched and discovered many underserved customers, even in Canada.\n“I started out working in the bank and discovered that we have many underserved customers, so I decided to do some research.\nAccording to Business Day, seven in ten bank customers in Nigeria lack access to credit.\nBusiness model and key differentiatorPericulum can make money in two major ways — a credit analytics and data analytics service to businesses."
  },
  {
    "headline": "There’s more to crypto than buying low and selling high",
    "summarized_story": "At times like that, crypto traders and evangelists seize every opportunity to remind everyone who isn’t into crypto trading what they are missing.\nThere’s more to crypto than tradingCryptocurrencies are used primarily for speculative purposes, buying low and selling high, but they weren’t originally created for speculation.\nAround 40% of Africa’s population — 1.3 billion — lives in extreme poverty, making crypto trading a very attractive venture.\nTransactions on the Ethereum network, the most popular network for alternative crypto usage, cost a lot.\nWhile there are new networks, Solana and Polygon, for instance, springing up and reducing the cost of crypto usage, only time will tell if alternative crypto usage will catch on in Africa."
  },
  {
    "headline": "Sanwo-Olu to declare 2nd ABC conference open",
    "summarized_story": "ABC is a business conference and investment expo organised by BusinessDay that congregates business leaders, governments, policymakers, investors, and entrepreneurs across Africa and beyond in order to proffer sustainable solutions that will address challenges in the business environment.\n“It is expected to be the largest business and investment gathering holding next year that will proffer economic development framework for the year,” said Frank Aigbogun, publisher of BusinessDay Newspaper.\nAigbogun also mentioned that participants have to be delegates representing a business, an institution, or the government.\nRead also: CBN, World Bank give GDP growth projection for 2022Sponsors of the event include Platform Capital, IHS Towers, and Alluvial.\nThe 2022 business convention will be divided into the main and side events for deeper discussions and increased impact."
  },
  {
    "headline": "2023: Why I don’t support any election in Nigeria now-Adebanjo",
    "summarized_story": "With about a year to the commencement of Nigeria’s general election in 2023, Ayo Adebanjo, leader of Afenifere, pan Yoruba socio-political organisation, has said he would not support the conduct of any election in the country until the current 1999 constitution was changed.\n“I don’t believe in any election next year in Nigeria, I don’t believe in any election with this constitution, I have said the constitution needs to be changed”, Adebanjo said.\nSpeaking recently, Adebanjo had equally described the 1999 constitution as the problem of Nigeria, adding that the 1999 Constitution must be changed for Nigeria to begin to move in the direction of peace and development.\nWhile rejecting the attempt to amend the 1999 constitution they said the current Nigeria’s constitution is a problem and the major obstacle to the nation’s unity, stability, and progress.\nAmendment of the 1999 constitution has become controversial in recent years, successive lawmakers in the National Assembly spent billions of naira in efforts to review the 1999 constitution, but such exercises were never successful."
  },
  {
    "headline": "Oil is near $100 but for Nigeria it is still a story of squandering of riches",
    "summarized_story": "Oil is near $100 but for Nigeria it is still a story of squandering of richesWith prices trading near a seven-year high as crude makes a roaring start to 2022, the finances of Africa’s most populous nation remain precariously challenged by corruption and bad management.\nNigeria’s opaque oil industry is hobbled by inept policies which meant the flight of badly needed investment resulting in the failure to produce more oil to take advantage of soaring oil prices.\n“Nigeria is like a man who is dying from dehydration despite being in the midst of a ferocious rainfall,” says economist Festus Ogbobine.\nBrent hovered near $92 a barrel while West Texas Intermediate rose 2% for the week as robust demand tightened global markets.\nAs supply remains constrained, a chorus of Wall Street banks and oil executives are forecasting a return to $100 oil."
  },
  {
    "headline": "Edo to set up investment desks in Lagos, Abuja, Nigerian embassies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has unveiled plans to set up investment desks in Lagos and Abuja as well as Nigerian embassies overseas to attract investments to the state’s industrial, agriculture, retail, tourism and power sectors.\nAccording to him, “We have to set up investment desks in Lagos and Abuja.\nThis will increase visibility of the opportunities for investment in our state.\n“The state has a 40MW power facility for investors in the industrial park provided by Ossiomo Power.\n“We want to create the investment desk so that we can advertise the opportunities available in the state to investors and get them to come and invest in our state,” he added."
  },
  {
    "headline": "2023: Tinubu, Osinbajo fight will Cost Southwest Zone chances – Primate Ayodele – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, has again cautioned political gladiators concerning the 2023 Presidential race in Nigeria.\nPrimate Ayodele presaged that the Presidential ambition of Bola Tinubu, National Leader of the All Progressives Congress, APC, and Vice President Yemi Osinbajo will endanger the chances of the Southwest.\n“I foresee a fallout between the national leader of the All Progressive Congress, Asiwaju Bola Ahmed Tinubu and Vice President, Prof. Yemi Osinbajo.\n“This will happen due to the presidential ambition of both of them.\n“Also, unless the party leaders make moves to settle the rift, their ambition will cost the South-West zone its chances in the 2023 presidential race."
  },
  {
    "headline": "Edo Children Benefiting From The Educational Stride Of SUBEB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Governor Mr. Godwin Obaseki has made education one of his major cardinal objectives, focus and goal of his administration since he assumed leadership of the state on 12th November 2016.\nGovernor Godwin Obaseki in 2018, launched Edo Best Education Sector Transformation (EdoBEST), a wholistic basic education reform programme to address learning gaps and deficiencies identified in the school system.\nGovernor Mrs Salami created more platform for more teachers to undergo professional development as EdoBEST penetrates hard-to-reach areas in Edo State.\nThe SUBEB Chairman believed that the professional development for teachers in Edo State is necessary to boost the capacity of Edo State’s teaching corps and further spread the gains of EdoBEST.\nThe professional development training, which is ongoing in Benin City the Edo State Capital is designed to provide qualified teachers and field officers for more communities in rural and hard-to-reach areas in Edo State."
  },
  {
    "headline": "NIMASA paid N37.69bn into Consolidated Revenue Fund (CRF) FG coffers in 2021 -DG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – In it’s contribution to the Federal Government coffers in 2021, the Nigerian Maritime Administration and Safety Agency (NIMASA) revealed that it paid N37.69 billion to the Consolidated Revenue Fund (CRF) last year.\n“We expect before the end of the first quarter the floating dock to be operational.\nOur floating dock is owned by NIMASA and we handed it over to a public-private partnership.\nOperationality of the floating dock would be taken over by foreigners to service it before the approval of the FEC.\nBy the time we receive approval and the floating dock is in use, we will move it to where it belongs,” he added."
  },
  {
    "headline": "Employment: KWASU VC Urges Youths To Embrace ICT",
    "summarized_story": "The vice chancellor of Kwara State University (KWASU) Malete, Prof. Muhammed Akanbi (SAN), has harped on the need for Nigerian youths to take advantage of abundant opportunities available in the Information Communication Technology (ICT).\nHe said this becomes necessary so that the youths can become economically self-reliant and employers of labour.\nAkanbi spoke with LEADERSHIP on the sidelines of a counseling programme that a charity organiation, MMGIVIT, organised for secondary school students in Ilorin, Kwara State.\nThe legal luminary, who is also the convener of MMGIVIT, urged the students to embrace acquisition of entrepreneurial skills in order to make them total students fit for the 21st century.\nAkanbi, who also enjoined Nigerian students and youths in general to nurture big dreams in life, said impossibility could be made possible through determination, focus and consistency of plans."
  },
  {
    "headline": "We Want You To Defect To APC, Lawan Tells Akwa Ibom Gov",
    "summarized_story": "The President of the Senate, Ahmad Lawan, on Saturday, tacitly extended an invitation to the Governor of Akwa Ibom State, Udom Emmanuel, to defect to the All Progressives Congress (APC).\nADVERTISEMENTBoth the Senate President and Akwa Ibom State governor were in attendance at a thanksgiving service and commissioning of constituency projects executed by Senator Akpan on Saturday.\nAwoniyi said it was an opportunity for Lawan to congratulate the people of Akwa Ibom for being lucky to have Udom Emmanuel as their governor.\n“Your Excellency, even though we do not share a common platform but the truth must be said: You have transformed Akwa Ibom for the best.\nLawan eulogised the Akwa Ibom North-East Senator, Bassey Albert Akpan, for providing quality representation of his people at the National Assembly."
  },
  {
    "headline": "BREAKING: Bandits Kill 12 In Niger Village",
    "summarized_story": "In an attack that started Saturday up till Sunday morning, 12 people have been confirmed killed by bandits in Galadima Kogo, Shiroro local government area of Niger State.\nThe co-convener, Concerned Shiroro Youths, Sani Abubakar Yusuf Kokki, told LEADERSHIP that many people were also abducted.\nHe added that scores were injured while houses and cars were burnt in the renewed attacks on the villages in Shiroro, Rafi and Munya local government areas of the State.\nDetails Later…ADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "BREAKING: Bandits Kill 12 In Niger Village",
    "summarized_story": "In an attack that started Saturday up till Sunday morning, 12 people have been confirmed killed by bandits in Galadima Kogo, Shiroro local government area of Niger State.\nThe co-convener, Concerned Shiroro Youths, Sani Abubakar Yusuf Kokki, told LEADERSHIP that many people were also abducted.\nHe added that scores were injured while houses and cars were burnt in the renewed attacks on the villages in Shiroro, Rafi and Munya local government areas of the State.\nDetails Later…ADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Bugbear Of Coups And Future Of Democracy In Africa",
    "summarized_story": "ADVERTISEMENTECOWAS has suspended Burkina Faso from its institutions but the coup leaders are not bordered about that.\nECOWAS and other regional organisations have since imposed suspension on Guinea but the coup leaders have remained unperturbed.\nThe coup leaders dissolved civilian rule, arrested political leaders including the Prime Minister Abdalla Hamdok and declared a state of emergency.\nThe implication is that military coups and coup attempts are becoming a regular occurrence in Africa in the decades since independence and this poses a great danger to democratic development.\n“Unfortunately, none of the reasons for the coups are based on a genuine concern for good governance and democracy."
  },
  {
    "headline": "Rivers’ ambush: One soldier killed, two in critical condition",
    "summarized_story": "One soldier has been reportedly killed while two others fatally wounded in an attack by gunmen in Rivers State.\nThe attack happened in the early hours of Sunday at the boundary between Asari-Toru and the Emohua Local Government Areas of the state.\nIt was gathered that some gunmen had ambushed the soldiers close to Ahiankwo market and shot at them, killing and injuring the reported victims.\nHowever, the Chairman of Akuku-Toru, Rowland Sekibo, who had visited the scene said the soldiers were ambushed.\nSekibo on phone noted that the two soldiers that were injured were in critical condition, adding that efforts were on to move the wounded soldiers for treatment."
  },
  {
    "headline": "Rivers’ ambush: One soldier killed, two in critical condition",
    "summarized_story": "One soldier has been reportedly killed while two others fatally wounded in an attack by gunmen in Rivers State.\nThe attack happened in the early hours of Sunday at the boundary between Asari-Toru and the Emohua Local Government Areas of the state.\nIt was gathered that some gunmen had ambushed the soldiers close to Ahiankwo market and shot at them, killing and injuring the reported victims.\nHowever, the Chairman of Akuku-Toru, Rowland Sekibo, who had visited the scene said the soldiers were ambushed.\nSekibo on phone noted that the two soldiers that were injured were in critical condition, adding that efforts were on to move the wounded soldiers for treatment."
  },
  {
    "headline": "Skitmaker Isbae U in big trouble over alleged sex-for-skits scandal",
    "summarized_story": "On Sunday, Isbae U became a subject of discussion, topping social media trends especially on Twitter with over 10,000 tweets.\nA popular gossip mill on Instagram received and posted screenshots of evidence from the ladies who spoke about their various encounters with the skit maker.\nHe had his education at Igbogbi Secondary School, and bagged a National Diploma from Yaba College of Technology.\nChecks by The Nation across his social media platforms especially Instagram, show that he was yet to respond to the allegations or comment on the matter as at time of report.\nBut many Nigerians have taken to social media to react over the trending allegations."
  },
  {
    "headline": "Skitmaker Isbae U in big trouble over alleged sex-for-skits scandal",
    "summarized_story": "On Sunday, Isbae U became a subject of discussion, topping social media trends especially on Twitter with over 10,000 tweets.\nA popular gossip mill on Instagram received and posted screenshots of evidence from the ladies who spoke about their various encounters with the skit maker.\nHe had his education at Igbogbi Secondary School, and bagged a National Diploma from Yaba College of Technology.\nChecks by The Nation across his social media platforms especially Instagram, show that he was yet to respond to the allegations or comment on the matter as at time of report.\nBut many Nigerians have taken to social media to react over the trending allegations."
  },
  {
    "headline": "Update: Gunmen shoot three soldiers, four vigilantes dead in Niger",
    "summarized_story": "Gunmen have shot three soldiers and four vigilante members dead in a shootout in Mariga Local Government Area of Niger State.\nIt was gathered that seven security personnel, three soldiers and four vigilantes were shot dead by the gunmen,Over 60 gunmen had invaded two villages in Tungan Bako and Kawo communities in Rafi Local Government Area of Niger State and abducted 100 villagers.\nA source close to Allawa community said two people who wanted to escape into the bush were shot dead by the gunmen.\n“The entire Tungan Bako and Kawo communities are now deserted, everybody has left the communities.\nHowever with barely 24 hours after the incident, the gunmen have demanded N70 million as ransom for the release of their victims."
  },
  {
    "headline": "Snow storm cancels over 1400 U.S. flights",
    "summarized_story": "Agency ReportsMore than 1,400 U.S. flights were canceled in the U.S. on Sunday after the nation’s northeast states were walloped a day earlier by a deadly winter storm.\nRelated News 11 die as deadly freeze hits northern USLaGuardia Airport and John F. Kennedy International Airport in New York City and Boston Logan International Airport were among the hardest hit by delays and cancellations.\nThe fierce winter storm on Saturday dropped more than 2 feet (60 cm) of snow on some areas while packing high winds, prompting thousands of flight cancellations and leading governors in Rhode Island and other states to curtail access to the roads.\nNew York’s Long Island town of Islip was the hardest hit statewide, Governor Kathy Hochul told WCBS-TV on Sunday.\n“We’re going to give them the golden snowball award for this week, this storm."
  },
  {
    "headline": "Panic As Bandits Kill 10, Burn Houses In Fresh Attack On Southern Kaduna Village",
    "summarized_story": "Panic As Bandits Kill 10, Burn Houses In Fresh Attack On Southern Kaduna VillageDuring an attack on Atak Mawai Ward in Zaman Dabo Village in the Atyap Chiefdom of the Zango-Kataf Local Government Area of Kaduna State, gunmen suspected of being bandits killed at least ten people.\nIt was also learned that the gunmen set fire to numerous of the villagers’ homes.\nDuring the incident, which occurred in the early hours of Sunday, some people of the hamlet were injured.\nThey went from house to house, putting their victims to sleep.\nKaduna is one of the states where bandit killings occur on a regular basis."
  },
  {
    "headline": "”If I Be A True Prophet Of God, Tinubu Will Not Become President” – Oba Solomon Prophesies; Stirs Reactions (VIDEO)",
    "summarized_story": "”If I Be A True Prophet Of God, Tinubu Will Not Become President” – Oba Solomon Prophesies; Stirs Reactions (VIDEO)Nigerian controversial prophet, Oba Solomon has prophesied against the presidential ambition of Bola Ahmed Tinubu, the national leader of the All Progressives Congress, APC.\nAccording to his prophecy, the former Lagos State governor will not become Nigeria’s next president.\nNotwithstanding, he added that if Tinubu forces it, “he will die before his four years in office”.\n“If i am a true prophet of God Tinubu will not become the president of Nigeria, and if he becomes the president he will not spend 4 years before he will die,” Oba Solomon said.\nGet your PVC and vote.”Watch The Video BelowView this post on Instagram A post shared by @gistloversblog11"
  },
  {
    "headline": "Biafra: Why Abuja Court May Reinstate Nnamdi Kanu’s Bail — Lawyer, Ejimakor",
    "summarized_story": "The Special Counsel to Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, Aloy Ejimakor, has stated that the Abuja Federal High Court may reinstate Kanu’s initial bail.\nAccording to Ejimakor, the Abia State High Court’s decision may pave the road for Kanu’s bail to be reinstated by the Federal High Court in Abuja.\nIn 2017, the IPOB leader was granted bail by Justice Binta Nyako of the Federal High Court in Abuja.\nEjimakor, on the other hand, said the decision was significant and will have a direct bearing on Kanu’s appeal in the Federal High Court.\n“In particular, the Court held that: “It is the view of this Court that the Army set out as pythons to terminate the life of Nnamdi Kanu."
  },
  {
    "headline": "Some Northerners Made It Impossible For Ex-President Jonathan To Defeat Boko Haram -Former Niger Governor, Aliyu",
    "summarized_story": "Babangida Aliyu, former governor of Niger State, has said some Northerners made it impossible for former President Goodluck Jonathan to defeat Boko Haram.\nAccording to PUNCH, the former governor said it was unfortunate that insecurity had been allowed to escalate.\nHe said, “When Boko Haram started and Umaru Musa Yar’Adua and Goodluck Jonathan’s government started doing something about it, it fell on former President Jonathan to carry on.\nI think based on the thinking that probably former President Jonathan wouldn’t have handed over power even if they had won, but he handed over.\n“If the governors had really done a lot from 2015 to date, we would have got rid of the banditry."
  },
  {
    "headline": "Breaking: Lampard returns to Premier League, gets Everton job",
    "summarized_story": "Frank Lampard was charged with bringing in a new era at Everton after his appointment as the club’s new manager was finally confirmed.\nThe former Chelsea boss held a final round of talks with his advisors at the London offices of Chairman Bill Kenwright over the weekend, where he signed a deal that runs to June 2024; he will meet his new players at Finch Farm, the club’s training base.\nLampard, who will immediately have his squad bolstered by the arrival on loan of Donny van de Beek from Manchester United, will assemble a backroom staff that includes the highly-regarded Joe Edwards – with whom he worked at Chelsea – and Chris Jones.\nDetails loading…"
  },
  {
    "headline": "Revealed! How gunmen raided, killed 25 in Zango Kataf, Niger in fresh attacks",
    "summarized_story": "Francis Angwa Sani confirmed the attacks, but declined comment on the number of casualties and houses burnt, saying he was yet to receive the report.\nI learnt people were killed and houses burnt but I’ve not gotten the report yet,” Sani said.\nThe source further said apart from the houses burnt, the villagers’ foodstuffs and other valuables belonging to residents of the communities, were also destroyed.\n“As of 4:30pm, eleven residents were confirmed killed, and some inflicted with gunshot injuries.\nThey also called for the deployment of additional security personnel to other areas prone to insecurity with immediate effect."
  },
  {
    "headline": "Zamfara: PDP’s attack on Buhari over cancelled visit shameful – Presidency",
    "summarized_story": "The Presidency Sunday described as disgraceful and shameful the statement credited to the Peoples Democratic Party (PDP) over its alleged attack on President Muhammadu Buhari for the cancellation of his visit to Zamfara state due to bad weather.\nPresident Buhari had scheduled to visit Zamfara state after commissioning BUA Cement Plant in Sokoto Thursday.\nHowever, owing to bad weather in the state, the president could not proceed.\nAs he promised in that broadcast, the visit to Gusau by the President is only a matter of time.\n“Given the right conditions of the weather and all other things, he will return, and in time to accomplish his mission.”"
  },
  {
    "headline": "Bandits Kill 11 In Fresh Kaduna Attack",
    "summarized_story": "No fewer than 11 people have been killed during an attack by suspected bandits at Kurmin Masara community in Zango Kataf Local Government Area of Kaduna State.\nThe incident occurred in the early hours of Sunday when the attackers were said to have stormed the community while the residents were still asleep.\nHe, however, said that the troops cleared the ambush and reached the general area, along with troops of Operation Safe Haven (OPSH).\nAruwan further disclosed that 11 residents of the community were confirmed dead while some others were inflicted with gunshot injuries.\nMeanwhile, the Kaduna State Governor, Nasir El-Rufai, has expressed sadness over the incident."
  },
  {
    "headline": "Soldier Killed, Two Others Injured As Gunmen Ambush Troops In Rivers",
    "summarized_story": "A soldier has been killed and two others injured as gunmen attacked troops in Rivers State.\nThe incident happened in the early hours of Sunday at the boundary bridge between the Asari-Toru Local Government Area in the Kalabari region and the Emohua Local Government Area of the state.\nChairman of Akuku-Toru, one of the three local government areas in the Kalabari region, Rowland Sekibo, confirmed the attack to Channels Television via the telephone on Sunday, saying the soldiers were ambushed.\nREAD ALSO: Terrorists Flee As Troops Attack Boko Haram Enclave, Recover Gun TrucksHe also said the two injured officers are in a critical state, adding that he had just left the scene of the incident as at press time.\nPolice authorities in the state have also not issued a press statement about the attack."
  },
  {
    "headline": "Terrorists Flee As Troops Attack Boko Haram Enclave, Recover Gun Trucks",
    "summarized_story": "Boko Haram terrorists fled for their lives on Saturday as troops of the Nigerian Army attacked their enclave in Borno State.\nThe troops of 5 Brigade on fighting patrol stormed the insurgents’ enclave in the Douro area near Damasak in the north-eastern state.\nThe Nigerian Army disclosed this on Sunday via its official Facebook page, saying the insurgents abandoned their gun trucks and weapons in disarray.\n“During the attack terrorists fled in disarray abandoning their gun trucks & weapons.\nNigeria has been battling insurgency for over a decade in the northeast with Borno State being the theatre of operations."
  },
  {
    "headline": "SERAP Sues Buhari, Others Over ‘Missing N3.1bn In Finance Ministry’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari.\nThe suit is in connection with “his failure to probe allegations that over N3bn of public funds are missing from the Federal Ministry of Finance, and to ensure the prosecution of those suspected to be responsible and the recovery of any missing public funds”.\nIn a statement issued on Sunday, SERAP Deputy Director, Kolawole Oluwadare, said there have been allegations by the Office of the Auditor-General of the Federation in the 2018 and 2019 annual audited reports that N3.1bn of public funds are missing, misappropriated, or unaccounted for.\nSERAP, in the suit number FHC/L/CS/148/22 filed last Friday at the Federal High Court in Lagos, is seeking: “an order of mandamus to direct and compel President Buhari to ensure the investigation of the alleged missing N3.1bn of public funds, the prosecution of anyone suspected to be responsible, and the recovery of any missing public money”.\n“Investigating and prosecuting the allegations, and recovering any missing public funds would serve the public interest, and end the impunity of perpetrators."
  },
  {
    "headline": "Why I Want To Become APC National Chairman – Almakura",
    "summarized_story": "Former Governor of Nasarawa State, Tanko Almakura, has explained why he’s aspiring to become the next National Chairman of the All Progressives Congress (APC).\n“As far as I’m concerned there’s no scare,” he said on Channels Television’s Sunday Politics when asked why he wants to subject himself to what many might term a ‘political hot water’ with reference to the tenures of John Oyegun and Adams Oshiomhole respectively.\n“I feel my pedigree, my experience in various sectors which include party administration, governance as an executive and a legislator, will give me the opportunity to add value and ensure the success of the party”.\nAlmakura also noted that he has a “tremendous amount of confidence and faith in the APC”, which he believes is the party of everyone’s dream.\nWatch the full video below."
  },
  {
    "headline": "2023: Businessman donates campaign billboards, vehicles to support Tinubu -",
    "summarized_story": "The National Leader of the APC and 2023 Presidential aspirant Asiwaju Bola Tinubu has been described as a Leader who can bring the desired development to Nigeria.\nThis was made known at the public unveiling of a billboard and campaign vehicles in Lagos by a businessman who has volunteered to support the ambition of Bola Tinubu."
  },
  {
    "headline": "Kebbi LG Poll: Gov Bagudu canvasses support for APC candidates",
    "summarized_story": "Kebbi state Governor, Atiku Bagudu has assured of a credible election, as the state electoral commission set 5th of February 2022 for the state local government election.\nBagudu gave the assurance in Kamba town, Dendi local government area when he led other APC leaders to canvas support for candidates of the party at the coming local government election.\nAdvertisementThe governor says the APC government has delivered dividends of democracy to the teeming Nigeria populace especially in Kebbi state through the agricultural transformation and other meaningful projects.\nGovernor Bagudu said, the evidence of this is seen in how the people kept fate with the party through massive support that saw all elected political offices in the state entrusted in the hands of the APC.\nHe called on the people of the state to turn out in their numbers and vote massively for the party in the upcoming local government election."
  },
  {
    "headline": "Analysts discuss \"Not Too Young to Run Bill\", youths participation in politics -",
    "summarized_story": "On May the 31st, 2018, President Muhammadu Buhari signed the Not-Too-Young-To-Run bill into law.\nThis was part of efforts to get young Nigerians to be more involved in politics.\nAs Nigerians gear up towards the 2023 Election season, youths are being encouraged to participate more in the process by registering for their permanent voter cards, contesting elective positions, and also going out to cast their ballot.\nAdvertisement"
  },
  {
    "headline": "BREAKING: Biodun Oyebanji wins Ekiti APC governorship ticket -",
    "summarized_story": "A former Secretary to the Ekiti State Government, Biodun Oyebanji, has emerged the candidate of the All Progressives Congress in Ekiti State.\nMr Oyebanji emerged victorious with 101,703 votes, defeating seven other contestants.\nAdvertisementBreakdown of the votes shows that Bamidele Faparusi polled a total of 376 votes, Ojo Kayode had 767 votes, Opeyemi Bamidele, a serving Senator had 760 votes, Dayo Adeyeye, a former lawmaker polled 691 votes, Femi Bamisile polled 400 votes,.\nOthers are Toyin Afolabi who polled 47 votes and Demola Popoola who scored 239 votes.\nAdvertisementEarlier, seven aspirants announced their withdrawal from the contest, citing irregularities as reason for their exit."
  },
  {
    "headline": "Chris Okaeben: Governor Obaseki’s Dictatorship Has Cut off 17 LGAs in Edo State",
    "summarized_story": "Member, Edo State House of Assembly, Honourable Chris Okaeben, addresses the political crisis in the state, and possible ways forward."
  },
  {
    "headline": "Mason Greenwood Arrested on Suspicion of Rape, Suspended By Man United – Arise News",
    "summarized_story": "MANCHESTER United ace Mason Greenwood has been arrested on suspicion of rape and assault.\nGreater Manchester Police confirmed the 20-year-old striker remains in custody over the allegations which came to light in a series of graphic Instagram posts this morning.\nA spokesperson for the club added: “We are aware of images and allegations circulating on social media.\n“Manchester United does not condone violence of any kind.”Greater Manchester Police confirmed officers were investigating the claims.\n“An investigation was launched and following enquiries we can confirm a man in his 20s has since been arrested on suspicion of rape and assault."
  },
  {
    "headline": "Australian Open: Nadal Comeback Win Over Medvedev Secures Record 21st Grand Slam",
    "summarized_story": "Rafael Nadal has won a record-breaking 21st grand slam after outlasting Russian challenger Daniil Medvedev 2-6 6-7 6-4 6-4 7-5.\nHowever, this is just Nadal’s second win at the Australian Open.\nHe had five titles on hard courts, but four of those were the US Open and only one in Australia, until now.\nOn that occasion, he edged a five-set thriller against Federer in the 2009 Australian Open.\nMedvedev is the reigning US Open champion on the hard court surface and was a finalist in Melbourne 12 months ago."
  },
  {
    "headline": "Man United’s Greenwood Accused of Sexual Assault By Girlfriend",
    "summarized_story": "Manchester United player, Mason Greenwood, has been accused of sexual assault and domestic violence by his ex-girlfriend, Harriet Robson.\nIn a series of post on social media, Robson showed injuries she sustained when Greenwood allegedly forced himself on her.\nSome of the photos she shared showed bruises on her thighs while one showed blood flowing from her mouth down to her chest.\nMeanwhile, Manchester United have issued a statement saying they do not condone violence of any kind.\nManchester United does not condone violence of any kind.”"
  },
  {
    "headline": "Nigeria Records 32 Deaths, 170 Cases of Lassa Fever in Three Weeks",
    "summarized_story": "At least 32 people have died of Lassa fever since the beginning of the New Year, according to data from the Nigeria Centre for Disease Control (NCDC).\nThe agency disclosed that the nation reported a total of new 170 confirmed cases within the period.\nThe report also indicated that a total of 759 suspected cases of the disease were reported across 37 local government areas of 12 states.\nIn the third week of the year covering January 17 to 23, the NCDC said 294 suspected cases of Lassa fever were reported across 23 local government areas of nine states.\nSeventy-four of the suspected cases were confirmed while 11 new infected patients lost the fight to the disease."
  }
]