[
  {
    "headline": "JAMB blames NIN requirement as revenue drops to N5.8bn",
    "summarized_story": "It said the NIN requirement made it impossible for some prospective candidates to register, leading to the reduction in number of registered candidates and the proceeds generated from sales of forms.\nThe PUNCH had reports that JAMB generated N5,887,628,900 from the sale of forms for the 2021 UTME/DE.\nThe figure is lower than the N6,563,086,710 the board generated from forms in 2020.\nWe know factors such as the introduction of the NIN to the registration process were responsible.\nThe figures are against the total of over two million registered candidates for 2020."
  },
  {
    "headline": "Trigger-happy cop kills five Enugu youths, injures four",
    "summarized_story": "Enugu State Police Command on Sunday said it had arrested a trigger-happy police inspector who allegedly killed five people, while leaving four others critically injured.\nIt was gathered that the police inspector attached to Special Protection Unit Base 9, Umuahia, Abia State, started shooting residents at a lotto office to play Sunday morning.\nMeanwhile, Governor Ifeanyi Ugwuanyi of Enugu State has visited the victims at ESUT Teaching Hospital Parklane, Enugu, where they are receiving treatment.\nA statement by the governor’s special assistant on media, Mr Louis Amoke, said the governor announced that his administration would pay all the medical expenses.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Alleged Harassment: We Didn’t torture any Clergyman — Taraba Police",
    "summarized_story": "By Femi BolajiFollowing a report to the Leadership of Methodist Church by some clergymen that they were harassed by the police in Taraba state, the state Police command Saturday said it did not harass clergymen of the religious organization.\nSpokesman of the Police Command, DSP David Misal, who spoke at a briefing, however, accused the clergymen of spying on the Police, which he said contravenes the secrecy act.\nHe explained that the command had earlier received a complaint letter from some persons about the clergymen, which he said led to the command extending an invitation to them.\nAccording to him, “ the State Intelligence Bureau (SIB) sent an invitation letter to the clergymen for interrogation in which they voluntarily without threat or any form of coercion reported to the Police Headquarters.\n“it is pertinent to note that, Bishop John Wesley Yohana did not report any case to the Police neither uses his position to influence the action of the Police against the accused persons as alleged.“"
  },
  {
    "headline": "NADECO writes UNO over political instability, insecurity in Nigeria",
    "summarized_story": "The National Democratic Coalition (NADECO) has lamented the level of political instability and insecurity in Nigeria.\nNADECO, in the letter dated June,15, 2021, a copy of which was made available to Vanguard on Sunday said: “Other than diminishing Democracy to a virtual dictatorship, NADECO wonders by which Section of our Ill-founded and presently extremely beleaguered so called Federal Republic of Nigeria Constitution 1999.\n“NADECO stressed that out of the total of 360 House of Representatives members, the entire South has 169, while the North has 191.\nIt added that the North-West receives 21 per cent from the oil revenue and contributes 0.00 per cent.\nIt said South-west receives 16 per cent, contributes 6.36 per cent, while South-east receives 11.00 per cent; contributes 3.12 per cent and South-South receives 16.00 per cent and contributes 70.64 per cent."
  },
  {
    "headline": "Nigeria earned N79.96bn from solid minerals in 2019, highest in 5 years – NEITI",
    "summarized_story": "The Nigeria Extractive Industries Transparency Initiative (NEITI) says Nigeria earned N79.96bn from the solid minerals sector in 2019, according to its 2019 audit report on the sector, released on Sunday, in Abuja.\n“And it is also the highest since 2007, when NEITI commenced reconciliation of payments in the solid minerals sector,’’ the report said.\nLocal governments equally received N1.592billion or 17.92 per cent, while the balance of N1.155billion was distributed to only solid minerals producing states as their share of the 13 per cent derivation.\nOn minerals exports, the report showed that the solid minerals sector accounted for N124.23 billion of the total government exports of N24.275 trillion for 2019, representing 0.51 per cent of total exports for the year.\n“Nigeria’s GDP in 2019 was ₦144.210 trillion with contributions from the solid minerals sector totaling ₦368.99billion, representing 0.2per cent of the total amount."
  },
  {
    "headline": "A poem to celebrate 2021 Father’s Day",
    "summarized_story": "THANK YOU FATHERBy Adeola Olayisade (Adepttiz)The universe gave me a seasonTo celebrate father,Father gave me a reasonTo stand tall and strongTo be good and kindAnd to celebrate him always.\nYou are a man,So lovingly and kindYou have a heart as big as oceanA soft hearted perfect gentlemanA man so full of wisdom.\nThank you for your familyThank you for the love and affectionThank you for your provision and protectionThank you for no reasonThank you for every reason."
  },
  {
    "headline": "Zamfara bandits rustle 700 cattle, over 200 camels, sack 5 villages",
    "summarized_story": "By Ibrahim WuyoRampaging bandits who attacked Gana and Rampashi communities in Zamfara state have rustled about 700 cattle and over 200 camels, even as locals in 5 villages in the state have since deserted their villages.\nAlready, according to a BBC Hausa report monitored on Saturday, the bandits have killed 29 locals in the affected communities.\nIn a similar development ,the BBC Hausa reported that bandits have sacked about 5 villages in Anka and Bukuyum communities of Zamfara state.\nAnother local who sought anonymity told the BBC Hausa that the bandits came on bikes numbering about 300, each carrying 3 bandits wielding dangerous weapons.\nWhen contacted,the PPRO in Zamma state,Mohammed Shehu ,told the BBC Hausa service that they were yet to get the information ,but would investigate."
  },
  {
    "headline": "Buhari ready to dialogue with South-East over agitations",
    "summarized_story": "The Minister of Labour, Chris Ngige has said President Muhammadu Buhari has accepted the adoption of dialogue to address agitations in the South-East.\nNgige revealed this on Sunday, while speaking with State House correspondents, after meeting with Buhari in Abuja.\nThere have been agitations from parts of the South-east for secession, with the proscribed Indigenous People of Biafra (IPOB) well in the forefront of the fight.\n“We are following up with dialogue, which at the end of the day, is what will happen.\n“We briefed him and he accepted that dialogue is the way to go in all this,” Ngige said."
  },
  {
    "headline": "Oyo NUJ calls for arrest of killers of Ibadan-based journalist",
    "summarized_story": "The Nigerian Union of Journalists (NUJ), Oyo State Council, has called on the state government to fish out the killers of an Ibadan-based journalist, Titus Badejo.\nThe council Chairman, Mr Ademola Babalola made the call in condolence message issued on Sunday to newsmen in Ibadan, NAN reports.\nSeyi Makinde and Commissioner of Police, Ngozi Onadeko, to ensure the killers were apprehended and made to face the full wrath of the law.\n“We mourn the untimely passing on and gruesome murder of Titus Badejo, a journalist.\n“Under the cover of darkness, the assailants snuffed life out of a promising young man who had a bright future."
  },
  {
    "headline": "We will rebuild Ekwereazu-Akwa Ibom link road",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has assured that his administration will rebuild the Umuaro – Ekwereazu – Nto Edino Road in Obingwa LGA constructed by his administration which has provided a strategic linkage between Abia and Akwa Ibom states.\nIkpeazu made this known during the weekend while commissioning the Umuaro-Umuopara-Amano Road in Obingwa LGA.\nThe Governor noted that the reason for the failure of the road has been identified.\nHowever, the road, unfortunately, became the only route for heavy-duty and deadweight vehicles, particularly those conveying several hundreds of tons of cement from Akwa Ibom State through Aba to other parts of the country, adding that the road carved into the massive pressure of these deadweight vehicles that ply the road daily in their hundreds.\nCivil servants must contribute in rebuilding Kastina market because they consume 80 percent of allocation"
  },
  {
    "headline": "Afenifere kicks as Buhari insists on reopening grazing routes",
    "summarized_story": "A leading Yoruba socio-political organisation, Afenifere, has said the Federal Government’s move to reopen the grazing routes is unacceptable.\nAfenifere’s National Publicity Secretary, Jare Ajayi, in a statement on Sunday, said the Federal Government’s insistence shows disdain and contempt that it has for the people.\n“The insistence of the present administration on re-opening the so-called grazing routes shows the duplicity, dishonesty and the draconian tendencies of the government,” Afenifere said.\n“What is more, it has been established that the so-called grazing routes did not exist in all the states in the country.\nReopening the grazing routes is unacceptable on any grounds.”Gov Akeredolu kicks against Buhari’s move for open grazing"
  },
  {
    "headline": "Electoral Bill: Gov Emmanuel seeks UN’s support for passage, assent",
    "summarized_story": "Governor Udom Emmanuel of Akwa Ibom State has sought the support of the United Nations for the passage of a pending electoral bill by the National Assembly and subsequent executive assent.\nThe Governor made the demand at the weekend at the government house, Uyo, the State capital when the United Nations SDGs Resident Humanitarian Coordinator, Mr. Edward Kallon, paid him a courtesy visit.\nThe Ambassador also presented a UN SDGs Champion Laurel to the Governor for aligning with the organisation’s Sustainable Development Goals in his investment drive.\nHe added that such would boost tourism as well as the economy in the state.\nClaims of zero allocation to LG bosses, totally false – Akwa Ibom Assembly insists"
  },
  {
    "headline": "11, Capital Bancorp begin trading on NASD OTC Securities Exchange",
    "summarized_story": "11 Plc, formerly known as Mobil Oil Nigeria Plc, and Capital Bancorp Plc at the weekend started trading on the NASD OTC Securities Exchange, opening up new window for secondary market transactions.\nThe NASD OTC Securities Exchange is the government-approved over-the-counter (OTC) platform for trading in unlisted public companies.\nADVERTISEMENTNASD pointed out that OTC platform has been created for securities that are not listed on any other securities exchange providing a secure regulated platform for Investors to trade on them.\n11 had delisted its shares from the Nigerian Exchange (NGX) Limited, ending its 42-year listing on a regular stock exchange.\nThis raises possibility of its shares being listed and traded on the NASD OTC Securities Exchange –the over-the-counter platform for trading of unlisted public companies."
  },
  {
    "headline": "GTBank to list holding company on stock exchange",
    "summarized_story": "According to the NGX, the step it took was necessary to prevent trading in the shares of the bank in preparation for the eventual delisting of GTBank from the Daily Official List of the Nigerian Exchange Limited (NGX) and listing of the holding company, Guaranty Trust Holding Company Plc on NGX.\nThe new company, Guaranty Trust Holding Company (GTHoldings) Plc, will simultaneously allot the same 29.431 billion ordinary shares of 50 kobo each to the former shareholders of GTBank in accordance with their shareholdings in the bank.\nHe explained that under the new structure, shareholders of GTBank would be migrated to Guaranty Trust Holdings through a share-for-share exchange between the shareholders of GTBank and GTHoldings.\n“I am delighted over the approval by shareholders for the holding company and I assure the investors of a more rewarding future.\n“We are excited about the development because we are going to get value as everything we have would be transferred to the holding company."
  },
  {
    "headline": "DLM Capital Group is best in ‘structured finance’",
    "summarized_story": "DLM Capital Group, a developmental investment bank, has emerged winner at the Capital Finance International (CFI) 2021 awards as the best structured finance and securitisation team in West Africa.\nADVERTISEMENTDLM Capital Group creates business solutions for alternative financing and harnessing funds for growth.\nDLM Capital Group remains committed to constantly providing financial solutions that will enable our clients make a difference, and we are honored to be recognized once again as a reflection of the quality of support offered to our clients’’ she added.\nDLM has won recognition in West African capital markets, acting as sole arranger to over 80 percent of structured finance transactions in Nigeria — and all the securitization transactions.\nIt provides deal structuring, advisory execution and capital raising services across the Nigerian capital market."
  },
  {
    "headline": "Data protection firm launches new solution",
    "summarized_story": "Data Analytics Privacy Technology Ltd (DAPT), a government-licensed data protection compliance organisation (DPCO), has announced the release of collaborative NDPR365 SaaS Technology solution for the ongoing data protection and privacy compliance implementation, management and practices in Nigeria.\nAccording to him, the NDPR365 solution is designed for Nigerians companies with Nigerian citizens’ data, foreign organizations with Nigerians’ data, Data Protection Officers (DPO’s) and Data Protection Champions, Cybersecurity individuals and all organizations that control or process personal data of data subjects within the scope of current NDPR and future Nigerian Data Protection and Privacy Laws.\nThe company’s Chief Data Protection Officer, Franklin Akinsuyi, who is also a co-founder of the firm with over 25 years experience in advising global organisations on data protection, privacy and cybersecurity compliance related issues reiterates that ‘’NDPR is the Nigerian equivalent of the European Union’s General Data Protection Regulation (GDPR).\nNDPR365 has been specifically designed to provide organizations with the ability to perform Data Mapping, Policies and Procedures, Data Processing, Data Sharing, Technical and Organizational Measures, Data Subject Access Request, Data Protection impact assessments, Data Breach activities.\nNDPR365 is a one stop solution for Nigeria Data Protection and Privacy Regulation (NDPR) assessment and compliance for SMEs and large organizations."
  },
  {
    "headline": "Scrap Bank provides funding to waste recyclers",
    "summarized_story": "Scrap Bank Africa (SBA) is providing funding support to the recycling industry for the efficiency and sustainability of their operations.\nAccording to him, the organisation is on-boarding waste collectors and aggregators and that it also offers competitive rates, storage facilities, logistics and technology.\nHe said small businesses in the waste management industry could also benefit by accessing financial aid, with flexible and unconventional payment plans.\nIt is a business of The Greenable Company Limited, an investee company of Seeder & Ash Capital,” the company said.\nA new entrant into the waste management industry, SBA is setting new standards by providing solutions for a healthier planet, thereby empowering Nigerians."
  },
  {
    "headline": "Buhari meets Ngige, Gambari over insecurity in South East",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at the weekend met with Minister of Labour and Employment, Chris Ngige, and his Chief of Staff, Ibrahim Gambari at Aso Rock over the escalating insecurity in the South East.\nBriefing State House Correspondents at the end of the meeting, Ngige said they both briefed the president and made proposals to him on how to end the crisis.\nAnd we are following up with dialogue, which at the end of the day is what will happen.\n“I have to see him to appraise him with labour industrial milieu, especially when you know that the judiciary and parliamentary workers JUSUN and PASAN respectively had been been on strike that lasted for two months.\nWe achieved a truce, through up an agreement and we have to today summit his own copies of the agreement to him."
  },
  {
    "headline": "Father’s Day: Kalu tasks fathers on nation building",
    "summarized_story": "Kalu tasked the nation’s fathers to rise to the occasion of defending the Church and the nation at large.\nThe ambience of the church was lightened up as Kalu donated over N2 million to the Catholic Men Organisation (CMO), Catholic Women Organisation and officiating Catholic priests.\nFather Charles congratulated fathers and acknowledged that the roles of fathers in nation building cannot be over-emphasised.\nThe Catholic cleric also urged fathers to register with CMO and lamented the refusal of some fathers in the church to join the organisation.\nHe outlined the numerous benefits of aligning with the forum, while urging unregistered fathers to join the association."
  },
  {
    "headline": "NDLEA nabs law enforcement officer, 6 others for dealing in cocaine",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has arrested a serving officer of a law enforcement agency, Popoola Abayomi for selling assorted illicit drugs to students of a Federal university and cultists in Ogun state.\nBefore he was finally arrested, Abayomi, had been on the watch list of the agency in connection with drug related offences.\nAfter the arrest of the two suspects, some student union officials of the institution blocked the NDLEA team with their official vehicle.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nThe suspect had arrived the ‘D’ arrival hall of the airport on 14th June on Turkish airline flight from Pakistan with the illicit drug inserted in his anus."
  },
  {
    "headline": "Security beefed up as Olu of Warri burial rites begin",
    "summarized_story": "From Ben Dunno, WarriOde-Itsekiri, the traditional ancestral home of Itsekiri nation, is witnessing heavy presence of armed security personnels as burial rites commences for the late Olu of Warri, Ogiame Ikenwoli.\nThe vigil was part of the activities lined-up as 14 days traditional funeral rites for the repose of the soul of the royal father and was witnessed by dignitaries from all walks of life, both at home and in the diaspora.\nHowever, Saturday’s all-night traditional funeral rites was hitch-free with Ogele Ukpukpe, Ibiogbe and Uku-Umalikun Ola-Aja dancers from various Itsekiri communities showcasing their rich cultural heritage to the delight of those in attendance, including non-indigenes.\nThe traditional funeral rites was presided over by the Regent of Warri Kingdom, Prince Emmanuel Okotie-Eboh and coordinated by lawmaker representing Warri Federal Constituency at the House of Representatives, Thomas Ereyitomi.\nA commendable service was held in the Church of the Palace of Olu of Warri last Thursday, as part of the 14 days burial rites for the late monarch."
  },
  {
    "headline": "FG, Lai sued over directive to broadcasters to stop using Twitter",
    "summarized_story": "Socio–Economic Rights and Accountability Project (SERAP) has filed a lawsuit asking the Federal High Court in Abuja to stop the Federal Government and Minister of Information and Culture, Mr. Lai Muhammed from using the unlawful directive to TV and radio stations not to use Twitter and to delete their accounts, as a pretext to harass, intimidate, suspend or impose criminal punishment on journalists and broadcast stations.\nThe suit followed the order by the National Broadcasting Commission (NBC) asking TV and radio stations to “suspend the patronage of Twitter immediately”, and telling them to delete ‘unpatriotic’ Twitter, after the social media giant was banned in the country for deleting President Muhammadu Buhari’s tweet.\nIn the suit number FHC/ABJ/CS/496/2021 filed last Friday, SERAP is seeking “an order of perpetual injunction restraining the government of President Buhari, NBC, and Mr Lai Muhammed and any other persons from censoring, regulating, licensing and controlling the social media operations and contents by broadcast stations, and activities of social media service providers in Nigeria.”SERAP is also seeking an order setting aside the directive by NBC and Muhammed that broadcast stations stop using Twitter, as it is unconstitutional, unlawful, inconsistent and incompatible with the Nigerian Constitution of 1999 (as amended) and the country’s obligations under the African Charter on Human and Peoples’ Rights and the International Covenant on Civil and Political Rights.”“The government of President Buhari, NBC and Mr Lai Muhammed have consistently made policies and given directives to crackdown on media freedom, and the rights of Nigerians to freedom of expression and access to information, and to impose crippling fines and other sanctions on broadcast stations without any legal basis whatsoever.\nThe court has an important role to play in the protection and preservation of the rule of law to ensure that persons and institutions operate within the defined ambit of constitutional and statutory limitations.”No date has been fixed for the hearing of the suit."
  },
  {
    "headline": "NADECO Writes Buhari on Insecurity, Insists on Abrogation of 1999 Constitution",
    "summarized_story": "The letter, dated June 15, 2021, and obtained by THISDAY, was signed by its General-Secretary, Mr. Ayo Opadokun.\nNADECO, in the letter to the president, accused him of fuelling secessionist agitations through the “Fulanisation” policy of his administration and its disregard for the constitution.\nNADECO argued that the growing secessionist tendencies in the country were fueled by what it called the obvious policy of Fulanisation and the president’s refusal to discontinue the operation of the 1999 Constitution as altered.\nIt added that the North-west receives 21 per cent from the oil revenue and contributes 0.00 per cent.\nAccording to it, the South-west receives 16 per cent, contributes 6.36 per cent, while South-east receives 11.00 per cent; contributes 3.12 per cent and South-South receives 16.00 per cent and contributes 70.64 per cent."
  },
  {
    "headline": "Courts, Assemblies Move to Relist Cases, Bills Stalled by Workers’ Strike",
    "summarized_story": "The strike also stopped the passage of 49 important bills in six states, while debates on many other legislative bills were halted.\nAlso, proceedings in 880 court cases were halted in Ekiti; over 100 cases in Sokoto; and over 100,000 cases in Katsina, mostly in sharia and magistrate’s courts.\nIn Edo State, the Speaker of the state House of Assembly.\nMarcus Onobu, told THISDAY that about five bills critical to good governance could not be passed due to the strike embarked by the legislative workers.\nIn Lagos State, the strike had minimal effect on the workings of the state House of Assembly as it carried on its business normally."
  },
  {
    "headline": "Govt, Operators Move to End $2bn Aircraft Maintenance Capital Flight",
    "summarized_story": "•Initiative to help Nigeria conserve forexChinedu EzeAs part of efforts to end the huge capital flight spent on maintenance of aircraft overseas put at $2 billion annually, some operators in the aviation industry and the Akwa Ibom State government have taken steps towards developing maintenance facilities in Nigeria.\nThe maintenance facilities would, in turn, be a source of forex earner for the country as airlines and aircraft owners in Africa and beyond could maintain their equipment in Nigeria.\nIt makes me happy that the owners of these maintenance facilities have a good purpose.\n“What makes me happy is that there is a huge market for these maintenance facilities.\nHe also spoke about the cost of taking aircraft overseas for maintenance, saying: “I think there are so many disadvantages to taking your aircraft out of the country for maintenance."
  },
  {
    "headline": "Policeman Goes Berserk, Kills Five Persons, Injures Four in Enugu",
    "summarized_story": "The Governor of Enugu State, Hon.\nIfeanyi Ugwuanyi has also visited the victims at the hospital and promised to pay all the hospital bills.\nThe incident, according to the statement, occurred yesterday at about 0930hrs in the Golf Estate area of Enugu.\nUgwuanyi was received at the hospital by the Commissioner of Police, Enugu State Command, Mohammed Ndatsu Aliyu and the Chief Medical Director, Prof. Hyacinth Onah.\nAccording to a statement by the State Commissioner for Information, Mr. Chidi Aroh, the governor expressed shock over the dastardly act."
  },
  {
    "headline": "Just In: Troops Rescue Three Kebbi Students, One Teacher, Kill Bandit",
    "summarized_story": "“Deploy more troops for search and rescueKingsley Nwezeh in AbujaThe Nigerian Army said troops operating under the auspices of Operation Hadarin Daji, supported by Nigerian Air Force rescued one teacher and three students of the Federal Government College, Birnin Yawuri in Kebbi State.\nThe army had said Friday that one student died of exhaustion during a rescue operation as troops of Operation Hadarin Daji engaged kidnappers in a fire-fight, culminating in the rescue of five students and two teachers of the college.\nA statement issued Sunday by Army Spokesman, Brigadier-General Onyema Nwachukwu, said one teacher and three more students were rescued weekend.\n“One teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations”, it said.\nThe army statement said “troops also killed one bandit and recovered nine motorcycles and four handsets from the fleeing bandits”It said “additional troops have also been deployed to dominate the forest and deny the bandits freedom of action”."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "Buhari has accepted dialogue to address agitations in south-east, says Ngige",
    "summarized_story": "Chris Ngige, minister of labour, says President Muhammadu Buhari has accepted the adoption of dialogue to address agitations in the south-east.\nThere have been attacks on government buildings across the south-east, leading to the killing of several security operatives.\nAdvertisementThere have also been agitations from parts of the south-east for secession, while various stakeholders have also lamented the marginalisation of the region.\nHowever, according to Ngige, the federal government is working out some modalities to ensure that the people of the south-east do not “feel unwanted” in Nigeria.\nSo, certain things will be done, at least to assuage the feelings of the people in the area, and make them not feel unwanted.”"
  },
  {
    "headline": "Buhari has accepted dialogue to address agitations in south-east, says Ngige",
    "summarized_story": "Chris Ngige, minister of labour, says President Muhammadu Buhari has accepted the adoption of dialogue to address agitations in the south-east.\nThere have been attacks on government buildings across the south-east, leading to the killing of several security operatives.\nAdvertisementThere have also been agitations from parts of the south-east for secession, while various stakeholders have also lamented the marginalisation of the region.\nHowever, according to Ngige, the federal government is working out some modalities to ensure that the people of the south-east do not “feel unwanted” in Nigeria.\nSo, certain things will be done, at least to assuage the feelings of the people in the area, and make them not feel unwanted.”"
  },
  {
    "headline": "Five dead, four injured as police officer goes on shooting spree in Enugu",
    "summarized_story": "A police inspector has been arrested in Enugu, after a shooting spree on Sunday that resulted in the death of five persons.\nAdvertisementFour others, who also sustained injuries, are currently receiving treatment at the Enugu State University Teaching Hospital.\nConfirming the incident in a statement, the state police command said it was unclear what led the police officer to shoot sporadically.\nAdvertisementMohammed Aliyu, Enugu commissioner of police, in the statement issued by Daniel Ndukwe, spokesman of the command, said the police officer has been taken into custody, pending the conclusion of investigation.\nAdvertisementOn his part, Ifeanyi Ugwuanyi, governor of Enugu, sympathised with the victims when he visited those who were hospitalised."
  },
  {
    "headline": "Five dead, four injured as police officer goes on shooting spree in Enugu",
    "summarized_story": "A police inspector has been arrested in Enugu, after a shooting spree on Sunday that resulted in the death of five persons.\nAdvertisementFour others, who also sustained injuries, are currently receiving treatment at the Enugu State University Teaching Hospital.\nConfirming the incident in a statement, the state police command said it was unclear what led the police officer to shoot sporadically.\nAdvertisementMohammed Aliyu, Enugu commissioner of police, in the statement issued by Daniel Ndukwe, spokesman of the command, said the police officer has been taken into custody, pending the conclusion of investigation.\nAdvertisementOn his part, Ifeanyi Ugwuanyi, governor of Enugu, sympathised with the victims when he visited those who were hospitalised."
  },
  {
    "headline": "Troops rescue three more students abducted from Kebbi school",
    "summarized_story": "The Nigerian army says three more students abducted from the Federal Government College, Birnin-Yauri, in Kebbi state, have been rescued.\nAdvertisementA statement by Onyema Nwachukwu, army spokesperson, noted that a teacher was also rescued alongside the students.\nNwachukwu said the abductees were rescued by troops of operation Hadarin Daji on Saturday.\nAdvertisementOn Friday, some of the abductees were rescued by troops; however, one of the kidnapped students was killed.\nAdvertisement“One teacher and three students were rescued yesterday at Makuku in the ongoing search and rescue operations."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "BUA Cement Further Guarantees ‘No Price Increase’ In Coming Weeks In the light of the current inflationary trend, BUA Cement, Nigeria’s second-largest cement maker, has again assured Nigerians that it won’t further increase the price of cement.\nThis is the second time BUA is reassuring its customers in the past two months.\nThis was confirmed…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "When two years seem like eternity",
    "summarized_story": "Some have described the next two years as an “eternity”, saying that to endure the “suffocating air” for the next two years would be the worst punishment for Nigerians.\nDuring the 2015 general election campaign, the then ruling party and the main opposition party promised Nigerians a lot of goodies.\nYet, they don’t see any difference in the current situation within the remaining two years of this administration.\nIt will definitely get worse in the remaining two years of Buhari,” Angwe Yakubu, a retired senior security personnel, said.\nThis APC- led government is a failure.”According to Daramola, “The President is clueless on providing security for Nigerians not to talk of foreigners."
  },
  {
    "headline": "Is Nigerian Senate playing politics with PIB, Electoral Act and Constitutional Amendment?",
    "summarized_story": "So, the emergence of Senator Ahmad Lawan from Yobe North Senatorial District and Ovie Omo-Agege from Delta Central Senatorial District as president and deputy Senate president, respectively, was largely seen as mission accomplished.\nSimilarly, the $30 billion loan request of the president to the 8th Senate was also rejected to save the country from sinking deeper into indebtedness.\nBesides, on May 18, 2021, Buhari had sought the approval of the Senate to borrow a fresh N2.343 trillion ($6.18bn) external loan.\nNonetheless, the Electoral Act Amendment bill is one bill Nigerians are calling the 9th Senate to also expedite action on in view of the 2023 general election.\nLawan has again promised Nigerians that the Electoral Act Amendment bill and the Constitutional Amendment bill will the passed by mid July 2021 before going on recess."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Edo State Govt assures SACA of collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestENIN CITY – Edo State government has assured of its commitment in view of partnering with the Edo State Action Committee on Aids (SACA) in its drive towards mitigating the spread of HIV/AIDS in the state.\nThe Permanent Secretary, Edo state Ministry of Communication and Orientation, Mr. Joses Sede gave the assurance when he played host to the team of SACA who were on a courtesy visit to the Ministry yesterday in Benin city.\nWhile appraising SACA’s roles towards cushioning the spread of HIV disease in the society, which he said were in line with the state governor, Godwin Obaseki’s vision of making Edo state great again, Joses said the present administration was committed towards restoring the dignity of the state, hence the Make Edo State Great Again ( MEGA).\nAcknowledging that Edo State had always been rated top since Midwest era, the PS charged the good people of Edo State on the need to strengthen their cooperation with the state governor towards moving the state to enviable height.\nShe thanked the PS for granting them audience to acquaint the Ministry with SACA’s activities in the state and appealed for continuous collaboration."
  },
  {
    "headline": "Five dead, 4 injured as police officer runs berserk",
    "summarized_story": "ADVERTISEMENTThe Police Command in Enugu State has confirmed five persons dead after a police officer attached to a company went berserk and attacked a compound in Enugu metropolis.\nThe state’s Commissioner of Police, Mohammed Aliyu, confirmed the incident in a statement issued on his behalf by the command’s Police Public Relations Officer, Daniel Ndukwe, in Enugu.\nMr Aliyu said that the police cop had been arrested and taken into custody pending the conclusion of investigation.\n“Five others, whose injuries were critical, have been confirmed dead by doctors on duty and deposited in the mortuary for autopsy,’’ he said.\nMeanwhile, the commissioner sympathised with the family and friends of the dead to remain calm and cooperate with the command in the ongoing investigation."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NUC Accredits 47 Programmes Of Rivers Varsity",
    "summarized_story": "National Universities Commission (NUC) has granted full accreditation to all the 47 undergraduate programmes of the Ignatius Ajuru University of Education, Rumuolumeni, Port Harcourt.\nAdvertisementsVice chancellor of the university, Professor Ozo-Mekuri Ndimele, disclosed this at the weekend while speaking at the matriculation of fresh students for the 2020/2021 academic sessions.\nNdimele explained that his administration has progressively increased the carrying capacity of the university through expansion of infrastructure to cater for the large influx of students.\nHe stated that the postgraduate programme of the university was one of the most efficiently-run, making the institution a choice destination because students graduate on record time without compromising academic best practices.\nAdvertisementsNdimele, who admonished the fresh students to take their studies seriously, and abide by the rules and regulations of the institution as contained in the handbook, warned that those who involve in cultism, examination malpractices, rape, and fighting, stealing, and other anti-social behaviour would be sanctioned, or expelled if guilty."
  },
  {
    "headline": "NUC Accredits 47 Programmes Of Rivers Varsity",
    "summarized_story": "National Universities Commission (NUC) has granted full accreditation to all the 47 undergraduate programmes of the Ignatius Ajuru University of Education, Rumuolumeni, Port Harcourt.\nAdvertisementsVice chancellor of the university, Professor Ozo-Mekuri Ndimele, disclosed this at the weekend while speaking at the matriculation of fresh students for the 2020/2021 academic sessions.\nNdimele explained that his administration has progressively increased the carrying capacity of the university through expansion of infrastructure to cater for the large influx of students.\nHe stated that the postgraduate programme of the university was one of the most efficiently-run, making the institution a choice destination because students graduate on record time without compromising academic best practices.\nAdvertisementsNdimele, who admonished the fresh students to take their studies seriously, and abide by the rules and regulations of the institution as contained in the handbook, warned that those who involve in cultism, examination malpractices, rape, and fighting, stealing, and other anti-social behaviour would be sanctioned, or expelled if guilty."
  },
  {
    "headline": "CAC Registrar-General Denies Alleged Embezzlement Of N6.5bn",
    "summarized_story": "AdvertisementsDirector, Public Affairs of CAC, Duke Ukaga, in a statement said the allegation was a figment of imagination of the AUPCTRE.\n“The Commission had been approving and granting loans from the revenue account and loan recoveries were not properly accounted for.\nOn Staff Cooperative Loans, Ukaga said, these are matters between the members and the cooperative society.\n“It is laughable that the claimants were raising doubt about the content of Asset declaration they are not privy to.\n“A total of 394 staff sat for the 2019 promotion examination."
  },
  {
    "headline": "CAC Registrar-General Denies Alleged Embezzlement Of N6.5bn",
    "summarized_story": "AdvertisementsDirector, Public Affairs of CAC, Duke Ukaga, in a statement said the allegation was a figment of imagination of the AUPCTRE.\n“The Commission had been approving and granting loans from the revenue account and loan recoveries were not properly accounted for.\nOn Staff Cooperative Loans, Ukaga said, these are matters between the members and the cooperative society.\n“It is laughable that the claimants were raising doubt about the content of Asset declaration they are not privy to.\n“A total of 394 staff sat for the 2019 promotion examination."
  },
  {
    "headline": "Jamoh Calls For Removal of War Risk Insurance On Nigerian Bound Cargoes",
    "summarized_story": "BY Ejike Ejike, AbujaAdvertisementsDirector general of Nigerian Maritime Administration and Safety agency (NIMASA), Dr Bashir Jamoh, has expressed worry over the persisting War Risk Insurance on Nigerian bound cargoes, calling for its removal.\nJamoh noted that though piracy in the Nigerian waters is waning, stakeholders in the industry are worried that offshore underwriting firms still insist on very high premium to be paid by those conveying cargoes to Nigeria.\nWar risk insurance is a type of insurance, which covers damage due to acts of war, including invasion, insurrection, rebellion and hijacking.\nAdvertisementsIt generally has two components: War Risk Liability, which covers people and items inside the craft and is calculated based on the indemnity amount; and War Risk Hull, which covers the craft itself and is calculated based on the value of the craft.\nIt tracks insured vessels on a 24-hour basis, but because the risks are so high, it limits claims to $25 million."
  },
  {
    "headline": "Many killed, 26 kidnapped as S'Kaduna vows to reclaim all lands —",
    "summarized_story": "IDBIA GABRIEL, KADUNAPresident of Southern Kaduna Peoples Union (SOKAPU), Hon.\n“Not less than 26 persons were kidnapped, including the two wives of Na’Allah Na’Dare – Ruth Na’Alla and Blessing Na’Alla.\n“The parent of slain Yossie Timothy, Timothy Adamu and his wife were also kidnapped.\n“What is even more disturbing is that Kaduna State government has refused to acknowledge and document all these crimes in its daily ‘Security Updates’ usually signed by Kaduna State Commissioner of Home Security and Internal Affairs, Samuel Aruwan.\n“It was alright for Samuel Aruwan to carry along some top military brass, Kaduna State Commissioner of Police among others to condole the Emir of Zaria, HRH."
  },
  {
    "headline": "COAS visits wounded soldiers in hospital —",
    "summarized_story": "The Chief of Army Staff (COAS), Maj.-Gen. Faruk Yahaya, has visited wounded troops recuperating in University of Maiduguri Teaching Hospital.\n“During his visit to the hospital, he assured troops of adequate medicare and support in the ongoing counter-insurgency operations.\n“While at the hospital, the COAS took time to interact with the soldiers and assured them of proper medical care and welfare, adding that their medical care is of utmost importance to him.\n“He averred that the nation is indeed proud of their selfless service and sacrifices towards restoring peace to the North East region.\n“Similarly, the COAS visited the Mechanical Repair Group to inspect the ongoing repairs and refurbishment of vehicles at the workshop through the use of local resources."
  },
  {
    "headline": "JAMB: Supervisors, candidates commend CBT exams, call for...",
    "summarized_story": "Some supervisors and candidates of the 2021 UMTE Joint Admissions and Matriculation Board (JAMB) examination in various centres in Abakaliki, Ebonyi have commended the conduct of the exercise in spite of little itches.\nZaka, who supervised at the JAMB Computer-based Testing (CBT) examination centre at CSMT said that the challenge experienced was minor technical issue which was rectified.\nThe News Agency of Nigeria (NAN) observed that some candidates were late to the examination centres.\nOgbu, who is also a lecturer at the Ebonyi State University said that the centre accommodated 250 candidates for each batch.\nMeanwhile, some candidates for the Examination in Abakaliki, have called for creation of more centres in the state."
  },
  {
    "headline": "Breaking: Army rescues more kidnapped Kebbi students, kill bandit",
    "summarized_story": "The Nigerian Army has confirmed the rescue of more students of the Federal Government College, Yauri, Kebbi State who were kidnapped by bandits on Thursday.\nNaija News reports one teacher and three students have been freshly rescued by the military from the custody of the bandits.\nREAD ALSO: Police arrest bandit, recover AK47 rifle in KadunaThe Army statement reads: “Troops of the Nigerian Army operating under the auspices of Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the FGC Birnin Yawuri.\nOne teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations.\nMeanwhile, the Nigerian Air Force (NAF) on Sunday bombed dozens of Islamic State West Africa Province (ISWAP) terrorists in Lamboa in Kaga Lga of Borno State."
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Kumuyi breaks silence on youths obstructing service to celebrate his 80th birthday",
    "summarized_story": "General Superintendent, Deeper Christian Life Ministry, Pastor William Kumuyi has lifted punishment meted out to some youths of the church who obstructed a Sunday worship service to celebrate his 80th birthday.\nService was temporary obstructed as they were overjoyed, singing and blowing the trumpets and other musical instruments.\nThis was the first time such a thing has occurred in the history of Deeper Life, a conservative holiness church.\nWhile some were happy, others felt the youths have compromised the standard of the church.\nKumuyi thanked the youths for honouring him with their musical instruments."
  },
  {
    "headline": "YPP berates APC’s vows to end insecurity",
    "summarized_story": "Adejoke Adeleye,AbeokutaThe Young Progressive Party, (YPP) has assured Nigerians that if given the support to rule in the country, the narrative of insecurity will change.\nThe Party lamented over the high rate of insecurity in the country, saying that the government of the day is bereaved of the ideas concerning insecurity.\nHe continued “We do not need anyone’s billions, YPP is totally different from other parties.\nHe also encouraged Nigerian youths to participate actively in politics, saying that it is only YPP that can recognize the youths and encourage them.\nHe said “YPP is the building ground for the youths to realise that the lifetime ambition of youths is the leaders of tomorrow, it is not as if we don’t have old people with experience in YPP, YPP is providing the platform for the youths to prevent them from being a backbencher."
  },
  {
    "headline": "Battle of Kumshe: Six Boko Haram terrorists gunned down, six AK-47 recovered",
    "summarized_story": "By Kazeem UgbodagaNigerian troops have gunned down six Boko Haram terrorists as the insurgents attempted to invade Kumshe Town in Borno, Northeast Nigeria.\nTroops of Joint Task Force North East Operation HADIN KAI (OPHK) deployed at the Forward Operational Base (FOB) of 152 Battalion engaged the terrorists in a gun-battle and repelled them from entering the Town.\nArmy spokesman, Brigadier General Onyema Nwachukwu, in a statement late Sunday night said on Sunday, 20 June 2021 the troops gallantly dealt with elements of Boko Haram terrorists (BHTs) on a suicidal infiltration attempt into the camp.\nHe said the terrorists mounted on four Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment, but were met with the fierce fire of the highly alert troops, resulting in the instant killing of six terrorists.\n“The Chief of Army Staff, Major General Faruk Yahaya has lauded the troops’ high level of alertness and fighting spirit, urging them to sustain the momentum and ensure that the remnants of terrorists hibernating in the area are completely cleared,” he said."
  },
  {
    "headline": "[BREAKING] Kebbi Abduction: Army Rescue More Students, Kill Bandit",
    "summarized_story": "More students from the Federal Government College in Yauri, Kebbi State, were kidnapped by bandits on Thursday, according to the Nigerian Army.\nOne instructor and three students were just freed from the bandits’ custody by the military.\nBrigadier-General Onyema Nwachukwu, Director Army Public Relations, confirmed the news to NEWS DIRECT in a statement on Sunday.\nThe Army statement reads: “Troops of the Nigerian Army operating under the auspices of Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the FGC Birnin Yawuri.\n“One teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations."
  },
  {
    "headline": "JUST IN: NAF Bombs ISWAP Chief, Modu Responsible For Killing Shekau",
    "summarized_story": "On Sunday, the Nigerian Air Force (NAF) killed dozens of Islamic State West Africa Province terrorists in Lamboa, Borno State’s Kaga Local Government Area.\nMultiple airstrikes by Alpha-Jets, L-39, and MI-35 helicopters targeted a well-known terrorist, Modu Sulum, and others.\nSulum, the ISWAP Logistics Commander, was present when Abubakar Shekau, the Boko Haram factional commander, was killed in May.\nAfter the NAF reconnaissance platform flew over the location to check the objectives, ground and air troops canceled their mission.\nWith the assumption of office of Major General Chris Musa, the New Theatre Commander Operation Hadi Kai, military offensives have increased."
  },
  {
    "headline": "BREAKING: President Buhari Mourns Death Of Alade",
    "summarized_story": "President Muhammadu Buhari has expressed his condolences to Chief (Arc) Isaac Folayan Alade’s family and friends upon his death.\nPresident Buhari lauded Alade, saying that his stamp on the country’s renowned structures will inspire future architects from within and outside the country, leaving a legacy of genius and diligence.\nThe President joins the Nigerian Institute of Architects, the Royal Institute of British Architects, and the Architects’ Registration Council of the United Kingdom in mourning the first architect to serve as a Permanent Secretary in Nigeria, as well as Pro-Chancellor and Chairman of the Federal University of Port Harcourt’s Governing Council.\nHe expressed his condolences to the government and people of Ekiti State, believing that Chief Alade’s contributions to the country’s development in design, construction, and administration, particularly historic structures such as the National Stadium Lagos, Tafawa Balewa Square (TBS), Federal Secretariat Lagos, and Nigerian Institute of Policy and Strategic Studies, will be remembered by posterity."
  },
  {
    "headline": "The Oil In Nigeria Was Discovered With Northern Nigerian Money – Northern Group Says They Are Not Parasites",
    "summarized_story": "Awwal Abdullahi Aliyu, the president of the NCM, remarked that, contrary to common assumption, Nigeria’s northern region is the country’s economic heart.\nHe said that Northern Nigerians discovered and constructed the oil and refineries that can now be found in other parts of the country.\nHe urged the federal government to establish a Northern Development Ministry, which would be funded in the same way as the Niger Delta Development Commission (NDDC).\nAnd nobody can address us as parasites, we are the economic heart of Nigeria.\nThe oil that is so being busted on today were discovered, harnessed, and the refineries were constructed with Northern Nigerian sweat, with the Northern Nigerian money with the Northern Nigerian economy."
  },
  {
    "headline": "29 bandits killed in Benue, Niger gunfire, NAF shells terrorists, neutralise scores in Borno",
    "summarized_story": "Fourteen bandits were Sunday morning gunned down during an attack on Police Station in Katsina-Ala, Benue state.\nShe said: “It is no longer news that series of operations are going on in Kastina-Ala Local Government Area of Benue State.\nNAF shells terroristsAlso in yet another victory over the criminal elements, the fighter aircraft of the Nigerian Air Force (NAF) Sunday eliminated scores of ISWAP-Boko Haram terrorists, including their commanders in Lamboa in Kaga local government area of Borno state.\nBut the terrorists were swiftly engaged by ground and air troops, who foiled their missions after the NAF reconnaissance platform had earlier hovered over the location before the airstrikes.\n“Currently, the ground troops of the Nigerian Army and our air elements are mopping up the area and assessing the situation."
  },
  {
    "headline": "Kebbi shuts schools after Birnin Yauri kidnapping",
    "summarized_story": "Kebbi state government has indefinitely shut down seven schools in the wake of the armed attack of Federal Government College, Birnin Yauri Thursday, the Nigerian Union of Teachers has confirmed.\nThe schools are located on the frontlines of the areas prone to bandit attacks.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "FGC Yauri abduction: Why Kebbi chose not to negotiate with bandits",
    "summarized_story": "Four days after the abduction of some unspecified number of students of Federal Government College (FGC), Birnin Yauri, Kebbi state, the state government has refused to negotiate with the bandits, a decision that appears a departure from the past.\nWhile seven were rescued Friday, 4 regained their freedom Sunday courtesy of the troops, other security agencies and vigilantes.\nOur security agents deserve a lot of commendation in the handling of this.\n“Give it to them, the security agents are humans and not spirits, so they were overpowered.\nBut the good thing is that they (security agents) didn’t stop at that."
  },
  {
    "headline": "CSO petitions EFCC, bank for disobeying court order -NigPilot",
    "summarized_story": "Civil Society Organizations in Defence of Justice has expressed disappointment against the continued disobedience of court order by the Economic and Financial Crimes Commission EFCC and the first generation bank.\n“In 2013, 10 staffs who initially subscribed to the purchase of the 2.5 equity shares had their jobs terminated from the employment of Indorama Eleme Petrochemicals.\n“The judgement affirmed the laid off staffs as the authentic owners of the shares.\n“This act continued until Justice Taiwo .O.Taiwo of the Federal High Court in Suit FHC/ABJ/SC/1222/2020 granted an Order stopping the EFCC from arresting, inviting, detaining and prosecuting or inquiring into the acquisition of shares of Indorama Petrochemicals.\nOther demands includes that First Bank of Nigeria, without further delay should honour the order of the court and grant access to the funds in its custody."
  },
  {
    "headline": "2021 UTME: Education Minister commends officials for best practices -NigPilot",
    "summarized_story": "Minister of State for Education, Dr. Chukwuemeka Nwajiuba, has expressed satisfaction with the conduct of the Joint Admission and Matriculation Board, JAMB , officials for displaying what he described as best standards in the 2021 Unified Tertiary Matriculation Examination, UTME.\nThe minister gave the commendation during his inspection visit to some Computer Based Test, CBT, centers in Lekki, Lagos State, yesterday.\nDr. Nwajiuba noted that his visit was to have an on-the-spot assessment on the conduct of the examination and also to ascertain how the candidates are coping with the CBT examination which he said, conforms with the international best practices on Information Communication Technology.\nHe was accompanied by Senator Frank Ibezim, (Imo North), and other members of the Senate Committee on Basic Education."
  },
  {
    "headline": "NAF working steadily in right direction -NigPilot",
    "summarized_story": "When the Chief of the Air Staff, Air Marshal Isiaka Oladayo Amao hinted of a new and renewed synergy in the Nigerian military setup, most of us doubted its workability.\nA keen observer will note that in the past the different arms of the military seem to be working to restore peace without collaboration.\nJust last week, the Nigerian Army troops in conjunction with elements of the Nigerian Air Force rescued some of the abducted teachers and students of Federal Government College, Birnin Yauri.\nThis is not to mention numerous positive results being recorded across the country, with NAF playing a key role.\nBefore him, the Kano State Governor, Abdullahi Ganduje came calling too and lauded NAF for it’s role in fighting crime in the state."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "Senator Blames Poor Security Arrangement For Kebbi School Abduction",
    "summarized_story": "﻿The Senator Representing Kebbi North, Yahaya Abdullahi, has blamed what he describes as a poor security arrangement in the country for the Kebbi School abduction.\n“If there were enough men on the ground like about 100 well-armed policemen, this kind of thing would not be happening”.\n“These things have their roots in the very serious security architecture that we inherited over a long period of time.We have to look at these issues from a historical perspective,” he added.\nRead Also: Kebbi School Abduction: Troops Rescue Another Teacher, Three StudentsSenator Abdullahi, however, noted that while the issue did not start with the All Progressives Congress (APC), hopefully, it will end with the party.\nThe incident is the latest in a series of increasing school abductions across the country."
  },
  {
    "headline": "President Buhari Initiating Dialogue With South-East Leaders – Ngige",
    "summarized_story": "﻿President Muhammadu Buhari has affirmed that dialogue is the way to go to resolve the security situation in the south-east.\nThis is according to the Minister of Labour and Employment, Senator Chris Ngige, after a meeting with President Muhammadu Buhari on Sunday, alongside the President’s Chief Of Staff, Prof. Ibrahim Gambari.\nAddressing state house correspondents after the meeting, Senator Ngige said the President has also enabled series of dialogues to be held with leaders in the region.\nMeanwhile, members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nIn a bid to tackle the security challenges and restore peace in the region, the governors went beyond their political differences and met on Saturday in Enugu State."
  },
  {
    "headline": "Kebbi School Abduction: Troops Rescue Another Teacher, Three Students",
    "summarized_story": "A statement signed on Sunday by the Director Army Public Relations, Brigadier General Onyema Nwachukwu, disclosed that one teacher and three students were rescued on Saturday at Makuku in the ongoing search and rescue operations.\nAccording to the statement, the troops also killed one bandit, recovered nine motorcycles and four phones from the fleeing bandits.\nTwo teachers and five students had been rescued on Friday by the gallant troops in a coordinated firefight with the kidnappers.\nBandits had attacked the school in the early hours of Thursday, whisking away a yet to be confirmed number of students and teachers.\n“In the early hours of this morning, we have come across the kidnappers."
  },
  {
    "headline": "14 Killed As Bandits Attack Police Station In Benue",
    "summarized_story": "Police authorities in Benue State say 14 bandits were killed following an attempted attack on a police station on Sunday morning.\nA spokesperson for Benue police, Catherine Anene, said in a statement that the gunmen numbering about 50 launched an attack in early hours of Sunday on a police station at Katsina-Ala town of the state, in a bid to free some suspected bandits who were arrested by police on Saturday and detained in the station.\nREAD ALSO: Law Enforcement Officer, 6 Others Arrested For Dealing In DrugsAnene said, “Operatives at the police division, who were already on alert, engaged the attackers in a fierce gun battle,” adding that 14 of the gunmen were killed at the end of the gun duel while others escaped with bullet wounds.\nAccording to her, operatives of the force are on the trail of the fleeing bandits and urged local residents to assist the police with useful information that would lead to arrests.\nIn recent times, bandits have been terrorizing parts of Nigeria, especially the Northeast and Northcentral region, with Benue being one of the worst-hit states."
  },
  {
    "headline": "Kaduna Security: Bandits Kill Village Head In Sanga LGA",
    "summarized_story": "The village head of Dogon Daji community in Sanga Local Government Area of Kaduna State, Mallam Anja, has been shot dead by bandits.\nThe bandits were said to have raided the residence of the village head and shot him at close range, after which he died on the spot.\nConfirming the incident, the state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said investigation into the incident is ongoing to unravel the perpetrators of the heinous act.\nRead Also: President Buhari Initiating Dialogue With South-East Leaders – NgigeMeanwhile, Governor Nasir El-Rufai has expressed sadness over the death of the village head and prayed for the repose of his soul.\nThe governor also sent his condolences to the family of the deceased, and the entire community of Dogon Daji over the shocking and brutal killing."
  },
  {
    "headline": "Birnin Yauri School Abduction: Nigeria Army Rescue More Students",
    "summarized_story": "Troops of the Nigerian Army operating under the Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the Federal Government College Birnin Yawuri.\nOne teacher and three students were rescued at Makuku, in the ongoing search and rescue operations.\nThe troops also killed one bandit and recovered nine motorcycles and four mobile phone from the fleeing bandits.\nA statement signed by the Director Army Public relations Brigadier General Onyema Nwachukwu says additional troops have also been deployed to dominate the forest and deny the bandits freedom of action.\nRecall that two teachers and five students were earlier on Friday 18 June 2021 rescued by the gallant troops in a coordinated fire fight with the kidnappers."
  },
  {
    "headline": "Wife of late Adeseun Ogundoyin presents gifts to over 500 widows in Ibarapa",
    "summarized_story": "Though , I take solace in the fact that late Chief Adeseun Oguntona Ayisa Ogundoyin lived a fulfilled life and he is resting in the bosom of our Lord.\nMy late husband was an easy going and accessible person who was ever ready to extend hands of love and fellowship to the people.\n” Chief Tina Ogundoyin saidThe wife, who is the Iyaloja of Ibarapaland assured the people that the family of Late Chief Ogundoyin will always make themselves available for the peace and development of the entire zone.\nThe two Clerics described late Chief Adeseun Ogundoyin as a beacon of hope for the people during his sojourn on the mother earth.\nAdvertisementThe 30years remembrance programs also featured a visit to the tomb of Late Chief Adeseun Ogundoyin at Estate by his Children and family members including the Speaker, Oyo State House of Assembly, Hon Adebo Ogundoyin, his other siblings Adesoji, Adetoye and Aderemi Ogundoyin."
  },
  {
    "headline": "Oyo Speaker Adebo presents gifts to widows, physically challenged in memory of Father Adeseun Ogundoyin",
    "summarized_story": "The late Philanthropist, Business Mogul, Community and Political Leader, Chief Adeseun Oguntona Ayisa Ogundoyin, the father of the Oyo State Speaker, who died 30 years ago, was honored by prominent indigenes of Eruwa and Lanlate in the Ibarapa East Local Government.\nIn his Constituency, the Speaker, Hon Adebo Ogundoyin, displayed and emulated his late father’s good nature and gesture by donating food and clothing to over a thousand widows, poor, and individuals with special needs.\nAccording to Hon Ogundoyin, the Late Adeseun Ogundoyin had great love for the people of Eruwa, Lanlate and indeed Ibarapaland, and he lived his entire life to serve the people.\nOver one thousand widows, indigent and people with special needs were presented with foodstuffs and clothes at the 30years remembrance programme.\nOther siblings of the Speaker, Adesoji, Adetoye and Aderemi Ogundoyin attended the remembrance programme."
  },
  {
    "headline": "Euro 2020: Switzerland Beat Turkey 3-1 to Keep Round of 16 Hopes Alive",
    "summarized_story": "Xherdan Shaqiri scored two superb goals as Switzerland secured third place in Group A at Euro 2020 with a 3-1 win over Turkey, but they now face an anxious wait to see if they will reach the last 16.\nTurkey, who finished fourth with three defeats, were tipped pre-tournament as dark horses, but will head home after a dismal effort in the group stage.\nTurkey had their chances, but Swiss keeper Yann Sommer made a string of superb first-half saves as they searched for their first goal of the tournament.\nWith Shaqiri withdrawn, Granit Xhaka hit a post with a free kick as Switzerland continued to chase the goals that might have enabled them to take second spot, but to no avail.\nFor Turkey it was a dispiriting end to the as their talent-filled squad proved toothless in attack, in stark contrast to an effective Swiss outfit that may just live to fight another day."
  },
  {
    "headline": "Italy Defeat 10-man Wales to Complete Perfect Euro 2020 Group Form",
    "summarized_story": "Italy continued their perfect run in the European Championship with a 1-0 win against 10-man Wales at the Stadio Olimpico on Sunday.\n“We are happy, we are happy,” Italy manager Roberto Mancini said after the game.\nWe changed eight, but played a very good game.\n“The sending off changed the course of the game,” Wales coach Rob Page said.\nDespite the loss, Wales join Italy as the two teams to progress from the group."
  },
  {
    "headline": "Nigeria: NADECO Calls For Election Cancellation, Demands Return to Independence Constitution",
    "summarized_story": "Nigeria’s pro-democracy group, National Democratic Coalition (NADECO) has called for the cancellation of further elections in the country under the 1999 Constitution.\nThe group said democratic elections in Nigeria should only be considered after a return to the negotiated 1960 and 1963 Federal Constitutions to which citizens subscribed at independence and when the country became a Republic.\nNADECO in an open letter to Nigeria’s President Muhammadu Buhari accused the country’s leader of dealing with the Fulanis specially which has led to various discomfort experienced by regional groups.\n“Perhaps, better put, NADECO should be wondering whether because the President is the Patron of the Fulani Herdsmen and Cattle Traders, (Miyetti Allah) land owners’ rights must be suspended in awe of such trespassers!\nBy Abel Ejikeme"
  },
  {
    "headline": "Finally, Emirates Concedes as Nigerians Can Now Travel Directly to Dubai",
    "summarized_story": "Emirates Airlines will resume flights to Nigeria from June 23, five months after it banned outbound flights from Abuja and Lagos.\nBesides the new condition for Nigerian travellers, UAE has new regulations for passengers travelling from South Africa and India to Dubai.\n“Passengers must present a negative test result for a PCR test taken within 48 hours before departure; UAE citizens are exempted.\nAll passengers must undergo a PCR test on arrival at Dubai airport.\nWe travel agents also paid a huge price because if Emirates flights were operating, we would have made money; we wouldn’t have been at the state we are now financially."
  },
  {
    "headline": "Buhari Canvasses Stronger Pressure on Mali to Return to Civil Rule",
    "summarized_story": "President Muhammadu Buhari has called on West African leaders to exert more pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nMali was recently suspended from the regional bloc due to a military coup in the country.\nPressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, Buhari faulted the recent United Nations resolution to expel all foreign fighters in Libya without first ensuring that they were disarmed.\nThis positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens."
  }
]