[
  {
    "headline": "Climate protesters shut down Shell annual meeting in UK",
    "summarized_story": "Like Nigeria, several climate activists, on Tuesday, stormed an ongoing Annual General Meeting of the British Oil Company, Shell, to protest oil exploration by the company.\nThey were asking that Shell should stop oil and gas extraction in Nigeria, and urged investors to stop funding Shell’s operations, owing to the environmental damage that the company’s operations were allegedly causing to the water, land, and human resources in Nigeria.\nThey equally called for a limit of global warming to 1.5 degrees Celsius pre-industrial level, and demanded, amongst others, an end to carbon emission.\nA shareholder was seen shouting at the protesters, saying “out!\nIt was also gathered that the police arrived at the meeting, but watched as the protests, which lasted more than an hour, continued."
  },
  {
    "headline": "Northern groups threaten retaliation over kinsmen killing in South-East",
    "summarized_story": "The Coalition of Northern Groups on Tuesday promised to retaliate against the alleged killing of its kinsmen in the South-East geo-political zone, the development it claimed, had been greeted with the conspiracy of silence.\nThe Spokesperson of CNG, Abdul-Azeez Suleiman, issued the threats in a statement which, according to him, was “in response to the incessant killing of Northerners in South-East”.\n“We are particularly disturbed by the reports of the brutal murder of a mother and her four children for the only sin of being Northerners.\nIt is also a situation that feeds on the docility of the affrighted section of those who pose as Northern leaders today.\nAs the representatives of various interest groups from Northern Nigeria, the CNG today declares enough is enough."
  },
  {
    "headline": "Police confirm release of cleric, son 3 days after kidnap",
    "summarized_story": "The Police in Ondo State on Tuesday confirmed the release of a cleric, Venerable Olu Obanla and his son, who were kidnapped along the Ifon-Okeluse Road in Ose Local Government Area of Ondo State on Saturday.\nSP Funmilayo Odunlami, the Police Public Relations Officer (PPRO) for the Command in Ondo State, confirmed the release of the cleric and his son to the News Agency of Nigeria (NAN).\nBut I can confirm to you that the victims had been released yesterday (Monday) around 12.30 p.m. somewhere in Edo , and they have been reunited with their family.\nREAD ALSO:“But I cannot confirm to you if the family paid any ransom or not before they were released,” she said.\nMeanwhile, the bandits had earlier demanded a N10 million ransom for the release of the victims, but the family were unable to raise the amount."
  },
  {
    "headline": "Kidnapped Anglican Cleric, son, regain freedom in Ondo",
    "summarized_story": "— Rejected N1m, later accepted by abductorsDayo Johnson AkureKidnapped Anglican clergy in Ondo State, Venerable Olu Obanla and his son have regained their freedom after the payment of N1m ransom to their abductors.\nFamily source confided in Vanguard that the victims were released on Monday at about 1230pm.\nRecall that they were abducted along Ifon-Okeluse Road, in Ose Local Government Area of Ondo state, last weekend.\nThey were on their way to Okeluse in Ondo State, when ambushed and marched to the forest by the bandits.\nFew hours after their abduction, the kidnappers contacted the family and demanded a ransom of N10m for the father and son."
  },
  {
    "headline": "ANEEJ decries poor handling of recovered Ibori loot",
    "summarized_story": "Speaking with Vanguard on the issue, the Executive Director, ANEEJ, Rev David Ugolor, asserted that the manner of handling the recovered Ibori loot was not in best interest of Nigerians, particularly people of Delta State who own the money and supposed to receive the loot.\nUgolor said the UK and Nigerian Governments are to be blamed for their action.\n“The UK and Nigerian Governments are setting a bad precedence and a setback for the anti-corruption campaign” he pointed.\n“Delta State is a minority State, the Government there is a PDP government, and all these are factors that played out”, he pointed.\nHowever, he also accused the Governor of Delta State, Senator Ifeanyi Okowa, of not being proactive."
  },
  {
    "headline": "Mixed reactions trail FG’s plan to impose tax on phone calls",
    "summarized_story": "The Nigerian government has proposed a new tax on phone calls in its efforts to meet the needs of citizens considered to be most vulnerable to health challenges.\nThe telecom tax is the equivalent of a minimum of one kobo per second for phone calls to boost the funds required to finance free healthcare for the vulnerable group in Nigeria.\nThe Fiscal Policy Partner and Africa Tax Leader at PricewaterhouseCoopers, Taiwo Oyedele, said, “S.26 of this new law imposes a telecommunications tax of not less than 1 kobo per second on GSM calls.\n“It’s only one kobo added, that is from 11 kobo to 12 kobo per second or from 10 to 11.\n“Like every laudable initiative, there is always an existent funding gap and the need for more resources to make health services more accessible and affordable to every Nigerian,” she said."
  },
  {
    "headline": "2023: In Yobe, Emir of Damaturu, Mai Mala Buni drum support for Amaechi",
    "summarized_story": "The Emir of Damaturu, HRH Alhaji Dr. Shehu Hashimi, the Ibn Elkanemi the 2nd, has called on Nigerians to support the Presidential ambition of former Transportation Minister, Rt Hon.\nThe Emir made the call while receiving the Presidential aspirant at his Palace in Damaturu, the Yobe State Capital, Monday.\n“We will support you in prayer, we will support you in all aspects that we are able to, to see that you excel.\nDuring a courtesy call on the Yobe State Governor, at Government House Damaturu, Governor Mai Mala Buni said, with Amaechi’s pedigree, it would only be proper for Nigerians to support him to succeed President Muhammadu Buhari.\nWe, here in Yobe appreciate you and we are always in support of you, Governor Buni said."
  },
  {
    "headline": "IPOB distances ESN from beheading of Anambra lawmaker, reveals those responsible",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Tuesday, distanced its members from the beheading of a member of the Anambra State House of Assembly, Okechukwu Okoye.\nIPOB said Okoye was beheaded by fifth columnists who are bent on destabilising its struggle in the southeast.\nSpokesman of IPOB, Emma Powerful, described Okoye’s murder as an abomination which has nothing to do with the Eastern Security Network, ESN.\nA statement by Powerful reads partly: “We the global family of the Indigenous People of Biafra (IPOB) under our great leader Mazi Nnamdi KANU strongly condemn the abominable beheading of Hon.\nOkechukwu Okoye who was abducted a few days ago in his area."
  },
  {
    "headline": "Steer clear of partisan politics – Kogi govt warns civil servants",
    "summarized_story": "The Kogi State Government has warned civil servants in the state to steer clear of partisan politics.\nOdiyo charged all public or civil servants to stay completely out of partisan politics in the interest of the state.\nThe Head of Service quoted the NLC Chairman to have said “the committee should make sure that all workers of this state are brought into the fold of Labour Party.”Odiyo, in her response to the statement, directed all civil or public servants to be aware and be guided by the provisions of Public Service Rule No: PSRS-030422 and 030423 which forbid civil or public servants’ involvement in partisan politics.\nAccording to her, the above rules only allow civil servants to register and cast their votes during election time and not to join any political party campaign in support for or against any political party.\nShe asserted that all workers in the state should be properly guided against being misled by any group or political party."
  },
  {
    "headline": "BREAKING: EFCC storms Okorocha’s Abuja residence to arrest him",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission, EFCC, on Tuesday stormed the residence of former Imo State Governor, Rochas Okorocha, Channels TV reports.\nThe anti-graft agency operatives stormed the residence of the former governor in the Maitama area of the Federal Capital Territory (FCT) to arrest him.\nAccording to Channels, the EFCC operatives were seen in a video operating within the premises of the former governor.\nThey insisted that Okorocha, who is seeking to contest the presidential election on the platform of the All Progressives Congress (APC), should submit himself for arrest or honour a long-standing invitation to their office.\nMore to follow…"
  },
  {
    "headline": "Kaduna-Abuja train attack: Shehu Sani reacts to bandits’ 7-day ultimatum to kill abducted passengers",
    "summarized_story": "Former lawmaker, Senator Shehu Sani, has called on the Federal Government of Nigeria to take the threat made by bandits who abducted the Abuja-Kaduna train passengers seriously.\nSani made the plea in a tweet via his Twitter handle on Tuesday.\nHe tweeted: “The threat made by the terrorists who abducted the Abuja-Kaduna train passengers that they will start “killing them in 7 days’ time” should be taken seriously.\nMalam Tukur Mamu and Dan Iyan Fika, the spokesman of Sheikh Ahmad Gumi, were spoken to on the phone by the leaders of the terrorists.\nThe terrorists claimed that the Federal Government suspended the resumption of the train service because of their threats in the audio of the conversations between Malam Tukur Mamu and the leaders of the terrorists that executed the Abuja-Kaduna train attack."
  },
  {
    "headline": "Northern coalition warns against attacks on northerners, destruction of properties in S/East",
    "summarized_story": "The Coalition of Northern Groups (CNG) has bemoaned what it noted as “hate campaigns and propaganda” being conducted by certain interest groups in the South-East to carry out unprovoked evictions, attacks, killings, destructions of properties and other forms of violations against northerners in various parts of the region.\nAccording to the statement, “We have watched and studied these events carefully and with considerable restraint and maturity, to the point of condoning and accommodating several unreasonable and unacceptable actions that have been perpetrated against Nigerians collectively, and northerners in particular.\nIt stated that the North’s reticence in speaking out or taking action is not born of fear or ignorance of how to respond in kind, saying that those who tempt them should know that the North is no longer going to turn the other cheek.\nCNG warned media operators of an imminent boycott of patronage all over the North unless they change to being more restrained and balanced in their reporting of all situations in the country, particularly when matters coming from or affecting northerners are reported or commented on.\n“We caution them to desist from and to eschew the slanted reporting of events with greater bias against a particular religious and ethnic group as is witnessed in the reporting of security situations recently,” the statement stated."
  },
  {
    "headline": "BREAKING: CBN increases interest rate to 13.5%",
    "summarized_story": "The Central Bank of Nigeria (CBN) has increased interest rate to 13.5 per cent for the first time in two and half years.\nAddressing the reporters after the Monetary Policy Committee (MPC) meeting in Abuja, CBN Governor, Godwin Emefiele, attributed the increase to global developments.\nIncreasing the interest rate, he said, is to tame inflation support growth.\nAccording to Emefiele, the MPC is suspicious “there might be an aggressive accretion of inflation”, to check this, the MPC he said quickly moved to check the impending inflation by increasing Monetary Policy Rate( MPR) by 150 basis points.”Details Shortly…"
  },
  {
    "headline": "WHO confirms 131 monkeypox cases outside Africa, says outbreak ‘containable’",
    "summarized_story": "The World Health Organisation (WHO) on Tuesday said there have been 131 confirmed monkeypox cases and 106 further suspected cases since the first was reported on May 7, outside the countries where it usually spreads.\nMonkeypox is a usually mild viral infection that is endemic in parts of west and central Africa.\nIt spreads chiefly through close contact, and until the recent outbreak has only rarely been seen in other parts of the world.\nThe majority of the recent cases have been reported in Europe.\nThe West African strain of monkeypox, which is the one identified in the current outbreak, has a mortality rate of around 1 per cent."
  },
  {
    "headline": "APC reaffirms Sen Otu as preferred Gov flag bearer in Cross River",
    "summarized_story": "The ruling All Progressives Congress (APC) in Cross River has reiterated the commitment of its leadership, including Governor Ben Ayade to see Sen. Bassey Otu emerge as its consensus gubernatorial candidate at the primary on Thursday.\nOtu emerged as the preferred and anointed candidate at a meeting of all 17 governorship aspirants in Abuja on May 10.\nOwan-Enoh declared support for Sen. Otu last week, leaving only Agara as the only aspirant who may contest the primary against Otu.\nRead Also: APC approves revised timetable for 2023 primaryA statement by APC Publicity Secretary, Erasmus Ekpang on Tuesday, reads: “Sen.\nPrince Bassey Otu, the party will continue to stand firm on that position, which aligns with the Governor’s declaration on back to South which we consider fair, just and equitable.”"
  },
  {
    "headline": "I will not defect from PDP, says ex-chairman",
    "summarized_story": "A former chairman of the Peoples Democratic Party (PDP) in Ondo State, Clement Faboyede, has said that he would not defect from the party despite failing to secure its ticket to represent Ondo Central senatorial district.\nFaboyede came third at the PDP primary while Adedipe Ifedayo, secured 82 votes to win the primary.\nSpeaking to journalists in Akure, Faboyede debunked viral statements disparaging former Governor Olusegun Mimiko and other PDP leaders over outcome of the party primary.\nFaboyede, who declared the PDP primary as free, fair, said he accepted results of the primary and was ready to work with Ifedayo to secure victory at the general elections.\nIf PDP picks anybody tomorrow, on PDP I stand, I will still perform and Ifedore will still deliver."
  },
  {
    "headline": "Terrorists threaten to start killing abducted Abuja-Kaduna train passengers",
    "summarized_story": "Terrorists who kidnapped passengers on board the Abuja-Kaduna train have asked the government to release their children allegedly kept in a Yola detention facility.\nThey threatened to start killing the passengers in captivity if their demands were not met within seven days.\nLeaders of the terrorists spoke via phone calls to Malam Tukur Mamu, the spokesman of Sheikh Ahmad Gumi.\n“For any continued discussion on the release of these passengers and a safe resumption of the train service, our children must be released unconditionally.\nI believe an opportunity has been created for us to explore to save the lives of those innocent victims."
  },
  {
    "headline": "APC Primary : Orji Kalu to return unopposed",
    "summarized_story": "Chief whip of the Senate , Dr Orji Uzor Kalu will emerge as the senatorial candidates of the All Progressives Congress in the state at the end of Friday’s primaries.\nDo not miss the Vital Information, it goes off in 2 days!\nKalu’s earlier withdrawal from presidential race and support to Lawan changed the dynamics of the nation’s politics as it became the major political discussion in the country.\nDo business with top USA companies like Amazon, Tesla, Facebook, IBM, Netflix, Zoom, etc.\nKalu has also extended all his political machineries to Lawan with an uncommon hope and confidence that the Senate President will emerge winner at the presidential convention slated for Sunday ."
  },
  {
    "headline": "LG financial autonomy: FG, NFIU floor governors",
    "summarized_story": "The guidelines limited the cumulative amount that could be withdrawn from a local government account to not more than N500,000 daily.\nChief Executive Officer ( CEO), Centre for the Promotion of Private Enterprises (CPPE), Muda Yusuf said it would enhance the capacity of the local governments to discharge their statutory responsibilities.\nHe said for a long time, many local governments have failed in delivering their services in managing refuse, primary education, markets and quite a number of functions allotted to them in the constitution.\n“Local governments have been completely subservient to the state government, with the court ruling, I think it is a good development.\n“In terms of accountability, the local governments are worse of because of the quality of people that are there."
  },
  {
    "headline": "Despite tough market, NSIA’s net assets grow to N919.7 bn in 2021",
    "summarized_story": "The Nigeria Sovereign Investment Authority (NSIA) has recorded a positive returns with net assets growth to the tune of N919.73 billion in 2021, as against N772.75 billion posted in 2020, representing 19 per cent increase.\nAlso, the Authority recorded continuous earnings for the ninth year despite risks across markets last years.\nHe also revealed that the authority recorded total operating income – Core income of N100.8 billion in 2021, exclusive of forex gains.\nOrji said NSIA expects to commission, mid-to-late 2022, Panda Agric, “an investee company under the NSIA-UFF US$200m Agriculture Fund set up in 2016.\nThe Authority is in the process of developing an Active Pharmaceutical Ingredient Manufacturing Plant (API) Company in Nigeria."
  },
  {
    "headline": "Abia speaker wins PDP Reps ticket",
    "summarized_story": "From Okey Sampson, UmuahiaSpeaker of Abia State House of Assembly, Chinedum Orji, has won the House of Representatives ticket for Ikwuano/Umuahia North/Umuahia South federal constituency.\nThe other aspirants and their votes wre Chidebere Nwachukwu and John Nwadinobi with two votes each while John Ndubuisi and Kelechi Onuzuruike got one vote each.\nAccording to Mezie Nwaubani, chairman of the election committee, and Sopuru Bekee, 99 delegates took part in the exercise.\nHe appealed to all concerned not to bear grudges against anyone but that everyone should come together and join hands with him at the general election to move the federal constituency forward.\n“The challenge of moving our federal constituency forward is enormous and it requires all hands to be on deck and work together with me to achieve great things for our people through every available legislative instrument,” he said."
  },
  {
    "headline": "ASUU/FG Face-off: NANS threatens shutdown of major airports",
    "summarized_story": "The National Association of Nigerian Students (NANS) has threatened to shutdown major airports if the face-off between the Academic Staff Union of Universities (ASUU) and the Federal Government continued.\nHe said it was time both parties came together to resolve the issues that led to the strike as students were at the receiving end.\n“We are planning to block government organisations that generate money for them if the ASUU issue is not resolved.\nWe have been protesting on this issue by occupying major roads in the South West but we believe if we ground airports, the government will do something about the strike,” he said.\nMeanwhile, elder statesman, Edwin Clark, said there was need for Minister of Education Adamu Adamu to take over negotiations regarding ASUU strike."
  },
  {
    "headline": "Despite Global Headwinds, NSIA Grows Net Asset to N920bn in 2021",
    "summarized_story": "According to him, it posted core income of N100.8 billion in 2021, down eight per cent compared to N109.6 billion in 2020.\nThe core income excluded forex gains of N45.8 billion in 2021 and N51.2 billion in 2020.\nHe said: “Reactions to the raging global inflation may lead to recessions in certain economies as central banks have announced varying measures of rate hikes and halt to balance sheet expansion.\nThe World Bank, CBN, and Fitch have projected the Nigerian economy will grow by 2.5 per cent, 3.1 per cent, and 2.8 per cent respectively.\nAlso, this issue of rising interest rates as we curtail inflation I think will continue to affect, emerging market debt, particularly the Eurobonds."
  },
  {
    "headline": "It’s a Four Horse Race",
    "summarized_story": "But with the governor recently openly declaring support for Wike, votes here would be shared between the Rivers State governor and Obi, although Wike stands a better chance with Ikpeazu.\nSo Ogun will be shared between Saraki, Atiku and WikeOndo StateOndo is giving a sizeable number of its votes to Saraki.\nSokoto is, however, marked a waste of votes as Tambuwal is believed not to stand any chance in the race.\nAtiku mainly with some votes to othersYobe StateYobe State is waiting to share its votes between Atiku and Hayatu-Deen.\nIt’s a four horse race given, however given that Hayatu-Deen is new in the race, he may not make much impact."
  },
  {
    "headline": "Adamu: Ekiti My First Test, I Will Not Fail to Deliver",
    "summarized_story": "Adamu stated this yesterday in Abuja at the inauguration of the Ekiti State Gubernatorial Campaign Council.\nAdamu stated, “With this inauguration today, we are giving a marching order to the campaign council and our great people of Ekiti State on the platform of our great party, the APC.\n“Ekiti is the first election that we will be having in this dispensation of APC.\nSo we are on a bond like him to see that he has soft landing and that is to deliver this party to victory and Ekiti State is the first test.\nArgungu said, “Our confidence is further reinforced by the legacy of service and delivery of quality projects the outgoing governor of Ekiti State has imprinted on the process and environment of governance in the state."
  },
  {
    "headline": "Buhari Meets Families of Kano Explosion Victims, Describes Incident as Sad, Unfortunate",
    "summarized_story": "* Says he was extremely pained by casualty recordedDeji ElumoyePresident Muhammadu Buhari Monday commiserared with the families of victims of the recent explosion in Kano and expressed his condolences and that of the nation, describing the incident as sad and unfortunate.\nI hope the injured will recover fully at the earliest possible time.”President Buhari drew parallels between Kano and his native Daura and described the palace of the emir as his own home.\nHe commended the traditional institution and the people of Kano for standing with him at all times.\nIn his speech, the emir thanked the president for the condolences and commended him for providing a fair and just leadership.\nOn his part, Governor Abdullahi Ganduje announced cash support in various sums for the families of the deceased, the injured and others whose property were partly damaged or destroyed."
  },
  {
    "headline": "Buhari Charges Security Agencies to Ensure Secure, Prosperous Nigeria",
    "summarized_story": "* Says NAF has justified govt’s investment in last seven yearsDeji ElumoyePresident Muhammadu Buhari has charged the military and security agencies to ensure a secure and prosperous Nigeria as the nation prepares for the general election in 2023.\nSpeaking in Kano Monday at a ceremonial parade to commemorate the 58th Anniversary of the Nigerian Air Force (NAF), the president tasked the security agencies to remain committed, steadfast and resolute as government forges ahead to achieving a secure, peaceful and more prosperous Nigeria.\nAccording to him, the Air Force had transformed into a formidable entity, ready to confront immediate and future challenges.\nHe said: “It gives me great pleasure to be here to felicitate with you on the Nigerian Air Force 58th Anniversary Celebration.\nThis is particularly because the Nigerian Air Force has over these 58 years transformed to a formidable and resilient air force that is positioned to effectively tackle both contemporary and future security challenges."
  },
  {
    "headline": "EXCLUSIVE: Crisis Rocks Ruling APC As Tinubu Secretly Obtains Lagos Senatorial Form For Ex-Deputy Governor After Conclusion Of Screening",
    "summarized_story": "The ruling All Progressives Congress (APC) in Lagos State has been enmeshed in a crisis after its national leader and former governor of the state, Bola Tinubu, and other stalwarts secretly obtained Lagos West senatorial nomination form for Mrs Idiat Oluranti Adebule, a former deputy governor of the state.\nSaharaReporters gathered that the form was obtained for Adebule after all senatorial aspirants had been screened.\nDocuments obtained by SaharaReporters also show that the former deputy governor wasn’t among the aspirants who bought and submitted nominations forms.\n“It’s ridiculous that former Deputy Governor of Lagos State, Dr. Idiat Oluranti Adebule has joined the race to represent Lagos West Senatorial District in the Senate in the forthcoming general elections.\n“There is no gainsaying the fact, therefore, that Dr. Adebule’s form was obtained illegally and anything built on illegality is bound to fail."
  },
  {
    "headline": "EXCLUSIVE: Crisis Rocks Ruling APC As Tinubu Secretly Obtains Lagos Senatorial Form For Ex-Deputy Governor After Conclusion Of Screening",
    "summarized_story": "The ruling All Progressives Congress (APC) in Lagos State has been enmeshed in a crisis after its national leader and former governor of the state, Bola Tinubu, and other stalwarts secretly obtained Lagos West senatorial nomination form for Mrs Idiat Oluranti Adebule, a former deputy governor of the state.\nSaharaReporters gathered that the form was obtained for Adebule after all senatorial aspirants had been screened.\nDocuments obtained by SaharaReporters also show that the former deputy governor wasn’t among the aspirants who bought and submitted nominations forms.\n“It’s ridiculous that former Deputy Governor of Lagos State, Dr. Idiat Oluranti Adebule has joined the race to represent Lagos West Senatorial District in the Senate in the forthcoming general elections.\n“There is no gainsaying the fact, therefore, that Dr. Adebule’s form was obtained illegally and anything built on illegality is bound to fail."
  },
  {
    "headline": "Killers Of Anambra Lawmaker Reportedly Vow To Kill More House Of Assembly Members",
    "summarized_story": "Suspected killers of Anambra State lawmaker, Hon.\nMeanwhile, some Anambra communities have alleged that “unknown gunmen” have set up camps in their areas.\nAccording to a message circulating on social media, the criminal elements have created a new camp in Unubi, Nnewi South Local Government Area, from where they launch attacks on indigenes.\nIt said, “The armed gang have created a new Operational Camp in the Unubi bush, a town located in Nnewi South Local government Council of Anambra State.\n“The Lexus vehicle owner quickly alighted from the car after driving it into the gutter at Ugwumba Bus stop and ran into Ezechibuike’s home, that situates around the bus stop, through which he fled."
  },
  {
    "headline": "Killers Of Anambra Lawmaker Reportedly Vow To Kill More House Of Assembly Members",
    "summarized_story": "Suspected killers of Anambra State lawmaker, Hon.\nMeanwhile, some Anambra communities have alleged that “unknown gunmen” have set up camps in their areas.\nAccording to a message circulating on social media, the criminal elements have created a new camp in Unubi, Nnewi South Local Government Area, from where they launch attacks on indigenes.\nIt said, “The armed gang have created a new Operational Camp in the Unubi bush, a town located in Nnewi South Local government Council of Anambra State.\n“The Lexus vehicle owner quickly alighted from the car after driving it into the gutter at Ugwumba Bus stop and ran into Ezechibuike’s home, that situates around the bus stop, through which he fled."
  },
  {
    "headline": "Gunmen Terrorising Anambra Are Not Political Agitators But Criminals — Governor Soludo",
    "summarized_story": "Governor Charles Soludo of Anambra State has said that the scandalous activities of the militants in the South-East, popularly known as “unknown gunmen”, are contrary to any form of political agitations.\nAnambra is one of the states which have experienced some of the worst attacks in the region.\nThe militants usually target security agencies, government officials, and infrastructural facilities in the region.\nThe attacks by the gunmen increased in the state shortly after Soludo’s inauguration in March 2022 and the announcement of an end to the sit-at-home order in the state.\nWhile the Federal Government blamed the Indigenous People of Biafra (IPOB), the group has repeatedly denied being responsible."
  },
  {
    "headline": "BREAKING: CBN raises benchmark interest rate to 13%",
    "summarized_story": "The policy-setting committee of the Central Bank of Nigeria (CBN) has voted to raise the monetary policy rate (MPR), which measures interest rate, to 13 per cent to tame rising inflation.\nThe monetary policy rate (MPR) is the baseline interest rate in an economy, every other interest rate used within an economy is built on it.\nAddressing journalists on Tuesday after the committee’s meeting at the CBN headquarters in Abuja, Godwin Emefiele, governor of the apex bank, said six out of eleven committee members voted to raise the key rate.\nEmefiele said the committee also voted to retain the asymmetric corridor at +100 and -700 basis points around the MPR and liquidity ratio at 30 per cent.\nAdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: CBN raises benchmark interest rate to 13%",
    "summarized_story": "The policy-setting committee of the Central Bank of Nigeria (CBN) has voted to raise the monetary policy rate (MPR), which measures interest rate, to 13 per cent to tame rising inflation.\nThe monetary policy rate (MPR) is the baseline interest rate in an economy, every other interest rate used within an economy is built on it.\nAddressing journalists on Tuesday after the committee’s meeting at the CBN headquarters in Abuja, Godwin Emefiele, governor of the apex bank, said six out of eleven committee members voted to raise the key rate.\nEmefiele said the committee also voted to retain the asymmetric corridor at +100 and -700 basis points around the MPR and liquidity ratio at 30 per cent.\nAdvertisementMore to follow…"
  },
  {
    "headline": "Abia, Kaduna, Akwa Ibom… PDP guber primaries battleground states",
    "summarized_story": "Ahead of the 2023 general election, the Peoples Democratic Party (PDP) has vowed to win 25 states, up from the 13 states it presently controls.\nAhead of the eagerly anticipated exercise, TheCable highlights the contenders in four of the battleground states — Kaduna, Abia, Akwa Ibom and Enugu.\nAKWA IBOMAdvertisementAkwa Ibom will witness one of the most heated PDP governorship primaries on Wednesday.\nOther PDP governorship hopefuls are Akan Okon, a former commissioner for economic development; James Iniama, a renowned estate surveyor; and David Okpon, a businessman.\nThe major contenders in the race are Enyinnaya Abaribe, senate minority leader; Ude Oko Chukwu, Abia deputy governor, and Emma Nwaka, former Abia state PDP chairman."
  },
  {
    "headline": "Abia, Kaduna, Akwa Ibom… PDP guber primaries battleground states",
    "summarized_story": "Ahead of the 2023 general election, the Peoples Democratic Party (PDP) has vowed to win 25 states, up from the 13 states it presently controls.\nAhead of the eagerly anticipated exercise, TheCable highlights the contenders in four of the battleground states — Kaduna, Abia, Akwa Ibom and Enugu.\nAKWA IBOMAdvertisementAkwa Ibom will witness one of the most heated PDP governorship primaries on Wednesday.\nOther PDP governorship hopefuls are Akan Okon, a former commissioner for economic development; James Iniama, a renowned estate surveyor; and David Okpon, a businessman.\nThe major contenders in the race are Enyinnaya Abaribe, senate minority leader; Ude Oko Chukwu, Abia deputy governor, and Emma Nwaka, former Abia state PDP chairman."
  },
  {
    "headline": "'Over 40 farmers killed' as insurgents invade Borno community",
    "summarized_story": "Several residents in Borno have been reportedly killed after insurgents invaded farms in Rann, Kala-Balge LGA of the state.\nA source in the community was reported to have said some of the farmers were tied up before they were killed.\nThe attack comes days after insurgents invaded the Chibok community in Borno state.\nAdvertisementOn May 3, Kautukari, a community in Chibok LGA of Borno state, was attacked by suspected fighters of the Islamic State of West Africa Province (ISWAP).\nA resident had told TheCable that the insurgents invaded the community around 6pm and started shooting randomly, resulting in the death of eight persons."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Can proptech solve Nigeria’s urbanisation crisis?",
    "summarized_story": "At the current growth rate of about 2.8%–3% a year, Nigeria’s urban population is expected to double in the next 2 decades.\nUrbanisation, especially one as rapid as Nigeria’s, comes with challenges, most notably the insufficiency of basic infrastructures.\nWith Nigeria’s proptech industry raising $2 million in investments in 2021 alone, TechCabal sought to answer these questions in a Live session.\n“At the beginning, it was a herculean task to get landlords to agree to collect monthly rent,” Olaghere explains.\nIn closing, Olaghere reiterates the importance of collaboration between the government, the proptech sector, and more importantly, the end users."
  },
  {
    "headline": "Nigeria to generate over ₦90 billion annually from new phone call tax",
    "summarized_story": "The Nigerian government has created a new tax on phone calls in the bid to fund free healthcare for Nigerian citizens who cannot afford healthcare—the vulnerable group.\nThe law defines the “vulnerable group” in society as “Children under five, pregnant women, aged, physically and mentally challenged persons, and indigent people as may be defined from time to time”.\nThe law also requires that all persons resident in Nigeria are expected to obtain health insurance.\nNigerians made 150.83 billion minutes of calls in 2020 according to a report by the Nigerian Communications Commission.\nThis translates to 9.05 trillion seconds of calls, meaning the new tax will generate at least 9.05 trillion Kobo, which converts to ₦90.49 billion ($18.09 million), annually."
  },
  {
    "headline": "How companies can shape the narrative for tech-enabled mobility in Africa",
    "summarized_story": "Since then, funding for mobility companies ($147m in 2021) have largely gone to companies on the vanguard of innovation and sustainability in Africa’s mobility space.\nWhile Africa’s mobility companies have witnessed varying fortunes, there are important factors that are currently not being addressed in the sector.\nLed by mobility giant, GIG Mobility, major players in Africa’s mobility space are gearing up to have important conversations at the first ever Africa Mobility Conference taking place on June 2, 2021 with theme: Pathways to the future of mobility in Africa.\n“Just stepping into the mobility space, I realised the players in the space are not trying to shape the narrative,” says Enahoro Okhae, newly appointed CEO of GIG mobility.\nHow to innovate for mobility in AfricaICU monitoring hubIn other parts of the world, mobility is witnessing defining moments with technology in the mobility sector, but Africa is seemingly being left behind."
  },
  {
    "headline": "Sylndr raises $12.6 million pre-seed",
    "summarized_story": "So, today I’ll talk about two different stories that I’m sure you’ll enjoy:The new phone call taxSylndr’s $12.6 million pre-seed roundTaxing phone calls to help the “Vulnerable Group”The Nigerian government is introducing a new phone call tax.\nThis amounts to a 9% tax on phone calls at call rates of around 11kobo per second.\nThis increased the country’s total high-speed internet subscriptions to 80.6 million, up from 78.1 million in February.\nSylndr’s $12.6 million pre-seed roundHow much does your ideal car cost?\nAnd yesterday, Monday, May 23, 2022, the company announced that it had raised a pre-seed round of $12.6 million."
  },
  {
    "headline": "[PODCAST] Taxing calls to give you healthcare",
    "summarized_story": "Share this article:If you’re a regular listener of the Techpoint Africa Podcast then you probably know that we discussed Autochek’s acquisition of the Moroccan cars marketplace KIFAL Autos, last week.\nInterestingly, Autochek reached out to Chimgozirim to clear things up and we decided to kick off today’s episode of the Techpoint Africa Podcast with that.\nFounder of the Blockchain Nigeria User Group (BNUG), Chimezie Chuta, believes that the regulations issued by the SEC do not address the bigger picture when it comes to cryptocurrencies.\nIf you missed the Techpoint Africa Blockchain Summit, and want to hear Ihenyen’s view on the rules, you can tune in to the podcast or just see the video here.\nWe rounded off today’s podcast with the Nigerian government’s plan to tax calls to give you healthcare."
  },
  {
    "headline": "GadgetKingsNaija Launch Nigeria’s Number one online gadget store",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:A new entrant into Nigeria’s online gadget store space, GadgetKings has launched an e-commerce platform that provides premium Gadgets like Phones, Laptops, Accessories, Gaming Consoles, and gadgets.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Binance To Host “Block and Brunch” Networking Event For Professionals In Lagos",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nThe event targets professionals who are crypto newbies and enthusiasts for an afternoon of learning and networking.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Telcos weigh strain as 5% airtime tax starts June",
    "summarized_story": "The 5 percent tax on airtime was recently added and approved in the Finance Act 2021, which took effect from January 1, 2022.\nIt is an indirect tax that is not paid by the customers directly – instead, the excise tax is imposed on the supplier or the producer, who then includes it in the product price.\nPresident Muhammadu Buhari reportedly approved the 5 percent tax on airtime in May 2022.\n“An additional 5 percent excise tax has now been considered effective for the first of June.\nTelcos such as MTN have seen their tax contribution balloon in recent years as the government increases the number of taxes and levies."
  },
  {
    "headline": "2023: PDP submits results of Edo Assembly, House of Reps primary elections to INEC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Peoples Democratic Party (PDP), on Monday, submitted the results of the Edo State House of Assembly and the House of Representatives primary elections to the Independent National Electoral Commission (INEC).\nThe Chairman of Edo PDP House of Representatives Primaries Committee, Mr. Kolawole Shittu, and his Edo State House of Assembly Committee counterpart, Mr. Agbateyiniro Isaac, along with other members of their committees submitted the results at the Edo INEC office, in Benin City.\nThe primary elections were held on Sunday, May 22, across the state and monitored by officials of INEC in the state.\nBriefing journalists shortly after the submission, Shittu said, “We are here to submit the results of the House of Representatives primary election that was held yesterday in Edo to the state chapter of INEC.\nWe want to thank the Edo PDP faithful for their support and the enabling environment that was given to us to conduct this primary election.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "2023 election: Edo PDP holds senatorial primary election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State chapter of the Peoples Democratic Party (PDP), on Monday, conducted primaries to elect candidates to fly the party’s flag at the forthcoming 2023 Senatorial elections.\nThe chairman of the five-man committee for the Edo Senatorial District Primaries, Mr. Daniel Obiora, who spoke to journalists before the election, said he led other members of the committee to the state to ensure the conduct of a peaceful, free and credible primary election.\nAddressing journalists at the party’s secretariat in Benin City, Obiora said, “We are here for the purpose of the conduct of the primary election to elect our candidate in the upcoming general election in 2023.\n“We have been duly nominated by the National Working Committee of our great party and I want to assure you that we are here with a good gift.\n“We are here to conduct free, fair and credible elections and we seek the cooperation of all our party members,” he reassured."
  },
  {
    "headline": "Obaseki pledges quality maternal healthcare, seeks better investment to end obstetric fistula – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has called for accelerated action among global stakeholders to bridge the funding gap in prevention and treatment of obstetric fistula, caused by prolonged and obstructed labour, without access to timely and quality medical treatment.\nWe are strengthening our health system and training health personnel from all medical facilities in the state to equip them with specialised knowledge to tackle neonatal deaths,” he noted.\nAccording to the United Nations, “About 800 women die from pregnancy, or childbirth-related complications around the world every day.\nFor every woman who dies of maternal related causes, it is estimated that at least 20 women experience maternal morbidity, one of the most severe forms of which is obstetric fistula.\nObstetric fistula is an abnormal opening between a woman’s genital tract and her urinary tract, or rectum caused by prolonged, obstructed labour without treatment.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Ex-speaker, Momodu emerges PDP candidate in Akoko-Edo, Estako Federal Constituencies Respectively – Nigerian Observer",
    "summarized_story": "Kabiru Adjoto has emerged as the candidate of the Peoples Democratic Party (PDP) for the Akoko-Edo Federal Constituency for the House of Representatives in the 2023 general elections.\nHon Adjoto defeated two other contestants at the PDP primary election held on Sunday at the party’s secretariat in Igarra, Akoko-Edo Local Government Area of Edo.\nThe Chairman of the Primary Election Committee appointed by the PDP National Working Committee, Mr Endurance Edughu said that due process was followed during the primary.\nAdjoto scored 28 votes to emerge winner in the House of Representatives primary.\nIn a similar vain, Hon Andrew Momodu have won the House of Representatives PDP candidate for Etsako Federal Constituency in the just concluded party’s primary held at Auchi public field."
  },
  {
    "headline": "Nigeria tech startups get tax reliefs, other incentives",
    "summarized_story": "BY EMEKA EJEREIn a bid to harness the potential of the sector, the Federal Executive Council (FEC), has approved tax reliefs and other incentives for tech startupsThe approval which was to further harness the country’s digital innovation and entrepreneurship ecosystem, followed the presentation of a memo by the Minister of Communications and Digital Economy, Prof Isa Pantami.\nIt will also help to develop innovative solutions to societal problems, and rapidly grow, as well as diversify the economy, in line with the National Digital Economy Policy and Strategy (NDEPS) for a Digital Nigeria.\nThe delegation included the Director-General of NITDA, the Executive Vice Chairman of the Nigerian Communications Commission (NCC), the Post-Master-General and the Managing Director of Galaxy Backbone Plc.\nThe visit provided a useful platform for open and interactive discussions on the ecosystem’s pertinent challenges and interventions required from the government to enable the ecosystem achieve its full potential.\nThe delegation also paid a visit to three selected tech startups, namely: Flutterwave, valued at $3 billion; Treepz, with a funding of $3.1 million and Reliance Health, with $48.3 million in funding."
  },
  {
    "headline": "Ukraine war: AfDB to fight hunger with $1.5bn",
    "summarized_story": "BY EMEKA EJERETo alleviate the impact of worsening food insecurity due to the Ukraine war, the African Development Bank (AfDB) announced on Monday that it has approved a $1.5 billion emergency programme.\nThe programme aims to help produce 38 million tonnes of food.\nThis will consist of 11 million tonnes of wheat, 18 million tonnes of maize, six million tonnes of rice and 2.5 million tonnes of soya beans.\nFertiliser prices have gone up by 300 percent and the continent faces a fertiliser shortage of two million tonnes.\n“If this deficit is not made up, food production in Africa will decline by at least 20 percent and the continent could lose over US$11 billion in food production value,” the AfDB said."
  },
  {
    "headline": "Northern youths vow reprisal attacks against killings of kinsmen by IPOB, ESN",
    "summarized_story": "Angered by the alleged killing of its kinsmen in the South-East geo-political zone, the Coalition of Northern Groups on Tuesday vowed to retaliate.\nSpokesperson of CNG, Abdul-Azeez Suleiman, who issued the threats in a statement made available to media houses, said it was “in response to the incessant killing of Northerners in South-East”.\n“We are particularly disturbed by the reports of the brutal murder of a mother and her four children for the only sin of being Northerners.\nIt is also a situation that feeds on the docility of the affrighted section of those who pose as Northern leaders today.\nAs the representatives of various interest groups from Northern Nigeria, the CNG today declares enough is enough."
  },
  {
    "headline": "BREAKING: CBN MPC raises lending rate to 13%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has raised interest rate to 13 percent.\nGodwin Emefiele, governor of the Central Bank who announced the development while addressing the press after MPC meeting on Tuesday, cited inflation as the major reason for the decision.\nMore later.."
  },
  {
    "headline": "Telecom providers kick against FG’s move to impose new tax on GSM phone calls",
    "summarized_story": "Telecom service providers in the country have kicked against the newly proposed tax on phone calls by the federal government.\nThe government had imposed a telecom tax in the equivalent of a minimum of one kobo per second for phone calls after President Muhammadu Buhari signed the National Health Insurance Authority Bill 2021.\nGbenga Adebayo, telecom subscribers will bear the brunt of the new tax because they will now get less value for what they pay for.\nHe adds that the operators will have no choice but to start deducting the tax from the subscribers’ recharge once mandated by the government.\nSo, if we cannot review based on the impact it will have on subscribers, why are they bringing in another tax, still on subscribers."
  },
  {
    "headline": "UNICEF Provides 102,859 Vulnerable Borno Children Access To Education",
    "summarized_story": "United Nations Children Emergency Fund (UNICEF) yesterday said it had provided 102, 859 children with access to inclusive, equitable and quality education in a safe and protective learning environment in Borno State.\nUNICEF education manager in Maiduguri Field Office, Paola Ripamonti, made the disclosure at a press conference held on EduTrac System and the Mainstreaming of Psychosocial Support into Formal Education in Maiduguri, the Borno State capital.\nRimamonti said the conference was aimed at highlighting the pilot of the EduTrac mobile phone-based data collection system and the mainstreaming of psychosocial support into formal education in Borno State.\n“But first let me acknowledge all media professionals here for your support in promoting the wellbeing of vulnerable girls and boys in Borno State and across north-east Nigeria.\nSome of them have even returned to school and are supporting their education with income earned from their businesses,” said the UNICEF education manager."
  },
  {
    "headline": "Researchers Discover Mosquitoes Resistant To Insecticides In Jigawa",
    "summarized_story": "A team of researchers at the Federal University Dutse has discovered species of mosquitoes in Jigawa State that are resistant to most of the insecticide treated nets.\nHowever, the research revealed that some exceptional insecticides proved effective on all the mosquitoes.\nAccording to Dogara, the research became necessary when it became obvious that mosquitoes all over the world were developing resistance to Long Lasting Insecticides Treated Bed Nets(LLITN) coated with pyrethriod insecticides.\nHe said the female anopheles mosquitoes with variants such as anopheles gambicae, anopheles collonzi and anopheles arabiansis are all resistant to bed nets coated with Pyrethroids, organnochlorine and organophosphate insecticides.\nAccording to him, the research finding shows that only primiphosmethl insecticides kills mosquitoes 100 percent and their recommendation is that henceforth only bed nets coated with Primiphosmethl should be deployed to Jigawa."
  },
  {
    "headline": "Tinubu Promises Borno Oil Exploration, Clearance Of Insurgents",
    "summarized_story": "All progressives Congress (APC) national leader and presidential aspirant, Asiwaju Bola Ahmed Tinubu, has promised the people of Borno State that if he is elected as the next president of Nigeria in 2023, he will exploit all the state’s natural endowment especially, oil and resuscitate the Lake Chad Basin irrigation farming and fishing which are the major occupations of the people of the state.\nTinubu also pledged to ensure that peace returns permanently to the state by tackling insecurity and all other crimes bedevilling the state and region for a decade.\nHe made the pledge yesterday while addressing APC national delegates from Borno who assembled at the Multi-purpose Hall of the Government House in Maiduguri.\nThe presidential aspirant reaffirmed his commitment to overhaul major sectors of the country towards stabilising the economy, creating job opportunities and revitalising major ailing industries in addition to improving the roads, aviation and railway lines facilities among others.\nAccording to him, “health is wealth and education is key to development."
  },
  {
    "headline": "Tinubu Promises Borno Oil Exploration, Clearance Of Insurgents",
    "summarized_story": "All progressives Congress (APC) national leader and presidential aspirant, Asiwaju Bola Ahmed Tinubu, has promised the people of Borno State that if he is elected as the next president of Nigeria in 2023, he will exploit all the state’s natural endowment especially, oil and resuscitate the Lake Chad Basin irrigation farming and fishing which are the major occupations of the people of the state.\nTinubu also pledged to ensure that peace returns permanently to the state by tackling insecurity and all other crimes bedevilling the state and region for a decade.\nHe made the pledge yesterday while addressing APC national delegates from Borno who assembled at the Multi-purpose Hall of the Government House in Maiduguri.\nThe presidential aspirant reaffirmed his commitment to overhaul major sectors of the country towards stabilising the economy, creating job opportunities and revitalising major ailing industries in addition to improving the roads, aviation and railway lines facilities among others.\nAccording to him, “health is wealth and education is key to development."
  },
  {
    "headline": "Dei Dei Market Crisis: FCT Minister Sues For Peace, Visits Victims’ Families",
    "summarized_story": "Minister of the Federal Capital Territory (FCT) Malam Muhammad Bello has appealed to members of the Dei-Dei building materials and adjoining markets’ communities to continue to maintain the peace following the unfortunate fracas that occurred last week.\nThe minister who was represented by the FCTA permanent secretary, Mr Olusade Adesola, also appealed for the sustenance of the prevailing peace in the affected areas and prayed for the repose of the souls of the dead.\nBello who stressed that an environment of peace and tranquility was very important for development, urged the entire FCT residents to see themselves as a big united family and work towards the attainment of a common objective of peace development.\nThe peace that we are building on, let’s continue to sustain it because it is very important for us.\nThe minister while speaking to the relations of the deceased victims, said, “No matter what we give you, it cannot replace the lost lives."
  },
  {
    "headline": "How we can tackle economic challenges in West Africa",
    "summarized_story": "President Muhammadu Buhari on Tuesday called on executives of banking institutions in West Africa to forge a closer collaboration to tackle economic challenges confronting the sub-region.\nPresident Buhari told the association, founded in 1981, and which brings together over 250 commercial banks and 15 institutions from across West Africa, that for many centuries, African countries have traded with one another without a formalized and structured system.\nThe Nigerian leader expressed confidence that the rollout of the African Continental Free Trade Area would be a turning point in how African countries trade with each other.\n”That will allow us to benefit from the revenue earned from the added value of exporting a finished product,” he said.\n”That’s why we are here for counsel and guidance for the financial sector in West Africa,” he said."
  },
  {
    "headline": "Nigerians must stop complaining: Bishop Akinfenwa",
    "summarized_story": "Joseph Akinfenwa, has advised Nigerians to stop complaining but give more thanks to God.\nThe bishop said that Nigerians should celebrate God’s faithfulness and thank HIM for mercy.\nThe cleric urged Nigerians not to be tired of praying for the country.\nAkinfenwa thanked God for adding another year to his age and giving him the grace to serve the diocese in the last 22 years.\nAkinfenwa, who attained the age of 66 on May 24, has served the diocese as the bishop for 22 years."
  },
  {
    "headline": "Petrol Station Saved As Diesel Tanker Goes Up In Flame In Anambra",
    "summarized_story": "Petrol Station Saved As Diesel Tanker Goes Up In Flame In AnambraA petrol station on the Enugu-Onitsha Expressway’s Umunya Road was saved from fire on Tuesday when a truck carrying diesel crashed into the area and caught fire.\nAccording to a source, the tanker crashed into the gutter when the driver lost control.\nAccording to the source, the tanker quickly caught fire after the collision.\nOn Tuesday morning, the event occurred at the famed Odumodu Junction in Umunya, Oyi Local Government Area.\n“The diesel flowing out of the truck flowed through the gutter, generating flames and burning everything in its way."
  },
  {
    "headline": "BREAKING: 2023: Bali wins PDP’s Plateau South senatorial ticket",
    "summarized_story": "Air Vice Marshal Napoleon Bali (rtd) has won the Peoples Democratic Party (PDP) primaries for the Plateau South Senatorial District ticket in the 2023 election.\nBali, a one-time Chief of Policy and Plans (COPP) HQ NAF, scored 141 votes to defeat a former House of Representatives member, Hon.\nJohnbull Shekarau, who polled 61 votes.\nNews Direct reports that Bali would be contesting against Governor Simon Lalong who is the sole aspirant of the ruling All Progressives Congress (APC).\nDetails to come…"
  },
  {
    "headline": "Train Attack: We’ll start killing abducted passengers in 7 days — Ter",
    "summarized_story": "Terrorists who kidnapped passengers on the Abuja-Kaduna bound train that was attacked on 28th March 2022, have urged the government to release their children allegedly kept in a Yola detention facility.\nThey threatened to start killing the passengers in captivity within 7 days unless their demands are metLeaders of the terrorists spoke on phone to the spokesman of Sheikh Ahmad Gumi, Malam Tukur Mamu, ‘And Dan Iyan Fika.\nThe leader of the terrorists; Abu Barra said that it’s been two months since the abduction and anything can happen to the abducted passengers henceforth.\n“For any continued discussion on the release of these passengers and a safe resumption of the train service, our children must be released unconditionally.\nI believe an opportunity has been created for us to explore to save the lives of those innocent victims."
  },
  {
    "headline": "BREAKING: Gov Wike sacks all commissioners, other aides",
    "summarized_story": "Nyesom Wike, Rivers State governor, has dissolved the state executive council with immediate effect.\nWike who announced the dissolution in a statement by his Special Assistant Media, also relieved his Chief of Staff and Senior Special Assistant (Protocol) of their positions.\n“His Excellency, Governor Nyesom Ezenwo Wike, commends the members the Rivers State Executive Council for their service and contribution to the development of the State.\nHe has also wished them the best in all their future endeavours,” the statement said.\nThe governor instructed all the former members of the State Executive Council to hand over to the most senior officers in their respective ministries."
  },
  {
    "headline": "Killings: At last, IPOB leader, Nnamdi Kanu, breaks silence",
    "summarized_story": "An angry leader of the Indigenous People of Biafra (IPOB), Mazi Nnamdi Kanu, has ordered an immediate end to what he called “the senseless killings going on in the South East,” which is officially being attributed to the members of the organisation.\nCurrently in detention a the Department of State Services (DSS), facility in Abuja, the enraged IPOB leader bewailed the spate of bloodletting and insecurity in the South East, according to his younger brother, Prince Emmanuel Kanu, who spoke on Monday evening, after visiting him in detention.\nThe younger Kanu, said the IPOB leader, was saddened by reports of killings across South East, as he did not believe in bloodshed and felt too bad that blood suckers had been on the prowl in the South East almost unchallenged.\nShe is an old woman and since my mother died I have taken her as my mother.\nKanu urged all to ensure there is peace in South East which is known for peace, adding that those behind the insecurity in the zone did not mean well for the people."
  },
  {
    "headline": "Adamu: Non-assent to amended Electoral Act not ploy to elongate Buhari’s tenure",
    "summarized_story": "“In this regard, any alteration or amendment to the Electoral Act, at this moment, will amount to changing the rules in the middle of the game.\n“Our observation shows that political parties, aspirants and the electorate have already adjusted to the current provision of Section 84 of the Electoral Act.\nAPC Professionals weigh inAlso, the APC Professionals has said the president has nothing to lose not signing the amended Electoral Act Bill into law.\nThis Electoral Act as currently amended, is a blessing in disguise.\nI don’t think President signing the electoral act at this late hour will help anyone except INEC is willing to adjust their timetable."
  },
  {
    "headline": "Russia, Ukraine war may drag for 10 years – Official",
    "summarized_story": "Russia’s bloody war with Ukraine could drag on for another decade and leave hundreds of thousands dead, one of Vladimir Putin’s fiercest critics has warned.\n“The closest comparable is the Iran-Iraq war which went on a decade and killed a million people.”He also warned of a further escalation from Putin if the war continues to go badly for Russia.\nThis could be followed by the full mobilisation of up to two million Russian reservists, and even a biological, chemical, or nuclear attack.\nBrowder warned that Putin could also be prepared to follow the example of North Korea, and transform his nation into a war economy that exists solely for the conflict with Ukraine.\n“He certainly has the resources.”He also denied that Putin’s actions in Ukraine were out of character for the Russian President."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "BREAKING: EFCC Operatives Storm Okorocha’s Abuja Residence",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC) on Tuesday stormed the residence of former Imo State Governor, Rochas Okorocha.\nThe anti-graft agency team stormed the residence of the former governor in the Maitama area of the Federal Capital Territory (FCT) to arrest him.\nIn a video obtained by Channels Television, the EFCC operatives were seen within the premises of the former governor.\nIn this video, EFCC operatives were seen within the premises of the former Imo State Governor, Rochas Okorocha’s Abuja residence.\nThey insisted that Okorocha should submit himself for arrest or honour a long-standing invitation to their office."
  },
  {
    "headline": "BREAKING: CBN Raises Interest Rate For First Time In Over Two Years To 13%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has voted unanimously to raise the Monetary Policy Rate (MPR) to 13 per cent.\nCBN Governor, Godwin Emefiele, announced this on Tuesday while briefing reporters at the end committee’s meeting at the apex bank’s headquarters in Abuja.\nIt is the first time in two and a half years that the policy-setting committee of the nation’s financial regulator would increase the MPR, which measures the interest rate.\nMore to follow…"
  },
  {
    "headline": "Ex-Senate President Proposes Bipartisan Commission To Tackle Insecurity",
    "summarized_story": "A former Senate President, Ken Nnamani, has recommended the establishment of a bipartisan commission to tackle the security challenges in various parts of the country.\n“Let me tell you something; one of the major problems we are facing now is insecurity,” he stated.\n“If I have the opportunity, the first thing I will do is to set up a bi-partisan commission.\nHe explained that the U.S. government at the time set up a bi-partisan commission which he said led to the creation of the Department of Homeland Security.\n“The Nigerian police force, as it is constituted today, is not able to fight this situation now,” he stated."
  },
  {
    "headline": "Court Orders CBN, NDIC To Pay Bank Workers N5.7bn",
    "summarized_story": "The National Industrial Court sitting in Lagos has ordered the Central Bank of Nigeria (CBN) and the Nigeria Deposit Insurance Corporation (NDIC) to pay over N5.7bn terminal benefits to over 1,000 bank workers affected by the re-capitalisation exercise of 2006.\nREAD ALSO: [2023 Presidency] Emefiele Withdraws Suit Against INEC, AGFThe court also ordered the CBN and the NDIC to pay another N10m as general damages to the claimants.\nShouts of joyShouts of joy emanated from the representatives of the bank workers after the court delivered judgment in their favour.\nThe bank workers then sued the two organisations demanding the payment of their terminal benefits.\nThe court then ordered the CBN and the NDIC to pay the workers within three months from the date of judgment failing which which it will attract 10 percent interest until liquidated."
  },
  {
    "headline": "Immigration Decries Inability To Effectively Man Borderlines, 1,490 Illegal Entry Points",
    "summarized_story": "The Nigeria Immigration Service (NIS) has decried the inadequacy within its workforce which it is said has prevented the service from properly manning the nation’s borderlines.\nActing Controller-General of Immigration (CGI), Isah Idris, stated this during a virtual media interaction where he said the major responsibility of the service was border security, without overlooking the importance of passport issuance as another mandate.\nAccording to him, the entire workforce of NIS is not more than 25,000 while Nigeria’s borders are massive, covering 5,330 kilometres with an estimated 1,490 illegal entry points into the country.\nHe revealed that the NIS conducts raids regularly and many irregular residents in Nigeria are regularly picked up and eased out.\nJust two days ago, three illegal Sudanese residents in Nigeria were picked up."
  },
  {
    "headline": "Zulum hosts APC presidential aspirant TS Jack-Rich",
    "summarized_story": "Borno State Governor, Babagana Zulum said the people of Borno State are appreciative of the visible footprints and humanitarian strides of a frontline Presidential Aspirant of the All Progressives Congress, Tein T.S.\nJack-Rich, in the state.\nGovernor Zulum disclosed this at the government House Maiduguri while hosting an APC Presidential Aspirant and his entourage who were on a consultative visit to the state to meet with Stakeholders and Delegates of the Party ahead of the Presidential Primaries.\nThe Borno State Governor notes with gratitude the people-oriented projects executed by Mr Jack-Rich in parts of the State which includes world-class Potable Water Facilities of 250,000 Litre Capacity each at Gonidangari and Shehuri North in Maiduguri as well as the ongoing ultra-modern Faculty of Engineering and 180-Bed capacity Hotel projects at the Nigerian Army University in Biu.\nOn his part the Presidential aspirant Jack-Rich vowes to address the problems militating against the ease of doing business in Borno in order to attract private sector investments if he emerged as President in 2023."
  },
  {
    "headline": "Former Sports minister, Others emerge as Senatorial Candidates -",
    "summarized_story": "A former minister of sports and youth development and also former national publicity secretary of the All Progressives Congress, Bolaji Abdullahi has emerged as the senatorial candidate of the Peoples Democratic Party for Kwara central.\nMr Bolaji Abdullahi aside from being a former Minister was also at various times a commissioner, special adviser and senior aide to former President of the Senate, Dr Bukola Saaraki,He emerged through concensus during the party’s primary election in Ilorin.\nA former Senator, Rafiu Ibrahim also emerged as the PDP consensus candidate for Kwara south.\nIn kwara north, it was a keen contest between a former commissioner for local government and chieftaincy affairs, Issa Bawa and a former commissioner for special duties, Aisha Ahman-Pategi.\nIssa Bawa eventually defeated Ahman-Pategi to clinch the PDP senatorial ticket for Kwara north."
  },
  {
    "headline": "Vice President Yemi Osinbajo Meets Kaduna APC Delegates -",
    "summarized_story": "Vice President, Yemi Osinbajo has met with Kaduna State delegates of the All Progressive Congress (APC), ahead of the presidential primary election of the party later this month.\nProfessor Osinabjo, a frontline presidential aspirants under the ruling APC was accompanied by Governor Nasir El-Rufai together with the other senior APC chieftains.https://www.tvcnews.tv/purplegold/post.php?post=197866&action=edit#The meeting however held behind closed doors at the Murtala Mohammed Square.\nAddressing Newsmen after the hour-long session, the Vice President said he was satisfied with the outcome of his discussion with the delegates.\nProfessor Osinbajo who is a former Attorney General of Lagos State and a former Senior Lecturer in the Department of Law of the University of Lagos has been Vice President to President Muhammadu Buhari since 2015.\nThe Vice President publicly declared his intention to succeed his boss, President Muhammadu Buhari, in April followoing months of speculations on whether he will run or not."
  },
  {
    "headline": "Win Ekiti for me, Adamu charges APC National Campaign Council -",
    "summarized_story": "National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, has expressed optimism that the party will emerge victorious in the June 18 Ekiti governorship election.\nAdamu said this on Monday in Abuja, when he inaugurated the APC Ekiti State Governorship Campaign Council.\nAbubakar Bagudu of Kebbi, will take charge of campaign and marketing our candidate for the Ekiti governorship election.\n“Four years ago, we also had governorship election in Ekiti State and I was privileged and honored to serve as the chairman.\nAlhaji Mohammed Argungu, the APC National Organising Secretary in his remarks, said the party confidence in winning the Ekiti State governorship election was further boosted by the totality of the characters of members of the council."
  },
  {
    "headline": "UK PM Johnson Facing Fresh Criticism after New Partygate Photos Emerge",
    "summarized_story": "Boris Johnson is facing fresh questions after photos showing the prime minister drinking at an event during a Covid lockdown were published.\nThe pictures, released by ITV News, are believed to show the prime minister at a leaving party on 13 November 2020.\nThe Metropolitan Police are facing calls to explain why Mr Johnson did not receive a fine.\nA government source told BBC News the photos may have been taken by the official No 10 photographer and proved Mr Johnson was there in a work capacity.\nMr Johnson is pictured toasting colleagues while standing by a table laden with wine bottles, wine glasses, food and other drinks."
  },
  {
    "headline": "Nigeria Imports Refined Petroleum Products Worth $28bn Yearly, Says Energy Consultant – Arise News",
    "summarized_story": "The cost of importing petroleum products of all kinds into Nigeria has soared to over $28 billion on an annual basis, Blackgold Energy Authorities, an oil and gas consulting and advisory firm, has revealed.\nIn her presentation at the summit, on the topic, “Challenges and opportunities in the Nigerian petroleum refining sector”, Owo put Nigeria’s per capita refining at 0.002 barrels per day, describing the situation as embarrassing.\nNigeria is the largest producer of crude in Africa and third largest importer of refined products in Africa.\n“Agreement for the first vessel was signed in 2018 and the vessel was delivered in 2020.\nWabote maintained that the NCDMB’s touchpoints in the LPG value chain covered inland LPG production, LPG jetties/terminals, storage facilities, inland transportation, cylinders manufacturing, bottling, and retail."
  },
  {
    "headline": "Higher Energy Prices Could Trigger Global Recession, IEA Warns",
    "summarized_story": "A rise in energy demand in the summer could send prices higher and risk a global recession, the head of the International Energy Agency (IEA), Fatih Birol has warned.\nWe have high inflation … we have an energy crisis… we have food poverty, and we have a climate crisis.\nEnergy prices have risen sharply in 2022 after Russia, a major supplier, invaded Ukraine in late February.\nThe comment by Birol that a rise in energy demand in the summer could send prices higher and risk a global recession came in the context of a sharp rise in global energy prices as a result of Russia’s invasion of Ukraine.\nBirol said these efforts were necessary to punish Russia, but warned they increased the risks for energy markets and the world economy."
  },
  {
    "headline": "Lagos Develops Off-Grid Electrification Strategy, Action Plan",
    "summarized_story": "RelatedStories No Content AvailableThe Lagos State Government, through the Ministry of Energy and Mineral Resources, Monday announced that it had developed the Lagos State Off-Grid Electrification Strategy and Action Plan with support from the British-funded Africa Clean Energy Technical Assistance Facility (ACE-TAF).\nOdusote explained that with the emergence of the off-grid solar sector as an important component in achieving access to energy for all in the State, the ministry had developed the Lagos State Off-Grid Electrification Strategy and Plan with the support of ACE-TAF to ensure the implementation of the electricity policy.\nThe organisation had done so through its support in the development of the Lagos State Electricity Policy and the Lagos State Off-Grid Electrification Strategy and Action Plan, he said.\nAgbaegbu stated that the Off-Grid Electrification Strategy and Plan further underscored the state government’s commitment to clean off-grid electrification, thereby enabling private sector investment in its off-grid electricity market.\n“Besides, Alaba Rago is directly opposite the Lagos State University, Ojo Campus."
  },
  {
    "headline": "Airbnb to Quit China as Lockdowns Restrict Tourism",
    "summarized_story": "In 2017, as part of its bid to expand, it renamed the Chinese operation Aibiying (爱彼迎) – meaning to welcome each other with love – which is easier to pronounce for Mandarin speakers."
  }
]