[
  {
    "headline": "We’ll soon reveal Imo killings’ sponsors, says Uzodimma",
    "summarized_story": "The Imo State Governor, Senator Hope Uzodimma, has said he will reveal the sponsors of killings in the state in two weeks.\nHowever, I had a meeting with security agencies who pleaded that naming the sponsors when the investigation is still going on could jeopardise the efforts.\nIn the South-East, we are ready to produce the President of Nigeria.\nWhat will make it work is for the two leading political parties to produce candidates from the South-East geopolitical zone.\n“Let the Peoples Democratic Party produce a South-Easterner as their presidential candidate."
  },
  {
    "headline": "Embrace religious tolerance, Tinubu urges Nigerians",
    "summarized_story": "The National Leader of the All Progressives Congress and presidential aspirant, Asiwaju Bola Tinubu, has urged Nigerians to embrace religious tolerance to ensure lasting peace and stability in the country.\nHe also promised to address the reward system if elected president so that party members could get due recognition for their efforts.\nThe APC leader disclosed this in a statement issued by the Director of his media office, Tunde Rahman, on Sunday.\nNigerians embrace religious tolerance to ensure lasting peace and stability in the country.\nIn Jalingo, the Taraba State capital, Tinubu charged party members to resolve their differences and forge a united front, stating that unity was key to victory in the state."
  },
  {
    "headline": "Nzeribe: Family begins consultations for funeral rites",
    "summarized_story": "The family of late Sen. Arthur Nzeribe says it has begun traditional consultation for the funeral rites of the late business mogul and political icon.\nLate Nzeribe died at the age of 83 years on May 5 following protracted illness.\nThe family made the disclosure on Sunday in an official statement titled “Our mighty Iroko has fallen: Sen. Chief Francis Arthur Nzeribe is dead” to announce his demise.\nThe statement was jointly signed by Messrs Ojiabu Francis Nzeribe, Anthony Akpati Nzeribe and Ojiabu Oliver Nzeribe, for and on behalf of the Nzeribe Royal family.\nIn the third republic, late Nzeribe represented Imo West at the senate between 1999 and 2007 on the platform of the Peoples Democratic Party (PDP)."
  },
  {
    "headline": "ARTHUR NZERIBE: Nigeria has lost political juggernaut — Uzodimma",
    "summarized_story": "Governor Hope Uzodinma of Imo State.\nGovernor Hope Uzodimma of Imo State has said that the death of Senator Arthur Nzeribe is a big loss to the people of Imo State in particular and Nigeria in general.\nBorn on November 2, 1938, Senator Nzeribe reportedly died on Sunday at the age of 83, according to family sources.\nA statement by Governor Uzodimma’s Chief Press Secretary and Media Adviser, Oguwike Nwachuku, said Senator Nzeribe will forever be remembered as a political juggernaut in Nigeria.\nGovernor Uzodimma said his death has robbed Imo State and Nigeria of a seasoned politician and business icon, noting that Senator Nzeribe died when his fatherly and statesmanly advice were badly needed."
  },
  {
    "headline": "Ward Congress: Akwa Ibom groups write IG, PDP chairman over petitions",
    "summarized_story": "Two different groups, Akwa Ibom Integrity Alliance and The Mandate Eyes have written in separate letters to the Inspector General of Police and the National Chairman of PDP, respectively insisting that the ward congresses in Akwa Ibom were held simultaneously in all the 329 wards of the state, under peaceful and credible atmosphere devoid of rancor.\n“There is a dire need to state that such complaints are unwarranted and adorned with malicious intent to scuttle the hard-earned peace and proper coordination of the political activities in Akwa Ibom State.\nThe general calls on other political parties in the State to take a cue from the PDP’s April 30th Ward Congresses in Akwa Ibom, attest to the transparent conduct of the exercise in the State.\nThere is no need to heat up the polity because of selfish desperation.”On their part, the Mandate Eyes posited that splinter groups hurriedly assembled overnight, were being used as agents of doom to paint an ugly picture that doesn’t exist, about Akwa Ibom State.\n“These purveyors of falsehood should henceforth refrain from making unsubstantiated statements capable of threatening the peace currently being enjoyed in the state."
  },
  {
    "headline": "Five things to know about late Arthur Nzeribe",
    "summarized_story": "Senator Arthur NzeribeSenator Francis Arthur Nzeribe, a Second Republic politician, is dead.\nHere are some things to know about Arthur Nzeribe.\nHis father, Oyimba Nzeribe, was a lawyer and former state counsel, and his grandfather, Akpati Nzeribe, held the traditional title of Ogbuagu, Oshiji, Damanze Oyimba of Oguta.\nArthur Nzeribe was elected Senator for the Imo Orlu constituency in 1999 and was reelected in 2003.\nHis second wife is the sister of Hajia Asabe Yar’Adua, wife of the late General Shehu Musa Yar’Adua, who was the brother of President Umaru Yar’Adua."
  },
  {
    "headline": "10 feared dead as explosion rocks illegal refinery in Abia",
    "summarized_story": "FIle Photo: Illegal RefineryBy Steve OkoAbout 10 persons were feared dead following an explosion that occured at an illegal oil refinery located at Uzuaku Community in Ukwa West Local Government Area of Abia State.\nWhile three persons reportedly died at the scene of the incident which reportedly occured on Friday evening, seven others later died in the hospital where they were rushed to for medical treatment.\nThis is coming barely two weeks after a deadly explosion at another illegal refinery claimed over 100 lives in Ohaji Egbema, Imo State.\nAccording to our sources, the Shell pipeline that services the Uzuaku/Owaza axis has not had crude oil for some weeks leading to the stoppage of illegal oil bunkering activities in the area.\nBut when pumping of crude oil along the pipeline resumed, according to the source, illegal refinery operators went back to their business."
  },
  {
    "headline": "Airline operators cancel nationwide shutdown",
    "summarized_story": "The Airline Operators of Nigeria, AON, says it has suspended the earlier decision to shut down flights beginning from Monday, May 9.\nDAILY POST recalls that the AON had in a statement vowed to shut down operations following the high cost of aviation fuel.\nBut the president of the AON, Alhaji Abdulmunaf Yunusa Sarina, in a statement on Sunday, announced that airlines would continue operations as usual.\nAccording to him, the development followed a deliberation with the Federal Government on how to tackle the fuel issue.\nThe airlines which pulled out of the earlier joint decision to suspend operations over skyrocketing Jet A1 include Ibom Air, Dana, Arik, Aero, Overland and Green Africa Airways."
  },
  {
    "headline": "We’re not in support of flight suspension – Dana Air",
    "summarized_story": "The management of Dana Air has said that it has taken a decision not to join the suspension of flights on Monday, May 9, 2022.\nDana Air disclosed this in a statement issued on Sunday in Abuja, making it the second airline operator to back out of the planned suspension of flight operations after Ibom Air.\nIt said following the recent press statement issued by the Airline Operators of Nigeria (AON), it became necessary for it to take a stand in the overall interest of our guests, corporate partners, staff and the industry at large.\nIt, therefore, called on the government to act urgently to resolve these unending operational challenges.\nIt said it would continue to support every effort by the AON to achieve a quick and peaceful resolution “in the interest of our dear country Nigeria.”"
  },
  {
    "headline": "Flight shut down: Arik Air, Aero Contractor back out, continue operation",
    "summarized_story": "The management of Arik Air Limited (In Receivership) and Aero Contractors (In Receivership) have said that they will be operating all their scheduled flights on Monday, May 9, 2022.\nThe airlines disclosed this in a joint statement issued and made available and made available to newsmen on Sunday in Lagos.\nThe joint statement reads: “Both managements fully identify with and endorse the efforts of the Airline Operators of Nigeria (AON) to bring about a conducive operating environment for Nigerian carriers as the current price of JET A1 is unsustainable and could result in the untimely demise of most airlines.\nDAILY POST reports that Ibom Air had earlier countered the position of AON to suspend flight operations saying that it will continue normal operations on May 9.\nAccording to a statement issued by the airline’s management, suspending flights will make the bad situation worse."
  },
  {
    "headline": "Rising oil price to lead to high inflation – IMF",
    "summarized_story": "The International Monetary Fund (IMF) has opined that rising oil prices is likely to lead to high inflation and slow growth across the globe.\nIt is also of the opinion that geopolitical tensions caused fossil fuel prices to spike as the rising oil prices may echo the 1970s.\nAccording to the Washington-based lender, “For some, rising oil prices may echo the 1970s when geopolitical tensions also caused fossil fuel prices to spike.”The report explained that the memories of the high inflation and slow growth that followed—known as stagflation—have fueled concerns about a possible repeat.\nIt further explained that oil price increases have been contained by spare production capacity in some countries and petroleum reserves in others.\nThe report explained that Brent crude, the global oil benchmark, had risen to about $100 before the Ukraine crisis pushed it above $130 in a seven-year high."
  },
  {
    "headline": "Nigerian airlines insist on flight shutdown from Monday",
    "summarized_story": "The Airline Operators of Nigeria (AON) on Sunday said that they would go ahead with the withdrawal of flight operations on Monday.\nAON President, Yunusa Abdulmunaf issued a statement on Sunday.\nThe shutdown of operations, he added, was “a collective sacrifice for the common interest of our nation”.\nHe added that “airlines are not on strike” but were private investors who do not depend on government funds.\n“I use this medium to appeal to the conscience of our esteemed passengers for their understanding,” the statement added."
  },
  {
    "headline": "Atiku: I have experience to tackle insecurity",
    "summarized_story": "Former Vice-President Abubakar Atiku has appealed to the Peoples Democratic Party (PDP) delegates in Osun State to support his presidential ambition.\nHe said: “I have the right experience to tackle Nigeria’s challenges of insecurity and disunity.\nIf I become the president, I will ensure restructuring for this nation.”Atiku warned that the PDP might lose the coming Osun State governorship election.\nIn the last election it was the disagreement with PDP against PDP that made us to lose the election.\nDon’t let us repeat the same mistake; I beg of you the leaders and chieftains of the party."
  },
  {
    "headline": "Emefiele should resign, says ex-SSG Basorun",
    "summarized_story": "Second Republic Secretary to Lagos State Government (SSG) Olorunfunmi Basorun yesterday asked Central Bank of Nigeria (CBN) Governor Godwin Emefiele to resign.\nBasorun, a lawyer and retired CBN deputy director, said it was dangerous for the economy if the governor of the apex bank retained his job while playing politics.\nBasorun, who spoke on the phone, said Emefiele could be accused of double loyalty and divided attention, especially since he had not refuted the report about his political ambition.\nHe advised him to resign or the Senate should rise to the occasion by sacking him.\nBasorun said no CBN governor could be a thin god, urging Emefiele to learn from his predecessor."
  },
  {
    "headline": "Many injured, cows burnt as gunmen attack Anambra",
    "summarized_story": "No fewer than 40 cows were burnt and many persons were injured when gunmen attacked a truck carrying cows in Anambra State on Sunday.\nAn eyewitness told The Nation that none of the cows came out alive while the driver and others inside of truck got injured.\nHe said he heard about the incident, adding that the cows, as he was told, belonged to some Igbo businessmen.\nBut he said the cows were rescued by security operatives who responded swiftly.\nHe said the locals helped security operatives to put off the fire and rescue occupants of the truck."
  },
  {
    "headline": "13 things you probably didn’t know about Nzeribe",
    "summarized_story": "13 things you probably didn’t know about NzeribeMaverick politician Senator Arthur Nzeribe is dead.\nHere are things you probably didn’t know about Nzeribe:1.\nFrancis Arthur Nzeribe was born in Oguta, Imo State on November 2, 1938.\nArthur Nzeribe was elected Senator for the Imo Orlu constituency 1999 and was reelected in 2003.\nIn November 2002, Senate President Anyim Pius Anyim indefinitely suspended Senator Nzeribe due to an allegation of a N22 million fraud."
  },
  {
    "headline": "UPDATED: Arthur Nzeribe dies at 83",
    "summarized_story": "Maverick politician Senator Arthur Nzeribe is dead.\nNzeribe, who has been on life support for sometimes, reportedly died on Thursday.\nThe First Republic politician, who represented Imo West at the National Assembly, was the longest serving Senator from the State.\nA statement by Ojiabu Francis Nzeribe and Anthony Akpati Nzeribe for the family, confirmed his demise.\nAt 22, Nzeribe hit a mega fortune, becoming a major player in the nation’s financial sector."
  },
  {
    "headline": "Two-day warning strike over Condition of Service still stands -Aviation unions",
    "summarized_story": "By Chinelo ObogoThe plan by labour unions in four aviation agencies to embark on two-day warning strike on Monday and Tuesday, May 9 and 10, over the non implementation of the Minimum Wage Consequential Adjustment, still stands, Daily Sun can reveal.\nThe General Secretary of the National Union of Air Transport Employees (NUATE) Ocheme Aba, confirmed to Daily Sun on Sunday evening that there has been no development to stop the plans and that the strike will still go on.\nThe unions said the ongoing effort by the Federal Ministry of Aviation and the NSWIC to resolve these issues do not show any positive sign of achieving amelioration anytime within sight and consequently, they have no alternative than to embark on an industrial action to press home their demands.\n“All workers in NAMA, NCAA, NiMeT and NCAT are hereby directed to embark on a two-day warning strike on May 9 and 10, 2022.\nShould the warning go unheeded, an indefinite strike shall be called soon afterwards."
  },
  {
    "headline": "Man, wife, anothers perish in Abia oil explosion",
    "summarized_story": "From Okey Sampson, UmuahiaA man, his wife and another young man said to be the only son of his family have perished instantly in an oil fire explosion which occurred at an illegal refinery in Uzuaku community, Abia State.\nAnother unascertainted number of people were said to have died in a hospital later as a result of the incident.\nIt was gathered that, the Shell pipeline that services the Uzuaku / Owaza axis have not had crude oil running through it for some weeks leading to the stoppage of illegal oil bunkering activities in the area.\nA Source said the resumption of pumping of crude oil along the pipeline last week, triggered the activities of illegal refinery operators to go back to their business.\nIt was of trying to get back to their illegal business, that one of the sites went up in flames, killing the three persons instantly."
  },
  {
    "headline": "Gunmen set truck carrying cattle ablaze in Anambra",
    "summarized_story": "From Obinna Odogwu, AwkaGunmen, on Sunday morning, attacked a truck carrying cattle in Ezinifite community in Nnewi South Local Government Area of Anambra State, setting it ablaze.\nThe incident, according to a commentator in a video trending on social media, happened along the road leading to Uga community in Aguata LGA.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nDo not miss the Vital Information, it goes off in 2 days!\nFull details later…"
  },
  {
    "headline": "The Sun Awards: Night of excellence, glamour",
    "summarized_story": "By Olafioye Olakunle, Chinelo Obogo, Daniel Kanu, Chukwudi Nweje, Sunday AniIt was a night of excellence and glamour yesterday at The Sun Awards as many eminent Nigerians were celebrated.\nImo State governor, Hope Uzobimma also flayed opponents and critics of his government, saying that the state of insecurity in the state is the handwork of opposition.\n“We have been receiving many awards, but The Sun awards is the award.\nI would like to appreciate my Senate President for his support which has made what I do possible.\nI want to thank Abia State Governor, Okezie Ikpeazu, who is the most supportive husband."
  },
  {
    "headline": "Two-day warning strike over Condition of Service still stands -Aviation unions",
    "summarized_story": "By Chinelo ObogoThe plan by labour unions in four aviation agencies to embark on two-day warning strike on Monday and Tuesday, May 9 and 10, over the non implementation of the Minimum Wage Consequential Adjustment, still stands, Daily Sun can reveal.\nThe General Secretary of the National Union of Air Transport Employees (NUATE) Ocheme Aba, confirmed to Daily Sun on Sunday evening that there has been no development to stop the plans and that the strike will still go on.\nThe unions said the ongoing effort by the Federal Ministry of Aviation and the NSWIC to resolve these issues do not show any positive sign of achieving amelioration anytime within sight and consequently, they have no alternative than to embark on an industrial action to press home their demands.\n“All workers in NAMA, NCAA, NiMeT and NCAT are hereby directed to embark on a two-day warning strike on May 9 and 10, 2022.\nShould the warning go unheeded, an indefinite strike shall be called soon afterwards."
  },
  {
    "headline": "BREAKING: Former Nigerian Senator, Arthur Nzeribe, Is Dead",
    "summarized_story": "Former Nigerian Senator, Francis Arthur Nzeribe is dead.\nAccording to the source, Nzeribe was declared dead at a foreign hospital following an undisclosed ailment.\nIn 2017, the photograph of ageing and possibly sick Nzeribe, sitting languidly, with medics around him went viral on social media.\nHe was elected a Senator to represent Orlu first in 1999 but in November 2002, the then-Senate President Anyim Pius Anyim suspended Nzeribe indefinitely over an allegation of N22 million fraud.\nDue to popular demand, in December 2006, Nzeribe was defeated by Osita Izunaso during the Peoples Democratic Party (PDP) primaries for the 2007 Senatorial election."
  },
  {
    "headline": "BREAKING: Former Nigerian Senator, Arthur Nzeribe, Is Dead",
    "summarized_story": "Former Nigerian Senator, Francis Arthur Nzeribe is dead.\nAccording to the source, Nzeribe was declared dead at a foreign hospital following an undisclosed ailment.\nIn 2017, the photograph of ageing and possibly sick Nzeribe, sitting languidly, with medics around him went viral on social media.\nHe was elected a Senator to represent Orlu first in 1999 but in November 2002, the then-Senate President Anyim Pius Anyim suspended Nzeribe indefinitely over an allegation of N22 million fraud.\nDue to popular demand, in December 2006, Nzeribe was defeated by Osita Izunaso during the Peoples Democratic Party (PDP) primaries for the 2007 Senatorial election."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "Low loadouts, after-holiday purchases... NNPC gives reasons for petrol queues in Abuja",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says “low loadouts” at depots are “very likely” contributing to the queues observed at petrol stations in Abuja.\nOver the weekend, queues had surfaced at filling stations in parts of the federal capital territory (FCT).\nLoadouts involve the process of moving petroleum product from depots to filling stations.\n“The NNPC Ltd notes the sudden appearance of fuel queues in parts of Abuja.\nThis is very likely due to low loadouts at depots which usually happen during long public holidays, in this case, the Sallah celebrations,” the statement reads."
  },
  {
    "headline": "Low loadouts, after-holiday purchases... NNPC gives reasons for petrol queues in Abuja",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says “low loadouts” at depots are “very likely” contributing to the queues observed at petrol stations in Abuja.\nOver the weekend, queues had surfaced at filling stations in parts of the federal capital territory (FCT).\nLoadouts involve the process of moving petroleum product from depots to filling stations.\n“The NNPC Ltd notes the sudden appearance of fuel queues in parts of Abuja.\nThis is very likely due to low loadouts at depots which usually happen during long public holidays, in this case, the Sallah celebrations,” the statement reads."
  },
  {
    "headline": "Ganduje endorses his deputy as next Kano governor",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, has endorsed Nasiru Gawuna, his deputy, to become the next governor of the state.\nThe decision was said to have been taken at a recent stakeholders’ meeting of the All Progressives Congress (APC) in Kano.\nAdvertisementMeanwhile, Ganduje is reportedly making plans to obtain the nomination and expression of interest forms to represent Kano north senatorial district.\nThe Kano north senatorial seat is presently occupied by Barau Jibrin.\nGanduje was deputy governor of Kano to Rabiu Kwankwaso for two terms — 1999 to 2003, and 2011 to 2015 — before he became governor of the state in 2015."
  },
  {
    "headline": "Ganduje endorses his deputy as next Kano governor",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, has endorsed Nasiru Gawuna, his deputy, to become the next governor of the state.\nThe decision was said to have been taken at a recent stakeholders’ meeting of the All Progressives Congress (APC) in Kano.\nAdvertisementMeanwhile, Ganduje is reportedly making plans to obtain the nomination and expression of interest forms to represent Kano north senatorial district.\nThe Kano north senatorial seat is presently occupied by Barau Jibrin.\nGanduje was deputy governor of Kano to Rabiu Kwankwaso for two terms — 1999 to 2003, and 2011 to 2015 — before he became governor of the state in 2015."
  },
  {
    "headline": "'Sustain momentum against murderers' -- Buhari commends military on anti-banditry operations",
    "summarized_story": "President Muhammadu Buhari has commended the military on the security operations in the north-west targeted at ending banditry in the zone.\nStates across the north-west have recorded attacks by bandits, which have led to killings, kidnappings and destruction of property, while hundreds of people have been displaced.\nAccording to a statement issued on Sunday by Garba Shehu, presidential spokesman, Buhari asked the troops to sustain the momentum, especially in Zamfara, in order to end the activities of bandits.\nAdvertisement“We mustn’t allow the return of days when the bandits had a free hand to do as they wished,” he was quoted as saying.\n“The rural folk in Zamfara and elsewhere must be allowed to have peace."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "What problems are Y Combinator-backed startups solving in Africa?",
    "summarized_story": "This has significantly changed how African startups operate and, per some founders, helped refine their business processes.\nLittle wonder that 53% (51) of YC-backed African startups (95) are from Nigeria.\nBut the big question remains: What problems are Y Combinator-backed startups solving?\nWhat problems are Africa’s YC-backed startups solving?\nSo far, YC has invested in a whopping 47 Financial Services startups in Africa, almost half of its Africa alumni."
  },
  {
    "headline": "African Startup Gamic Guild made it into Binance Labs Season 4",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Binance Labs has accepted the leading gaming guild in Africa into its incubation program, Gamic Guild to position the guild as the most sought after gaming guild in Africa.\nBinance Labs is excited to help Gamic Guild create massive opportunities, access an extensive network of industry leaders, establish a strong market presence and launch market-fit products and services.\nGamic Guild is poised to bridge that gap in the African GameFi ecosystem and create life-changing opportunities for people.\nGamic Guild is one of the latest startups to join the Binance Labs family.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Aladdin Digital Bank, Closes a Debt-Financing Deal Up to $3.5 Million",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Aladdin Scheme Ltd, the leading Ecosystem Digital bank in Nigeria has announced its successful closing of a debt-financing deal up to $3.5 million.\nIn the last couple of months, Aladdin Digital bank has transformed from a digital bank app to a full scale financial powerhouse for individuals, freelancers and SMEs consistently delivering state of the art digital products on its banking platforms to support their hustle.\nIG: @aladdinbankngFacebook:@aladdinbankngLinkedIn:@aladdindigitalbankBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Domestic airlines dump flight suspension plan",
    "summarized_story": "The Airline Operators of Nigeria (AON) has withdrawn action to suspend flight operations following the increase in aviation fuel.\nAlready airlines that had earlier pulled out of the planned suspension had taken advantage of the passengAll domestic airlines accede to calls from FG, withdraw flight suspensionIFEOMA OKEKE-KORIEOCHAThe Airline Operators of Nigeria (AON) has withdrawn action to suspend flight operations following the increase in aviation fuel.\nAlready airlines that had earlier pulled out of the planned suspension had taken advantage of the passengers’ glut by raising fares by 100 percent.\nAirlines charged between N85,000 to N100,000 for a one hour flight which cost N50,000 two days ago, with a full load factor.\nAirlines charged between N85,000 to N100,000 for a one-hour flight which cost N50,000 two days ago, with a full load factor."
  },
  {
    "headline": "Nigerian travellers to US face rising malaria treatment bill",
    "summarized_story": "According to the centre, severe malaria should be treated with intravenous (IV) antimalarial medications, as the first-line drug for the treatment of severe malaria in the US.\nThe drug used to be supplied to patients on request, free of charge by the CDC as a better standard for treating severe malaria.\nIt was also a replacement for quinidine, a previously used drug produced by Eli Lilly, but which production stopped in 2017.\nRead also: It is cost-effective to prevent malaria says Reckitt marketing directorOnly about 300 people develop severe malaria in the US yearly and artesunate manufactured outside the US cannot be imported.\nMalaria treatment in most African countries costs less than $5."
  },
  {
    "headline": "Six airlines pull out of planned flight suspension, raise fares by 100%",
    "summarized_story": "Six out of 10 member airlines have pulled out of the planned flight suspension on Monday, taking advantage of passengers’ glut by raising fares 100 percent.\nOverland, Green Africa, Ibom Air, Dana Air, Aero Contractors, and Arik Air have disclosed plans to continue with normal flight operations as fares from Lagos to Abuja, Owerri, Calabar, Port Harcourt, Enugu, Kano and Asaba is seeing a rise by 100 percent.\nThe suspension of flight agreement statement which was signed by managing directors of Max Air, United Nigeria Airlines, Ibom Air, Arik Air, Aero Contractors, Azman Air, Overland, Dana Air, and Air Peace, over the rise in aviation fuel price (JetA1) has since seen airlines pull out, citing the impact the action would bring to passengers.\nSirika said the ministry hopes that other members will consider the expected impact on businesses and individuals and review their decision.\nThis was without prejudice to the fact that most of them were heavily indebted to Aviation agencies (as they still are)."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "Edo NEWMAP urges media support in campaign to curb flooding, other environmental hazards – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Coordinator of Nigeria Erosion and Watershed Management Project (NEWMAP), Dr. Tom Obaseki, has canvassed for media collaboration in driving the conversation on flood control as the rains intensify.\nObaseki made the submission at a flood engagement workshop organised by the agency in Benin City, the Edo State capital.\nAccording to him, “The media has a crucial role in spreading information in bridging the knowledge gap and enhancing public awareness.\nThe media chooses which issues to highlight to its viewers and how to frame them, influencing what people perceive to be a priority.\n“We have built a total length of over 40kms of secondary drains."
  },
  {
    "headline": "Master Plan: Obaseki kicks off ‘Operation Plan Edo’ …exercise kicks off in Ugbor area – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced ‘Operation Plan Edo,’ an exercise aimed at recertifying building plans and collecting data on socio-economic needs of communities within the Benin metropolis.\nAccording to her, “The programme enables the government to know what services and infrastructure the people need.\nThe ‘Operation Plan Edo’ will involve various ministries, such as Education, Roads and Bridges, Health, Power, among others”.\nShe called on citizens to cooperate with officials of the ministries and provide necessary information to help plan the city and State in line with the 30-year master plan.\nCondemning attacks on its staff by residents, she warned: “Edo State Government frowns at the attack on Staff of Ministry of Planning, Urban and Regional Planning on duty."
  },
  {
    "headline": "2023: Edo PDP’ll obey party decisions, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state’s chapter of the Peoples Democratic Party (PDP) will obey any decision reached by the party at the national level ahead of the presidential primary election as long as the decision is fair and just.\nHe said, “I believe that you know what the issues are in Nigeria today and have practically touched all of them.\nThere is nothing wrong when you throw your hat in the ring, and you’ve been quite clear and not ambiguous.\nThey also have the privilege to hear from you and know the decision to take when the time comes,” Obaseki noted.\nI know the country very well and the people of the country know me."
  },
  {
    "headline": "U.S. Consulate commemorates World press freedom day with month-long events",
    "summarized_story": "The U.S. Consulate General in collaboration with Media Career Development Network will mark this year’s World Press Freedom Day with multiple events from May 10 to May 27.\nThis is part of the country’s commitment to advocating for press freedom, freedom of information and access to factual and accurate reporting provided by independent media which is foundational to transparency and accountability in any democratic society.\nActivities will begin on May 10 with a screening and panel discussion on the documentary “Joseph Pulitzer: Voice of the People” at the Ikeja American Corner.\nThe month-long press freedom activities will end on May 27 with a reception in honor of journalists working to fight corruption, holding the government accountable, and calling out abuse and injustice, often at great personal risk.\nSpeaking on the activities to commemorate the 29th anniversary of World Press Freedom Day, U.S. Consulate Public Affairs Officer Stephen Ibelli noted that the events will provide an opportunity for journalists to discuss the state of press freedom, protection of journalists, and citizens’ rights to unbiased, accurate information."
  },
  {
    "headline": "President Buhari jets out to Ivory Coast for climate summit",
    "summarized_story": "President Muhammadu Buhari, will today, Sunday, May 8, 2022, leave for Abidjan, Cote d’Ivoire, to attend a United Nations organized conference on the future of land, regarding desertification, drought, degradation, rights, restoration and implications for national and world economies.\nThe convention will explore links between land and other key development issues, which will be discussed during the high-level segment, including a Heads of States Summit, high-level roundtables and interactive dialogue sessions.\nCOP 15 is a key moment in the fight against desertification, land degradation and drought.\nDrought, land restoration, and related enablers such as land rights, gender equality and youth empowerment are among the top items on the Conference agenda.\nPresident Buhari, who is also the President of the Great Green Wall in Africa, will be accompanied on the trip by the Minister of Foreign Affairs, Geoffrey Onyeama, Minister of Environment, Mohammed H. Abdullahi, Minister of Agriculture, Dr Mahmoud Mohammed and Minister of Water Resources, Engr Suleiman H. Adamu."
  },
  {
    "headline": "Just In: Airline operators call off planned shutdown of flight services",
    "summarized_story": "Domestic airline operators under the umbrella of Airline Operators of Nigeria (AON) have called off their planned suspension of flights scheduled to commence on Monday.\nThe AON had on Friday announced a decision to suspend flight operations from Monday.\nIbom Airlines Limited (Ibom Air), on Saturday, became the first airline to counter the AON’s proposed strike, adding that stopping operations will “make a bad situation worse”.\n“Following the recent press statement issued by the Airline Operators of Nigeria (AON), it has become necessary for us to take a stand in the overall interest of our guests, corporate partners, staff and the industry at large,” the statement reads.\n“We acknowledge that the present cost of Jet A1 is unsustainable and should not be passed to the flying public."
  },
  {
    "headline": "Wike to Uzodimma: Accept Supreme Court decision on oil wells in good faith",
    "summarized_story": "Rivers State governor, Nyesom Wike, has called on Hope Uzodinma, his Imo Sate counterpart, to accept the Supreme Court’s judgement that confirmed Rivers ownership of 17 oil wells situated in Akri and Mbede communities in good faith.\nWike in a statewide broadcast at the weekend promised soft landing for Imo saying they would explore ways to accommodate any possible compromise from Rivers Government.\nThe governor blamed Emeka Ihedioha, former governor of Imo State, for the dispute over the oil wells.\nHe said: “It bears repeating that the quest to defend our ownership rights through the courts over the Akiri and Mbede oil wells was not intended to claim victory over Imo or any other state.\nHe said instead of ensuring that NBC did its work, Ihedioha repudiated the subsisted 50:50 per cent sharing formula and also made provocative claims as exclusive owners of the oil wells."
  },
  {
    "headline": "Planned Service Shutdown By Airlines Disturbing, Disheartening – Hayatu-deen",
    "summarized_story": "“This represents more than a 250% jump in price at a time when NBS is reporting official inflation of 15%.\nAs a consequence of this, airlines should be making more money and reinvesting in seat capacity,” Hayatu-deen was quoted as saying.\nHayatu-deen said this was not the case because of pricing distortions and the consequences of a dysfunctional subsidy regime.\n“It is not rocket science to know that jet fuel represents 40% of the direct operating costs of airlines.\nHayatu-deen added Nigerians were already feeling the weight of excruciating economic and social problems, and they do not deserve to be placed under additional unbearable stress."
  },
  {
    "headline": "Yakubu Will Not Join 2023 Presidential Race – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has described claims that the chairman of the Commission, Prof. Mahmood Yakubu, will join 2023 presidential race as false and mischievous.\nIn a statement made available to LEADERSHIP in Abuja on Sunday, the chief press secretary to the INEC chairman, Rotimi Oyekanmi, also described the claim as a preposterous proposition, adding that it will not happen.\nThe nation’s electoral body said the chairman of the Commission remains an umpire committed to free, fair, and credible elections.\nThe statement reads in part: “Our attention has been drawn to innuendoes in certain quarters that Nigerians should not be surprised if the INEC chairman joins the Presidential race or urging him to do so.\nIt is a preposterous proposition."
  },
  {
    "headline": "Minister Advocates Grants For Creative Industry",
    "summarized_story": "The Federal Capital Territory (FCT) Minister of State, Dr. Ramatu Aliyu, has said the only major way the government can make the creative industry attractive to investors and major players is by the provision of various several waivers, grants, tax holidays, rebates and other related incentives.\n“With the return to democracy in 1999, several waivers, grants, tax holidays, rebates, and incentives were given to super industrialists, who embraced all these and have been waxing very strong from available statistics.\n“It, therefore, becomes very logical for us to try these same measures which have worked in the agricultural, manufacturing sectors and see if they wouldn’t also succeed in the creative industry sector.\nMaduekwe, harps on a policy framework that would not only provide the needed opportunities but which could exacerbate the needed impetus to grow the Nigerian creative economy.\nHowever, we believe that with the existence of a policy framework, accessibility to film locations will be achieved with ease,” he stressed."
  },
  {
    "headline": "Minister Advocates Grants For Creative Industry",
    "summarized_story": "The Federal Capital Territory (FCT) Minister of State, Dr. Ramatu Aliyu, has said the only major way the government can make the creative industry attractive to investors and major players is by the provision of various several waivers, grants, tax holidays, rebates and other related incentives.\n“With the return to democracy in 1999, several waivers, grants, tax holidays, rebates, and incentives were given to super industrialists, who embraced all these and have been waxing very strong from available statistics.\n“It, therefore, becomes very logical for us to try these same measures which have worked in the agricultural, manufacturing sectors and see if they wouldn’t also succeed in the creative industry sector.\nMaduekwe, harps on a policy framework that would not only provide the needed opportunities but which could exacerbate the needed impetus to grow the Nigerian creative economy.\nHowever, we believe that with the existence of a policy framework, accessibility to film locations will be achieved with ease,” he stressed."
  },
  {
    "headline": "Emefiele Has Not Violated Any Law By Purchasing APC Presidential Forms – Coalition",
    "summarized_story": "A group, the Coalition of North-Central Youths Vanguard for Emefiele has stated that the governor of Central Bank of Nigeria (CBN), Godwin Emefiele, has not violated any law by purchasing the expression of interest and nomination forms of the All Progressives Congress (APC) to content the presidential election in 2023.\nThe coalition argued that contesting for the position of the president is an exercise of constitutional rights, and not an engagement in any employment or vocation.\nPublicity secretary of the Coalition, Ameenah Hayatudeen, in a statement made available to LEADERSHIP in Abuja noted that the constitution was clear on rights of association, and rights to seek elective positions.\nHayatudeen said there was no impediment whatsoever on the exercise of such rights except such impediments are contained in the constitution.\n“We make bold to ask then from Emefiele’s traducers what then is the natural and ordinary meaning of the word employment?"
  },
  {
    "headline": "JUST IN: Like Ibom Air, Dana withdraws from planned suspension of flight services",
    "summarized_story": "A statement by Dana Air communication and marketing manager, Kingsley Ezenwa, on Sunday, said the Airline will not be joining flight suspension.\nThe statement reads, “following the recent press statement issued by the Airline Operators of Nigeria (AON), it has become necessary for us to take a stand in the overall interest of our guests, corporate partners, staff and the industry at large.\n“While Dana Air agrees with AON, on all the challenges facing domestic airlines in Nigeria and have on many occasions actively participated in the collective and ongoing engagement of relevant authorities on the urgent need to tackle the many issues domestic airlines have been grappling with which includes the skyrocketing cost of Jet A1, we have taken a decision not to join the suspension of flights on May 9, 2022."
  },
  {
    "headline": "BREAKING: Former Nigerian Senator, Arthur Nzeribe, Is Dead",
    "summarized_story": "BREAKING: Former Nigerian Senator, Arthur Nzeribe, Is DeadFrancis Arthur Nzeribe, a former Nigerian senator, has died.\nAccording to NEWS DIRECT, he died early Sunday morning.\nAccording to the source, Nzeribe died in a foreign hospital after suffering from an unidentified illness.\n“He died this morning in a foreign hospital.\nA message from the family will be released soon “according to the source"
  },
  {
    "headline": "BREAKING: Coalition Picks N100m APC Nomination Forms For AfDB President, Adesina",
    "summarized_story": "This is as a coalition of 28 groups consisting of Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities, and other civil society groups, raised the N100 million fee to purchase the forms for the former minister.\nThe coalition is led by the Head, of One Nigeria Group, Mohammed Saleh.\nThe payment acknowledgment slips exclusively seen by our correspondent on Saturday carried Adesina’s name as the recipient of the forms.\nMore to come…"
  },
  {
    "headline": "President Buhari’s Aide Reacts As Abdulmumin Jibrin Dumps APC",
    "summarized_story": "The personal assistant to President Muhammadu Buhari on new media, Bashir Ahmad has reacted after former lawmaker Abdulmumin Jibrin announced his decision to dump the All Progressives Congress (APC).\nThe reaction comes after Jibrin on Saturday announced that he has done his best for the APC and it’s time for him to move on.\nJibrin wrote on Twitter: “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah.\nI will make a formal statement in due course.”Reacting to the tweet, Ahmad wrote: “This is serious!”"
  },
  {
    "headline": "With 3 weeks to June 3 deadline: APC, PDP undecided over zoning of presidential tickets",
    "summarized_story": "The governing APC slated its primaries for May 30/31 in Abuja while the PDP on the other hand holds its presidential convention May 28/29.\nAPCThe indecision by the governing APC over zoning has obviously left the political game open to all presidential aspirants from the North, South-south, South-west and South-east.\n“The party can choose its presidential candidate from anywhere at any point in time.\n“The party is not so bothered about where the presidential candidate comes from.\nSo, this has also put whatever zoning between north and south APC claims into jeopardy."
  },
  {
    "headline": "Breaking: Popular Nigerian politician, Arthur Nzeribe, is dead",
    "summarized_story": "A second republic politician, Arthur Nzeribe, has passed on.\nNzeribe who hailed from Oguta in Imo state reportedly died in a hospital abroad.\nHis family members were yet to make his demise public as at the time of filling this report.\nBorn on November 2, 1938, Nzeribe, remains the longest Senator to represent Imo West at the National Assembly, where the current governor of the state, Hope Uzodinma also represented before contesting his current position.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "2023: INEC chairman opens up on joining presidential race",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC) Prof Mahmood Yakubu has stated that he would not contemplate to join the presidential race as such matters are at variance with the law, morality and his personal principles.\nThis came on the heels of innuendoes in certain quarters that Nigerians should not be surprised if the INEC Chairman joins the presidential race or urging him to do so.\nThe statement said, “Our attention has been drawn to innuendoes in certain quarters that Nigerians should not be surprised if the INEC Chairman joins the Presidential race or urging him to do so.\n“The chairman remains an umpire committed to free, fair and credible elections.\n“The chairman will continue to discharge his responsibilities without affection for, or ill-will against, any political party or candidate.”Share this: TwitterFacebook"
  },
  {
    "headline": "Naira weakens against dollar, exchanges at N419",
    "summarized_story": "Agency reportNaira on Thursday depreciated at the Investors and Exporters window exchanging at N419 to the dollar, 0.24 percent depreciation, weaker than N418 it traded on Wednesday.\nThe open indicative rate closed at N417.40 to the dollar on Thursday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.00.\nThe Naira sold for as low as 410 to the dollar within the day are trading.\nA total of 108.24 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Agency reportOil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "GSM calls, data: Nigerians to pay more",
    "summarized_story": "Based on their proposal, the price floor of calls will increase from N6.4 to N8.95 while the price cap of SMS will increase from N4 to N5.61.\nThis was revealed in a letter titled, ‘Impact of the Economic and Security Issues on the Telecommunications Sector,’ which was sighted by our correspondent.\nThe letter was written by the telecommunications companies under the aegis of the Association of Licensed Telecommunication Operators of Nigeria, ALTCON, to the NCC.\nIn the letter, the telecom companies said there had been a 40 per cent increase in the cost of doing business in the nation.\nThey said this had resulted in an increase in energy costs, increasing their operating expenses by 35 per cent."
  },
  {
    "headline": "Govt, commercial users to pay for using Twitter – Elon Musk",
    "summarized_story": "By Emmanuel ObisueOn the heels of his acquisition of Twitter, billionaire entrepreneur, Elon Musk, on Wednesday said governments and other commercial users may have to pay to use the micro-blogging platform.\nAfter his $44 billion purchase of Twitter, Musk has now hinted that Buhari and other users may have to pay for using the platform.\nConfirming fears by the majority that his takeover might lead to commercialisation of the social media platform, Musk in a tweet in the early hours of Wednesday, said commercial and government users will pay for the platform.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users,” he tweeted."
  },
  {
    "headline": "Naira slides to N589 to $1 at parallel market as FX liquidity crisis persists",
    "summarized_story": "By Agency reportThe free fall of Nigerian naira continued on Wednesday, dropping to N589 against the dollar at the parallel market.\nCurrency traders known as Bureaux De Change operators (BDCs) said that the forex liquidity crisis still persists in the market despite low demands.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira.\nIt may increase the cost of foreign borrowing, force foreign investors to pull out their funds, causing further depreciation of the naira."
  },
  {
    "headline": "UPDATED: Airline Operators Suspend Withdrawal Of Services Hours To Deadline",
    "summarized_story": "The Airline Operators of Nigeria (AON) has suspended its decision to withdraw its services across all airports in the country.\nAON President, Abdulmunaf Sarina, announced the suspension on Sunday in a statement jointly signed by six members of the association.\nOthers are Roy Ilegbodu – Chief Executive Officer of Arik Air; Abdullahi Mahmood – Chief Executive Officer of Aero Contractors; and Allen Onyema – Chairman of Air Peace.\nEarlier, the Ministry of Aviation had assured Nigerians that members of AON were reviewing their decision to withdraw services on Monday, May 9.\nIt confirmed that Ibom Air, Green Africa Airlines, Arik Air, Dana Air, and others said they would carry on with their normal flight schedules."
  },
  {
    "headline": "Bandits Attack Another Zamfara Community, Kill Seven Locals",
    "summarized_story": "No fewer than seven persons have been reportedly killed in Faru, a community in Maradun Local Government Area of Zamfara State.\nThis comes barely two days after a deadly attack in another local government of the state which left at least 48 villagers dead.\nDuring an interview with Channels Television, sources in Faru recounted how bandits invaded the community on Sunday afternoon.\nAnother resident narrated that in the process, seven persons were killed while several others sustained various degrees of gunshot wounds.\nHowever, police authorities in Zamfara have yet to react to the latest attack by bandits in the state."
  },
  {
    "headline": "Buhari Condemns Zamfara Attacks, Asks Military To End Bandits’ Activities",
    "summarized_story": "President Muhammadu Buhari has condemned the recent attacks by bandits on communities in Zamfara State.\nChannels Television had reported that no fewer than 55 people were killed in separate attacks by bandits in four Zamfara communities in three days.\nThe affected communities are Sabon Gari Damri, Damri, and Kalahe – in Bakura Local Government Area, as well as Faru in Maradun Local Government Area of Zamfara.\n“The rural folk in Zamfara and elsewhere must be allowed to have peace.\nThe President, however, decried several breaches recorded recently, especially in view of the latest attacks on the communities where a number of casualties were recorded."
  },
  {
    "headline": "Service Withdrawal: Airlines Operators Have Promised To Continue Operations – FG",
    "summarized_story": "Some members of the Airline Operators of Nigeria (AON) have reviewed their decision to withdraw services across the country from Monday, the Federal Government has assured Nigerians.\nMr James Odaudu, the Special Assistant (Public Affairs) to the Minister of Aviation, Hadi Sirika, disclosed this in a statement on Sunday.\nAhead of the planned withdrawal of services by AON, he stated that at least four of the airline operators have given assurance of continued operations while others were reviewing their decision.\n“We hope that other members will consider the expected impact on businesses and individuals and review their decision.\n“This was without prejudice to the fact that most of them were heavily indebted to aviation agencies (as they still are)."
  },
  {
    "headline": "What FG Is Doing To Ramp Up Nigeria’s Security Architecture – Osinbajo",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, has restated the seriousness with which the Muhammadu Buhari administration is confronting the security challenges in the country.\nHe assured Nigerians that the results and outcomes of the keen efforts of the Federal Government were certainly underway.\nProfessor Osinbajo spoke over the weekend at the Presidential Villa when he received a delegation from the Christ Apostolic Church (CAC) led by its President, Pastor Samuel Oladele, at his Aguda residence on Saturday evening.\n“It’s a huge country and with the security challenges, we need to ramp up resources, men, and equipment,” he was quoted as saying in a statement on Sunday by his media aide, Laolu Akande.\nREAD ALSO: Buhari Condemns Zamfara Attacks, Asks Military To End Bandits’ ActivitiesExplaining the situation further, the Vice President noted that at times, some of these things take some time."
  },
  {
    "headline": "Hong Kong:Pro-Beijing committee elect fmr security chief John Lee as new leader",
    "summarized_story": "An election committee of nearly 1,500 mostly pro-Beijing members after a closed voting process on Sunday elected John Lee as Hong Kong’s next leader.\nLee received 1,416 votes in the election for chief executive, far exceeding the 751 votes required to win.\nHong Kong’s pro-democracy camp has long demanded universal suffrage, which they claim is guaranteed in the city’s mini-constitution, the Basic Law.\nThe election of Lee as Hong Kong’s next leader has raised fears that Beijing will tighten its grip on the territory.\nOver 150 people have been detained under the security law, which criminalises secession, subversion, terrorism, and collusion with foreign forces to meddle in city affairs."
  },
  {
    "headline": "Asiwaju Tinubu Intervenes in Kano APC Dispute -",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has stepped in to resolve the local political squabbles between Abdulmunin Jibrin and key stakeholders in his constituency in Kano State.\nAbdulmumin Jibrin had announced his decision to leave the Kano State Chapter of the APC for an undisclosed party early on Saturday.\nThere had been a crisis of confidence between Jibrin and Kano State Governor, Abdullahi Ganduje, for some time over local political issues.\nAsiwaju Tinubu reportedly reached out to Governor Ganduje to reach a truce and ensure the unity withion the Kano State Chapter of the APC is not ruptured.\nThe source said Asiwaju Tinubu has already intervened on Jibrin’s behalf with Governor Ganduje and everything will be resolved."
  },
  {
    "headline": "Interest Groups obtain APC Nomination Forms for AfDB President, Adesina -",
    "summarized_story": "The President of the African Development Bank and former minister of Agriculture, Dr Akinwumi Adesina has picked up the N100m Expression of Interest and Nomination form for the 2023 presidential election.\nA coalition of 28 groups, led by the Head of One Nigeria Group, Mohammed Saleh, raised the fee to purchase the form for Adesina.\nThey include; Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities and other civil society groups.\nThe former Minister joinsa crowded group of aspirants that have obtained the nomination form.\nSome of those who have obtained the forms are Vice-President Yemi Osinbajo, APC National Leader, Bola Tinubu, the Minister of State for Education, Emeka Nwajuiba; Pastor Tunde Bakare; Jigawa Governor, Mohammed Badaru."
  },
  {
    "headline": "I have not made any decision on Presidential Contest",
    "summarized_story": "Mr Emefiele disclosed this in a statement he issued on his verified twitter handle and personally signed by him.\nSee full statement belowI am humbled by the growing interest of those asking that I run for the Office of President in the 2023 general elections: I have not come to that decision.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds 1/4and offering me Presidential Nomination Forms: I thank them most profusely.\nAnd should I not run for elected office, 3/4I will continue to serve and sacrifice for the good people of Nigeria under the able leadership of President Muhammadu Buhari.\nThis is a serious decision that requires God’s Divine intervention: in the next few days The Almighty will so direct."
  },
  {
    "headline": "‘It’s Immoral For Aspirants to Remain in Office While Contesting In An Election’- Hilliard Etta",
    "summarized_story": "APC Chieftain Hilliard Etta speaks the large number of aspirants who who declared their presidential ambition in the ruling all progressives Congress as well as those who are holding different offices while also aspiring for the most exalted seat in Nigeria."
  },
  {
    "headline": "Nigerian Airlines Reverse Plan to Shut Down Operations",
    "summarized_story": "Nigerian airlines umder the aegis of the Airline Operators of Nigeria (AON) have reversed a planned suspension of operations initially scheduled to start Monday, May 9.\nThe airlines had on Friday served notice of shutting down operations due to the “astronomical hike” in the price of aviation fuel from N190 per litre to N700.\nThe AON also said it considered the national economy and security considerations, in suspending the shutdown of operations “in good faith” pending the outcome of its engagement with government.\nThe statement was signed by its President, Alhaji (Dr.) Abdulmunaf Yunusa Sarina; Executive Director, Max Air, Alhaji Shehu Wada; Chairman, United Nigeria Airlines, Dr. Obiora Okonkwo; and CEO, Arik Air, Capt.\nAbdullahi Mahmood; MD, Azman Air, Alhaji Faisal Abdulmunaf, and Chairman, Air Peace, Barr."
  },
  {
    "headline": "Allen Onyema: Everyone Involved in The Airlines Suspension is Patriotic And Means Well for Nigeria",
    "summarized_story": "Airline operators of Nigeria has planned suspension of local flights over increase in aviation fuel in the country.\nThe suspension will begin on Monday May 9 but some airlines have pulled out of the planned strike but they are not against the Airline operators stand, except that they are concerned about the wellbeing of their customers."
  },
  {
    "headline": "‘Preposterous’: Nigeria’s Electoral Commission Chair Yakubu Dispels Presidential Bid",
    "summarized_story": "Nigeria’s Independent National Electoral Commission (INEC) has dismissed as preposterous insinuations that its chairman, Professor Mahmood Yakubu, will join the 2023 presidential race.\nThe Commission insisted that Yakubu remains an umpire, who is committed to free and fair election and will not stray into matters at variance with the law.\nA statement by the Chief Press Secretary to the INEC Chairman, Rotimi Oyekanmi, reads; “Our attention has been drawn to innuendoes in certain quarters that Nigerians should not be surprised if the INEC Chairman joins the Presidential race or urging him to do so.\nThe Chairman remains an umpire committed to free, fair and credible elections.\n“The Chairman will continue to discharge his responsibilities without affection for, or illwill against, any political party or candidate.”"
  },
  {
    "headline": "Western Officials Visit Ukraine After Deadly School Bombing",
    "summarized_story": "The governor of Luhansk province, one of two areas that make up the eastern industrial heartland known as the Donbas, said the school in the village of Bilohorivka caught fire after Saturday’s bombing.\n“Most likely, all 60 people who remain under the rubble are now dead,” Gov.\nRussian shelling also killed two boys, ages 11 and 14, in the nearby town of Pryvillia, he said.\nThe largest European conflict since World War II has developed into a punishing war of attrition due to the Ukrainian military’s unexpectedly effective defense.\nSince failing to capture Ukraine’s capital, Kyiv, Moscow’s forces have attacked cities, towns and villages in eastern and southern Ukraine but not gained much ground, according to Western military analysts."
  }
]