[
  {
    "headline": "Kyari attributes rising cooking gas price to undersupply",
    "summarized_story": "Kyari gave the assurance while answering questions from journalists during his courtesy visit to the Department of Petroleum Resources headquarters in Abuja on Wednesday.\nHe said, “Today, this country is undersupplied with gas; we can tell you that we are having difficulty filling our network across the country with gas.\nSo that means that once supply is weak, it will affect pricing.\nSo, we are collaborating extensively to ensure that we are able to extract LPG from our gas resources so that it can be made available to the market.\n“To make price more affordable, we are working towards providing more volume of gas into the domestic market."
  },
  {
    "headline": "FG moves to boost trade relations with Gulf countries",
    "summarized_story": "The Ministry of Industry, Trade and Investment has signed a Memorandum of Understanding with the Arabian Chamber of Commerce to facilitate collaboration for the upcoming Expo 2020 Dubai.\nAccording to the Minister of Industry, Trade and Investment, Niyi Adebayo, the MoU will also strengthen business relationships and promote enhanced trade relations between Nigeria and Gulf countries.\nThis was disclosed on Tuesday in a statement titled ‘FG, Nigerian – Arabian Gulf Chamber of Commerce signs MoU to boost trade relations’ issued by the ministry’s Director, Press and Public Relations Unit, Ibrahim Haruna.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Yahaya blames corruption on neglect, indiscipline",
    "summarized_story": "GOMBE State Governor, Muhammadu Yahaya, says Nigeria’s history of corruption is hinged on administrative neglect and indiscipline.\nYahaya stated that he shared the perception of Nigeria’s President, Maj. Gen. Muhammadu Buhari (retd.\n), on the need to eradicate corruption before it rips off the financial prosperity of the state.\nThis is due to decades of administrative neglect and indiscipline.\nFighting corruption is one of the cardinal objectives of the President Muhammadu Buhari administration.”Copyright PUNCH."
  },
  {
    "headline": "We prioritise security over economic benefits — Communications Minister",
    "summarized_story": "Minister of Communications, Dr. Isa Ibrahim PantamiThe Minister of Communications and Digital Economy, Prof. Isa Pantami, has disclosed that the communication sector had priotised security over economic benefits.\n“We have even been compromising the economic progress of our sector because of our aim in supporting security institutions.\n“At any point in time in the telecommunication sector our position is `security takes precedence over economic benefits’.\n“Security is our priority followed by economic benefits.\nHouse Committee Chairman on Communications, Mr Hakeen Adeyemi, while congratulating the EVC, noted that the communications sector had become the major contributor to the nation’s Gross Domestic Product."
  },
  {
    "headline": "OAU dismisses another lecturer for sexual harassment",
    "summarized_story": "Obafemi Awolowo University, Ile-Ife , OAUThe Governing Council of the Obafemi Awolowo University (OAU), Ile-Ife, has dismissed another Lecturer, who was found guilty of sexual demeanour against a female student.\nHe said the action was in line with the institution’s avowed determination to rid the university of any form of sexual intimidation, harassment and or coercion.\n“Due to this, the University council unambiguously declares its zero tolerance to sexual harassment, in any form or guise and applied the appropriate sanctions for such an offence as contained in the University regulation.\n“At several fora, the Vice Chancellor of the Obafemi Awolowo University, Prof. Eyitope Ogunbodede, has reiterated the commitment of his administration to uphold the zero tolerance policy on sexual harassment and other social vices,” the statement read.\nMeanwhile, the University council, under the Chairmanship of Owelle Oscar Udoji, has also pledged to support policies that promote mutual coexistence amongst members of the University Community."
  },
  {
    "headline": "Shared ‘grief and anxiety’, powerful unifying factor in COVID fight – UN",
    "summarized_story": "Opening the event, the President of the General Assembly, Volkan Bozkir, said “the global pandemic has arguably brought humanity closer together”.\nWe must build on this shared sense of grief and anxiety, and work together to not only tackle COVID-19 but all other challenges that stand in our path,” he added.\n“It is a conscious effort by each of us, each moment, to talk, to listen, and to engage.\nThe Assembly president then pointed to the crisis in Afghanistan, saying the international community will have to draw on its “shared sense of humanity, of empathy, of compassion, to go the extra mile and provide necessary humanitarian support”.\nFor him, these are “all vital to maintaining and supporting a culture of peace, particularly when combined with development efforts that empower communities and ease tensions”."
  },
  {
    "headline": "Strike: FG, health workers reach truce",
    "summarized_story": "Recall that JOHESU had earlier issued a 15-day ultimatum to the Federal Government to meet their demands or face strike.\nOn the hazard allowance, Ngige recalled that the Government held four meetings earlier with JOSEHU and NMA alongside their affiliates, but at a point there were areas of departure.\n“On the other hand, the Government is meeting with NMA next week for their separate discussion on hazard allowance.\nGovernment is not delaying the hazard allowance as some people want the public to believe.\nHe added that JOHESU will meet with the Federal Ministry of Health on Thursday to draw up a framework for all the discussions to start."
  },
  {
    "headline": "Ex-NBC Director, Deputy Provost’s children, 2 others abducted in Katsina",
    "summarized_story": "BanditsBy Bashir BelloGunmen suspected to be bandits have launched a fresh attack on Bakori Housing Units in Bakori local government area of Katsina State and abducted a former Director of National Broadcasting Commission, NBC, Ahmed Abdulkadir and his 15-year-old daughter, Laila.\nIn another development, the bandits invaded Isa Kaita College of Education, IKCOE, in Dutsinma where it kidnapped the children of the College’s Deputy Provost and one other.\nJournalists were told that the bandits on Monday night stormed the Bakori residence of Abdulkadir (former General Manager, Katsina State Television, KTTV) and started shooting sporadically before whisking him and his teenage daughter away.\nALSO READ: IPOB members arrested for allegedly killing Ebonyi indigenes ― PoliceIt was also gathered that the bandits kidnapped three other persons who later escaped when the bandits ran into a vigilante group who engaged them in gun battle on their way out of the area.\nMeanwhile, as at the time of filing in this report, the Katsina State Police authorities were yet to make any official statement on the incident."
  },
  {
    "headline": "Herdsmen/farmers clashes: Involve only states interested in grazing reserves – Shehu Sani tells FG",
    "summarized_story": "Former lawmaker representing Kaduna Central Senatorial District, Senator Shehu Sani, on Tuesday, said the atrocities committed by bandits and armed herdsmen will rubbish any thought of reviving grazing routes in Nigeria.\nRecall that President Muhammadu Buhari had in July approved the recommendations of a committee to review “with dispatch,” 368 grazing sites, across 25 states in the country, “to determine the levels of encroachment.”The move, according to a statement by presidential spokesperson, Femi Adesina, was to curb the bloody clashes between herders and farmers across the country.\nHowever, Senator Sani, who wrote on his verified Facebook wall on Tuesday, added that, the federal government should only involve states interested in such projects.\nHe wrote; “The atrocities committed by Bandits and armed herdsmen even in the North makes non sense of any thought or idea of reviving or justifying grazing routes.The FG should only involve states interested in such projects.” [Sic]."
  },
  {
    "headline": "Jigawa: Badaru sacks pension board chairman, Fagam",
    "summarized_story": "Governor Muhammad Badaru Abubakar of Jigawa State has sacked the Executive Secretary, Jigawa State and Local Governments Contributory Pension Scheme Board, Hashim Ahmad Fagam.\nThis was contained in a press statement signed by the State Head of the Civil Service, Alhaji Hussaini Ali Kila and forwarded to DAILY POST.\nThe statement said Fagam was relieved of his appointment with immediate effect.\nThe statement, however, directed the former Executive Secretary to report back to his former MDA (Water Board) for reassignment."
  },
  {
    "headline": "Ex-Air force personnel, 35 others arrested for alleged murder, other crimes in Ebonyi",
    "summarized_story": "The Ebonyi State Police Command, on Tuesday, paraded one Obaji Benjamin, who was an ex-Nigeria Air force personnel and 35 other suspects for alleged murder, fabrication and possession of illegal firearms among other heinous crimes.\nThe Commissioner of Police in Ebonyi State, CP Aliyu Garba, made this known to journalists during the parade of the suspects that took place at the command headquarters.\nCP Garba, also said that the command arrested suspected members of the Indigenous People Biafra, IPOB/ESN for allegedly involving in the murder of seven innocent persons who hail from Ohaozara and Onicha LGAs and settings their cars ablaze ovee sit-at-home order Monday.\nOthers arrested include; Nwankwo Friday ‘m’ 37 years and Eze Desmond ‘m’ 35 years was also for involvement in the manufacturing of a locally made AK-47 rifles and six expanded shells of barretta pistol, among other animations.\nHe said: “We also paraded 35 suspects who were arrested for different offences/recovery of 24 rifles with over 1000 animations/rescue of four (4) abducted little girls who was trafficked to Ghana for prostitution,” he noted."
  },
  {
    "headline": "Akeredolu signs judicial, legislature autonomy bills into law",
    "summarized_story": "Governor of Ondo State, Oluwarotimi Akeredolu has assented to the bills for the financial autonomy of the judiciary and the legislature in the state.\nAkeredolu, who assented to the bill on Tuesday also signed into law the bill for the establishment of the Ondo State House of Assembly Service Commission.\nWith the signing of the bills into law, it would addressed the agitation of the two arms government for financial autonomy.\n“There will be a committee set up under the new law where funds will be distributed for the three arms of government.\nThe Judiciary and Legislative arms of government have also been empowered by these laws to distribute and manage funds allocated to them."
  },
  {
    "headline": "Cholera outbreak: Ogun govt, community differ on death toll",
    "summarized_story": "The Ogun State Government has debunked a claim by the Chairman of the Community Development Committee, CDC, in Magboro, Oluwasegun Oladosu, that about 25 persons had died of Cholera outbreak in the past few days.\nGovernment, however, did not reveal the number of casualties, saying it is still being investigated by public health workers.\nHowever, the Ogun State Government said such number of casualties have not been recorded since the disease broke out.\nDAILY POST reports that Ogun Health Commissioner, Dr Tomi Coker, debunked the report that 25 people died of Cholera in Magboro.\nOn hearing the claim of the community leader that 25 persons had died, the Commissioner exclaimed, saying, “Really!"
  },
  {
    "headline": "Buhari orders sustained action to end insecurity",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhmmadu Buhari has ordered sustained action to end the menace of abduction and killings in the North Central and North Eastern parts of the country.\nHe gave the order at a meeting with the nation’s security chiefs at the Presidential Villa, Abuja, yesterday.\nWe should reinvigorate our efforts, which are yielding results in the North East, South East.\nBut there is more to be done in the North Central, North West, where people are worried and he has intelligence and information that schoolchildren and students are abducted, selective abductions and killings are done.\n“We believe that the spate at which these things are happening in Zamfara State and North central is a source of concern to the government and to all agencies that are responsible for the execution of the operations in the North Central."
  },
  {
    "headline": "Senate begins public hearing on Kalu’s motion on illegal mining, gold smuggling",
    "summarized_story": "From Kenneth Udeh, AbujaThe Senate will on Monday commence a three-day public hearing on illegal mining and gold smuggling and the attendant losses of about $9 billion yearly to Nigeria.\nFormer Nasarawa Governor and Chairman, Senate Committee on Solid Minerals, Mines, Steel Development and Metallurgy, Tanko Al-Makura, is expected to preside over the legislative activity.\nThe senate at its plenary last year had passed a resolution to investigate the losses from illegal mining activities.\nHe also said the country was losing about $9 billion yearly to illegal mining and gold exportation.\nHe lamented the activities of unlicensed miners and incessant smuggling of the solid minerals out of the country by middlemen given the huge revenue losses."
  },
  {
    "headline": "Anambra: INEC to display register of new voters tomorrow",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC), yesterday, said it would display register of new voters for Anambra State election and also ensure they are not disenfranchised.\nChairman of the commission, Prof. Mahmood Yakubu, stated this at the third quarterly meeting with Civil Society Organisations (CSOs) in Abuja, yesterday.\n“In the next two days, the commission will compile the register of new voters and publish same throughout the state for claims and objections.\nThereafter, we will clean up the data, print the PVCs for collection by registrants and compile the actual register of voters to be used in each of the 5,720 polling units in the state.\nOn technology deployment for the Anambra poll, the INEC boss said: “The functionality of the Z-pad has now been integrated into the IVED currently used for voter registration."
  },
  {
    "headline": "Igboho vs FG, DSS: Court adjourns case to Sept 17 for ruling, judgment",
    "summarized_story": "The court said either the ruling or the judgment would be delivered on the case on September 17, 2021.\nThis position was opposed by Igboho’s counsel.\nThe two video clips presented by Igboho’s counsel were tagged: Exhibit Oro 9A and Exhibit Oro 9B.\nThe Exhibit DS2 also showed Igboho’s media aide, Olayori Koiki, where he said Yoruba should prepare for liberation war against the Fulani.\nIt also showed Igboho, where he complained that the Fulani have allegedly been killing, maiming, raping, and destroying farmlands in Yorubaland."
  },
  {
    "headline": "Electronic voting: NASS disappointed me –Archbishop Martins",
    "summarized_story": "BY VIVIAN ONYEBUKWATHE Catholic Archbishop of the Metropolitan See of Lagos, Most Rev.\nAlfred Adewale Martins, has expressed disappointment at the National Assembly for voting against the proposed electronic voting.\nAccording to the bishop, every- body has been looking forward to the issue of electronic voting and electronic transmission of results, but wondered why lawmakers would vote against it.\nThat is what will show people that indeed the government is serious about overcoming the challenge of insecurity as a nation.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Angry CJN Meets 7 CJs, 3 to Face NJC Investigation over Conflicting Orders",
    "summarized_story": "•Warns against granting ex parte orders on political mattersAlex Enumah in AbujaThree State Chief Judges (CJs) will any time from now appear before the National Judicial Council (NJC) to explain why disciplinary action should not be taken against them for alleged issuance of conflicting court orders.\nMuhammad had last week Monday invited some CJs to explain the rationale behind the issuance of contradictory court orders and indiscriminate injunctions by judges in their jurisdictions.\nThe CJN warned the CJs against making newly appointed judicial officers vacation judges and assigning complex cases to inexperienced judges.\nThe CJN advised all Heads of Court to be current on developments in the polity and the judgments delivered by courts of various jurisdictions.\nHe also told them to urgently issue practice direction to guide judges in their various courts to avoid giving conflicting decisions."
  },
  {
    "headline": "VAT Judgment: Court Refuses FG’s Plea for Stay of Execution",
    "summarized_story": "Accordingly, Rivers State Governor Nyesom Wike warned the FIRS against sabotaging the authority of the state to freely administer the VAT in line with the court ruling.\nThe FIRS had following the judgement against it requested the high court to stop the Rivers State government from executing the ruling.\nHe said the state government and the House of Assembly had duly enacted the Rivers State Value Added Tax No.\nHe said Rivers State would not allow further collection of VAT from corporate bodies and businesses operating in the state by the federal government agency.\n“As expected, the federal government, through the FIRS, disagreed and filed an appeal coupled with a request for stay-of-execution of the judgement before the Federal High Court."
  },
  {
    "headline": "NNPC May Float Initial Public Offering in 2024, Kyari Reveals",
    "summarized_story": "The NNPC helmsman explained that the books of the NNPC would need to be to be properly cleaned up, with the proposed NNPC Limited recapitalised, before embarking on such a huge business decision.\nKyari stated, “We will be in a position to consider any IPO in three years’ time.\nHe added that the IPO would put NNPC in an even better position in the oil and gas space.\n“Part of our deal is for the refinery to necessarily buy at least 300,000 barrels of oil from the national oil company.\nKyari noted, “Essentially, many of our customers need our crude for many reasons, quality issues and many other considerations."
  },
  {
    "headline": "Buhari Names Osinbajo Health Sector Reform Committee Chair",
    "summarized_story": "*Adefila is new DG of NCDCDeji ElumoyePresident Muhammadu Buhari has approved the setting up of a Health Sector Reform Committee to commence the development and implementation of a Health Sector Reform programme for Nigeria in collaboration with the State Governments and the FCT administration.\nAccording to a statement issued on Monday by presidential spokesman, Garba Shehu, the setting up of the Committee is sequel to a Health Sector Diagnostic Review Report developed by a consultant, Vesta Healthcare Partners and the Federal Ministry of Health.\nThe committee will undertake a review of all healthcare reforms adopted in the past two decades and lessons learnt and factor them into the development of the new Health Sector Reform Programme.\nOthers in the committee are: Dr Betta Edu (Chairman, Nigeria Health Commissioners Forum representing National Council on Health); President Nigeria Medical Association; President Pharmaceutical Society of Nigeria; President National Association of Nigeria Nurses & Midwives; President Association of Medical Laboratory Scientists of Nigeria ; Mrs Temi Marcella Awogboro ; Dr. Muhammad Sadiq; Dr. Azubike Tagbo and World Health Organization, Nigeria.\nVesta Healthcare Partners and Bill & Melinda Gates Foundation are to serve as resource persons and have observer roles in the committee."
  },
  {
    "headline": "Guinean Coupists to Form Govt of National Unity, Residents Celebrate Conde’s Sack",
    "summarized_story": "The coupists in Guinea have announced that a government of national unity would be created in the country.\nAccording to News Agency of Nigeria (NAN) report, the coup leader, Mamady Doumbouya, said that the new government would be created following consultations and to lead the transition period.\nThe coupists, who seized President Alpha Conde on Sunday, have barred ministers from leaving the country and directedhigh-ranking officials to hand their vehicles and travel documents over to secretariats of agencies they worked for.\nHeavy gunfire was reported near the Presidential Palace on Sunday as the military seized power in the West African country.\nPresident Alpha Conde was later seen in a video sandwiched by soldiers in a vehicle."
  },
  {
    "headline": "LEAKED AUDIO: I Would Have Killed Churchill, My Ex-Husband With ‘Rat Poison’ If We Were Not Divorced—Nollywood Actress, Tonto Dikeh",
    "summarized_story": "Tonto Dikeh, a Nigerian actress, says she would have killed her former husband, Olakunle Churchill with ‘rat poison’ if they were not divorced.\nDikeh has been in a protracted feud with Churchill since they ended their short-lived marriage, a union that has birthed numerous allegations and repeated counterclaims.\nIn a leaked audio exclusively obtained by SaharaReporters and confirmed by different sources, the Nollywood actress said she burnt her former husband’s clothes on several occasions.\nShe said, “I dealt with him, if Churchill slap me once, I slap him ten times before the second slap landed.\nDikeh and Churchill got married in 2015 and the union was blessed with a son."
  },
  {
    "headline": "LEAKED AUDIO: I Would Have Killed Churchill, My Ex-Husband With ‘Rat Poison’ If We Were Not Divorced—Nollywood Actress, Tonto Dikeh",
    "summarized_story": "Tonto Dikeh, a Nigerian actress, says she would have killed her former husband, Olakunle Churchill with ‘rat poison’ if they were not divorced.\nDikeh has been in a protracted feud with Churchill since they ended their short-lived marriage, a union that has birthed numerous allegations and repeated counterclaims.\nIn a leaked audio exclusively obtained by SaharaReporters and confirmed by different sources, the Nollywood actress said she burnt her former husband’s clothes on several occasions.\nShe said, “I dealt with him, if Churchill slap me once, I slap him ten times before the second slap landed.\nDikeh and Churchill got married in 2015 and the union was blessed with a son."
  },
  {
    "headline": "LEAKED AUDIO: I Would Have Killed Churchill, My Ex-Husband With ‘Rat Poison’ If We Were Not Divorced—Nollywood Actress, Tonto Dikeh",
    "summarized_story": "Tonto Dikeh, a Nigerian actress, says she would have killed her former husband, Olakunle Churchill with ‘rat poison’ if they were not divorced.\nDikeh has been in a protracted feud with Churchill since they ended their short-lived marriage, a union that has birthed numerous allegations and repeated counterclaims.\nIn a leaked audio exclusively obtained by SaharaReporters and confirmed by different sources, the Nollywood actress said she burnt her former husband’s clothes on several occasions.\nShe said, “I dealt with him, if Churchill slap me once, I slap him ten times before the second slap landed.\nDikeh and Churchill got married in 2015 and the union was blessed with a son."
  },
  {
    "headline": "REVEALED: Identities Of Residents Killed By Herdsmen In Fresh Attacks On Plateau Community",
    "summarized_story": "The names of three persons who were reportedly killed on Monday, during fresh attacks by suspected Fulani herdsmen in two villages in the Bassa Local Government Area of Plateau State have been revealed.\nFile PhotoNuhu Bitrus Nga, who is the Publicity Secretary of the Miango Youth Development Association, confirmed that the three men were killed at Ruwienku.\nSahara Reporters had previously reported that attacks were carried out in two villages; the first attack occurred on Sunday evening in Kwachudu community where a herder was beheaded.\nIt also reported that hours after the Sunday evening attack, two members of Irigwe group were killed on Monday morning in Ruwienku community in the same local government area.\nThe spokesman for Irigwe Development Association (IDA), Malison David had also accused the Fulani of launching the attack, but the Fulani group denied having hand in the attack."
  },
  {
    "headline": "REVEALED: Identities Of Residents Killed By Herdsmen In Fresh Attacks On Plateau Community",
    "summarized_story": "The names of three persons who were reportedly killed on Monday, during fresh attacks by suspected Fulani herdsmen in two villages in the Bassa Local Government Area of Plateau State have been revealed.\nFile PhotoNuhu Bitrus Nga, who is the Publicity Secretary of the Miango Youth Development Association, confirmed that the three men were killed at Ruwienku.\nSahara Reporters had previously reported that attacks were carried out in two villages; the first attack occurred on Sunday evening in Kwachudu community where a herder was beheaded.\nIt also reported that hours after the Sunday evening attack, two members of Irigwe group were killed on Monday morning in Ruwienku community in the same local government area.\nThe spokesman for Irigwe Development Association (IDA), Malison David had also accused the Fulani of launching the attack, but the Fulani group denied having hand in the attack."
  },
  {
    "headline": "Strike: FG reaches agreement with JOHESU -- after five-hour meeting",
    "summarized_story": "The federal government says it has reached an agreement with members of the Joint Health Sector Union (JOHESU) and the assembly of healthcare professionals association.\nAdvertisementChris Ngige, minister of labour and employment, said this on Tuesday, while addressing journalists at the end of a five-hour meeting with the leadership of JOHESU in Abuja.\nJOHESU had, on September 3, issued a 15-day ultimatum to the federal government to meet their demands or the health workers would embark on a strike.\nAdvertisement“On the other hand, government is meeting with NMA next week for their separate discussion on hazard allowance.\nThe government is not delaying the hazard allowance as some people want the public to believe."
  },
  {
    "headline": "Strike: FG reaches agreement with JOHESU -- after five-hour meeting",
    "summarized_story": "The federal government says it has reached an agreement with members of the Joint Health Sector Union (JOHESU) and the assembly of healthcare professionals association.\nAdvertisementChris Ngige, minister of labour and employment, said this on Tuesday, while addressing journalists at the end of a five-hour meeting with the leadership of JOHESU in Abuja.\nJOHESU had, on September 3, issued a 15-day ultimatum to the federal government to meet their demands or the health workers would embark on a strike.\nAdvertisement“On the other hand, government is meeting with NMA next week for their separate discussion on hazard allowance.\nThe government is not delaying the hazard allowance as some people want the public to believe."
  },
  {
    "headline": "PDP crisis: Governors to meet on Wednesday — third time in four weeks",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) have scheduled a meeting to discuss issues affecting the party.\nMaduabum, director-general, PDP governors forum, disclosed this in a statement issued on Tuesday in Abuja.\nThe meeting will be the third gathering of the PDP governors as a forum within four weeks — in an effort to resolve the leadership crisis in the party.\nAdvertisement“The Chairman of the PDP Governors Forum, Rt Hon.\nUche Secondus, the embattled national chairman of the PDP, has been under increased pressure to resign from office."
  },
  {
    "headline": "PDP crisis: Governors to meet on Wednesday — third time in four weeks",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) have scheduled a meeting to discuss issues affecting the party.\nMaduabum, director-general, PDP governors forum, disclosed this in a statement issued on Tuesday in Abuja.\nThe meeting will be the third gathering of the PDP governors as a forum within four weeks — in an effort to resolve the leadership crisis in the party.\nAdvertisement“The Chairman of the PDP Governors Forum, Rt Hon.\nUche Secondus, the embattled national chairman of the PDP, has been under increased pressure to resign from office."
  },
  {
    "headline": "Pantami: We've been compromising economic progress to fight insecurity",
    "summarized_story": "Isa Pantami, minister of communications and digital economy, says his ministry has been prioritising security over economic benefits.\nHe spoke on his ministry’s contribution to the fight against insecurity during the launch of the NCC’s strategic vision plan (SVP) on Tuesday in Abuja.\n“We have even been compromising the economic progress of our sector because of our aim in supporting security institutions,” he said.\n“At any point in time in the telecommunication sector, our position is ‘security takes precedence over economic benefits’.\nHe said: “When something happens and phone number is involved our function is to transmit that number to security institutions like the police and Department of State Security (DSS)."
  },
  {
    "headline": "How Wave became Francophone Africa’s first unicorn startup with 1% money transfer fee",
    "summarized_story": "Taking on incumbentsSenegal is one of Africa’s fastest-growing mobile money markets, according to a 2020 GSMA report.\nExpresso Telecom, a unit of the UAE’s Expresso Telecom Group Limited, holds 22% of the market share, with over 3 million subscribers.\nAll three telecom firms provide mobile money services under the Orange Money, Free Money, and E-Money brands respectively, and along with banks, dominate the digital financial services space.\nAccording to co-founder Drew Durbin, Wave is building a mobile money service that is “radically affordable”.\nThe startup’s low-cost transaction service has helped it take on incumbents, eat into their market share, and turn the entire mobile money industry on its head."
  },
  {
    "headline": "Arise B.V invests $75m in Ecobank in “landmark” transaction",
    "summarized_story": "Arise B.V, a leading equity investor in Africa, has made an Additional Tier 1 (AT1) investment of about $75 million in Ecobank Transnational Incorporated (ETI), the Togo-based parent company of Ecobank Group.\nA statement from ETI reveals that the AT1 instrument is the first to be issued by Ecobank, adding that Arise’s investment is Basel III-compliant.\nBasel III is an international regulatory accord rolled out by the Basel Committee, which introduced a set of reforms intended to minimise risk and promote stability in the international financial system.\nThe investment, described as a “landmark transaction” in sub-Saharan Africa (SSA), will help Ecobank optimise and improve its Tier-1 capital by $75 million, the company said.\nThe investment firm has indirect banking exposure to over 33 countries in the region with ETI its primary banking investment in Francophone and Anglophone West Africa."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "South Africa’s 5G network might be on shaky ground; here’s why",
    "summarized_story": "But it appears South Africa’s 5G network might be in trouble.\nAdvertisementThree weeks into the five-week lockdown imposed by the government, Vodacom, South Africa’s biggest telco, reported that Internet traffic on its network had seen a 40% jump; MTN South Africa saw a 30% jump.\nTelcos so welcomed this development that South Africa’s biggest telecommunication companies — Vodacom and MTN — launched the 5G network within months of each other.\nAdvertisementSouth Africa’s 5G networkPhoto Credit: <a href=”https://www.flickr.com/photos/26344495@N05/49713123696/”>Ivan Radic</a> Flickr via <a href=”http://compfight.com”>Compfight</a> <a href=”https://creativecommons.org/licenses/by/2.0/”>cc</a>Three companies currently provide 5G services in South Africa: Rain, Vodacom, and MTN.\nIn September 2019, Rain, South Africa’s data-only mobile operator, launched the country’s first commercial 5G network in parts of Johannesburg and Tshwane."
  },
  {
    "headline": "Meet Ruth Iselema, the Bitmama of the African blockchain space",
    "summarized_story": "Enlisting a couple of trader friends, she set out to build a crypto exchange platform but things didn’t work out.\nRuth Iselema of Bitmama (RI): I started learning about blockchain and cryptocurrencies earlier in 2015, through a friend and a couple of Telegram and WhatsApp groups I joined.\nCirca 2018, Ruth Iselema pitches Bitmama at Greenhouse Lab launch day.\nL-R Ruth Iselema, CEO, Bitmama; Akin Asalu, COO, BitmamaMM: Asides talent, would you say there’s an infrastructure gap in the blockchain space?\nI’d also like to say to women reading this that there are many ways to get into the blockchain space."
  },
  {
    "headline": "Fintech escrow service provider, Vahlid, wants to protect your money in online retail transactions",
    "summarized_story": "AdvertisementEnter escrow serviceThere’s an interesting analogy to explain the work of an escrow service provider.\nThat third party is an escrow service provider.\nVahlid, a Nigeria-based fintech startup, is an escrow service provider.\nOnce the buyer certifies that the delivered item matches their order, they pay the seller,” Gbede explains.\n“Right now, escrow service is at the forefront of what we’re delivering to the market."
  },
  {
    "headline": "Can Nigeria stimulate economic growth through railways?",
    "summarized_story": "Over the last year, rail transport appears to have gotten a new lease of life in Nigeria, particularly with the Lagos-Ibadan route that was launched.\nHowever, much of Nigeria’s transportation is done by road, and infrastructure that remains inadequate and in poor condition for most parts.\nThe economic losses due to logistical challenges, which for…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Soaring gas prices test Europe’s resolve to gut emissions",
    "summarized_story": "This November, the United Kingdom will host the United Nations Climate Change Conferences in Glasgow to review countries’ commitments to cut carbon emissions.\nThis comes after gas prices soared, as the UK fired up an old coal power plant, a move that questions the country’s resolve to end use of fossil fuel.\nThe National Grid…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria records highest ever half-year trade deficit as imports surge",
    "summarized_story": "Nigeria’s trade balance took a turn for worse in the first half of 2021 as imports surged and the trade deficit hit N5.81 trillion, according to the foreign trade report by the National Bureau of Statistics (NBS).\nNigeria exported goods worth N7.99 trillion in the review period, opposed to a total import value of N13.8…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki, Onu seek synergy among varsities, research institutions, others to drive nation’s growth, devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu have tasked universities and research institutions to work in synergy in pursuit of the country’s economic prosperity and technological advancement.\nThe duo made the call when the minister paid the governor a courtesy visit at the Government House in Benin City, the Edo State capital.\n“What you have started is the right way to go and we have no choice, but execution is the issue.\nThere is nothing new in this country, but everything said has been written and researched over again.\n“We will no longer allow all these centres of knowledge to work independently, but rather start working together to enable them to carry out good research that will solve the nation’s problems."
  },
  {
    "headline": "COVID-19 3rd wave: Death toll climbs to 26, as four more unvaccinated persons die in Edo – Nigerian Observer",
    "summarized_story": "Head of the state’s COVID-19 Case Management, Dr. Ebomwonyi Osagie, disclosed this on Tuesday during a press briefing at the Government House in Benin City.\n“Over the weekend, we collected a total of 1,273 samples and confirmed 148 cases, four recoveries, and four deaths.\nYou must complete the vaccination; you can’t take one dose and say it is enough but need to complete the dose which protects you from the virus.\nI urge Edo citizens to please show up for their second dose as there is enough for them.\n“Many persons carrying the virus are not down with sickness and don’t have symptoms but yet transmit the virus to people."
  },
  {
    "headline": "Assailants invade police barracks, killed businessman in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Assailants have murdered a businessman in Ogida Police Barracks in Benin City.\nThe spokesman for the command SP Kontongs Bello stated this while confirming the unfortunate incident to our reporter yesterday.\nHe added that the body of the deceased has been deposited in a mortuary in Benin City.\nSP Kontongs assured residents and occupants of the barracks and its neighbourhood of adequate protection of lives and property.\nBlood stains littered the floor when our reporter visited the shop located about 50 metres away from the Superintendent of Police Officers (SPOs) blocks in the barracks."
  },
  {
    "headline": "Schneider Electric Is World’s Most Sustainable Company – Corporate Knights – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Foremost digital transformation of energy management and automation company, Schneider Electric, has been ranked the world’s most sustainable corporation by Toronto based company, Corporate Knights , a media and research company with focus on corporates sustainability performance.\n“We are honoured and grateful to be ranked number one by Corporate Knights.\nThis recognition goes also to all of them.”According to Corporate Knights, Schneider Electric has helped customers manage their energy needs more efficiently and safely.\nCorporate Knights’ 2021 ranking was based on an assessment of 8,080 companies with more than US$1 billion in revenues.\n“If you look back at the last 30 years, particularly between 1989, to 2007, there was no major investment in the power sector."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigerian states groan over debt overhang",
    "summarized_story": "In recent times, the 36 states of Nigeria have also found themselves neck deep in debt.\nThe states have ,in fact, been struggling to survive given that only a few of them can pay salaries as and when due.\nIn fact, the debt status of many states exceed the debt to revenue ratio by more than 100 per cent.\nThe debt to net revenue ratio of the states have put some of the states in even more precarious situations.\nIn fact, observers say that most of them can no longer pay salaries and pensions as at when due."
  },
  {
    "headline": "United States mission welcomes 250 businesswomen for 2021 academy for women entrepreneurs",
    "summarized_story": "The United States Mission on Tuesday, hosted a virtual event to launch the third cohort of the Lagos edition of the Academy for Women Entrepreneurs (AWE), a U.S. government initiative that supports women entrepreneurs around the world.\n“The AWE program connected me to the right networks and resources and my dreams grew bigger.\nIn addition, participants will connect with networks of business leaders, women entrepreneurs and mentors who will facilitate lessons related to business management such as preparing business plans and raising capital.\nTo augment the existing slate of projects focused on women and economic empowerment, the Department of State’s Bureau of Educational and Cultural Affairs (ECA) established the AWE program in 2019.\nA total of 220 women entrepreneurs participated in the 2019 and 2020 cohorts of the U.S. Consulate Lagos AWE program."
  },
  {
    "headline": "Osun: Oyetola inducts 360 newly-recruited Amotekun corps",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola on Tuesday, inaugurated 360 newly-recruited officers into the State Security Network Agency code named Amotekun Corps’.\nWe all have a responsibility to sustain our ranking as the most peaceful state in the nation.\nEarlier In his welcome address, the Chairman, Osun Security Network Agency/Amotekun Corps, Brig.\nHe charged the newly unveiled Amotekun Corps to always exhibit the Omoluabi ethos inculcated in them in the course of the training.\nHe congratulated the Amotekun Corps on the successful completion of the training which according to him will bring about a competent, able and formidable local security network."
  },
  {
    "headline": "CBN says it’s worried about FX supply not naira valuation",
    "summarized_story": "Nigeria’s apex bank, Central Bank of Nigeria (CBN) says it is worried about boosting dollar supply on the currency market and not valuation of the naira.\nThe central bank has devalued the currency three times since March 2020, but the naira has continued to weaken.\nIn June, Central Bank Governor Godwin Emefiele, said Nigeria’s spot naira rate was overvalued by up to 10%, citing the bank’s real effective exchange rate model, according to Reuters.\nMahmud said the spot rate is the reference rate and that he expected a convergence of Nigeria’s several exchange rates, a gap which has frustrated investors.\nOn Tuesday, the naira traded at 411 per dollar on the official spot market, in the range of 407 to 412 naira where it has been since June."
  },
  {
    "headline": "Alleged Freezing Of Kogi Account, A Joke Taken Too Far – Gov Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello, has described the freezing of the state salary bailout account by the Economic and Financial Crimes Commission (EFCC) as a joke taken too far.\nNo Kogi State government’s salary account is frozen.\nAnd I will urge every Nigerian to please go to the Kogi State website, all the facts are there.\nAnd beside that, the bailout fund that we obtained, we appropriated in line with the agreement and understanding between the Kogi State government and the workers.\nWe came to appreciate Mr. President for that magnanimity, and also to congratulate the people of Kogi State, and Nigerians, generally."
  },
  {
    "headline": "Alleged Freezing Of Kogi Account, A Joke Taken Too Far – Gov Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello, has described the freezing of the state salary bailout account by the Economic and Financial Crimes Commission (EFCC) as a joke taken too far.\nNo Kogi State government’s salary account is frozen.\nAnd I will urge every Nigerian to please go to the Kogi State website, all the facts are there.\nAnd beside that, the bailout fund that we obtained, we appropriated in line with the agreement and understanding between the Kogi State government and the workers.\nWe came to appreciate Mr. President for that magnanimity, and also to congratulate the people of Kogi State, and Nigerians, generally."
  },
  {
    "headline": "We Must Strike A Balance In Tackling Hate Speech, Fake News – Gbajabiamila",
    "summarized_story": "Gbajabiamila said parliaments must find in all regulatory or legislative interventions, a balance between protecting the right to free speech and the right to life, peace and dignity.\nAccording to him, proper and legal means should be followed in countering hate speech and misinformation both off and online so as not to tamper with the rights of citizens to free expression.\nADVERTISEMENTGbajabiamila spoke on Tuesday on the topic, ‘Countering Misinformation and Hate Speech On and Offline Requires Stronger Regulations’, at the Fifth World Conference of Speakers of Parliament taking place in Vienna, Austria.\n“To do otherwise will be an abdication of the role of government in a free society, and that is not only unacceptable but also a dereliction of duty.\nOther speakers of Parliaments that spoke at the session supported the idea of regulating the space for hate speech and misinformation while emphasising the need to protect freedom of expression."
  },
  {
    "headline": "We Must Strike A Balance In Tackling Hate Speech, Fake News – Gbajabiamila",
    "summarized_story": "Gbajabiamila said parliaments must find in all regulatory or legislative interventions, a balance between protecting the right to free speech and the right to life, peace and dignity.\nAccording to him, proper and legal means should be followed in countering hate speech and misinformation both off and online so as not to tamper with the rights of citizens to free expression.\nADVERTISEMENTGbajabiamila spoke on Tuesday on the topic, ‘Countering Misinformation and Hate Speech On and Offline Requires Stronger Regulations’, at the Fifth World Conference of Speakers of Parliament taking place in Vienna, Austria.\n“To do otherwise will be an abdication of the role of government in a free society, and that is not only unacceptable but also a dereliction of duty.\nOther speakers of Parliaments that spoke at the session supported the idea of regulating the space for hate speech and misinformation while emphasising the need to protect freedom of expression."
  },
  {
    "headline": "Int’l Literacy Day: FCT ERC Steps Up Campaign For Mass Literacy",
    "summarized_story": "The Federal Capital Territory Education Resource Centre (FCT ERC) said adequate measures have been put in place to promote and enhance mass literacy education in the Territory.\nThe Director, FCT ERC, Hajiya Neemat Abdulrahim, stated this in Abuja while speaking with journalists on the occasion of this year’s International Literacy Day.\nADVERTISEMENTAccording to her, various divisions such as Guidance and Counseling, Curriculum Development, Teachers’ Development, Instructional Material, Library and ICT, among others, are aimed at boosting literacy and reduce the level of iliteracy among pupils, students, teachers and other stakeholders in the FCT.\nShe explained that the recently concluded Literacy holiday programme for pupils and the Almajiri Literacy Training were part of laudable academic activities of the Centre with the main objective of ensuring educational development in the FCT.\nWhile reiterating the commitment of FCT ERC towards qualitative literacy and academic programmes, Hajiya Neemat Abdulrahim advised parents to develop keen interest in the educational development of their children and wards."
  },
  {
    "headline": "Sunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to Nigeria",
    "summarized_story": "Sunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to NigeriaSunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to NigeriaYoruba Nation activist, Sunday Adeyemo, popularly known as Sunday Igboho, has expressed confidence in gaining freedom if returned to Nigeria by Benin Republic.\nIn leaked audio obtained by The PUNCH and confirmed by multiple sources, Igboho said he does not mind being detained like Nnamdi Kanu.\nHe alleged that he was abandoned by lawyers who collected a huge amount of money from him in Benin.\nWhen I insisted that the detention facility that I was kept here should be changed, they were forced to change it.\n“If they want to return me to Nigeria, they should go ahead."
  },
  {
    "headline": "Sunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to Nigeria",
    "summarized_story": "Sunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to NigeriaSunday Igboho declares in leaked audio: I am no longer afraid of anyone, Benin should return me to NigeriaYoruba Nation activist, Sunday Adeyemo, popularly known as Sunday Igboho, has expressed confidence in gaining freedom if returned to Nigeria by Benin Republic.\nIn leaked audio obtained by The PUNCH and confirmed by multiple sources, Igboho said he does not mind being detained like Nnamdi Kanu.\nHe alleged that he was abandoned by lawyers who collected a huge amount of money from him in Benin.\nWhen I insisted that the detention facility that I was kept here should be changed, they were forced to change it.\n“If they want to return me to Nigeria, they should go ahead."
  },
  {
    "headline": "Akume to Ortom: Pay salaries, address other issues",
    "summarized_story": "MINISTER of Special Duties and Intergovernmental Affairs, Senator George Akume, on Monday, insisted that all the leaders of the Benue State chapter of the All Progressives Congress, were asking from the state Governor, Samuel Ortom, for accountability.\nAkume said this while speaking to a crowd of APC members at the City Bay in Makurdi.\n“We have learned that a new chapter has been added to the governance structure in Benue State and that is the compendium of lies and innuendos.\n“What we crafted we thought was in the best interest of Benue State and we expected the governor to carefully go through the documents and see the remedial measures.\nBut in this world of ours, demons become saints and saints are demonised; such is life.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Akume to Ortom: Pay salaries, address other issues",
    "summarized_story": "MINISTER of Special Duties and Intergovernmental Affairs, Senator George Akume, on Monday, insisted that all the leaders of the Benue State chapter of the All Progressives Congress, were asking from the state Governor, Samuel Ortom, for accountability.\nAkume said this while speaking to a crowd of APC members at the City Bay in Makurdi.\n“We have learned that a new chapter has been added to the governance structure in Benue State and that is the compendium of lies and innuendos.\n“What we crafted we thought was in the best interest of Benue State and we expected the governor to carefully go through the documents and see the remedial measures.\nBut in this world of ours, demons become saints and saints are demonised; such is life.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nnamdi Kanu demands N5B from Buhari's govt, court fixes hearing date",
    "summarized_story": "Justice K. C. J. Okereke of the Abia High Court has fixed 21 September for hearing of the N5 billion suit instituted by Nnamdi Kanu leader of the Indigenous People of Biafra, against the Buhari administration and its officials.\nIn suit no HIH/FR14/2021 filed today by his lawyer, Aloy Ejimakor, Kanu demands compensation from the government over infringements of his fundamental human rights.\nKanu wants them to pay him N5 billion in damages, being monetary compensation for the “physical, mental, emotional, psychological and other damages” suffered as a result of the alleged infringements of his fundamental rights.\nAt the mention of the case today, Kanu secured an order from the court to serve by substituted means an application for enforcement of the fundamental rights of Kanu.\nKanu, who is currently in DSS custody was kidnapped in Kenya in June and then flown to Nigeria to continue the treason trial against him."
  },
  {
    "headline": "Kylie Jenner confirms second baby with Travis Scott [Video]",
    "summarized_story": "Kylie Jenner confirmed speculations she and rapper hubby, Travis Scott are expecting their second baby.\nAnd she did the announcement with a short video, with various clips: pregnancy test, the result of which she shared with her mum, who then announced gleefully: ‘You are pregnant !’.\nKylie also showed her baby bump in the video, that came with cryptic caption: 🤍🤰🏻 @travisscottLast month, PEOPLE reported that the 24 year-old businesswoman and model was expecting a second child, with Travis Scott.\nThe couple recently got back together after splitting in October 2019.\nTheir first child Stormi is three years old."
  },
  {
    "headline": "APC Crisis: Police Arrest State Chairman, Ben Nwoye",
    "summarized_story": "The Enugu State Caretaker Committee Chairman of the All Progressives Congress (APC) Dr. Ben Nwoye was on Tuesday arrested by the police.\nNews Direct learnt that the chairman was arrested over an alleged petition by former Senate President, Ken Nnamani.\nThe party’s crisis took another dimension after the ward congress of the party in the State, with parallel exercise conducted in the 260 wards.\nNwoye told reporters after he was released that “I was arrested based on the petition from Ken Nnamani.\nIt is part of the plot going on in the state to wrest the soul of the APC, but they have failed.”"
  },
  {
    "headline": "JUST IN: Identities Of Residents Killed By Herdsmen In Fresh Attacks On Plateau Community",
    "summarized_story": "The names of three people who were purportedly killed on Monday in two villages in Plateau State’s Bassa Local Government Area by suspected Fulani herdsmen have been disclosed.\nA source told SaharaReporters that the victims were; Gya Evi, 60 years old; Sunday Nah, 45 years old; and Friday Yakubu; 40.\nNuhu Bitrus Nga, who is the Publicity Secretary of the Miango Youth Development Association, confirmed that the three men were killed at Ruwienku.\nIt also reported that hours after the Sunday evening attack, two members of Irigwe group were killed on Monday morning in Ruwienku community in the same local government area.\nThe spokesman for Irigwe Development Association (IDA), Malison David had also accused the Fulani of launching the attack, but the Fulani group denied having hand in the attack."
  },
  {
    "headline": "How Plateau Government Unleashed Drunken Policemen On Youths Leading Peaceful Procession Over Killings",
    "summarized_story": "The Coalition for Revolution (CORE) has condemned the Plateau State government for alleged suppression of a peaceful memorial procession led by the youths of the state on Tuesday.\nIt noted that drunken policemen, however, dispersed the youth acting on the orders of the Plateau State government.\nCORE urged trade unions, civil society organisations, associations and all bodies in Plateau state, Nigeria and across the world to stand against state repression in Plateau state and across the country.\n“They were acting on the order of the Plateau state government.\nWe call on trade unions, civil society organizations, associations and all bodies in Plateau state, Nigeria and across the world who stand for peace and justice to raise their voices and stand up against state repression in Plateau state and across the country."
  },
  {
    "headline": "Buhari Not Welcome In Imo – IPOB Orders Sit-At-Home Over President’s Planned Visit",
    "summarized_story": "President Muhammadu Buhari is not welcome in the Southeast, according to the Indigenous People of Biafra, IPOB.\nIPOB Director of Socials, Chika Edoziem, made the remark while ordering a sit-at-home in protest of Buhari’s visit to Imo State on Thursday.\nEdoziem, who is one of IPOB executives, disclosed this during a broadcast on Monday evening.\nAccording to Edoziem: “Nigeria’s president is not welcome in Imo State, Biafra Land on Thursday, September 9, 2021.\n“All the traditional rulers, all ndi iche and every Biafran should stay away from any ceremony organised by Hope Uzodimma to welcome him.”Governor Hope Uzodinma of Imo State had disclosed Buhari’s plans to visit the state."
  },
  {
    "headline": "N-Power batch C employment: Here are things to know on physical verification, PPA enrollment",
    "summarized_story": "Late PPA enrollment simply means a situation whereby a deployed Npower beneficiaries refused to complete his or her deployment process on time.\nYou might be replaced because many other applicants are waiting on the list so endeavor to complete your deployment exercise.\nThis analysis was based on what the previous Batches went through during their enrollment exercise.\nSince the batch C Programme has new management, they might handle the enrollment exercise differently though.\nSo as an Npower batch C beneficiary, make sure you follow the deployment exercise to the letter to avoid any of the listed things above."
  },
  {
    "headline": "Breaking: Super Eagles squeeze victory vs Cape Verde in 2020 FIFA World Cup qualifier",
    "summarized_story": "Nigeria’s Super Eagles on Tuesday evening fought back to claim the maximum points after beating the Blue Sharks of Cape Verde in the second 2020 FIFA World Cup qualifying match.\nThe Nigerian senior national men team with this result has remained top of Group C with two wins out of two group games.\nAlready, the players have N20m ($48,733) promised them by their official partners Air Peace.\nPrior to the match, the Chairman of one of the country’s biggest airlines, Allen Oyema, had pledged N20 million if they defeat Cape Verde.\nLiberia, in second place, are three points behind the Eagles, while both Cape Verde Islands and the Central African Republic have just a point each."
  },
  {
    "headline": "Happening now: Watch as Victor Osimhen secures vital equaliser for Super Eagles vs Cape Verde’s Blue Sharks in 2022 FIFA World Cup qualifying match (Video)",
    "summarized_story": ""
  },
  {
    "headline": "PFN urges Christians to leverage on electronic process",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) has called on Christians to take advantage of the electronic voting system introduced by Independent National Electoral Commission to elect credible members to power.\nThe PFN Chairman South-South, Apostle Zilly Aggrey of Royal House of Grace made the call at the Social Security Outreach program, at Greater Evangelism worldwide Crusade, Opolo Yenagoa.\nHe said, “the christians should take advantage of having a voters card, most especially now, they have started electronic registration of voters card, and INEC came to explain point by point how our people can access the site and the form is registration.\nI want to appreciate the INEC for this initiative."
  },
  {
    "headline": "Fulani group dares southern governors, says anti opening grazing law satanic – NigPilot",
    "summarized_story": "Fulani socio-cultural group, Miyetti Allah Kautal Hore has described the anti-opening grazing law as satanic and a unanimous decision of southern governors to destroy pastoralists means of livelihood.\nMiyetti Allah group disclosed this in Masaka community, Abuja suburb on Monday at a press briefing, jointly delivered by its national president, Alh.\nHe further called for proper funding of the National Commission for Nomadic Education and the expansion of its mandate.\n“This oppressive laws and hostile policies being enacted by state governors are fundamentally going against the Fulani Pastoralist culture, economic interest and constitutional rights.\n“To this effect any action taken by any state Assembly that is in conflict with an above section of the 1999 Constitution as amended is null and void."
  },
  {
    "headline": "NITDA graduates 200 kids in emerging technologies – NigPilot",
    "summarized_story": "National Information Technology Development Agency, NITDA has graduated 200 kids from its Science, Technology, Engineering and Mathematics (STEM) Boot Camp for Kids (SB4KIDS) 2021 edition to further ensure that Nigeria becomes a digitally proficient economy.\nKashifu said NITDA had through its National Centre for Artificial Intelligence and Robotics (NCAIR) embarked on a two weeks training for kids on STEM Education, which is a yearly initiative, normally conducted during the summer school holidays.\n‘‘We at NITDA believe that the early involvement of youngsters in technology and innovation will accelerate the development of the technology sector and create future technology leaders who will transform the Nigerian technology space and boost the Nigerian Digital Economy.\nThe first three (3) from each batch will receive a laptop, while all the twenty (20) selected winners will receive a STEM kit that will help them with their STEM education journeys.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Katsina Banditry: 19 LGA flashpoints identified as phone charging business outlets suspended – NigPilot",
    "summarized_story": "AS part of continuous measures in tackling insecurity, Governor Aminu Bello Masari of Katsina State has an Executive order No 4, announced the suspension of business outlets engaging in phone charging business in the banditry prone areas of the state.\nHe also identified Nineteen, 19, local government areas as bandit’s flashpoints.\nThe Governor made this known while inaugurating the committee on Monitoring and Enforcement of the Security Challenges (Containment) Order today, Monday.\nThe Nineteen local government areas that were identified by Governor Masari as the flashpoint areas are where the committee is expected to beam their searchlight.\nThe Katsina State Commissioner of Police, CP Sanusi Buba is the Chairman while the Secretary to the State Government, Mustapha Inuwa will serve as secretary of the committee respectively."
  },
  {
    "headline": "Find Tactics To Solve Security Challenge, Buhari Tells Service Chiefs",
    "summarized_story": "﻿President Muhammadu Buhari has directed security chiefs to find tactics to solve the security challenges in the country, particularly in the North-West and North Central.\nThe President issued the directive on Tuesday, during a three-hour security meeting with Service Chiefs at the Presidential Villa in Abuja.\nHe reiterated the urgent need to deal with the bandits, who according to the security chiefs, are becoming a nuisance, killing and making reckless pronouncements to solicit attention.\nThe security meeting was chaired by the President with the service chiefs physically in attendance.\nThe Service Chiefs were led by the Chief of Defence Staff, General Lucky Irabor; Minister of Defence, General Bashir Magashi (rtd)."
  },
  {
    "headline": "Dealing With Bandits Easier Since Telecom Services Shutdown, Says Zamfara Commissioner",
    "summarized_story": "﻿The Zamfara State Commissioner for Information in Zamfara State, Ibrahim Dosara, says the military onslaught against the bandits is yielding tremendous success especially since the shutdown of telecoms services in the state.\n“Zamfara State Government in efforts to ensure the crashing of the bandits has requested for the closing down of all networks in the state and this has been effective,” he said.\nSpeaking further, the Commissioner said other measures have also been taken based on credible information and intelligence available to the government.\n“These include the immediate closure of the following places suspected to be habouring bandits and their collaborators,” Dosara said.\nThe abduction occurred 11 days after students abducted from the College of Agriculture in Bakura, Zamfara, regained freedom."
  },
  {
    "headline": "Super Eagles Beat Cape Verde 2-1 In World Cup Qualifier",
    "summarized_story": "The Super Eagles of Nigeria have beaten the Blue Sharks of Cape Verde 2-1 in the World Cup Qualifiers in Mindelo.\nVictor Osimhen’s strike and Kenny Rocha Santos’ own goal helped Nigeria come from behind to beat Cape Verde in their qualifying game.\nFive minutes later, Ryan Mendes tried to test the Super Eagles shot-stopper with another shot but it went off target.\nMeanwhile, the Minister of Sports, Sunday Dare has commended the Super Eagles on their second consecutive win of the 2022 World Cup qualifiers.\nWe must keep fighting and working hard until the World Cup ticket is firmly in our hands.”"
  },
  {
    "headline": "#EndSARS Protests: Police Recount Losses As ACP Testifies Before Lagos Panel",
    "summarized_story": "The Lagos State judicial panel on restitution for victims of SARS-related abuses and other matters, today, listened to the testimony of Oludotun Odubona, an Assistant Commissioner of Police in charge of operations at the State Police Command.\nACP Odubona recounted how the #EndSARS protests which started around October 8, grew to become a well-coordinated movement, with gatherings across the state, including one at the police command, the government house in Alausa, the Lekki/Ikoyi link bridge and the Lekki Toll Gate.\nHe also recounted how the protests started to turn violent such that the Governor of Lagos, Babajide Sanwo-Olu had to be protected and whisked away on October 13 when he addressed protesters gathered at the toll gate.\nACP Odubona also said that on October 19, the protests had turned very violent, and there was a need to protect police facilities, so that the armoury wouldn’t be looted.\nHe mentioned areas where the attacks took place to include, Orile, Surulere, Apongbon and EbuteEro."
  },
  {
    "headline": "NARD Strike: FG Insists No Doctor Is Being Owed Monthly Salary",
    "summarized_story": "The Minister of Labour and Employment, Chris Ngige, has said that contrary to what he described as propaganda by the striking members of the National Association of Resident Doctors (NARD), no doctor or health worker in Nigeria is owed their monthly salary.\nAccording to him, the “fumes from the propaganda machine of NARD were obfuscating the reality of the Federal Government’s efforts to re-position the health sector”.\n“NARD goes about telling Nigerians that government is oweing them salaries and that government is not taking the problems in the health sector serious.\nNo doctor, nurse, pharmacist or any other health worker including the driver is owed monthly salary.\nPresident of JOHESU, Josiah Biobelemonye said his union was “the patient dog of the health sector” and pressed for the swift tackling of the challenges facing its members, to avoid forcing them to strike."
  },
  {
    "headline": "Ogun commences four months free business registration",
    "summarized_story": "Ogun State Government has launched Business Premises Registration Portal just as it has also commenced free registration of businesses on the Portal till December 31, 2021.\nOgun State Governor, Dapo Abiodun while speaking during the virtual launch at Ogun TechHub, Kobape Road, Abeokuta, said it became imperative due to formulation of different reforms and digitisation of business registration process.\nRepresented by the Chairman, State Business Environment Council, who doubles as the Commissioner for Finance, Dapo Okubadejo, Governor Abiodun disclosed that the Business Premises Registration Portal would serve as an avenue to plan for infrastructure, security, power, management of the environment and other facilities for businesses to thrive in the State.\nOn her part, Commissioner for Industry, Trade and Investment, Kikelomo Longe said with the launch of the Portal, the State business registration process would be fully automated, easier and reduce cost,"
  },
  {
    "headline": "Saudi Arabia has been kind to us, says President Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday played host to the Saudi Arabian Minister of Foreign Affairs at State House, Abuja, declaring that the oil rich kingdom has been quite kind to Nigeria.\nReceiving Prince Faisal Bin Farhan Al-Saud, the President said with Nigeria’s large population and infrastructural deficit, the country needed all the revenue she could get from oil, a mainstay of the economy, “and Saudi Arabia has been very kind to us, making sacrifice by reducing production to accommodate us a number of times.”President Buhari noted that the relationship between the two countries is very strong, “and dates back in time, both at the personal and national levels.”“It is long and steadfast,” the President added.\nPrince Al-Saud brought greetings from King Salman bin Abdulaziz Al-Saud, saying the Kingdom appreciates the relationship with Nigeria, “which dates back 61 years, and we want to strengthen it even further.”The two countries, he said, have good prospects both economically and politically, not just among the leaders, but also the people.\n“There’s still a lot we can do together,” the Prince submitted."
  },
  {
    "headline": "NPFL Super 8 Tournament kicks off in Enugu",
    "summarized_story": "The Curtain raiser in the Nigerian Professional Football League Super 8 Club tournament in Enugu between Gombe United and Elkanemi Warriors has ended in a 1-1 draw.\nThe Second match between Bendel Insurance and Shooting stars of Ibadan is currently underway.\nThe super 8 match is a division 2 mini league tournament to determine who progresses to the Premier League comprising of 8 teams, Grouped into two groups of 4 teams each.\nGroup A is for the Northern teams while the Other group comprises of 4 teams from the Southern part of the Country.\nThe top two teams from each group will be promoted to the top division of the premier league."
  },
  {
    "headline": "1200 Corp Members sworn in for Orientation Course in Benue -",
    "summarized_story": "The Director General of NYSC, Brigadier General Shuaibu Ibrahim, has called on the 2021 Batch B Stream 2 Corps members to familiarize themselves with the contents of the NYSC Act and the Bye- Laws.\nThe DG who spoke through the NYSC Benue State Coordinator, Abe Ashumate, gave this advise during the Oath- taking/ swearing- in Ceremony of the Batch B stream 2 Corps members deployed to Benue State.\nThe youth Corp members were urged to take cognisance of the reality of COVID-19 pandemic and encouraged them to present themselves for the Vaccines, which he stressed, are harmless.\nEarlier, Oath of Allegiance was administered on the prospective corps members by the representative of the Honourable Chief Judge of Benue State, Honourable Justice Odinya .\nOne thousand two hundred Corps members were successfully sworn- in for the 2021 Batch B stream 2 orientation course in Benue State."
  },
  {
    "headline": "Nigeria: EFCC Arraigns Bureau de Change Operator for $100K Fraud in Maiduguri",
    "summarized_story": "A Bureau de Change Operator in Maiduguri, Bukar Mohammed, has been arraigned by the Economic and Financial Crimes Commission (EFCC) before the Justice Aisha Kumaliya’s Borno State High Court on a one-count charge of obtaining by false pretence to the tune of N43.3 million (about $100K).\nThe defendant allegedly converted the money entrusted in his custody for safe keeping to his own personal use.\nProsecution counsel, Fatsuma Muhammed asked the court to remand the defendant in prison custody and fix a date for trial to commence.\nJustice Kumaliya adjourned the matter till September 14, 2021 for commencement of trial and ordered the defendant remanded in the correctional facility.\nMichael Olugbode in Maiduguri"
  },
  {
    "headline": "Nigeria’s Super Eagles Edge Cape Verde’s Blue Sharks in Qatar 2022 Qualifier",
    "summarized_story": "Captain Ahmed Musa celebrated his 100th cap for Nigeria with a precious win that took the Super Eagles to a firm position at the top of Group C of the African race of the FIFA World Cup Qatar 2022.\nTwo minutes later, an alert Victor Osimhen would pull Nigeria level, stabbing home from close range after the goalkeeper punched following a defensive blunder.\nIn the second half, Ahmed Musa latched onto a centre by Osimhen as the Eagles pushed forward, but his tame shot was easily collected.\nSubstitute Onyekuru was also guilty of putting too low a purchase on his shot in the 73rd minute as Nigeria streamed to the opposition area.\nThe goal put Nigeria in front and eventually gave the Super Eagles the three points on the night."
  },
  {
    "headline": "Nigeria, Saudi Arabia to Improve Relationship and Collaboration",
    "summarized_story": "Governments of Nigeria and Saudi Arabia has expressed willingness to improve on their bilateral relationship and collaboration in international politics.\nHe said that this will assist Nigeria and Saudi Arabia to identify areas of trade and bilateral relationship.\nAlso speaking, the Saudi Arabia Minister confirmed that they had fruitful discussion that will mutually benefit both nations.\nHe said the bond of brotherhood between Nigeria and Saudi Arabia is really strong and that both countries can build on this for greater relationship.\nHe disclosed that both nations would be meeting very soon to further build on the existing business and trade relationship."
  },
  {
    "headline": "Taliban Form All-male Afghan Government of Old Guard Members",
    "summarized_story": "Near daily flights from Qatar bring in humanitarian aid, but the needs are massive, and the Taliban can hardly afford isolation.\nSince taking over Afghanistan in mid-August after U.S. troops withdrew, the Taliban have shown no indications they will hold elections.\nThe interim prime minister, Mullah Hasan Akhund, also headed the Taliban government in Kabul during the last years of its rule.\nIt’s too difficult for me.”A journalist from Afghanistan’s popular TOLO News was detained for three hours by the Taliban before being freed.\nOn Saturday, Taliban special forces in camouflage fired their weapons into the air to end a protest march in Kabul by women demanding equal rights."
  },
  {
    "headline": "WFP Needs $426m Emergency Fund To Curb Hunger Crisis In Ethiopia",
    "summarized_story": "As more than 13.6 million people across Ethiopia are estimated to be food insecure, the World Food Program would need $426 million emergency funding over the next six months to feed millions of people in the country.\nThe intervention by WFP would also include 5.2 million people in Tigray, a region that has been in conflict for the past ten-months.\nFood crisis has been fueled by a conflict between federal forces and troops from the northern Tigray region that erupted in November and has spread into the neighboring Afar and Amhara regions.\nTens of thousands of farmers have fled their land, missing the agricultural planting season in many parts of Tigray.\nIt was noted that failure to address the hunger crisis could risk broader civil unrest."
  }
]