[
  {
    "headline": "Enforce banditry proscription order, Reps urge security agencies",
    "summarized_story": "By Levinus NwabughioguThe House of Representatives, Thursday, called on the Nigerian Army, Police and other security agencies to enforce the proscription order, which declared the activities of bandits as acts of terrorism.\nThe resolutions followed the consideration of a motion of urgent national importance sponsored by Bem Mzondu.\nMoving the motion, Mzondu emphasized the need to stop the renewed terrorist attacks and gruesome killings by armed herdsmen and bandits in Benue communities.\nFor the past two months, I have not heard of any case of COVID-19 in Nigeria or abroad.\nI want to beg that we should continue to comply with the regulation set for our country and the world."
  },
  {
    "headline": "[Breaking] Bamise murder: Court remands BRT driver for 30 days",
    "summarized_story": "By Onozure DaniaLagos- A Yaba Chief Magistrates’ Court on Friday remanded a bus rapid transit (BRT) driver, Mr. Andrew Nice, for 30 days over his alleged involvement in the death of his passenger, Oluwabamise Ayanwole.\nThe court made the order following an application by the Police.\nPolice counsel Yetunde Cardoso, who filed the application based on a four-count charge of alleged murder, sexual assault, misconduct and interference with a corpse.\nBamise, 22, was found dead last Monday on Carter Bridge, Lagos Island nine days after she was declared missing after she boarded Nice’s vehicle."
  },
  {
    "headline": "NURTW crisis: Sanwo-Olu’s appointment of MC Oluomo as head Lagos parks, garages mgt c’ttee report is fake-LASG",
    "summarized_story": "By Olasunkanmi AkoniLagos State Goverment has debunked report making the rounds that the state Governor, Babajide Sanwo-Olu, have appointed the suspended Chairman of Lagos State chapter of National Union Of Road Transport Workers, NURTW, Musiliu Akinsanya, popularly called MC Oluomo” as General Manager of Lagos State Transportation Parks and Garages Management Committee.\nThis came barely 12 hours when the state government suspended further activities of NURTW from motor parks and garages across the state due to lingering crisis between the National and state bodies of NURTW over leadership tussle.\nThe purported appointment was disclosed by MC Oluomo’s son, King West, on Instagram.\nPlease disregard post(s) claiming that Gic @jidesanwoolu has appointed suspended chairman of NURTW MC Oluomo as GM Lagos Transport Parks and garages committee.\nThere is no such appointment."
  },
  {
    "headline": "Ebonyi: Mustapha urges necessary support for Umahi’s appeal",
    "summarized_story": "By Omeiza Ajayi, AbujaOne of the frontline aspirants for the National Chairman of the All Progressives Congress APC, Mallam Saliu Mustapha has thrown his weight behind the decision of Ebonyi state Governor, Engr.\nDave Umahi, and his deputy, Dr Eric Kelechi Igwe to appeal the Federal High Court judgement which sacked them from office.\nIn a statement issued on his behalf by his media aide, Dapo Okubanjo, Mustapha said it was gratifying that the Governor filed a stay of execution while pursuing the appeal.\n“It was really shocking that a Federal High Court sitting in Abuja ruled that Governor Umahi and his deputy should vacate their respective offices for defecting from the Peoples Democratic Party (PDP) to APC.\n“By taking the matter to court in Enugu and Abuja, the Ebonyi governor has shown that he is an embodiment of what our party stands for,a firm believer in the rule of law."
  },
  {
    "headline": "Kebbi dep gov recounts ordeal in bandits attack",
    "summarized_story": "BanditsKebbi State Deputy Governor, Sama’ila Dabai, has recounted his ordeal after bandits ambushed his entourage in Kanya, Waje District of Danko/Wasagu Local Government Area of the state killing many.\nFollowing the attack, which occurred on Tuesday, the deputy governor in an audio interview, said the bandits came with sophisticated weapons and mixed up with the villagers.\n“I doff my cap for the soldiers at Zuru Battalion who were few compared to the number of the terrorists.\nThe deputy governor, who is also a retired colonel, commended the bravery of the 223 Battalion military men and vigilante groups for their rapid response.\nSenior Special Assistant (SSA) to the deputy governor on New Media, Atom Turba, in a statement on Wednesday, said the security aide attached to the deputy governor, ASP Idris Libata and 18 other military personnel were killed in the attack."
  },
  {
    "headline": "Russia-Ukraine war: God will help you fight Putin – Primate Ayodele tells Zelensky",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Friday advised President of Ukraine, Volodymyr Zelensky to move closer to God.\nPrimate Ayodele said President Zelensky should move closer to God at a “tough time like this in order to fight his battle.”The man of God revealed that God has Ukraine in his mind and all that is required is for the nation to turn to God for help.\nAccording to Ayodele: “My message to President Volodymyr Oleksandrovych Zelensky of Ukraine is to remain prayerful and focused.\nHe has proven to be a satanic messenger; he is an agent of the third world war and has gone too far.\nUnfortunately for him, God will not allow a third world war to happen, Putin will pay dearly for what he has done,” he said."
  },
  {
    "headline": "Bats are not witches – Conservationist warns",
    "summarized_story": "Speaking, the workshop coordinator, Iroro Tanshi, who is a lecturer at the University of Benin, said, “There is the persecution that bats are witches.\nWhy bats and owls are thought to be witches is because they are active at night.\n“So a large amount of dawadawa used in meals come from bat pollination.\n“So, we really need to start approaching bats with respect because they are not witches but go about their business,” she said.\nTanshi said that bats, like every other wild animal, have their physiology."
  },
  {
    "headline": "ABU replies Kaduna govt, denies selling land",
    "summarized_story": "Ahmadu Bello University (ABU), Zaria, has said it never sold its land to any individual or corporate organisation, rubbish claims by the Kaduna State Urban Planning and Development Authority (KASUPDA) that it sold about 80 hectares of land to some persons.\nKASUPDA Director-General, Isma’il Umaru-Dikko, had accused the institution of selling land belonging to its College of Agriculture and Animal Science at Mando in Kaduna metropolis to individuals.\n“To simply put the record straight, Ahmadu Bello University has never sold its land to anybody, be it individual or corporate organization; and it will never do so,” the statement emphasized.\nIt stated that the College has the Ownership Certificate (G.ITEM-No.1060) of the entire land on which it was established, in addition to the Survey Site Plan that shows the entire College boundaries.\nThe institution warned KASUPDA that no amount of blackmail would make it allow its own land to be “illegally grabbed for allocation to associates and other unpatriotic individuals.”"
  },
  {
    "headline": "Sanwo-Olu denies appointing MC Oluomo as Lagos Transport Parks GM",
    "summarized_story": "Lagos Governor Babajide Sanwo-Olu has refuted reports on the purported appointment of Musiliu Akinsanya a.k.a.\nThe National Union of Road Transport Workers (NURTW) suspended him as the Lagos Chairman on Wednesday.\nOluomo urged Sanwo-Olu to appoint a Management Committee to oversee the operations of parks.\nOn Friday, information emerged that Akinsanya has been named the head of Lagos Transport Parks and Garages Management Committee.\n“Please disregard post(s) claiming that Gov @jidesanwoolu has appointed suspended Chairman of NURTW, MC Oluomo as GM, Lagos Transport Parks and Garages committee”, he tweeted."
  },
  {
    "headline": "War: Putin seeks foreigners to join Russian forces in fight against Ukraine",
    "summarized_story": "Russian President, Vladimir Putin has called for volunteers to fight Ukrainian forces.\nPutin said foreign forces willing to join forces with Russian troops to fight Ukraine are welcomed.\nThe president spoke after the country’s Defence Minister, Sergei Shoigu, said 16,000 volunteers in the Middle East were ready to join forces with Russia against Ukraine.\nPutin recently declared war on Ukraine over the Eastern European country’s decision to join NATO.\nDespite several entreaties by the international community, Russia has continued to prosecute the war."
  },
  {
    "headline": "Ladoja, Olubadan-in-Council, traditionalists, others pledge loyalty to Olubadan",
    "summarized_story": "Members of the Olubadan-in-Council, the Iyalode-in-Council, traditional religious leaders, Baales, Traditional title holders and Mogajis, among others have pledged their loyalty and support to the new Olubadan of Ibadanland, Oba Lekan Balogun.\nThey affirmed the pledge when the groups and their representatives individually and publicly prostrated before the new Olubadan as part of the coronation and installation rites.\nAmong them were ex- Oyo Governor Rashidi Ladoja, all the high chiefs, head of traditionalists, leaders of the title holders, Mogajis (compound heads), religious leaders (Christian and Islamic) and Baales from all the regions of Ibadanland.\nShe said the succession system to Olubadan throne is unique in that it gives no room for bitterness or rancor.\nSenator Kola Balogun (Oyo South), a younger brother of the new Olubadan, could not secure a seat by the side of the monarch."
  },
  {
    "headline": "Balogun arrives for coronation as 42nd Olubadan",
    "summarized_story": "Senator Lekan Balogun has arrived Mapo Hall for his coronation as the 42nd Olubadan of Ibadanland.\nAt the event are dignitaries, including Acting President Yemi Osinbajo; Governors; Ex-Vice President Atiku Abubarkar and APC presidential aspirant Asiwaju Bola Ahmed Tinubu as well as monarchs and traditional rulers.\nThe arrival of the monarch was preceded by a large advance of family members, members of the Council and Oloris.\nThe arrival signals the completion of all coronation rites and tradition, which would be capped with the presentation of staff of office.\nThe 42nd Olubadan of Ibadanland succeeds Oba Saliu Adetunji who joined his ancestors on January 2nd, 2022."
  },
  {
    "headline": "Tight security as Osinbajo, Tinubu, Atiku, others attend Olubadan coronation",
    "summarized_story": "Acting President Yemi Osinbajo, ex-Vice President Atiku Abubarkar, APC presidential aspirant Asiwaju Bola Ahmed Tinubu and others have arrived Mapo Hall for the coronation of 42nd Olubadan of Ibadan Senator Lekan Balogun.\nOthers are Governors Seyi Makinde(Oyo); Kayode Fayemi (Ekiti); Dapo Abiodun (Ogun); Alaafin of Oyo, Oba Lamidi Adeyemi and Ooni of Ife, Oba Adeyeye Ogunwusi, among others.\nThere is heavy security presence in Ibadan, the Oyo state capital as more dignitaries arrive the venue.\nMajor places like Iwo Road, Iyana-Church, Agodi, Gate, Mokola, Ojoo, Beere, Dugbe and all adjourning routes that lead to Mapo have security operatives stationed in strategic places.\nGuest started arriving the venue as early as 7am with security operatives having a tough time enforcing law and order at the venue."
  },
  {
    "headline": "BREAKING (Bamise’s murder): BRT driver remanded for 30 days",
    "summarized_story": "A Yaba Magistrates’ Court in Lagos has remanded for 30 days a Bus Rapid Transit (BRT) driver, Mr. Andrew Nice, over his alleged involvement in the death of his passenger, Oluwabamise Ayanwole.\nThe Court made the order following an application by the Police.\nPolice counsel, Yetunde Cardoso, who filed the application premised it on a four-count charge of alleged murder, sexual assault, misconduct and interference with a corpse.\nBamise, 22, was found dead last Monday on Carter Bridge, Lagos Island — nine days after she was declared missing after she boarded Nice’s vehicle.\nDetails Shortly…"
  },
  {
    "headline": "Lagos suspends NURTW from parks, garages",
    "summarized_story": "Members of the National Union of Road Transport were suspended last night from operating in motor parks and garages in Lagos State.\nRead Also: NURTW suspends MC Oluomo“The government has a duty to ensure the safety of lives and property of all Lagosians and visitors.\n“After considering the provisions of the law, the Government hereby suspends the activities of NURTW, which must cease to operate in all parks and garages in Lagos State.\nThe government will set up a committee to immediately take control of the parks and garages.\nThe government’s position is premised on its responsibility to ensure that there is no breakdown of law and order in all parks and garages in Lagos State.”"
  },
  {
    "headline": "2023: I want to see Igbo become president – Obasanjo",
    "summarized_story": "By Sunday AniFormer President Olusegun Obasanjo has again reiterated that it would gladden his heart to see a Southeasterner emerge as president of Nigeria after President Muhammadu Buhari in 2023.\nThe former president said he also believes that there are a lot of things that Southeasterners can bring on the table.\nHe said his ambition is to make Nigeria a first world nation; a globally competitive nation and a nation that works like the other countries, which Nigerians admire.\nHe said that Obasanjo as a president, showed the highest level of not only detribalization but also fairness and equity as he didn’t discriminate.\nHe described the former president as a phenomenon and conscience of the country."
  },
  {
    "headline": "APC freed from ‘Yahoo Yahoo governors’ –Akeredolu",
    "summarized_story": "Salihu Lukman, former director-general of the Progressive Governors Forum (PGF), had alleged that Buni was working with “Yahoo Yahoo” politicians to stop the party’s convention.\n“The installation of the Caretaker and Extraordinary Convention Planning Committee (CECPC) of the APC was beyond a call to service.\n“Nevertheless, the courage and determination as well as shrewd sincerity of purpose demonstrated by most of the APC Governors remain a delight.\nAkeredolu said he and other APC governors were in support of Governor Bello dared governors who reportedly threatened to leave the party if Buni was removed to fulfil their threat.\n“Now that the clear motive aimed at frustrating our national convention has been botched, our party is on the track to greatness."
  },
  {
    "headline": "30,000 insurgents, families surrender in North East",
    "summarized_story": "From Sola Ojo, KadunaSecretary to the Government of the Federation (SGF), Boss Mustapha, in Kaduna, yesterday, said over 30,000 insurgents and their families have, so far, surrendered in the ongoing kinetic security measure in the North East.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe insurgents in the North East have been decimated considerably.\nOver 30,000 insurgents and their families have, so far, surrendered,” he said.\n“With the recent dimensions of security challenges including, human/child trafficking, baby factory syndrome, ritual killings and the like, the sanctity of human life has been called to question."
  },
  {
    "headline": "Bus driver kills self in Anambra accident",
    "summarized_story": "A bus driver was confirmed dead in an accident at Nkwelle Junction on Onitsha -Nteje Expressway in Anambra on Friday, the Federal Road Safety Corps (FRSC), said.\nMr Adeoye Irelewuyi, Commander of the FRSC in the state, confirmed the incident to the News Agency of Nigeria (NAN) in Awka.\nIrelewuyi said the accident which occurred at about 7.a.m., could be attributed to wrongful overtaking.\n“The fatal crash involved a commercial Mark Tanker with registration number: ENU224YY and a private Toyota Hiace Bus with registration number: GWA25TM.\n“According to eyewitness account, the bus driver overtook wrongfully without knowing there was a broken down pick-up vehicle ahead."
  },
  {
    "headline": "Bus driver kills self in Anambra accident",
    "summarized_story": "A bus driver was confirmed dead in an accident at Nkwelle Junction on Onitsha -Nteje Expressway in Anambra on Friday, the Federal Road Safety Corps (FRSC), said.\nMr Adeoye Irelewuyi, Commander of the FRSC in the state, confirmed the incident to the News Agency of Nigeria (NAN) in Awka.\nIrelewuyi said the accident which occurred at about 7.a.m., could be attributed to wrongful overtaking.\n“The fatal crash involved a commercial Mark Tanker with registration number: ENU224YY and a private Toyota Hiace Bus with registration number: GWA25TM.\n“According to eyewitness account, the bus driver overtook wrongfully without knowing there was a broken down pick-up vehicle ahead."
  },
  {
    "headline": "Uncertainty over APC March 26 Convention as INEC Faults Process, Still Recognises Buni’s Leadership",
    "summarized_story": "Chuks Okocha in AbujaThe planned All Progressive Congress (APC) national convention slated for March 26 has run into troubled waters as the Independent National Electoral Commission (INEC) has faulted a notice of the party’s emergency meeting planned by the Governor Sani Bello leadership of the party.\nINEC also insisted that due process must be followed by giving the commission a 21-day mandatory notice for it to monitor the convention.\nBut, in a swift reaction, the Commission replied the letter on Wednesday March 9, 2022, drawing the party’s attention to some obvious lacuna.\nBy implications, Governor Bello’s leadership of APC is not known to INEC and the stipulated 21 days notice to INEC for the commission to monitor party convention has not been complied with.\nFor INEC to monitor the convention, the APC letter notifying it of its convention ought to have been written earlier than March 8."
  },
  {
    "headline": "With Oil Price Surge, Nigeria Importing 100% Fuel Need, Subsidy Threatens to Cripple Economy",
    "summarized_story": "NNPC Limited recently disclosed that it spent N173.488 billion in excess of the budgeted N36.893 billion on petrol subsidy in January.\nRising Crude Oil Price Has Widened Budget Deficit, Ahmed LamentsMinister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, stressed that rising crude oil prices had widened the country’s budget deficit.\nAhmed pointed out that the federal government was presently in the process of amending the budget to accommodate fuel subsidy.\nThe price of crude oil has been rising and the price of dollar has been rising.\nWe need to refine crude oil here so that we end these disruptions and high prices,” Ndulue said."
  },
  {
    "headline": "Fayemi: We Use Security Votes to Fund Police, Military, Civil Defence, Buy Ammunitions, Vehicles",
    "summarized_story": "Fayemi also gave reasons why state governors were against local government autonomy.\nWe fund the police and we fund the police more than the federal government, quote me.\n“State governors fund police more than the federal government.\n“There are also crimes that are within the borders of our states in accordance with the statute that’s been promulgated or enacted by our local state assemblies.\nFayemi said he has no objection to local authority playing a role in local security."
  },
  {
    "headline": "Buni Fights Back, Pleads with Buhari for Him to Stay On",
    "summarized_story": "It is however not certain how disposed the president is to Buni and his supporters’ plea.\n“Now that the clear motive aimed at frustrating our national convention has been botched, our dear party is on the track to greatness.\nBut as you know, this is only for the conduct of the national convention,” Akeredolu concluded.\n“In my absence, I hereby transmit the functions of my office as the National Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) to you.\n“This is to enable the committee conclude all arrangements leading to the National Convention slated for March 26th, 2022 and other duties that may be required of the office."
  },
  {
    "headline": "UK Stops Abramovich from Selling Chelsea",
    "summarized_story": "Attempts by Russian billionaire, Roman Abramovich, to sell Chelsea has been halted by the UK government.\nAbramovich had put up the European champions for sale in the wake of Russia’s invasion of Ukraine and as threats of sanctions were speculated.\nBut Thursday, the UK government ruled that Abramovich, who is one of the 10 Russian Oligarchs whose assets have been frozen, cannot sell the club.\nThe freezing of Abramovich’s assets, which include Chelsea, means the club cannot sell further match tickets.\nTop football sources in the UK insisted that the move by the Boris Johnson administration means that Abramovich cannot make money from the sale of Chelsea."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "BREAKING: Bamise’s Murder: Court Remands Suspected Killer-Bus Driver, Nice Omoninikoron In Prison Till April 11",
    "summarized_story": "A magistrate court in Yaba, Lagos has ordered the remand of Andrew Nice Omininikoron in prison till April 11, 2021.\nOmininikoron is the driver of the Bus Rapid Transit (BRT) vehicle arrested in connection with the death of 22-year-old Bamise Ayanwole.\nOmininikoron was arrested after the family of the 22-year-old fashion designer declared her missing on February 27.\nIt was the last time her friend and family members heard from her and she was later declared missing.\nThe police subsequently picked up the bus driver, Nice Andrew Omininikoron, who has since remained in their custody."
  },
  {
    "headline": "BREAKING: Bamise’s Murder: Court Remands Suspected Killer-Bus Driver, Nice Omoninikoron In Prison Till April 11",
    "summarized_story": "A magistrate court in Yaba, Lagos has ordered the remand of Andrew Nice Omininikoron in prison till April 11, 2021.\nOmininikoron is the driver of the Bus Rapid Transit (BRT) vehicle arrested in connection with the death of 22-year-old Bamise Ayanwole.\nOmininikoron was arrested after the family of the 22-year-old fashion designer declared her missing on February 27.\nIt was the last time her friend and family members heard from her and she was later declared missing.\nThe police subsequently picked up the bus driver, Nice Andrew Omininikoron, who has since remained in their custody."
  },
  {
    "headline": "BRT driver arrested over Bamise's murder accused of raping passenger",
    "summarized_story": "The allegations against Andrew Nice — driver of the BRT bus boarded by Bamise Ayanwola, the late 22-year-old fashion designer — have taken another dimension.\nA female Lagos resident has accused the 47-year-old driver of allegedly raping her inside a BRT bus on November 25, 2021.\nAdvertisement‘HE ASKED FOR MY ACCOUNT NUMBER AFTER RAPING ME’His new accuser, who is a former sales girl at a shop in Ajah, said she boarded the BRT bus driven by the suspect.\nHe then told me to come and sit at the front and started asking me different questions,” the victim told PUNCH.\nHe demanded my account number and started pleading over what he did."
  },
  {
    "headline": "BRT driver arrested over Bamise's murder accused of raping passenger",
    "summarized_story": "The allegations against Andrew Nice — driver of the BRT bus boarded by Bamise Ayanwola, the late 22-year-old fashion designer — have taken another dimension.\nA female Lagos resident has accused the 47-year-old driver of allegedly raping her inside a BRT bus on November 25, 2021.\nAdvertisement‘HE ASKED FOR MY ACCOUNT NUMBER AFTER RAPING ME’His new accuser, who is a former sales girl at a shop in Ajah, said she boarded the BRT bus driven by the suspect.\nHe then told me to come and sit at the front and started asking me different questions,” the victim told PUNCH.\nHe demanded my account number and started pleading over what he did."
  },
  {
    "headline": "OPL 245: Nigeria cannot prove bribery case against Adoke, JP Morgan tells UK court",
    "summarized_story": "JP Morgan Chase Bank says Nigeria cannot prove its allegations of fraud and corruption against the bank and Mohammed Bello Adoke, former attorney-general of the federation, in the OPL 245-related case.\nAdvertisementNigeria is asking for $1.7bn as compensation from JP Morgan, but the bank has told the UK Court that Nigeria has suffered no loss as a result of transactions.\nResponding to the allegations before the court, JP Morgan said it was only carrying out instructions given by Goodluck Jonathan, the Nigerian president at the time.\nJP Morgan made it clear that “on a number of occasions the Attorney-General sent detailed, formal letters to President Jonathan explaining the terms of the proposed settlements and seeking his approval, which was subsequently provided”.\nThe bank said “these would be odd letters to have exchanged if they were co-conspirators in a fraudulent scheme”."
  },
  {
    "headline": "OPL 245: Nigeria cannot prove bribery case against Adoke, JP Morgan tells UK court",
    "summarized_story": "JP Morgan Chase Bank says Nigeria cannot prove its allegations of fraud and corruption against the bank and Mohammed Bello Adoke, former attorney-general of the federation, in the OPL 245-related case.\nAdvertisementNigeria is asking for $1.7bn as compensation from JP Morgan, but the bank has told the UK Court that Nigeria has suffered no loss as a result of transactions.\nResponding to the allegations before the court, JP Morgan said it was only carrying out instructions given by Goodluck Jonathan, the Nigerian president at the time.\nJP Morgan made it clear that “on a number of occasions the Attorney-General sent detailed, formal letters to President Jonathan explaining the terms of the proposed settlements and seeking his approval, which was subsequently provided”.\nThe bank said “these would be odd letters to have exchanged if they were co-conspirators in a fraudulent scheme”."
  },
  {
    "headline": "Facebook allows posts calling for violence against ‘Russian invaders’",
    "summarized_story": "This, according to Meta, the owner of Facebook and Instagram, will allow users in some countries to use violent speech like “death to the Russian invaders” — which would normally break its rules — against President Vladimir Putin and his troops.\nAccording to Reuters, the social media giant is also temporarily allowing some posts that call for death to Putin or Belarusian President Alexander Lukashenko.\nIt, however, said the death threat or hate speech won’t be acceptable if it is against civilians.\nAdvertisement“As a result of the Russian invasion of Ukraine we have temporarily made allowances for forms of political expression that would normally violate our rules like violent speech such as ‘death to the Russian invaders.’ We still won’t allow credible calls for violence against Russian civilians,” a Meta spokesperson said in a statement on Thursday."
  },
  {
    "headline": "How Helium Health assembled a star founding team",
    "summarized_story": "Nigerian healthtech startup, Helium Health, navigated this challenge in its early days by putting together a team of first employees that got the job done.\nHelium Health was co-founded by Adegoke Olubisi, Dimeji Sofowora, and Tito Ovia in 2016 to use technology to provide better healthcare services for Africans.\nIn 2020, Helium Health raised $10 million in Series A funding to expand its offering across African countries.\nOvia was named a Forbes 30 under 30 recipient and a winner of the Future Africa Award for Disruption for her work on African healthcare through Helium Health.\nOvia said that another challenge Helium Health faced in its early days was identifying the strength of each of its team members and only assigning related tasks to them."
  },
  {
    "headline": "Why e-commerce is king in Egypt",
    "summarized_story": "Furthermore, a Disrupt Africa report released in January shows that 20% of Egyptian startups are decidedly pursuing opportunities in the e-commerce and retail-tech space.\nLast year, Egyptian e-commerce startups received USD$ 131.27 million; according to Africa: The Big Deal, which is 1.4 times the e-commerce funding Nigeria, Kenya, and South Africa received in the same period.\nToday Egyptian e-commerce is expected to grow at least 30% this year, buoyed by younger shoppers and rising incomes from Egypt’s expanding middle class.\nPhoto: Fady Fouad/UnsplashAs e-commerce accelerated in Egypt, it created a ripple effect on the logistics sector.\nLast year and led by funding into e-commerce and retail tech companies, Egyptian startups raised $403.5 million, according to data from Disrupt Africa."
  },
  {
    "headline": "Fintech innovations on the rise in DR Congo’s nascent startup landscape",
    "summarized_story": "As with most countries in sub-Saharan Africa, access to basic financial services is significantly limited in the Democratic Republic of Congo (DRC).\nA number of startups have sprung up over the past 5 years, which, through fintech innovations, have brought financial services closer to where people live and work.\nSince its launch, Flash has recorded stellar growth and is currently integrated with several banks, mobile money, and telecom operators.\nWe have to work together,” the Okapi Finance founder said.\nWith internet access at around 17%, feature phones – which retail at about $20 – play a huge role in enabling Congolese to access digital finance services."
  },
  {
    "headline": "These women are building Africa’s neobank for the supply chain industry",
    "summarized_story": "Pivo entered the market with Pivo Capital, a credit-focused financial services platform for supply chain small and medium businesses (SMEs), because of the co-founders’ track record in the supply chain industry, especially the logistics aspect.\nWith Amadi-Emina’s experience in the logistics side of the supply chain, having worked and led the port operation effort at Kobo360, Akwiwu’s experience in law, and their collective knowledge of running an exportation business, building a business that serves the logistics arm of the supply chain was a no-brainer.\nLogistics supply chain is Pivo’s first stopIn Africa, access to credit is still one of the biggest challenges small businesses deal with, especially small supply chain businesses.\nImage source: LoriLaunched in September last year, Pivo provides flexible and quick financing options for supply chain businesses like logistics service providers, clearing and forwarding businesses, and FMCG distributors.\nBut to understand what Pivo does, one must first understand how supply chain financing works."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Protecting your mental health and privacy",
    "summarized_story": "Is mental health only related to mental illnesses?\nThis means that someone may have good mental health, no mental illness or be somewhere in between.\nHaving good mental health and no mental illness is at the top of the spectrum, while having poor mental health and a mental illness is at the bottom.\nWhile the people who are somewhere in the middle may have good mental health but a mental illness, they may also have poor mental health but no mental illness.\nConsequently, we must all strive to be at the top of the mental health spectrum which begins with prioritising your mental health as much as you do your physical and sexual health."
  },
  {
    "headline": "Nigeria has a new data protection enforcing body; here’s why you should care",
    "summarized_story": "Among other things, the statement credits the introduction of the Nigeria Data Protection Regulation (NDPR) and the National Digital Economy Policy and Strategy (NDEPS) with creating more awareness about data protection and resulting in the “datafication” of the Nigerian economy.\nAccording to the European Commission, “DPAs are independent public authorities that supervise, through investigative and corrective powers, the application of the data protection law.\nAccording to Suleiman’s statement, the NDPB would “support the process for the development of a primary legislation for data protection and privacy.”The race to a dedicated data protection and privacy law has taken several turns.\nFilled with false starts, the closest Nigeria has come to a law passed by the National Assembly was in 2018 with the Nigeria Data Protection Bill 2018.\nThe Bill provides a much more robust approach to data protection, providing for more categories of data than the NDPR, which appears to deal more with electronic data."
  },
  {
    "headline": "Building a tech startup with no-code tools",
    "summarized_story": "Building a startup with no-code toolsCross section of Ozi team.\nTwo University of Lagos (UNILAG) graduates — Adejumo Azeez and Israel Akpan — are building a tech startup without writing one line of code.\nAfter spending months looking for a developer to build their product, the duo resorted to no-code tools.\nBut even a startup built with no-code tools still has challenges.\nTheir startup, Ozi, can be described as a Communications as a Service product that Azeez and Akpan started in the university."
  },
  {
    "headline": "Nigeria should expect food scarcity by June – Dangote",
    "summarized_story": "Nigeria should expect an outbreak of food scarcity in the next three months as adverse consequences of the Russian-Ukraine war begin to come home to roost, Aliko Dangote, chairman, and chief executive of Dangote Group has said.\nThere will be a scarcity of food because people will not be able to access fertilisers going forward.\nIt is about food security,” Dangote said.\nFor instance, Nigeria imported N898.2 billion worth of wheat in nine months that ended September 2021.\nThe top origins of wheat in Nigeria in 2021 included the USA, N194.2 billion; Canada, N136.4 billion, Russia, N124 billion, Lithuania, N122.3 billion and Latvia, N115.9 billion."
  },
  {
    "headline": "What Vietnam’s 20,000 GWh power generation teaches Nigeria",
    "summarized_story": "17 years after a major policy rethink, Vietnam’s power sector has risen to around 48,000MW while Nigeria is still struggling with a long list of excuses and billion-dollar losses to show for it.\nVietnam, a country with a population less than half of Nigeria generates over 20,000 GWh due to a major policy rethink that revolutionised its power sector.\nThese electricity Laws formalise the shift of the electricity sector to a market economy and diversify forms of ownership and management of electricity generation, wholesale and retail.\n“Vietnam’s policies are to liberalise the electricity market and encourage foreign investors to invest in the market,” Omontuemhen explained.\nSpecifically, nuclear power stations were included in the national power development strategy for the period 2012 to 2020, according to which five nuclear power stations will be put into operation from 2020 to 2030."
  },
  {
    "headline": "Nigeria’s relevance waning among foreign investors",
    "summarized_story": "The old saying among foreign investors that “if you are not in Nigeria, you are not in Africa” is increasingly being confined to the past.\nPerhaps some government officials are the only ones still in denial that Nigeria’s stature in the foreign investor community is shrinking.\nThe many challenges with doing business in Nigeria is responsible for spooking foreign investors away from Africa’s most populous nation.\nRead also: Investors book N41bn gain as equities market maintains positive closeOther times a government policy is enough to frustrate foreign investors and send them packing.\nThe next government sure has its work cut out on how to make Nigeria a top investment destination not only in Africa but in emerging markets for foreign investors."
  },
  {
    "headline": "INTERVIEW WITH PROFESSOR ABHUERE ON 2023 PRESIDENTIAL ELECTION AND THE WAY FORWARD FOR EDO STATE. – Nigerian Observer",
    "summarized_story": "I set up a foundation which is called Centre for Child Care and Youth development where we try to put some of the ideas we believe in into practice.\nIt is for that reason I’m in Benin City, Edo state to see how the one in Uromi is faring.\nWe now came to 1993 election, the best ever conducted election that was annulled by the then military administration.\nIn my book the “Power of Youth” I try to explain why we must invest in the youth.\nSecondly, historically, when you tell the state not to participate, who will do the infrastructure development that bring, about other development."
  },
  {
    "headline": "2023: Akhabue’s Pragmatic Stake In Edo Central Senatorial Bid Gains Weight – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE stage is gradually set for the ultimate senatorial slot for 2023 general election as Ehia Olu Akhabue stages pragmatic stake for Edo Central Senatorial District.\nWithout a doubt, his senatorial aspiration has changed the dynamics of the political superstructure of Edo Central Senatorial District where in recent past, our sons and daughters have been hoisting themselves up for political offices without integrity, required principles and solid agenda for viable and enduring community development.\nMany of the rural communities in Edo Central have no good roads, infact, they are such in a terrible state of disrepair that farmers face serious difficulties in getting their produce out of the communities to market places in urban areas.\nThat is part of what Engr Akhabue is out to restructure to the utmost benefits of everyone in Esanland.\nOnce that is done, in addition to the water project, the people would have achieved a reasonable level of rural – urban fusion."
  },
  {
    "headline": "Nigeria Announces Six-Nation Women’s T20I Cricket Tournament in Lagos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Cricket Federation has announced a six-nation T20 International Cricket Tournament holding from March 26th to April 4th, 2022 at the newly resurfaced Tafawa Balewa Square Cricket oval in Lagos.\nPresident of the Federation, Uyi Akpata said that the event will feature Rwanda, Ghana, Sierra Leone, The Gambia, Cameroon along with the host country Nigeria.\n“Our female national team has been one of the most improved of all our national teams in the last five years and our gender inclusion development agenda has thrown up massive talents that have left us with an ever-improving side.\nNigerian international, Blessing Etim, will be the captain of the female Yellow-Greens (as the national team is called) and hoping to be making her experience count for the national team as the event gets underway in Lagos.\nEvery match at the event will also count for each team’s T20 ranking point on the International Cricket Council’s log."
  },
  {
    "headline": "Obaseki seeks firmer regulation against illicit drugs, partners pharmacists to control use – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will collaborate with the Pharmaceutical Society of Nigeria (PSN) in tackling illicit drugs, linking the rising crime rate across the state to drug use.\nThe governor said the government meets monthly with security heads to review the security situation in the state and has discovered that there is a correlation between drugs and crime.\nAccording to him, “Every month, we sit down to review the security situation in the state.\nWe have a security information database where we record security incidents in the state.\nWe must have primary healthcare hospitals across the state to enable our citizens to easily reach healthcare services."
  },
  {
    "headline": "Just In: Gunmen rain bullets at Umahi critic, Abia Onyike’s house in Ebonyi",
    "summarized_story": "Gunmen suspected to be members of Ebube Agu, a security outfit launched by Southeast governors, have launched an attack on the home of Chief Abia Onyike a former commissioner for information in Ebonyi State and critic of Dave Umahi, the state governor.\nThe gunmen witnesses said, stormed Onyike’s home located at No 1 Abia Onyike Close, Off Onwe Road early Friday morning and began shooting sporadically into into the house, leaving shattered windows and perforated walls.\n“The house came under heavy bombardments and shootings, shattering my glass windows and causing damages to sections of the one storey duplex.\n“I call on the security agencies in Ebonyi state to take note of Gov.\nDSP Odah assured that if it’s indeed true that Ebube Agu carried out such attack, the culprits will be fished out and punished."
  },
  {
    "headline": "Osun govt creates new parastatals to aid productivity",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Osun State government on Thursday created additional three public sector parastatals in it’s bid to promote sustainable development through pragmatic, transparent, accountable and inclusive governance to better the lives of the people.\nThe main purpose, among others, it said, is to aid efficiency in service delivery to all and sundry.\nThe creation is part of the ongoing review of the State Development Plan (2019-2028) and the three newly created sectors are: Human Capital Development, Culture and Tourism as well as Solid Minerals.\nWith this addition, the total number of public sector parastatals in the state is sixteen thereby.\nHe expressed optimism that the three newly created sectors when effectively and operationally on ground , the State will be better for it."
  },
  {
    "headline": "Constitution Amendment: Plot to make settlers indigenes of host communities ill thought – Group",
    "summarized_story": "Leading advocacy group, the Gravitas Group for Good Governance, otherwise known as 4G, has kicked against a proposal in the constitutional amendment bill making settlers indigenes of host communities after five of settlement.\nThe Senate or indeed the National and State Assemblies, and the entire 4 Estates of the Realm are creations of the Constitution.\n“Nigeria is the only federation in the world where the Centre creates or controls local governments!\nThe hidden Agenda behind this Local Government booby-trap is to have the Unitary Government, which is the Paymaster, to dictate the tune for piper-Chairmen of Local Governments.\nCreation of many unviable states has already weakened indigenous nationalities while the creation of 774 mushroom local governments has nailed the coffin of any opposition to arbitrary unitarism and fiendish oligarchy."
  },
  {
    "headline": "Sunday Igboho opts for dialogue after nine months in detention",
    "summarized_story": "Sunday Igboho, a Yoruba self determination agitator, whose real name is Sunday Adeyemo, has called for dialogue, noting that he would continue to preach against war.\nAccording to a statement signed by his lawyer, Yomi Alliyu, Igboho appealed to the Yoruba to embrace dialogue in the pursuit of self-determination.\nThe agitator who was released from detention in Benin Republic on Monday on health grounds, after nine months behind, bars thanked all those who stood by him while he was in detention.\nHe was arrested in Cotonou on his way to Germany in July 2021, over alleged falsification of his passport.\n“He continues to preach against war, seeing what is happening in Ukraine and some parts of Igboland in Nigeria."
  },
  {
    "headline": "Ebonyi: Declare Me Gov, PDP’s Nominee, Igariwey, Tells INEC",
    "summarized_story": "Iduma Igariwey and Fred Udogu to INEC, as Governor and Deputy Governor respectively, to replace Governor Umahi and his deputy, in compliance with the order of Court.\nIduma Enwo Igariwey and Chief Fred Udogu, are the recognised Governor and Deputy Governor of Ebonyi State, respectively, effective the 8th day of March 2022.\nHave Nigerians suddenly forgotten Umahi’s many battles with the press in Ebonyi State?\nThe era of running Ebonyi State as Umahi, sons and brothers Nigeria Ltd, is soon over.\nThe days of indiscriminate arrests, kidnappings, disappearances and murder in secret detention facilities in Ebonyi State Government House, will soon be a thing of the past."
  },
  {
    "headline": "Senate’s Rejection Of Fresh Electoral Act Review Bold, Heroic – Kachikwu",
    "summarized_story": "Media mogul and presidential aspirant for 2023 general election, Dumebi Kachikwu, has congratulated the Senate for its courage and patriotism in thrashing a request to re-amend the Electoral Act 2022.\nTherefore, let political appointees seeking to contest political positions first resign their appointments before partaking in primaries.\nLet all aspirants seeking political offices be on same footing.\n“This bold and heroic act by the Senate will ensure that political appointees seeking elective offices will not use government resources at their disposal to stifle or muzzle the chances of other aspirants.\nSenate President, Ahmad Lawan, had rejected the ruling of the Federal High Court, saying the Senate would go ahead to amend the law as required in line with separation of powers."
  },
  {
    "headline": "Frank Demands Education Minister’s Resignation Over ‘Disdain’ For Students",
    "summarized_story": "Recall that Adamu had walked out on the national president of the National Association of Nigerian Students (NANS), Comrade Sunday Asefon and his team during a meeting in the Minister’s conference room last week Monday.\nHe commended Comrade Asefon for speaking truth to power and for his tenacity and courage in championing the cause of over one million and one students in the nation’s public universities.\n“The Minister walked out on the students because he does not care about the psychological, spiritual, financial and collateral damage being suffered by students due to Federal Government’s failure over the years to fulfill agreements reached with ASUU.\n“Such an arrogant and uncaring character should have no place in superintending education in a democracy.\nHe must resign.”He called on NANS not to relent in its struggle until the Federal Government and ASUU live up to their obligations to keep public universities open and functional."
  },
  {
    "headline": "Customs Intercepts N192m Fake Drugs In Edo",
    "summarized_story": "The Federal Operations Unit (FOU) Zone C, of the Nigeria Customs Service (NCS), on Thursday, said it intercepted fake pharmaceutical products worth N192million in Okada, Edo State.\nOther unregistered pharmacuetical products intercepted are tramadol as well as other contraband goods with a Duty Paid Value of N529million between January 1 and February 28, 2022.\nThe FOU C Comptroller, Mr Ali Ibrahim, made the disclosure while showcasing the seized items in Owerri on Thursday.\nADVERTISEMENTIbrahim added that six suspects were arrested during the period under review, however, adding that they had been granted administrative bail.\nAlso intercepted were 2,239 pieces of used pneumatic tyres valued at N4.5million and 36,000 litres of smuggled petroluem products concealed in polyethylene bags, worth N3.6 illion."
  },
  {
    "headline": "Suspension: MC Oluomo, Followers Quit NURTW",
    "summarized_story": "Following his suspension by the national body of the National Union of Road Transport Workers (NURTW), the Lagos State Council chairman, Alhaji Musiliu Akinsanya, a.k.a MC Oluomo, has announced the withdrawal of his membership alongside his followers from the national body.\nRising from a meeting at the state secretariat, Agege, Lagos on Thursday, Akinsanya said all attempts to have an amicable resolution to the crisis with the national body have failed.\nHe said NURTW members have protested to the Lagos State Government about the state of affairs in the union.\nNURTW Suspends MC Oluomo Over InsubordinationADVERTISEMENT“Being law abiding and responsible citizens, we have decided to explore all avenues for peace in the interest of all, we will not support any action that can threaten the peace that we cherish so much in Lagos State.\nADVERTISEMENT"
  },
  {
    "headline": "I have just 5 years to live: Actress Kemi Afolabi opens up",
    "summarized_story": "Kemi Afolabi, a Nollywood actress, said her doctor told her that she has just five years to live.\nPunch reported that Afolabi stated this in a recent interview with show host, Chude Jideonwo, published on Friday.\nAfolabi confirmed that she was diagnosed with lupus – which is incurable.\nThat was tossed around from my private hospital to LASUTH, to Army barracks hospital WAEC and finally, LUTH where I spent over three months!\n“Fluid blocked my lungs, affected my heart from functioning well which was the reason for my breathlessness and that is caused by the condition diagnosed!"
  },
  {
    "headline": "Lupus: Information you need about the incurable disease common in women",
    "summarized_story": "The actress said her doctor told her she will only live for five years after being diagnosed with the incurable disease.\nLupus is a disease that occurs when your body’s immune system attacks your own tissues and organs (autoimmune disease).\nIt is common in women, affects people of all ages but is mostly diagnosed between the ages of 15 and 45.\nCausesIt appears that people with an inherited predisposition for lupus may develop the disease when they come into contact with something in the environment that can trigger lupus.\nSome potential triggers include:Sunlight: Exposure to the sun may bring on lupus skin lesions or trigger an internal response in susceptible people."
  },
  {
    "headline": "BREAKING: Court Orders Umahi, Deputy Not To Vacate Office",
    "summarized_story": "Ebonyi State High Court has ordered Governor David Umahi and his Deputy, Kelechi Igwe not to vacate their offices.\nThe interim order was secured following an ex-parte motion by counsel to the duo, Roy Umahi brought pursuant to rule 3(3) of the High Court rules of Ebonyi state in suit no HAB/13/22.\nThe Court had on February 28, 2022, ruled that Governor Umahi and his Deputy did not flout any law by defecting from the Peoples Democratic Party, PDP to the All Progressive Congress, APC.\nWITHIN NGERIA recalls that an Abuja Federal High Court on 8th March ordered Umahi and his Deputy to vacate their seats.\nUmahi and his Deputy rejected the Abuja ruling arguing that the Ebonyi High Court ruling should take precedence."
  },
  {
    "headline": "BREAKING: INEC Rejects Gov. Bello As Chairman, Mamman As Secretary Of APC CECPC",
    "summarized_story": "According to an inside source, Governor Bello, upon resumption as Chairman of CECPC of APC, transmitted a letter dated 8th March, 2022, informing INEC of the change of guard at the party’s national secretariat.\nBello introduced himself in the said letter as acting Chairman while Professor Tahir Mamman was introduced as the acting Secretary of the party.\nBoth Governor Bello and Professor Mamman were said to have signed the letter.\n“The same section also provided that, in a case of replacement of any vacant position in the party, INEC must be fully involved too”, the Source added.\n“The APC will be heading for an illegal NEC meeting by next week by the provision of the law."
  },
  {
    "headline": "BREAKING: (APC crisis): Buni’s letter counters el-Rufai’s narratives",
    "summarized_story": "The letter dismissed el-Rufai’s claims that Buni was sacked as the party’s chairman.\nBuni’s camp claimed that the embattled APC caretaker committee legally handed over the affairs of the party to Governor Abubakar Sani Bello before travelling out.\n“In my absence, I hereby transmit the functions of my office as the National Chairman of the Caretaker Extraordinary Convention Planning Committee (CECPC) to you.\n“I invite all members to cooperate with Governor Abubakar Sani Bello by extending to him all the support that I have enjoyed from you.\n“Nigerians should ask Bello and CECPC members if such a letter came to them from Buni.”"
  },
  {
    "headline": "P-Square Will Sell Out London’s O2 Arena Even Without New Songs, Mr P Boasts",
    "summarized_story": "P-Square Will Sell Out London’s O2 Arena Even Without New Songs, Mr P BoastsMr P, a Nigerian singer, has promised that his legendary singing duet, P-Square, consisting of himself and his twin brother, Paul, will sell out the O2 Arena in London during their show.\nMr P stated on his verified Twitter profile on Tuesday that P-Square would “shut down” the 20,000-seat venue regardless of whether or not they sing new songs.\nHe wrote, “We don’t need to shut down O2.\n“Team P-SQUARE, should we O2 or Wembley this sh*t?\nIn a series of posts on his Instagram story, Mr P also wrote, “London and the world."
  },
  {
    "headline": "[Breaking] ‘Rape, murder’ of fashion designer: Court remands BRT driver",
    "summarized_story": "A Bus Rapid Transit (BRT) driver, Mr. Andrew Nice, has been remanded by a Yaba Magistrates’ Court in Lagos for 30 days over his alleged involvement in the death of his passenger, Oluwabamise Ayanwole.\nThe court order came following an a four-count charge application by the Police on alleged murder, sexual assault, misconduct and interference with a corpse.\nMr. Nice, a prime suspect reportedly connived and killed a 22-year-old Bamise who boarded a BRT in Lagos state.\nDetails loading…"
  },
  {
    "headline": "Time to enforce banditry proscription order, Reps tell service chiefs",
    "summarized_story": "The House of Representatives has charged Nigeria’s security agencies to ensure the enforcement of the banditry proscription order of the federal government.\nThe September 2021 Proscription Order published in the official gazette 108, declared the activities of bandits and similar groups as terrorism and proscribed in any part of Nigeria.\nThere were renewed Fulani terrorist attacks on border communities in Benue state with heavy casualties on the Benue side.\nTroops’ casualties: 18 soldiers killed in action, 8 soldiers wounded in action and two soldiers missing in action.\nTwo days before the attack on the soldiers, bandits on Sunday massacred 63 vigilantes also in the state."
  },
  {
    "headline": "APC crisis: Buni in leaked letter counters el-Rufai, says I handed over to Sani-Bello – Blueprint Newspapers Limited",
    "summarized_story": "Governor el-Rufai had said: “The president held a meeting with us (APC governors) and gave us a clear directive and responsibilities and went into his waiting chopper at the airport.\nBello deniesBut Governor Sani-Bello denied seeing such letter when reporters pointedly asked him Thursday.\nIt wasn’t on the agenda in today’s meeting.”Probed further on whether another national secretary would be appointed, the Governor Sani-Bello said: “Probably.\nAlthough the governor did not name the said governors, he described them as “Yahoo, Yahoo governors.”Akeredolu asked Governor Sani-Bello to carry on as the party’s acting chairman of the CECPC.\n“Nevertheless, the courage and determination as well as shrewd sincerity of purpose demonstrated by most of the APC Governors remain a delight."
  },
  {
    "headline": "VIDEO: Nigeria Evacuates 123 More Citizens Who Fled Ukraine After Russia Invasion",
    "summarized_story": "﻿One hundred and twenty-three (123) more Nigerians who fled Ukraine amid the invasion by Russia have been brought back home.\nOfficials of the National Emergency Management Agency (NEMA) and that of other relevant government agencies were already on the ground to receive the returnees.\nSince the invasion of Ukraine by Russian soldiers, there have been concerns by authorities in Nigeria and other countries over the safety of their citizens caught in the war.\nNo fewer than 5,000 Nigerians, the majority of whom are students, are estimated to be living in Ukraine before the invasion.\nIn a bid to ensure the return of Nigerians stranded in Ukraine, the Federal Government activated an evacuation exercise following the approval of $8.5 million by President Muhammadu Buhari."
  },
  {
    "headline": "APC Crisis Worsens As INEC Rejects Notice Of Party’s NEC Meeting",
    "summarized_story": "The crisis in the All Progressives Congress (APC) has taken a new twist after the Independent National Electoral Commission (INEC) rejected the notice for an emergency meeting of the party’s National Executive Committee (NEC).\nINEC secretary, Rose Oriaran-Anthony, confirmed the commission’s decision in a letter dated March 9, 2022, and addressed to the party’s ‘national chairman’.\nHe had requested the commission’s presence at an emergency meeting of the APC NEC ahead of the party’s forthcoming national convention.\nBut INEC, in its response, rejected the invitation, stressing that the national chairman and secretary of the APC Caretaker Extraordinary Convention Planning Committee (CECPC) ought to have signed the letter.\nAmid the reports, Governor Bello presided over a meeting of the CECPC at the party’s national secretariat in Abuja on Monday."
  },
  {
    "headline": "Deputy Speaker Meets Aviation Stakeholders Over Fuel Scarcity",
    "summarized_story": "﻿Airline operators cannot operate safely with a 50 thousand naira base for airfares, the Director-General of the Nigerian Civil Aviation Authority, Captain Muda Nuhu, said on Thursday.\nHe stated this at a meeting with the Deputy Speaker of the House of Representatives, Ahmed Wase, over the scarcity and high cost of aviation fuel which has seen a rise in the hike in air fares.\nMeanwhile, airline operators said they cannot survive the next 72 hours with the current price of aviation fuel, as they have been paying the cost of subsidising the cost of the aviation fuel.\nCEO of Air Peace, Allen Onyema reiterated that the airlines are making too much sacrifices to keep the aviation sector alive."
  },
  {
    "headline": "INEC Yet To Get Certified Copy Of Judgment On Umahi – Festus Okoye",
    "summarized_story": "The Independent National Electoral Commission (INEC) has said it has not gotten the certified copy of the Federal High Court judgment that ordered the sack of Ebonyi State governor, David Umahi, and his deputy, Kelechi Igwe.\nINEC National Commissioner, Festus Okoye, said this in an exclusive interview with Channels Television on Thursday.\nAccording to the judgment delivered by Justice Inyang Ekwo, having moved to the APC, Governor Umahi, and his deputy cannot transfer the mandate of the PDP to the APC.\nJustice Ekwo equally ordered the electoral body to cease from recognising Umahi and Igwe as the governor and deputy governor respectively.\nIn the wake of the judgment, Umahi said the court lacked the powers to sack him, arguing that the development has put the judiciary on trial."
  },
  {
    "headline": "Banditry: Wives Of Slain Soldiers Protest In Kebbi",
    "summarized_story": "﻿The wives of slain soldiers alongside other women on Thursday stormed the residence of 223 Tank Battalion Commanding Officer to protest the killing of their husbands by suspected bandits in Kanya Village of Danko/Wassagu Local Government Area in Kebbi State.\nSome of the protesting women dressed in black attires were holding sticks to protest the killing of the operatives while others took to burning tyres in front of the residence of the commanding officer.\nThe commanding officer was in the company of the Kebbi state Deputy Governor, Colonel Samaila Yombe (rtd), who was in the area on an assessment visit.\nMost of the protesting women lost their husbands when armed bandits stormed Kanya village on Tuesday and engaged the soldiers in a fierce gun battle that led to the death of some soldiers.\nA military source told Channels Television that the General Officer Commanding of 8 Division, Major General Uwem Bassey is scheduled to visit the area to access the situation."
  },
  {
    "headline": "Reps call on security chiefs to stem renewed banditry attacks in Benue",
    "summarized_story": "Reps call on security chiefs to stem renewed banditry attacks in Benue"
  },
  {
    "headline": "INEC reportedly rejects APC's letter to monitor emergency NEC meeting -",
    "summarized_story": "The Independent National Electoral Commission has reportedly rejected a letter inviting it to an emergency meeting of the National Executive Committee of the All Progressives Congress.\nINEC’s response, dated 9th March 2022, signed by the Secretary to the Commission, Rose Oriaran Anthony and was titled, “Re: Invitation to the emergency meeting of the National Executive Committee”, and addressed to the National Chairman, APC CECPC.\nThis, it said, was contrary to the provision of the Article 1.1.3 of the Commission’s Regulations and Guidelines for Political Party Operations (2018).\nINEC’s letter read, “Please refer to your letter Ref.APC/NHDQ/INEC/019/022/32, dated 8th March 2022.\n“While hoping these issues are noted for compliance, please accept the assurance of the Commission’s warm regards.”"
  },
  {
    "headline": "Yahaya Bello is the Shield of APC in Nigeria, says Senate President -",
    "summarized_story": "Senate President Ahmad Lawan, on Thursday, described the Governor of Kogi State, Yahaya Bello, as the “shield” of the ruling All Progressives Congress.\nWhile stressing the invaluable contribution of the Kogi State Governor to the growth of the ruling party, he said it was in order to say “Yahaya Bello is the ‘Sarkin Yaki’ of APC in Nigeria.\nLawan said this during the formal commissioning of Senator Yakubu Oseni’s constituency projects across Kogi Central.\n“The Governor of Kogi State, His Excellency, Alhaji Yahaya Bello is the Shield of APC in Nigeria, and therefore he is the Sarkin Yaki of APC in Nigeria,” the Senate President said, while commending the good works he met on ground in Kogi State.\nGovernor Bello had earlier highlighted the tremendous successes of APC in Kogi State, just as he reaffirmed that his administration would not relent in supporting visionary leaders that could impact positively on the people in line with his party’s vision."
  },
  {
    "headline": "House leadership meets NNPC management over aviation fuel -",
    "summarized_story": "The leadership of the House of Representatives led by the deputy speaker, Idris Wase is currently meeting the management of the Nigeria National Petroleum Company limited over rise in the price of aviation fuel."
  },
  {
    "headline": "Only PDP Can Rescue Nigeria, Edo Governor Obaseki Says",
    "summarized_story": "Edo State Governor, Mr. Godwin Obaseki, on Thursday, led leaders and members of the Peoples Democratic Party (PDP) in the state to receive the National Chairman of the party, Dr. Iyorchia Ayu, declaring that only the PDP could rescue Nigeria from its current socio-economic woes.\nPDP is the party of Edo; PDP is in the DNA of Edo, and we do not want that to change.\n“The only issue is the small quarrel in Edo PDP.\nI want to assure you that by next week, all the issues in Edo PDP will be resolved.\n“I heard that Chief Dan Orbih went around, saying there is no harmonisation in Edo PDP."
  },
  {
    "headline": "Nigeria Seeks US Funding for Development of Natural Gas",
    "summarized_story": "Nigeria’s Minister of State, Petroleum Resources, Mr Timipre Sylva, on Thursday called on the United States Government to provide funding support for Nigeria to develop its natural gas resources.\nThe challenge for us to achieve this feat has been lack of infrastructure and we need funding to development infrastructure for our gas and we believe that the US can provide that funding,” Sylva stated.\nSylva therefore called on the US to provide the needed funding for infrastructure for the exploitation of the huge natural gas in Nigeria.\n“Nigeria has over 206 tcf of natural gas reserve and unproven reserve of 600 tcf and we believe that if we target exploitation of natural gas in Nigeria, we will be able to get up to 600 tcf.\nWe need to have the needed funding to develop our gas and the US can provide us this funding,” he added."
  },
  {
    "headline": "Volume of Nigeria, Korea Bilateral Trade Hits $2bn",
    "summarized_story": "The Republic of Korea has disclosed that the volume of trade between the country and Nigeria last year rose to $2 billion.\nHe said the bilateral trade figure was a 50 per cent increase in compared to that of 2020.\n“I hope that this year our bilateral trade rises further and at the end of the day I want to see Nigeria become Korea’s biggest trading partner in Africa.\nNigeria is the biggest economy in Africa, so it should be Korea’s number trading partner among Africa’s countries,” Kim said.\nThe project is expected to enhance Nigeria’s e-Government implementation system through the update of the current Nigeria’s e-Government Master Plan (NeGMP), upgrade of Nigeria’s Enterprise Architecture and development of a 10-year eGovernment Implementation Plan."
  },
  {
    "headline": "Russia-Ukraine War Threatens Africa’s Food and Fuel Prices, IMF Says",
    "summarized_story": "According to her, Africa was particularly vulnerable to the impact of the Ukraine war through four main channels – increased food prices, higher fuel costs, lower tourism revenues, and potentially more difficult access to international capital markets.\nThe IMF also disclosed that its executive board has approved $1.4 billion in emergency financing to support Ukraine amid the ongoing war with Russia.\nAccording to the IMF, the support comes from its rapid financing instrument (RFI).\nThe RFI provides rapid financial assistance available to all IMF member countries facing an urgent balance of payments need.\nThe IMF chief executive, Kristalina Georgieva said the Russian military invasion of Ukraine had been responsible for a massive humanitarian and economic crisis."
  },
  {
    "headline": "Saudi Arabia, UAE Leaders ‘Decline Calls with Biden’ Amid Fears of Oil Price Spike",
    "summarized_story": "“It was part of turning on the spigot [of Saudi oil].”Last week, OPEC+, which includes Russia, declined to increase oil production despite western entreaties.\nBut reports of frigid communications with Saudi Arabia come as the Biden administration seeks to increase oil supply after formally banning Russian oil imports on Tuesday, pushing oil prices to $130 a barrel, the highest level in 14 years.\nVenezuela has now released at least two Americans from jail in an apparent goodwill gesture toward the Biden administration in a possible prelude to increasing production to ease the price surge.\nRelations between the US and Saudi Arabia have chilled during the Biden administration over American policy in the Gulf region.\nThe two Gulf nations are regarded as the only global suppliers with capacity to pump more oil to ease the price surge."
  }
]