[
  {
    "headline": "PDP berates Fayemi over schools closure for cultural fiesta",
    "summarized_story": "As the weeklong National Festival of Arts and Culture hosted by Ekiti State ended on Saturday, the Peoples Democratic Party has described as ridiculous the closure of primary and secondary schools in the state by the Dr Kayode Fayemi-led All Progressives Congress government.\nThe PDP said while it was not against celebration of our culture and tradition, the closure of schools was unjustified, particularly by Fayemi who had talking about ‘restoring our values in Ekiti’.\nAccording to Dipe, no governor could have loved education more than Fayemi, who declared free education in primary and secondary schools and abrogated the levy allegedly imposed on pupils by the immediate past PDP administration.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "We’ve approached World Bank for $30m loan to build vaccine plant – Buhari",
    "summarized_story": "), has disclosed that his regime is in talks with the World Bank to obtain $30m to build a vaccine plant in Nigeria.\nHe said he hoped that the vaccine plant to be built in collaboration with May & Baker Nigeria Plc would commence next year.\nThe event was attended by Plateau State Governor, Simon Lalong, the Sultan of Sokoto, Muhammadu Sa’ad Abubakar, among other dignitaries.\n“The plant will initially ‘fill and finish,’ which means importing the raw materials for the vaccines and then packaging them for distribution.\nSo, we promptly put forward a stimulus plan in the order of N2.3 trillion.”Earlier , the Director General of NIPSS, Brig."
  },
  {
    "headline": "‘Religious crimes’ that put Nigeria on violators’ list still persist, CAN tells US",
    "summarized_story": "President Muhammadu BuhariBy Luminous Jannamike, ABUJAThe Christian Association of Nigeria, CAN, on Saturday, protested Nigeria’s removal from the list of religious freedom violators with a call on the United States of America, USA, to make public the data used to reach the decision.\n“The US government did not contact us when they were listing Nigeria among the countries of ‘Particular Concern’ on religious freedom, neither did they seek our opinion before removing Nigeria from the list.\n“If they had done, we would have been able to compare the statistics, then and now on the issue of freedom of religion in Nigeria,” he emphasised.\n“This is because all those factors that put Nigeria on the CPC list for the first time in 2020 are still there.\n“Let me conclude by saying that we are trying to bring some of the issues of religious persecution or discrimination up at our Nigeria Inter-Religious Council, NIREC, meeting so as to douse religious tension and foster harmonious relationship between religious adherents in Nigeria."
  },
  {
    "headline": "Current petrol pump price remains for now — FG",
    "summarized_story": "By Obas Esiedasa – AbujaThe Federal Government at the weekend insisted that the current pump price would remain for now with the expected high rate of travel during the festive period.\nThere will be no increase in the pump price, not in the near future.\n“People will be travelling now and so you don’t increase pump price arbitrarily like that.\nSo the pump price will be maintained and Nigerians should feel free to travel”.\nSo I will like to assure everybody that there will be no pump price increase,” he added."
  },
  {
    "headline": "Insecurity keeps Zamfara teachers away as 12,586 write professional qualifying examination",
    "summarized_story": "By Joseph ErunkeABUJA– THE ongoing insecurity problem in Zamfara State has prevented teachers in the state from registering for teacher’s professional qualifying examination.\nThis came as a total of 12,586 candidates across 35 states and the FCT registered for the examination nationwide.\n” Registration for professional qualifying examination was affected in Zamfara State due to communication and security issues in the state”,she had said.\nOn his part, Minister of State for Education, Emeka Nwajiuba,said plans were underway to begin Teachers Exchange Program with the Federal Ministry of Communication and Digital Economy to develop digital literacy capacity of teachers in Nigeria.\nHe said through the Federal Ministry of Education will enable laptop vendors to vend to teachers while they have the payment done within the period of two to four years."
  },
  {
    "headline": "Breaking: Man United board reaches agreement to sack Solskjaer – Report",
    "summarized_story": "By Emmanuel OkogbaManchester United have concluded plans to fire coach, Ole Gunnar Solskjaer after a poor run of results, Vanguard has learnt.\nAs per football journalist, Fabrizio Romano, United’s board decided to fire the Norwegian after a 5-hour internal talk and they are now considering the option of both parties mutually parting ways.\nThe latest of Solskjaer’s woes was Saturday’s 4-1 drubbing in the hands of Watford, a result that leaves United in 7th position.\nUnited’s last league win dates back to September when they defeated West Ham 2-1.\nVanguard News Nigeria"
  },
  {
    "headline": "COVID-19 pushes 30m people in sub-Saharan Africa into extreme poverty — REPORT",
    "summarized_story": "A piece titled Half a Billion in Poverty and Counting: “How COVID Derailed Africa’s Development Goals” models how a lost year of growth has affected poverty reduction goals in Africa.\nSub-Saharan Africa continues to lag behind on most of the goals.\nMost notable is the lag on poverty reduction; before the pandemic in 2019, Africa had more than 60 percent of the world’s 700 million poor.\nIn 2020, sub-Saharan Africa plunged into its first recession in more than 25 years, erasing at least five years of progress in fighting poverty.\nTo address this gap, funding from official creditors including the IMF, the largest providers of external debt, remain crucial for sub-Saharan Africa."
  },
  {
    "headline": "Goodluck Jonathan at 64: Lawani felicitates former President",
    "summarized_story": "As the former President Goodluck Ebele Jonathan celebrates his 64th birthday, Nigeria’s Senate President, Ahmad Lawan has felicitated with him.\nThe statment reads, “Since leaving office in Nigeria, President Jonathan has put his high standing, experience and energy to working for peace, democracy and development in Africa.\n“The former President has demonstrated how a great leader can continue to play very significant role even out of office.\n“President Jonathan believes in the Nigerian project and has amply demonstrated this by promoting unity and peaceful coexistence in Nigeria.\n“His acts of statesmanship has been recognised even outside Nigeria and has made him a good example of leadership in Africa."
  },
  {
    "headline": "OAU Master’s student’s death: Alumni condemn attacks on Oduduwa University",
    "summarized_story": "Oduduwa University, Ipetumodu Alumni Association (OUIAA) has condemned in strong terms, attempts by some individuals to discredit the private university over the death of Timothy Adegoke, a Master’s student of the Obafemi Awolowo University, Ile-Ife, at the Hilton Hotels and Resort, Ile-Ife, Osun on November 5.\nIn a statement by its President, Quadri Olatunji, the former students described as “unethical, distasteful, unreasonable, illogical and selfish”, the manner in which “some prominent news media” in the country framed and projected the story.\nOlatunji maintained that there is no justification for anybody to tarnish the image of Oduduwa University, even though Chief Ramon Adegoke Adedoyin is the owner of both the school and the hotel.\nHilton hotels is not Oduduwa University!” he stressed.\nWhile commiserating with the family of the deceased, the Mass Communication graduate urged the police to be thorough getting to the root of the death of the OAU post graduate student."
  },
  {
    "headline": "My administration has solved problem of power in Aba – Gov Ikpeazu",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State, has said that the problem of epileptic power supply in Aba and its environs will soon be over.\nThe Governor was speaking after receiving the award of the Governor of the Year, SME Development 2021 by the New Telegraph Newspaper in Lagos on Friday.\nGovernor Ikpeazu, who identified power, marketing, automation and market share as the four challenges confronting the SME sub-sector as at 2015 when he was sworn in, observed that he has been able to touch virtually all of them.\n“Aba, Abia State and the youth will place Nigeria on the platform in African continental free trade.\nGidado informed that the award was to recognize the effort of the Governor in the development of the country through his giant strides in SME Development."
  },
  {
    "headline": "Cape Verde opens first embassy in Nigeria",
    "summarized_story": "Jose Silva, Prime Minister of Cape Verde, the only Island-country in West Africa, has pledged better cooperation and increase in trade volumes between Nigeria and his country in the coming years.\n“The opening of this embassy means to strengthen the relationship between Cape Verde and Nigeria both politically and culturally.\n“Also, we will strengthen relationship with Cape Verde as well as its integration within the ECOWAS region.\n“We are going to lure more private investments to Cape Verde, we want to bring more tourists from Nigeria.\nWe already have many travellers from Nigeria to Cape Verde."
  },
  {
    "headline": "EPL: Pay Rudiger whatever he wants – Ferdinand tells Chelsea after 3-0 win over Leicester",
    "summarized_story": "Manchester United legend, Rio Ferdinand has told Chelsea’s board to pay contract give Antonio Rudiger whatever he wants for the German defender to remain at Stamford Bridge.\nFerdinand made the plea after the Germany International gave another superb performance in Saturday’s 3-0 win over Leicester City on Saturday.\nRudiger put the visitors ahead with a superb header from Ben Chiwell’a corner kick, while N’Golo Kante and substitute Christian Pulisic also netted for the west London side.\n“Wherever the highest earners are, I think he sees himself as part of that.\n“Because his influence, he’s aggressive, he sets the tone a lot of the time, and when they need to shut the door at the back he’s normally the one who puts his foot in where it hurts.”"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Banditry: Niger bans sale of motorcycles",
    "summarized_story": "Abubakar Sani-Bello of Niger State has banned the sale of motorcycles in the state.\nSecretary to the State Government, Ahmed Matane, said in a statement issued in Minna on Saturday that the ban resulted from incessant security challenges in some parts of state.\nHe stated that the ban was also informed by the fact that bandits and kidnappers now demand motorcycles as ransom.\nHe appealed to dealers in motorcycles in the state to comply with the directive.\nMatane reaffirmed that commercial motorcycling and operation of illegal garages remained banned in Minna and its environs."
  },
  {
    "headline": "Davido donates N250m to orphanages after birthday fundraiser",
    "summarized_story": "Prayers and applause rang out across the country yesterday for music star David Adeleke a.k.a.\nDavido following his donation of N250million to orphans.\nAs at 4.30pm yesterday his statement announcing the donation had notched up over 70000 likes on Twitter while over 36000 other had shared it.\n“In view of this, I announce that all the fund totalling N200 million be donated to orphanages in the country as well as Paroche Foundation.\nHe hoped friends, fans and colleagues in the industry “will continue to support me as I drive this cause.”"
  },
  {
    "headline": "Blind mother laments death of 14-yr-old only child from stray bullet, seeks justice",
    "summarized_story": "- Advertisement -Until his death on November 3, Mubarak, an SSS1 student of District Secondary School, Meiran, was also a vulcaniser apprentice in the neighbourhood.\nOur son, Mubarak, has been the one taking me around to have my bath, use the toilet and even feed me.’”He was a student and apprentice vulcaniser.\n“I want justice for the sake of my innocent son killed by errant policemen,” she added.\n“I had barely left the place when gunshots started booming and I was told that Mubarak had been killed by a stray bullet.\nThey shot directly at the protesters and one of the shots killed Mubarak."
  },
  {
    "headline": "Northcentral has never produced president or vice president – Coalition",
    "summarized_story": "The Coalition of North Central Groups has called on Nigerians to support the emergence of the president from the Northcentral geopolitical zone in 2023.\nAccording to the group, the region has never produced a civilian president or vice president since independence.\nIt specifically asked the Peoples Democratic Party stakeholders to concede the presidential ticket to the region for equity and justice.\nThese agitations are coming both from the North and the South, with each providing reasons for their position, which we understand.\n“For instance, since independence in 1960, all other zones have been privileged to produce democratically elected president, vice president or their equivalent except the North-Central geo-political zone."
  },
  {
    "headline": "Davido donates N250m gift money to orphanages across Nigeria",
    "summarized_story": "Nigeria’s Music star, David Adeleke a.k.a Davido says he will donate N200 million gift money received from friends and colleagues to orphanage homes across Nigeria.\nHe said he would make a personal donation of N50 million to make the money N250 million towards the efforts to help the less privileged.\n“In my usual playful manner, I requested few days ago that my friends, colleagues to send me money in celebration of my birthday.\n“The response and outcome exceeded my expectation as I received N200 million in less than two days,” he said.\n“In view of this, I announce that all the fund totalling N200 million be donated to orphanages in the country as well as Paroche Foundation."
  },
  {
    "headline": "Bandits demand N150million ransom for 70 villagers abducted in Niger",
    "summarized_story": "From John Adams, MinnaThe bandits who abducted no fewer than 70 Villagers from Zagzaga community in Munya local government area of Niger state have demanded N150million for the release of their victims.\nThe demand is coming as the bandits on Saturday again abducted 10 more people from the village at 8;30am as the villagers watch helplessly with no help coming their way.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“Their commander asked me that if the community is not happy that they even allow us to farm this year.\nThere has not being any statement from either the state government nor the security agencies in the state since the attacks began on Monday."
  },
  {
    "headline": "Controversies, counter-accusations trail leaked EndSARS panel report",
    "summarized_story": "Even Kolade Salami that SARS operatives killed in 2019 was listed among Lekki victims.\nA part of the release read: “The Lagos State Government has noted the various reactions that have followed the submission of the report.\nWhy have the family members of the Lekki victims not shown up after a year?\n“I am not speaking for Lagos State Government.\nHe said that was the only thing Lagos State had to explain."
  },
  {
    "headline": "Self-determination struggle: Why agitation persists in South-East",
    "summarized_story": "From Magnus Eze, EnuguThere is a palpable feeling of despondency across the length and breadth of the South East over the people’s condition in the Nigerian federation as presently constituted.\nFor instance, no South East son or daughter is a Service Chief or a member of the Security Council.\n“The security agents deployed to the South East zone kill young and vibrant Igbo youth arbitrarily without any provocation whatsoever.\nThere are uncountable roadblocks on South East roads.\n“The Federal Government is not building infrastructures in South East the way it is building in other geo-political zones."
  },
  {
    "headline": "Buhari to Igbo leaders: I will consider Kanu’s release",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has described the request for the unconditional release of leader of the outlawed Indigenous People of Biafra (IPOB), Nnamdi Kanu, currently standing trial, as a difficult and heavy one.\nBuhari gave the assurance when he received a group under the aegis of Highly Respected Igbo Greats, led by First Republic parliamentarian and Minister of Aviation, Chief Mbazulike Amaechi, at State House, Abuja.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe President told the 93-year-old statesman: “You’ve made an extremely difficult demand on me as leader of this country.\nI will consider it.”Stressing his policy of non-interference with the judiciary, President Buhari said when Kanu jumped bail, got arrested and brought back to the country, “I said the best thing was to subject him to the system."
  },
  {
    "headline": "Under Pressure from ‘Igbo Greats’, Buhari Pledges to Consider Amnesty for Kanu",
    "summarized_story": "‘You’ve made an extremely difficult demand on me as leader of this country.\nA group of Igbo elders, under the aegis of “Highly Respected Igbo Greats,” led by First Republic parliamentarian and minister of aviation, Mbazulike Amaechi, requested the amnesty for Kanu, during a visit to Buhari at the State House, Abuja, yesterday.\nWhile receiving the delegation, led by the 93 year-old statesman, Buhari said: “You’ve made an extremely difficult demand on me as leader of this country.\n“In the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nLet him make his case in court, instead of giving very negative impressions of the country from the outside."
  },
  {
    "headline": "Jonathan: Mismanagement of Diversity, Threat to Unity, Democracy",
    "summarized_story": "*Wants diversity harnessed, translated to strength for a peaceful, prosperous futureChuks Okocha in AbujaFormer president Goodluck Jonathan has described the mismanagement of the ethnic diversity in Nigeria in particular and Africa at large as the basic problem affecting democracy and unity in the continent.\n“Some nations are going through many challenges that have continued to pose serious threats to their unity and corporate existence.\n“Democracy thrives on the mutuality of trust between government and the people and among the different groups within a state.\n“This Dialogue: ‘Democracy and the Unity of State’ captures the essence of democracy, which drives its steam from productive civic engagements.\nWhile referring to Jonathan, he said, “My belief is that you have demonstrated very clearly that this country can be great."
  },
  {
    "headline": "IMF Urges Nigeria to Fully Remove Fuel Subsidies Early 2022",
    "summarized_story": "Fiscal deficit is projected at 3.93 per cent and 3.39 per cent of GDP in Nigeria’s 2021 and 2022 budgets respectively.\nOn exchange rate policy, the IMF called for reduced administrative measures and room for a market-clearing unified exchange rate.\nIt also endorsed steps taken toward unification of the exchange rate and stressed the need for further actions.\n“To preserve competitiveness, any exchange rate adjustment should be accompanied by clear communications regarding exchange rate policy going forward, macroeconomic policies to contain inflation and structural policies to facilitate new investment.\n“A further move toward a market-clearing exchange rate will also help build foreign exchange buffers through higher capital inflows.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "N’Assembly Transmits Amended 2021 Electoral Act to Buhari for Assent",
    "summarized_story": "Deji Elumoye in AbujaThe National Assembly has transmitted the 2021 Electoral Act (Amendment) Bill it passed this month to President Muhammadu Buhari for his assent.\nAccording to him, the legislative arm expected that President Buhari would sign the bill into law before long.\nFemi Gbajabiamila, had also on Thursday during a visit to President Buhari at the State House in Abuja, hinted of the possibility of the President signing the Electoral Act Amendment Bill into law.\nOn whether the Electoral Act Amendment Bill had been transmitted to the President and when it would be done, Gbajabiamila said: “It’s on the way.\nGbajabiamila gave the assurance that the President would soon sign the Electoral Act Amendment Bill into law as he is back from official engagements."
  },
  {
    "headline": "N’Assembly Transmits Electoral Act (Amendment) Bill to Buhari for Assent",
    "summarized_story": "Deji Elumoye in AbujaThe National Assembly has transmitted the 2021 Electoral Act (Amendment) Bill it passed this month to President Muhammadu Buhari for his assent.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday, November 19, 2021”.\nChairman of the Senate Committee on INEC, Senator Kabiru Gaya, had earlierbhinted that the National Assembly will this week transmit the electoral act amendment bill 2021 to President Muhammadu Buhari for his assent.\nOn whether the Electoral Act Amendment Bill had been transmitted to the President and when it would be done, Gbajabiamila said: “It’s on the way.\nGbajabiamila gave the assurance that the President would soon sign the Electoral Act Amendment Bill into law."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Leadway Assurance Company Denies Defrauding Abuja-based Customer Of Multi-million Naira Claims On Damaged Vehicle",
    "summarized_story": "Woleola had accused the insurance corporation of fraud involving over multi-million naira claims on his damaged vehicle.\nHe described the attitude and disposition of the company to his insurance claim as appalling, disappointing, annoying and frustrating.\n\"I entered into a vehicle insurance contract with Leadway covering my Mercedes Benz E 300 2017 model.\n“In accordance with standard policy terms, an insurance company can either 'repair, reinstate, or replace' the damaged vehicle.\nIn this case, the cost of repair was 25.1% of the Sum Insured Value of N15m, which is far less than 55%."
  },
  {
    "headline": "Tinubu visits Orji Kalu to discuss 'way forward for Nigeria'",
    "summarized_story": "Bola Tinubu, a former governor of Lagos state, on Saturday, visited Orji Uzor Kalu, chief whip of the senate, at his residence in the federal capital territory (FCT).\nAdvertisementAccording to NAN, Tinubu arrived at the residence of the former governor of Abia at about 4:25pm and left around 6:45pm.\nSpeaking with journalists after the meeting, Tinubu, a chieftain of the All Progressives Congress (APC), said the meeting with the lawmaker centred on the development of the country.\n“We discussed the way forward for the country and this country is important and greater than anyone’s personal ambition,” Kalu said.\n“We have been together and concerned about the stability, progress, development and security of the country."
  },
  {
    "headline": "Tinubu visits Orji Kalu to discuss 'way forward for Nigeria'",
    "summarized_story": "Bola Tinubu, a former governor of Lagos state, on Saturday, visited Orji Uzor Kalu, chief whip of the senate, at his residence in the federal capital territory (FCT).\nAdvertisementAccording to NAN, Tinubu arrived at the residence of the former governor of Abia at about 4:25pm and left around 6:45pm.\nSpeaking with journalists after the meeting, Tinubu, a chieftain of the All Progressives Congress (APC), said the meeting with the lawmaker centred on the development of the country.\n“We discussed the way forward for the country and this country is important and greater than anyone’s personal ambition,” Kalu said.\n“We have been together and concerned about the stability, progress, development and security of the country."
  },
  {
    "headline": "IMF advises FG to remove fuel, electricity subsidies early 2022",
    "summarized_story": "The International Monetary Fund (IMF) has advised the federal government to completely remove subsidies on fuel and electricity in early 2022.\nAdvertisementThe Bretton Woods institution said the country needs major reforms in fiscal, exchange rate, trade and governance to promote sustainable growth.\n“The mission stressed the need to fully remove fuel subsidies and move to a market-based pricing mechanism in early 2022 as stipulated in the 2021 Petroleum Industry Act.\nAdvertisementIt said this was a reflection of implicit fuel subsidies and higher security spending, adding that it would remain till 2022.\n“Taking advantage of the favorable global conditions, improving current account and robust oil prices, the mission advised a move to a unified and market-clearing exchange rate without further delays."
  },
  {
    "headline": "IMF advises FG to remove fuel, electricity subsidies early 2022",
    "summarized_story": "The International Monetary Fund (IMF) has advised the federal government to completely remove subsidies on fuel and electricity in early 2022.\nAdvertisementThe Bretton Woods institution said the country needs major reforms in fiscal, exchange rate, trade and governance to promote sustainable growth.\n“The mission stressed the need to fully remove fuel subsidies and move to a market-based pricing mechanism in early 2022 as stipulated in the 2021 Petroleum Industry Act.\nAdvertisementIt said this was a reflection of implicit fuel subsidies and higher security spending, adding that it would remain till 2022.\n“Taking advantage of the favorable global conditions, improving current account and robust oil prices, the mission advised a move to a unified and market-clearing exchange rate without further delays."
  },
  {
    "headline": "Lawan: National assembly will pass 2022 budget before Christmas",
    "summarized_story": "Senate President Ahmad Lawan says the national assembly will pass the 2022 appropriation bill before the Christmas holiday.\nThe senate president bagged the ‘Lifetime Achievement Award in Politics’ at the event.\n“The ninth senate and indeed the ninth national assembly has recorded great success and that is not to say that we have no differences; we all decided that this time around, we must work for Nigeria together, in spite of our political dispositions.\n“I also dedicate it to them for continuing to believe that their hope is not lost on us.\nAnd those who continue to encourage us to do more that is required, I want to thank all of you.”"
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Early Access: Interview with Mr Eazi; artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\n“I think Mr Eazi is a laid back musician.\nThe Nigeria-born musician later relocated to Ghana for his undergraduate studies before starting his music career in London.\nHe believes Africa is experiencing its best years in the global music industry, with many of its music genres being embraced globally.\nMotivation and obsessionOluwatosin Ajibade (Mr Eazi)."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "The Kredi Money story, Ozow’s $48m Series B, and blockchain skills with Bitmama",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:The Kredi Money storyOzow’s $48m Series BGetting blockchain skills with BitmamaThe Kredi Money storyKredi Money Co-founders, Afolabi Abimbola and Samuel OrjiFintech remains one of the biggest movers in Nigeria’s startup ecosystem.\nAdvertisementAnother fintech startup, Kredi Money, has joined the Nigerian fintech space combining several fintech offerings into one.\nEmmanuel Paul has that answer and more here: Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services.\nOzow’s $48m Series BThomas Pays, CEO and Co-Founder of OzowSouth African fintech startup, Ozow has closed a $48 million Series B to ease online payments for South Africans.\n: According to 101 Blockchains, the need for blockchain talent is fueled by the advantages of blockchain, such as security, transparency, and traceability."
  },
  {
    "headline": "Edo Poly commences diploma programme in agribusiness, agricultural tech – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To train youths to set up and operate viable businesses in the agricultural sector, the Edo State Polytechnic, Usen, has commenced two new national diploma programmes in agricultural technology and agribusiness.\nRector of the polytechnic, Prof. Abiodun Falodun, who spoke with journalists, said the institution is being repositioned to offer top-of-the-range academic and practical training to boost the capacity of youths to better contribute to national development.\nAccording to him, “We have just commenced two new programmes in agricultural technology and agribusiness because we recognize the role of agriculture in driving development in the state.\n“In the last couple of years, we have sustained a steady drive of introducing innovative courses that are focused on engendering sustainable development, and the two new ones that have just been launched are done in the spirit of keeping to the tradition.\nHe added that it was until agriculture is taken as a serious business that Nigeria can truly reap the full benefits from its vast arable land, noting that the programmes in the school will continue to build the right human capital to lead the charge."
  },
  {
    "headline": "Obaseki tasks new couple on love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged newly married couple, Rev.\nand Mrs. Paul and Blessing Onu, to imbibe the virtues of love and tolerance so as to make their marriage blissful.\nObaseki spoke at the wedding ceremony of the couple at the St. Matthew’s Cathedral, Sakponba in Oredo Local Government Area of Edo State.\nThe governor admonished the couple to respect each other and abide by the teachings in the Bible.\nPeter Imasuen, in his homily, called on the couple to always look up to God to provide solutions to any challenges they face in their marriage."
  },
  {
    "headline": "Obaseki tasks new couple on love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged newly married couple, Rev.\nand Mrs. Paul and Blessing Onu, to imbibe the virtues of love and tolerance so as to make their marriage blissful.\nObaseki spoke at the wedding ceremony of the couple at the St. Matthew’s Cathedral, Sakponba in Oredo Local Government Area of Edo State.\nThe governor admonished the couple to respect each other and abide by the teachings in the Bible.\nPeter Imasuen, in his homily, called on the couple to always look up to God to provide solutions to any challenges they face in their marriage."
  },
  {
    "headline": "Edo Poly commences diploma programme in agribusiness, agricultural tech – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTo train youths to set up and operate viable businesses in the agricultural sector, the Edo State Polytechnic, Usen, has commenced two new national diploma programmes in agricultural technology and agribusiness.\nRector of the polytechnic, Prof. Abiodun Falodun, who spoke with journalists, said the institution is being repositioned to offer top-of-the-range academic and practical training to boost the capacity of youths to better contribute to national development.\nAccording to him, “We have just commenced two new programmes in agricultural technology and agribusiness because we recognize the role of agriculture in driving development in the state.\n“In the last couple of years, we have sustained a steady drive of introducing innovative courses that are focused on engendering sustainable development, and the two new ones that have just been launched are done in the spirit of keeping to the tradition.\nHe added that it was until agriculture is taken as a serious business that Nigeria can truly reap the full benefits from its vast arable land, noting that the programmes in the school will continue to build the right human capital to lead the charge."
  },
  {
    "headline": "Lagos provides temporary home for Yoruba Nation rally victim’s family",
    "summarized_story": "The Lagos State Government on Saturday provided a temporary furnished two-bedroom apartment for the family of the victim of the Yoruba Nation rally, Jumoke Oyeleke.\nMs Oyeleke, a 25-year-old salesgirl, was killed by a stray bullet on July 3, 2021, after police fired guns to disperse the crowd during a ‘Yoruba Nation’ rally at the Ojota area of Lagos.\nMr Sanwo-Olu said the state government would take further actions to ameliorate the sufferings of the family.\n”So, here we are at the new place of abode of Mrs Ifeoluwa Oyeleke with her children.\n”I want the government to help me find a profitable job, so I can train my children properly."
  },
  {
    "headline": "2023: Tinubu, Orji Kalu hold closed door meeting in Abuja",
    "summarized_story": "In a move that has sparked speculations ahead the 2023 presidential election, former governor of Lagos State, Bola Ahmed Tinubu at the weekend, paid a visit to Senate Chief Whip and former governor of Abia State, Orji Uzor Kalu at the former’s Aso-Villa, Abuja home.\nTinubu arrived at Kalu’s residence at around 4:25 pm, and both men exchanged pleasantries before proceeding to have private conversations.\nWhile neither of the parties has released a statement regarding what was discussed at the meeting, feelers suggest it may not be unconnected with the 2023 presidential election.\nBoth men who are members of the ruling APC, are known to nurse presidential ambition, and Tinubu’s visit could be part of moves to try to close ranks ahead of what is shaping up to a tough contest between the country’s Southern and Northern divide in the race to succeed President Muhammadu Buhari."
  },
  {
    "headline": "Davido donates N250m to orphanages after raising N200m in birthday fundraiser",
    "summarized_story": "OBINNA EZUGWUNigerian singer, David Adeleke, alias Davido has said he is donating the sum of N250 million to orphanage homes across Nigeria after raising N200 million from friends on his birthday.\n“I wish to express my sincere gratitude to my friends, colleagues, fans, and the public for the generous expressions of love in recent days.\nIn my usual playful manner, I requested a few days ago that my friends and colleagues send money in celebration of my birthday,” he said.\n“To maintain transparency, the committee will make public the names of the beneficiary orphanages and how much each will receive.\n“Once again, I express my sincere gratitude to my friends, colleagues, fans, and everyone that made this possible."
  },
  {
    "headline": "Jonathan says Nigeria’s key problem is inability to manage diversities",
    "summarized_story": "Nigeria’s former president, Goodluck Jonathan, has said one major problem confronting the country is its inability to manage diversities, noting that democracy thrives on the mutuality of trust between government and the people and among the different groups within a state.\nJonathan said the country and the rest of Africa need to harness and draw strength from diversities, rather than allowing it to be a source of weakness.\n“In Africa, we need to harness our diversities and differences and translate them to strength for a more peaceful and prosperous future.\nAnd we shouldn’t allow suspicion among us because when political leaders allow for suspicion among themselves, the outcome is that the ethnic nationalities will behave the same way,” he said.\n“When you were in office, I was in the opposition but I supported many of your policies and opposed some."
  },
  {
    "headline": "NAHCO appoints Indranil Gupta as new MD/CEO",
    "summarized_story": "The Board of Directors of Nigerian Aviation Handling Company Plc (NAHCO Aviance Plc), has approved the appointment of Mr Indranil Gupta as the new Group Managing Director/CEO with effect from December 7, 2021.\nIn view of this, the GMD/CEO designate, Mr Gupta will assume office a day after- December 20, 2021.\nMr. Gupta who of Indian origin, has 26 years’ experience in managing various aviation businesses in India, the Middle East, Southeast Asia and Africa.\nHe worked at Mumbai/Kolkata/Bangalore International Airports as the Senior Airport Manager in 2007, Deputy General Manager in 2011, General Manager in 2016.\nHis main targets are topline enhancement by way of integration and expansion, building an efficient organization, increasing shareholder value and increasing share price."
  },
  {
    "headline": "Ex-President Jonathan Urges Africa To Harness Diversities For Greatness",
    "summarized_story": "Former President Goodluck Jonathan has called on Africa nations to harness their diversities and differences for greatness.\n“In Africa we need to harness our diversities and differences and translate them to strength for a more peaceful and prosperous future.\nThe former president said to win peace in Africa, countries in the continent need to constantly engage in meaningful conversations in order to reach compromise on issues.\n“The pursuit of these virtues will guarantee sustainable peace and unity in Africa.\nJonathan said the dialogue aimed at advancing the course of nationhood and building a consensus around some critical issues affecting Africa unity and development."
  },
  {
    "headline": "Ex-President Jonathan Urges Africa To Harness Diversities For Greatness",
    "summarized_story": "Former President Goodluck Jonathan has called on Africa nations to harness their diversities and differences for greatness.\n“In Africa we need to harness our diversities and differences and translate them to strength for a more peaceful and prosperous future.\nThe former president said to win peace in Africa, countries in the continent need to constantly engage in meaningful conversations in order to reach compromise on issues.\n“The pursuit of these virtues will guarantee sustainable peace and unity in Africa.\nJonathan said the dialogue aimed at advancing the course of nationhood and building a consensus around some critical issues affecting Africa unity and development."
  },
  {
    "headline": "CAN Rejects Removal Of Nigeria From US Religious Intolerance List",
    "summarized_story": "The Christian Association of Nigeria (CAN) has faulted the removal of Nigeria from the list of ‘Countries of Particular Concern’ on the issue of freedom of religion, saying it did not know the data or statistics used by the US government in arriving at that decision.\nThe association said the United States government neither contacted before taking that decision nor sought its opinion before the removal of Nigeria from the list.\nThat agenda with the killing of Christians has not stopped till today and Nigerians are living witnesses.\nADVERTISEMENT“The bandits have joined other militant Islamic groups to be ferociously attacking churches, killing worshippers and kidnapping for ransom.\nWe have lost many people and places of worship to their assault, especially in the Northcentral part of the country and the North East."
  },
  {
    "headline": "CAN Rejects Removal Of Nigeria From US Religious Intolerance List",
    "summarized_story": "The Christian Association of Nigeria (CAN) has faulted the removal of Nigeria from the list of ‘Countries of Particular Concern’ on the issue of freedom of religion, saying it did not know the data or statistics used by the US government in arriving at that decision.\nThe association said the United States government neither contacted before taking that decision nor sought its opinion before the removal of Nigeria from the list.\nThat agenda with the killing of Christians has not stopped till today and Nigerians are living witnesses.\nADVERTISEMENT“The bandits have joined other militant Islamic groups to be ferociously attacking churches, killing worshippers and kidnapping for ransom.\nWe have lost many people and places of worship to their assault, especially in the Northcentral part of the country and the North East."
  },
  {
    "headline": "Bank Customers Lose N42.7bn In 3 Months To Social Engineering",
    "summarized_story": "Bank customers lost a whopping N42.755 billion to fraudulent activities perpetrated through social engineering in just three months, data obtained by LEADERSHIP Sunday have shown.\nSocial engineering is when fraudsters trick individuals to reveal personal data that could be used to access their bank accounts.\nIn the heat of the COVID-19 pandemic and the months following, many Nigerians were and are still being defrauded mainly thorough social engineering.\nWith increasing penetration of fraudsters into the banks’ database, experts have warned Nigerians to avoid releasing sensitive information to strangers.\nSimilarly, the federal government N-Power website was cloned as individuals filled out sensitive information on phoney websites."
  },
  {
    "headline": "Again, hoodlums kill one, shoot policeman in Imo community",
    "summarized_story": "The development had caused tension in the community as security operatives roved in the community.\nA community source told our correspondent that while the victim was slain in a bush path in a community, the cop who was said to be attached to one of the oil companies operating in the community was attacked after he had an altercation with another person.\nThe source said, “The community is hot as we speak.\nIndigenes are running from the community to avoid a repeat of what happened the other time after youths and military men clashed and houses were burnt.\n“A man was killed on a bush path while a policeman serving in an oil company was attacked after he had issue with another person."
  },
  {
    "headline": "Again, hoodlums kill one, shoot policeman in Imo community",
    "summarized_story": "The development had caused tension in the community as security operatives roved in the community.\nA community source told our correspondent that while the victim was slain in a bush path in a community, the cop who was said to be attached to one of the oil companies operating in the community was attacked after he had an altercation with another person.\nThe source said, “The community is hot as we speak.\nIndigenes are running from the community to avoid a repeat of what happened the other time after youths and military men clashed and houses were burnt.\n“A man was killed on a bush path while a policeman serving in an oil company was attacked after he had issue with another person."
  },
  {
    "headline": "N250m donation: Davido unveils five-man disbursement committee",
    "summarized_story": "Popstar Davido has named a five-man committee to distribute N250 million he received from associates and friends to orphanages in Nigeria.\nChecks by The Nation shows the committee members were selected from Babcock University and Adeleke University respectively.\nDavido in a statement said: “To oversee the distribution of funds to beneficiaries, I have established a five-person Disbursement Committee.\nThe Church splits Nigeria into three unions – Northern Nigerian Union Conference, Western Nigeria Union Conference and Eastern Nigerian Union Conference.\nShe obtained a Ph.D. in Information Resources Management from Babcock University in 2012."
  },
  {
    "headline": "N250m donation: Davido unveils five-man disbursement committee",
    "summarized_story": "Popstar Davido has named a five-man committee to distribute N250 million he received from associates and friends to orphanages in Nigeria.\nChecks by The Nation shows the committee members were selected from Babcock University and Adeleke University respectively.\nDavido in a statement said: “To oversee the distribution of funds to beneficiaries, I have established a five-person Disbursement Committee.\nThe Church splits Nigeria into three unions – Northern Nigerian Union Conference, Western Nigeria Union Conference and Eastern Nigerian Union Conference.\nShe obtained a Ph.D. in Information Resources Management from Babcock University in 2012."
  },
  {
    "headline": "Senator Gbenga Aluko in sudden death",
    "summarized_story": "A former governorship aspirant in Ekiti State, Senator Gbenga Aluko has died suddenly.\nThe Ode Ekiti born politician reportedly died Saturday evening in Abuja.\nAluko, son of renowned economist, Professor Sam Aluko, was a senator on the PDP platform representing Ekiti South between 1999 and 2003.\nAluko was married to Sileola and the couple have five children, including the footballers Eniola and Sone.\nin 2019, Aluko wanted to become the deputy chairman of APC, but the position was given to Senator Abiola Ajimobi, who died in 2020."
  },
  {
    "headline": "Mexico busts 2 trucks hiding 6 Ghanaians, one Cameroonian, 593 other migrants",
    "summarized_story": "Six Ghanaians and one Cameroonian were among 600 migrants found hidden in the back of two trucks in eastern Mexico on Friday.\nThe migrants were from 12 countries, but majority are from Guatemala, the government’s National Migration Institute (INM) said on Saturday.\nThe institute said 455 of the migrants were male, and 145 female.\nThe people detained would either be sent home or given the chance to have their stay in Mexico regularized, it added.\nMost migrants from Central America and the rest of the world who enter Mexico head for the United States and say they are seeking to escape poverty or violence in their homelands."
  },
  {
    "headline": "2023: PDP Presidential Candidate Will Be Decided By All Stakeholders – Wike",
    "summarized_story": "Nyesom Wike, the governor of Rivers State, has stated that the Peoples Democratic Party’s (PDP) presidential candidate in 2023 will be picked collectively by party stakeholders and at the appropriate time.\nOn Friday, he made the statement during a courtesy visit to Adamawa State Governor, Ahmadu Fintiri, at the Government House in Yola.\nThe successful holding of the PDP National Convention, according to Governor Wike, has put the party in a position to take power in 2023.\nFintiri, as well as other members of the PDP convention planning committee, were also complimented by Wike for conducting a rancor-free convention.\nFintiri commended all the PDP governors and other party stakeholders for the opportunity given to the committee to serve."
  },
  {
    "headline": "Mixed Reactions Trail As Buhari Consider Release Of Nnamdi Kanu",
    "summarized_story": "President Muhammadu Buhari’s announcement that he will examine the petition of some Southeast leaders to free Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, has elicited mixed reactions.\nHowever, a constitutional lawyer, Maduabuchi Idam, contested the president’s claim that ordering Kanu’s release would constitute meddling with the judiciary.\nAbdullahi warned that Kanu’s release may serve as a spring board for other people to commit serious crimes and get away with it.\n“How do you start considering the release of a criminal like Kanu, who ordered killing of people.\n“The president, while considering should also note the damage Kanu is capable of doing if set free,” he told DAILY POST."
  },
  {
    "headline": "BREAKING: EFCC Returns N19.3bn Kogi Salary Bailout ‘Hidden’ In Sterling Bank To CBN.",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has acknowledged receipt of N19,333,333,333 from the Kogi Salary Bailout Account ‘hidden’ at Sterling Bank, according to the Central Bank of Nigeria (CBN).\nUwujaren said the development puts to rest “the campaign of misinformation and unconscionable denials by the Kogi State Government that no fund was recovered from its bailout account”.\nThe CBN in a letter with ref: DFD/DIR/CON/EXT/01/099 informed EFCC Chairman (EFCC) Abdulrasheed Bawa that it had received the money.\nThe commission earlier told the court that Sterling Bank, where the account was domiciled, acknowledged the existence of the said account housing N19,333,333,333.\n0073572696 domiciled in Sterling Bank with the name Kogi State Salary Bailout Account”."
  },
  {
    "headline": "BREAKING: Hidden N19.3bn Kogi salary bail-out funds returned to CBN",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has returned the sum of N19.3 billion salary bail-out funds hidden by the Kogi State government to the Central Bank of Nigeria (CBN).\nThis was contained in a statement signed and released on Friday by Wilson Uwujaren, Head, Media and Publicity of the anti-graft agency.\n“This effectively puts to rest the campaign of misinformation and unconscionable denials by the Kogi State Government that no fund was recovered from its bail out account.\nNo: CR:3000/EFCC/LS/CMU/REC-STE/VOL.4/047 on the above subject and wish to confirm the details of the receipt of the amount as stated below: Bank: Sterling Bank Plc; Amount: N19, 333, 333,333.36; Date of receipt: 04 November, 2021”.\n0073572696 domiciled in Sterling Bank, Plc with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "Breaking: Things get worse for Solskjaer as Watford condemn Manchester United to another Premier League defeat",
    "summarized_story": "More misery was heaped on beleaguered Manchester United manager Ole Gunnar Solskjaer on Saturday as Watford sealed a deserved Premier League victory in front of a packed Vicarage Road.\nBut United goalkeeper David de Gea came to the rescue as the Spaniard saved not one, but two Ismaila Sarr penalties.\nBut the nightmare continued for Solskjaer as Harry Maguire was booked twice in seven minutes and sent off.\nIn the dying moments of the game, to the delight of the loud Watford faithful, Joao Pedro and Dennis added a third and fourth for Watford to pile more heartbreak on the travelling United supporters.\nThe defeat means United have tumbled down the table to eighth on 17 points, while Claudio Ranieri’s side are only four points behind them in 15th."
  },
  {
    "headline": "Revealed! Things women suffered during Anambra governorship election",
    "summarized_story": "Economic violence constituted about 28.6% of the total number of recorded incidents of violence against women.\nPsychological violence constituted only 7.1 % of the total number of recorded incidents, notably false accusation.\nAwka North, Njikoka, and Ogbaru recorded the least at 7.1 % each.\nThe incidence of electoral violence by gender showed that women were the most targeted during the election (42.1%) and men the least (26.3%).\nThe only form of psychological violence recorded was false accusation (100%), while the forms of economic violence recorded put vote buying/selling at 75% and economic punishment at 25%, respectively."
  },
  {
    "headline": "Breaking: Iheanacho, Ndidi on parade as Chelsea sink Leicester City in Premier League clash",
    "summarized_story": "Premier League leaders Chelsea ruthlessly tightened their grip on top spot by punishing the failings of lacklustre Leicester at King Power Stadium.\nAntonio Rudiger continued his habit of scoring against the Foxes with a glancing, looping header from a corner whipped in by ex-Leicester wing-back Ben Chilwell.\nAnother former Foxes favourite, midfielder N’Golo Kante, doubled the lead by firing home from the edge of the box after being allowed to roam 30 yards virtually unchallenged.\nChelsea could have been out of sight by half-time, Chilwell grazing the bar when he should have scored from an early one-on-one with Kasper Schmeichel , who later denied Kante with his legs.\nBoth Nigeria’s Kelechi Iheanacho and Wilfried Ndidi were part of Leicester City squad versus Chelsea."
  },
  {
    "headline": "‘Okadas Being Used For Crime’: Lagos Crushes Over 400 Motorcycles",
    "summarized_story": "﻿The Lagos State Police Taskforce has crushed over 400 motorcycles seized from defaulting riders across the state.\nWith the traffic now, Okadas are being used to commit crime,” Mr Odumosu said.\n“And because of this now, the state government, in its wisdom, decided that Okadas should be restricted in some areas of the state.\n“Some people have insinuated that we sell back the Okadas to those we collect them from, thereby recycling it.\nThat’s why we decided that let the Doubting Thomases know that we don’t sell Okada."
  },
  {
    "headline": "Banditry: Niger Govt Bans Sale Of Motorcycles Across State",
    "summarized_story": "Niger State Governor, Abubakar Bello, has ordered the immediate ban on the sale of motorcycles across the state.\nThis follows the incessant security challenges in parts of the state, in addition to the demands for motorcycles as ransom by bandits and kidnappers in recent times.\nThe Secretary to the State Government, Ahmed Matane, announced the ban in a statement on Saturday in Minna, the state capital.\nHe said the government has also ordered security agencies in the state to ensure effective and strict compliance and enforcement of the ban.\nThe ban comes after the state government restricted the movement of all motorcycles from 6pm to 6am – a directive that is still in force."
  },
  {
    "headline": "95 Students, 449 Others Rescued From Bandits In Three Months – Zamfara Govt",
    "summarized_story": "No fewer than 544 people abducted by bandits in the last three months have been rescued by security operatives in Zamfara State, authorities have said.\nThe state governor, Bello Matawalle, disclosed this on Friday at an event held at the Government House in Gusau, the state capital.\nHe explained that the victims, who included 95 students, were those rescued from bandits since the government announced a set of stringent measures on August 27 to further curb the activities of bandits troubling the peace in the state.\n“Anybody caught breaking this rule will face the appropriate wrath of the law,” Governor Matawalle warned.\nAt the event, Governor Matawalle swore in two new commissioners, 10 special advisers, eight permanent secretaries, and the newly appointed Auditor-General for the state."
  },
  {
    "headline": "2023: We Are Hoping Nigeria Becomes A Strong Lesson For The World – Blinken",
    "summarized_story": "The United States government says it hopes that Nigeria will become a strong example for world democracies when the nation heads to the polls come 2023.\nBlinken who in a recent address warned that ‘democratic recession’ is growing around the world, noted on Friday in Abuja that he is pleased with the fact that President Muhammadu Buhari is willing to respect term limits.\n“The United States firmly believes that it is time to start treating Africa as a subject in geopolitics, and structure it as a major geopolitical player it has become – the facts speak for themselves,” he said.\n“What happens here in Nigeria is felt around the world, and that, in a nutshell, is why I came to Abuja.\nUnited States knows that in most of the challenges and opportunities we face, Africa will make a difference."
  },
  {
    "headline": "Leadway Pensure’s Stake In FBN Belongs To RSA Holders, Says PenCom",
    "summarized_story": "The National Pension Commission has clarified that the equity investments in FBN Holdings made by Leadway Pensure Ltd belong to the Retirement Savings Account (RSA) holders and “not any related party to the pension fund administrator.”PenCom, in a statement, said the clarification was essential due to “several publications in the media alleging breach of its Regulation on investment of pension fund assets by Leadway Pensure Ltd, a licensed Pension Fund Administrator (PFA), in the equities of FBN Holdings Plc.”The Commission “categorically states that the allegations are NOT correct and must have been made based on the lack of understanding of the Investment Regulation issued by the Commission.”READ ALSO: Otedola Acquires ‘Substantial’ Stake In FBN HoldingsPenCom’s clarification comes amid reports that Leadway Pensure’s stake in FBN Holdings had been attributed to its Managing Director, Tunde Hassan-Odukale.\nRead PenCom’s full statement below:"
  },
  {
    "headline": "Senate Transmits Electoral Act Amended Bill 2021 to Presidential Buhari -",
    "summarized_story": "The Senate has transmitted the Electoral Act amendment Bill 2021 to President Muhammadu Buhari for his assent.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare."
  },
  {
    "headline": "Photos: APC National leader, Bola Tinubu arrives Kano to condole with Dangote family",
    "summarized_story": "The national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has arrived in Kano to condole with the Dangote family over the death of Sani.\nLate Sani was the younger brother of the Africa’s richest man and chairman of the Dangote group, Aliko Dangote.\nThe former Lagos arrived the Kano international Airport alongside Kano state governor, Abdullahi Ganduje and other members of the state executive council."
  },
  {
    "headline": "College of Bishops, Council of Imams endorse Okorocha for 2023 presidency -",
    "summarized_story": "Former Governor of Imo state, Rochas Okorocha has been endorsed by a college of Bishops and Councils of Imams to be the country’s president come 2023.\nAt a press briefing in Abuja, they described Rochas Okorocha as an astute administrator, a philanthropist, that has spread his tentacles of good will across the country irrespective of tribe and religion."
  },
  {
    "headline": "Nigeria cannot afford another round of strike in public universities",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, said Nigeria cannot afford another round of strike in public universities.\nHe appealed to the Academic Staff Union of Universities to withdraw the three-week deadline issued to the federal government.\nHe says the union does not like going on strike but compelled in the face of government’s inability to implement agreements.\nAmong the eight issues in conflict are funding for the revitalisation of universities, earned academic allowance, renegotiation of agreement, withheld salaries due to IPPIS problems and proliferation of state universities without adequate funding.\nThe Minister of State for Education, Chukwuemeka Nwajuba, said the Earned Academic allowance will be paid from Monday."
  },
  {
    "headline": "Rotterdam Police Clash with Rioters as Covid Protest Turns Violent",
    "summarized_story": "Dutch police have shot and wounded at least two people after rioting erupted in Rotterdam over new Covid-19 measures.\nProtesters threw rocks and fireworks at them and set police cars ablaze.\nHundreds of protesters had gathered to show their anger at government plans for a Covid vaccine pass, and a ban on fireworks on New Year’s Eve.\nThe Netherlands imposed fresh restrictions last Saturday after recording its highest numbers of Covid cases since the pandemic began.\nThe measures mean restaurants and shops have to close earlier, and sports events must take place behind closed doors."
  },
  {
    "headline": "US, UN Demand Proof of Missing Chinese Tennis Star Peng Shuai Wellbeing",
    "summarized_story": "The UN and the United States on Friday demanded proof of Peng Shuai’s whereabouts, amid rising concern for the Chinese tennis star’s wellbeing.\n“It would be important to have proof of her whereabouts and wellbeing,” Liz Throssell, a spokeswoman for the UN Human Rights Office, told reporters in Geneva.\nI mean, a person is missing,” Djokovic said at the ATP Finals in the Italian city of Turin.\n“The Chinese government has systematically silenced the country’s #MeToo movement,” said Amnesty International’s China researcher Doriane Lau.\n“Given that it also has a zero-tolerance approach to criticism, it is deeply concerning that Peng Shuai appears to be missing,” she said."
  },
  {
    "headline": "San Diego Freeway Frenzy after Armoured Van Spills Money",
    "summarized_story": "A spillage from an armoured van sparked a mad scramble – and police arrests – on a US freeway on Friday morning.\nVideos on social media show money raining down as people scramble to pick up dollars strewn across the road.\nArrests were made, with others who pocketed cash urged to hand it back.\nOne of the armoured vehicle’s doors popped open on the road, causing bags of cash to fall out and break apart at about 09:15 (17:15 GMT) local time.\n“For whatever reason, money was falling out of an armoured car,” California Highway Patrol (CHP) Officer Jim Bettencourt said."
  },
  {
    "headline": "Kyle Rittenhouse: Biden Angry after Teen Cleared of Shootings",
    "summarized_story": "Kyle Rittenhouse, 18, sobbed as he was acquitted of all charges over the shooting in Kenosha on 25 August 2020.\nThe trial heard that Mr Rosenbaum had been acting erratically that night and chased Mr Rittenhouse before trying to grab his gun.\nMr Huber was then killed after striking Mr Rittenhouse in the head or neck with a skateboard.\nAfter the verdict, Mr Rittenhouse’s defence attorney Mark Richards said of his client: “He wants to get on with his life.\nIn the footage, Mr Rittenhouse describes waking up in a cold sweat because of “scary” dreams he has every night about what happened."
  },
  {
    "headline": "Tesla Drivers Locked out of Their Cars after Outage Struck App",
    "summarized_story": "Tesla drivers say they have been locked out of their cars after an outage struck the carmaker’s app.\nDozens of owners posted on social media about seeing an error message on the mobile app that was preventing them from connecting to their vehicles.\nTesla chief executive Elon Musk personally responded to one complaint from a driver in South Korea, saying on Twitter: “Checking.”Mr Musk later said the app was coming back online.\nThe Tesla app is used as a key by drivers to unlock and start their cars.\nAbout 500 users reported an error on the app at around 16:40 ET (21:40 GMT) on Friday, according to the outage tracking site DownDetector."
  }
]