[
  {
    "headline": "CNG condemns sale of schools, says insecurity worsening education quality",
    "summarized_story": "THE Coalition of Northern Groups on Sunday met some northern civil society organisations, including students’ union bodies from the 19 northern states and Abuja, over the disturbing insecurity occasioned by kidnapping, banditry and other related crimes ravaging the region.\nAccording to the groups numbering over 50, the sundry kidnapping of schoolchildren by bandits, leading to the closure of schools in the North, is unacceptable.\nThey demanded a review of the suspension of Mr. Kyari and an immediate revert to proper administrative procedures relating to discipline.\nOn insecurity, they decried the potential threat to educational accessibility and affordability to children of the majority poor, posed by incessant hikes in tuition in several states across the region.\nOn the INEC’s voter registration, they noted that weekly statistics released by the commission showed that the North was lagging by a wide margin in the ongoing exercise."
  },
  {
    "headline": "A’Ibom gov’s wife worries as seven fathers rape daughters",
    "summarized_story": "Wife of the governnor of Akwa Ibom State and founder of the Family Empowerment and Youth Reorientation Path-initiative (FEYReP) Dr Martha Emmanuel, has said her organisation facilitated the arrest of seven suspects over alleged raping and defilement their daughters in the state.\nMrs Emmanuel said this in Uyo, Akwa Ibom State capital on Sunday.\nShe expressed worry over the disturbing and increasing cases of sodomy in the state, adding that her organisation would ensure that the perpetrators were convicted.\nAccording to her FEYRep has partnered the judiciary and police, adding that justice must be done to the accused.\n“As I speak we have about seven fathers in police cell awaiting trial for defiling their daughters."
  },
  {
    "headline": "Oke-Ogun rallies support for Sunday Igboho",
    "summarized_story": "Sunday Igboho is from Igboho in Oorelope local government area of Oke-ogun in Oyo State.\nVarious provisions of the African Charter on Human and Peoples’ Rights and the International Covenant on Civil and Political Rights, to which Nigeria is also a party, have similar provisions.\n“From available reports, issues surrounding Sunday Igboho are political in nature because what he was advocating have something to do with how his people were being treated.\n“Part of what Sunday Igboho advocated was echoed penultimate week by Emir of Muri in Taraba state.\n“There is no difference between what Sunday Igboho was advocating and what Emir of Muri has done."
  },
  {
    "headline": "Trainers set to train public, private executives on reforms, governance",
    "summarized_story": "In a bid to improve on administration in public institutions and strengthen governance, a leading institute for higher education in the country, Executive Trainers Limited, has organised a five-day international executive training programme for public and private officers.\nAREAD ALSOUnderstanding House of Reps transparency verdict on NEDCThemed “Reforming Public Institutions and Strengthening Governance”, the programme seeks to explore the tenets of capacity building, corporate governance and administrative excellence in both private and public workplaces.\nOrganisers say the event is coming on the heels of the need to appropriate things within the context of standard best practices.\nAccording to the Chief Executive of Executive Trainers, Ajoke Ogunsan, “as an organisation, we have always looked for every opportunity to change the dynamics of corporate administration and governance in both public and private sectors.\nExecutive Trainers Limited is Nigeria’s foremost indigenous training consulting firm which focuses on research based training, compliance coaching and higher education consulting."
  },
  {
    "headline": "Sit-at-Home: 29 paraded in Imo for allegedly planning attacks",
    "summarized_story": "…3 women arrested for offering catering services…Masked suspect vows to expose members of ESN in OrluBy Chinonso Alozie, OwerriThe Imo State Police Command on Sunday, paraded 29 suspected members of the Eastern Security Network, ESN, allegedly planning to attack the State ahead of the Sit-at-home order by the Indigenous People of Biafra, IPOB, on Monday.\nThe State Commissioner of Police, Abutu Yaro, who paraded the suspects at the Command’s headquarters in Owerri, said they were arrested at the various camps of ESN, in the State.\nAlso, among the arrested were three women who were alleged to be offering catering services to the members of ESN.\nAlso, arrested were some women who offer them catering services.”“I am glad to report Imo has remained largely peaceful.\nWe must always be ahead of them.”In another development, one of the paraded suspects, who was masked confessed to being a member of the ESN."
  },
  {
    "headline": "Overloading: One dead, 15 injured in Ondo boat mishap",
    "summarized_story": "Dayo Johnson AkureOne person reportedly died while 15 others sustained injuries weekend during a boat mishap in ldiogba, oil-rich ilaje council area of Ondo state.\nVanguard gathered that the boat was overloaded with passengers and goods during the market day in lgbokoda town when the incident occurred.\nThe engine of the boat reportedly failed and the wave of the sea reportedly capsized the boat.\nConcerted efforts of local divers and officials of the Nigeria Security and Civil Defence Corps NSCDC Ondo State Command averted more casualties after the mishap.\nIt issued a stern warning that “any boat transporter caught in the act of risking the lives of innocent citizens by overspeeding and overloading would be arrested and prosecuted under the law."
  },
  {
    "headline": "Anambra Governorship: Ubani demands action on disciplinary recommendation against judges, lawyers",
    "summarized_story": "Commending the recommendation of Justice Nwosu-Iheme, Ubani noted that the NJC and NBA must urgently act on the advice of the judge so as to restore the hope of the common man on the judiciary.\nHe said: “The recent happening in the electoral climate in Anambra State deserves to attract serious concern by all and sundry in the legal profession.\n“Every electoral season in Anambra is usually hot with bizarre happenings, especially court cases that are notoriously unprecedented.\n“Our electoral jurisprudence is replete with so many cases that have emanated from Anambra State since the return to democratic rule in 1999.\n“The most litigious state in Nigeria in electoral matters, no doubt, remains Anambra State."
  },
  {
    "headline": "Senate tells NBET to refund N132 million spent on drivers’ uniforms",
    "summarized_story": "The Senate Committee on Public Accounts has frowned at a whopping sum of N132 million expenses on sewing of drivers’ uniforms by the Nigeria Bulk Electricity Trading (NBET), saying the money should be refunded into the Consolidated Revenue Fund (CRF).\nThe Senator Mathew Uroghide led Committee while probing financial activities of the agency uncovered the sum ofN132, 066,948.00 million, expended on drivers’ uniforms, overseas training etc.\nThe Senate Committee’s investigation showed that the purported overseas training which cost NBET the sum of N95.320 million never took place, while the sum of N34.583 million was spent on services that the NBET management could not defend before the panel.\nOn drivers’ uniforms, the NBET management said it spent the sum of N2.583 million, an amount considered outrageous and a waste of government resources.\n“Payment of N2,583,000.00 million to a contractor for production of uniforms of outsourced drivers who were supposed to be kitted by their firm and not NBET."
  },
  {
    "headline": "August Meeting: Gov. Ugwuanyi lauds women’s contributions in nation building",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State has commended women of the state for the noble roles they play in the development of the state in particular and the nation in general.\nUgwuanyi stressed that women, worldwide, have contributed immensely in the development of the society.\nUgwuanyi revealed that a woman was elected as Chairman of a local government area under his administration, for the first time in the history of Enugu State.\nMajor highlights of the event also include a march-past by women from the 17 LGAs and inspection of farm produce from the council areas by Mrs. Ugwuanyi.\nChijioke Edeoga, his Finance counterpart, Mrs. Adaonah Kene-Uyanwunne, Chairman, Governing Council, Enugu State College of Education (Technical) (ESCET), Amb."
  },
  {
    "headline": "BREAKING: David Ajiboye, Yinka Ayefele’s Fresh FM Station Manager is dead",
    "summarized_story": "David Ajiboye, the Station Manager at Yinka Ayefele’s Fresh 106.9 FM in Ado-Ekiti, Ekiti State, is dead.\nA statement by Samson Akindele, announced the demise on behalf of the management of Fresh FM Nigeria and Merry Makers Band.\nAjiboye died Sunday evening at an Ibadan hospital after a brief illness which lasted for a few days.\nHe was a foundation member of the music arm of Yinka Ayefele Limited as the publicist to Yinka Ayefele and his band.\nAjiboye assisted Yinka Ayefele as a partner and later as a management staff member of Fresh 105.9 FM, Ibadan, from the ideation period to fruition in 2015."
  },
  {
    "headline": "New Islamic year: Katsina govt declares Monday public holiday",
    "summarized_story": "The Katsina State Government has announced Monday, August 9, 2021, as a public holiday to commemorate the Islamic Calendar New year referred to as the ‘1st of Muharram, 1443 hijra.’This was disclosed in a press statement by the state’s Commissioner for information, Home Affairs and Culture, Abdulkarim Sirika.\nHe said the essence of declaring the holiday was to remind Muslims in the state about the Islamic Calendar and its significance in their activities.\nThe governor in the statement tasked the people of the state to use the period to reflect on the teaching of Islam and practice of the Holy Prophet Muhammad (PBUH) and ensure they live their lives in accordance to the teachings of Islam.\nGovernor Masari also admonished Muslims and other religious faithful to pray for the peace, unity and progress of the country during the holiday."
  },
  {
    "headline": "Yoruba Nation: I won’t return to Nigeria until Igboho is released – Akintoye",
    "summarized_story": "The leader of Ilana Omo Oodua, Professor Banji Akintoye, has declared that he will not return to Nigeria unless Sunday Adeyemo also known as Sunday Igboho is released from prison.\nAkintoye has said that he has left Nigeria for Benin Republic.\nHe, however, insisted that he will not return to Nigeria unless Igboho is released.\nAkintoye confirmed his movement from Nigeria to Benin Republic in a statement signed by his Communications Manager, Mr. Maxwell Adeleye.\nI have even written a book on the subject which is already being used as a manual by Yoruba self-determination advocates and organizations."
  },
  {
    "headline": "Groom arrested on wedding night after shooting bride’s friend",
    "summarized_story": "A groom still wearing his tuxedo was arrested on his wedding night after he shot a man he suspected of having an affair with his new wife.\nAn verbal argument broke out in the car with Jones accusing the friend of being romantically involved with his new wife.\nAccording to investigators, the inebriated Jones pulled out a gun and the unidentified friend bolted out of the vehicle.\nThe enraged Jones unleashed a barrage of bullets, hitting the bride’s friend in the leg.\nWilliams, still wearing her wedding gown according to witnesses, barricaded herself inside the ambulance while Jones tried to force his way into the vehicle, cops said."
  },
  {
    "headline": "Woman sues McDonald’s, claims burger advert compelled her to break fast",
    "summarized_story": "A Russian woman is suing fast food giant McDonald’s after an advert showing their cheeseburgers allegedly made her break her fast during Lent.\nKsenia Ovchinnikova, an Orthodox Christian from Omsk, Russia, claims that seeing McDonald’s adverts made her break her fast for Lent in 2019.\nAt the time, she was attempting to stay away from meat and other animal products, Daily Mail reports.\nFor Orthodox Christians following the Julian calendar, Lent is a strict period as they are expected to stay away from meat, meat by-products, poultry, eggs, and dairy for the entire period.\nOvchinnikova claims that she hadn’t eaten meat in a month when the fast-food chain’s adverts for burgers and nuggets made her break her fast in April 2019."
  },
  {
    "headline": "Five fundamental questions around the future of Messi",
    "summarized_story": "Barcelona stunned the football world and sent suitors scurrying for their chequebooks when they announced that Lionel Messi would be leaving the club this summer.\nHere, the PA news agency takes a look at some of the issues behind a momentous decision.\nMessi signalled his intention to leave the Nou Camp last summer, believing he could do so on a free transfer under the terms of his existing contract.\nA 700million Euros – around £629million – buy-out clause prevented him from doing so, but the seeds were sown regardless of the club’s financial difficulties.\nIf not Barcelona, then where next for Messi?"
  },
  {
    "headline": "How I healed the son of my ex-girlfriend after I met Christ — Adeboye",
    "summarized_story": "He also went on to narrate how he healed the son of one of his ex-girlfriends.\nPastor Adeboye revealed that the young woman had a lame child and was shocked to see him as the man of God who intended to heal her son.\nHe said;“I told you that before I gave my life to Jesus Christ, I had many, many girlfriends.\nShe went her way; I went my way.\nIf he prays for the child, the child will walk."
  },
  {
    "headline": "BBNaija: Mercy Eke reveals favourite housemate",
    "summarized_story": "Big Brother Naija Pepper Dem 2019 winner, Mercy Eke, has revealed who she is supporting to be the winner of the reality show this year.\nMercy Eke, in a post on Friday via her Instagram page, disclosed that she will be supporting Maria.\n“Welcome onboard Marian airline we are currently cruising at an altitude 13days expecting to land by 77days ahead.\n“Please fasten your seat belts at this time, turn off all negative devices for the duration of this flight.\n“Thank you for choosing Marian airline."
  },
  {
    "headline": "School abduction: NANS asks FG to declare bandits terrorist group",
    "summarized_story": "From Priscilla, Ediare Ado-EkitiThe National Association of Nigerian Students(NANS) has urged President Muhammadu Buhari to declare bandits kidnapping students in the northern part of the country as terrorists.\nNANS said anyone with the propensity to kidnap and kill students in large numbers, as currently witnessed in some northern states, should be considered a terrorist by any sovereign country.\nWith this development, Oyeniyi said he has reunited with the main body and affirmed his loyalty to Asefon-led national union.\nHe said he had met with different stakeholders in northern states to plead that they provide security for school children.\nI have called on the Federal Government to declare bandits abducting students in the North West and North Central as terrorists, but the reverse has been the case."
  },
  {
    "headline": "Okunbo: Buhari, Obaseki, Kalu, CMA, Agba, Oshiomhole mourn",
    "summarized_story": "From Tony Osauzo, Benin and Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, Governor Godwin Obaseki, the Commonwealth Medical Association (CMA) and others have expressed sadness over the death of Captain Idahosa (Hosa) Okunbo, chairman of Ocean Marine Solutions Limited.\nThe renowned businessman and philanthropist died in a London hospital on Saturday at 63, a statement by the family confirmed yesterday.\nKalu, while advising the family of the deceased to uphold the legacies of Okunbo, prayed for strength and peace for the deceased’s family in this sorrowful period.\nA statement by the President, Commonwealth Medical Association (CMA), Osahon Enabulele, described the death as tragic.\n“With his death, Edo people have lost one of its greatest sons."
  },
  {
    "headline": "BREAKING: PDP crisis: Reps caucus asks Secondus to resign immediately",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) caucus in the House of Representatives, on Sunday night, called for the immediate resignation of the party’s national chairman, Uche Secondus.\nThe caucus, in a statement jointly signed Kingsley Chinda and Chukwuka Onyema, leader and deputy leader respectively, said this part of resolution reached at an online meeting of the caucus, on Sunday night.\nThe Caucus said the continued stay in office by Secondus for the remaining three months of his tenure will do ” grave injustice” to the opposition party.\nThe lawmakers charged the PDP Board of Trustees (BoT) and the Governors Forum of the PDP to “ensure immediate and firm resolution of current challenges so as to enable a re-engineering, re-focusing process” that would restore the hope of Nigerians in the party.\nThe statement read” members of the PDP House of Reps caucus met and deliberated extensively on various aspects of concern being expressed by members of the party across the federation."
  },
  {
    "headline": "Kalu mourns demise of business mogul, Idahosa Okunbo – The Sun Nigeria",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has described the demise of business mogul and Chieftain of the All Progressives Congress (APC), Captain Idahosa Okunbo as a painful loss to mankind.\nThe former Governor, while advising the family of the deceased to uphold the legacies of Okunbo, prayed for strength and peace for the deceased’s family in this sorrowful period.\nIn a condolence message, the Senate Chief Whip, noted that the late Okunbo was successful in all facets of life.\nHe said, “On behalf of the people of Abia North Senatorial district, I commiserate with the government and people of Edo State over the passing of prominent businessman, Captain Idahosa Okunbo.\nKalu prayed to God to grant the late businessman eternal rest."
  },
  {
    "headline": "Nnamdi Kanu’s trial: IPOB suspends sit-at-home order",
    "summarized_story": "From Okey Sampson, UmuahiaThe planned sit-at-home ordered by the Indigenous People of Biafra (IPOB) scheduled to have commenced tomorrow (Monday) has been suspended due to the just began National Examination Council (NECO) Exam for junior secondary schools.\nA new date for the commencement of the sit-at-home order, IPOB said would be announced later.\n“IPOB has listened to pleas from well-meaning individuals and groups within and outside Biafra land that we consider the fate of our children who will be involved in the NECO Exam and based on that, we decided to shift grounds over the sit-at-home order”.\nThe statement added that IPOB on its part, having realized the academic deprivation the already marginalized Biafra students who entered for this year’s NECO would suffer, decided to suspend the sit-at-home order to a later date, to allow the students take their exams.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Breaking: Captain Hosa Okunbo is Dead",
    "summarized_story": "Business magnate, Captain Idahosa Wells Okunbo, is dead.\nThe Edo-born late businessman, politician and philanthropist was chairman of Ocean Marine Solutions Limited (OMSL).\nBorn on January 7, 1958 in Benin City, into the family of Reverend Robert Amos Okunbo, a clergyman and teacher, Captain Okunbo attended Federal Government College, Warri.\nHe was a flight captain with Intercontinental Airlines and also worked at Okada Airlines.\nThe Federal Government in January cancelled the lucrative but controversial Secure Anchorage Area (SAA) contract handled by his company, OMSL."
  },
  {
    "headline": "ACF, Afenifere Back Babangida’s Proposal on Next President’s Age",
    "summarized_story": "While the ACF backed Babangida’s position on the next president’s age limit, the MBF also supported the country’s former military leader that corruption was less during his regime than now.\nThe socio-political group, however, argued that a president’s performance does not depend on his age but his vision and the country’s political structure.\nThe ACF also endorsed the suggestion by the former military president on the age limit of the next president.\n“IBB is an experienced military politician who ruled this country for eight years as the one and only military president.\n“We hold him in ACF in very high esteem and we urge Nigerians to take his ideas seriously”, the ACF spokesman explained."
  },
  {
    "headline": "PDP Govs, BoT C’ttee Weigh Options to Rescue Party ahead of 2023",
    "summarized_story": "Investigation revealed that the PDP governors would meet in Abuja on Monday to discuss and take a position ahead of their meeting with the PDP BoT committee.\nOthers are a former Senate President and Secretary of the PDP BoT, Senator Adolphus Wabara; and another former Senate President, Dr. Iyorchia Ayu, among others.\nTo this end, the governors and the BoT committee are weighing some options to save the party from implosion and strengthen it ahead of the 2023 general election.\nThe PDP BoT had at their last meeting laid to rest the alleged plot to remove Secondus and the NWC, after a heated argument.\nHe stressed the need for the Cross River PDP to remain united and prepared to put up a common front and agenda as the dynamics of politics changed within the state."
  },
  {
    "headline": "Hollyfrontier to Acquire 97-year-old 115,000bpd Refinery for $2.6bn",
    "summarized_story": "*NNPC targets 130,000bpd in Dangote’s brand new refinery for $2.7bnEmmanuel Addeh in AbujaAs the Nigerian National Petroleum Corporation (NNPC) targets to acquire 20 per cent stake, translating to 130,000 barrels per day (bpd) capacity from the brand new 650,000 bpd Dangote Refinery for $2.7 billion, Hollyfrontier is acquiring 97-year-old 115,000 bpd refinery from Sinclair Oil for $2.6 billion.\nOut of this 115,000 bpd capacity, the first refinery with a capacity of 85,000 bpd was built in 1924, that is 97 years ago, while the second refinery with a capacity of 30,000 bpd, was built in 1992.\nThe Dangote refinery, with a single crude oil distillation unit, when completed, around mid-next year will be the largest single-train refinery in the world.\nMost of the losses were due to the activities of disgruntled community workers and contractors who had issues to sort out with the oil companies.\nIn June, Batan station was shut down due to unpaid community workers’ and contractors’ salaries, the same way that Kokori station was closed due to the same problem."
  },
  {
    "headline": "IBB on Corruption: With the Fact on Ground Now, My Govt a Saint",
    "summarized_story": "Answering directly on the allegation that he popularised corruption, Babangida, who was head of state between 1985 and 1993, said: “Well, you can’t compare it with the fact on the ground now.\nFrom what I read, from analysis, I think we are saints when compared to what is happening under a democratic dispensation.\n“I sacked a governor for misappropriating less than N313, 000; today billions are there in the streets.\nThose who have stolen billions are in courts, and are now parading themselves on the streets.\nHe denied being anti-media, claiming that he libralised it, leading to the birth of many private media, both print and electronic."
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Soldiers Watched As Invaders Killed My People, Said No Order To Stop Attack—Nigerian Monarch",
    "summarized_story": "The paramount ruler of Irigwe ethnic nationality in Plateau State, The Bra Ngwe Irigwe, Rt Rev Ronku Aka, has said soldiers watched as his people were killed by suspected herdsmen during a recent invasion of Bassa Local Government Area.\nAccording to the monarch, the soldiers deployed in the area said they could not defend the helpless victims because there was no instruction that they should do so.\n“At peace meetings, the governor will give order but the security men will go and do a different thing.\n“During the recent attacks in my communities, the soldiers and other security operatives were around.\n“When I enquired what was happening, some soldiers cried to me that they did not receive the order to repel the attackers on the communities."
  },
  {
    "headline": "Soldiers Watched As Invaders Killed My People, Said No Order To Stop Attack—Nigerian Monarch",
    "summarized_story": "The paramount ruler of Irigwe ethnic nationality in Plateau State, The Bra Ngwe Irigwe, Rt Rev Ronku Aka, has said soldiers watched as his people were killed by suspected herdsmen during a recent invasion of Bassa Local Government Area.\nAccording to the monarch, the soldiers deployed in the area said they could not defend the helpless victims because there was no instruction that they should do so.\n“At peace meetings, the governor will give order but the security men will go and do a different thing.\n“During the recent attacks in my communities, the soldiers and other security operatives were around.\n“When I enquired what was happening, some soldiers cried to me that they did not receive the order to repel the attackers on the communities."
  },
  {
    "headline": "FACT CHECK: Born in 1960? Is Tunji Disu, new head of Police IRT, due for retirement?",
    "summarized_story": "Following Disu’s appointment, media reports began making the rounds, claiming that Disu was born in Southwest Nigeria on April 17, 1960.\nBeyond news reports, multiple biographies on the internet stated that Disu “was born in Southwest Nigeria on 17 April, 1960”.\nI can affirm that DCP Tunji Disu was born on the 13th of April, 1966 according to the police records,” Mba told TheCable by phone.\nThe records show that Disu was born in 1966 and only became 55 years old in April 2021.\nAccording to documents seen by TheCable, the new head of the Police IRT is not due for retirement until April 2026."
  },
  {
    "headline": "FACT CHECK: Born in 1960? Is Tunji Disu, new head of Police IRT, due for retirement?",
    "summarized_story": "Following Disu’s appointment, media reports began making the rounds, claiming that Disu was born in Southwest Nigeria on April 17, 1960.\nBeyond news reports, multiple biographies on the internet stated that Disu “was born in Southwest Nigeria on 17 April, 1960”.\nI can affirm that DCP Tunji Disu was born on the 13th of April, 1966 according to the police records,” Mba told TheCable by phone.\nThe records show that Disu was born in 1966 and only became 55 years old in April 2021.\nAccording to documents seen by TheCable, the new head of the Police IRT is not due for retirement until April 2026."
  },
  {
    "headline": "FG postpones rollout of second batch of COVID-19 vaccines",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has postponed the rollout of the second batch of vaccines.\nAdvertisementHe, however, failed to give a new date for the rollout of the vaccines.\nThe PSC had earlier announced that health officials will begin administering the second batch on Tuesday.\nThe federal government had received 4.08m doses of the Moderna COVID-19 vaccine from the United States on August 1.\nIt is the second batch of vaccines received by Nigeria after the country had run out of the initial four million doses of the AstraZeneca COVID-19 vaccine received from the COVAX facility."
  },
  {
    "headline": "FG postpones rollout of second batch of COVID-19 vaccines",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has postponed the rollout of the second batch of vaccines.\nAdvertisementHe, however, failed to give a new date for the rollout of the vaccines.\nThe PSC had earlier announced that health officials will begin administering the second batch on Tuesday.\nThe federal government had received 4.08m doses of the Moderna COVID-19 vaccine from the United States on August 1.\nIt is the second batch of vaccines received by Nigeria after the country had run out of the initial four million doses of the AstraZeneca COVID-19 vaccine received from the COVAX facility."
  },
  {
    "headline": "Falana: US will get DCP Kyari to face trial, whether he likes it or not",
    "summarized_story": "Femi Falana, human rights lawyer, says the US government will get Abba Kyari, the deputy commissioner of police, to face trial whether he likes it or not.\nAdvertisementFalana spoke on Sunday during a Twitter Spaces conversation hosted by Rinu Oduala, the rights advocate and community organiser.\nSpeaking on the development, Falana said Kyari will be made to stand trial no matter how long it takes.\n“Whether Abba Kyari likes it or not, the Americans are going to get him to stand trial,” he said.\nOn the role of women, Falana said no development or democratic growth can take place without active female participation."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "Nigerian IT company, Decagon, raises $1.5 million seed round to train software engineers",
    "summarized_story": "Share this article:Nigerian IT company, Decagon, has raised $1.5 million in a seed round to support its mission of transforming exceptional software engineers, many of whom come from underrepresented backgrounds.\nKepple Africa and Timon Capital led the round, with investments from Paul Kokoricha — ACA Managing Partner — and Tokyo-based UNITED Inc.Additionally, it has raised a $25 million student loan financing facility.\nAdvertisementFounded in 2018 by Chika Nwobi (CEO), Decagon trains and connects engineers to work remotely with local and international companies.\nHowever, if the trainees cannot afford the programme, student loan financing will cover the cost.\nDecagon claims to be the first in Nigeria to provide students with such merit-based loan financing."
  },
  {
    "headline": "MainOne’s new data centre could usher in exciting connectivity age in Ghana",
    "summarized_story": "MainOne is not resting on its laurels, as MDXi announced its data centre facility expansion to Appolonia City in Greater Accra, Ghana.\nMainOne’s data centre launch in GhanaMainOne’s past initiatives suggest launching its data centre in Ghana as a natural progression that aligns with its connectivity ambitions.\nIt reportedly features private data centre suites, precision cooling, and enterprise-grade 24×7 multi-level security and video surveillance.\nAfricanus Mensah, Chairman, MainOne Ghana, believes that the data centre will impact Ghana’s business growth and human capital development.\nWhile MainOne’s data centre could offer several benefits for businesses and individuals in Ghana, this is only one part of the puzzle."
  },
  {
    "headline": "MVX’s seed round, Cellulant’s Ghana licence, Revio’s seed round",
    "summarized_story": "Source TechCrunchNigerian digital freight company, MVX, has raised a $1.3 million seed round to scale its operations, hire staff, and improve its technology.\nThe freight company launched MVXtransit, a digital freight booking platform that helped cargo owners find deals on moving containers.\nTingg is a digital payments network that allows businesses and their customers to accept and make payments easily.\nThis announcement is coming after Cellulant was granted a Payment Services Provider (PSP) licence by the Central Bank of Ghana (CBG).\nRevio claims it supports all currencies and integrates with the African payments startup, Flutterwave, to allow its SaaS clients to sell their products to all African customers."
  },
  {
    "headline": "Obaseki celebrates Urhoghide at 66, says Senator was instrumental to his re-election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has hailed the Senator representing Edo South Senatorial District, Senator Matthew Urhoghide, for his role in his re-election.\nThe governor made the remarks at a reception in celebration of Senator Urhoghide’s 66th birthday anniversary in Benin City.\nI am in the Peoples Democratic Party (PDP) and the governor of Edo State today largely because of his efforts and persuasion.\n“Senator Urhoghide said to me, because of you, I am not going to contest.\n“For the first time in our history, every local government in Edo South came together and voted as one."
  },
  {
    "headline": "Obaseki hails Archbishop Akubeze, salutes contribution to state’s devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has celebrated the Catholic Archbishop of Benin Archdiocese, His Grace, Most Rev.\nDr. Augustine O. Akubeze on his tenth year anniversary as an Archbishop, saluting his contributions to the development of Edo State and Nigeria.\nPhilip Shaibu; Secretary to the State Government, Osarodion Ogie, former Governor of Cross Rivers State, Donald Duke; Chief of Staff to Edo State Governor, Osaigbovo Iyoha and the Esama of Benin, Chief Gabriel Igbinedion.\nOgbeide Ihama and a former National Chairman of the All Progressives Congress (APC), Chief John Odigie Oyegun, among others.\nUnveiling the book titled, “Exercise of Prophetic Ministry, selected Homilies and Addresses of Archbishop Akubeze,” the governor hailed the Archbishop for his sacrifice and selfless service to God and humanity."
  },
  {
    "headline": "World Breastfeeding Week: Edo mobilizes community leaders, caregivers, others on sensitization drive – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged community leaders and caregivers to intensify efforts in raising awareness on the importance of breastfeeding, which provides infants with best start to life.\nAddressing journalists in Benin City, the Executive Secretary, Edo State Primary Health Care Development Agency (EDSPHCDA), Dr. (Mrs).\nBreastfeeding is a fundamental intervention for growth and development of children,” the health expert added.\nErhabor further urged parents, caregivers, and community leaders to make the breastfeeding week celebration count for every mother and child in the community, noting, “Breastfeeding is of great benefit to the baby, the mother, family, community and the nation.\n“At the community level, breastfeeding helps to reduce poverty which is in line with UN SDGs for 2030 – No poverty."
  },
  {
    "headline": "Obaseki constitutes 8-man steering c’ttee to establish Edo Diaspora Agency – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has constituted an 8-man steering committee chaired by the State Head of Service, Anthony O. Okungbowa Esq., to oversee the establishment of the Edo State Diaspora Agency.\nIn a statement, Secretary to Edo State Government, Osarodion Ogie Esq., said Governor Obaseki approved the appointment of the State Head of Service, Anthony O. Okungbowa Esq.\nas Chairman of the Steering Committee, while Mr. Isaac Ebewele will serve as Secretary.\nOther members of the committee are: the Ambassador of the African Bar Association for East, Central and Southern Africa, Ambassador Adesuwa Matthew Beeki Uwaifo; Dr. Loretta Oduware Ogboro-Okor; Mr. Chris Osarumwense, and Mr. Soni Irabor.\nOthers include President, Nigerians in Diaspora Organisation (NIDO), Dr. Johnson Odibo and Prof. Isa Odili."
  },
  {
    "headline": "COVID-19: Nigeria postpones second batch of vaccination",
    "summarized_story": "ADVERTISEMENTThe Nigerian government has announced the postponement of the second phase of vaccination against the rampaging coronavirus disease.\nAs of Saturday, Nigeria has recorded 177,615 coronavirus cases and 2,185 fatalities, data from the Nigeria Centre for Disease Control (NCDC) shows.\nThe Oxford-AstraZeneca COVID-19 vaccine with which Nigeria commenced vaccination, is given in double doses.\nA person is required to come back for a second shot, some weeks after taking the first jab.\nHowever, following the exhaustion of approximately four million doses of vaccines delivered through the COVAX facility, the government announced the close of vaccination of the first batch."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "IPOB suspends sit-at-home order due to NECO exams",
    "summarized_story": "Separatist group, the Indigenous People of Biafra (IPOB), has suspended a sit-at-home order it issued for Monday, tomorrow, due to the National Examination Council (NECO) examination for junior secondary schools scheduled to start from Monday.\nIPOB stated that a new date for the commencement of the sit-at-home order would be announced later.\nThe pro-Biafra group had issued a sit-at-home order throughout Igboland in solidarity with its detained leader, Mazi Nnamdi Kanu, starting from Monday, August 9, until he is released.\n“IPOB having realized the academic deprivation the already marginalized Biafra students who entered for this year’s NECO would suffer, decided to suspend the sit-at-home order to a later date, to allow the students to take their examinations.\nThe statement further explained that the sit-at-home order has not been cancelled, but only suspended for the sake of Biafra students taking this year’s NECO examination and called on IPOB members to await further directives."
  },
  {
    "headline": "U.S. wins gold in female basketball to beat China in medals race",
    "summarized_story": "The U.S. women’s basketball team beat Japan to earn its seventh consecutive gold medal.\nIn what was a continuation of dominance, the U.S. women beat Japan, 90-75, on Sunday afternoon at Saitama Super Arena to claim its seventh consecutive gold medal.\nThe gold medal meant that Team USA got 113 total medals to beat China to second place in the medal table.\nChina finished second with 88, the Russian Olympic Committee finished third with 71, Britain finished fourth with 65 and Japan, the host nation, finished fifth with 58.\nMeanwhile, Nigeria finished 74th with one silver medal and one bronze medal, behind other African countries such as Kenya, South Africa, among others."
  },
  {
    "headline": "Senate c’tee recommends creation, Adada, Anioma, Ijebu, other new states",
    "summarized_story": "Nigerian Senate Committee on Constitution Review has recommended the creation of 20 new states, including Adada, Anioma, Ijebu states, among others.\nThe committee also proposed that referendum be conducted for the 20 new states by the Independent National Electoral Commission.\nSome of the proposed states are:– ITAI State (from Akwa Ibom State)– State status for the FCT-Katagum State from Bauchi State– Okura State from Kogi East– Adada State from Enugu State– Gurara State from Kaduna South– Ijebu State from Ogun State-Ibadan State from Oyo State– Tiga State from Kano State-Ghari State from Kano State– Amana State from Adamawa– Gongola State from Adamawa– Mambilla State from Taraba State– Savannah State from Borno State-Okun state from Kogi State.\nEarlier, The House of Representatives has passed for second reading, a bill seeking to amend the 1999 Constitution to allow creation of state police and legalise regional security outfits.\nThe current police system will be decentralised by moving police from the Exclusive Legislative List to the Concurrent List, NAN reported."
  },
  {
    "headline": "Business magnate, Captain Wells Okunbo dies at 63",
    "summarized_story": "Edo State born Business magnate, Captain Idahosa Wells Okunbo, has died, aged 63.\nOkunbo died on Sunday morning in London of pancreatic cancer.\nHe was said to have been diagnosed with the disease last September.\nHe was a known politician and philanthropist and chairman of Ocean Marine Solutions (OMS)."
  },
  {
    "headline": "Vie For Presidency In 2023, Group Urges Osinbajo",
    "summarized_story": "A youth group under the auspices of Osinbajo Grassroots Organisation (OGO), has called on Vice President Yemi Osinbajo to throw his hat in the ring and contest the 2023 presidential election to succeed incumbent President Muhammadu Buhari.\nThe group made the call in Abuja on Sunday while marking Osinbajo Day, a day they said has been set aside to celebrate the vice president annually as an icon and the future of Nigeria’s democracy and leadership.\nMembers of the group displayed placards with various inscriptions like “In Osinbajo, We See A Loyal Leader”, “Thank You Buhari For Giving Us Osinbajo”, “Let Osinbajo Lead!”, “Nigerians Love Osinbajo, “Osinbajo: The Future Beckons”, among others.\n“President Buhari has built a solid foundation, we therefore must ensure that whoever comes after him will rather build a beautiful edifice on it than demolish it.\n“We are appealing to Vice President Yemi Osinbajo to throw his hat into the ring and take up higher responsibility having worked diligently with the President and with great results to show,” Ojo said."
  },
  {
    "headline": "Vie For Presidency In 2023, Group Urges Osinbajo",
    "summarized_story": "A youth group under the auspices of Osinbajo Grassroots Organisation (OGO), has called on Vice President Yemi Osinbajo to throw his hat in the ring and contest the 2023 presidential election to succeed incumbent President Muhammadu Buhari.\nThe group made the call in Abuja on Sunday while marking Osinbajo Day, a day they said has been set aside to celebrate the vice president annually as an icon and the future of Nigeria’s democracy and leadership.\nMembers of the group displayed placards with various inscriptions like “In Osinbajo, We See A Loyal Leader”, “Thank You Buhari For Giving Us Osinbajo”, “Let Osinbajo Lead!”, “Nigerians Love Osinbajo, “Osinbajo: The Future Beckons”, among others.\n“President Buhari has built a solid foundation, we therefore must ensure that whoever comes after him will rather build a beautiful edifice on it than demolish it.\n“We are appealing to Vice President Yemi Osinbajo to throw his hat into the ring and take up higher responsibility having worked diligently with the President and with great results to show,” Ojo said."
  },
  {
    "headline": "Kaduna Witnesses Rare Atmospheric Phenomenon ‘Sun Halo’",
    "summarized_story": "Kaduna metropolis, on Sunday, witnessed an optical phenomenon called ‘Sun Halo’ or a rainbow-coloured ring around the sun across the city.\nScientists said Sun Halos are generally considered rare and are formed by hexagonal ice crystals refracting light in the sky — 22 degrees from the sun.\nAtmospheric Optics said the crystals behave like prisms and mirrors, refracting and reflecting light between their faces, sending shafts of light in particular directions.\n“Atmospheric optical phenomena like halos were used as part of weather lore, which was an empirical means of weather forecasting before meteorology was developed.\nBasically, halos around the sun are caused by the refraction or the splitting of sunlight by ice crystals in the atmosphere."
  },
  {
    "headline": "Kaduna Witnesses Rare Atmospheric Phenomenon ‘Sun Halo’",
    "summarized_story": "Kaduna metropolis, on Sunday, witnessed an optical phenomenon called ‘Sun Halo’ or a rainbow-coloured ring around the sun across the city.\nScientists said Sun Halos are generally considered rare and are formed by hexagonal ice crystals refracting light in the sky — 22 degrees from the sun.\nAtmospheric Optics said the crystals behave like prisms and mirrors, refracting and reflecting light between their faces, sending shafts of light in particular directions.\n“Atmospheric optical phenomena like halos were used as part of weather lore, which was an empirical means of weather forecasting before meteorology was developed.\nBasically, halos around the sun are caused by the refraction or the splitting of sunlight by ice crystals in the atmosphere."
  },
  {
    "headline": "Gunmen Kill One, Abduct Swiss Expatriate In Ogun",
    "summarized_story": "Gunmen suspected to be kidnappers over the weekend, abducted a Swiss expatriate attached to one of Olabel Farms in Ogun State, Andred Beita, after a gun duel with the police along Ibese – Itori road in the state.\nADVERTISEMENTA source in Ilaro told LEADERSHIP that the convoy of the farm chairman, led by one Inspector Hassan Kumode, ran into the kidnappers and courageously engaged the kidnappers in gun fight.\nThe victims went to their farm around Ibese and on their way coming, the gunmen attacked them.\nThey killed two of the kidnappers and recovered one big AK47 loaded with nine ammunitions from the kidnappers.\n“The hoodlums went away with a Swiss national and one other person."
  },
  {
    "headline": "New deal: Lionel Messi gets formal PSG two-year contract offer",
    "summarized_story": "Lionel Messi has received a formal two-year contract offer from Paris Saint-Germain, Skysports reports.\nThe French club have offered Messi an initial two-year deal, thought to be worth £25m a year after tax, and the six-time Ballon d’Or winner and his representatives are now reviewing and considering it carefully.\nMessi also has two other potential options after leaving Barcelona but PSG remain the favourites to sign him.\nThe Argentina international has spoken directly with PSG head coach Mauricio Pochettino this week about moving to the French capital.\nBarcelona confirmed Messi’s departure on Thursday night, the same day he returned to Catalonia following his post-Copa America holiday."
  },
  {
    "headline": "New deal: Lionel Messi gets formal PSG two-year contract offer",
    "summarized_story": "Lionel Messi has received a formal two-year contract offer from Paris Saint-Germain, Skysports reports.\nThe French club have offered Messi an initial two-year deal, thought to be worth £25m a year after tax, and the six-time Ballon d’Or winner and his representatives are now reviewing and considering it carefully.\nMessi also has two other potential options after leaving Barcelona but PSG remain the favourites to sign him.\nThe Argentina international has spoken directly with PSG head coach Mauricio Pochettino this week about moving to the French capital.\nBarcelona confirmed Messi’s departure on Thursday night, the same day he returned to Catalonia following his post-Copa America holiday."
  },
  {
    "headline": "Alimosho League: Organizers Read Out Riot Act To Clubs",
    "summarized_story": "By EPHRAIM NWOSU.Ahead Of League ResumptionOrganizers of the Alimosho Football Coaches Council League (AFCCL) have read out riot act to club owners, coaches and players while vowing to apply full wrath of its rules and regulations on them ahead of its forthcoming league.\nThe AFCCL made the announcement during a meeting with the various club owners and coaches held recently at the AJ Hotel, Igando, Lagos.\nIt’s left for the club owners, coaches and managers to caution their players and fans because any club found wanting during or after the league would be sanctioned accordingly,” Eke posited.\nThey include Yobo FC, H2U FC, LS FC, Bucknor FC, Newton G FC, Kedge Sports FC and reigning champions Samjason FC.\nOthers are Flying Wings FC, Iyaloja General FC, Nissi FC and ECAS FC."
  },
  {
    "headline": "Alimosho League: Organizers Read Out Riot Act To Clubs",
    "summarized_story": "By EPHRAIM NWOSU.Ahead Of League ResumptionOrganizers of the Alimosho Football Coaches Council League (AFCCL) have read out riot act to club owners, coaches and players while vowing to apply full wrath of its rules and regulations on them ahead of its forthcoming league.\nThe AFCCL made the announcement during a meeting with the various club owners and coaches held recently at the AJ Hotel, Igando, Lagos.\nIt’s left for the club owners, coaches and managers to caution their players and fans because any club found wanting during or after the league would be sanctioned accordingly,” Eke posited.\nThey include Yobo FC, H2U FC, LS FC, Bucknor FC, Newton G FC, Kedge Sports FC and reigning champions Samjason FC.\nOthers are Flying Wings FC, Iyaloja General FC, Nissi FC and ECAS FC."
  },
  {
    "headline": "Why I am in disbelief, shock, deep pain",
    "summarized_story": "By Jethro Ibileke/BeninFormer National Chairman of the All Progressives Congress (APC), Comrade Adams Oshiomhole has given reasons he is still in shock, disbelief and deep pains.\nHe said this is so because the death of multi-billionaire businessman, Captain Hosa Okunbo, describing his death as an irreplaceable loss to humanity.\nHosa Okunbo has passed on, brought him out him in state of disbelief, shock and deep pain.”According to him, “It is just too hard to come to terms with the reality that Capi is no more and words alone cannot appropriately capture the dark mood cast upon our land this day.\nHosa was not just a good friend, but a brother and an exceptionally dependable ally in all my efforts for a better Edo State.\nThe former governor of Edo State prayed that God forgives Captain Hosa’s shortcomings and grant him eternal rest in paradise."
  },
  {
    "headline": "Yinka Ayefele devastated: Ajiboye Fresh FM station manager dies",
    "summarized_story": "By AbankulaDavid Ajiboye, manager of Yinka Ayefele’s Fresh FM station in Ado Ekiti and his publicist, is dead.\nThe Management and Staff of Fresh FM Nigeria and Merry Makers Band, broke the news on Sunday night in a statement.\nAjiboye was a foundation member of the music arm of Yinka Ayefele Limited as the Publicist to Ayefele and the Merry Makers Band.\n“He was a prominent person who assisted Dr. Yinka Ayefele as a partner and later as a management staff member of Fresh 105.9 FM, Ibadan from the ideation period to fruition in 2015.\nThe announcement has triggered a flood of condolences on the Facebook page of Fresh FM station in Ibadan."
  },
  {
    "headline": "BREAKING: Yinka Ayefele’s Fresh FM Station Manager, David Ajiboye Is Dead",
    "summarized_story": "The Station Manager at Yinka Ayefele’s Fresh 106.9 FM in Ado-Ekiti, Ekiti State, David Ajiboye, has died.\nOn behalf of the management of Fresh FM Nigeria and Merry Makers Band, Samson Akindele issued a statement announcing the demise.\nAfter a brief illness that lasted a few days, Ajiboye died Sunday evening in an Ibadan hospital.\nHe was a founding member of Yinka Ayefele Limited’s music arm, serving as the publicist for Yinka Ayefele and his band.\nFrom the ideation phase to the launch of Fresh 105.9 FM in Ibadan in 2015, Ajiboye aided Yinka Ayefele as a partner and then as a management staff member."
  },
  {
    "headline": "[BREAKING] Igboho: Why I Relocated To Benin Republic — Prof Akintoye",
    "summarized_story": "Akintoye stated that he is in Benin, but that he is not on the run.\nAkintoye, a member of the Nigerian Senate under the Second Republic, stated that, like Ighoho, he has committed no crime against Nigerian law that warrants his imprisonment, intimidation, or harassment.\n“I have earned a solid reputation as a highly respected advocate of a peaceful self-determination struggle.\nI have even written a book on the subject which is already being used as a manual by Yoruba self-determination advocates and organizations.\nI am in Benin Republic running your errands."
  },
  {
    "headline": "BREAKING: IPOB Denies Suspending Sit-At-Home Order Over NECO Examinations",
    "summarized_story": "The Indigenous People of Biafra has disputed an alleged declaration by Mazi Nnamdi Kanu’s younger brother that the Sit-at-Home slated for Monday, August 9, 2021 has been suspended.\nAccording to IPOB’s Media and Publicity Secretary Emma Powerful, the claimed Kanu’s brother who delivered the statement is not the organization’s spokesman and should be ignored.\nAccording to Powerful, “Kanu brother is not IPOB spokesperson and anybody who listens to that deceptive statement and obligated to such statement by coming out tomorrow will get it hot.”"
  },
  {
    "headline": "BREAKING: IPOB Suspends ‘Sit At Home’ Order",
    "summarized_story": "The Indigenous People of Biafra’s (IPOB) planned sit-at-home protest, which was supposed to start tomorrow, Monday, has been postponed due to the National Examination Council’s (NECO) junior secondary school examination.\nIPOB noted that a new date for the sit-at-home order’s implementation would be announced later.\nThe pro-Biafra organization had a penultimate week, in what looked to be sympathy with its arrested leader, Nnamdi Kanu, declared a sit-at-home on Mondays across Igbo country, beginning August 9, until the IPOB leader is released.\nHowever, in a statement issued by IPOB leader Nnamdi Kanu’s younger brother, Kanunta Kanu, IPOB indicated that the decision was reached after hearing petitions from well-meaning persons and groups that the order be suspended to allow students in Igbo country to take the NECO examination.\nThe statement further explained that the sit-at-home order has not been cancelled, but only suspended for the sake of Biafra students taking this year’s NECO examination and called on IPOB members to await further directives."
  },
  {
    "headline": "Senate on constitution review: No recommendation for state creation",
    "summarized_story": "The Senate Sunday declared it has not recommended any of the states being demanded by some Nigerians in the report to be submitted by the Constitution Review Committee.\nThe requests were contained in the memoranda submitted to the Senate Committee on Constitution Review headed by Deputy Senate President Ovie Omo – Agege.\nIn the statement titled: “Senate Committee did not propose creation of 20 New States,” the lawmakers said: “Our attention has been drawn to a media report that the Senate Committee on Review of 1999 Constitution has proposed the creation of additional 20 States.\n“The report is a gross misrepresentation of the decision of the committee on the request for creation of more states.\n“In view of the above, the Senate Committee is not in a position to propose creation of any state as reported."
  },
  {
    "headline": "With one hold, USA outsmart Japan, China, win 2020 Olympics",
    "summarized_story": "Eliud Kipchoge produced a marathon masterclass and the USA edged China at the top of the Tokyo Olympics medals table as the curtain fell on the biggest sports event since the pandemic on Sunday.\nBrume recorded a 6.97 metres jump in the final of the event at the Tokyo Olympic Stadium to win her first Olympic medal and Nigeria’s first at this Games.\nThe medal was Nigeria’s first one ever in the wrestling sport since the country’s first-ever appearance at the Olympics in 1952.\nThe 339th and final gold medal went to Serbia’s men’s water polo team, capping a Games that were in stark danger of cancellation after they became the first postponed Olympics last year.\n“Some were already speaking of ‘Ghost Games’,” Olympics chief Thomas Bach told an International Olympic Committee session on Sunday."
  },
  {
    "headline": "Breaking: Yerins first housemate to be evicted from BBNaija season 6 ‘Shine Ya Eye’ show",
    "summarized_story": "Yerimene Abraham Saibakumo popularly known as Yerins has become the first housemate to be evicted from the big brother season 6 Shine Ya Eye show.\nDetails loading…"
  },
  {
    "headline": "2023: Christian Youth Group Endorses Gov Bello’s Presidential Ambition -NigPilot",
    "summarized_story": "Christian Youth Leadership Network CYLN has stressed the need for the younger generation to take the mantle of Nigeria’s leadership.\nThe Convener of the Network, Apostle Faith Eches, stated this at a forum organized by the group in Abuja at the weekend.\nAccording to him, Christian Youth Leadership Network will support the presidential ambition of the Kogi State governor, Yahaya Adoza Bello, come 2023.\nIn a remarks, the chairman of All Nigeria United for Yahaya Bello, Saidu Boboi, described the endorsement of Governor Bello by the Christian Youth Leadership Network as a welcome development.\nThe clergymen, therefore, emphasised the need for Nigerians to consider Bello for Nigeria’s number one position come 2023."
  },
  {
    "headline": "Imo, Anambra APGA pledge loyalty to Jude Okeke, disowns Victor Oye -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Crown University signs MoU with IHRC to boost education -NigPilot",
    "summarized_story": "Crown University Intl.\nVice-Chancellor and UNESCO Laureate, Prof. Sir Bashiru Aremu, signed for Crown University Intl.\nHe said the partnership shall apply to all activities arranged and carried out by a common agreement between Crown University Intl.\n“The Crown University Intl.\n“This gives the IHRC’s organization the status of an Institute or associate arm of the Crown University Intl."
  },
  {
    "headline": "Human Trafficking: IOM, NAPTIP launch tools for identification, protection of victims -NigPilot",
    "summarized_story": "Fight against human trafficking has received a boost as International Organization for Migration, IOM, in collaboration with the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, launched new tools to ensure a standardized approach to the identification, referral, and protection of Victims of Trafficking, VoTs.\nThe tools recently launched in Abuja coincided with the 2021 World Day against Trafficking in Persons, WDATIP, with the theme “Victims Voices take the Lead’.\nResearch also shows that two-thirds of Nigerian victims of trafficking are victims of domestic human trafficking.\nThe aim of the identification tools is to provide first-line officials with harmonized tools to effectively identify and refer victims of human trafficking in line with the National Referral Mechanism.\nThe long-term goal is to ensure these tools are integrated into an information management system, IMS, that all stakeholders can easily access."
  },
  {
    "headline": "Strike: Ngige, Ehanire Are The Ones That Should Be Sacked – NARD President",
    "summarized_story": "Okhuaihesuyi who was a guest on Channels Television’s Sunday Politics Today, said this in reaction to comments by the Labour Minister, Chris Ngige, about replacing the striking doctors.\nBut in reaction, the NARD president said: “I want to ask Nigerians to tell those that are the cause of the strike and have not done their work that they should be sacked or resign from the positions they hold”.\nRead Also: Ngige Threatens To Replace Striking Resident DoctorsMonday marks the expiration of the one-week ultimatum given by the Labour Minister for the striking doctors to resume work.\nI will invoke other things,” Ngige had vowed on Friday.\nBut the NARD President has insisted that the strike will continue “fully and indefinitely”."
  },
  {
    "headline": "60 Dead As Cholera Outbreak Hits Katsina Communities",
    "summarized_story": "At least sixty persons lost have their lives across many communities in Katsina State following the outbreak of cholera in the state.\nThe state Commissioner for Health, Yakubu Danja disclosed this on Saturday during the 2021 Annual General Meeting of the State chapter of Nigerian Medical Association (NMA) held in the state capital.\nREAD ALSO: Second Phase Of COVID-19 Vaccination To Begin On Tuesday“We are aware of the current outbreak of diarrhea and vomiting that is affecting some communities in the state.\nThe state government is making efforts towards control of the outbreak,” the commissioner said.\n“Free drugs for the treatment of this outbreak are been purchased for distribution to hospitals for treatment of the cases."
  },
  {
    "headline": "Edo Business Titan Hosa Okunbo Dies",
    "summarized_story": "Edo-born business mogul Captain Hosa Okunbo is dead.\nThe late Okunbo was 63.\nAt 21, he became a pilot following his graduation from the Nigerian Civil Aviation Training Centre in Zaria, Kaduna State.\nOkunbo whose father Robert Amos Okunbo – was a preacher and teacher – later proceeded to ACME School of Aeronautics, Fort Worth, Texas in the US.\nHe retired from working as a pilot at 30 and ventured into business."
  },
  {
    "headline": "Senate Denies Proposing Creation Of 20 New States",
    "summarized_story": "The Senate has debunked reports that the lawmakers have proposed the creation of 20 more states, saying the upper chamber was “grossly” misrepresented.”Senate spokesman Ajibola Basiru in a statement on Sunday said the report is a misunderstanding of the decision reached by the Senate Committee on the Review of the 1999 constitution.\n“The report is a gross misrepresentation of the decision of the committee on the request for creation of more states,” the statement maintained.\n“In view of the above, the Senate Committee is not in a position to propose creation of any state as reported,” he added.\nThe Senate purportedly reached the decision to respect “the genuine desire of Nigerians.”Some of the states which the Senate purportedly proposed their creation are ITAI State from Akwa Ibom; State status for the FCT; Katagum State from Bauchi; Okura State from Kogi East; Adada State from Enugu; Gurara State from Kaduna South; and Ijebu State from Ogun.\nThe rest were said to be: Aba State from Abia; Anioma State from Delta; Torogbene and Oil River, from Bayelsa Delta and Rivers; Bayajida State from parts of Katsina, Jigawa, and Zamfara."
  },
  {
    "headline": "Troops Neutralise Four Bandits, Several Others In Kaduna",
    "summarized_story": "Troops of the Nigerian military have neutralised four notorious bandits in Igabi local government area of Kaduna State.\nThe success follows the ongoing military operations against armed bandits, and human intelligence checks carried out by the troops in a valley popularly known as ‘Maikwandaraso’ in Igabi LGA.\nAccording to the state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, the four bandits were neutralised through air interdictions, when the military engaged them at the location, as part of combined ground and air assaults on identified bandit enclaves.\nAruwan gave the names of the neutralised bandits as, Alili Bandiro, Dayyabu BalaBala Nagwarjo and Sulele Bala.\nSeveral other bandits were also eliminated in the same cycle of air interdictions and ground offensives."
  },
  {
    "headline": "COVID-19: Nigeria to begin administering 2nd batch of vaccine Tuesday",
    "summarized_story": "The Presidential Steering Committee on COVID-19 (PSC), has said the country will begin administering the second batch of COVID-19 vaccines on August 10.\n“The PSC has received over four million doses of Moderna vaccine donated by the U.S. Government to Nigeria.\nAdvertisementThe shipment was the second batch of vaccines to arrive in Nigeria, following the delivery of four million doses in March through the COVAX vaccine sharing facility.\nNigeria had since exhausted the four million doses of the AstraZeneca vaccine.\nThe Moderna vaccine, which was received on August 1, is an mRNA vaccine manufactured and developed by Moderna, NIAID."
  },
  {
    "headline": "S/East will be shut down every Monday from 6am-6pm until Nnamdi Kanu is released -IPOB",
    "summarized_story": "The Indigenous Peoples of Biafra IPOB says its Monday’s sit-at-home order remains sacrosanct.\nThe proscribed group directs that all markets, schools, motor parks, airports, and public places in the region should shut down from morning to evening every Monday.\nNoting the economic ramifications of their action, IPOB stated that they are compelled to do so in order for the world to know that their leader, Nnamdi Kanu, is not alone in the struggle for Biafra autonomy.\nAdvertisementThe group however, called for his immediate release by the Department of State Security DSS for the seek of peace.\nThey urged all residents and visitors in the area to obey the order in order to avoid a clash or intimidation by the evil Nigerian security agents."
  },
  {
    "headline": "Wildfires continue to ravage Greek island of Evia",
    "summarized_story": "Thousands of people have evacuated their homes on the Greek island of Evia as flames raged unabated for the sixth day, and boats were ready to transport more people to safety by sea.\nHowever, the blaze on Evia, a major island east of Athens, soon spread across numerous fronts, destroying thousands of hectares of pristine forest and forcing the evacuation of dozens of settlements.\nForest land has burned across the country, destroying dozens of homes and businesses.\nAdvertisementThe governor for central Greece, Fanis Spanos, said the situation in the north of the island had been “very difficult” for nearly a week.\nA fire on the foothills of Mount Pranitha north of Athens has been contained but weather conditions meant there was still a high threat it could flare again."
  },
  {
    "headline": "Tokyo Douses Olympic Flame, IOC President Says Games a Success Despite Pandemic",
    "summarized_story": "And with that, the strangest Olympic Games on record closed their books for good.\nWhile Tokyo is handing off the Summer Games baton to Paris for 2024, the delay has effectively crammed two Olympics together.\nIn recent weeks, lots of people — officials, athletes, journalists — have been chewing over how these Tokyo Games will be remembered.\nThe expenses — upwards of $15 billion — were colossal and will echo in Tokyo long after athletes are gone.\nWhat are the Olympic Games supposed to be?"
  },
  {
    "headline": "Tearful Messi Bids Goodbye to Barcelona; Sources Say PSG Deal Agreed",
    "summarized_story": "A tearful Lionel Messi has said his next move is not confirmed at an emotional farewell news conference Sunday, but ESPN sources say a deal with Paris Saint-Germain has already been agreed.\nA tearful Lionel Messi has said his next move is not confirmed at an emotional farewell news conference Sunday, but ESPN sources say a deal with Paris Saint-Germain has already been agreed.\n“I am really sad because I didn’t want to leave because this is the club I love,” he said.\nI offered to reduce my salary by 50% and Barca didn’t ask for anything else.\nWith 672 goals in 778 games for Barca, Messi leaves as both the club’s record appearance maker and top goal scorer."
  },
  {
    "headline": "MTN Group Repatriates $280m Dividend from Nigeria",
    "summarized_story": "South Africa’s MTN Group has repatriated last year’s dividend of $280 million (R4.2 billion) from its local unit in Nigeria.\nThe funds from Nigeria are part of approximately $650 million (R9.3 billion) in cash the pan-African telecoms giant returned from its subsidiaries.\nIn Nigeria, MTN, through its local unit, has earmarked N600 billion ($1.5 billion) over the next three years to expand broadband access in the country.\nFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1 percent year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nWhile user numbers fell, MTN Nigeria company managed to increase service revenue to N790.3 billion (about R27 billion, $1.9 billion) driven by a surge in data usage."
  },
  {
    "headline": "Obasanjo Visits Benin President, Seeks Soft Landing for Yoruba Nation Agitator Igboho",
    "summarized_story": "Former President Olusegun Obasanjo held a meeting with President of Benin Republic, Patrice Talon in the first week of August to seek soft landing for an agitator for Yoruba Nation, Chief Adeniyi Adeyemo (a.k.a Sunday Igboho), a report by TheCable has revealed.\nSoglo was president of the Benin Republic from 1991 to 1996.”According to the report, one of the diplomatic sources revealed that Obasanjo travelled to Zanzibar on August 1.\nPerhaps to conceal his trip, he re-routed to the Benin Republic.\n“Definitely, they will not extradite him because we pointed the attention of France to the judicial process in Nigeria.\nIgboho’s apprehension had ignited legal and diplomatic fireworks to secure the release of the embattled agitator from the custody of the Benin Republic."
  },
  {
    "headline": "Nigeria: Panic as Cholera Claims 60 Lives in Northwest Katsina State",
    "summarized_story": "Panic has gripped the residents of Katsina State, following the outbreak of Cholera, which has killed no fewer than 60 persons in some communities in the state.\nThe state Commissioner for Health, Yakubu Nuhu Danja, stated this on Saturday at the 2021 Annual General Meeting (AGM) of the Nigerian Medical Association (NMA), held at the Katsina State Secretariat complex.\nHe explained that drugs had been purchased by state government for distribution to hospitals across the state for the treatment of the disease.\nMeanwhile, some of the residents of the state are living in fear following the outbreak of the disease in the state.\nAs we speak, many people have died of cholera in Malumfashi and nobody is ready to assist us.”Francis Sardauna in Katsina"
  }
]