[
  {
    "headline": "Osun 2022: Ogunbiyi humble, capable, says Ooni",
    "summarized_story": "The Ooni of Ife, Oba Adeyeye Ogunwusi, has lauded the Accord Party candidate for the July 16 Osun State governorship poll, Dr. Akin Ogunbiyi, for his humility.\nThe royal father spoke when he received Ogunbiyi and his campaign team in his palace in Ile-Ife on Monday.\nOba Ogunwusi, while praying for the governorship candidate, said the insurance magnate “is humble, capable, knowledgeable and blessed by God.\nLook at the time you came out to say you are contesting the election and look at what God is doing for you.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "SDP knocks Buhari over comment on Ekiti poll",
    "summarized_story": "The party said that the President must ensure a level-playing ground for parties during the Ekiti State governorship election.\nHe said, “I’m confident that what the President said is a distraction to the APC and not the SDP; the SDP will win Ekiti State.\n“For the President to make that remark, maybe it’s simply because we will not allow his party to rig in Ekiti State.\nSo far, they are not close to where we are in Ekiti State.”Gaban added that they have written to relevant authorities including Buhari to ensure a free and fair election in Ekiti State.\n“We have written a letter to him that he must ensure that there’s a free and fair election in Ekiti state."
  },
  {
    "headline": "2023: Ex-PDP Chair wins APC Ebonyi North Senatorial district primary election",
    "summarized_story": "By Peter Okutu, AbakalikiThe former Chairman of the Peoples Democratic Party, PDP, Ebonyi State, Barr.\nOnyekachi Nwebonyi, Saturday won the All Progressive Congress, APC, Primary election for Ebonyi North Senatorial district of the State.\nAnnouncing the results, the Electoral Chairman, Mr. Anya Ogbonnaya stated that Onyekachi Nwebonyi polled 272 votes to beat his rival, Mrs Elizabeth Ogbaga who secured only 6 votes.\nNwebonyi expressed satisfaction towards his victory and appreciated the Ebonyi North delegates for entrusting him with their mandate.\n“It is the victory for the people of Ebonyi North, the Youth of Ebonyi North in particular, because I am going to beef up the image of Ebonyi North Youths; you can see that my target is to empower the youths."
  },
  {
    "headline": "2023: Ex-Governor Egwu wins PDP Ebonyi North Senatorial district election",
    "summarized_story": "By Peter Okutu, AbakalikiFormer Governor Sam Egwu and Senator representing Ebonyi North Senatorial district, yesterday emerged as the winner of the Peoples Democratic Party, PDP, Primary election for Ebonyi North zone of the StateEgwu polled 163 votes to emerge winner of the election, which took place at the Party’s Secretariat, along Enugu-Abakaliki expreaswayThe Independent National Electoral Commission, INEC was on ground to monitor the election as security personnel, including the Nigeria Police provided security for the delegates and the entire Party faithfulsAnnouncing the senatorial primary result for Ebonyi North zone, the Returning Officer, Mudi Irenede stated that Dr. Sam Egwu polled 163 votes of the total accredited votes of 163.\nSam Egwu polled 163 votes of the total accredited votes of 163 and he is hereby declared the winner of the Ebonyi North Senatorial district election.”In his acceptance speech, Senator Sam Egwu who applauded the entire electoral process that led to his victory, assured his constituents of more democracy dividends in his administration.\nThe Senatorial election was conducted by the Anyichuks-led faction of the PDP in the State."
  },
  {
    "headline": "PRAWA to set up mini-legal clinics in Tsangaya schools",
    "summarized_story": "By Bashir BelloKANO — Worried by infringement of rights of Almajiri children, a Non Governmental Organization known as Prisoners Rehabilitation and Welfare Action, PRAWA says it is setting up a mini-legal clinics in Tsangaya schools across Kano to check cases of violation and infringement of their rights.\nKatumi Oboirien disclosed this during a training for selected Almajiri school teachers on human rights and processes to report human right abuses of the Almajiri children.\nAccording to her, “We want to set up a mini-legal clinics and we will train the Almajiri children (those who can read and write) to be para-legals to be taking information on cases of human rights abuses and report it to us.\n“We started with 40 Almajiri children who were been trained on shoe making.\n“This is trying to give them a kind of social protection and a means of livelihood so that after the Tsangaya schools they have something to fall back on to keep them going,” Bar."
  },
  {
    "headline": "Kano Civil Society Groups call for cancellation of APC Guber primary over alleged irregularities",
    "summarized_story": "…allegations were baseless, lacks element of fact, says Kano APCBy Bashir Bello,KANOCivil Society groups in Kano State working around promotion of good governance through best practices of democratic principles and processes have on Monday called on the All progressive congress (APC), Kano State Primary Election Appeal Committee, 2022 and Independent National Electoral Commission, INEC to cancel the APC Gubernatorial primary election in the state over alleged irregularities.\nMusa expressed dismay and dis-satisfaction on the way, manner and processes used in the conduct of gubernatorial primary election.\n“Some of the delegates were intimidated while others short-changed by Kano State Government officials at the election venue.\n“Thus, we are appealing to our great party All progressive congress (APC), Kano State Primary Election Appeal Committee, 2022 and INEC to consider cancellation of the primary election of governorship for lacking the merit, over voting and other irregularities,” the leader of Groups, Musa however stated.\nRecall that the Kano State Deputy Governor, Dr. Nasiru Yusuf Gawuna emerged winner of the APC Gubernatorial primaries in the state after scoring 2,289 votes against his opponent, Hon."
  },
  {
    "headline": "Beer parlours in Kabba, Kogi to close shop at 7 p.m.",
    "summarized_story": "Beer parlours in Kabba, Kogi, are to close shop at 7 p.m. henceforth.\nChairman of Kabba-Bunu Local Government Council, Mr Moses Olorunleke, gave the order on Monday in Kabba following a second suspected bomb blast in the area in 18 days.\nThe News Agency of Nigeria (NAN) reports that the first explosion recorded in Kabba town was on May 11, when two persons out of the 16 victims lost their lives.\nOnly 18 days after, on Sunday, May 29, another suspected bomb blast was recorded at a revelling joint.\n“It is a shocking and dangerous development that calls for drastic measures in the interest of the citizens of our local government area and of Kogi,’’ Olorunleke stated."
  },
  {
    "headline": "Nigeria’s insecurity: Whoever kills intentionally going to hell – NASFAT leader, Imam Onike",
    "summarized_story": "The Chief Missioner, Nasrul-Lahi-l-Fatih Society, (NASFAT), Imam Abdul-Azeez Onike has expressed concern about Nigeria’s insecurity.\nOnike also declared that the punishment for deliberate murder is hell, citing the Holy Quran.\nIn a statement on Monday by NASFAT Publicity Secretary, Abdul Akeem-Yusuf, Onike described the happenings in many states as unpatriotic and unjust.\n“Whoever kills a soul unless for a soul or for corruption done in the land – it is as if he had slain mankind entirely.\nThe NASFAT leader added that in Islam, there was no difference between the killer and those who support or co-operate with the killer."
  },
  {
    "headline": "BREAKING: Kidnapped Methodist Prelate, Samuel Kanu released",
    "summarized_story": "The Prelate of the Methodist Church Nigeria, His Eminence, Samuel Kanu Uche, has been released.\nReport reaching DAILY POST from a reliable source says that the Prelate, who was kidnapped on Sunday, has been freed by his abductors.\nThe source, however, did not state if any ransom was paid before the cleric was freed.\nKanu was Kidnapped along Enugu-Port Harcourt Expressway, in Umunneochi Local Government Area of Abia State.\nDetails later…"
  },
  {
    "headline": "Ambazonia: Army insists Nigerian territory not attacked by Cameroonian militants",
    "summarized_story": "The Nigerian Army said reports about attacks on some villages by Cameroonian (Ambazonian) separatists were false.\nDirector of Army Public Relations, Brig.-Gen. Onyema Nwachukwu issued a statement on Monday.\nNwachukwu said the Nigerian troops at Danare received information and mobilized to the Bashu community, which was allegedly invaded.\n“Rather, the separatists attacked Obonyi 2 and Njasha, both of which are communities located in the Republic of Cameroon”, he added.\nFour victims, who crossed to Nigerian territory, were later rescued by soldiers and Nigeria Immigration Service (NIS) officials."
  },
  {
    "headline": "Samuel Kanu: IPOB demands unconditional release of abducted Methodist Prelate",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has charged those who kidnapped the Methodist Prelate, His Eminence Samuel Kanu, to release him unconditionally and immediately.\nIPOB gave the charge while distancing its members from the abduction of Kanu and other priests.\nEmma Powerful, spokesman of the group, described the abduction of the Methodist Prelate as a sacrilege which is alien to the Igbo race.\nIn a statement by its spokesman, Emma Powerful, IPOB decried the docility of Southeast governors and the security agents in revealing those responsible for insecurity in the region.\nThe statement reads partly: “The Indigenous People of Biafra IPOB wish to condemn in its entirety the kidnapping of Methodist Church Prelate, His Eminence Samuel Kanu in Abia state, we see the kidnapping of Methodist Church Nigeria leader as sacrilegious."
  },
  {
    "headline": "Epidemic looms in Uyo as stench from dumpsites worries residents",
    "summarized_story": "There are indications of outbreak of infectious disease in Uyo, Akwa Ibom State capital following the stench that oozes out of refuse dump sites around residential areas and markets that have remained unattended to in recent times.\nHowever, residents have raised the alarm over impending health hazards this might cause as there is a perceived delay by the State Waste Management Board in evacuating the waste.\n“According to the national bureau of statistics our life expectancy as a country is pegged at 54 and with this delay in waste evacuation you can be sure that that of the state will certainly be lower than estimated.\nBut we are waiting for this weekend’s sanitation exercise to evacuate them.\nYou know we have trucks but we hire most of the other equipment needed for the evacuation like bulldozers and compactors once a month."
  },
  {
    "headline": "2023 polls, rising food prices threaten economy, IMF warns",
    "summarized_story": "Soaring food prices and next year’s general election are threats to the country’s economy, the International Monetary Fund (IMF) has warned.\nIn its Regional Economic Outlook for Sub-Saharan Africa, the IMF also identified “high global energy prices, spending pressures within a narrow fiscal space”, as other problems.\nIn report released yesterday in Abuja, the IMF said “persisting insecurity – particularly banditry and kidnapping – and the forthcoming 2023 elections that may affect the performance of the economy”.\nThe agency’s regional representative for Nigeria, Ari Aisien presented the report.\nFor commodity importers, the IMF Resident Representative said the Russia-Ukraine war would raise the yearly financing needs to between $6 billion and $10."
  },
  {
    "headline": "Wike slams PDP South governors for betraying him",
    "summarized_story": "Rivers State Governor Nyesom Wike yesterday reflected on his outing at Sunday’s presidential primary of the Peoples Democratic Party (PDP) and blamed his loss to former Vice-President Atiku Abubakar on his Southern counterparts.\nWike said the Southern governors betrayed him by working against their earlier agreement that the Presidency should return to the South.\nAccording to him, PDP governors ganged up with some vested interests to derail the quest of the South to produce the next president on the platform of the party.\nChairman, PDP Rivers State, Ambassador Desmond Akawor, commended Wike for his resilience saying that the entire State and the Niger Delta are happy that he spoke for them.\nChairman of Ikwerre Local Government, Samuel Nwanosike, said Wike had demonstrated that Rivers State and the Niger Delta could not be underrated in the political equation of Nigeria."
  },
  {
    "headline": "Atiku begins fence-mending talks with defeated aspirants",
    "summarized_story": "Peoples Democratic Party (PDP) presidential candidate Atiku Abubakar yesterday continued his fence-mending with those he defeated to clinch the ticket at Saturday’s convention.\nHe was at the Abuja homes of Rivers State Governor Nyesom Wike and former Senate President Bukola Saraki.\nAtiku had, in the company of party Chiarman, Dr. Iyorchia Ayu, visited Sokoto State Governor Aminu Tambuwal in his private residence in Abuja.\nTambuwal withdrew from the presidential race at the convention ground and directed delegates wishing to cast their ballot for him, to do so for Atiku.\nJibrin said: “The BoT will assist the party and our presidential candidate to come out with an acceptable vice presidential candidate from the southern part of Nigeria."
  },
  {
    "headline": "Ango Abdullahi’s son, Sadiq, others to Fed Govt: rescue us",
    "summarized_story": "Sadiq, son of the Northern Elders Forum (NEF) leader, Prof. Ango Abdullahi, and other passengers of a Kaduna-bound train abducted by terrorists 62 days ago have passionately pleaded with the Federal Government to rescue them.\nYet another abductee, Maryam Abubakar, said five other of her family members—her husband and four children—are in the terrorists’ custody.\nThe latest video is the fifth sent out by the abductors after the March 28 train attack near Kaduna.\n“We have been here for 62 days in an unfavourable, inhabitable and unimaginable condition.\nWe have been here for 62 days."
  },
  {
    "headline": "BREAKING: Kidnapped Methodist Prelate, others regain freedom",
    "summarized_story": "The Prelate of Methodist Church Nigeria His Eminence Rev.\nThe Nation gathered that the Prelate was released with two others seized with him around 6:30pm, 24hrs after their abduction.\nThe Methodist Prelate, according to information, is in Owerri, the Imo State capital with the Bishop of Owerri Diocese who was kidnapped with him and his Chaplain.\nThe abductors had demanded N100m ransom for their release but it was unclear if the church paid ransom or not for them to regain freedom.\nAccording to Ogbonna, Rev."
  },
  {
    "headline": "… Kalu condemns abduction, calls for release",
    "summarized_story": "From Okey Sampson, UmuahiaThe Chief Whip of the Senate, Dr. Orji Uzor Kalu, has condemned the kidnapping of the Prelate of the Methodist Church Nigeria, Rev Samuel Kanu-Uche, with a call for his immediate release alongside two other abducted clerics.\nKalu, pained by the ugly incident, lamented the growing insecurity in the South East region.\nBemoaning the spite of insecurity in boarder communities of Abia, Kalu called on the governors of Abia and Imo States to intensify security in their neighbouring towns to checkmate criminal elements in both states.\n“The two governors should also make efforts to rebuild the Ihube-Okigwe -Uturu roads because those routes have become the den of criminals.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "N2.9bn fraud: I’m not guilty –Okorocha",
    "summarized_story": "He was, however, arrested by operatives of the agency, few hours before the ruling APC screened its presidential candidates.\nOkorocha, who was Imo state governor from 2011 to 2019, was accused of diverting funds belonging to the state, to the tune of about N2.9 billion.\nHowever, when the charge was read to Okorocha, he said: “I understand the charge against me, but I am not guilty my lord”.\nIn addition, Amaechi drew attention of the court to the fact that his client was roughly arrested before APC’s screening.\nHowever, EFCC, through its lawyer, Mr. Gbolahan Latona, told the court that Okorocha raised some issues in his bail application that would require its response."
  },
  {
    "headline": "Monkeypox kills one as NCDC activates emergency operations centre",
    "summarized_story": "From Fred Ezeh, Abuja and Chinelo ObogoNigeria Centre for Disease Control and Prevention (NCDC) has activated Emergency Operations Centre (EOC) in response to the spread of Monkeypox.\n“Nigeria’s national surveillance system, the Surveillance Outbreak Response Management and Analysis System was first deployed in response to the 2017 Monkeypox outbreak to improve the timeliness and completeness of case reporting, as well as facilitate the overall response,” he said.\nHowever, airlines and airports are yet to receive any health guidelines or protocols from NCDC over the outbreak of monkeypox.\nYou would require a COVID test before you can come in and you would still need to require a day one and day two test.\nWe are hoping that the Federal Government does something about the COVID protocol."
  },
  {
    "headline": "Obi wins Labour Party presidential ticket, outlines rescue plans for Nigeria",
    "summarized_story": "By Bimbola Oyesola and Paul Osuyi, AsabaFew days after his resignation from the People Democratic Party (PDP), former governor of Anambra State, Mr. Peter Obi, yesterday, emerged presidential candidate of the Labour Party.\n“Having satisfied all the requirements and having scored the highest number of votes, I hereby declare Mr. Peter Obi as the presidential flag bearer of the Labour Party,” he said.\nObi thanked the leadership of the party and delegates for electing him, adding, however, that the task to rebuild Nigeria was the responsibility of all.\nMeanwhile, the Nigeria Labour Congress (NLC) has assured Nigerians that the victory of Labour Party in Australia last week would be replicated in Nigeria in 2023.\nSuch dreams are epitomised by the success of the Labour Party in different parts of the world."
  },
  {
    "headline": "APC presidential primary: APC screens Tinibu, Amaechi, Umahi, 9 others behind closed doors",
    "summarized_story": "Information available confirmed that 12 out of the 25 presidential aspirants that returned their completed nomination forms where the ones that carried out the traditional exercise.\nSpeaking after appearing before the committee, Ohanenye confirmed her readiness to step down in obedience to the directive of the party’s leadership.\nAsiwaju Tinubu who arrived the venue of the screening exercise by 5:45 pm, was given a rousing heroic welcome by his teaming supporters led by Hon James Faleke.\n“The screening exercise is to check who is guilty and who is not.\nAnd we trust God for accurate answers and deserving answers to all questions,” he said before appearing before the committee."
  },
  {
    "headline": "Breaking: Methodist Prelate, Others Regain Freedom",
    "summarized_story": "Emmanuel Ugwu-NwogoThe Prelate of the Methodist Church Nigeria, His Eminence Samuel Kanu Uche, has been set free along with two other clerics and his driver who were abducted on Sunday.\nNews of their release filtered in Monday night just as the Church leadership was already mobilising members to raise N100 million ransom demanded by the kidnappers.\nIt is also not clear if the ransom was eventually raised and paid.\n“All I can confirm to you now is that they have all been released,” he said.\nAaron Akabuokwu, also confirmed the release of the head of the Methodist Church in Nigeria."
  },
  {
    "headline": "Breaking: Kidnappers of Methodist Prelate Demand N100m Ransom, Church Seeks Donations from Members",
    "summarized_story": "Emmanuel Ugwu-Nwogo in UmuahiaBarely 24 hours after abducting the Prelate of Methodist Church, His Eminence, Samuel Kanu-Uche, and two other clerics, the gunmen have demanded a sum N100 million as ransom.\nMichael Akinwale confirmed the demand in a statement issued to newsmen on Monday.\nHe appealed to all parishioners to rise up and help in raising the N100million ransom.\n“This is a period of trial in which the Church must cry out that ‘The Lord that answereth by Fire’ must be our God to destroy all the manipulations of the adversary.\n“As we engage in Prayer Warfare, this serves to notify you that the abductors have demanded a ransom of N100m."
  },
  {
    "headline": "Just In: Bandits Attack Kuje, Kidnap One",
    "summarized_story": "Olawale AjimotokanArmed bandits abducted one person in an early morning attack on Zone A, Anguwan Gade Extension of Kuje Abuja.\nIt was gathered that an 18-year-old foster son of the proprietor of the Supreme Kids Academy, Vctor Egbon was kidnapped in the raid that struck fear and apprehension into the residents.\nHis father, Abdulsalam Ozigi, also suffered seriously injury in the process from machete attack inflicted on him by the assailants.\nThe armed bandits were said to have infiltrated the community at about 12.15 am Monday morning.\nThey invaded the residence of the Ozigis, broke into the family house and then abducted Victor to an unknown destination.Calm had returned to the affected community with everyone going about their lawful business as at the time we visited the community."
  },
  {
    "headline": "Ayu to Tambuwal: ‘You’re the Hero of the Convention’",
    "summarized_story": "Ayu, in company of a former Jigawa State governor, Sule Lamido and Ihedioha, among others, had visited Tambuwal to personally thank him for his role in the outcome of the convention.\nBut the decision by Tambuwal to step down for Atiku was allegedly masterminded by top northern politicians as the master stroke that ensured victory for Atiku.\nThe Enugu State Governor, Ifeanyi Ugwuanyi, won his senatorial ticket to represent Enugu West and so, it is only the Delta State governor that yielded the Delta North senatorial seat to Ned Nwoko.\n“Atiku’s victory is victory for PDP and victory for Nigeria in general.\nHe said, “I heartily congratulate His Excellency, Atiku Abubakar (GCON) on his victory at the Peoples Democratic Party Presidential primary election."
  },
  {
    "headline": "2023: Obi’s Aspiration Suffers Setback as Fresh Litigation Rocks Labour Party",
    "summarized_story": "Former Deputy National Chairman of the LP, Calistus Okafor, gave the hint in an interview with THISDAY in Abuja.\nOkafor claimed that he remained the authentic national chairman of the party.\nHe explained that he got the post by virtue of his position as Deputy National Chairman of the party when the late national chairman, Abdulsalam, was in office.\nHe said, “The NLC and the TUC actually registered the Labour Party in 2006, but they were not the ones administering it.\n“The inability of the party to organise an inclusive convention made it impossible for former Governor Olusegun Mimiko to contest the 2019 presidential election on the platform of the Labour Party."
  },
  {
    "headline": "Kwankwaso: Peter Obi could have been my running mate if he joined NNPP",
    "summarized_story": "Rabiu Kwankwaso, former governor of Kano, says Peter Obi, presidential candidate of the Labour Party, could have become his running mate if the latter had joined the New Nigeria Peoples Party (NNPP).\nOn May 27, Obi joined the Labour Party hours after announcing the resignation of his membership of the Peoples Democratic Party (PDP).\nBefore the former governor joined the LP, there were speculations that Obi may form an alliance with Kwankwaso in the NNPP to contest the presidency.\nAdvertisementOn Monday, Obi was elected the presidential candidate of the LP after three other aspirants stepped down for him.\nAsked if there Obi was approached on joining NNPP, Kwankwaso said he discussed national issues with the former Anambra governor a few days before he joined LP."
  },
  {
    "headline": "Kwankwaso: Peter Obi could have been my running mate if he joined NNPP",
    "summarized_story": "Rabiu Kwankwaso, former governor of Kano, says Peter Obi, presidential candidate of the Labour Party, could have become his running mate if the latter had joined the New Nigeria Peoples Party (NNPP).\nOn May 27, Obi joined the Labour Party hours after announcing the resignation of his membership of the Peoples Democratic Party (PDP).\nBefore the former governor joined the LP, there were speculations that Obi may form an alliance with Kwankwaso in the NNPP to contest the presidency.\nAdvertisementOn Monday, Obi was elected the presidential candidate of the LP after three other aspirants stepped down for him.\nAsked if there Obi was approached on joining NNPP, Kwankwaso said he discussed national issues with the former Anambra governor a few days before he joined LP."
  },
  {
    "headline": "APC screening panel asked to disqualify Tinubu over 'Chicago affair'",
    "summarized_story": "The All Progressives Congress (APC) presidential screening committee has been asked to disqualify Bola Tinubu, a former Lagos governor, over “questionable educational qualifications”.\nJohn Oyegun, a former APC national chairman, is in charge of the screening committee, and the exercise is ongoing at the Transcorp Hilton in Abuja.\nOver the years, the identity of Asiwaju Bola Anmed Tinubu has been shrouded in secrecy.\nRepeated efforts and demands by the general populace and the media to unravel the identity of Asiwaju Tinubu have all proved abortive and unsuccessful.\nTinubu is among 23 aspirants in APC who have been listed for screening ahead of the party’s presidential primary on June 6."
  },
  {
    "headline": "APC screening panel asked to disqualify Tinubu over 'Chicago affair'",
    "summarized_story": "The All Progressives Congress (APC) presidential screening committee has been asked to disqualify Bola Tinubu, a former Lagos governor, over “questionable educational qualifications”.\nJohn Oyegun, a former APC national chairman, is in charge of the screening committee, and the exercise is ongoing at the Transcorp Hilton in Abuja.\nOver the years, the identity of Asiwaju Bola Anmed Tinubu has been shrouded in secrecy.\nRepeated efforts and demands by the general populace and the media to unravel the identity of Asiwaju Tinubu have all proved abortive and unsuccessful.\nTinubu is among 23 aspirants in APC who have been listed for screening ahead of the party’s presidential primary on June 6."
  },
  {
    "headline": "'Betrayal, conspiracy, sabotage' -- Wike breaks silence on PDP presidential primary",
    "summarized_story": "Nyesom Wike, governor of Rivers, says some southerners worked against the zone getting the presidential ticket of the Peoples Democratic Party (PDP).\nHe spoke on Monday, when he addressed PDP supporters in Rivers state.\nWike, who contested the presidential primary on Saturday, came second with 237 votes against former Vice-President Atiku Abubakar’s 371 votes.\nAnd let me also say to those who do not understand, and who take Rivers state for a ride, now they have learnt their lesson.\nAnybody who tries to say that Rivers state is nowhere, it’s at your own peril."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Stax is making progress with solving USSD's user experience problem",
    "summarized_story": "Stax claimed to possess a deep understanding of USSD’s continued importance in African markets and users’ needs for a smooth and simple mobile banking experience.\nIn a Worldwide Mobile Data Pricing 2021 report from Cable.co.uk, sub-Saharan Africa ranked as the most expensive region, with the average price for 1GB of mobile data coming in at $6.44, followed by Oceania at $5.51 and South America at $5.25.\nThe directory also has a built-in searchable index of USSD services globally to reduce the friction between USSD and users across Africa.\nStax, Lyon said, has been eyeing the success of True Balance and taking notes.\nStax currently supports more than 100 bank and mobile money services across 9 markets."
  },
  {
    "headline": "Elon Musk’s Starlink receives approval to provide internet service in Nigeria and Mozambique",
    "summarized_story": "On Friday, Tesla CEO Elon Musk announced on Twitter that Starlink, the satellite internet service launched by SpaceX, his space exploration company, has been approved in Nigeria and Mozambique.\nThis licensing follows a visit to Nigeria by the company’s team in May last year to discuss the possibility of obtaining a licence.\n“The company received two licenses, which include the International Gateway license and Internet Service Provider (ISP) license, and will be trading as Starlink Internet Services Nigeria Ltd.\nStarlink approved by Nigeria 🇳🇬 & Mozambique 🇲🇿https://t.co/Q1VvqVmJ2i — Elon Musk (@elonmusk) May 27, 2022Starlink is a low latency broadband internet system created to meet the needs of consumers in rural areas with low internet penetration across the globe.\nStarlink enters a Nigerian Internet service provider space that is dominated by telcos like MTN and Airtel, as well as individual ISPs such as Spectranet, SMILE and others."
  },
  {
    "headline": "How I Work: Peace Itimi, Digital Marketing Professional and Trainer",
    "summarized_story": "So I focused everything I was doing on Google Ads – Google Adwords at that time.\nThat’s kind of just really how I got into digital marketing; from being a GSA.\nBy the time I was graduating, a lot of people in school knew me as this ‘Google girl’ – this digital marketing person.\nTalking about apps: Gmail, Slack, YouTube Studio, LinkedIn, Google Ads, Meta Ads Manager, Amplitude, AppsFlyer, Google Docs, Google Spreadsheets, and Google Tasks (TasksBoard on web).\nI don’t sleep a lot – except you count my ‘sleep late and wake up early’ routine."
  },
  {
    "headline": "“How I Work” is back! 😊",
    "summarized_story": "AdvertisementI’m not going to say anything inspiring today; I just want to remind you to keep up the good work.\nToday, I’ve got two stories:How Peace Itimi worksStarlink’s approval in NigeriaHow does Peace Itimi work?\nBefore I joined Techpoint Africa, the series, How I Work was the only thing I went through on the website.\nSo, how does she work?\nHow does Starlink work?"
  },
  {
    "headline": "Here are the confirmed speakers for the Africa Mobility Conference",
    "summarized_story": "Share this article:The Africa Mobility Conference will be held at Eko Hotel and Suites, Victoria Island, Lagos, on Thursday, June 2, 2022.\nShe will be delivering the first keynote speech and is a panellist in the session discussing policies and environmental drivers for mobility growth.\nHe will be joining the panel discussion on policies and environmental drivers for mobility growth.\nDr Frederic will be delivering the opening note speech and join other panellists in discussing policies and environmental drivers for mobility growth.\nThe Africa Mobility Conference is powered by GIG Mobility."
  },
  {
    "headline": "Infobip scoops Business Efficiency Solutions Provider of the Year award at 13th Annual Beacon of ICT Awards",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:On Saturday 28th of May, global communications company Infobip, received the Business Efficiency Solutions Provider of the Year award, at the 13th annual Beacon of ICT Awards held in Lagos.\nThe Beacon of ICT Awards celebrates the top performers in Nigeria’s ICT sector, giving recognition to best practices and outstanding contributions to the industry.\nTo learn more about Infobip, visit: www.infobip.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "How to Transition into Tech in 1 Year",
    "summarized_story": "This piece answers some of your questions about pursuing a career in tech and how to transition.\nA sizeable number of people that transition to tech do so by leveraging their previously acquired skills—though these skills are mostly no-code or non-technical.\nOn a final note:It is very much possible to transition into tech within one year.\nIn the meantime, let’s circle back to where we began:A quick guide on How to Transition into Tech in 1 Year?\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Emergence of voting blocs: Northern Alliance, Bible Belt and Rockies",
    "summarized_story": "Northern AllianceIt wasn’t until the 2003 election that the Northern Alliance was born.\nThe Northern Alliance comprises 11 states mainly situated in northern Nigeria with the exception of one south western state.\nNearly 5 in 10 people in these states vote, with an average voter turnout of 41 percent.\nThe Northern Alliance includes states such as Gombe, Sokoto, Jigawa, Zamfara, Kano, Kebbi, Bauchi, Katsina, Yobe, Borno and Osun.\nSo this is the reason why we’ve grouped them with the Northern Alliance."
  },
  {
    "headline": "Emergence of voting blocs: Northern Alliance, Bible Belt and Rockies",
    "summarized_story": "Northern AllianceIt wasn’t until the 2003 election that the Northern Alliance was born.\nThe Northern Alliance comprises 11 states mainly situated in northern Nigeria with the exception of one south western state.\nNearly 5 in 10 people in these states vote, with an average voter turnout of 41 percent.\nThe Northern Alliance includes states such as Gombe, Sokoto, Jigawa, Zamfara, Kano, Kebbi, Bauchi, Katsina, Yobe, Borno and Osun.\nSo this is the reason why we’ve grouped them with the Northern Alliance."
  },
  {
    "headline": "How each bloc has voted since 1999",
    "summarized_story": "With hindsight, the Bible Belt states’ loyalty to PDP first emerged in the 1999 presidential elections, with all 17 states that form the bloc voting for the PDP’s Olusegun Obasanjo.\nRead also: Emergence of voting blocs: Northern Alliance, Bible Belt and RockiesThe 2011 election painted a picture of the established and growing Northern Alliance bloc.\nThe 2015 election saw a repeat of the trend where the Northern Alliance voted for Buhari.\nThis time, the Rockies voted in unison with the Northern Alliance, and made history in the pro- cess.\nThat’s in keeping with the trend since 1999 which shows that the Northern Alliance has always voted against the PDP and another trend which shows the bloc has voted for Buhari since 2003."
  },
  {
    "headline": "CRICKET: Edo Boys High School Emerges Champions of Templars Schools Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Boys High School Cricket team, Benin City on Friday shown class and style in this year’s male final of the Templars Secondary Schools Boys Competition as they defeated the stubbornly Ohonre Grammar School, Benin by 6 wickets.\nThe second innings didn’t take much time as Edo boys high school only had a target of 31 runs to win.\nIt took them just 6.5 overs to surpass the target and emerge champions.\nHowever, the third place match that took place earlier wasn’t short of the thrill and fun as Government Science and Technical College (GSTC) Benin edged out Christlike Secondary School (IDP Camp).\nAs regards the team’s victory, the coach of Edo boys High School, Mr Theophilus Ibodeme Adophus expressed joy over his team’s victory."
  },
  {
    "headline": "Obaseki seeks doctors’ support to rejig Edo health system, tackle brain drain – Nigerian Observer",
    "summarized_story": "He said, “We need more doctors, particularly with the way the doctors are traveling out for greener pastures.\nWhat we need is to strengthen the institutions that produce doctors.\nThe lesson is that we must fix our healthcare system.\n“We have insisted on healthcare reforms.\n“My focus is on how to produce more doctors by strengthening the basic education system and giving quality education to produce more doctors for the state."
  },
  {
    "headline": "Amstel Malta Ultra Refreshes Okpekpe Race Participants – Nigerian Observer",
    "summarized_story": "The premium beverage brand’s sponsorship of the thrilling road race is part of its commitment to initiating quality interactions and inspiring healthier communities through sporting activities in Nigeria.\nDuring the event, Amstel Malta Ultra, presented as the official malt drink of the race, provided much-needed vitality and motivation for scores of athletes from across the Africa continent who competed to earn a share in the N60million cash reward for top performers.\nSince its launch in 2020, Amstel Malta Ultra has achieved acclaimed recognition among consumers as a drink for health-conscious individuals and fitness enthusiasts.\nThe beverage brand’s ‘no added sugar’ feature makes it the choice drink for athletes and people in the sports industry.\nWith its sponsorship of the 8thOkpekpe International 10km Road Race and its previous editions, Amstel Malta Ultra reiterates its commitment to reviving healthy lifestyle activities, uniting Nigerians through sports, and empowering athletes with premium vitality."
  },
  {
    "headline": "UNIBEN Don laments eroding social value … as NAS organises FOB – Nigerian Observer",
    "summarized_story": "lecturer in Mass Communication deptartment, University of Benin (UNIBEN), Dr. Daniel Ekhereafo has said that the social value in Nigeria has completely broken down within the last 12 years.\n“More worrisome is the monetisation of the political system and the use of youths as thugs and agents of distabilisation.\nAnti-Social behaviour, he added creates a life of affluence that I’d unsubtainable.\nWith anti-social behaviour, he said that the society loses the ingredients for repositioning the society for the better.\nTo remedy the situation, he expressed the need to return to the family value system, while value reorientation must form part of the national and sub-national engagement with the youths."
  },
  {
    "headline": "Lagos state-owned 32-metric tons per hour rice mill ready for inauguration",
    "summarized_story": "The Lagos State Government owned 32-metric tons per hour Rice Mill in Imota, Ikorodu division, will be ready for inauguration in 10 weeks.\nwe have rice paddy.\n”So it is not just about the price of rice going up, it is a function of security.\nThe commissioner urged the westerners, South-West states to wake up and get back into agriculture as a full-time business and cultivate commercial size agriculture.\n”We have to go into commercial size agriculture not small old farm agriculture that we are doing that we are really not seeing the impact."
  },
  {
    "headline": "Osun: APC state, national assembly aspirants bemoan ‘impunity,’ seek cancellation of primaries",
    "summarized_story": "By Sunday Oguntuyi, OsogboState and national assemblies aspirants of the All Progressives Congress (APC) in Osun State have bemoaned the alleged impunity of the state governor, Adegboyega Oyetola, just as they jointly called for the cancellation of the state house of assembly and national assembly primaries of the party, describing it as a sham.\nThe aspirants, who include ten house of assembly and two house of representatives aspirants, accused Governor Oyetola of impunity and total disregard to democratic principles in the conduct of the primaries.\nAccording to the aspirants, the direct primaries was conducted without any election material or party document like membership register, result sheets, among others.\nWaseeu Gbola Adebayo (Olorunda State Constituency) Mr Owoade Ademola Adeyemi (Irewole/Isokan State Constituency), Mr Wahab Kazeem Olanrewaju (Ifelodun State Constituency), Mr Babalola Iqmal Opeyemi (Ede South State Constituency) and Mr. Kolawole Olalere Victor (Ilesa East State ConstituencyOthers are: Mrs. Adesola Arawole Adegbite (Odo-Otin State Constituency), Mr. Olaoye Abdulhakeem (Osogbo State Constituency), Mrs. Olaniyi Shariat Olanike (Ayedaade State Constituency), Mr Kasali Nurudeen Adelaja (Iwo State Constituency), Mr Opadola Abdullahi Amobi (Olaoluwa State Constituency), Hon.\n(Dr) Mr. Komolafe Akinlabi Richard (Ijesha-South Federal Constituency) and Mr Ibrahim Oyekunle (Ayedaade/Irewole/Isokan Federal Constituency)."
  },
  {
    "headline": "NCDC confirms 21 suspected Monkeypox cases, 1 death",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has said 21 suspected cases of monkeypox virus were reported in the country between January 1 and May 29.\nAccording to agency, the suspected cases, 21 were confirmed in nine states with Adamawa leading with 6, Lagos, 4; Cross River, 2; FCT, 2; Kano, 2; Delta, 2; Bayelsa, 2; Rivers, 1; and Imo, 1.\nThe NCDC said one death was recorded in a 40-year-old man with renal co-morbidity and on immune-suppressive drugs.\n“The six (6) new confirmed positive cases (out of the 20 suspected cases) in May 2022 were confirmed from four (4) states – Bayelsa (2), Adamawa (2), Lagos (1), and Rivers (1)”.\nThe NCDC said it had activated the National Multisectoral Emergency Operations Centre at level 2 to continue to coordinate ongoing response activities"
  },
  {
    "headline": "IPOB fumes, as abductors of Methodist Prelate demand N100m",
    "summarized_story": "The Indigenous People of Biafra (IPOB), has condemned the kidnapping of Methodist Church Prelate, His Eminence Samuel Uche Kanu and some of his priests in Abia state, describing it as sacrilegious.\nThis is even as the abductors have demanded N100m ransom to free the prelate and the priests.\n“The Indigenous People of Biafra IPOB wish to condemn in its entirety the kidnapping of Methodist Church Prelate, His Eminence Samuel Kanu in Abia state, we see the kidnapping of Methodist Church Nigeria leader as sacrilegious,” the group said.\n“As we engage in Prayer Warfare, this serves to notify you that the Abductors have demanded a ransom of N100m.\n“The Account particulars are: Name: Methodist Church Nigeria."
  },
  {
    "headline": "Group kicks as FG excludes South-East from PTDF scholarship interviews",
    "summarized_story": "A group, the Abia Media Forum, the organisation of senior journalists in Abia State, kicked against the exclusion of the South-East from the interviews of the Petroleum Technology Development Fund Overseas Scholarship Scheme (PTDF).\n“(The) PTDF instead offers persons from the South-East the opportunity to attend those interviews outside their geopolitical zone.\nAccording to the statement, the PTDF received 26,000 applications and shortlisted over 8000.\n“The Abia Media Forum considers the PTDF claim that the North-West and the North-East are more secure than the South-East both tendentious and ridiculous as it flies in the face of Nigeria’s current history.\nIs Kaduna not the location that citizens can hardly reach again through the connecting road to other towns such as Abuja?” the statement queried."
  },
  {
    "headline": "Some PDP Govs Conspired Against Southern Presidency – Wike",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has declared that some state governors of the Peoples Democratic Party (PDP) ganged up with some vested interest groups to derail the quest of Southern Nigeria to produce the next President of Nigeria in 2023.\nWike spoke on Monday during a grand reception organised for him by the people of the state at Government House, Port Harcourt, to welcome him back from Abuja after the PDP presidential primary election.\nHe accused them of selling out, thereby frustrating the collective efforts that would have secured the PDP presidential ticket by him for the South.\nWike said: “I contested in an election (primary) based on the principle and agreement with all Southern governors and leaders of the South that Presidency should go to the South this period.\nAnd that is why APC never had 25 per cent in this state (Rivers)."
  },
  {
    "headline": "Some PDP Govs Conspired Against Southern Presidency – Wike",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has declared that some state governors of the Peoples Democratic Party (PDP) ganged up with some vested interest groups to derail the quest of Southern Nigeria to produce the next President of Nigeria in 2023.\nWike spoke on Monday during a grand reception organised for him by the people of the state at Government House, Port Harcourt, to welcome him back from Abuja after the PDP presidential primary election.\nHe accused them of selling out, thereby frustrating the collective efforts that would have secured the PDP presidential ticket by him for the South.\nWike said: “I contested in an election (primary) based on the principle and agreement with all Southern governors and leaders of the South that Presidency should go to the South this period.\nAnd that is why APC never had 25 per cent in this state (Rivers)."
  },
  {
    "headline": "JUST-IN: Methodist Prelate, 2 Others Regain Freedom From Kidnappers",
    "summarized_story": "The Prelate, Methodist Church of Nigeria, His Emmence Samuel Kanu Uche, and two ministers of the church, who were abducted alongside with him on Sunday, have regained their freedom.\nAbia State Police Public Relations Officer (PPRO), Mr Geoffrey Ogbonna, disclosed this to LEADERSHIP at about 9.40pm on Monday night.\n“The Prelate and two others have regained their freedom.\nDetails follow later,” the Superintendent of Police said in a text message to our correspondent.\nLEADERSHIP had reported that the Number one Methodist in Nigeria was kidnapped along Ihube-Okigwe-Umunneochi axis of the Port Harcourt-Enugu Highway by yet-to-be-identified gunmen."
  },
  {
    "headline": "JUST-IN: Methodist Prelate, 2 Others Regain Freedom From Kidnappers",
    "summarized_story": "The Prelate, Methodist Church of Nigeria, His Emmence Samuel Kanu Uche, and two ministers of the church, who were abducted alongside with him on Sunday, have regained their freedom.\nAbia State Police Public Relations Officer (PPRO), Mr Geoffrey Ogbonna, disclosed this to LEADERSHIP at about 9.40pm on Monday night.\n“The Prelate and two others have regained their freedom.\nDetails follow later,” the Superintendent of Police said in a text message to our correspondent.\nLEADERSHIP had reported that the Number one Methodist in Nigeria was kidnapped along Ihube-Okigwe-Umunneochi axis of the Port Harcourt-Enugu Highway by yet-to-be-identified gunmen."
  },
  {
    "headline": "2023: I Will Keep My Word By Supporting Atiku – Wike",
    "summarized_story": "The Rivers State governor and former presidential aspirant on the platform of the Peoples Democratic Party (PDP), Nyesom Wike, has reiterated that he would keep his promise by supporting the party’s presidential candidate for the 2023 elections, Alhaji Atiku Abubakar.\nLEADERSHIP reports that former vice president Atiku won the presidential primary election with 371 votes to beat his closest challenger, Governor Wike, who polled 237 votes.\nSubsequently, Atiku had earlier on Monday paid a visit to Wike at his Abuja residence to further solicit the governor’s support.\nGovernor Wike wrote: “I made a vow to the Official Peoples Democratic Party (PDP) Nigeria that I will support whoever emerges from the #PDPPresidentialPrimaries and I am not going to go back on my word.\n“We cannot abandon the PDP, we will be fully supporting Atiku Abubakar.”"
  },
  {
    "headline": "Updated: Kidnapped Methodist Church Prelate, Uche released [Video]",
    "summarized_story": "Prelate of the Methodist Church Nigeria, His Eminence Samuel Kalu Uche has reportedly been released by his abductors.\nThe spokesman, Abia State Police Command, Geoffrey Ogbonna confirmed to PM NEWS that Uche had been released by his captors.\nLater a video surfaced online, showing the Prelate in a dance of joy with church members.\nThe secretary released the account particulars as follows: “Name: Methodist Church Nigeria.\n“The safety of the Prelate and other abductees must be of paramount concern to all, and your contributions spiritually and monetarily shall not go unrewarded.”"
  },
  {
    "headline": "American Ted Sams graduates 60 years later: His touching story",
    "summarized_story": "For 60 years, California man Ted Sams regretted missing his high school graduation.Now 78, Sams can finally call himself a graduate.\nLast Friday, he donned a cap and gown and received his diploma with the class of 2022 at Southern California’s San Gabriel High School.\nBack in 1962 when he was a high school senior, Sams got in trouble and was suspended five days before the end of the school year.\n“When I went back with my grade, they wouldn’t give me my diploma because I owed $4.80 for a book,” Sams told KABC-TV.\n“And so I just walked away and said forget it.”The school still had Sams’ original diploma locked away in an old filing cabinet."
  },
  {
    "headline": "Breaking: Pat Utomi steps down for Peter Obi to emerge LP presidential candidate",
    "summarized_story": "Breaking: Pat Utomi steps down for Peter Obi to emerge LP presidential candidateProfessor of political economy and co-convener of the National Consultative Front (NCFront), Pat Utomi has stepped down for the former governor of Anambra state, Mr Peter Obi to emerge the presidential candidate of Labour Party.\nUtomi announced his decision on Monday during the national convention of the party.\nVanguard had reported how Obi had arrived the venue of the convention, which is taking place in Delta state.\nDetails later.."
  },
  {
    "headline": "Breaking: Peter Obi storms Labour Party Convention",
    "summarized_story": "Former governor of Anambra state, Mr. Peter Obi, has arrived the venue of Labour Party Convention.\nOseloka Henry Obaze, former Peoples Democratic Party, PDP, governorship candidate, disclosed this.\nObi had last week resigned from the opposition Peoples Democratic Party, PDP, and withdrew from the presidential race.\nHowever, the question in everyone’s mind is: would Obi emerge the presidential candidate of Labour Party?\nAnd what is his fate in Labour Party?"
  },
  {
    "headline": "BREAKING: Screening of APC presidential aspirants begins today",
    "summarized_story": "Ahead of the presidential primary of the All Progressives Congress (APC) scheduled to take place between June 6th and June 8th, the ruling party will today commence the screening of the presidential aspirants.\nNews Direct gathered that the ruling party has appointed the former National Chairman of the party, Chief John Oyegun, as the Chairman of the Presidential Screening Committee.\nRecall that 28 presidential aspirants obtained the nomination and expression of interest forms of the ruling party.\nOthers are: Pastor Tunde Bakare, Cross River State Governor, Prof. Ben Ayade; Ebonyi State Governor, Gov.\nEmeka Nwajiuba; former Senate President, Sen. Ken Nnamani; Kogi State Governor, Yahaya Bello; Jigawa governor, Mohammed Badaru Abubakar; and former Zamfara State governor, Sen. Ahmed Yerima."
  },
  {
    "headline": "How APC Cabal Deceived Jonathan, Made Ex-leader Miss Out On Party’s Presidential Aspirants’ List, PDP Convention",
    "summarized_story": "That also prevented him from attending the PDP’s presidential primary election,” the presidential source said.\n“I think he (Jonathan) was just deceived intensely to ensure he didn’t attend the PDP presidential primary.\n“The APC Chairman told him they had to wait for President Buhari to come back from Malabo.\nAfter Buhari returned, they changed the tune and he (Jonathan) was unable to meet Buhari as promised by the chairman and cabal.\nBuhari told him to meet with the APC National Chairman, Abdullahi Adamu, but Adamu said he can’t guarantee him as a consensus candidate."
  },
  {
    "headline": "Breaking: Kidnapped Methodist church leader released",
    "summarized_story": "The prelate of Methodist church Nigeria, His Eminence Samuel Uche, kidnapped by abductors alongside two priests has regained his freedom.\nBishop Uche and other priests who were kidnapped on Sunday afternoon along Enugu-Portharcourt expressway were freed Monday, Blueprint reports.\nAlready, Police in Abia state have confirmed their release, but didn’t give details on whether any ransom was paid.\nDetailsShare this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] 2023 presidency: Pat Utomi steps down as Peter Obi clinches Labour party ticket",
    "summarized_story": "Renowned economist, and presidential aspirant Prof. Pat Utomi, on Monday stepped down for former Anambra State Governor, Peter Obi, on Monday.\nThe latest development happened at Asaba, Delta state capital, during the National convention of Labour party.\nWith this, Peter Obi undoubtedly clinched the party’s ticket as its presidential candidate ahead of 2023 general elections.\nUtomi, was quoted as saying: “Obi must be given the opportunity to govern this country,” before stepping down for the foremost business mogul, banker and politician, who was the Vice Presidential Candidate of the PDP, in the February 23, 2019 election.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Atiku storms Wike’s residence days after winning PDP presidential primary",
    "summarized_story": "The People’s Democratic Party (PDP) presidential candidate, Atiku Abubakar, Monday, visited Rivers State Governor, Nyesom Wike in Abuja, barely two days after battling their party’s Presidential ticket.\nAtiku, a former vice president defeated Wike at the party’s presidential primary in Abuja on Saturday night.\nAtiku secured the votes of 371 delegates while his closest rival Wike, polled 237 votes.\nIt was gathered that the visit was to reconcile the two party chieftains and give the PDP a robust outing in the 2023 presidential election against the ruling All Progressives Congress.\nShare this: TwitterFacebook"
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Excess Crude Account, $35.377m as of 25th May 2022 – FG",
    "summarized_story": "602bn in AprilBY ONU OKORIEFederal Government has revealed that the balance in the Nigeria’s Excess Crude Account as of 25th May 2022 stands at $35.377 million.\nThe communiqué indicated that the Gross Revenue available from the Value Added Tax (VAT) for April 2022 was N166.522 billion.\nThe distribution is as follows; Federal Government got N24.978 billion, the States received N83.261 billion, Local Government Councils got N58.283 billion.\nAccording to the communique, Gross Statutory Revenue of N461.189 billion, from which the Federal Government was allocated the sum of N217.412 billion, States got N110.275 billion, LGCs got N85.017, Derivation (13% Mineral Revenue) got N48.485 billion.\nThe communiqué also revealed that Petroleum Profit Tax (PPT), Oil and Excise Duty increased marginally, while Oil and Gas Royalties, Import Duty, Companies Income Tax (CIT) and Value Added Tax (VAT) all recorded significant decreases."
  },
  {
    "headline": "Peter Obi Could Have Been My Vice President In NNPP – Kwankwaso",
    "summarized_story": "The presidential candidate of the New Nigerian Peoples Party (NNPP), Rabiu Kwankwaso, has said the former governor of Anambra State, Peter Obi, could have been his running.\nKwankwaso, a former governor of Kano State, spoke on Monday following speculations that the-now presidential candidate of the Labour Party (LP) was set to become his running mate.\nAs far as the former APC chieftain is concerned, the NNPP needs an influential personality as the party’s vice-presidential candidate.\nThe 65-year-old’s comment is his first remark about Obi after speculations intensified that the former Peoples Democratic Party (PDP) vice presidential candidate was going to be Kwankwaso’s running mate.\nEarlier on Monday, Obi had emerged as the flagbearer of the Labour Party after some of the contenders back out of the race."
  },
  {
    "headline": "Wike Reveals How He Almost Scuttled PDP Presidential Primary, Calls For Calm",
    "summarized_story": "Governor Nyesom Wike of Rivers State has revealed how he almost scuttled the Peoples Democratic Party (PDP) presidential primary as he called on his supporters to remain calm.\nThe governor said this on Monday at a reception in his honour at the Government House in Port Harcourt following his return from the party’s presidential primary in Abuja.\n'”READ ALSO: Atiku Emerges PDP’s 2023 Presidential Flagbearer‘God’s Will’He, however, called on his supporters to remain calm, describing his loss at the PDP presidential primary as the will of God.\n“It is God’s will, let us not bother ourselves so much,” Wike said, accusing governors of the southern region of betrayal.\nYou have lost.”Governor Wike said though he did not clinch the PDP presidential ticket, he believes, just like his supporters, that his performance has raised the political profile of Rivers State and other minority groups in Nigeria."
  },
  {
    "headline": "Methodist Church Prelate, Two Other Clerics Regain Freedom",
    "summarized_story": "The kidnapped Prelate of the Methodist Church, His Eminence Samuel Uche, and two other abducted clerics have regained freedom.\nThe church is also yet to issue a statement about the release of the men who were abducted in Abia State on Sunday.\nThe police spokesman in the state Geoffrey Ogbonna had told Channels Television that the preacher was kidnapped alongside two others – the Bishop of Methodist Church, Owerri Diocese, and the prelate’s chaplain.\nIn the wake of the incident, the command mobilised men to speed up efforts to rescue the clergymen.\n“We have mobilised all the tactical teams to ensure they are rescued and for the possible arrest of the hoodlums,” Ogbonna said at that time."
  },
  {
    "headline": "UPDATED: Peter Obi Emerges Labour Party Presidential Candidate",
    "summarized_story": "﻿Former Anambra State Governor, Peter Obi, has emerged as the presidential candidate of the Labour Party ahead of the forthcoming general elections.\nHis emergence as the party’s flagbearer follows his victory at the presidential primary of the Labour Party.\nThe party conducted the primary for its presidential ticket on Monday in Asaba, Delta State capital.\nA total of 185 delegates had been accredited to vote in the exercise to elect one of four aspirants seeking to clinch the party’s presidential ticket.\nThree days after his resignation, the former governor pitched his tent with the Labour Party, in his bid to succeed President Muhammadu Buhari in 2023."
  },
  {
    "headline": "Zamfara Police Command Arrest Suspect In Possession Of Human Part",
    "summarized_story": "Police operatives in Zamfara State have arrested a suspect for culpable homicide and being in possession of human part (hand).\nA statement from the Zamfara Police Command on Monday gave the suspect’s name as Jabiru Ibrahim from Dauran district in the Zarmi council area of the state.\nREAD ALSO: Gunmen Attack Anambra Broadcasting Service Office In Awada“The suspect was arrested by the joint police and military operatives on anti-banditry operation along Dauran-Zurmi axis and brought to the Police Command Headquarters, Gusau for discreet investigation,” the police command spokesman, Mohammed Shehu, said in the statement.\n“Preliminary investigation revealed that the suspect was among the members of the outlawed group (YANSAKAI) who have been terrorising members of Dauran community through jungle justice, leading to reprisal attacks by bandits terrorists against the innocent members of the public.\n“In the course of interrogation, the suspect had confessed that himself and three (3) other members of his gang, now at large, carried out the gruesome killing of one Abdullah, a Fulani by tribe, and later, the suspect removed the right hand of the deceased.”Further investigations are ongoing with a view to nabbing his partners and also unravel the circumstances behind their actions before they are charged to court, he said."
  },
  {
    "headline": "Allegation of dollarisation of PDP primary, a mere rumour",
    "summarized_story": "Former Spokesman of the Atiku Abubakar Campaign Organisation and PDP governorship candidate in Ogun state, Segun Sowunmi, has described as mere rumour and exaggeration, the alleged dollarization of the just concluded presidential primary of the party.\n“I think that we must be careful that we do not allow rumour to become fact.\nIf you are looking for Political parties that dollarises and criminalises the process, it’s APC.\nThe governorship candidate, however cautioned cultural groups like PANDEF, Arewa Consultative Forum, Afenifere and others to steer clear of political matters and allow political parties manage its affairs.\n” I have advised that PANDEF, Arewa, Afenifere and others need to be told not to jump into political matters as if they are political parties."
  },
  {
    "headline": "Atiku will win 2023 Presidential election with a landslide",
    "summarized_story": "Mr Melaye equally expressed his confidence in the party’s ability to wrestle power from the APC government in 2023.\nHe said governor Tambuwal did not betray Mr Wike as there was no written agreement between the two of them.\nSpeaking on the alleged supremacy battle between North and South at the presidential primary, Mr Melaye accused APC of spreading such fake news.\nHe touted Mr Kolade-Otitoju to swear with Bible that PDP did not win the 2019 presidential election.\nSo we decided to throw it open to acquire power before sharing power,” Mr Melaye said while reacting to the choice of a northern candidate."
  },
  {
    "headline": "Benue State APC Gubernatorial Aspirants React to outcome -",
    "summarized_story": "Four Benue State gubernatorial aspirants on the APC platform including Senator Barnabas Gemade, Mike Aondoakaa (SAN), Mathias Ibuan and Terhemba Shija have registered their petitions to the Governorship Appeal Panel Committee.\nThe aspirants who took turns to state their cases rejected the outcome and called for fresh primaries to be conducted in the State.\nMeanwhile, a section of Benue APC today staged a protest in Makurdi.\nThe Governorship Primary of the All Progressives Congress had ended with a suspended Catholic Priest, Reverend Father Hyacinth Iormen Alia emerging as the winner.\nHis ambition had been causing ripples within the All Progressives Congress in the State."
  },
  {
    "headline": "Pastor Bakare attends APC presidential screening",
    "summarized_story": "One of the 23 aspirants of the All Progressives Congress, APC, Pastor Tunde Bakare, has arrived Transcorp Hilton Hotel, the venue for the party’s presidential aspirants screening."
  },
  {
    "headline": "Peter Obi Emerges Labour Party Presidential Candidate By Consensus",
    "summarized_story": "Former governor of Anambra State, Peter Obi, has emerged the presidential candidate of the Labour Party of Nigeria for the 2023 general elections.\nObi emerged after a presidential primary election held in Asaba, Delta State.\nObi’s Campaign Director, Doyin Okupe confirmed that other aspirants in the race like Professor Pat Utomi, Faduri Joseph and Olushola Emmanuel-Tella stepped down for him.\nEmmanuel-Tella who was the only female aspirant had initially stood her ground that she would not step down for Obi but eventually did so.\nAddressing delegates earlier, Obi said he is ready to restructure Nigeria and it’s time for the people to come out and vote."
  },
  {
    "headline": "Jonathan Won’t Be APC Presidential Flagbearer – Hilliard Eta",
    "summarized_story": "Against the backdrop of purported moves to impose former Nigeria President Goodluck Jonathan as presidential candidate of the All Progressives Congress, Hilliard Eta, a former National Vice Chairman (South South) of the APC and supporter of Asiwaju Bola Tinubu’s aspiration, is emphatic the Jonathan option is dead on arrival."
  },
  {
    "headline": "Egypt Court Jails Former Presidential Candidate for 15 Years",
    "summarized_story": "Aboul Fotouh, 70, who suffers from several medical conditions according to his family, was sentenced to 15 years in prison subject to appeal, the court ruling said on Sunday.\nRelatedStories No Content AvailableMohamed al-Qassas, the deputy head of Aboul Fotouh’s Strong Egypt party, received a 10-year sentence.\nRights groups have repeatedly criticised such mass sentencings in Egypt and called on authorities to ensure fair trials.\nAboul Fotouh is a former senior Brotherhood leader who was sacked from the group in 2011 when he decided to run in Egypt’s presidential elections.\nEgypt banned the Brotherhood after Sisi, then army chief, led the overthrow of democratically-elected Brotherhood President Mohamed Mursi following mass protests in 2013."
  },
  {
    "headline": "Heavy Fighting as Russian Troops Enter Sievierodonetsk in Eastern Ukraine",
    "summarized_story": "Russian troops have entered the outskirts of the Ukrainian city of Sievierodonetsk, the regional governor said on Monday, describing “very fierce” fighting in the ruins of a city that has become the focus of Moscow’s offensive.\nRelatedStories No Content AvailableIncessant shelling has left Ukrainian forces defending ruins in Sievierodonetsk, but their refusal to withdraw has slowed the massive Russian offensive across the Donbas region.\nLuhansk region governor Serhiy Gaidai said Russian troops had advanced into the city’s southeastern and northeastern fringes.\nBut he said Ukrainian forces had driven the Russians out of the village of Toshkivka to the south, potentially frustrating Moscow’s push to encircle the area.\nRussian Foreign Minister Sergei Lavrov on Sunday said the “liberation” of the Donbas was an “unconditional priority” for Moscow."
  },
  {
    "headline": "Russian Foreign Minister Lavrov Denies Putin Illness",
    "summarized_story": "Russian Foreign Minister Sergei Lavrov has denied speculation that President Vladimir Putin is ill.\nIn an interview with French TV, Mr Lavrov said the Russian leader appears in public every day, and no sane person would see any signs of an ailment.\nThere has been increasing unconfirmed media speculation that Mr Putin, who turns 70 this year, may be suffering from ill health, possibly cancer.\nMr Lavrov said the “liberation” of the eastern region was an “unconditional priority” for Russia.\nMr Lavrov told TF1 that winning in “the Donetsk and Luhansk regions, recognised by the Russian Federation as independent states, is an unconditional priority”."
  }
]