[
  {
    "headline": "National Assembly won’t gag media, says Senate",
    "summarized_story": "The Senate has said it was not possible for the 9th National Assembly to stiffen the media in Nigeria with its current amendments to the acts which established the National Broadcasting Commission and the Nigerian Press Council.\nThe Spokesperson for the Senate, Dr. Ajibola Basiru, who gave the assurance on Monday, said the amendments to the acts and other relevant laws should not be misinterpreted as an attempt to gag the freedom of speech and free press in the country.\nBasiru spoke in an interview with journalists at the sidelines of a two-day capacity building training for Media Aides to Principal Officers of the National Assembly, organised by the National Institute for Legislative and Democratic Studies in Abuja on Monday.\nBasiru said, “The freedom of speech is an inalienable right of the people and effectively captured in the 1999 Constitution.\n“There is the need to ensure that some regulations are put in place to prevent reckless and irresponsible use of such rights as had been exhibited by a few media establishments and individuals in recent times in the country."
  },
  {
    "headline": "FG approves N18bn take-off grant for new varsities",
    "summarized_story": "The Federal Government has approved the disbursement of N18 billion as take-off grant for four new universities.\nThe Permanent Secretary, Ministry of Education, Mr Sunday Echono, disclosed this at a press conference in Abuja on Monday.\nAccording to Echono, the take-off grant came after the promise made by the President, Major General Muhammadu Buhari (retd.\n), to establish Universities of Technology and Health Sciences in Nigeria during his campaign in 2015.\nHe added, “With the report of the Presidential Task Force on COVID-19, it was noticed that the pandemic exposed the weak institutional capacity of disease control and surveillance in the country."
  },
  {
    "headline": "NDDC: Those opposed to Okumagba are enemies of N/Delta— UPC",
    "summarized_story": "By Festus Ahon, ASABAUrhobo People Congress, UPC, Monday, said those opposed to the nomination and confirmation of Chief Bernard Okumagba as the Managing Director of the Niger Delta Development Commission, NDDC as enemies of the region.\nThe attempt by the IIG to mislead the public on the issue of the lineage of Chief Bernard Okumagba is vexatious, mischievous and highly provocative.\n“Udu kingdom where Chief Bernard Okumagba hails from maternally is a major Oil and Gas producing Local Government Area.\n“We wish to state here categorically that anyone from the Niger Delta region who goes against the generally accepted appointment of Chief Bernard Okumagba is an enemy of the Niger Delta region.\n“Chief Bernard Okumagba is known to all across Delta State and the Niger Delta as a detribalised person, a committed and patriotic Niger Deltan."
  },
  {
    "headline": "APC’s future depends on Nigerian youths ― Buni",
    "summarized_story": "Gov Mai Mala Buni of Yobe StateGovernor Mai Mala Buni of Yobe says the future of the All Progressives Congress (APC) lies in the hands of Nigerian youths.\nBuni, also Chairman, APC Caretaker and Extra-Ordinary Convention Planning Committee, (CECPC) said this at the APC Progressives Youth Conference on Monday in Abuja.\n“We must invest in the youths for a better future for the party and the country.\n“Therefore, this conference and theme are both strategic and timely for a prosperous future for the party and our beloved country,” he said.\nBuni said during the reconciliation process, APC youths were cooperative to the collective approach to rebuilding the party."
  },
  {
    "headline": "Pharmacists link insecurity to easy access to drugs by youths",
    "summarized_story": "…set to tackle spread of hard drugsBy Ibrahim WuyoChairman, Pharmacists Council of Nigeria (PCN), Prof. Ahmed Mora, has said that the spate of insecurity across Nigeria and other vices have been blamed on easy access to psychotropic drugs by the youth.\nHe said the youths could easily pick these addictive drugs across the counter to abuse them even without prescription.\nAs a result of these ugly trend ,PCN has embarked on regulation of controlled and psychotropic drugs, as well as identifying fake drugs through the planned electronic registration of manufactured and imported drugs,he said.\nHe made it known while speaking to journalists in Kaduna on Monday during a One Day Sensitisation Workshop to Kick-start Implementation of Pharmacist Consultant Cadre in Nigeria.\nAlso Read: Flood: Kano to expend N80m on clearance of drainagesHe added that the electronic registration of pharmacies would ensure that drugs are regulated and addictive and psychotropic drugs become inaccessible without prescription, while drugs outside the system will be known as fake drugs."
  },
  {
    "headline": "EndSars: We don’t want to name our baby in prison — Family of teenage detainee plead with court, Ondo govt",
    "summarized_story": "Their lawyer, Tope Temokun who spoke with newsmen after efforts to get bail for her in court failed yesterday.\nKemisola was delivered of a baby boy in the correctional facility in Ondo West Local Government Area of the state last week.\n“The boy has been announced to the world and am very confident that the boy is going to be great.\n“But that is not to say that we should allow the naming ceremony to take place in prison.\nAccording to him ” the office of the Attorney-General of Ondo State remain committed to rule of law by ensuring that the constitutional rights of the good people of Ondo State are protected at all times”."
  },
  {
    "headline": "Cattle dealers finger Miyetti Allah in violence in Igboland, Northern regions",
    "summarized_story": "There is an ethnic group in the Fulani tribe that are carrying AK 47, and are the most wicked people.\n“The Miyetti Allah not helping matters they are allying with this group, for instance, if your farms are destroyed by this group the Miyetti Allah is supposed to intervene by asking the herders to pay compensation.\nThe Miyetti Allah is encouraging these people to destroy farms.\nThe Federal Government should check Fulanis coming into the country ànd even the state governments should do the same.\nThe governor is doing his best to restore peace which we have seen in the past few weeks."
  },
  {
    "headline": "Appeal Court President inaugurates special court sitting for over 270 cases in Jos",
    "summarized_story": "Justice Monica Dongban-Mensem has organised a special court sitting in Jos, the Plateau State Capital, where about 270 Motions and Appeals would be addressed for quick dispensation of justice.\nMensem disclosed this on Monday during the inauguration of the special court sitting, held at the Court of Appeal Jos Division.\nShe described the special sitting which started from Abuja, Lagos and Jos as apt and said any Court of Appeal Division that apply for the special court sitting would be given the opportunity.\nHe appeal to the President to extend the special sitting to the Court of Appeal Gombe Division, due to insecurity as lawyers from Jos travel on daily basis to Gombe for court cases.\nJustice A .G Mshelia appreciated the President Court of Appeal for granting the special sitting and for showing more concerned on the welfare of Justices of the Court Appeal."
  },
  {
    "headline": "Kemisola Ogunniyi: Release of End SARS protester who delivered baby in prison stalled",
    "summarized_story": "The move to ensure that the 18-year-old End SARS protester who gave birth in prison custody is released has been stalled.\nKemisola was arrested alongside three others suspects during the curfew imposed in Ondo State in the wake of the End SARS protest.\nAccording to the Counsel to the Defendant, Tope Temokun, the bail of his client would be considered on Tuesday due to the procedure of the court.\nThe Counsel also disclosed that the baby would be christened on Wednesday.\nWe have to follow the court procedure,” the AG stated."
  },
  {
    "headline": "BREAKING: Lagos Assembly amends Electoral Commission law",
    "summarized_story": "The Lagos House of Assembly, on Monday, reviewed and amended a portion of the law creating the state’s Independent Electoral Commission (LASIEC).\nThe legislature revised the law by creating a subsection for Section 2 of the law.\nThe newly-added subsection 5 gives the Governor of the State the power to extend the tenure of the commission based on exigencies.\nThe Speaker, Mudashiru Obasa explained that the portion of the law was amended to meet the exigencies of time.\nObasa added that a legal extension of the members of the commission would help them effectively conclude the elections with the backing of the law."
  },
  {
    "headline": "Plateau South: Tribunal upholds Sen. Daduut’s election, strikes out Daika’s petition",
    "summarized_story": "The National Assembly Petition Tribunal sitting in Jos, the Plateau State Capital, has trashed the petition of the candidate of the main opposition Peoples Democratic Party (PDP) for lacking in merit.\nThe Tribunal equally upheld the election of Senator Nora Daduut as the Senator representing Plateau South Senatorial District.\n“The tribunal therefore held that the election conducted on the 5th of December 2020 was smooth, peaceful, free, fair and credible.\nI have the conviction that the ruling will further strengthen democracy not only in Plateau state but Nigeria as a whole.\nLet’s join hands to advance development of Plateau South”, she maintained."
  },
  {
    "headline": "How Buhari’s promises of restructuring gained him votes in 2015",
    "summarized_story": "So those calling for whether separation or restructuring, some of them I will say they are very naive or even mischievously dangerous.\nA former presidential aide, Reno Omokri described Buhari’s promise as an election scam stating that it was the promise that gave him the victory in 2015.\n“Yet, Buhari made false promises to restructure Nigeria and obtained votes from Nigerians based on that.\nNow, he says he will NEVER restructure Nigeria.\nA respondent, Promise Emeka who spoke to DAILY POST in Abuja, said the president used restructuring to market himself during the election."
  },
  {
    "headline": "Miyetti Allah backing killer herders, say Cattle dealers",
    "summarized_story": "By Chris Njoku, OwerriCattle Dealers Association of Nigeria (CDAN) Imo chapter has blamed Myetti Allah Cattle Breeders Association of Nigeria (MBAN) for the excesses of killer herdsmen in South East and across the nation.\nCDAN chairman, Ibrahim Salihi, during a courtesy visit to Chief Emmanuel Iwuanyanwu in Owerri, alleged Miyetti Allah was allying with killer herdsmen instead of condemning them for destroying farmlands with no compensation.\nHe said: “The Miyetti Allah is not helping matters they are allying with this group, encouraging these people to destroy farms.\nThe group appealed to the Federal Government to check influx of these killer herdsmen into Nigeria, saying that many of them are not Nigerians.\n“The Federal Government should check Fulanis coming into the country ànd even the State Governments should do the same."
  },
  {
    "headline": "Drama as UAE reverses resumption of flights to Nigeria",
    "summarized_story": "By Samuel OamenThe United Arab Emirates (UAE) has suspended flights to and from Nigeria again.\nIt announced resumption of flights from Nigeria several months after the ban over COVID-19 protocols.\nUAE official website had stated travel protocols for inbound passengers from South Africa, Nigeria and India.\nPassengers must also undergo a PCR test on arrival in Dubai.”But in a dramatic move, UAE reversed the resumption of flights to Nigeria billed to take off on June 23.\nWhile affirming its “commitment to Nigeria”, the UAE said it was looking forward to resuming passenger services “when conditions allow.”"
  },
  {
    "headline": "CAS reduces Siasia’s life ban to five years, overturns £40,000 fine",
    "summarized_story": "Agency ReporterThe Court of Arbitration for Sport (CAS) has reduced the life ban imposed on former Super Eagles coach Samson Siasia by FIFA in a match-fixing case to five years.\nThe life ban was to keep Siasia away from all football-related activities (administrative, sports, or any other) at national and international levels.\nAnd on Monday, CAS, the number one institution involved in resolving legal disputes in the field of football, ruled that a life ban for Samson Siasia was “disproportionate” for a passive offence that did not earn him any money.\nSiasia will be able to return to football administration and management when his ban expires in August 2024.\nADVERTISEMENTDuring a distinguished playing career, Siasia helped Nigeria win the 1994 Africa Cup of Nations and qualify the country for her first appearance at the FIFA World Cup the same year."
  },
  {
    "headline": "Buhari approves N18bn for take-off of four specialised varsities",
    "summarized_story": "By Frank Ikpefan, AbujaThe Federal Government on Monday announced approval of N18 billion by President Muhammadu Buhari for establishment of four specialised universities.\nADVERTISEMENTAdamu, who was represented by Permanent Secretary in the ministry, Sonny Echono, said the choice of locations was based on the promise of establishing an apex technology institute in the nation’s capital and one in each geo-political zone.\n“Similarly, a National Institute of Technology (NIT) shall be established in Abuja.\nAccordingly the two new Universities of Technology will beestablished in 2021 while the upgrade of the existing 4nos Universities of Technology and the National Institute of Technology will come on stream next year.\n“To ensure early take-off of these institutions, Mr. President approved a take-off grant of N4billion each for the universities of technology and N5billion each for the universities of Health Science from the funding Resources of Tetfund."
  },
  {
    "headline": "Niger school abduction: Negotiations collapse as Gov Bello orders full scale rescue operation",
    "summarized_story": "About 1,000 security agents, drawn from the Army, the Police, Civil Defence, the local hunters and local vigilantes have been mobilized for the rescue operation.\nThis is coming almost three weeks after the abduction of the school children, and after series of negotiations between the parents and the bandits.\nAfter agreeing with parents they started shifting goal post and now we are here to take action”.\nThe Governor disclosed that “most of these Bandits are from outside the country, they are hired to cause problems for us.\nThe Governor had earlier met with Parents of the 136 kidnapped students of the Islammiya School and other stakeholders at the palace of the Emir of Kagara, Alh."
  },
  {
    "headline": "Buhari meets Ngige, Gambari over insecurity in South East",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at the weekend met with Minister of Labour and Employment, Chris Ngige, and his Chief of Staff, Ibrahim Gambari at Aso Rock over the escalating insecurity in the South East.\nBriefing State House Correspondents at the end of the meeting, Ngige said they both briefed the president and made proposals to him on how to end the crisis.\nAnd we are following up with dialogue, which at the end of the day is what will happen.\n“I have to see him to appraise him with labour industrial milieu, especially when you know that the judiciary and parliamentary workers JUSUN and PASAN respectively had been been on strike that lasted for two months.\nWe achieved a truce, through up an agreement and we have to today summit his own copies of the agreement to him."
  },
  {
    "headline": "Father’s Day: Kalu tasks fathers on nation building",
    "summarized_story": "Kalu tasked the nation’s fathers to rise to the occasion of defending the Church and the nation at large.\nThe ambience of the church was lightened up as Kalu donated over N2 million to the Catholic Men Organisation (CMO), Catholic Women Organisation and officiating Catholic priests.\nFather Charles congratulated fathers and acknowledged that the roles of fathers in nation building cannot be over-emphasised.\nThe Catholic cleric also urged fathers to register with CMO and lamented the refusal of some fathers in the church to join the organisation.\nHe outlined the numerous benefits of aligning with the forum, while urging unregistered fathers to join the association."
  },
  {
    "headline": "NDLEA nabs law enforcement officer, 6 others for dealing in cocaine",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has arrested a serving officer of a law enforcement agency, Popoola Abayomi for selling assorted illicit drugs to students of a Federal university and cultists in Ogun state.\nBefore he was finally arrested, Abayomi, had been on the watch list of the agency in connection with drug related offences.\nAfter the arrest of the two suspects, some student union officials of the institution blocked the NDLEA team with their official vehicle.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nThe suspect had arrived the ‘D’ arrival hall of the airport on 14th June on Turkish airline flight from Pakistan with the illicit drug inserted in his anus."
  },
  {
    "headline": "Security beefed up as Olu of Warri burial rites begin",
    "summarized_story": "From Ben Dunno, WarriOde-Itsekiri, the traditional ancestral home of Itsekiri nation, is witnessing heavy presence of armed security personnels as burial rites commences for the late Olu of Warri, Ogiame Ikenwoli.\nThe vigil was part of the activities lined-up as 14 days traditional funeral rites for the repose of the soul of the royal father and was witnessed by dignitaries from all walks of life, both at home and in the diaspora.\nHowever, Saturday’s all-night traditional funeral rites was hitch-free with Ogele Ukpukpe, Ibiogbe and Uku-Umalikun Ola-Aja dancers from various Itsekiri communities showcasing their rich cultural heritage to the delight of those in attendance, including non-indigenes.\nThe traditional funeral rites was presided over by the Regent of Warri Kingdom, Prince Emmanuel Okotie-Eboh and coordinated by lawmaker representing Warri Federal Constituency at the House of Representatives, Thomas Ereyitomi.\nA commendable service was held in the Church of the Palace of Olu of Warri last Thursday, as part of the 14 days burial rites for the late monarch."
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "BUSTED: Foreign Affairs Ministry Mismanages N28billion Released By Buhari For Distressed Missions",
    "summarized_story": "The Ministry of Foreign Affairs allegedly mismanaged $68 million (about N28 billion) released by the President Muhammadu Buhari administration in 2018 for disbursement to some of the country’s foreign missions, SaharaReporters learnt.\nSaharaReporters learnt from a government’s audit report that the Ministry’s Permanent Secretary has now been asked to explain how the funds, allegedly misused, were disbursed to the missions.\nThe Auditor-General’s report stated that when queries were sent to the ministry to explain the issues around how $68 million was disbursed, no responses were received.\nThe report reads, “Issue 1 – Lack of accountability in the Disbursement of intervention fund for distressed missions - $68,875,902.\nThe Ministry however approved the release of the excess to the Consulate-General of Nigeria in Dubai, which was originally not among the missions in need of intervention funds."
  },
  {
    "headline": "Fifteen Abducted Teachers In Niger School Managed To Escape— Headmaster",
    "summarized_story": "The headmaster of Salihu Tanko Islamic School in Niger State, Abubakar Alhassan, has said that 15 out of the teachers abducted from the school managed to escape from captivity.\nHe stated this when the state governor, Abubakar Bello, met with parents of the abducted schoolchildren at the palace of Ahmed Gunna, Emir of Kagara, on Monday.\nFile PhotoMany students and teachers were abducted from the school located in Tegina Town, in the Rafi Local Government Area of the state on May 30.\nSee Also Insecurity Double Jeopardy As Mother Of Niger State Islamiyya Student Dies Few Days After Child’s KidnapAlhassan said the escaped teachers were in a military facility in Birnin Gwari, Kaduna State, where they would be handed over to the Niger State Government.\nOn his part, the governor advised parents of the abducted students to exercise patience as the government was exploring all avenues to ensure their safe rescue."
  },
  {
    "headline": "Gumi to FG: Engage bandits if you want schools secured",
    "summarized_story": "Ahmad Gumi, a prominent Islamic cleric, has called on the federal government to engage bandits in order to guarantee security in schools.\nThe latest abduction occurred last Thursday when bandits attacked Federal Government College, Birnin-Yauri in Kebbi state and abducted many students and staff.\nThe abductions have resulted in the suspension of boarding schools and the deployment of security operatives to schools in some states.\n“To secure schools, why not engage the bandits.\nThey went on to demand N200 million ransom for the release of 156 Islamiyya students."
  },
  {
    "headline": "Gumi to FG: Engage bandits if you want schools secured",
    "summarized_story": "Ahmad Gumi, a prominent Islamic cleric, has called on the federal government to engage bandits in order to guarantee security in schools.\nThe latest abduction occurred last Thursday when bandits attacked Federal Government College, Birnin-Yauri in Kebbi state and abducted many students and staff.\nThe abductions have resulted in the suspension of boarding schools and the deployment of security operatives to schools in some states.\n“To secure schools, why not engage the bandits.\nThey went on to demand N200 million ransom for the release of 156 Islamiyya students."
  },
  {
    "headline": "Oil spills: Court awards N82bn damages against Mobil, NNPC",
    "summarized_story": "A federal high court in Abuja has ordered Mobil Producing Nigeria Unlimited and the Nigerian National Petroleum Corporation (NNPC) to pay N81.9 billion as damages to communities in Ibeno LGA of Akwa Ibom state over oil spillage.\nAdvertisementThe court awarded the sum of N42.8 billion as damages for intangible losses, N21.9 billion for special damages as annotated and N10 billion as general damages.\nDelivering the judgment on Monday, Taiwo Taiwo, the judge said the companies must make payment to the communities within 14 days.\nThe judge held that the negligence of Mobil and NNPC caused environmental degradation in the communities.\nHowever, the judge held that the instant suit had to do with fundamental rights that cannot be rendered impotent by the statute of limitations."
  },
  {
    "headline": "Oil spills: Court awards N82bn damages against Mobil, NNPC",
    "summarized_story": "A federal high court in Abuja has ordered Mobil Producing Nigeria Unlimited and the Nigerian National Petroleum Corporation (NNPC) to pay N81.9 billion as damages to communities in Ibeno LGA of Akwa Ibom state over oil spillage.\nAdvertisementThe court awarded the sum of N42.8 billion as damages for intangible losses, N21.9 billion for special damages as annotated and N10 billion as general damages.\nDelivering the judgment on Monday, Taiwo Taiwo, the judge said the companies must make payment to the communities within 14 days.\nThe judge held that the negligence of Mobil and NNPC caused environmental degradation in the communities.\nHowever, the judge held that the instant suit had to do with fundamental rights that cannot be rendered impotent by the statute of limitations."
  },
  {
    "headline": "15 teachers abducted in Niger school have escaped, says headmaster",
    "summarized_story": "Abubakar Alhassan, the headmaster of Salihu Tanko Islamic School in Niger state, says 15 of the teachers abducted from the school have escaped from captivity.\nMany students and teachers were abducted from the school located in Tegina town in Rafi LGA of the state on May 30.\nAdvertisementAlhassan said the escaped teachers were in a military facility in Birnin Gwari, Kaduna state, where they would be handed over to the Niger government.\nOn his part, the governor advised parents of the abducted students to exercise patience as the government was exploring all avenues to ensure their safe rescue.\nBello, while addressing a special squad of combined security personnel deployed to Rafi LGA, lamented the spate of kidnapping and insecurity in the state."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "3 Steps To Register Your Small Business With CAC Online • Techpoint Africa",
    "summarized_story": "This post is a delayed version of SME Clinic newsletter, a weekly newsletter that provides tips and recommendations to help you position your small business for success.\nDid you know that the Corporate Affairs Commission (CAC) has made it possible for you to register your company and business name online?\nSo let’s get into how to register your business name or company online.\nSo there you have it, online business name and company registration in just three steps.\nAdvertisementIf you want to learn how to reach more customers, grow, and manage your business online, SME Clinic is for you."
  },
  {
    "headline": "Google plans to support African founders and entrepreneurs with new $6m funding options",
    "summarized_story": "Google has announced opening up three new programmes targeted at supporting African entrepreneurs — the 6th cohort of Google for Startups Accelerator (GFSA) Africa, $3 million Black Founders Fund (BFF) Africa, and Google.org-backed $3 million grants for female entrepreneurs.\nNotably, the first virtual class of Google for Startups Accelerator Africa was launched last year due to the COVID-19 pandemic.\nAdvertisementBlack Founders Fund (BFF) AfricaSimultaneously, applications will be opened for the $3 million Black Founders Fund for African startups in their early stage.\nThe programme will have 50 African startups, led by Black founders, receive cheques between $50k and $100k.\nThis will also include seed capital in the form of cash grants and Google product support for 500 aspiring female entrepreneurs."
  },
  {
    "headline": "Nigeria’s intellectual property policy, sexual violence and tech, 5G deployment in Nigeria",
    "summarized_story": "Today, I’m discussing:A possible policy on intellectual property in NigeriaSexual violence and techThe latest news on 5G deployment in NigeriaNigeria’s intellectual property policyNigeria may get an intellectual property (IP) policy soon.\nThe COVID-19 pandemic, sexual violence, and techIn recent times, sexual violence cases seem to be on the rise.\nAccording to the United Nations, COVID-19-induced lockdowns exposed vulnerable people to more risk of sexual violence in 2020.\nAdvertisementOluwanifemi did a deep dive into the issue, highlighting the various ways tech and social media have helped combat sexual violence in Nigeria.\nRead: How tech tools create a safe space for sexual violence survivors in NigeriaMore on 5G deployment in NigeriaPhoto Credit: <a href=”https://www.flickr.com/photos/[email protected]/49713123696/”>Ivan Radic</a> Flickr via <a href=”http://compfight.com”>Compfight</a> <a href=”https://creativecommons.org/licenses/by/2.0/”>cc</a>It appears 5G deployment in Nigeria is gaining even more traction."
  },
  {
    "headline": "Lagos overtakes Nairobi as home to most start-ups",
    "summarized_story": "Lagos, Nigeria’s busiest city with a massive consumer market has overtaken Nairobi, Kenya’s capital as home and a top destination for the greatest number of start-ups in Africa.\nOver 500 active start-ups operate out of Lagos.\nThe large population of Lagos, Nigeria’s commercial hub is one of the reasons for the rise in start-ups in the city.\n“It is not surprising that Lagos is the top start-up hub in Africa,” Andrew S Nevin, Partner/Chief Economist, PwC, Nigeria said.\nIt is the highest-ranking country in Western Africa and the 3rd highest-ranking country in Africa,” research analysts at StartupBlink, said."
  },
  {
    "headline": "Demand for raw materials pushes Nigeria’s fertiliser imports up 547%",
    "summarized_story": "The rising demand for diammonium phosphate (DAP), muriate of potash (MOP), and granular ammonium sulphate by blenders caused a 547 percent surge in Nigeria’s global fertiliser imports in 2020.\nData from the International Trade Centre (ITC) show that the country’s imported $250.2 million (N118bn) worth of raw materials for various fertiliser blends in 2020 from…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Again, Emirates bans Nigeria flights, extends South Africa route suspension",
    "summarized_story": "Dubai’s Emirates airline said passenger flights to and from Nigeria (Lagos and Abuja) are suspended with effect from June 21 until further notice.\n“We regret the inconvenience caused, and affected customers should contact their booking agent or Emirates call centre for rebooking,” said the airline.\nDaily passenger flights to Johannesburg will operate as EK763, but outbound passenger services on EK 764 remain suspended.\nCustomers who have been to or connected through South Africa in the last 14 days will not be permitted on any Emirates flights bound for Dubai.\nThe airline had on Saturday announced that it would be resuming flight operations in Nigeria from June 23rd."
  },
  {
    "headline": "Court adjourns hearing on illegal acquisition of lands By Chinese companies until September 2021 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITTY- The hearing and resolution on the case of the 15 hectares of land own by a London-based business man, and illegally encroached and acquired by a Chinese company in Utesi Community in lkpoba Okha Local Government Area of Edo State has been fixed for September 21, 2021.\nIn her ruling, during the court proceedings, the presiding judge in Benin City high court, haven listened to the pleas of the counsel to the Chinese companies to give them time to explore avenues to settle with the claimant, Mr lbosa Osodin, adjourn hearing on the case, with suit number B/2452020, to 21st of September 2021.\nThe barrister, while frowning at the illegality perpetuated by the Chinese companies said, “We are not happy that our client, Mr Ibosa who is an investor will be treated in this manner” by foreigners whose companies have deliberately disregarded their corporate social responsibilities to the Utesi community by constant pollution and environmental degradation to the inhabitants of the community.\nBarrister Osula said further that, the case in point is a novel one, and certain that justice will not only be done, but will be seen to be done.\nHe said further that the Chinese companies cannot get away with their illegality, because “We are a firm believer of the legal philosophy that the court is the last hope of the common man”."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Match-fixing: Siasia gets FIFA life ban reduced to five years by CAS",
    "summarized_story": "ADVERTISEMENTA former Super Eagles player and coach, Samson Siasia, who was handed a life ban by the world football governing body FIFA over match-fixing allegations has had his punishment reduced to a five-year ban by the Court of Arbitration for Sports (CAS).\nNew punishmentOn this premise, the CAS Panel confirmed the Challenged Decision and reduced the punishment for the ex-Super Eagles star.\nHe was part of the team that participated in the 1994 FIFA World Cup and won the 1994 African Nations Cup.\nHe won the African Youth Championship and advanced all the way to the World Cup final – before losing to Argentina 2–1.\nSiasia also coached the Nigerian national team, the Super Eagles, between February and August 2016."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ebonyi Attacks: Police Parade Teenager, 60 Suspected IPOB Members",
    "summarized_story": "The Police Command in Ebonyi on Monday, paraded 60 suspects including a teenager over alleged attacks on its personnel and public facilities, among other offences.\nAdvertisementsThe Commissioner of Police in the state, Aliyu Garba, while parading the suspects, remarked that over 50 of them were directly involved in various attacks on police personnel, facilities and public infrastructure across the state.\nThe commissioner noted that one of the suspects Daniel Elom, 17, a self-confessed member of Eastern Security Network (ESN) specialised in mapping out strategies for attacks by the group.\nGarba also said that one Nathaniel Itumo was arrested for killing Idike Agwu, an Ebubeagu security outfit’s personnel on May 31 and had been charged to court for murder.\nElom on interrogation by newsmen, noted that in spite of being a teenager, he was promised a top position in the ESN group when it actualised its ambition."
  },
  {
    "headline": "Ebonyi Attacks: Police Parade Teenager, 60 Suspected IPOB Members",
    "summarized_story": "The Police Command in Ebonyi on Monday, paraded 60 suspects including a teenager over alleged attacks on its personnel and public facilities, among other offences.\nAdvertisementsThe Commissioner of Police in the state, Aliyu Garba, while parading the suspects, remarked that over 50 of them were directly involved in various attacks on police personnel, facilities and public infrastructure across the state.\nThe commissioner noted that one of the suspects Daniel Elom, 17, a self-confessed member of Eastern Security Network (ESN) specialised in mapping out strategies for attacks by the group.\nGarba also said that one Nathaniel Itumo was arrested for killing Idike Agwu, an Ebubeagu security outfit’s personnel on May 31 and had been charged to court for murder.\nElom on interrogation by newsmen, noted that in spite of being a teenager, he was promised a top position in the ESN group when it actualised its ambition."
  },
  {
    "headline": "Group Seeks More Budgetary Allocations For Niger Delta Ministry",
    "summarized_story": "A non-governmental organisation for peace advocacy, Youth for Peace & Development in Niger Delta (YPDND), has called for more budgetary allocations to the Ministry of Niger Delta Affairs in order for it to adequately execute its core mandate.\nYPDND also commended President Muhammadu Buhari for his support for peace in the Niger Delta zone through the interventionist activities and programmes like the Amnesty Programme, Niger Delta Development Commission (NDDC) and the Ministry of Niger Delta Affairs.\n“We commend Mr. President for his support for peace in the Niger Delta through the funding of activities and programmes like the Amnesty Programme, Niger Delta Development Commission (NDDC) and the Ministry of Niger Delta Affairs under the Minister, Senator Godswill Akpabio.\n“Also, we hereby a pass a vote of confidence on the Minister of Niger Delta Affairs, Senator Godswill Akpabio, for his proactive and innovative ways of running the Ministry, which have engender transparency, development, peace and a sense of belonging in the Niger Delta States.\nAdvertisements“Consequently, we call on President Muhammadu Buhari to increase the annual budgetary allocations to the Ministry of Niger Delta Affairs in order for it to deliver on its mandate fully,” the group said."
  },
  {
    "headline": "Group Seeks More Budgetary Allocations For Niger Delta Ministry",
    "summarized_story": "A non-governmental organisation for peace advocacy, Youth for Peace & Development in Niger Delta (YPDND), has called for more budgetary allocations to the Ministry of Niger Delta Affairs in order for it to adequately execute its core mandate.\nYPDND also commended President Muhammadu Buhari for his support for peace in the Niger Delta zone through the interventionist activities and programmes like the Amnesty Programme, Niger Delta Development Commission (NDDC) and the Ministry of Niger Delta Affairs.\n“We commend Mr. President for his support for peace in the Niger Delta through the funding of activities and programmes like the Amnesty Programme, Niger Delta Development Commission (NDDC) and the Ministry of Niger Delta Affairs under the Minister, Senator Godswill Akpabio.\n“Also, we hereby a pass a vote of confidence on the Minister of Niger Delta Affairs, Senator Godswill Akpabio, for his proactive and innovative ways of running the Ministry, which have engender transparency, development, peace and a sense of belonging in the Niger Delta States.\nAdvertisements“Consequently, we call on President Muhammadu Buhari to increase the annual budgetary allocations to the Ministry of Niger Delta Affairs in order for it to deliver on its mandate fully,” the group said."
  },
  {
    "headline": "Party Crisis: APGA Risks Disqualification From Anambra Gov’ship",
    "summarized_story": "The All Progressives Grand Alliance (APGA) may not be able take part in the forthcoming governorship election in Anambra State due to the internal crisis rocking the party .\nThe letter dated June 18, 2021 reads, “This is to inform you that the commission did not receive the statutory 21 days’ notice for the nomination of APGA Anambra State governorship candidate from Victor Oye led APGA.\n“Although the Oye faction had missed the issuance of statutory notice, all hope is not lost if the party backs the Okeke faction.\n“This is because the Okeke faction has served all valid notices for the APGA primary in Anambra.\n“It is important to join hands with the factiom now if the party must take part in the election.”"
  },
  {
    "headline": "NIMET: Training of aeronautical observers, forecasters begins in Katsina",
    "summarized_story": "The Nigerian Meteorological Agency (NiMet) has begun training 70 aeronautical and meteorological forecasters and observers in order to ensure aircraft safety.\nAs you may be aware, aviation is all about safety, safety, and more safety.\nOne of the most important aspects of this safety of lives and property is meteorological services.\n“Aside from training, they are subjected to competency evaluations on a regular basis, all in an effort to guarantee that aviation safety is not jeopardized in any way.\nWe’re here for the 9th Edition of the Aeronautical Meteorological Forecasters and Observers Refresher Course.”He then expressed gratitude to the Katsina State Government for collaborating with the agency to ensure the exercise’s success in the state."
  },
  {
    "headline": "BUSTED: Buhari’s N28 billion for distressed missions was mismanaged by the Foreign Affairs Ministry",
    "summarized_story": "According to SaharaReporters, the Ministry of Foreign Affairs wasted $68 million (about N28 billion) released by President Muhammadu Buhari’s administration in 2018 for payout to some of the country’s foreign missions.\nAccording to the Auditor-report, General’s when questions about how $68 million was disbursed were forwarded to the ministry, no responses were received.\n“Issue 1 – Lack of Accountability in the Disbursement of Intervention Fund for Distressed Missions – $68,875,902,” according to the study.\n“The issue was communicated to the Permanent Secretary via Management Letter Ref No.\n“The Permanent Secretary must answer in detail for how the sum of USD68,875,902.00 was distributed to the beneficiary missions, failing which consequences would be imposed.”"
  },
  {
    "headline": "BREAKING: T.B Joshua’s Successor Revealed By SCOAN Elders",
    "summarized_story": "Following the demise of the founder of the Synagogue Church of All Nations, SCOAN, TB Joshua, the elders in council of the church have decided to select a successor.\nDaily times gathered that SCOAN elders who had a crucial meeting stated that the church had no secession plan but someone has to carry the mantle of leading the church.\nSo much spiritual and financial efforts went into building SCOAN and it cannot just waste away,’’ a top aide said.\nEvelyn, the wife of late TB Joshua, and also a senior pastor in SCOAN, confirmed the funeral arrangements when she received Lagos state governor Babajide Sanwo-Olu.\nHowever, it is reported that the pastor’s family and church elders intervened and decided the pastor will be buried in Lagos on July 11."
  },
  {
    "headline": "$430m Enugu-Cameroon highway project to be completed this year – AfDB",
    "summarized_story": "The African Development Bank (AfDB) says the 430 million dollars highway project linking Enugu to Bamenda in Cameroon will be completed this year.\nAccording to Adesina, the 430 million dollars highway project will transform trade opportunities between the two countries.\nAccording to him, the bank’s support for infrastructure in the ECOWAS region has doubled over the past five years, increasing from two billion dollars in 2015 to four billion dollars.\n“Our 650 million dollars financing for the transport corridors linking Sierra Leone, Guinea and Liberia will impact on economic opportunities for 51 million people.\n“I am pleased that this year, the bank will provide 105 million dollars financing for the road linking Guinea-Bissau and Senegal,’’ he said."
  },
  {
    "headline": "JAMB delists 25 CBT centres for not conducting exam",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has delisted 25 Computer-Based Testing (CBT) Centres that failed to conduct examinations on Saturday – the first day of the 2021 Unified Tertiary Matriculation Examination (UTME).\nSix of those centres were canceled in Lagos – the highest in the country.\nA statement by JAMB’s head of media, Dr. Fabian Benjamin directed the candidates scheduled to write their examination in the affected centres to check for new instructions on their new centres and dates on their profile, phones or emails.\nThe statement reads: “The following centres who failed during the conduct of the 2021 UTME on Saturday, June 19, 2021, are hereby delisted.\nCandidates posted to any of these centres are required to await further directives by checking their profile, email addresses and SMS on their registered phone for a new date.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "JAMB delists 25 CBT centres for not conducting exam",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has delisted 25 Computer-Based Testing (CBT) Centres that failed to conduct examinations on Saturday – the first day of the 2021 Unified Tertiary Matriculation Examination (UTME).\nSix of those centres were canceled in Lagos – the highest in the country.\nA statement by JAMB’s head of media, Dr. Fabian Benjamin directed the candidates scheduled to write their examination in the affected centres to check for new instructions on their new centres and dates on their profile, phones or emails.\nThe statement reads: “The following centres who failed during the conduct of the 2021 UTME on Saturday, June 19, 2021, are hereby delisted.\nCandidates posted to any of these centres are required to await further directives by checking their profile, email addresses and SMS on their registered phone for a new date.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ohanaeze warns: Jihad won’t work in South- East",
    "summarized_story": "It said that such an attempt would be resisted with everything available to Ndigbo.\nThe National Publicity Secretary of Ohanaeze Ndigbo, Chief Alex Ogbonnia, who stated this in an exclusive interview with The PUNCH, noted that what had succeeded 200 years ago in form of a jihad would no longer succeed now.\nOgbonnia cautioned that if that was the reason the regime of the President, Major General Muhammadu Buhari (retd.\nThe kind of operation that succeeded 200 years ago cannot succeed now.\nEven if they’re contemplating jihadism, it cannot walk.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ohanaeze warns: Jihad won’t work in South- East",
    "summarized_story": "It said that such an attempt would be resisted with everything available to Ndigbo.\nThe National Publicity Secretary of Ohanaeze Ndigbo, Chief Alex Ogbonnia, who stated this in an exclusive interview with The PUNCH, noted that what had succeeded 200 years ago in form of a jihad would no longer succeed now.\nOgbonnia cautioned that if that was the reason the regime of the President, Major General Muhammadu Buhari (retd.\nThe kind of operation that succeeded 200 years ago cannot succeed now.\nEven if they’re contemplating jihadism, it cannot walk.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Soludo in trouble as APGA factions invite INEC’s Zamfara pill",
    "summarized_story": "By AbankulaThe Anambra governorship ambition of Chukwuma Soludo, the former CBN governor, has run into troubled waters.\nThe deepening schism in his All Progressives Grand Alliance (APGA) may make INEC apply the Zamfara treatment, reports indicated.\nIn Zamfara, the All Progressives Congress, in the run-up to the 2019 elections, broke into factions and failed to hold legal primaries for all elective posts.\nThe Publicity Secretary of the Okeke-led faction of the party, Ikechukwu Chukwunyere, gave reasons the disqualification may happen.\nProfessor Chukwuma Soludo, is a frontrunner to clinch the governorship ticket of APGA."
  },
  {
    "headline": "Buhari sends special message to Iranian President, Raisi",
    "summarized_story": "By Nimot SulaimonPresident Muhammadu Buhari on Monday sent greetings to the newly elected President of Iran, Ebrahim Raisi.\nIn a reaction to the outcome of the election in Abuja, President Buhari said that “Raisi deserves his victory in the presidential election.”According to Buhari, the election of Iran’s new president Ebrahim Raisi “once again reinforces the centrality of the will of the people to the success of democracy anywhere in the world.”The Nigerian leader explained that “democracy allows voters to change or re-elect their representatives by peaceful means.”He described Raisi as “a consummate politician with experience to lead his country to greater heights and a better future.”Buhari urged Iranians “to brush political differences aside and support Raisi to succeed in efforts to help the country overcome its challenges, including the impact of COVID-19 pandemic and the crippling sanctions imposed on the country.”While congratulating Raisi on his victory, President Buhari advised the President-elect “to unite the country for the sake of protecting the common interests of Iranians that transcend party lines.”“May God guides and grant you wisdom in the discharge of the heavy responsibility your election entails,” President Buhari added."
  },
  {
    "headline": "What will make Nigeria’s economy collapse totally – Oyedepo",
    "summarized_story": "By Kazeem UgbodagaPresiding Bishop, Living Faith Church Worldwide, David Oyedepo has said Nigeria’s economy will collapse if the investments of God’s people are removed.\nYou could have a Church building going on for 20 years.\n“Let me say this and I am saying this very boldly: The only thing remaining in Nigeria today are the investments of God’s people.\nHe said if he got N100 billion today, he would not have any problem where to invest the money.\n“He knows that if He gives that man 2 Billion today, that is all: he will marry another wife very fast."
  },
  {
    "headline": "BREAKING: Lagos Assembly Amends Electoral Commission Law",
    "summarized_story": "On Monday, the Lagos House of Assembly examined and revised a section of the state’s Independent Electoral Commission statute (LASIEC).\nThe newly inserted subsection 5 empowers the Governor of the State to prolong the commission’s term due to exigencies.\nAccording to Akande, the goal is to fill the gap that may arise between the expiration of the commission’s term and the Governor’s appointment of new members.\nA legal extension of the commission’s members, according to Obasa, would let them effectively conclude the elections with the backing of the law.\nHe claimed that an additional six months, as indicated by the law, was excessively long given that the term is only intended to perfect new appointments."
  },
  {
    "headline": "“I’ll Bring You To Book” – Buhari Warns Terrorists, Secessionists",
    "summarized_story": "…Don’t allow treacherous elements buy you over, APC charges youthsAgainst the growing wave of insecurity caused by organized criminal gangs in the country, President Muhammadu Buhari has read the Riot Act to perpetrators, promising to arrest and bring them to book.\nHe also said he will not rest until the country is rid of those he referred to as “divisive elements”.\n“On a final note, I implore you all to never despair, nor relent in our joint task of nation building.\nAccording to him, while smokes from industrial hubs billow into the skies of developed countries, Nigeria’s smokes are those generated from local peppersoup joints producing Nigeria’s spicy goat head broth, ‘Isiewu’.\nIsmaeel Ahmed, said the conference was organized based on the need to prepare the youths for more responsibilities."
  },
  {
    "headline": "BREAKING: Again, UAE Suspends Nigerian Flights Indefinitely 48 Hours After Lifting Ban",
    "summarized_story": "Flights from Nigeria to Dubai have been suspended indefinitely by the United Arab Emirates (UAE).\nThis comes just 48 hours after the UAE announced that the travel ban between Dubai and Nigeria has been lifted.\nDue to a violation of Covid-19 regulations, Dubai has issued a restriction on tourists from Nigeria and South Africa.\n“In line with government directives, passenger flights to and from Nigeria (Lagos and Abuja) are suspended with effect from 21 June 2021 until further notice.\n“Emirates remains committed to Nigeria, and we look forward to resuming passenger services when conditions allow,” the statement said."
  },
  {
    "headline": "NGOs, Four Journalists Sue Nigeria Govt At ECOWAS Court For Twitter Ban",
    "summarized_story": "Five non-governmental organizations and four journalists have filed a complaint with the ECOWAS Community Court of Justice in Abuja, requesting that the government declare the indefinite suspension of Twitter in Nigeria a violation of their human rights under international law, order the government to immediately rescind the suspension order, and compensate them for the violation of their rights.\nThe suit, lodged with number ECW/CCJ/APP/29/21 ECW/CCJ/APP/29/21, in a 73-page documentation, was filed on their behalf by Abuja-based human rights and free expression lawyer, Mojirayo Nkanga, under the African Charter on Human and Peoples’ Rights (ACHPR), the International Covenant on Civil and Political Rights (ICCPR), the Revised ECOWAS Treaty, and the Nigerian Constitution, among others.\nThey are claiming that Nigeria’s ongoing suspension of Twitter, which came into effect on or around June 4, 2021, violated their right to freedom of expression and interfered with the ability of the journalists to do their work.\nThe NGOs and journalists are also alleging that the general situation in Nigeria with respect to human rights, has created an environment where freedom of expression is stifled, which has contributed to creating a chilling effect on press and media freedom and which the ongoing suspension of Twitter is a continuation of.\nThey are also seeking a declaration that the government’s directive, through the National Broadcasting Commission (NBC), for the deactivation of Twitter accounts in Nigeria violates their human rights under international law and that the threat by the Attorney-General of the Federation to criminally prosecute anybody found to be using Twitter in Nigeria following the suspension of the platform also violates their human rights under international law."
  },
  {
    "headline": "Breaking: CAS reduces Siasia’s life ban",
    "summarized_story": "The Court of Arbitration for Sport (CAS) on Monday announced that it has reduced the life ban imposed on former Head Coach of Nigeria’s Super Eagles, Samson Siasia to five years.\nWorld football governing body, FIFA, had slammed Siasia with life ban over alleged match fixing scandal.\n“In 2010, a match fixer tried to involve Mr Siasia as a coach of a club under his strict instructions.\nWith the promise of employment benefits, Mr Siasia would have had to always field several players under the control of the match fixer.\n“The imposed fine of CHF 50,000 (fifty thousand Swiss Francs) on Mr Siasia is set aside."
  },
  {
    "headline": "Pictures: Flood takes over Ijebu Ode in Ogun",
    "summarized_story": "PreviousAPC needs Al-Makura to win in 2023"
  },
  {
    "headline": "VIDEO: Elizabeth Anyanacho gets gold, reacts thereafter at Beirut Open",
    "summarized_story": ""
  },
  {
    "headline": "FG to establish new Universities of Technology, upgrades existing ones -NigPilot",
    "summarized_story": "To stimulate rapid technological transformation of the country, the Federal Government has resolved to establish two additional Universities of Technology in Jigawa and Akwa Ibom States.\nAdamu said that the federal government would upgrade the four existing Universities of Technology located in Yola (North East), Akure (South West), Owerri (South East) and Minna (North Central).\nSonny Echono, the Minister revealed that plans are underway to establish a National Institute of Technology,NIT, in Abuja.\nAccordingly the 2nos new Universities of Technology will be established in 2021 while the upgrade of the existing 4nos Universities of Technology and the National Institute of Technology will come on stream next year.\nAdamu said president Buhari has approved a take-off grant of N4 Billion each for the Universities of Technology and N5Billion each for the Universities of Health Science from the funding Resources of Tetfund for early take-off."
  },
  {
    "headline": "Agba felicitates Ize-Iyamu on 59th birthday -NigPilot",
    "summarized_story": "Agba’s felicitations were contained in a personal letter to Ize-Iyamu, dated June 21, 2021, entitled “Birthday wishes to an exemplary leader”.\nThe minister said “there is no better time to appreciate and congratulate you than on the occasion of your very special birthday celebration, which also coincides with that of your priceless jewel, Prof. Mrs Idia Ize-Iyamu , an accomplished academic and humanitarian advocate.”He added that “As politician, I can say without equivocation that you have exhibited uncommon wisdom, remarkable vision, and exemplary leadership in the pursuit of your political goals.\n“I wish you and your heart-throb peace, good health, and happiness to stay with us and continue to contribute to building a legacy of focused and visionary leadership.\n“Once, again, I wish you and your very significant better half a wonderful anniversary.”"
  },
  {
    "headline": "Defend yourselves against bandits – Katsina Gov instructs residents -NigPilot",
    "summarized_story": "Governor Masari sounded that enough of residents running away from kidnappers, saying same banditry causing unrest in the State were created by them hence, they must stand firmly and fight to win over together.\nThe Governor urged COREN and other professional bodies to look inward toward checkmating standard professionalism.\nEarlier, COREN President, Egnr Ali RAbi’u said the Katsina office of COREN would in no small measures absorbing young professionals and build the professional standard among them.\nHe appreciated Katsina State government for providing edifice to operate and thanked Governor Aminu Bello Masari for supporting them in all areas of need.\n“Change the face of engineering practice in Katsina and in the country in general.”"
  },
  {
    "headline": "CVR: Success of exercise lies on citizens’ awareness – INEC Chairman -NigPilot",
    "summarized_story": "Independent National Electoral Commission, INEC, has stated that the success of the Continous Voter Registration, CVR exercise, slated to kick-start on Monday 28th June, lies largely with citizen’s awareness.\nChairman of the Commission, Prof. Mahmood Yakubu, made this known today, during the second quarterly meeting with media organisations at the INEC’s headquarters in Abuja.\n“We intend to undertake the CVR exercise over a period of at least one year.\nThe success of the exercise depends to a considerable extent on citizens’ awareness through voter education.\nFurthermore, with the relocation of voting points to underserved areas as autonomous polling units, there is need for massive publicity so that citizens are familiar with their voting locations well ahead of all forthcoming elections."
  },
  {
    "headline": "Five Killed, Four Injured As Police Inspector Opens Fire On Youths In Enugu",
    "summarized_story": "Five persons have been killed and four others injured after a Police Inspector went into a shooting frenzy in Enugu State on Sunday.\nThe police officer who reportedly attacked a neighborhood in Golf Estate, GRA, Enugu, is said to be attached to a lottery company within the area.\nConfirming the incident in a statement, the state police command said it was unclear what led to the sporadic shooting.\nHe further disclosed that the four others who sustained injuries are currently receiving treatment at the Enugu State University Teaching Hospital.\nThe police commissioner while sympathising with the family and friends of the deceased persons, urged them to remain calm while the police conclude their investigation."
  },
  {
    "headline": "NDLEA Chairman Opposes Legalisation Of Cannabis In Nigeria",
    "summarized_story": "Chairman of the National Drug Law Enforcement Agency (NDLEA), Buba Marwa has opposed demands for the legalisation of cannabis in Nigeria.\nMarwa said the nation cannot afford to mortgage the lives of the citizens for financial gains by legalising cannabis.\nHe said this on Monday, in response to earlier calls by Ondo State governor, Rotimi Akeredolu for the legalisation of cultivation of Cannabis Sativa in the country.\nThe NDLEA Chairman also reiterated his suggestion to have politicians subjected to drug testing before they are allowed to contest for elective positions.\nOndo State Governor Rotimi Akeredolu has constantly supported calls for legalisation of Cannabis Sativa urging the Federal Government to jettison traditional orientation and “archaic” sentiment that states that cannabis is a ‘devil’s plant’."
  },
  {
    "headline": "Oil Spillage: Court Awards N82bn Damages Against NNPC",
    "summarized_story": "The Federal High Court in Abuja has awarded the sum of N82 billion as general damages against the Nigerian National Petroleum Corporation (NNPC) and Mobil Producing Nigeria Unlimited over oil spillage, in Ibeno Community within Ibeno LGA, Akwa Ibom State.\nDelivering judgment, Justice Taiwo Taiwo, ordered the oil corporations, to pay the sum in 14 days, or pay eight percent of the sum, per annum.\nREAD ALSO: NDLEA Chairman Opposes Legalisation Of Cannabis In NigeriaJustice Taiwo had earlier struck out ExxonMobil from the list of defendants, on account of being an American registered company, leaving the NNPC and Mobil producing Nigeria Unlimited.\nThe court held that the oral and documentary evidence produced by Mobil, was not helpful in their case, describing them as serving pre-determined assets.\nAccording to Justice Taiwo, the action of Mobil is a clear violation of section 11 of the oil pipeline act that makes it mandatory for the oil companies to monitor and fix defective pipelines."
  },
  {
    "headline": "Troops Kill Over 20 Boko Haram/ISWAP Terrorists In Lambom Forest",
    "summarized_story": "Nigerian Army troops of Sector 2 Joint Task Force North East Operation HADIN KAI in conjunction with the Air Task Force on Sunday 20 June 2021 inflicted heavy casualty on Boko Haram and Islamic State West Africa Province (ISWAP) Terrorist groups who were camping around Wartek in the general area of Lambom Forest.\nActing on credible intelligence, the troops with close air support from the Nigerian Air Task Force component swiftly carried out a simultaneous land and air offensive, penetrating deep into Lambom forest in Borno state.\nGeneral Nwachukwu disclosed that the Chief of Army Staff (COAS) Major General Faruk Yahaya has congratulated the troops for the successful conduct of the operation.\nThe COAS enjoined the troops to sustain the ongoing offensive under Operation HADIN KAI, until the insurgents are completely surmounted.\nDuring his visit to the hospitals, he assured troops of adequate medicare and support in the ongoing counter-insurgency operations."
  },
  {
    "headline": "NGOs, Journalists Challenge FG’s Twitter Ban At ECOWAS Court",
    "summarized_story": "Five non-governmental organisations and four journalists have filed a suit against the Federal Government at the ECOWAS Community Court of Justice in Abuja.\nIn the suit filed on Monday, they asked the court to declare the indefinite suspension of Twitter in Nigeria a violation of their human rights under international law.\nThey also want the court to order the government to immediately rescind the suspension order and compensate them for the violation of their rights.\nThe applicants claimed that Nigeria’s ongoing suspension of Twitter, which came into effect on or around June 4, violated their right to freedom of expression and interfered with the ability of the journalists to do their work.\nNo date has been fixed for the hearing of the suit."
  },
  {
    "headline": "Appeal Court: Ondo PDP members protest failure to assess Certified True Copy of Judgment",
    "summarized_story": "Members of Ondo State People’s Democratic Party (PDP) have marched to the Appeal Court complex in Akure to demand the Certified True Copy of the Appeal Court judgment.\nThe court of Appeal sitting in Akure had last Wednesday dismissed the petition filed by the PDP candidate, Eyitayo Jegede.\nThe PDP members led by the Party chairman, Fatai Adam in their numbers, moved from the party Secretariat to the court of Appeal.\nThis action is coming two days after a statement released by the party publicity secretary, Kennedy Peretei .\nThe PDP spokesman noted that the delay in accessing the Certified True Copy of the judgement is a deliberate move to delay the party from reviewing and advancing their legal pursuit to the Supreme Court."
  },
  {
    "headline": "Former Governor, Orji Kalu’s firm seeks to stop retrial in N7.1 B alleged fraud",
    "summarized_story": "Slok Nigeria Limited, the family company of former Abia state governor, Orji Uzor Kalu has been granted permission to challenge validity of the 32-count money laundering charges against it.\nThe federal government through the Economic and Financial Crimes Commission (EFCC) had filed a money laundering case involving Oriji Kalu , Sloks Limited and and former Finance Director in the state, Ude Jones Udeogu.\nThe trio were ordered to be put on fresh trial by Supreme Court following their indictment in the alleged N7.1B fraud.\nJustice Inyang Ekwo granted the permission while ruling on an ex-parte motionJustice Ekwo ordered the company to, within seven days, serve the respondents in the case and adjourned till July 13 for hearing."
  },
  {
    "headline": "Court orders FG to pay $951M to Bayelsa",
    "summarized_story": "Justice Inyang Eden Ekwo of the Federal High Court , Abuja has ordered the federal government to pay the sum of $951M dollars to Bayelsa State being the 13 per cent derivative sum due as arrears of revenue and payable to the state government.\nBayelsa State had through its counsel, Ken Njemanze dragged the federal government before the court praying it to compel the Attorney General of the Federation, who was the sole defendant in the matter to pay 5% of $50 billion recovered as additional revenue that accrued to the Nigerian government.\nThe Judge held that the Attorney General of the Federation, failed to enter his defence in the suit, prompting the court to declare the Bayelsa’s case “unchanged.”The Judge said where a person issues a letter of demand on another person upon outstanding facts, the person for whom the demand notice was issued must take steps to react to same."
  },
  {
    "headline": "Africa no Longer on Back Foot in Covid-19 Fight: AfDB",
    "summarized_story": "The African Development Bank (AfDB) says countries in the African continent are no longer on the back foot in the fight against Covid-19.\nWhen COVID-19 cases were first detected in Africa last year, only two countries – South Africa and Senegal, at the time were able to test the novel coronavirus.\nAccording to the African Development Bank, the daily testing capacity of African countries rose from 13 200 at the beginning of the pandemic to 105 000 today.\n“This means that African countries are no longer on the back foot and are recovering gradually,” says the bank.\nHowever, this was a challenge in Africa as many countries did not have the adequate testing facilities."
  },
  {
    "headline": "Zambia Fixes July 7 For Burial of Founding President Kenneth Kaunda",
    "summarized_story": "Authorities in Zambia has announced July 7 for the funeral service and burial of founding President Kenneth Kaunda.\nThe 97-year-old died from pneumonia last week in a hospital in the Zambian capital Lusaka.\nAn official state funeral will be held on 2 July at the Heroes Stadium in Lusaka.\nKaunda led Zambia into independence from Britain, ruling the country from 1964 until 1991.\nWhen the African National Congress was banned by the apartheid government, Kaunda allowed the party to have its headquarters in the Zambian capital Lusaka."
  },
  {
    "headline": "Disappointment For South Africans as Kwazulu-Natal ‘Diamonds’ Turn Out to Be Quartz",
    "summarized_story": "It’s been nothing but deception for South Africans who rushed KwaHlathi.\nAfter hearing a local herder had unearthed some mysterious stones in this small town of the Kwazulu-Natal province, thousands armed with pickaxes, shovels and sticks headed to the surroundings of the village in search of diamonds.\nBut preliminary analysis of these said diamond shows the stones are in fact Quartz, far more common and far less valuable.\nResults that crushed any dreams and possibilities of wealth for all these amateur miners.\nThe South African government added the zone is not known to have any diamonds, and that those who poured to the small Kwazulu-Natal village should vacate the area, as it could carry risks such as environmental damage and exposure to Covid 19."
  },
  {
    "headline": "UN Expresses Concerns Over Ethiopia Ethnic Tensions Amid Elections",
    "summarized_story": "Rising ethnic tensions in Ethiopia has been highlighted as a major setback as voting continues in the country’s regional and parliamentary elections.\nUN’s human rights chief, Michelle Bachelet said that nearly a fifth of the constituencies are not taking part in the poll because of insecurity and irregularities.\nThey include the whole of the Tigray region, where civil war broke out in November.\nOpening the 47th session of the Human Rights Council in Geneva, Ms Bachelet said the volatile situation needed to be addressed and called for a political dialogue.\n“In many other parts of Ethiopia alarming incidents of deadly ethnic and inter-communal violence and displacement are linked to increasing polarisation about longstanding grievances,” she said."
  },
  {
    "headline": "In Surprising Volte-face, Emirates Extends Suspension of All Nigerian Flights Indefinitely",
    "summarized_story": "Emirates Airlines on Monday announced the suspension of all flights to and from Nigeria, barely 48 hours after announcing that flights will resume on Wednesday, June 23.\nOn Saturday Emirates had announced a planned resumption of flights, five months after it banned outbound flights from Abuja and Lagos.\nThis followed the withdrawal of the Rapid Antigen Test the United Arab Emirates (UAE) had insisted passengers from Nigeria travelling to Dubai must take four hours before boarding their flights.\nThe UAE antigen test requirement was against Nigeria’s policy that passengers travelling out of the country should conduct Polymerase Chain Reaction (PCR) test 72 hours before their flight.\n“We regret the inconvenience caused, and affected customers should contact their booking agent or Emirates call centre for rebooking."
  }
]