[
  {
    "headline": "APC convention under threat, aggrieved party members cite ruling against Buni",
    "summarized_story": "In Ekiti and Delta states, APC chieftains boycotted congresses supervised by the teams sent by the national interim committee.\nCommenting on the development, aggrieved APC members in Ekiti State said that the legal action that they instituted against conduct of the July 31 ward congresses was suffice for the local government and state congresses as something could not stand on nothing.\nWhat would bring about state congress would be from ward congress to local government congress and then state congress, nothing was done in the ward, nothing was done in the local, so where did they derive the state?\n“That is why we are in court, we went to court to say no ward congress was held.\n“The aggrieved party members had already gone to court on the ward congress issue and joined Mai Buni alongside."
  },
  {
    "headline": "EFCC re-arraigns Nolan, two others over $9.6bn P&ID scam",
    "summarized_story": "The Economic and Financial Crimes Commission, on Monday, re-arraigned two British nationals, James Richard Nolan and Adam Quinn (at large), before Justice D.U.\nOkorowo of the Federal High Court, Abuja for their alleged complicity in the controversial Process and Industrial Development gas processing contract, leading to the $9.6bn arbitral award to P&ID Limited by a United Kingdom commercial court.\n1 of 2012).”A statement by the EFCC spokesman, Wilson Uwujaren, said Nolan pleaded not guilty to the charges while Quinn, who is at large, was not available to take his plea.\nBut prosecuting counsel, Ekele Iheanacho requested that his plea be recorded as guilty, which the judge granted.\nIn view of Nolan’s not guilty plea, Iheanacho asked the court for a trial date."
  },
  {
    "headline": "Human Trafficking: NAPTIP commends EU for support",
    "summarized_story": "The National Agency for the Prohibition of Trafficking in Persons (NAPTIP), on Monday, in Abuja, commended the European Union for its support in the fight against human trafficking.\nFIIAPP is a Spanish public agency implementing a project in Nigeria tagged “Action Against Trafficking in Persons and Smuggling of Migrants (A-TIPSOM)”, aimed at eliminating human trafficking and smuggling of migrants.\nWaziri-Azi said that the support NAPTIP had received from the EU over the years had assisted the agency to achieve significant milestones in the fight against human trafficking.\n“Human trafficking is not only a problem, it is a crises.\nHe said that FIIAPP would continue to support the fight against human trafficking in Nigeria."
  },
  {
    "headline": "Anambra poll: Court fixes Dec. 20 for judgment in Moghalu’s suit against APC, Andy Uba",
    "summarized_story": "A Federal High Court, Abuja on Monday fixed Dec. 20 for judgment in a suit filed by an aspirant in the Nov. 6 Anambra governorship, George Moghalu, against the All Progressives Congress (APC) and its candidate, Andy Uba.\nJustice Inyang Ekwo fixed the date after taking the arguments of counsel to the parties in the suit.\nHe, however, said if the judgment was ready before Nov. 6, he would not hesitate to deliver it.\nThe Independent National Electoral Commission (INEC) had picked Andy Uba, winner of the APC primary election, as the party’s candidate.\nHe said the APC had chosen to adopt direct primary, which is why the party published the list of designated venues for the exercise."
  },
  {
    "headline": "Ogunsan eulogises former head of state, Gowon, at 87",
    "summarized_story": "Gowon and ogunsanThe Chairman of Executive Group and Board Member, Lagos State Security Trust Fund (LSSTF), Ayo Ogunsan has felicitated with the for former Head of State, General Yakubu Gowon (Rtd) who clocks 87 today , describing him as a true nationalist par excellence.\nIn a congratulatory message signed by Ogunsan and made available to newsmen, Ogunsan said: “Today, I salute a colossus, a generalissimo and a true nationalist, General Yakubu Gowon, who clocks 87 in grand style.\nOne of such is the creation of 12 new states to replace the four regions in the country.\n“A devoted Christian not just in words but in deed, his nationalistic and spiritual impact cannot be over-emphasized.\n“Sir, your disposition on national unity has been unequivocal and unambiguous, as you have continued to foster ethic cohesion and regional integration."
  },
  {
    "headline": "Buhari salutes Bewaji Kuku at 75",
    "summarized_story": "President Muhammadu BuhariPresident Muhammadu Buhari has congratulated business woman and politician, Chief Bewaji Kuku, who attains the age of 75 years on Oct. 19, 2021.\nThe president, in a congratulatory message by his Senior Special Assistant on Media and Publicity, Malam Garba Shehu, on Monday in Abuja, joined members of All Progressives Congress (APC) in celebrating with Kuku, an APC party stalwart.\nKuku had served as member of Policy, Research and Strategy Directorate of the APC Presidential Council in 2015.\nPresident Buhari congratulated the party chieftain on her courage and foresight in setting up and managing businesses over many years.\nThe President prayed for good health and prosperity for Chief Kuku."
  },
  {
    "headline": "Anambra: Court reserves verdict on suit seeking to nullify APC primary election",
    "summarized_story": "By Ikechukwu NnochiriABUJA–The Federal High Court sitting in Abuja, on Monday, reserved its judgement on a suit seeking to nullify the governorship primary election the All Progressives Congress, APC, conducted in Anambra state.\nThe suit marked FHC/ABJ/CS/648/2021, was brought before the court by an aggrieved APC governorship aspirant in the state, Mr. George Moghalu.\nConsequently, he urged the court to nullify the APC primary election and order a fresh one.\nCited as 1st to 3rd Defendants in the matter are the APC, INEC and Uba.\nLikewise, Uba’s lawyer, Mr. Mahmud Magaji, SAN, argued that Moghalu, having admitted that he did not participate in the primary election, lacked the locus standi to challenge its outcome."
  },
  {
    "headline": "Nigeria is plagued by insurgency, kidnapping – Okowa calls for prayers",
    "summarized_story": "Governor Ifeanyi Okowa of Delta State has admonished Muslims in Nigeria to pray fervently for the unity of the country and rise against all forms of violence.\nThe governor made the remark in his goodwill message to Muslims in the country as they celebrate Eid el Maulud, which commemorates the birth of Prophet Mohammed (SAW).\nOkowa in a statement issued by his Chief Press Secretary, Mr Olisa Ifeajika in Asaba on Monday said that Nigeria is currently plagued by insurgency, banditry, kidnapping, armed robbery, herders-farmers clashes and agitations which had continued to impede the growth and development of the nation.\nThe Governor specifically urged the Muslims and other religious groups to intensify prayers for needed reforms for a better Nigeria.\n“On behalf of my family, the government and people of Delta, I extend our warmest wishes to Muslims celebrating Eid-el-Maulud in Delta, Nigeria and around the world."
  },
  {
    "headline": "Goronyo killings: No hiding place, be ready for destruction – Buhari sends strong warning to bandits",
    "summarized_story": "President Muhammadu Buhari has sent a tough warning to bandits, saying that “the clock of your ultimate destruction is ticking as you will no longer have a place to hide.”Buhari said this while reacting to the killing of over 30 people in Goronyo in Sokoto State on Sunday by bandits.\nThis was contained in a statement by Garba Shehu, the Senior Special Assistant to the President on Media and Publicity, on Monday.\nPresident Buhari said that “the days of the bandits are indeed numbered because the military capabilities of our forces are being boosted by the acquisition and deployment of advanced equipment.”According to him, “the bandits are living in the fool’s paradise of invincibility, but reality will soon dawn on them harder than ever before.”President Buhari added that “the bandits are currently under desperate pressure because of the intense and sustained air and ground operations against them in their hideouts by our security forces.\n“The cowardly attacks on innocent people by the bandits show a rearguard action of criminals under pressure.\nBut they will have no place to hide and our gallant security forces will not relent in the current offensive to defeat these callous enemies of humanity,” the President emphasized."
  },
  {
    "headline": "Buhari sympathises with US President, Biden over death of Colin Powell",
    "summarized_story": "President Muhammadu Buhari has sent his deepest condolences to President Joe Biden, the government and the people of the United States, on the passing of the former Secretary of State, General Colin Powell.\nThis was contained in a statement by Garba Shehu, Senior Special Assistant to the President Media and Publicity, on Monday.\nThe Nigerian leader recounted that as U.S Secretary of State, Powell played a very important role in advancing his country’s foreign policy and national defence interests.\nAccording to him, Powell was also a great advocate of the eradication of Polio and in addressing the deadly spread of HIV/AIDS pandemic in Africa.\nObasanjo shares discovery about late ex-US Secretary, Colin Powell"
  },
  {
    "headline": "Jigawa: Governor Badaru seeks assembly’s approval to access N18.7b loan",
    "summarized_story": "Governor Muhammad Badaru Abubakar of Jigawa State has written the state House of Assembly seeking for their approval to access N18.7 billion loan.\nThis was contained in a letter sent to the state assembly and read before the floor of the house by the majority leader of the house, Alhaji Habu Maigatari.\nHe said the governor said the internal loan will be used to cushion the effects of loan payment by the federal government.\nThe letter obtained by DAILY POST with the title “offer Bridging Finance to cushion the effect of loan payment by the federal government” was signed by the Acting Governor Alhaji Umar Namadi.\nThe House, however, unanimously approved the governor’s request to access the loan for the development of the state."
  },
  {
    "headline": "Benue: Gov Ortom to commission Gbajimba-Daudu road mid 2022",
    "summarized_story": "Governor Samuel Ortom of Benue State has expressed hope that the ongoing construction work on the Gbajimba-Daudu road will be completed by mid 2022.\nGovernor Ortom stated this Monday while inspecting construction work on the road shortly after the virtual commissioning of the model classroom blocks built at the Government Technical College, Gbajimba.\nGovernor Ortom, who also inspected the ongoing construction work on Gbajimba-Tse-Akaahena road which terminates at the boundary between Benue and Nasarawa, expressed satisfaction with the level of work done so far.\nHe stated that as the rains subsides, work on the road would hopefully be completed within a month and be ready for commissioning.\nThe governor explained that the two roads when completed, would make security surveillance easier and rapid response to distressed calls."
  },
  {
    "headline": "It’s mixed fortunes over rising crude price",
    "summarized_story": "- Advertisement -The decline in the headline inflation rate was meanwhile driven by 74 basis points decline in food inflation rate to 19.6 per cent.\nThe positive global outlook for crude oil reinforces Nigeria’s medium term expenditure and economic development plan.\nThe benchmark crude oil price for national planning is set conservatively at around at $57 per barrel, providing headroom for excess crude accounts.\n“Ironically, rising international oil prices will put more pressure on the country’s foreign exchange while the revenues from oil sales may be drained by the fuel subsidies.\nWhen will the domestic inflation rate finally reach an inflection point?"
  },
  {
    "headline": "WBG reviews $157b support to Nigeria, others",
    "summarized_story": "The World Bank Group (WBG) has assessed its $157 billion support given to Nigeria and other developing economies to fight COVID-19 pandemic.\nNigeria got $3.4 billion support from the bank in May to strengthen the economy and support recovery from the pandemic.\nWe’re providing financing for COVID-19 vaccines in 61 countries and currently have 250 million doses under contract with World Bank financing.\nWe’re pleased to partner with COVAX, AVAT, the African Union, and UNICEF on our shared priority to accelerate the purchase and deployment of vaccines in developing countries,” Malpass said.\nOn climate, Malpass said the bank outlined a powerful new path forward using the World Bank Group’s Climate Change Action Plan (CCAP) for 2021-2025."
  },
  {
    "headline": "Why more women are getting infected with HIV, by Olumofin",
    "summarized_story": "Why more women are getting infected with HIV, by OlumofinBlogger Joro Olumofin has adduced reasons for the rise in the number of women being infected with HIV.\nThe self-acclaimed “Love Doctor” argued a lot of women are contracting HIV because they are scared of asking their partners to use protection and wanting to keep their homes at all costs.\nAccording to Olumofin, a large majority of women who happen to be wives, seeking love daily have been infected with HIV by their husbands.\nJoro Olumofin wrote: “I deal with a lot of HIV+ people searching for love everyday.\n- Advertisement -“A lot of women are getting infected with HIV because of “FEAR TO SAY USE PROTECTION & “I MUST KEEP MY HOME SYNDROME“Wives/Ladies if you don’t trust your BF/HUSBANDS PLEASE DEMAND he uses protection."
  },
  {
    "headline": "Cooking gas: Consumers resort to firewood over rising cost",
    "summarized_story": "Some residents of the South East Zone of the country have vowed to resort to firewood and charcoal if prices of cooking gas continue to soar.\nSome consumers, who spoke to NAN separately, blamed the government for its inability to control the price of cooking gas in the open market.\n”I appeal to the government to reduce or have a fixed price for cooking gas to alleviate our sufferings,” Okongi said.\nIt is a similar situation in all the states in the zone as consumers groan over the rising cost of cooking gas.\nMrs Agnes Ebeke, a Customer described the rise in cooking gas and food prices as artificial inflation."
  },
  {
    "headline": "Buhari condoles with Biden, US over death of Colin Powell",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has on behalf of all Nigerians has condoled with President Joe Biden, the government and the people of the United States on the passing of former Secretary of State General Colin Powell.\nHe recounted that as U.S Secretary of State, Powell played a very important role in advancing his country’s foreign policy and national defence interests.\n‘He was also a great advocate of the eradication of Polio and in addressing the deadly spread of HIV/AIDS pandemic in Africa, President Buhari said.\nUSA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "APC congress widens cracks in state chapters",
    "summarized_story": "Harbor was returned as consensus chairman in the Chief Ikechi Emenike-led faction, while Chidi Abuaja emerged as state party secretary.\nHe wondered how some persons wanted to foist Agballah, who he claimed had not been publicly admitted into the party as its state chairman.\nIn Benue State, congress of the APC ended in the early hours of Sunday with the emergence of Austin Agada as chairman.\nHowever, some leaders from Benue South Senatorial District popularly known as Zone ‘C’ has rejected what they described as unfair and unjust accreditation of delegates by the state congress committee.\nIn Osun State, the committee for the state congress, however, said there was no parallel congress in Osogbo, except funeral or marriage ceremony."
  },
  {
    "headline": "Anxiety as cooking gas crisis worsens",
    "summarized_story": "By Adewale SanyaoluNigeria’s cooking gas crisis may take a turn for the worse in the days ahead despite latest statistics that Nigeria and the Africa continent, account for a paltry four per cent of global Liquefied Natural Gas (LPG) consumption in 2020.\nShonubi noted that Africa had become reliant on imports to meet its LPG demand as a result of low crude oil refining capacity and absence of adequate wet gas being processed.\n“Africa’s refining capacity of 3,343,000 barrels per day is limited to just 20 countries; utilisation rates have fallen from about 75 per cent in 2010 to 55 per cent in 2020.\nThe implication is that the importers will embed expenses incurred into the price it sells LPG to marketers at the depots and terminals.\nBut to reverse the lagging LPG consumption figure for Africa, Shonubi disclosed that Sahara Group, will invest over $1 billion to enhance access to LPG in Africa and emerging economies in a bid to boost energy transition on the continent."
  },
  {
    "headline": "SERAP sues Buhari over plan to monitor WhatsApp messages",
    "summarized_story": "The suit followed the proposal in the Supplementary Appropriation Act signed in July 2021 to spend N4.87 billion to monitor private calls and messages.\nThe suit filed on behalf of SERAP by its lawyers, Kolawole Oluwadare and Kehinde Oyewumi, read in part: “The plan to monitor WhatsApp messages, phone calls and text messages is an arbitrary interference by the administration into respect for family and private life, the home, and correspondence.\nThe Buhari administration has legal obligations to protect Nigerians and other people against arbitrary interference and violations of their human rights.\nMonitoring of WhatsApp messages, phone calls and text messages would grant free rein to government agencies to conduct mass surveillance of communications of people.\nThe lack of any safeguards against discriminatory decision-making, and access to an effective remedy shows the grave threats the purported plan poses to constitutionally and internationally recognised human rights."
  },
  {
    "headline": "PANDEF urges Dikio to sustain reforms in PAP",
    "summarized_story": "The former agitators said they were particularly interested in Dikio enforcing the Train, Employ and Mentor (TEM) model, which he designed to transform beneficiaries into entrepreneurs.\nNature Dumale, who led the delegation, said the re- appointment is good for the Federal Government and the Niger Delta region.\n“We commend Mr. President for giving you another chance to complete the TEM model that you set in motion in your first term to transform PAP delegates.\nDikio reiterated his commitment to make the Niger Delta the most attractive destination in the country and called for collective efforts to achieve that.\nWe will follow due process to ensure our delegates are equipped to contribute positively to the Niger Delta economy and ultimately, to the national economy,” Dikio said."
  },
  {
    "headline": "Colin Powell, Former US Secretary of State, Dies of Covid Complications",
    "summarized_story": "By Michael Olugbode in Abuja with Agency reportCOVID-19 took one of its greatest casualties with the death of former US Secretary of State Colin Powell who according to his family died aged 84 of the pandemic complications.\nPowell was a former top military officer who rose to become the first African-American secretary of state in 2001 under Republican George W Bush.\nA statement from the family said: “We have lost a remarkable and loving husband, father, grandfather and a great American.\nThe statement said that Powell had been fully vaccinated against COVID-19.\nIt’s painful now,” Mr Powell told ABC News in 2005."
  },
  {
    "headline": "WSJ: How Nigerian Military Bought Back Anti-aircraft Gun from Kidnapping Gang",
    "summarized_story": "The report alleged that kidnapping gangs that encamped in Nigeria’s Rugu forest had seized the anti-aircraft gun during a clash with a military unit.\nWSJ further alleged that over several months, the militant leader had agreed to part with the truck-mounted 12.7 millimetre anti-aircraft gun in exchange for the ransom.\nThe Nigerian Police last month said they arrested three suspects in the kidnapping of students from Bethel Baptist School in Kaduna State.\nThe Nigerian military opened a new offensive last month, bombarding forest encampments with airstrikes from US-delivered jet fighters.\nEventually, WSJ said, the bandits strapped the antiaircraft gun across two motorbikes and began to wheel it out of the camp."
  },
  {
    "headline": "US: Nigeria’s North-east Humanitarian Crises, One of World’s Most Challenging",
    "summarized_story": "*Pledges continuous support in fighting insecurityChiemelie EzeobiThe United States Government has described the humanitarian crisis in Nigeria’s North-east as one of the world’s most challenging and complex.\nU.S Consulate Public Affairs Officer, Stephen Ibelli, disclosed this at the Nigeria Info 99.3 FM “Security and Development Summit”, during a session on “US and Nigeria Security Assistance and Cooperation”.\n“As some of you may already know, the United States is the largest humanitarian donor in response to the North-east crisis, providing $1.45 billion since 2015 and supporting almost two million conflict-affected households.\nPAS Abuja also awards grants in support of Nigeria’s response to the on-going instability in the North-west and North-central regions.\n“Since 2017, Department of State and Department of Defense security assistance for Nigeria totals approximately $650 million."
  },
  {
    "headline": "PDP Mocks APC, Says Crisis-ridden Congresses Explain Why Nigeria is in Conflict",
    "summarized_story": "But the ruling APC has described the crisis-hit state congresses as successful and therefore congratulated its members for a good showing.\nThe party described the APC congresses as a harvest of confusion in which leaders of the party engaged in physical, verbal and emotional assault against another, while using their thugs to unleash mayhem on party members with charms and dangerous weapons.\nThe main opposition party said the APC could not guarantee or give unity, tranquility and progress to the nation.\n“Our party, the PDP is not however unaware of the efforts by the APC to inject crisis into our congresses but we commend the deft handling of issues in all our congresses to avert a crisis situation plotted by the APC.\n“The PDP remains the umbrella party that symbolises the yearning of Nigerians for unity, development, and security."
  },
  {
    "headline": "Despite Tightening Gas Supply, Rising Prices, FG Says LPG Market Growing",
    "summarized_story": "“It is worthy to note that the quantity of LPG sourced locally rose from 38,040.457mt in August to 49,453.081mt in September, while importation reduced from 47,224.346mt to 27,125.905mt.\nPPPRA stressed that policies and programmes such as the National Gas Policy (NGP), Nigeria Gas Flare Commercialisation Programme (NGFCP), National Gas Expansion Programme (NGEP) and the Decade of Gas declaration were responsible for the quantum of investments in the gas industry currently.\nIn the last one year, the price of Liquefied Petroleum Gas (LPG), otherwise known as cooking gas, has been on the rise and has more than doubled in several parts of the country, a situation largely blamed on the scarcity of the product.\nNigeria currently consumes about 1.2mmt of LPG, with the Nigeria LNG (NLNG) currently 450,000mt to the market, while marketers are left to import the remaining 750,000mt.\n“What we have done in recent years is to ensure that we take out all the opaqueness in NNPC."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Seven-Count Amended Charge Against IPOB Leader, Nnamdi Kanu",
    "summarized_story": "The Nigerian government has filed a seven-count amended charge against the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, three days to his appearance in court.\nNnamdi KanuThe IPOB leader will be re-arraigned before trial Justice Binta Nyako on Thursday.\nSaharaReporters had on October 15 reported that Ifeanyi Ejiofor, the lead counsel to Kanu, stated that he (Kanu) enjoined IPOB followers to proceed on a fast ahead of his trial on October 21.\nHence, no plausible excuse will be available to them not to produce Onyendu Mazi Nnamdi Kanu in court come Thursday, the 21st Day of October 2021.\n“Our Client - Onyendu Mazi Nnamdi Kanu urges millions of his followers and supporters to continue to conduct themselves and carry on within the ambit of the laws, as you all have always done."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Seven-Count Amended Charge Against IPOB Leader, Nnamdi Kanu",
    "summarized_story": "The Nigerian government has filed a seven-count amended charge against the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, three days to his appearance in court.\nNnamdi KanuThe IPOB leader will be re-arraigned before trial Justice Binta Nyako on Thursday.\nSaharaReporters had on October 15 reported that Ifeanyi Ejiofor, the lead counsel to Kanu, stated that he (Kanu) enjoined IPOB followers to proceed on a fast ahead of his trial on October 21.\nHence, no plausible excuse will be available to them not to produce Onyendu Mazi Nnamdi Kanu in court come Thursday, the 21st Day of October 2021.\n“Our Client - Onyendu Mazi Nnamdi Kanu urges millions of his followers and supporters to continue to conduct themselves and carry on within the ambit of the laws, as you all have always done."
  },
  {
    "headline": "Lagos Panel Ends Sitting Two Days To #EndSARS Memorial Protest",
    "summarized_story": "The Lagos State judicial panel probing cases of human rights abuses by officials of the Special Anti-Robbery Squad and other related matters in the state has ended its sitting.\nThe panel, which ought to have ended its sitting on Tuesday, October 19, 2021, had its final sitting on Monday due to the public holiday scheduled for tomorrow.\nIt was earlier reported that the panel awarded N148.2million as compensation to 23 more petitioners as it wound down proceedings after sitting for a year since the inauguration on October 19, 2020.\nDuring the Lekki shooting, Justice Doris Okuwobi (rtd) said though evidence had been concluded on the matter, the panel was yet to write out its final decision.\nShe assured the petitioners that the panel would ensure justice in the matter."
  },
  {
    "headline": "How cancer may have affected Colin Powell's chances against COVID",
    "summarized_story": "“He was fully vaccinated.\nAdvertisementHowever, in situations where death occurs after a person has been been fully vaccinated, medical experts attribute this to a “breakthrough infection”.\nPowell’s treatment for multiple myeloma may have affected how his body responded to the COVID vaccine — hence the breakthrough infection and his subsequent death.\nAdvertisement“Immunocompromised patients should contact their doctors and discuss getting a third dose of the coronavirus vaccine.\n“The basic coronavirus precautions are effective in lowering your chances of becoming infected with the coronavirus, even after you have been fully vaccinated.”"
  },
  {
    "headline": "How cancer may have affected Colin Powell's chances against COVID",
    "summarized_story": "“He was fully vaccinated.\nAdvertisementHowever, in situations where death occurs after a person has been been fully vaccinated, medical experts attribute this to a “breakthrough infection”.\nPowell’s treatment for multiple myeloma may have affected how his body responded to the COVID vaccine — hence the breakthrough infection and his subsequent death.\nAdvertisement“Immunocompromised patients should contact their doctors and discuss getting a third dose of the coronavirus vaccine.\n“The basic coronavirus precautions are effective in lowering your chances of becoming infected with the coronavirus, even after you have been fully vaccinated.”"
  },
  {
    "headline": "Sokoto killings: The clock of your ultimate destruction is ticking, Buhari tells bandits",
    "summarized_story": "President Muhammadu Buhari says bandits are currently on a “ticking clock”, as they will soon be “destroyed”.\nAdvertisementThe president said this in reaction to the killing of over 30 people in Goronyo LGA of Sokoto state.\nIn a statement on Monday, Garba Shehu, presidential spokesman, quoted Buhari as saying the gunmen will soon no longer have a place to hide.\nAdvertisement“The clock of your ultimate destruction is ticking, as you will no longer have a place to hide,” the commander-in-chief said.\n“The cowardly attacks on innocent people by the bandits show a rearguard action of criminals under pressure."
  },
  {
    "headline": "Sokoto killings: The clock of your ultimate destruction is ticking, Buhari tells bandits",
    "summarized_story": "President Muhammadu Buhari says bandits are currently on a “ticking clock”, as they will soon be “destroyed”.\nAdvertisementThe president said this in reaction to the killing of over 30 people in Goronyo LGA of Sokoto state.\nIn a statement on Monday, Garba Shehu, presidential spokesman, quoted Buhari as saying the gunmen will soon no longer have a place to hide.\nAdvertisement“The clock of your ultimate destruction is ticking, as you will no longer have a place to hide,” the commander-in-chief said.\n“The cowardly attacks on innocent people by the bandits show a rearguard action of criminals under pressure."
  },
  {
    "headline": "'N11bn is for administrative expenses' -- FIRS speaks on agency's 2022 budget proposal",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) says it did not earmark N17.8 billion for miscellaneous expenses in the 2022 budget proposal.\nIt also reported that the agency budgeted N262.5 million for security votes and N17.8 billion for “miscellaneous” expenses.\nWojuola said the agency earmarked N11.36 billion for key administrative expenses — and not N17.8 billion as reported.\nInstead, the draft budget estimate was submitted only to the House Committee on Finance.\nAdvertisement“The public is, therefore, to note that the amount budgeted for the above-listed items represents merely 5.26% of the total budget estimate for the year, 2022."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "Why Nigerian neobank, Sparkle, preferred local investors in $3.1m funding",
    "summarized_story": "Sparkle, a mobile-based digital bank that provides a combination of financial, lifestyle, and business support services to Nigerians, on Thursday, announced a $3.1 million seed fundraise from entirely Nigerian investors.\nThe latest funding brings Sparkle’s total investment secured to $5.1 million, having previously raised $2 million in pre-seed from friends and family.\n“They all understand the real need for a digital-first platform such as Sparkle.”Get the best African tech newsletters in your inboxIt’s not common in the Nigerian tech ecosystem that a funding round of such value comprises only local investors.\nAccording to Dozie, the Sparkle team was “very deliberate” about having an all-Nigerian round as it always felt that having a selection of strategic local investors would be beneficial to the startup’s growth.\nWe wanted to make sure our investors really understood the market before committing to this round,” he told TechCabal."
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "M-Pesa, Opay, Telebirr, Palmpay: How Chinese tech is powering African fintech",
    "summarized_story": "These Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\nNotably, Wapi Pay, a Singapore-based Kenyan fintech startup powering the Africa-Asia cross-border payment, uses Huawei’s mobile money services.\nAn indication that contemporary fintech startups are also relying on Chinese tech.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, I'm sure today's header might have warned you what to expect.\nBrace yourself for an exciting lineup of news..."
  },
  {
    "headline": "DAO: A blockchain innovation that promises businesses and governments where everyone’s the leader",
    "summarized_story": "Share this article:Cryptocurrencies popularised blockchain technology, but they are proving to be applicable in more ways than just fostering crypto transactions.\nOn June 12, 2021, we explored the possibility of conducting elections with blockchain technology to reduce costs and provide transparency, security, and fairness.\nOn September 11, 2021, the Blockchain Nigeria User Group (BNUG) unveiled bnugDAO, dubbed Africa’s first Decentralised Autonomous Organisation (DAO).\nWhile blockchain technology appears unhackable, the programmes and applications created on it are only as secure as the creator is intelligent.\nLike regular contracts where lawyers find loopholes that favour their clients, smart contracts have holes that hackers can exploit."
  },
  {
    "headline": "I wasn’t expecting this",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nThe startup aims to provide banking services to the unbanked in Francophone Africa and is leveraging existing mobile money infrastructure.\nIn other startup news, Nigerian retail-tech startup, Alerzo has acquired Fintech company, Shago payments to expand its growth.\nThe startup now offers several digital services to informal retail establishments, including mobile airtime top-up, bill payments, and peer-to-peer transfers.\nReadNetflix’s ‘Squid Game’ will generate nearly $900 million for the company – despite costing only $21 million to make, reports say."
  },
  {
    "headline": "How agritech startups are helping to check food inflation in Nigeria",
    "summarized_story": "I tried painting a picture of what food inflation looks like, but this tweet about the increase in the price of sardines does a pretty good job.\nTo commemorate this year’s celebrations, we look at issues that affect food production and supply in Nigeria, highlighting the work of two agritech startups.\nIn addition, we spotlight the effects of food inflation and steps Nigeria can take to meet its food requirements but first, what is food inflation and what causes it?\nDemand outstripping supply and supply being affected are the two major causes of food inflation.\nThe role of agritech startups in tackling food inflationLike other areas of the Nigerian economy, tech and tech-enabled startups have sprung up to solve the problem of food inflation."
  },
  {
    "headline": "Nigeria sinking as petrol subsidy mounts",
    "summarized_story": "By December, it could reach N3 trillion and will be Nigeria’s largest subsidy bill ever and under a government that claimed at the beginning that there was no subsidy on petrol in the country.\nOne situation was used to characterise the burden of Nigeria under the subsidy mechanism.\nIt is said that at a given time, Nigeria had 26 cargoes of crude oil it could export.\nOn October 7, the Senate confirmed the appointment of four nominees as members of the Nigerian Midstream and Downstream Petroleum Regulatory Authority.\n“Reform the domestic crude supply and Forex allocation scheme to ensure level playing market conditions preparatory to full market price competition,” MOMAN added."
  },
  {
    "headline": "Nigeria sinking as petrol subsidy mounts",
    "summarized_story": "By December, it could reach N3 trillion and will be Nigeria’s largest subsidy bill ever and under a government that claimed at the beginning that there was no subsidy on petrol in the country.\nOne situation was used to characterise the burden of Nigeria under the subsidy mechanism.\nIt is said that at a given time, Nigeria had 26 cargoes of crude oil it could export.\nOn October 7, the Senate confirmed the appointment of four nominees as members of the Nigerian Midstream and Downstream Petroleum Regulatory Authority.\n“Reform the domestic crude supply and Forex allocation scheme to ensure level playing market conditions preparatory to full market price competition,” MOMAN added."
  },
  {
    "headline": "Nigeria risks spending 63% of oil revenues on petrol subsidy in 2022",
    "summarized_story": "Nigeria could spend about 63 percent of its oil income next year paying petrol subsidy if it doesn’t end the practice before August 2022.\nEarlier this year, the NNPC said it has been spending about N120bn monthly on petrol subsidy.\nNigeria swaps crude for petrol under the Direct Sales Direct Purchase agreement where the NNPC offers refiners in Europe crude oil in exchange for refined petroleum products.\nFactoring in exchange rate, global oil prices and shipping cost, petrol prices are estimated at N212- N234/ltr compared to the retail price of N162-N165/ltr the government has mandated it be sold.\nThis pattern of expenditure could worsen if analysts’ projections on oil prices come true."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "Nigerian govt takes delivery of final batch of Tucano jets",
    "summarized_story": "The federal government says it has taken delivery of the final batch of the 12 A-29 Super Tucano fighter jets expected from the United States.\n“All the 12 Super Tucano fighter jets have been received.\n“We can see that the Tucano jets are actually game changers.\n“Most of the successes we have recorded in recent times is because of the acquisition of new platforms, not limited to the super Tucano,’’ he said.\nThe Nigerian Air Force on July 22 took delivery of the first batch of six of the A-29 Super Tucano aircraft from the United States."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "U.S. Consulate boosts capacity of 50 Lagos teachers in STEM teaching methods",
    "summarized_story": "“The U.S. Mission in Nigeria is committed to supporting initiatives that promotes STEM education in Nigeria.\nThis teacher training workshop will boost teacher confidence and capabilities in the areas of STEM teaching and learning,” Ibelli noted.\nI am taking everything I have learned to my students and to encourage them to pursue careers in the STEM fields,” she added.\nFollowing the completion of the training, the U.S. Consulate provided all 50 teachers a “Drone in a Box” to take back to their schools and classrooms.\nThis is expected to provide the teachers and their students with an opportunity to put their newly acquired skills to use."
  },
  {
    "headline": "You’ll have no place to hide:’ Buhari fumes as bandits kill 30 in Sokoto",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has vowed to deal with bandits attacking communities in the country’s Northwest region, warning that they would have no place to hide.\nThe bandits were said to have attacked a market in area in the locality between Sunday and Monday.\nShehu quoted Buhari as saying the gunmen will soon no longer have a place to hide.\n“The clock of your ultimate destruction is ticking, as you will no longer have a place to hide,” he said.\n“The cowardly attacks on innocent people by the bandits show a rearguard action of criminals under pressure."
  },
  {
    "headline": "First Black US secretary of state, Colin Powell, dies from Covid-19 complications",
    "summarized_story": "First Black United States Secretary of State, Colin Powell, has died from complications from Covid-19, aged 84.\nPowell is survived by his wife, Alma Vivian (Johnson) Powell, whom he married in 1962, as well as three children.\nHe stayed in the Army after returning home, attending the National War College and rising in leadership.\nThen we’re going to kill it,” Powell famously said at a news conference at the time, referring to the Iraqi army.\nTop diplomat during turbulent timeWith a prominent national profile, Powell was floated as a potential presidential candidate in the 1996 election."
  },
  {
    "headline": "CBN says Nigerians can use e-Naira without Internet",
    "summarized_story": "The Central Bank of Nigeria (CBN), has said Nigerians will be able to use e-naira without Internet-enabled phones.\nThe apex bank which disclosed this in a document with the title ‘Design paper for the eNaira,’ said maximising the value and use cases of the eNaira would depend largely on devices with Internet capabilities.\n“The eNaira thus risks further alienating sections of the population who are uneducated, lack exposure and access to internet services or digital devices,” it said.\nThis principle has enabled the bank to focus on simplicity and ease of use, ensuring that Nigerians without Internet-enabled phones can access the service,” the CBN added.\nThese identity systems will help ensure a robust KYC framework positioned to enable access for all Nigerians.”The CBN added that interoperability between the eNaira and other CBDCs was factored into the design of the eNaira."
  },
  {
    "headline": "JUST-IN: Troops Kill Several Terrorists In Borno",
    "summarized_story": "Troops of Joint Task Force North-East Operation HADIN KAI (OPHK) have killed scores of Boko Haram Terrorists (BHT) and Islamic State West Africa Province (ISWAP) in two different encounters in Borno State.\nThe feat he said was achieved when the troops successfully foiled an attempted infiltration of the terrorists group into the camp, while on a patrol to dominate their area of responsibility.\nHe said the troops engaged the terrorists with overwhelming volume of fire and spontaneous reinforcement from the Battalion Headquarters, compelling them to retreat.\nHe added that three terrorists were killed following exploitation along the terrorists’ route of withdrawal.\nIn another development, four ISWAP/BHTs terrorists were killed around 151 Battalion location."
  },
  {
    "headline": "JUST-IN: Troops Kill Several Terrorists In Borno",
    "summarized_story": "Troops of Joint Task Force North-East Operation HADIN KAI (OPHK) have killed scores of Boko Haram Terrorists (BHT) and Islamic State West Africa Province (ISWAP) in two different encounters in Borno State.\nThe feat he said was achieved when the troops successfully foiled an attempted infiltration of the terrorists group into the camp, while on a patrol to dominate their area of responsibility.\nHe said the troops engaged the terrorists with overwhelming volume of fire and spontaneous reinforcement from the Battalion Headquarters, compelling them to retreat.\nHe added that three terrorists were killed following exploitation along the terrorists’ route of withdrawal.\nIn another development, four ISWAP/BHTs terrorists were killed around 151 Battalion location."
  },
  {
    "headline": "BREAKING: Kogi Govt Approves Mathew Opaluwa’s Appointment As New Atta Igala",
    "summarized_story": "The Kogi State government has approved the appointment of Prince Mathew Alaji Opaluwa as the new Atta Igala following the demise of HRM Michael Ameh Oboni II, who died on Thursday, August 27, 2020 in Abuja.\nThis followed the ratification of the appointment by the Kogi State Executive Council at its meeting on Monday.\nS.M Ozigi Deedat, on Monday evening, said the appointment of Prince Opaluwa followed his nomination by the Kingmakers and the Committee set up by Governor Yahaya Bello to entertain all issues surrounding the selection of the new Atta.\nThe council also approved the grading and upgrading of 74 traditional stools cutting across the three senatorial zones in the state.\nBefore his appointment, he had worked at the Independent National Electoral Commission in 1988 as an administrative officer and rose through the ranks to become a deputy director."
  },
  {
    "headline": "BREAKING: Kogi Govt Approves Mathew Opaluwa’s Appointment As New Atta Igala",
    "summarized_story": "The Kogi State government has approved the appointment of Prince Mathew Alaji Opaluwa as the new Atta Igala following the demise of HRM Michael Ameh Oboni II, who died on Thursday, August 27, 2020 in Abuja.\nThis followed the ratification of the appointment by the Kogi State Executive Council at its meeting on Monday.\nS.M Ozigi Deedat, on Monday evening, said the appointment of Prince Opaluwa followed his nomination by the Kingmakers and the Committee set up by Governor Yahaya Bello to entertain all issues surrounding the selection of the new Atta.\nThe council also approved the grading and upgrading of 74 traditional stools cutting across the three senatorial zones in the state.\nBefore his appointment, he had worked at the Independent National Electoral Commission in 1988 as an administrative officer and rose through the ranks to become a deputy director."
  },
  {
    "headline": "Ban On Open Grazing Won’t Solve Insecurity – NATBO",
    "summarized_story": "For over ten decades, Nigeria had not been “Fulanised” and no one had alleged that open grazing is a “Fulanisation” strategy.\n“Hiding under the cover of “Islamisation” to condemn open grazing is not only most insincere, but also not Christlike.\n“To the Southern Governors and others who have banned open grazing, we urge you to thread softly.\n“Education, education, education is what will eventually solve the problem of open grazing.\nNo educated person will be willing to engage in open grazing as a form of profitable business."
  },
  {
    "headline": "Pandora Papers: Obi welcomes proposed EFCC probe",
    "summarized_story": "Says yet to get invitationVice Presidential Candidate of the Peoples Democratic Party (PDP) during the 2019 election, Mr. Peter Obi, has welcomed the proposed probe of his foreign business operations by the Economic and Financial Crimes Commission (EFCC) as a result of the recently released Pandora Papers.\nThough Obi was not accused of either stealing public funds or money laundering in the leaked papers, reports in a section of the media say that he has been invited for questioning by EFCC.\n“However,” the statement further reads, “Obi being a law abiding Nigerian will honour all legitimate invitations from government agencies at all times.”Obi had in the wake of initial media publications on the Pandora Papers insisted that he broke no law.\nObi said his understanding was that the allegation bordered more on tax avoidance and non-declaration of some jointly owned assets.\nObi said he also engaged and acted on solicited advice by reputable legal practitioners on whose opinion he relied."
  },
  {
    "headline": "Pandora Papers: Obi welcomes proposed EFCC probe",
    "summarized_story": "Says yet to get invitationVice Presidential Candidate of the Peoples Democratic Party (PDP) during the 2019 election, Mr. Peter Obi, has welcomed the proposed probe of his foreign business operations by the Economic and Financial Crimes Commission (EFCC) as a result of the recently released Pandora Papers.\nThough Obi was not accused of either stealing public funds or money laundering in the leaked papers, reports in a section of the media say that he has been invited for questioning by EFCC.\n“However,” the statement further reads, “Obi being a law abiding Nigerian will honour all legitimate invitations from government agencies at all times.”Obi had in the wake of initial media publications on the Pandora Papers insisted that he broke no law.\nObi said his understanding was that the allegation bordered more on tax avoidance and non-declaration of some jointly owned assets.\nObi said he also engaged and acted on solicited advice by reputable legal practitioners on whose opinion he relied."
  },
  {
    "headline": "Again, banks, schools, markets shut as Anambra observes sit-at-home",
    "summarized_story": "Residents of Anambra on Monday observed the sit-at-home despite the insistence of the Indigenous People of Biafra (IPOB) that it had been suspended.\nBanks, markets, shops and schools refused to open while most of the workforce in the State stayed indoors.\nThough there was little life in the Awka capital City, commercial areas like Onitsha, Nnewi and Ekwulobia look like ghost lands.\n– Advertisement –The development left residents of the areas stranded, especially, the traders who claimed to have lost lose money.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, banks, schools, markets shut as Anambra observes sit-at-home",
    "summarized_story": "Residents of Anambra on Monday observed the sit-at-home despite the insistence of the Indigenous People of Biafra (IPOB) that it had been suspended.\nBanks, markets, shops and schools refused to open while most of the workforce in the State stayed indoors.\nThough there was little life in the Awka capital City, commercial areas like Onitsha, Nnewi and Ekwulobia look like ghost lands.\n– Advertisement –The development left residents of the areas stranded, especially, the traders who claimed to have lost lose money.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nigeria's Okoro, Nicholas jailed for defrauding four Americans",
    "summarized_story": "Musa of the Federal Capital Territory High Court, Apo on Monday sentenced Okoro Daniel and James Nicholas to various jail terms for cybercrime offences.\nOkoro who claimed to be a US citizen working with the United Nations as a medical doctor induced Christiana Morgan, Auriel Correl and one Phillip, all Americans, to deliver to him the equivalent of N10m with which he acquired a Lexus Jeep RX 350.\nAlso, Nicholas tricked Leongorman Simone Everett to deliver the sum of N1.5m to him on the guise of being an internet hacker.\nIn his ruling, Justice Musa sentenced Okoro to three months in prison with an option of N100,000 fine while Nicholas is to spend two months in prison or a fine of N50,000.\nThey are to forfeit all proceeds of crime to the Federal Government, including a Lexus Jeep RX 350, iPhone 7, MacBook, phones and laptops."
  },
  {
    "headline": "Haitians stage nationwide strike over kidnapping, FBI promises help",
    "summarized_story": "Haitians on Monday mounted a nationwide strike to protest a growing wave of kidnappings, days after the abduction of a group of missionaries prompted FBI involvement.\nSecurity experts suspect the kidnapping was carried out by a gang known as 400 Mawozo.\nHaitian authorities have remained silent about the incident, and the whereabouts of the group of missionaries, which includes women and children, is unknown.\n“We live in fear.”Toussaint said sales had plunged amid the threat of kidnapping and extortion that now haunt all workers and business owners.\nThe growing crisis in Haiti has also become a major issue for the United States."
  },
  {
    "headline": "BREAKING: Gov. Bello Appoints Opaluwa New Attah Igala",
    "summarized_story": "Matthew Alhaji Opaluwa has been named the new Attah Igala by Governor Yahaya Bello of Kogi State.\nDr Michael Ameh Oboni II, who has been on an ancestral voyage since 2020, will be succeeded by Opaluwa.\nBarrister Salami Ozigi, the Kogi State Commissioner of Local Government and Chieftaincy Affairs, made the announcement shortly after the State Executive Council Meeting on Monday, which was presided over by the State Governor.\nHe stated that Opaluwa’s appointment was made in accordance with the law.\nDetails will be provided later."
  },
  {
    "headline": "BREAKING: FG Files 7-Count Amended Terrorism Charge Against Nnamdi Kanu",
    "summarized_story": "The Federal Government has filed an amended seven-count amended charge against the detained leader of the proscribed Indigenous People of Biafra, IPOB, Nnamdi Kanu.\nThe amended charge, which was filed by the office of the Attorney-General of the Federation and Minister of Justice, borders on treasonable felony and Kanu’s alleged involvement in acts of terrorism.\nThe embattled IPOB leader will be re-arraigned before trial Justice Binta Nyako on Thursday.\nMeanwhile, the Senator representing Anambra North, Ifeanyi Ubah, on Monday, filed a motion before the Federal High Court in Abuja to compel the Department of State Services, DSS, to allow him to have access to Kanu in detention."
  },
  {
    "headline": "APC Member Tells Court To Nullify Andy Uba’s Nomination As party Candidate For Anambra Guber.",
    "summarized_story": "Ahead of November governorship election in Anambra State, a Federal High Court in Abuja has been asked to nullify the primary election of the All Progressives Congress, APC, which produced Senator Emmanuel Andy Uba as its governorship candidate.\nThe APC chieftain cited section 87 of the Electoral Act and guidelines of the party which stipulated that primary election must be conducted between 8am and 4pm.\nThe plaintiff averred that he and others delegates as well as INEC officials waited till 7pm on the primary election day without party officials billed to conduct the election.\nHe said that he was shocked the following day when the party announced that it had conducted a purported primary election and that one Emmanuel Andy Uba had won.\nThere plaintiff, therefore, asked Justice Inyang Eden Ekwo to nullify the purported primary election and order a fresh one."
  },
  {
    "headline": "BREAKING: IPOB’s sit-at-home order grounds Owerri again",
    "summarized_story": "Owerri, the Imo State capital, was a shadow of itself on Monday as residents continued to stay indoors in compliance with the sit-at-home order of the Indigenous People of Biafra in the five South-East states of Nigeria.\nThis has continued two months after the separatist group, IPOB, said it had cancelled its weekly sit-at-home order in protest against the detention of its leader, Nnamdi Kanu, by the Federal Government.\nStudents of Imo State University refused to attend lecturers as parents and guardians kept their children and wards at home.\nApart from pharmacy shops, all the stalls on Mbari, Okigwe Road, Imo State University junction, Control Post Roundabout, Akwakuma, Amakaohia and Wethedral roads, were locked.\nSecurity operatives mounting a roadblock at the Orji flyover on Owerri- Okigwe Road, as other security agents patrolled the town."
  },
  {
    "headline": "Rampaging bandits kill 30 in Sokoto market",
    "summarized_story": "Gun-wielding bandits Sunday stormed a weekly market in Goroyo local government of Sokoto state, killing 30 people, Governor Aminu Waziri Tambuwal has confirmed.\nBut another report from Goroyo, though unconfirmed, said about 60 people were killed by the bandits during the attack.\nGoronyo attackA human rights activist in the state, Basharu Guyawa, said the bandits raided the market with a force of about 200 men.\nThey were not selective in their shooting; they obviously came to kill,” Guyawa, the coordinator of Rundunar Adalci told Premium Times.\n“The Governor of Kaduna state, Malam Nasir el-Rufai commended the security forces for taking out the notorious bandits."
  },
  {
    "headline": "Enough of this, we’ve lost so much to sit-at-home, Igbo traders, residents declare",
    "summarized_story": "AnambraIn Awka, Anambra state, Blueprint reports that residents are passing through pains and agonies, while students missed their examinations and events rescheduled all in observance of the order.\nAn economist and former governor, Central Bank of Nigeria (CBN), Prof. Charles Soludo, at a recent stakeholders’ meeting posited that Anambra state alone lost a sum of N19.6billion at every sit-at-home.\nI charge everyone involved in the security architecture of Anambra State to take very seriously, this threat to our livelihood and boldly rise to confront same.\nNow we have been vindicated by the recent confession by Governor Willie Obiano of Anambra State on why he did not attend the meeting of South East governors in Enugu.\nThe religious institutions have also resorted to prayers at their various churches for an end to the mayhem and peaceful Anambra state November 6 governorship election."
  },
  {
    "headline": "FirstMobile: A symbol of banking convenience with global attraction",
    "summarized_story": "Over the years, the development in digital financial technologies across the world, like e-money, digital banking and crowd funding platform has tremendously changed accessibility of financial services.\nThe bank, in its effort to make cutting-edge banking services available to its customers, has continuously revamped its mobile banking application – FirstMobile – to boost convenience and ease of banking as well as enhance customers’ digital banking experience.\nIn 2019, Global Business outlook awarded First Mobile with the 2019 best mobile banking App.\nFirst Bank mobile banking application, FirstMobile, awarded the 2020 Best Mobile Banking App award in the Global Finance Best Digital Bank Awards 2020.\nThe awards include the 2021″ Retail Banking CEO of the year Nigeria, Most innovative Retail Banking App Nigeria and Best CSR Bank Nigeria awards."
  },
  {
    "headline": "Access Bank, Xploits Consulting celebrate girl child, donate school items in FCT -NigPilot",
    "summarized_story": "In a concerted effort to ensure a better life for the girl child in the country, Access Bank Plc in partnership with Xploits Consulting Ltd has donated learning materials and sanitary items to girls in some schools around the Federal Capital Territory, FCT, to celebrate the International Day of the Girl Child.\nThe project which was titled #keep the girl child in school, reached out to a total of 150 girls.\nFifty girls from each school namely: Junior Secondary School, Gwarimpa, Abuja,Junior Secondary School, Kwali Central, Kwali and Government Secondary School, Giri, Gwagwalada benefited from the project.\nSpeaking further she said the project was supported by Access bank as part of the bank’s corporate social responsibility, CSR, where funds and resources are channeled into impacting people’s lives positively.\nAppreciating the gesture, the principal GSS, Giri, Gwagwalada, Mr. Emmanuel Agbebaku on behalf of the other principals thanked Xploits Consulting and Access Bank Plc for the gifts."
  },
  {
    "headline": "Air Peace gets second safety performance award in three months -NigPilot",
    "summarized_story": "THE West and Central Africa’s largest carrier, Air Peace, has been recognized with the Distinguished Safety Performance Award by the Federal Airports Authority of Nigeria (FAAN).\nThe Spokesperson of the airline, Mr. Stanley Olisa disclosed this in a statement on Friday.\nOlisa said that the award was presented by the Kaduna Airport Manager and Chairperson, Airport Safety Committee, Kaduna International Airport, Mrs. Amina Ozi-Salami, in recognition of Air Peace’s consistent commitment to safety with records of zero accident/serious incidents at the Kaduna International Airport.\nOlisa, expressed gratitude to the airport authorities for the award, adding that it further accentuates the airline’s unwavering stance on 100 percent safety compliance in line with established global standards.\nIn August this year, Air Peace was also conferred with the Gold Standard Safety Award by the National Association of Aircraft and Pilots Engineers (NAAPE), for its safety record and safety system performance as well as outstanding investment in brand new aircraft and equipment."
  },
  {
    "headline": "FG opens more potentials in mining sector as alternative revenue sources -NigPilot",
    "summarized_story": "In line with the diversification agenda of the present administration, more potentials are being opened as alternative sources of revenue generation for the country.\nSpeaking during the foundation laying ceremony of the Gold Souk in Kumbotso Local Government Area in Kano State, Minister of Mines and Steel Development, Arc.\nOlamilekan Adegbite stated that this could not have come at a better time than now.\nHe also disclosed that the event has offered a golden opportunity to highlight the efforts of the present administration to open some of the potentials available in the mining sector to serve as an alternative revenue source.\nSpeaking also at the event, the Governor of Kano State, His Excellency, Dr. Abdullahi Umar Ganduje, said that Kano State was one of the economic commercial centers in Nigeria, the most populous state in the Federation, and historically the center of commerce in the Nation."
  },
  {
    "headline": "Mining is all about data – Adegbite -NigPilot",
    "summarized_story": "Olamilekan Adegbite has disclosed that the knowledge of data of mineral deposits in the country is what makes exploration easier which invariably attracts investment in the Mining and Mineral Sector, generates foreign exchange, and creates employment for the teeming youths, adding that exploration creates wealth along the mineral value chains.\nAdegbite made the disclosure in his office in Abuja recently, at the presentation ceremony of the Committee Preliminary Report on the National Integrated Mineral Exploration Project, NIMEP, led by its Chairman, Dr. Addulrazaq Garuba.\nReceiving the report, which he described as a very good and laudable project, Adegbite explained that NIMEP was designed to provide geosciences data needed for integrated mineral exploration in Nigeria.\nEarlier, the Director-General, Nigerian Geological Survey Agency, NGSA, and Chairman of the Committee on NIMEP, Dr. Abdulrazaq Garuba maintained that NIMEP project faced several challenges such as insecurity, ranging from kidnapping to banditry.\nHe listed other challenges faced by the project as interference by Local Government Areas, community restiveness, amongst others."
  },
  {
    "headline": "FG Files Amended Terrorism Charge Against Nnamdi Kanu",
    "summarized_story": "The Federal Government has filed an amended seven-count against the detained leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nThe amended charge which was filed by the Office of the Attorney-General of the Federation and Minister of Justice on Monday, borders on treasonable felony and the alleged involvement of Kanu in acts of terrorism.\nMeanwhile, the lawmaker representing Anambra North senatorial district in the National Assembly, Senator Ifeanyi Uba, has filed a suit at the Federal High Court in Abuja.\nIn the motion of notice dated October 15, the lawmaker is seeking an order to be allowed to visit Kanu who is in the custody of the Department of State Services (DSS).\nThe embattled IPOB leader was later sighted in Israel, but he was intercepted on June 27 and repatriated to Nigeria to face the charges for which he was arrested – about four years since he jumped bail."
  },
  {
    "headline": "Goronyo Attack: Sokoto Govt Confirms 43 Killed, Buhari Sends Tough Warning To Bandits",
    "summarized_story": "Forty-three people have been confirmed killed in the wake of the attack by bandits on Goronyo township in Goronyo Local Government Area of Sokoto State.\nI was not categorical about the figure,” he was quoted as saying in a statement by his media adviser, Muhammad Bello.\n“We just finished a meeting with some stakeholders and I have confirmed that we lost 43 people, unfortunately to that incident.\nAccording to the President, bandits are living in the fool’s paradise of invincibility, but reality will soon dawn on them harder than ever before.\n“The cowardly attacks on innocent people by the bandits show a rear-guard action of criminals under pressure,” President Buhari added."
  },
  {
    "headline": "U.S. To Collaborate With Nigeria To Fight Terrorism",
    "summarized_story": "The United States Government is not only fighting terrorism within its territory but also extending a helping hand to Nigeria in a new move to address global terrorism.\nAlthough there are plans for other areas of collaboration, tackling terrorism is a common priority for both countries.\n“It is important and consequential for close relationship for the United States and I want to start by underscoring that,” said Finer.\nNigeria has been battling terrorism for more than a decade now, with Boko Hara and Islamic State West Africa Province (ISWAP) emerging as the dominant forces in the conflict.\nThe group split from Boko Haram in 2016 and rose to become the dominant jihadist group, focusing on attacking military bases and ambushing troops."
  },
  {
    "headline": "Court Orders Immigration To Release Peter Odili’s Passport",
    "summarized_story": "Justice Inyang Ekwo of the Federal High Court in Abuja, has ordered the Nigerian Immigration Service (NIS) to immediately release the international passport of the former governor of Rivers State Peter Odili.\nDelivering the Judgement on Monday, the ruling judge declared the seizure by the service as illegal, unconstitutional and an infringement of his fundamental rights.\nHe further ordered the service, to tender an apology to the former governor, and restrained the NIS from harassing and intimidating him from leaving the country or moving freely within the country.\nThe former governor had filed a suit against the immigration service challenging the seizure of his passport at the Nnamdi Azikiwe International Airport, Abuja on 20 June 2021, upon his arrival into the country.\nThe service, however, told the court that it acted based on Mr Odili’s presence on a EFCC corruption watchlist."
  },
  {
    "headline": "P&ID Scam: EFCC Re-Arraigns Nolan, Two Others",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Monday re-arraigned two British nationals, James Nolan and Adam Quinn (at large), before Justice Donatus Okorowo of the Federal High Court in Abuja.\nThey were re-arraigned for their alleged complicity in the controversial Process and Industrial Development gas processing contract, leading to the $9.6 billion arbitral award to P&ID Limited by a United Kingdom commercial court.\nThe defendants, both directors of Goidel Resources Limited – a Designated Non-Financial Institution (DNFI) – and ICIL Limited, were re-arraigned on 32 counts bordering on money laundering.\n1 of 2012).”After the charges were read to them, the third defendant (Nolan) pleaded ‘not guilty’ to the charges.\nJustice Okorowo, thereafter, adjourned the matter until December 13 for the commencement of the trial."
  },
  {
    "headline": "Ondo CJ withdraws from former Deputy Speaker's impeachment suit",
    "summarized_story": "The Chief Judge of Ondo State, Justice Williams Akintoroye, has withdrawn from the lawsuit challenging Honourable Iroju Ogundeji’s dismissal as the Deputy Speaker of the State House of Assembly.\nJustice Akintoroye excused himself from the suit as a result of the allegation of likely bias leveled against him by the embattled lawmaker representing Odigbo constituency 1 in the Assembly.\nHe had last week accused the Chief Judge on bias and prejudice against him.\nHe also said he was not comfortable with the fraternisation between the defendants and the Chief Judge.\nJustice Akintoroye said all allegations against him in the past have been dismissed because he did not have any skeleton in his cupboard."
  },
  {
    "headline": "Tambuwal confirms 30 dead in bandits attack on Goronyo -",
    "summarized_story": "Sokoto state governor, Aminu Tambuwal has confirmed that atleast 30 persons are feared dead as a result of bandits attack on Goronyo township, the headquarters of Goronyo local government areaThe governor disclosed this few hours after the incident when the Chief of Army Staff, Lt. Gen. Farouk Yahaya paid him a courtesy visit today.\n“Between last night, yesterday evening till this morning, we were greeted with a very dastardly attack in Goronyo local government, particularly Goronyo township, where scores and tens have lost their lives and still counting.\nBut it is 30 something,” the Governor explained.\nTambuwal noted that the army chief “have come at a very trying moment for the army and the Nigerian nation.\nHe pledged that his administration shall continue to support the army and other security operatives."
  },
  {
    "headline": "COAS visits Sokoto to assess ongoing operations at 8th Division",
    "summarized_story": "Chief of Army Staff, Lieutenant General Farouk Yahaya has arrived at the 8th Division Nigeria Army Headquarters in Sokoto.\nThe Army Chief is making his first operational visit to the Division in Sokoto.\nHe is also expected to, among other things, present an operational vehicle to the Regimental Sergeant Major (RSM)He is also slated to pay a courtesy call on the state Governor and the Sultan of Sokoto, Muhammad Sa’ad Abubakar."
  },
  {
    "headline": "Breaking: Court orders immediate release of Peter Odili's passport -",
    "summarized_story": "The federal high court sitting in Abuja has declared the seizure of the passport belonging to former governor of Rivers state Peter Odili as illegal, unconstitutional and a violation of his fundamental rights.\nDelivering judgment in the suit filed by the former governor against the immigration service, justice Inyang Ekwo ordered the immediate release of the passport to the former governor.\nThis difference the court said is attributed to Mr Odili shortening his name while instituting the suit as to his full name on the passport.\nThe NIS did not tender the document which placed Mr Odili on any watchlist or any ordering them to seize his passport.\nThe court subsequently ordered the NIS to render an apology to Mr Odili for the embarrassment caused him, and further restrained them from harassing or intimidating him while in the country or leaving the country."
  },
  {
    "headline": "Nigeria: Soludo Most Qualified to Lead Anambra, Former Governor Ezeife Says",
    "summarized_story": "On November 6, registered voters in Anambra are expected to go to the polls to elect a new governor that will pilot the affairs of the southeastern Nigerian state for the next four years.\nAs things stand, the security challenges in Anambra have forced some governorship candidates to either suspend their campaigns or do so outside the state.\nDr Chukwuemeka Ezeife, former governor of Anambra.\njoined the Morning Show on Monday to discuss the situation and what needs to be done by the authorities and critical stakeholders to douse tension in the state.\nWatch the interview for more…"
  },
  {
    "headline": "Nigeria’s Unity Negotiable, Says Kingibe – Trending with Ojy Okpe",
    "summarized_story": "The Nigerian air force has denied a report by the Wall Street Journal which alleged that they paid bandits N20 million Naira in exchange for an anti-aircraft gun.\nMeanwhile, the statement made by Babagana Kingibe, former secretary to the government of the federation, in which he said the unity of Nigeria is ‘negotiable’ garnered mixed reactions over the weekend.\nFinally, viral Video over the weekend showing police officers who allegedly extorted money from travelers in Kogi state has caught the attention of The States Police Command."
  },
  {
    "headline": "Former US Secretary of State, Colin Powell, Dies of Covid Complications",
    "summarized_story": "General Colin Powell, a former U.S. secretary of state and Joint Chiefs of Staff chairman, 84, died of complications from COVID-19 on Monday, according to his Facebook page.\nDetails later…"
  },
  {
    "headline": "US: Nigeria’s Northeast Humanitarian Crises One of World’s Most Challenging",
    "summarized_story": "The United States Government has described the humanitarian crisis in Nigeria’s North-east as one of the world’s most challenging and complex.\nU.S Consulate Public Affairs Officer, Stephen Ibelli, disclosed this at the Nigeria Info 99.3 FM “Security and Development Summit”, during a session on “US and Nigeria Security Assistance and Cooperation”.\n“As some of you may already know, the United States is the largest humanitarian donor in response to the North-east crisis, providing $1.45 billion since 2015 and supporting almost two million conflict-affected households.\nPAS Abuja also awards grants in support of Nigeria’s response to the on-going instability in the North-west and North-central regions.\n“Since 2017, Department of State and Department of Defense security assistance for Nigeria totals approximately $650 million."
  },
  {
    "headline": "Tunisian Lawmaker Detained Over Suspected Tax Fraud, Money Laundering",
    "summarized_story": "A Tunisian court on Sunday ordered a lawmaker to be detained over suspected tax fraud and money laundering – the fourth parliamentarian to be taken into custody since President Kais Saied seized near total control of the country in July.\nMehdi Ben Gharbia, a businessman and former minister, is a member of the Tahya Tounes party headed by former prime minister Youssef Chahed, who was dismissed by Saied.\nSaied, who has also suspended parliament and lifted lawmakers’ immunity from prosecution, last week unveiled a new government headed by Najla Bouden.\nNone of the other three lawmakers currently detained in prison have been formally charged with an offence.\nThe third legislator is accused of corruption in connection with a phosphate contract."
  }
]