[
  {
    "headline": "Okada ban begins today, Lagos deploys more boats",
    "summarized_story": "The fresh ban imposed on operations of commercial motorcycles, popularly called Okada, in six Local Governments and nine local council development areas of Lagos State by the state Governor, Babajide Sanwo-Olu, takes effect from Wednesday (today).\nEffective from June 1, 2022, the governor directed security operatives to enforce the proscription order across the councils: Eti-Osa, Ikeja, Surulere, Lagos Island, Lagos Mainland, and Apapa.\nThe Head, Public Affairs, LAGFERRY, Akeem Odusina, made this known in a statement made available to newsmen on Tuesday.\nThe terminal and jetties, according to the statement, include the Badore terminal, Badore; Ipakodo terminal, Ikorodu; Five Cowries terminal, Ikoyi; CMS/Victoria Island terminal; Liverpool terminal, Apapa and Ilaje Bariga terminal, Bariga.\nMeanwhile, the Lagos State Government has said there is no need for any anxiety over the planned enforcement of the Okada ban."
  },
  {
    "headline": "Lagos govt, UN train boys in reproductive health",
    "summarized_story": "The United Nations Population Fund, in conjunction with the Lagos State Ministry of Youth and Social Development, has organised peer education training for boys on adolescent sexual reproductive health, rape, sexual/domestic violence and personal development.\nDelivering his welcome address, the ministry’s Permanent Secretary, Dr Olugbenga Ayoola Aina, said, “Young people are tomorrow’s parents.\nThe reproductive and sexual health decision they make today will affect the health and wellbeing of their communities and countries for decades to come.”He added, “Sexual violence occurs everywhere and across all segments of society.\nA child may be subjected to sexual abuse or exploitation at home, school or in their community while the widespread use of digital techniques can also put children at risk.”Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Bandits kidnap students, travellers, burn vehicles in Kaduna",
    "summarized_story": "Some bandits on Tuesday abducted students, travellers along the Birnin Gwari highway, in the Birnin Gwari Local Government Area of Kaduna State.\nIt was learnt that the hoodlums also burnt eight vehicles in which the students were travelling to write exams for the School of Health Technology, in Makarfi, scheduled to hold at the Kaduna State University in the metropolis.\nAccording to the spokesman, those who are not lucky fell into the trap set by the bandits and were subsequently abducted.\nThe statement read, “Scores of travellers and students who were to write examinations for admission into the School of Health, Makarfi affiliated to the Kaduna State University were abducted.\n“Due to the blockage of the road, some of our students who are to attend entrance exams at School of Health, in Makarfi this morning could not make it, while some of them have been abducted."
  },
  {
    "headline": "African brands leap 17% in global ranking",
    "summarized_story": "•As Dangote, GTB, DSTV others emerge top African brandsBy Olayinka AjayiAmid the negative impacts of the Covid-19 pandemic on developing economies, brands in Africa have surged from 4per cent to 17 per cent from 2020 to 2022.\nSpeaking during the 12th Annual Brand Africa 100, Africa Best Brands 2022 held in Lagos, Chairman, Brand Africa, Mr. Thebe Ikalafeng, while urging brand builders in Africa to build brands that travel beyond the shores of Africa, he said: “After a 5-year decline, African brands have surged 4.0 percentage points to 17 percent from an all-time low of 13 percent in 2020 and 2021 in the 2022 Brand Africa 100 Africa’s Best Brands survey and ranking of the best brands in Africa”.\nIkalafeng who commended top Nigerian brands added that Nigerian brands, Dangote ranking 22, Glo (32), Jumia (42) and Nasco (75), are among the 17 African brands that have made the Top 100 brands in Africa.\nHe stated: “Overall, South Africa’s MTN, has returned to the Top 10 as the highest ranking African brand.\nDStv, also consolidated its position as the top African media brand for the second year running, while Channels TV led as the top Nigerian media brand, in a category that is fast going digital and mobile."
  },
  {
    "headline": "Hunters kill Boko Haram Commander, Deputy in Borno clash, recover 1 AK47 rifle, motorcycle",
    "summarized_story": "The leader of the hunters have also recovered an AK47 rifle and a motorcycle used by the terrorists, while several other terrorists escaped with gunshot wounds.\nThe North East Chairman of Hunters, Alhaji Yohanna in telephone interview with Journalists in Maiduguri on Tuesday confirmed the incident.\n“Upon recieving the information, i mobilized my team and stormed the spot in the evening at Shaffa Taku, which is a deserted community in Damboa.\nWe engaged them in a gun battle, and we were able to kill the Commander and his Deputy, while several.others fled with gunshot wounds.\n“We also recovered one motorcycle and one AK47 rifle from the terrorists, presently, I have informed the authorities of the 231 Battalion in Biu, and we are going to meet today (Tuesday) for onward handing over to the recovered AK47 rifle and the motorcycle”."
  },
  {
    "headline": "Thugs destroy Federal government housing scheme in Ondo",
    "summarized_story": "— Deji of Akureland fingers as sponsor—- lts cheap blackmail- MonarchDayo Johnson AkureThugs went on rampage in Akure, the Ondo state capital yesterday destroying several buildings at the Federal Government Housing Scheme.\nThe housing scheme was located at Alagbaka Government Reservation Area GRA, in the state capital.\nAn Eyewitness account said that one of the workers was beaten to a state of coma by the thugs.\nAkin-Benson alleged that the Monarch has been making unlawful moves to grab the land from him and halt the Federal Government project.\nAccording to him, “Oba Aladetoyinbo has been using thugs to disrupt work on site and sometimes drop charms to scare him and the workers."
  },
  {
    "headline": "2023: Muslim Scholars reject Atiku, insist on Yoruba-Muslim Presidency",
    "summarized_story": "By Ezra UkanwaABUJA—AHEAD of the 2023 Presidential elections, a group, Concerned Yoruba Muslim Scholars In Nigeria, CYMSN, on Tuesday, insisted that a Yoruba Muslim must emerge as President or Vice President of Nigeria.\nMayaleke, however, warned that serious consequences may loom should the political parties present any Presidential or Vice Presidential candidate short of a Yoruba Muslim.\nHe said: “The Concerned Yoruba Muslim Scholars in Nigeria has noted with deep concern the unfolding scenarios with respect to the election of candidates by political parties ahead of the 2023 General elections in Nigeria.\n“Secondly, the assumption and attempt to permanently disenfranchise the Southern Muslims the opportunity to aspire for highest position of president or vice president of the country is undemocratic, injurious and will be resisted with all legal means available.\n“In the Southwest states till date, Christian – Christian ticket is a common phenomenon without much cry from the Muslim Ummah, why the fuss from our Christian counterparts as regards the faith of Muslim gladiators."
  },
  {
    "headline": "GUBER ELECTION:’Calls for cancellation of Sokoto APC primary mischievous’",
    "summarized_story": "Two pressure groups, Concerned Nigerians and Coalition of Sokoto State APC Supporters Group, have dismissed calls for the cancellation of All Progressives Congress, APC, governorship primary in the state.\nThis was disclosed in a statement by the Sokoto State Coordinator of Concerned Nigerians, Comrade Suleiman Mahmud, on behalf of the two groups.\n“Therefore, as the progressive Youths of Sokoto State, and active stakeholders in the party, we wish to dissociate ourselves and every young persons, which the faceless group has impersonated, from the shambolic call for the cancellation of the Sokoto APC Governorship Primary.\n“The groups are unknown to any structure of our party in Sokoto State, nor neither belong to the party.\n“We, therefore, commend the process of the primary election and also congratulate the winner as we look forward to victory during the election in 2023."
  },
  {
    "headline": "Two killed as police invade IPOB hideout, arrest others in Ebonyi",
    "summarized_story": "The Ebonyi State Police Command on Monday said that it has invaded the main camp of Eastern Security Network, ESN, located at Isu community in Onicha LGA of the state and dislodged suspected criminals.\nHe said that the hoodlums attacked and killed a police officer attached to Ebonyi State Police Command, whose name is yet to be identified.\n“In a swift and spontaneous response, the joint team engaged the hoodlums in a counter-firing that lasted over 30 minutes and neutralized them.\n“As a result of the superior fire power of the joint team, some of the hoodlums with bullet-wounds scampered for escape in different directions.\n“The team made their way to the main enclave of the miscreants and after a thorough ransacking, recovered more exhibits,” he said."
  },
  {
    "headline": "America denies establishing ‘US-controlled laboratories’ in Nigeria",
    "summarized_story": "The United States has rejected the claims that the current outbreak of monkeypox originated from America.\nA statement by the US Embassy on Tuesday also said the country had no “U.S.-controlled laboratories” in Nigeria.\n“There is zero merit to any allegations regarding the use of U.S.-assisted Nigerian laboratories in the spread of monkeypox”, the US maintains.\nThe statement said the collaboration with Nigeria has provided opportunities for technical assistance in capacity building, equipment, commodities/consumables, funding to critical public health programs, hospitals and laboratories.\nThe U.S. reminded the public that monkeypox is not a new disease, nor unique to Nigeria or Africa, having first been diagnosed in 1970 in Congo."
  },
  {
    "headline": "NCC, stakeholders chart new path to effective telecoms regulation, industry growth",
    "summarized_story": "The Nigerian Communications Commission (NCC) has hosted the second edition of the Nigerian Telecoms Leadership Summit.\nThis is in line with its tradition and commitment to engage with stakeholders in the telecom ecosystem with a view to pursuing proactive regulatory interventions targeted at ensuring an enabling operating environment and improving investment climate in the Nigerian telecom industry.\nThe EVC said those consequential ecosystems have contributed to the growth of the Nigerian digital economy riding on telecom infrastructure.\n“Therefore, it has become imperative for us, as critical stakeholders, to appraise the progress made so far as an industry and chart the course for the future of the telecoms industry in the country,” he stated.\nDanbatta said that the contribution of the telecom sector continues to benefit the entire ecosystem."
  },
  {
    "headline": "Court orders marketers to defend alleged $8.4m diesel theft",
    "summarized_story": "An Ikeja Special Offences Court has dismissed the no-case-submission applications filed by two oil marketers charged with receiving $8.4million from oil theft.\nYusuf Yaya Kwande and Osahon Asemota and their companies are being prosecuted by the Police Special Fraud Unit (SFU).\n“There is a need for them to explain their role in allegations preferred against them by the prosecution”, Dada noted.\nThe judge adjourned until October 4 for the defendants to open their defence.\nThe SFU prosecutor, G. O. Balogun said the three-count charge include conspiracy and receiving stolen property."
  },
  {
    "headline": "Bauchi govt reviews 24hrs curfew imposed on Yelwa to 12hrs",
    "summarized_story": "Bauchi State Government has reviewed the 24hrs curfew imposed on the Yelwa axis of Bauchi metropolis to 12hrs from 6pm to 6am daily.\nDAILY POST recalled, that the curfew was imposed following the civil unrest of Friday, 27th May 2022 that was ignited by miscreants in Kagadama, Tsakani and Lushi in the Bauchi Local Government Area.\nA 24-hour curfew was also imposed on the area.\nBut in a press release, the Chief of Staff, Dr Aminu Hassan Gamawa said, “Given the fact that Government is on top of the situation, normalcy has been restored to the affected areas, thus it is deemed necessary that the imposed curfew be reviewed”.\n“Consequently, His Excellency, Sen. Bala Abdulkadir Mohammed, CON, the Executive Governor of Bauchi State has approved the review of the 24-hour curfew imposed on Yelwa and environs to a 12-hour curfew, 6:00pm to 6:00am”, the release further contained."
  },
  {
    "headline": "Buhari seeks APC governors support to pick successor",
    "summarized_story": "‘We want a candidate that can win’Governors’ meetings on President’s proposal deadlockedPresident Muhammadu Buhari yesterday sought the backing of the All Progressives Congress (APC) governors in picking his successor.\nBuhari added: “For example, first term governors who have served credibly have been encouraged to stand for re-election.\n“Similarly, second term governors have been accorded the privilege of promoting successors that are capable of driving their visions as well as the ideals of the party.\nPresident Buhari said: “You will all recall that APC came to power at the centre in 2015 through cohesive machinery, notwithstanding its status as the opposition party.\n“Our party, the APC, shall not be any different, more so as we are still implementing the blueprint for a more prosperous nation."
  },
  {
    "headline": "Buhari and his unfolding succession plan",
    "summarized_story": "During a live television interview, he told the nation that he had a preferred presidential candidate, although he did not disclose his identity.\nHowever, he is seeking collaboration with party stakeholders to ensure a smooth selection.\nThese challenges stare President Buhari and the party in the face, six days to the presidential primary scheduled for Eagle Square, Abuja.\nAhead of nominations for 2023 polls, the National Chairman, Senator Abdullahi Adamu, had declared that APC governors should call the shots as leaders of state chapters.\nAs the leader of the party, President Buhari is soliciting for unity."
  },
  {
    "headline": "NWC members accuse party chair Adamu of taking unilateral decisions",
    "summarized_story": "Two top members accused National Chairman Abdullahi Adamu of rendering the administrative organ of the ruling party redundant.\nLukman and Kekemeke said Adamu had sidelined other NWC members.\nThey accused him of high-handedness, breaching the APC constitution and dropping President Muhammadu Buhari’s name to blackmail the NWC members each time he wanted to have his way on issues.\n“The national chairman takes decisions unilaterally.\nWhen it suits him, he invokes the name of our leader, President Muhammadu Buhari, to blackmail NWC members into accepting his decisions."
  },
  {
    "headline": "What Buhari told us, by Sule",
    "summarized_story": "Going by the words of Nasarawa State Governor Abdullahi Sule, President Muhammadu Buhari told All Progressives Congress (APC) governors the type of presidential candidate he has in mind for the party.\nBut Buhari did not tell the governors who the choice-candidate would be, he said.\nSule, who spoke on a Channels’ Television programme yesterday, said that was one of the agenda of an emergency meeting the President had with the progressive governors in Abuja.\nHe said Buhari also hinted that the candidate would be an individual, who understands the vision and drive of the party and that can sustain the good programme of the party.\nHe said: “At our meeting, he did not say he has a preferred candidate and it does not look to me that the president has a preferred candidate."
  },
  {
    "headline": "Governors’ meetings on President’s proposal deadlocked",
    "summarized_story": "The two meetings by the governors on the president’s proposal ended in a deadlock.\nIt was learnt that temper rose when a Northern governor suggested that the North may not vote for a Southern candidate.\nSources said that Southern governors, who were taken aback by the statement, also wondered why the South should vote for a Northern candidate to succeed President Buhari.\nThe meeting was reconvened in the night where some governors said the president’s statement that the APC should pick a candidate who is a party man and who can win the election should henceforth guide them.\nThere was another suggestion that aspirants should go to the primary for the best aspirant to emerge as standard bearer."
  },
  {
    "headline": "Search for Atiku’s running mate widens in South East",
    "summarized_story": "By Doris ObinnaA few days after former Vice President, Alhaji Atiku Abubakar, emerged as presidential candidate of the opposition Peoples Democratic Party (PDP), the search for his running mate has widened in the South East.\nAtiku and the leadership of the PDP are considering either the South East or South South as a place to pick the running mate, in the North-South presidency composition.\nSources revealed that apart from Wike, Emmanuel, Okowa and Anyim, the search for the running mate has widened in the South East, with fresh names being mentioned.\nAmong those whose names have also come up are former Senate President, Ike Ekweremadu; ex-Enugu State governor and senator representing Enugu East, Dr. Chimaroke Nnamani and former Imo State Governor, Emeka Ihedioha.\nDaily Sun gathered that Atiku is only receiving nominations and engaging in broad consultation, so that he would make a choice that would be acceptable to stakeholders in South East and South South."
  },
  {
    "headline": "Boko Haram commanders killed in clash with Borno hunters",
    "summarized_story": "From Timothy Olanrewaju MaiduguriA Boko Haram commander and his deputy have been killed during a clash with hunters and vigilante in a community in Borno StateLeader of the Hunters/Vigilante (Sarkin Baka) Northeast, Alhaji Mohammed Yohanna, made the disclosure, yesterday, in an interview.\nHe told newsmen on phone that the hunters encountered the insurgents at Shaffa Taku, a remote community on the edge of Sambisa, Boko Haram’s operational base in Damboa Local Government, on Monday.\nThe Boko Haram men have been terrorising communities in the area in the last two weeks,” he disclosed.\nHe said his team stormed the spot at Shaffa Taku, where the insurgents were sighted upon receipt of the information.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Resign now, you’re not fit to remain PDP national chairman, Clark tells Ayu – The Sun Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaLeader of Pan-Niger Delta Forum (PANDEF), South-South/PANDEF, Chief Edwin Clark, has called on Senator Iyorchia Ayu to resign as national chairman of the Peoples Democratic Party (PDP).\nHe said most disturbing was what happened at the special national convention of the Peoples Democratic Party (PDP), in Abuja, on Saturday, May 28.\nI was quite impressed by the efforts of the convention committee, which was headed by former Senate President, Senator David Mark, and his assistants, particularly, the Governor of Bayelsa State, Senator Douye Diri.\nBut, sadly, the outcome of the election leaves much to be desired; it was very unjust and rather unwholesome.\n“What Tambuwal did was not only dishonourable, but also a serious electoral abnormality and a tragic betrayal of national patriotism for hidebound interests."
  },
  {
    "headline": "Boko Haram commanders killed in clash with Borno hunters",
    "summarized_story": "From Timothy Olanrewaju MaiduguriA Boko Haram commander and his deputy have been killed during a clash with hunters and vigilante in a community in Borno StateLeader of the Hunters/Vigilante (Sarkin Baka) Northeast, Alhaji Mohammed Yohanna, made the disclosure, yesterday, in an interview.\nHe told newsmen on phone that the hunters encountered the insurgents at Shaffa Taku, a remote community on the edge of Sambisa, Boko Haram’s operational base in Damboa Local Government, on Monday.\nThe Boko Haram men have been terrorising communities in the area in the last two weeks,” he disclosed.\nHe said his team stormed the spot at Shaffa Taku, where the insurgents were sighted upon receipt of the information.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Anambra schools, markets close abruptly as soldiers, gunmen exchange fire",
    "summarized_story": "From Aloysius Attah, OnitshaSome markets and schools in Onitsha and its environs closed abruptly yesterday afternoon, following viral news of rumoured attack by gunmen in the Ugwuagba Obosi and Ogbaru areas of the state.\nAt Blessed Iwene Tansi Catholic Church, Awada Nursery and Primary school children ran in different directions.\nAugustine Oburota, narrated the situation thus:“There was chaos in schools across Awada today, May 31, 2022.\nWhen I inquired, many were in shock and could only cry, until one teacher said it was unknown gunmen scare.\nDaily Sun gathered that there was pandemonium in parts of Amiyi community in the Ogbaru area, as soldiers in full military equipment swooped on the camp of the unknown gunmen located in the area."
  },
  {
    "headline": "Bauchi PDP Set to Conduct Fresh Governorship Primary, as Candidate Withdraws from Race",
    "summarized_story": "*Gov Mohammed expected to pick ticketBy Segun AwofadejiThe Peoples Democratic Party (PDP), Bauchi State Chapter has completed arrangements for a fresh Governorship Primary in the state.\nThis is following the withdrawal of the Gubernatorial Candidate of the party, Barrister Ibrahim Kashim from the race, citing personal reasons for the decision he tookFormer Secretary to the State Government (SSG), Barrister Ibrahim Kashim won the ticket of the party in the primary conducted last week.\nThe Returning Officer for the election, Hassan Ahmed Grema then declared Ibrahim Kashim the sole aspirant, as winner adding that he pulled a total of 655 votes out of the 656 votes while one was invalid.\nTHISDAY checks however revealed that there was friction between the State Governor, Senator Bala Abdulkadir Mohammed, and the gubernatorial Candidate after the primary election.\nZainabari stated that the PDP was following the process as enshrined in the law of the party and the electoral law."
  },
  {
    "headline": "APC Committee Screens Osinbajo, Bello, Lawan, Others",
    "summarized_story": "Adedayo AkinwaleThe Presidential Screening Committee of the All Progressives (APC) Tuesday screened Vice President Yemi Osinbajo, Senate President Ahmed Lawan, Kogi state Governor Yahaya Bello, and former Minister of Niger Delta Affairs, Godswill Akpabio.\nSpeaking with journalists after the screening of the Vice President, Senator Babafemi Ojudu said Osinbajo had all it takes to be President of Nigeria.\nOjudu, a Senior Aide to Osinbajo noted that In the history of Nigeria and primaries in this country, there was nobody that has campaigned like the vice president did.\n“We believe that he will be a candidate for the APC general election and he is the only candidate that can beat Atiku Abubakar.\nI will support anybody who the party and who the president thinks can do better for us."
  },
  {
    "headline": "Methodist Prelate Speaks on Abduction, Says N100m Ransom Paid to Kidnappers for His Freedom",
    "summarized_story": "Emmanuel Ugwu-NwogoThe Prelate of the Methodist Church in Nigeria, His Eminence Samuel Kanu-Uche has revealed that the Church paid a ransom of N100 million to secure freedom for him and two other priests following their abduction on Sunday afternoon.\nThe head of the Methodist Church in Nigeria said that the ransom money was raised by Church members.\nThe Secretary of the Methodist Church Conference, the Rt.\nMichael Akinwale had in a statement on Monday appealed to all parishioners to rise up and help in raising the N100 million ransom.\nAside from admitting the payment of ransom, the Methodist Prelate also made other revelations confirming that Fulani herdsmen were behind the business of kidnapping for ransom in Abia."
  },
  {
    "headline": "News in Photographs: Buhari Meets APC Govs Ahead of Presidential Primary",
    "summarized_story": "President Muhammadu Buhari Tuesdsy met with the 22 governors elected on the platform of the ruling All Progressives Congress (APC).\nKebbi State Governor and Chairman of the Progressive Governors Forum (PGF), Atiku Bagudu Abubakar, led the APC governors to the meeting with the President at the Council Chamber of the State House, Abuja.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Leads 11-man Delegation on State Visit to Spain",
    "summarized_story": "*To be back in Abuja FridayDeji Elumoye in AbujaPresident Muhammadu Buhari departs Abuja Tuesday for Madrid, Spain as head of an 11-man delegation on a State Visit to the European nation at the invitation of the Spanish President, Pedro Sanchez.According to a release issued by his Media Adviser, Femi Adesina, during the visit, the first by the Nigerian leader, President Buhari will also meet with the Head of State of the Spanish nation, His Majesty King Felipe VI.During his engagements with both leaders, the Nigerian President will discuss issues of mutual interest to both countries, which will expectedly result in the signing of Agreements and Memoranda of Understanding on a wide range of topics geared towards further enhancing the bilateral relations between the two nations.Such areas include: Extradition and transfer of convicted persons, Mutual Legal Assistance, Cultural Matters, Cooperation towards fighting crime and enhancing security, as well as issues affecting dependants of diplomatic staff.Also on the agenda are Cooperation on Energy, Trade and Investment, Transportation, Public Health and Sports Development.The President will also be the Special Guest at an Investment Forum jointly organized by the Spanish Chamber of Commerce, the Ministry of Trade, and the Confederation of Employers (CEOE) where he will speak to the gathering of top members of the Spanish business community and their Nigerian counterparts on the investment opportunities in Nigeria and ways of expanding the volume of trade as well as further collaborating for the development of the economies of both countries.On the President’s entourage are the Minister of Foreign Affairs, Geoffrey Onyeama; Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN); Minister of Industry, Trade and Investment, Otunba Adeniyi Adebayo; Minister of Information and Culture, Alhaji Lai Mohammed; Minister of Interior, Rauf Aregbesola; Minister of Youth and Sports Development, Sunday Dare; and the Minister of State for Health, Olorunnimbe Mamora.Other members of the delegation are the National Security Adviser, Maj-Gen Babagana Monguno (rtd); Director-General, National Intelligence Agency (NIA), Amb.\nAhmed Rufa’i Abubakar; and Chairman, Nigerians in Diaspora Commission (NiDCOM), Hon.\nAbike Dabiri-Erewa.The President is expected back in the country on Friday, June 3.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Ex-Imo Governor, Okorocha Arrives Venue Of Ruling APC Presidential Screening Few Hours After Leaving Detention",
    "summarized_story": "The embattled former Governor of Imo State and one of the presidential aspirants of the ruling All Progressives Congress (APC), Senator Rochas Okorocha has arrived at the venue of the party’s presidential screening in Abuja.\nThe APC presidential screening exercise which started on Monday is expected to end today (Tuesday).\nOne of his legal counsel, Steve Asimobi, had said that Okorocha would be attending the screening exercise of presidential aspirants later in Abuja.\n“His Excellency, Rochas Okorocha would be attending the APC presidential screening later today.\nThe judge also ordered the EFCC to return his international passport to the court today with immediate effect."
  },
  {
    "headline": "BREAKING: Ex-Imo Governor, Okorocha Arrives Venue Of Ruling APC Presidential Screening Few Hours After Leaving Detention",
    "summarized_story": "The embattled former Governor of Imo State and one of the presidential aspirants of the ruling All Progressives Congress (APC), Senator Rochas Okorocha has arrived at the venue of the party’s presidential screening in Abuja.\nThe APC presidential screening exercise which started on Monday is expected to end today (Tuesday).\nOne of his legal counsel, Steve Asimobi, had said that Okorocha would be attending the screening exercise of presidential aspirants later in Abuja.\n“His Excellency, Rochas Okorocha would be attending the APC presidential screening later today.\nThe judge also ordered the EFCC to return his international passport to the court today with immediate effect."
  },
  {
    "headline": "BREAKING: APC Member Petitions Presidential Screening Committee, Seeks Disqualification Of Tinubu Over Alleged Age Falsification, Chicago University Certificate Scandal",
    "summarized_story": "A member of the ruling All Progressives Congress (APC), Sagir Mai Iyali has asked the party’s presidential screening committee to disqualify one of the aspirants, Bola Ahmed Tinubu over alleged certificate forgery.\nHe had indicated he graduated from the University of Chicago in his INEC form 001 filled when he contested the Lagos State governorship poll in 1999.\nThe former governor also claimed in the affidavit he attached to the INEC form that he lost his university degree certificate while he was in exile between 1994 and 1998.\nIn a petition sent to John Odigie Oyegun, chairman of the presidential screening committee of the APC, Iyali said Tinubu never graduated from the University of Chicago.\nThe APC member further asked that the former Lagos governor shouldn’t be allowed to participate in the June 7 primary of the party."
  },
  {
    "headline": "BREAKING: APC Member Petitions Presidential Screening Committee, Seeks Disqualification Of Tinubu Over Alleged Age Falsification, Chicago University Certificate Scandal",
    "summarized_story": "A member of the ruling All Progressives Congress (APC), Sagir Mai Iyali has asked the party’s presidential screening committee to disqualify one of the aspirants, Bola Ahmed Tinubu over alleged certificate forgery.\nHe had indicated he graduated from the University of Chicago in his INEC form 001 filled when he contested the Lagos State governorship poll in 1999.\nThe former governor also claimed in the affidavit he attached to the INEC form that he lost his university degree certificate while he was in exile between 1994 and 1998.\nIn a petition sent to John Odigie Oyegun, chairman of the presidential screening committee of the APC, Iyali said Tinubu never graduated from the University of Chicago.\nThe APC member further asked that the former Lagos governor shouldn’t be allowed to participate in the June 7 primary of the party."
  },
  {
    "headline": "One Killed, Two Wounded In Shooting After High School Graduation In US",
    "summarized_story": "One person was killed and two others wounded in a shooting outside a high school graduation ceremony in New Orleans, United States, according to police.\nThe violence unfolded on the campus of Xavier University when a fight broke out “between two females” following the Morris Jeff High School graduation ceremony, officials say.\nThe university’s Convocation Center is used as the venue for a string of the city’s high school graduation ceremonies every year.\nEarlier this month, on 20 May, a fight broke out during the Carver High graduation event, with punches and chairs being thrown during the melee, according to WVUE.\nLast week, 21 persons, mostly young children were killed in a shooting at a primary school in south Texas."
  },
  {
    "headline": "Presidential candidate: After session with Buhari, APC governors hold closed-door meeting",
    "summarized_story": "Governors on the platform of the All Progressives Congress (APC), on Tuesday, held a meeting behind closed doors in Abuja.\nThe meeting of the progressive governors’ forum (PGF) held hours after the APC governors met with President Muhammadu Buhari.\nDetails of the meeting, which was said to have held at the Kebbi governor’s lodge, are still sketchy, but at the session with Buhari earlier on Tuesday, the discussion focused on the party’s presidential primary scheduled for June 6 to 8.\nAbdullahi Sule, governor of Nasarawa, also confirmed the meeting when he appeared as a guest on Channels Television on Tuesday night.\nMeanwhile, in his address, Buhari had urged the governors to ensure that the presidential primary reflects internal democracy."
  },
  {
    "headline": "Presidential candidate: After session with Buhari, APC governors hold closed-door meeting",
    "summarized_story": "Governors on the platform of the All Progressives Congress (APC), on Tuesday, held a meeting behind closed doors in Abuja.\nThe meeting of the progressive governors’ forum (PGF) held hours after the APC governors met with President Muhammadu Buhari.\nDetails of the meeting, which was said to have held at the Kebbi governor’s lodge, are still sketchy, but at the session with Buhari earlier on Tuesday, the discussion focused on the party’s presidential primary scheduled for June 6 to 8.\nAbdullahi Sule, governor of Nasarawa, also confirmed the meeting when he appeared as a guest on Channels Television on Tuesday night.\nMeanwhile, in his address, Buhari had urged the governors to ensure that the presidential primary reflects internal democracy."
  },
  {
    "headline": "Presidential primary: Ayu not fit to continue as PDP chairman, says Edwin Clark",
    "summarized_story": "Edwin Clark, elder statesman and leader of the Pan-Niger Delta Forum (PANDEF), says Iyorchia Ayu is not fit to remain in his position as chairman of the Peoples Democratic Party (PDP).\nClark was speaking on the happenings at the PDP presidential primary.\nAdvertisementSubsequently, Ayu, during a visit to Tambuwal the next day, called him the “hero” of the convention.\nReacting to this, the Ijaw leader accused the PDP chairman of being partial to the north during the primary.\nAdvertisement“This clearly reveals his partiality and predilection in the processes leading to the baffling conclusion of the PDP Presidential Primary."
  },
  {
    "headline": "Presidential primary: Ayu not fit to continue as PDP chairman, says Edwin Clark",
    "summarized_story": "Edwin Clark, elder statesman and leader of the Pan-Niger Delta Forum (PANDEF), says Iyorchia Ayu is not fit to remain in his position as chairman of the Peoples Democratic Party (PDP).\nClark was speaking on the happenings at the PDP presidential primary.\nAdvertisementSubsequently, Ayu, during a visit to Tambuwal the next day, called him the “hero” of the convention.\nReacting to this, the Ijaw leader accused the PDP chairman of being partial to the north during the primary.\nAdvertisement“This clearly reveals his partiality and predilection in the processes leading to the baffling conclusion of the PDP Presidential Primary."
  },
  {
    "headline": "'Boko Haram commander, deputy killed' as hunters clash with insurgents in Borno",
    "summarized_story": "Mohammed Yohanna, north-east zonal chairman of the association of hunters/vigilantes, says members of his team have killed a Boko Haram commander and his deputy in Borno state.\nYohanna, who said this on Tuesday in an interview with journalists, said there was a clash between insurgents and the hunters at Shaffa Taku village of Damboa LGA in Borno on Monday.\nHe added that a motorcycle and an AK-47 rifle were recovered from the insurgents.\nAdvertisement“Upon receiving the information, I mobilised my team and stormed the spot in the evening at Shaffa Taku, which is a deserted community in Damboa.\n“We also recovered one motorcycle and one AK-47 rifle from the terrorists."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Egypt-born Swvl lays off a third of its staff, two months after going public",
    "summarized_story": "Egypt-born and Dubai-headquartered mobility startup Swvl, has announced plans to lay off a third of its workforce.\nThis announcement was revealed in a letter sent to Swvl employees by CEO Mostafa Kandil on May 30.\nSince the merger, however, Swvl has lost more than half of that number and is now valued at $581 million.\nA source disclosed to TechCrunch, that the majority of the layoffs will come from the company’s Dubai and Pakistan offices.\nOver the past 2 months, the economic downturn has forced tech companies across the globe to lay off significant numbers of their workforce."
  },
  {
    "headline": "Google CEO, Sundar Pichai, on cutting edge innovation in Africa",
    "summarized_story": "Share this article:A familiar trend in recent years has seen big tech companies announce cutting edge innovations in key markets.\nIn an unprecedented move, Google invited Techpoint Africa for a chat with its CEO to address issues on Google’s innovative efforts in Africa.\nDespite all these initiatives, Sundar Pichai still believes that Google should be doing more for Africa.\nThis is eerily similar to the $1 billion Africa development fund which Pichai says has been a big focus for the company.\nHowever, Google’s flagship Android phone, Google Pixel, has struggled to make inroads in Africa."
  },
  {
    "headline": "How Joram Mwinamo has helped Kenyans make sense of their businesses since 2007",
    "summarized_story": "Interestingly, this article is about Joram Mwinamo, someone who is actively participating in the evolution of tech businesses in Kenya and has been part of the entrepreneurship ecosystem since 2007.\nAnd in 2020, Joram co-founded SNDBX, an entrepreneur support hub — an upgrade from WYLDE.\nBeing ambitious, he needed to create something that would help similarly ambitious entrepreneurs avoid mistakes while building and scaling their businesses.\nA quick reminder that even before SNDBX, Joram was always all about entrepreneurship and innovation.\nUnsurprisingly, stories about how he has helped different businesses steer themselves towards success are at the top of Joram’s success list."
  },
  {
    "headline": "Double the funding?",
    "summarized_story": "Share this article:Assalam u Alaikum,Last weekend, the African National Congress (ANC) — South Africa’s ruling political party — said it was pushing for changes to South African television regulations, including the free broadcast of key sports.\nThe party believes that matches involving national teams like the Springboks — South Africa’s Rugby squad — should be made free or at a reduced cost to the South African Broadcasting Corporation (SABC).\nWell, I’ve got two funding news to discuss today:Betastore’s $2.5 million pre-Series AAyoken’s $1.4 million pre-seedBetastore’s $2.5 million pre-Series ABetasore, a Nigerian B2B retail marketplace for informal retailers, announced $2.5 million in pre-Series A funding yesterday, May 30, 2022.\nAyoken’s $1.4 million pre-seedAyoken, an NFT marketplace, announced that it had raised $1.4 million in pre-seed funding to help users grow their revenue streams via digital collectibles.\nAlso, NFT holders will receive additional benefits like access to previously unreleased music and exclusive live events hosted by the creatives."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "CRICKET: Edo Boys High School Emerges Champions of Templars Schools Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Boys High School Cricket team, Benin City on Friday shown class and style in this year’s male final of the Templars Secondary Schools Boys Competition as they defeated the stubbornly Ohonre Grammar School, Benin by 6 wickets.\nThe second innings didn’t take much time as Edo boys high school only had a target of 31 runs to win.\nIt took them just 6.5 overs to surpass the target and emerge champions.\nHowever, the third place match that took place earlier wasn’t short of the thrill and fun as Government Science and Technical College (GSTC) Benin edged out Christlike Secondary School (IDP Camp).\nAs regards the team’s victory, the coach of Edo boys High School, Mr Theophilus Ibodeme Adophus expressed joy over his team’s victory."
  },
  {
    "headline": "Obaseki seeks doctors’ support to rejig Edo health system, tackle brain drain – Nigerian Observer",
    "summarized_story": "He said, “We need more doctors, particularly with the way the doctors are traveling out for greener pastures.\nWhat we need is to strengthen the institutions that produce doctors.\nThe lesson is that we must fix our healthcare system.\n“We have insisted on healthcare reforms.\n“My focus is on how to produce more doctors by strengthening the basic education system and giving quality education to produce more doctors for the state."
  },
  {
    "headline": "Amstel Malta Ultra Refreshes Okpekpe Race Participants – Nigerian Observer",
    "summarized_story": "The premium beverage brand’s sponsorship of the thrilling road race is part of its commitment to initiating quality interactions and inspiring healthier communities through sporting activities in Nigeria.\nDuring the event, Amstel Malta Ultra, presented as the official malt drink of the race, provided much-needed vitality and motivation for scores of athletes from across the Africa continent who competed to earn a share in the N60million cash reward for top performers.\nSince its launch in 2020, Amstel Malta Ultra has achieved acclaimed recognition among consumers as a drink for health-conscious individuals and fitness enthusiasts.\nThe beverage brand’s ‘no added sugar’ feature makes it the choice drink for athletes and people in the sports industry.\nWith its sponsorship of the 8thOkpekpe International 10km Road Race and its previous editions, Amstel Malta Ultra reiterates its commitment to reviving healthy lifestyle activities, uniting Nigerians through sports, and empowering athletes with premium vitality."
  },
  {
    "headline": "UNIBEN Don laments eroding social value … as NAS organises FOB – Nigerian Observer",
    "summarized_story": "lecturer in Mass Communication deptartment, University of Benin (UNIBEN), Dr. Daniel Ekhereafo has said that the social value in Nigeria has completely broken down within the last 12 years.\n“More worrisome is the monetisation of the political system and the use of youths as thugs and agents of distabilisation.\nAnti-Social behaviour, he added creates a life of affluence that I’d unsubtainable.\nWith anti-social behaviour, he said that the society loses the ingredients for repositioning the society for the better.\nTo remedy the situation, he expressed the need to return to the family value system, while value reorientation must form part of the national and sub-national engagement with the youths."
  },
  {
    "headline": "Brutality: Osun NUJ calls for immediate redeployment of CP Olokode",
    "summarized_story": "By Sunday Oguntuyi, OsogboNigeria Union of Journalists, Osun state Council, has demanded for immediate redeployment of Osun State Commissioner of Police, Mr Olawale Olokode, over the shooting of its member by men of the state police command.\nA statement by the Chairman of the Council, Comrade Wasiu Ajadosu and Secretary, Comrade Bukola Elufadejin gave the Nigerian police seven days ultimatum to redeploy Olokode, on the grounds of gross indiscipline and unprofessional conduct of the men and officers of the command under his supervision.\nThe statement further called on Inspector General of Police, Usman Baba Alkali, to take this urgent step in order to save the state from incessant unrest and crisis due to lackadaisical approach to sensitive issues of security by the leadership of the commandThe statement described the action of the officers of the command as unfortunate,barbaric,uncivilized and demeaning, especially in a democratic environment where citizens possess the rights to ventilate their grievances through protest.\nThe Union noted that it would no longer condole harassment, intimidation of its members, saying over five members of the union had been attacked by the police in the last three months.\nRecall that members of the Nigeria police today reportedly shot at a correspondent of the Nation Newspaper, Toba Adedeji, who was covering protest by family of a boy who was akilled in cold blood allegedly by policemen in the State in April this year."
  },
  {
    "headline": "Osun Food Support Scheme: We’re not distracted by guber election – Govt",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun government has reiterated its commitment to meeting the needs of the citizens even as the state prepares for an election.\nThis is as the government flagged off the 14th edition of the Osun Food Support Scheme in line with its commitment to bringing succour to the people and banishing the scourge of hunger and poverty in the State.\nThe issue of election has absolutely nothing to do with the promise made to the people as to their welfare.\n“Our social intervention initiative goes beyond this monthly food support scheme.\nWe have said this before and we will continue to say it that this initiative is not for political patronage."
  },
  {
    "headline": "BREAKING: Tension, division among APC governors over Buhari’s request to pick successor",
    "summarized_story": "The meeting was held in Abuja, minutes after the APC governors had a meeting with President Muhammadu Buhari.\nShortly after informing them of his resolve, the president immediately left for Spain after his meeting with the governors.\nThis position, it was learnt did not go down well with some southern governors.\nThis position is believed to have been pushed by governors loyal to some southern presidential candidates such as Vice President Yemi Osinbajo and ex-Lagos governor Bola Tinubu.\nMr Buhari said this Tuesday at a meeting with governors elected on the APC platform at the State House, Abuja."
  },
  {
    "headline": "2023: I will chose my successor as you chose yours – Buhari tells APC govs",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has told governors of the All Progressives Congress (APC) that he plans to chose his successor ahead of the party’s presidential primary scheduled for Tuesday next week.\nYou will all recall that APC came to power at the center in 2015 through a cohesive machinery, notwithstanding its status as the opposition party.\nOur party, the APC, shall not be any different, more so as we are still implementing the blueprint for a more prosperous nation.\nThis would also ensure that any anxiety occasioned by different factors are effectively brought under control and that our party emerges stronger.\nGod bless our Party, the APC and God bless our nation, Nigeria."
  },
  {
    "headline": "APC crisis worsens as NWC members accuse Adamu of dictatorship",
    "summarized_story": "The simmering leadership crisis in the All Progressives Congress (APC) appear to have escalated with two members of the National Working Committee (NWC), Salihu Lukman and Isaacs Kekemeke, accusing the national chairman, Abdullahi Adamu of dictatorship.\nIn a statement on Tuesday, Lukman, national vice-chairman, north-west, and Kekemeke, national vice-chairman, south-west, alleged that Adamu takes decisions unilaterally.\nBoth NWC members said every effort to get Adamu to respect the authority of the committee is proving difficult.\nWhen it suits him, he invokes the name of our leader, President Muhammadu Buhari to blackmail NWC members into accepting his decisions.\nNote that NEC’s donation of its powers was to NWC and not to the National Chairman or any individual”, they stated."
  },
  {
    "headline": "Manufacturers’ Power Generation Cost Jumps By 12.86% To N45.036bn – MAN",
    "summarized_story": "This represents an increase of 12.86 per cent from the N32.18 billion recorded in the first half of the year.\nWhile petrol prices in Nigeria are subsidised, diesel prices are unregulated, so the impact of higher crude is immediate and unavoidable.\nExpenditure on alternative energy sources stood at N77.22 billion in 2021 as against 81.91 billion recorded in 2020.\nIt also increased by 13.9 per cent when compared with 49.1 per cent recorded in the preceding half.\nThe president, MAN, Mansur Ahmed, said: “Electricity supply provides a significant share of total cost of production in the manufacturing sector in Nigeria."
  },
  {
    "headline": "Manufacturers’ Power Generation Cost Jumps By 12.86% To N45.036bn – MAN",
    "summarized_story": "This represents an increase of 12.86 per cent from the N32.18 billion recorded in the first half of the year.\nWhile petrol prices in Nigeria are subsidised, diesel prices are unregulated, so the impact of higher crude is immediate and unavoidable.\nExpenditure on alternative energy sources stood at N77.22 billion in 2021 as against 81.91 billion recorded in 2020.\nIt also increased by 13.9 per cent when compared with 49.1 per cent recorded in the preceding half.\nThe president, MAN, Mansur Ahmed, said: “Electricity supply provides a significant share of total cost of production in the manufacturing sector in Nigeria."
  },
  {
    "headline": "Presidential Primaries: Group Hails Saraki, Says He Remains A Hero",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door, has praised former Senate President, Dr. Abubakar Bukola Saraki, for his performance at the last special national convention of the Peoples Democratic Party (PDP), saying the Waziri of Ilorin Emirate remains a hero.\nSaraki came distant third at the PDP presidential primary election conducted at the special convention of the party last Saturday with 70 votes.\nFormer vice president Atiku Abubakar won the exercise with 371 votes to emerge the party’s presidential candidate for the 2023 elections.\nCoordinator of Saraki Is Coming Door To Door organisation, Umar Faringado Kazaure, in a statement issued in Abuja on Tuesday, said Saraki performed excellently well at the PDP presidential primary exercise given the odds against him, hence the group was proud of him.\nAbubakar Bukola Saraki came third in the presidential primaries."
  },
  {
    "headline": "Presidential Primaries: Group Hails Saraki, Says He Remains A Hero",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door, has praised former Senate President, Dr. Abubakar Bukola Saraki, for his performance at the last special national convention of the Peoples Democratic Party (PDP), saying the Waziri of Ilorin Emirate remains a hero.\nSaraki came distant third at the PDP presidential primary election conducted at the special convention of the party last Saturday with 70 votes.\nFormer vice president Atiku Abubakar won the exercise with 371 votes to emerge the party’s presidential candidate for the 2023 elections.\nCoordinator of Saraki Is Coming Door To Door organisation, Umar Faringado Kazaure, in a statement issued in Abuja on Tuesday, said Saraki performed excellently well at the PDP presidential primary exercise given the odds against him, hence the group was proud of him.\nAbubakar Bukola Saraki came third in the presidential primaries."
  },
  {
    "headline": "We Paid N100m Ransom To Free Methodist Prelate – Lagos CAN Chair",
    "summarized_story": "The Lagos State chairman of the Christian Association Of Nigeria (CAN), Bishop Stephen Adegbite, has revealed that a ransom of N100million was paid for the release of the Methodist Church Prelate, Samuel Kanu-Uche.\nThe Prelate was released alongside the Methodist Bishop of Owerri, Rt.\nIt has to be paid.’ We tried everything humanly possible and God supported us.\nWe appealed to good Methodist people and they gave us the money, so that the Prelate will not sleep in the bush for the second night.\nHe had no medications with him, they didn’t allow him to eat anything, for more than 12, 14 hours."
  },
  {
    "headline": "My ordeal in the hands of Fulani kidnappers",
    "summarized_story": "The Prelate of Methodist Church Nigeria, His Eminence Samuel Kanu Uche has narrated his ordeal in the hands of eight Fulani men who abducted him.\nHe was Freed on Monday after paying a ransom of N100 million to the kidnappers.\n“That they are not actually against Nigeria citizens, that they are against the government, that this government is a bad government.\nThey were all Fulani boys, the eight of them were Fulani boys.”Uche added that the kidnappers said any day they see the president or any of his representatives, they would chew them raw.\n‘’That each of us will pay N50 million and the three of us will pay N150 million."
  },
  {
    "headline": "Nadal ousts Djokovic in vintage French Open Q/final",
    "summarized_story": "Rafael Nadal’s reign as the claycourt king appears to be on course, after beating arch rival and defending champion Novak Djokovic 6-2 4-6 6-2 7-6(4) in a vintage French Open quarter-final clash on Tuesday.\nHaving already survived a five-set thriller against Felix Auger Aliassime in the previous round, the Spaniard, who has only lost three times at the French Open since his first campaign in 2005, knows every inch of the immense court Philippe Chatrier and Djokovic paid for the reminder.\nNadal on his part eyes a record 22 Grand Slams.\nOn the day teenager Carlos Alcaraz, who has been widely tipped as his successor, was knocked out, Nadal threw the punches and had defending champion Djokovic on the ropes in a high octane start under the spotlights.\nThe victory set him up against German third seed Alexander Zverev for a place in Sunday’s final."
  },
  {
    "headline": "BREAKING: Okorocha Beats Deadline, Arrives For APC Presidential Screening",
    "summarized_story": "Rochas Okorocha has arrived in Abuja for the presidential screening of the All Progressives Congress.\nAfter being arrested and imprisoned by the Economic and Financial Crimes Commission last week Tuesday, Mr Okorocha was in risk of missing the two-day practice.\nThe EFCC has filed a 17-count charge against the former governor, with a total value of N2.9 billion.\nHe is accused of scheming to steal from the public coffers with others, including a member of the All Progressives Congress (APC) and five companies.\nMr Okorocha has stated that he is innocent of any misconduct."
  },
  {
    "headline": "NSCDC Arrest 3 Suspected Bandals In Katsina",
    "summarized_story": "Haris Ishaq, 58, and two others were arrested by the Nigeria Security and Civil Defense Corps (NSCDC) in Katsina State for allegedly vandalizing electricity facilities.\nDSC Mohammed Abdara, the command’s spokesman, stated during a news conference in Katsina on Tuesday.\n“ The principal suspect, Haris Ishaq, is a native of Yangero village, in Jibia Local Government Area,” he said.\nHe said that Hamisu, a resident of Yarnmawa Quarters, Katsina Metropolis, bought 30kg of the cables at the cost of N9500.\nHe expressed the commitment of the NSCDC command to collaborate with other security agencies to fight crime and insecurity in the state."
  },
  {
    "headline": "Breaking: Fresh suit seeks to disqualify Atiku, queries his citizenship",
    "summarized_story": "A constitutional lawyer, Mr. Johnmary Jideobi, on Tuesday, approached the Federal High Court in Abuja to challenge the eligibility of former Vice President, Atiku Abubakar, to contest the 2023 presidential election.\nThe plaintiff, in the suit marked FHC/ABJ/CS/751/2022, maintained that Atiku, who is the flag-bearer of the Peoples Democratic Party, PDP, is not constitutionally qualified to participate in the presidential contest.\nConsequently, he posed two legal questions for the court to determine, afterwhich he sought for seven principal reliefs against Atiku, PDP and the Independent National Electoral Commission, INEC, who were cited as 1st, 2nd and 3rd defendants in the matter.\nThe Attorney-General of the Federation was also joined as the 4th defendant.\nMore details soon."
  },
  {
    "headline": "Why Agege Deserves A Mudashiru Obasa",
    "summarized_story": "Recently, Agege was described, figuratively, as a small London by an aide of the Speaker of the Lagos State House of Assembly, Rt.\nBefore the emergence of Obasa as Speaker, Agege was just there – on a ‘straight line’ not curving upwards.\nThis translates to “Agege is where the boss comes from.” Obasa towers, politically, above his physical size.\nThe Neighborhood Safety Corps, initiated through a bill by the Speaker, today has thousands of employees and effectively complements other security agencies.\nDespite the nature Nigeria’s politics, Obasa remains one of the small number of political office holders in Nigeria who could be in the midst of his Agege residents without any safety concern."
  },
  {
    "headline": "[Breaking] N2.9bn: Hours after securing bail, Rochas Okorocha shows up at APC presidential screening venue",
    "summarized_story": "Former governor of Imo state, Rochas Okorocha, on Tuesday night showed up at Transcorp Hilton Abuja, venue of the ongoing All Progressives Congress (APC) presidential screening to take his turn as one of the aspirants.\nOkorocha was forcefully arrested last week by the operatives of the Economic and Financial Crimes Commission (EFCC) at his residence over alleged N2.9 billion fraud.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] N2.9bn: Court grants Rochas Okorocha N500m bail",
    "summarized_story": "Former governor of Imo state, Rochas Okorocha, has been granted N500 million bail with one surety in like sum by the Federal High Court sitting in Abuja, on Tuesday.\nJustice Inyang Ekwo okayed Okorocha’s released on bail, after he dismissed a counter-affidavit the Economic and Financial Crimes Commission (EFCC) filed against him.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "As APC screens Tinubu, Baduru, Umahi, others: Oyegun committee seeks consensus commitment from presidential aspirants",
    "summarized_story": "The All Progressives Congress (APC) has finally commenced the screening of its presidential aspirants seeking to fly the party’s ticket during the 2023 general elections.\nThe screening was earlier slated for May 23, 2022, but indefinitely postponed by the National Working Committee (NWC).\nAbout 23 aspirants are jostling to pick the party’s presidential ticket.\n“I want you to realise that when family politically are asked like my party, APC to step down, I will not challenge the party because like they say, charity begins at home.\nHe knows he is surrounded by some desperate hawks who are desperate to spend any amount to get the APC ticket."
  },
  {
    "headline": "New Materials Nigeria Company to save $100m forex for Nigeria annually",
    "summarized_story": "By our correspondentNew Materials Nigeria Company, a building material company recently commissioned in the Kuje area of Abuja will save Nigeria a whopping sum of $100m in foreign exchange annually when fully operational, its Managing Director, Mr. Jackie Dai Hui has said.\nSpeaking further, the Managing Director said that so far, over $50 million has been invested in the New Materials Nigeria Company explaining that in no distant time, it will grow its investment in Nigeria by establishing a branch in Lagos.\nAccording to him, the establishment of the New Materials Nigeria Company has gone a long way to provide employment to 150 Nigerians both at senior and junior levels who he said are also being trained in various skills.\nWe train Nigerians to run the company; we are transferring technology to those who are brilliant.\n“We can increase our company’s presence in Nigeria because we can source all our raw materials in Nigeria."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Lagos Okada Ban To Take Effect From Wednesday, Govt Calls For Calm",
    "summarized_story": "The Lagos State Government will on Wednesday commence an enforcement of its ban on commercial motorcycles, also known as Okada, in six local local governments.\n“We are now directing a total ban on Okada activities across the highways and bridges within these six local government and their local council development areas, effective from June 1, 2022.”The government views the activities of Okada as dangerous to road users.\nThe state’s Police Commissioner Abiodun Alabi, has described most Okada riders as criminals who must be taken off the road.\nBut enforcement became lax due to the COVID-19 pandemic, according to the State Commissioner of Information and Strategy, Gbenga Omotoso.\nWe are aware of that and are preparing for it.”‘No anxiety’The Okada operators are expected to protest the ban on Wednesday."
  },
  {
    "headline": "Buhari Reveals Criteria For APC Presidential Candidate",
    "summarized_story": "Muhammadu Buhari on Tuesday disclosed his criteria for the ideal presidential candidate of the All Progressives Congress in the 2023 elections.\nThe President made the disclosure while meeting with APC Governors in Abuja.\nREAD ALSO: APC Presidential Panel Screens Osinbajo, Akpabio, Bankole, Others ExpectedThe APC commenced the screening of its presidential candidates on Monday.\n‘Positive Qualities’During Tuesday’s meeting with the Governors, the President charged them to ensure that the party picks a presidential candidate that reflects the APC’s values and virtues.\n“Our party, the APC, shall not be any different, more so as we are still implementing the blueprint for a more prosperous nation."
  },
  {
    "headline": "Osinbajo, Lawan, Fayemi . . . APC Continues Screening Of Presidential Aspirants",
    "summarized_story": "﻿The All Progressives Congress on Tuesday continued the screening of its presidential aspirants.\nTwelve of the aspirants had been screened on Monday, including former Lagos State Governor Bola Ahmed Tinubu and ex-Minister of Transportation, Rotimi Amaechi.\nFormer Speaker of the House of Representatives, Mr Dimeji Bankole was the first to arrive on Tuesday.\nREAD ALSO: Buhari, APC Governors Meet Ahead Of Party’s Presidential PrimaryHis arrival was followed by several other arrivals, including that of the Vice President, Professor Yemi Osinbajo.\nThose screened include Ekiti State Governor, Kayode Fayemi, Kogi State Governor, Yahaya Bello, Senate President, Ahmad Lawan, Former Minister of Science and Technology, Dr Ogbonnaya Onu, and businessman, Mr Tein Jack-Rich."
  },
  {
    "headline": "Abducted Cleric Admits N100m Was Paid For His Release",
    "summarized_story": "The kidnapped Prelate of the Methodist Church, His Eminence Samuel Uche, on Tuesday said N100m was paid as ransom before he was released.\nAt a press conference in Lagos, the cleric said the monies were arranged in five sacks of N20 million.\nThe funds, he noted, were raised by the Methodist Church in Nigeria.\nThe Prelate had been kidnapped alongside two others, the Bishop of Methodist Church, Owerri Diocese and the Prelate’s chaplain.\nA law criminalising ransom payments was recently signed by President Muhammadu Buhari."
  },
  {
    "headline": "Okorocha Completes APC Presidential Screening",
    "summarized_story": "﻿Former Imo State Governor Rochas Okorocha has completed the presidential screening of the All Progressives Congress.\nThere had been doubts that the Senator would be present for the screening after he was arrested and detained by the Economic and Financial Crimes Commission last week Tuesday.\nREAD ALSO: [Alleged N2.9bn Fraud] Court Grants Rochas Okorocha N500m BailAfter his screening, he thanked his supporters for standing by him and insisted that Nigeria needs a detribalised leader like him to pilot the affairs of the nation.\nThe APC is expected to hold a convention for the election of its presidential candidate between June 6 to 8.\nTo win the primary contest, Mr Okorocha is up against the likes of former Vice President Yemi Osinbajo, Senate President Ahmad Lawan, former Lagos State Governor, Ahmed Tinubu and ex-Minister of Transportation, Rotimi Amaechi."
  },
  {
    "headline": "South-South, Southeast delegates endorse Nicolas Felix as consensus candidate -",
    "summarized_story": "A Coalition of delegates from the South-South and South east regions, have endorsed Dr Nicolas Felix as the consensus candidate of the All Progressives Congress from the region.\nThe group made this known during a courtesy visit to Dr Felix at his Abuja residence on Monday.\nThe delegates described Dr Felix as young, vibrant, exposed and energetic aspirant who will conveniently defeat the candidate of the People’s Democratic Party, Atiku Abubakar at the polls in 2023.\nAccording to the group, discussions are ongoing with other aspirants from the two regions to see reasons why Dr Nicolas Felix remains the best option.\nMeanwhile, Dr Nicolas Felix Felix on Monday was screened by the APC Presidential Screening Committee where he excellently responded to questions raised by the panel."
  },
  {
    "headline": "Late governor Lawal's son emerges Kwara SDP guber candidate -",
    "summarized_story": "Mr Hakeem Lawal, son of a late former governor of Kwara state, Mohammed Lawal, has emerged as the Kwara state governorship candidate of the Social Democratic Party.\nHe defeated two other aspirants to emerge the winner of the primary election for the second time in less than one week.\nHe had earlier emerged as the candidate of the party but the primary election was canceled due to a petition written against his victory.\nMr Lawal was one of the APC governorship aspirants in Kwara state in 2019.\nThe Chairman of the Kwara SDP gubernatorial primary election, Mr Olatunji Agbaminoja announced the result of the election."
  },
  {
    "headline": "Allegation of dollarisation of PDP primary, a mere rumour",
    "summarized_story": "Former Spokesman of the Atiku Abubakar Campaign Organisation and PDP governorship candidate in Ogun state, Segun Sowunmi, has described as mere rumour and exaggeration, the alleged dollarization of the just concluded presidential primary of the party.\n“I think that we must be careful that we do not allow rumour to become fact.\nIf you are looking for Political parties that dollarises and criminalises the process, it’s APC.\nThe governorship candidate, however cautioned cultural groups like PANDEF, Arewa Consultative Forum, Afenifere and others to steer clear of political matters and allow political parties manage its affairs.\n” I have advised that PANDEF, Arewa, Afenifere and others need to be told not to jump into political matters as if they are political parties."
  },
  {
    "headline": "Atiku will win 2023 Presidential election with a landslide",
    "summarized_story": "Mr Melaye equally expressed his confidence in the party’s ability to wrestle power from the APC government in 2023.\nHe said governor Tambuwal did not betray Mr Wike as there was no written agreement between the two of them.\nSpeaking on the alleged supremacy battle between North and South at the presidential primary, Mr Melaye accused APC of spreading such fake news.\nHe touted Mr Kolade-Otitoju to swear with Bible that PDP did not win the 2019 presidential election.\nSo we decided to throw it open to acquire power before sharing power,” Mr Melaye said while reacting to the choice of a northern candidate."
  },
  {
    "headline": "Aspirants are Choosing to Corrupt the System Not Delegates – Prof. Anthony Kila",
    "summarized_story": "Professor for Strategy and Development, Anthony Kila, on the overruling power of money in the Nigerian electoral system"
  },
  {
    "headline": "Most Aspirants are Agents of Other Aspirants – Musa Sarkin Adar",
    "summarized_story": "Lawmaker and Member of the All Progressives Congress, Musa Sarkin Adar on the motive behind the high number of aspirants vying for the party’s presidential ticketRelatedStories No Content Available"
  },
  {
    "headline": "Peter Obi Wins Presidential Ticket – Trending With Ojy Okpe",
    "summarized_story": "Former governor of Anambra, State, Peter Obi was declared winner of the Labour Party presidential primary held in Delta state, on Monday.\nIn another development, Peter Obi joined many Nigerians congratulating former Vice-President ‘Atiku Abubakar’ over his victory in the Peoples Democratic Party presidential primary election.\nA video showing former Vice president ‘Atiku Abubakar’ dancing with his wife after the PDP delegates convention is making the rounds on social media.\nFormer Governor of Lagos state, Bola Ahmed Tinubu was trending on social media after a letter by an APC member advising the committee to disqualify the former governor over questionable educational qualifications surfaced online."
  },
  {
    "headline": "Oil Prices Jump after EU Leaders Agree to Ban Russian Crude Imports By 90%",
    "summarized_story": "Oil prices jumped after EU leaders reached an agreement late Monday to ban 90% of Russian crude by the end of the year.\nAt one point, U.S. crude rose to $119.42 per barrel — a 12-week high, according to Refinitiv data.\nContracts for August also traded higher: WTI crude rose 3.21% to $115.83, and Brent was up 1.63% to $119.53 per barrel.\nCharles Michel, president of the European Council, said the move would immediately hit 75% of Russian oil imports.\nAnd by the end of the year, 90% of the Russian oil imported in Europe will be banned."
  },
  {
    "headline": "Nigeria: INEC Reacts to Election Guidelines Adjustment, Says It’s Not Unilateral, Explains PDP is First Beneficiary",
    "summarized_story": "At the meeting, the political parties requested for an adjustment of the Timetable and Schedule of Activities for the conduct of the 2023 general election.\n“Of course, the period for the primaries had started as at the time the political parties unanimously made the request.\nNone of the Political Parties accused the Commission of shifting the goal post at the middle of the game.\nNone of the political parties accused IPAC of acting unilaterally or not representing them.\nWe remind all Political Parties of what happened in some States (Rivers and Zamfara) in 2019,” Okoye said."
  }
]