[
  {
    "headline": "ACPN faults NPHCDA’s report on 70% substandard drugs in Nigeria",
    "summarized_story": "The Association of Community Pharmacists of Nigeria has faulted the National Primary Healthcare Development Agency’s report that over 70 percent of medical drugs being dispensed in Nigeria are substandard.\nChildren under five are dying at a rate of 128 per 1,000, while over 70 per cent of medical drugs dispensed in Nigeria are substandard.\nHe said, “We know that probably the executive secretary is being misquoted and because there is no literature that says that 70 per cent of drugs in Nigeria are substandard.\nPeople have diabetes and their sugar level is being maintained; these are evidence-based.”He, however, said the Community Pharmacists await the response from the NAFDAC DG to debunk the NPHCDA’s claim on substandard drugs in Nigeria.\n“As far as we are concerned as practitioners, it is not true that we have 70 per cent of substandard drugs in Nigeria and it is degrading to our healthcare system."
  },
  {
    "headline": "ACPN faults NPHCDA’s report on 70% substandard drugs in Nigeria",
    "summarized_story": "The Association of Community Pharmacists of Nigeria has faulted the National Primary Healthcare Development Agency’s report that over 70 percent of medical drugs being dispensed in Nigeria are substandard.\nChildren under five are dying at a rate of 128 per 1,000, while over 70 per cent of medical drugs dispensed in Nigeria are substandard.\nHe said, “We know that probably the executive secretary is being misquoted and because there is no literature that says that 70 per cent of drugs in Nigeria are substandard.\nPeople have diabetes and their sugar level is being maintained; these are evidence-based.”He, however, said the Community Pharmacists await the response from the NAFDAC DG to debunk the NPHCDA’s claim on substandard drugs in Nigeria.\n“As far as we are concerned as practitioners, it is not true that we have 70 per cent of substandard drugs in Nigeria and it is degrading to our healthcare system."
  },
  {
    "headline": "Pay doctors’ February salaries, NMA tells Kogi governor",
    "summarized_story": "Oluwasegun Babalola with Agency ReportThe Nigerian Medical Association has urged the Governor of Kogi State, Yahaya Bello, to direct the full payment of February salaries of medical doctors working with the Kogi State Government.\nIt read, “The meeting observed that the salary of the medical doctors working with the Government of Kogi State was in percentage (69.97 per cent).\n“The NMA Kogi in a letter to Gov.\nIn respect of these, the NMA Kogi chapter appealed to gov.\n“The governor’s handlers on the issue of the percentage salary should be cautioned against doing anything that will cause a breakdown of the much-cherished relationship already developed,” the NMA said."
  },
  {
    "headline": "Pay doctors’ February salaries, NMA tells Kogi governor",
    "summarized_story": "Oluwasegun Babalola with Agency ReportThe Nigerian Medical Association has urged the Governor of Kogi State, Yahaya Bello, to direct the full payment of February salaries of medical doctors working with the Kogi State Government.\nIt read, “The meeting observed that the salary of the medical doctors working with the Government of Kogi State was in percentage (69.97 per cent).\n“The NMA Kogi in a letter to Gov.\nIn respect of these, the NMA Kogi chapter appealed to gov.\n“The governor’s handlers on the issue of the percentage salary should be cautioned against doing anything that will cause a breakdown of the much-cherished relationship already developed,” the NMA said."
  },
  {
    "headline": "Just In: Buhari arrives Lagos",
    "summarized_story": "By Yinka KolawolePresident Muhammadu Buhari has arrived Lagos State for the official commissioning of multi-billion dollars Dangote Fertilizer plant at Ibeju Lekki.\nBuhari arrived the Dangote Refinery complex at 11:20am for the official tape cutting.\nThe fertilizer plant was built at a cost of $2.5 billion, and is capable of producing 3 metric tonnes of urea annually.\nDetails coming.\nVanguard News"
  },
  {
    "headline": "APC appeals sack of 20 Cross River lawmakers, as police secure Assembly",
    "summarized_story": "By Ike Uchechukwu, CALABARThe All Progressives Congress, APC, in Cross River State have disclosed that it has appealed the Federal High Court Judgment and also filed a motion for a stay of execution.\nHis words: “This is to inform All Progressives Congress (APC) members of the National Assembly from Cross River State, members of the Cross River State House of Assembly and the general public that an appeal against the judgement of the Federal High Court, Abuja, has been filed at the Court of Appeal, Abuja.\n“Also, a motion for a stay of execution of the Federal High Court has been filed.\n“The Federal High court judgement that was given against our lawmakers is nothing to worry about.\nPolice at Assembly ComplexMeanwhile, Vanguard observed that the a tactical unit of the police has mounted heavy security at the Cross River State House of Assembly complex in the early hours of Tuesday."
  },
  {
    "headline": "Defection: Ayade to know fate Friday",
    "summarized_story": "Cross River Governor, Ben AyadeA Federal High Court, Abuja, will on Friday, deliver judgment in a suit filed by the Peoples Democratic Party (PDP) against Governor Ben Ayade of Cross River.\nThe judge gave the order following a suit marked: FHC/ABJ/CS/971/2021 filed on Aug. 27, 2021, by the PDP to challenge the 20 lawmakers’ defection to APC, alongside the governor on May 20, 2021.\nALSO READ: Court sacks 20 Cross River lawmakers for defecting to APCHe also dismissed other preliminary objections raised by the sacked lawmakers.\nTaiwo ruled that the argument of the lawmakers that there was rancour in the PDP which necessitated their defection to APC was a ploy to mislead the court.\nWhile Mr Etaba represents Obubra/Etung Federal Constituency of Cross River, Mr Idagbor represents Obudu/Obaliku/Bekwarra Federal Constituency of the state."
  },
  {
    "headline": "Bamise: Lagos Govt arraigns BRT driver Ominnikoron over alleged rape, murder",
    "summarized_story": "By Onozure Dania, LagosThe Lagos State Government on Tuesday, arraigned the Bus Rapid Transit (BRT) driver, Andrew Nice Ominnikoron, before a Lagos High Court sitting at Tafawa Balewa TBS over the alleged rape and murder of his passenger, Oluwabamise Ayanwole.\nOminnikoron is facing a four-count charge bordering on rape, conspiracy and murder preferred against him by the Lagos state government.\nHe said that the incident took place at about 7 pm, at Lekki- Ajah Conservation centre Lekki Ajah expressway Lagos.\nAccording to the prosecutor, the offences committed is contrary to and punishable under Sections 411,223,260 and 165 of the criminal law of Lagos State 2015.\nThe police based its remand application with a temporary four-count charge marked A/26/2022 filed by Lagos State Police Command head of legal section, Superintendent Yetunde Cardoso."
  },
  {
    "headline": "How we made Nigeria top 10 most improved world economies — Lai Mohammed",
    "summarized_story": "By Emmanuel ElebekeThe Federal Government has said the Presidential implementation of over 150 Enabling Business Environment Council, PEBEC, reforms was responsible for moving Nigeria up 39 places on the World Bank Doing Business Index since 2016.\nIt also said the implementation made it possible for Nigeria, being twice named as one of the top 10 most improved economies in the world over the last three years, to be one of only two African countries to make this highly-prestigious list in 2019.\nMohammed commended the IshK Tolaram Foundation for its programmes in Nigeria, especially in the areas of healthcare, entrepreneurial and vocational training, saying the artificial limbs provided free of charge had inspired hope for the beneficiaries.\nShe said the Foundation partners with churches, mosques, hospitals and NGOs to identify and support people requiring artificial limbs free of charge.\nVanguard News Nigeria"
  },
  {
    "headline": "Abiodun: We’ll reinvigorate Ogun BOI’s matching fund to boost agro-allied sector",
    "summarized_story": "…as governor bags OGUNCCIMA’s Grand PatronThe Ogun State Governor, Prince Dapo Abiodun says his administration will reinvigorate the OGSG-Bank of Industry Matching Fund so as to be able to empower and mobilize micro small and medium scale enterprises in the state.\nAbiodun made this known in his office after he was decorated as the first Ogun State Chambers of Commerce, Industry, Mines and Agriculture (OGUNCCIMA) Grand Patron.\nAccording to the governor, his administration would be re-strategizing with the Bank of Industry for the purpose of business concerns operating in the state, particularly in the agro allied sector.\nLet me assure all of us that our International Agro Cargo Airport will be ready on or before September, 2022,” Abiodun stated.\nEarlier in his remarks, the President, Ogun State Chambers of Commerce Industry Mines and Agriculture (OGUNCCIMA), Wasiu Olaleye, lauded Governor Abiodun for improving the business environment and economic status of the state."
  },
  {
    "headline": "Ukraine war has put our relationship with US at breaking point – Russia",
    "summarized_story": "The Ukraine conflict has brought Russia-United States relations to breaking point, according to Russian Deputy Foreign Minister Sergei Ryabkov.\nTo maintain talks between Moscow and Washington, the U.S. needed to stop supplying weapons to Ukraine and change its rhetoric, Ryabkov said.\n“They must stop issuing threats against Russia,’’ he said.\nIn response to U.S. President Joe Biden’s criticism of Kremlin leader Vladimir Putin, the Russian Foreign Ministry had handed a note of protest to U.S.\nBiden had called Putin a war criminal, a murderous dictator and a thug."
  },
  {
    "headline": "Payment of percentage salaries inhuman, unacceptable – NMA tells Kogi govt",
    "summarized_story": "The Nigerian Medical Association (NMA), Kogi State chapter, has described as inhuman the percentage payment of February salaries for medical doctors with the state service.\nThe communique reads in part: “The communiqué at the end of the regular meeting of the State Officers’ Committee (SOC) of the Nigerian Medical Association (NMA), Kogi State Chapter, held on 15th March, 2022.\nThe meeting observed that the salary of the medical doctors working with the Government of Kogi State was in percentage (69.97%).\n”The NMA Kogi chapter, hereby calls on the Governor of Kogi State, His Excellency, Alh.\nYahaya Bello, to direct that the February 2022 salary of medical doctors working with the government of Kogi State, be fully paid.”"
  },
  {
    "headline": "War: Ukraine counter-intelligence foils possible attempt to kill President Zelensky",
    "summarized_story": "Ukrainian counter-intelligence says it foiled a possible assassination attempt on President Volodymyr Zelensky.\nA group of Russian saboteurs led by a secret service agent was arrested in the city of Uzhhorod in the border area between Ukraine, Slovakia and Hungary, Ukraine’s UNIAN news agency reported.\nThe group of some 25 men was reportedly also tasked with carrying out acts of sabotage in the government quarter in Ukraine and in other parts of the country.\nThe men were reportedly planning to masquerade as members of the Ukrainian armed forces in order to make their way to the Ukrainian capital.\nThe Ukrainian government claims that Russian spy squads have tried to get to Kiev and eliminate Zelensky several times since the beginning of the war."
  },
  {
    "headline": "FCT police order arrest of all ‘Baban bola’ in Abuja",
    "summarized_story": "The Federal Capital Territory, FCT, Police Command, has ordered a massive clampdown on rogue scavengers popularly known as “Baban Bola” in the territory.\nThe order was contained in a statement issued on Tuesday by the spokesperson of the command, DSP Josephine Adeh.\n“The CP equally called for extra vigilance on the part of residents, especially areas with intense activities of scavengers, to cooperate with the Police in riding the FCT of these criminal elements.\nHe however enjoined residents not to resort to jungle justice but to arrest and report any rogue scavenger to the nearest Police Station through the following lines: 08032003913, 08061581938, 07057337653 and 08028940883.\n“The CP reassured residents of the commitment of the Command to ensuring adequate protection of lives and property in the FCT”."
  },
  {
    "headline": "National Convention: CECPC briefs APC Senators Tuesday",
    "summarized_story": "The chairman of the Caretaker/Extraordinary Convention Planning Committee of the All Progressives Congress (APC) Governor Mai Mala Buni, will brief Senators of the ruling party by 2pm on Tuesday.\nThe Deputy Senate President, Senator Ovie Omo-Agege, gave this indication at plenary in Abuja.\nOmo-Agege, who presided over plenary, conveyed the notice of the meeting in a letter addressed to Senate President Ahmad Lawan by the Senate Leader, Yahaya Abdullahi.\nA presidential aspirant on the platform of the Peoples Democratic Party (PDP), Senator Bukola Saraki would also meet with PDP Senators today.\nThe letter was also read by the Deputy Senate President, Omo-Agege."
  },
  {
    "headline": "JUST IN: Southsouth cannot win PDP presidency, says Tambuwal",
    "summarized_story": "JUST IN: Southsouth cannot win PDP presidency, says TambuwalIn what appeared a repudiation of the zoning arrangement, Sokoto Governor, Aminu Tambuwal, has told the leadership and stakeholders of the Peoples Democratic Party (PDP) to choose between zoning of its presidential ticket and winning the election.\nThe Governor, who is eyeing the presidential ticket of the PDP, also said that the Southsouth zone cannot win the presidency in 2023.\nTambuwal’s position appeared a veiled response to the insistence by Rivers Governor Nyesom Wike, that the PDP presidential ticket be zoned to the Southsouth region.\nTambuwal spoke in Abuja on Tuesday during a meeting with former principal officers of the National Assembly.\nThe meeting was in continuation of his consultative engagements to garner support for his aspiration."
  },
  {
    "headline": "BREAKING: Court ruling on Electoral Act divides Senators",
    "summarized_story": "Senators were apparently divided on Tuesday over a call for the Senate to debate a Federal High Court ruling that declared Section 84(12) of the Electoral Act as illegal.\nHe argued that the ruling by the Court, which nullified the action of the National Assembly was a bad precedent that must not be allowed to stand.\nThose who went to court to challenge our action, didn’t include us as an interested party.\n“Suddenly, we were told that a judgment was given and the Federal Government immediately gazetted it.\nThis is important to guide against such occurrences.”The debate on the matter was however deferred to Wednesday by the Senate following divergent views on the said ruling."
  },
  {
    "headline": "BREAKING: Buhari arrives ‘Africa’s largest granulated urea fertiliser complex’",
    "summarized_story": "President Muhammadu Buhari has arrived to perform the official tape-cutting of the multi-billion dollars Dangote Fertiliser Plant at Ibeju Lekki, Lagos.\nThe plant, built at a cost of $2.5 billion, has the capacity to produce three million metric tonnes (mt) of urea yearly.\nAccording to dangote.com, the plant is Africa’s largest Granulated Urea Fertiliser complex and occupies 500 hectares of land in the Lekki Free Trade Zone.\nThe Dangote plant is expected to complement the production capacity of other existing plants like Indorama Chemicals facilities, located in Rivers State, which produce urea, ammonia and other industrial raw materials.\nThe President will also use the opportunity of his visit to Lagos to tour the Lekki Deep Seaport and the Dangote Refinery and Petrochemical plant, located within the free trade zone."
  },
  {
    "headline": "Court orders AGF to remove NDDC from Niger Delta Ministry",
    "summarized_story": "The Federal High Court sitting in Yenagoa, Bayelsa State, has directed the Attorney-General of the Federation (AGF) to stop placing the Niger Delta Development Commission (NDDC) under any ministry including the Ministry of Niger Delta Affairs.\nThe court also granted a perpetual injunction restraining the AGF from further constituting an interim or sole administratorship board to run the affairs of the commission.\nThe orders were made following a motion ex parte dated December 10th, 2021 and filed by Odighonin Adienbo on behalf of the Wailing Women of Niger Delta (WWND) and the Integrity Friends for Truth and Peace Initiative (IFTPI).\nThe judge also asked the parties to return to the court on April 5th for report of service, compliance and hearing.\nThe court further said: “That leave is hereby granted to the applicant to seek an order of this Honourable Court directing the respondent to dissolve the current sole administratorship structure used to run the affairs of the Niger Delta Development Commission (NDDC)."
  },
  {
    "headline": "BREAKING! Police take over Cross River Assembly",
    "summarized_story": "Armed policemen on Tuesday morning took over the Cross River State House of Assembly.\nThe policemen drawn from the anti-kidnapping squad and regular policemen were also seen around the routes leading to the House of Assembly.\nMovement into the Assembly complex on Diamond Hill was restricted.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nTheir presence followed the High Court ruling on Monday sacking 20 lawmakers in the state for defecting from the Peoples Democratic Party to the All Progressives Congress."
  },
  {
    "headline": "Convention: APC rolls out stringent criteria, orders disqualification of aspirants with baggage",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has rolled out stringent criteria for aspirants jostling for various positions in the zonal and national leadership of the party.\nIn a document given to the screening committee, it insisted on zero tolerance for corrupt individuals and directed the disqualification of any aspirants with questionable character.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“An aspirant must not be under a sentence of death imposed on him by any court of law, tribunal in Nigeria or a sentence of imprisonment or fine for an offence involving dishonesty or fraud.\nHe had, on arrival at exactly 2.50pm, thrown the entire secretariat into a frenzy, with the staff and drummers dancing and singing his praises."
  },
  {
    "headline": "Court sacks Cross River speaker, 19 others over defection",
    "summarized_story": "“The defendants court documents were contrived and filed with loopholes.\nThe Independent National Electoral Commission (INEC), Speaker of the House of Representatives, National Assembly, Clerk of the National Assembly, Cross River State House of Assembly, Clerk of the state House of Assembly and the APC were also joined as defendants in the suit.\n“Where there is more than one defendant, the suit can be established anywhere, subject to the discretion of the court.\nIn its argument before the court, the APC had submitted that the lawmakers are not registered members of the party.\nHailing the judgment, the Cross River PDP chairman, Venatius Ikem, said: “It was a heart-warning judgement and a victory for Cross Riverians who voted for PDP in 2019 general election."
  },
  {
    "headline": "Insecurity: Buhari approves more personnel for Imo",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has ordered the deployment of more security personnel from the police, Department of Security Service (DSS) and Nigeria Security and Civil Defence Corps as well as additional arms and ammunitions to boost security in Imo State.\nThis followed the resurgence of insecurity in the state, culminating in the attack on the home of Prof. George Obiozor, president-general of Ohaneze Ndigbo and some police assets.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe president had summoned Governor Hope Uzodimma to a meeting in Abuja, yesterday, to apprise him of the security situation in the state.\n“Since January 2020, when I came to office, one of the things I initiated was quarterly stakeholders meeting."
  },
  {
    "headline": "CAN calls for self defence as bandits kill 53, kidnap scores, burn houses in Kaduna, Zamfara – The Sun Nigeria",
    "summarized_story": "The call followed Sunday’s reported attack on Agban Kagoro, Kaura local government area of Kaduna state and killed about 23 people and burnt several houses.\n“Following advice from security agencies, the Kaduna State Government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect.\nThis is to assist the security agencies to stabilise the situation in the areas, save lives and property and enable the restoration of law and order.\n“The security agencies have full authorisation to enforce the curfew.\n“Kaduna State citizens are tired of the government’s rhetorical responses without concrete action taken to protect lives and property."
  },
  {
    "headline": "Emefiele: Unprecedented Oil Theft Affecting Economy",
    "summarized_story": "Emefiele said this while briefing journalists at the end of the Monetary Policy Committee (MPC) meeting in Abuja.\nThe company sated, “AEEPCO remains gravely concerned about the persistent heightened attack on our production facilities and the NCTL.\nMPR is the rate at which the CBN lends to commercial banks and it often determines the cost of borrowing in the economy.\nEmefiele, who read the committee’s communiqué, however expressed worry that whereas global oil prices had gone up, this had been compounded by shortage of supply of petroleum products.\nMembers noted that the on-going war and the resultant sanctions against Russia will continue to have a considerable impact on the global supply chain as both countries are major players in the global commodities market."
  },
  {
    "headline": "Four Days to APC Convention, Buni Harmonises Sub-committees, Screening Starts Today",
    "summarized_story": "In a related development, Imo State Governor, Senator Hope Uzodinma, yesterday, declared that nothing would stop the national convention from holding this weekend.\nA party source, who pleaded anonymity, confirmed that the committees had been harmonised and the screening would commence today.\nThree senators – Abdullahi Adamu, Sani Musa, and Tanko Al-Makura – are contesting the position of APC national chairman at the party’s convention.\n“We would be very happy if any of them emerge as the APC national chairman on Saturday.\nAnother party source, who equally pleaded anonymity, said some of the governors came to beg on behalf of the secretary."
  },
  {
    "headline": "Defection: Again, Court Sacks Two Reps, 18 Cross River Assembly Members",
    "summarized_story": "Another judge of the Federal High Court, Justice Inyang Ekwo, had on March 8, sacked 15 lawmakers of the Ebonyi State House of Assembly as well as Governor Dave Umahi and his deputy for defection.\nMembers of the State House of assembly who decamped from the PDP to the AP) alongside Gov.\nCross River Govt Appeals, Files Motion for State of ExecutionMeanwhile, in a statement late yesterday night, the Cross River State government, through the Special Adviser, Media and Publicity to the Governor, Mr Christian Ita, announced that it had filed an appeal against the judgement and a motion to stay the execution of the judgement.\nThe reads; “This is to inform All Progressives Congress (APC) members of the National Assembly from members of the Cross River State House of Assembly and the general public that an appeal against the judgement of the Federal High Court, Abuja has been filed at the Court of Appeal, Abuja.\nConsequently, the APC members in both the National Assembly and the Cross River State House of Assembly should go about their duties freely.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Court Dismisses Another Suit Seeking Sack of Buni-led CECPC",
    "summarized_story": "He said if the question was answered in the negative, whether their appointment was not a gross violation of the constitution.\nAmong the declarations Bolarinwa sought from the court was that Buni and the other serving governors’ presence in CECPC was illegal and unconstitutional with regard to Sections 183 and 223 of the constitution.\nThe court explained that all the allegations were denied by the defendants, thereby putting the claimant to the strictest proof of the same.\nThe entire suit having regards to the facts and circumstances of the same, constitute an abuse of judicial process and liable to be dismissed.\n“I shall dismiss the said suit by consigning the same to a forlorn of judicial debris."
  },
  {
    "headline": "Bonds Account for 73% of FG’s N19.24trn Domestic Debt, Says DMO",
    "summarized_story": "The 36 states and the FCT owed a total of N6.428 trillion of the total debt stock during the review period.\nAs at December 31, 2021, Lagos State retained its status as the most indebted state with total domestic debt stock of N658 billion.\nRivers State was next with N225.5 billion, followed by Ogun State, N232 billion; Akwa Ibom State, N214.6 billion; and Imo State, N205 billion.\nThe total external debt of states and the FCT amounted to $4.75 billion or 12 per cent of the total external debt of $38.3 billion.\nThe federal government accounts for the biggest chunk of the external debt of $33.62 billion out of the $95.77 billion (N39.566 trillion) total public debt stock just released by the DMO."
  },
  {
    "headline": "Nigeria's Broadcasting Commission, NBC Workers Accuse Buhari's Minister, Lai Mohammed Of Fraudulent Award Of 30 Radio Licences To Cronies",
    "summarized_story": "Nigeria's Minister of Information and Culture, Alhaji Lai Mohammed, has been accused of securing presidential approval for radio licences for 30 unvetted and unprocessed companies.\nThe allegation was made by some staff members of the National Broadcasting Commission (NBC) who identified themselves as Concerned NBC staff.\nThe NBC workers made the allegation in a petition dated March 19 and addressed to President Muhammadu Buhari.\nThey were procured through the backdoor; they flouted the normal procedure and they breached Nigeria’s national security.\nPlease, call Alhaji Lai Mohammed to order."
  },
  {
    "headline": "Nigeria's Broadcasting Commission, NBC Workers Accuse Buhari's Minister, Lai Mohammed Of Fraudulent Award Of 30 Radio Licences To Cronies",
    "summarized_story": "Nigeria's Minister of Information and Culture, Alhaji Lai Mohammed, has been accused of securing presidential approval for radio licences for 30 unvetted and unprocessed companies.\nThe allegation was made by some staff members of the National Broadcasting Commission (NBC) who identified themselves as Concerned NBC staff.\nThe NBC workers made the allegation in a petition dated March 19 and addressed to President Muhammadu Buhari.\nThey were procured through the backdoor; they flouted the normal procedure and they breached Nigeria’s national security.\nPlease, call Alhaji Lai Mohammed to order."
  },
  {
    "headline": "BREAKING: Federal High Court in Abuja Declares 2019 Arrest, Detention Of Sowore Illegal, Award Damages Against Lawless DSS",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has declared the arrest and unlawful detention of the human rights activist, Omoyele Sowore on August 3, 2019, by the lawless operatives of the Department of State Services (DSS) as illegal.\nThe court also ordered the DSS to pay the sum of N1 million and aggravated damages to the activist.\nJustice Obiora Egwuatu of the Federal High Court in Abuja has declared the arrest and unlawful detention of the human rights activist, Omoyele Sowore on August 3, 2019, by the lawless operatives of the Department of State Services (DSS) as illegal.\nThe court also ordered the DSS to pay the sum of N1 million and aggravated damages to the activist.\nThe activist, through his lawyer, Abubakar Marshal, asked the court to declare his unlawful detention by the DSS as \"illegal and a gross violation of his fundamental right to liberty”."
  },
  {
    "headline": "BREAKING: Federal High Court in Abuja Declares 2019 Arrest, Detention Of Sowore Illegal, Award Damages Against Lawless DSS",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has declared the arrest and unlawful detention of the human rights activist, Omoyele Sowore on August 3, 2019, by the lawless operatives of the Department of State Services (DSS) as illegal.\nThe court also ordered the DSS to pay the sum of N1 million and aggravated damages to the activist.\nJustice Obiora Egwuatu of the Federal High Court in Abuja has declared the arrest and unlawful detention of the human rights activist, Omoyele Sowore on August 3, 2019, by the lawless operatives of the Department of State Services (DSS) as illegal.\nThe court also ordered the DSS to pay the sum of N1 million and aggravated damages to the activist.\nThe activist, through his lawyer, Abubakar Marshal, asked the court to declare his unlawful detention by the DSS as \"illegal and a gross violation of his fundamental right to liberty”."
  },
  {
    "headline": "FLASHBACK: How Presidential Spokesman, Adesina Boasted That Nigeria Would Stop Importing Fuel By 2019",
    "summarized_story": "In 2017, the Special Adviser to the President on Media and Publicity, Femi Adesina boosted that the country would stop importation and exportation of petroleum products by 2019.\nSpeaking as a guest on Channels Television’s Sunrise Daily, Adesina had said that the importation and exportation of fuel had a high effect on the lingering fuel crisis because the country did not produce the product locally and the refineries did not work, which made room for little hitches in the inflow.\nFemi Adesina“When you import fuel and do not produce fuel locally or the refineries do not work once in a while fuel scarcity should be expected, as long as you have those variables not under your total control you can’t rule that out,” he said.\nThe presidential spokesperson explained that the then Minister of State For Petroleum Resources, Dr Ibe Kachukwu, had drawn “a timetable leading to 2019; part of the plan is that Nigeria would stop importing but exporting.”Concerning the unemployment rate in the country which the National Bureau of Statics released a data saying that unemployment has increased in the 3rd quarter of 2017, Adesina said that there was an increase agricultural sector especially rice farming, mining and solid minerals.\nHe further explained that shortly after the Buhari-led administration came into power the country entered into recession and oil prices went down but within a year the country came out of recession, he added that as the economy starts to settle gradually jobs that were lost will be regained."
  },
  {
    "headline": "Buhari inaugurates Dangote Fertiliser Plant -- second-largest in the world",
    "summarized_story": "President Muhammadu Buhari has inaugurated the three million metric tonnes Dangote Fertiliser Plant in Lagos.\n“This is a demonstration of enhancing the socio-development of the country,” he said, while also commending the Dangote Fertiliser team.\nOn his part, Aliko Dangote, president and chief executive officer (CEO) of Dangote Group, expressed delight at the success of the fertiliser plant.\nAdvertisementDangote said the plant is the largest in Africa and the second-largest urea plant in the world.\nThe Dangote Fertiliser project phase one is estimated to produce three million metric tonnes of urea per annum."
  },
  {
    "headline": "Buhari inaugurates Dangote Fertiliser Plant -- second-largest in the world",
    "summarized_story": "President Muhammadu Buhari has inaugurated the three million metric tonnes Dangote Fertiliser Plant in Lagos.\n“This is a demonstration of enhancing the socio-development of the country,” he said, while also commending the Dangote Fertiliser team.\nOn his part, Aliko Dangote, president and chief executive officer (CEO) of Dangote Group, expressed delight at the success of the fertiliser plant.\nAdvertisementDangote said the plant is the largest in Africa and the second-largest urea plant in the world.\nThe Dangote Fertiliser project phase one is estimated to produce three million metric tonnes of urea per annum."
  },
  {
    "headline": "MultiChoice increases prices of GOtv, DStv packages",
    "summarized_story": "MultiChoice Nigeria has increased the prices of its DStv and GOtv packagesMultiChoice Nigeria is the Nigerian subsidiary of MultiChoice Africa, owner of DStv and GOtv.\n“Therefore, from April 1, 2022, a new pricing regime for both our DStv and GOtv packages will be in effect.”AdvertisementMultichoice said its DStv package will now cost: Premium (N21,000), Compact + (N14,250), Compact (N9,000), Confam (N5,300), Yanga (N2,950), Padi (N2,150),Business (N2,669), Xtraview + PVR access fee (N2,900)The new prices for GOtv package are: Gotv Max for N4,150, GOtv Jolli for N2,800, GOtv Jinja for N1,900, GOtv Lite for N900.\nTo cushion the price adjustments, Multichoice said customers who pay on or before their due date (before April 1, 2022) would be eligible to pay the old price.\n“Customers who pay for 10 months upfront on the new price will get the 11th and 12th month free,” the company said.\nThe company said the price adjustments would enable it to serve customers better."
  },
  {
    "headline": "MultiChoice increases prices of GOtv, DStv packages",
    "summarized_story": "MultiChoice Nigeria has increased the prices of its DStv and GOtv packagesMultiChoice Nigeria is the Nigerian subsidiary of MultiChoice Africa, owner of DStv and GOtv.\n“Therefore, from April 1, 2022, a new pricing regime for both our DStv and GOtv packages will be in effect.”AdvertisementMultichoice said its DStv package will now cost: Premium (N21,000), Compact + (N14,250), Compact (N9,000), Confam (N5,300), Yanga (N2,950), Padi (N2,150),Business (N2,669), Xtraview + PVR access fee (N2,900)The new prices for GOtv package are: Gotv Max for N4,150, GOtv Jolli for N2,800, GOtv Jinja for N1,900, GOtv Lite for N900.\nTo cushion the price adjustments, Multichoice said customers who pay on or before their due date (before April 1, 2022) would be eligible to pay the old price.\n“Customers who pay for 10 months upfront on the new price will get the 11th and 12th month free,” the company said.\nThe company said the price adjustments would enable it to serve customers better."
  },
  {
    "headline": "Court fixes Friday for judgment in suit seeking Ayade's removal for defecting to APC",
    "summarized_story": "A federal high court in Abuja has fixed Friday to deliver judgment in a suit filed by the Peoples Democratic Party (PDP) against Ben Ayade, Cross River governor.\nThe PDP had taken Ayade to court seeking an order directing him and his deputy, Ivara Esu, to vacate office over their defection to the All Progressives Congress (APC).\nAyade was elected on the platform of the PDP in 2015 and 2019, but defected to the APC on May 20, 2021, along with his deputy.\nOn Monday, Taiwo Taiwo, a judge, sacked 20 lawmakers from Cross River state who defected alongside the governor to the APC.\nIn a similar suit, Inyang Ekwo, an Abuja federal high court judge, on March 8, sacked David Umahi, governor of Ebonyi, and his deputy, Eric Igwe, from office over their defection from the PDP to the APC."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Speaking against toxic work cultures",
    "summarized_story": "Eventually, some ex-staff and current workers at the startup contributed to the piece either anonymously or with full disclosure.\nFor a moment, it appears we’re moving away from the reality that protecting employee interest in the Nigerian tech space is harder than it looks.\nSo far, the founder claims that Lendsqr already has over 100 lenders offering credit to almost half a million users.\nMonths before that, five other eCommerce startups have raised $275m combined in VC fund and debt financing.\nWith this raise, Apollo plans to spread its tentacles into West Africa and other parts of East Africa."
  },
  {
    "headline": "Lendsqr is building the Shopify for lending in Africa",
    "summarized_story": "Tying into his ambition to democratise banking in Nigeria, he is currently building Lendsqr, a startup that would create large-scale lending infrastructure in Africa.\nAdedeji OloweOlowe, who is on the boards of Sparkle and Paystack, has been neck-deep in Nigeria’s financial space, having previously been the chairman of TeamApt.\nHowever, building any lending solution is tough, but what the fintech mogul has planned with Lendsqr is a different beast entirely.\nLendsqr has painstakingly assembled a team of engineers and data experts with experience in Nigeria’s credit and tech space.\nConsidering this, any keen observer can guess Lendsqr will earnestly chase growth and try to corner the lending market."
  },
  {
    "headline": "Nerves and laughter as Techpoint Pitch Friday returns",
    "summarized_story": "Share this article:On Friday, March 11, 2022, we hosted the first Techpoint Pitch Friday of 2022.\nHarmony plans to play in the increasingly competitive buy now, pay later industry.\nHis startup, Siara, plans to provide emergency response and security services for Nigerians using a community model.\nFeedback and networkingProviding feedback to entrepreneurs is an integral part of Pitch Friday.\nApril’s edition of Pitch Friday will be held on Friday, April 8, 2022, and you can register to pitch your startup or join the audience."
  },
  {
    "headline": "Dangote fertiliser plant seen boosting food security",
    "summarized_story": "The global fertiliser industry is reeling from impacts of the Russia-Ukraine crisis, but for Nigerian farmers, fears of disruptions to the supply chain are being allayed with the Dangote Fertiliser Plant, being inaugurated today.\nSeveral factors have pushed prices up, and even when Dangote fertilisers hit the market earlier, pricing was at par.\nThe Dangote plant plans to export too, but farmers expect the local market to benefit significantly.\nFor the Dangote fertiliser to make the desired impact, however, pricing remains key for farmers.\nConsidering the current prices for fertilisers, he thinks it will take nothing short of a miracle for the Dangote fertiliser to make a difference."
  },
  {
    "headline": "CBN loans to FG hit N18trn, raise worries",
    "summarized_story": "CBN loans to the Federal Government through the Ways and Means Advances surged by N4.34 trillion last year to N17.45 trillion in December.\n“If the central bank keeps financing the government deficit through ways and means advances, it is not healthy for the economy.\nAt some point some years ago, the CBN stopped ways and means advances.\nWhile currently the debt stock of 27 percent of GDP is considered sustainable, any macro-fiscal shock can push debt to unsustainable levels.\nBut we do recognise that some things are happening that should be part of debt stock."
  },
  {
    "headline": "Inside Nigeria’s commercial hub where potable water is luxury",
    "summarized_story": "A year later, Ajayi realised that the lack of clean water in the community was plaguing her life daily.\nThe lack of potable water in Lagos – Nigeria’s commercial hub, which is home to roughly 22 million people – is a challenge facing not only poor communities but also the middle-class and highbrow areas of the megacity.\n“Most communities without clean water are far away from the water distribution network.\nAccording to a 2021 United Nations Children’s Fund, only 22 percent (44 million) of Nigerians have access to safely managed drinking water services.\n“The financial and economic impact on the people in communities without potable water is huge and most of them are poor,” said Odejegba."
  },
  {
    "headline": "Taiwan’s Smart City Summit: Obaseki, Leaders From France, UK, Showcase Digital Responses To Pandemic Era – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will on Tuesday, March 22, 2022, join leaders from France, the United Kingdom, Poland, Belgium, Malaysia, Czech Republic, Lithuania and Taiwan to showcase efforts in the digital transformation of their cities at the annual Smart City Mayors’ Summit in Taipei, Taiwan.\nThe summit is a global platform for mayors and city leaders from around the world, who are usually selected to share their experiences in modernizing their infrastructure using digital technology to ultimately transform their societies into smart cities.\nGovernor Obaseki is the only African selected to speak at the summit and Edo was chosen based on the recommendations of innovative leaders from the United States of America and Japan.\nHe will also be speaking on the impact of the Edo Technology Park and the huge investment the State has made in bringing highly sought after digital skills to the doorsteps of thousands of Edo youths.\nObaseki will take participants through the Edo State 30-year Development Plan and some of the strategies to achieve the plan, including development of more hubs for economic transformation and up-scaling the technology ecosystem."
  },
  {
    "headline": "TVET: Edo Govt proposes technical schools in 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo Government says it is building at least one technical school in each of the 18 local government areas in the state to resuscitate Technical and Vocational Education and Training (TVET).\nOsa-Oviawe said that government’s plan to mainstream VTET was aimed at exposing pupils right from primary school to handiwork.\n“If you are already an artisan; a master craftsperson, but you don’t know how to read, we can send you to our adult education school; it is free.\nThis mainstreaming of skilled acquisition, technical and vocational studies, she explained would be extended to schools for Special Needs in the state.\n“So, mainstreaming skilled acquisition, technical and vocational is not just in our regular schools, the governor has mandated that we should extend to our Special Needs schools."
  },
  {
    "headline": "Edo assembly not ceding any land to anybody-Speaker – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Speaker of Edo House of Assembly, Rt.Hon.Marcus Onobun on Monday said that the house would not cede any part of land in the state to anybody for whatever reason.\nThe Nigerian Observer reports that the house had on Tuesday, March 15. began the clause by clause consideration of the bill for a law to prohibit open grazing of cattle and regulate other livestock in Edo.\nEarlier, The Coalition of Civil Society Groups called on the assembly to as a matter of urgency call for a public hearing on the proposed anti- open grazing bill before further consideration of the bill before the assembly.\nComrade Curtis Ogbebor, who spoke on behalf of the protesting group at the assembly complex, said that the group was against a proposed percentage of Edo communal land for ranching.\nAccording to him, Cattle rearing is a private business, therefore investors should acquire their land for ranching from individual land owners or communities just like other farmers and businessmen."
  },
  {
    "headline": "Edo Assembly Constitutes 7-member EDSIEC To Conduct L/G Polls. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo state house of assembly on Monday approved the constitution of a 7-member Edo state Independent Electoral Commission (EDSIEC) to conduct elections into local government councils across the state .\nThe approval of the newly constituted EDSIEC membership followed the consideration of a request by Governor Godwin Obaseki contained in a letter dated March 21st ,and signed by the Secretary to the state government, Barr.Osarodion Ogie to the parliament to confirm the nominees.\nConfirming the membership of the EDSIEC , the speaker .Rt.Hon.Marcus Onobun said the commission has Hon.Justice.\nWhile Mrs.Gladys Idahor ,Uduafi Gabriel (esq), Mr.Felix Ebhota ,Mr. Michael Emmanuel ,Vincent Aimienota and Okekuoyen Ehiedu are to serve as members.\nMeanwhile, the house also passed a bill amending the law establishing the Edo state local government law and the Edo state Independent Electoral Commission establishment and re-enactment law."
  },
  {
    "headline": "Inflation: MultiChoice increases prices of GOtv, DStv packages",
    "summarized_story": "MultiChoice Nigeria has increased the prices of its DStv and GOtv packagesMultiChoice Nigeria is the Nigerian Subsidiary company of MultiChoice Africa, owner of DStv and GOtv.\nA statement from the company on Tuesday, attributed the decision to inflation and the increasing cost of doing business in Nigeria.\n“In light of the rising costs of inflation and business operations, we have had to review the price of our packages to keep delighting our customers with great entertainment, anytime and anywhere,” the statement reads.\n“Therefore, from April 1, 2022, a new pricing regime for both our DStv and GOtv packages will be in effect.”More later.."
  },
  {
    "headline": "Lagos, Ogun, Rivers, A/Ibom, Imo top list of indebted states in Nigeria –DMO",
    "summarized_story": "Lagos, Ogun, Rivers Akwa Ibom and Imo states with a combined domestic debt stock of about N1.56tn, are the top five most indebted states in Nigeria, according to the latest data from the Debt Management Office (DMO).\nWhile sub-national domestic debt stock was N4.46tn, the sub-national external debt stock was N1.97tn in 2021.\nThe N4.46tn domestic debt represents 11.27 per cent of the country’s domestic debt stock of N23.70tn as of December 2021, up from N20.21tn in the previous year.\nLagos owed N658.96bn, Ogun N232.62bn, Rivers N225.51bn, Akwa Ibom N214.61bn, and Imo N205.19bn as of Q4 2021.\nHowever, according to the DMO, the domestic debt stock figures for Rivers State were as at September 30, 2021."
  },
  {
    "headline": "W/C Playoff: 18 players arrive Super Eagles camp ahead of Ghana clash",
    "summarized_story": "Ahead Nigeria’s World Cup playoff encounter with Ghana on Friday, 18 players have arrived at the Super Eagles camp, with eight more expected.\nOthers are captain Ahmed Musa, Saudi Arabia-based striker Odion Ighalo and Watford trio William Troost-Ekong, and Oghenekaro Etebo, who were the first players to arrive at the camp on Monday morning.\nEagles interim coach Austin Eguavoen had released a provisional list of 32 players, with 25 on the main list, while seven more were placed on standby.\nThe winner over two legs will earn one of Africa’s five tickets to the 22nd FIFA World Cup finals, scheduled for 14th November – 18th December this year in Qatar.\nA statement on Ghana’s Football Association website reads, “Coach Otto Addo has named a 27 man squad for the FIFA World Cup Qatar 2022 play offs against Nigeria."
  },
  {
    "headline": "Business Hallmark Newsletter, plus e-edition",
    "summarized_story": "Here are some of reports in today’s edition of Business Hallmark NewspaperDownload the e-edition of the newspaper herehttps://hallmarknews.com/buhari-to-commission-dangote-fertilizer-plant-in-lagos-tomorrow/"
  },
  {
    "headline": "After 2 Months Of Scarcity, CBN Wades Into Fuel Crisis",
    "summarized_story": "The CBN bank governor, Godwin Emefiele, who revealed this move yesterday at the month’s meeting of the Monetary Policy Committee of the CBN, said the bank would take measures to mitigate the impact of the fuel crisis on the Nigerian economy by engaging with key government agencies.\nThis is coming two months after the importation of the off-spec petrol which plunged the country into fuel scarcity of massive proportions.\nThe CBN governor further stated that product scarcity was responsible for the arbitrary increase in the prices of diesel and petrol across the country.\n“We will be engaging with the power minister, NBET and NERC to see whatever we can do to support them,” the CBN governor stated.\nADVERTISEMENTAccording to him, the CBN had disbursed over N1.3 trillion in the last five years to support both the power generating and distribution companies."
  },
  {
    "headline": "Convention: APC Begins Screening Of Aspirants",
    "summarized_story": "After keeping members and aspirants in suspense throughout the weekend, the All Progressives Congress (APC) has finally announced that the screening of its aspirants will commence today.\nADVERTISEMENTA statement signed by secretary of the screening committee, Barr Emmanuel Chukwuemeka Otagburuagu, noted that the chairman of the party’s national convention screening sub-committee, Governor Masari, has invited aspirants for the exercise billed to hold in two batches between today and Wednesday.\nDimeji Bankole, CFR, the Co-Chairman of the APC 2022 National Convention Screening Committee, hereby invites all the Aspirants to the Screening Exercise,” Otagburuagu stated.\nAccording to him, the screening of national chairmanship aspirants and other NWC positions will take place today at a time to be communicated to the aspirants, Wednesday, screening of aspirants into the zonal offices will be held tomorrow from 10am.\nThe media committee has broken “into sub-committees that have speedily moved on their various assignments aimed at delivering a successful Convention six days from today,” a statement by secretary of the media committee, Garba Shehu, stated."
  },
  {
    "headline": "2023: Niger Governor Directs Aides With Ambition To Resign",
    "summarized_story": "Amid controversy on whether political appointees are to vacate their offices before contesting or not in primaries of the political parties, Niger State government has ordered political office holders aspiring to contest for elective political offices in 2023 to tender their resignation letter.\nThe government in a circular obtained by LEADERSHIP dated 21/3/2022 and signed by the secretary to the state government Ahmed Ibrahim Matane gave all political aspirants who are appointees up to the end of March to tender their resignation.\nMeanwhile, LEADERSHIP has gathered that seven commissioners have notified the government that they were resigning their appointments to contest for political offices.\nIt was learnt that most of them would be contesting for the state House of Assembly and House of Representatives’ seats.\nSupport is reportedly being mobilized for one of the commissioners to become the next governor of the state."
  },
  {
    "headline": "2023: Niger Governor Directs Aides With Ambition To Resign",
    "summarized_story": "Amid controversy on whether political appointees are to vacate their offices before contesting or not in primaries of the political parties, Niger State government has ordered political office holders aspiring to contest for elective political offices in 2023 to tender their resignation letter.\nThe government in a circular obtained by LEADERSHIP dated 21/3/2022 and signed by the secretary to the state government Ahmed Ibrahim Matane gave all political aspirants who are appointees up to the end of March to tender their resignation.\nMeanwhile, LEADERSHIP has gathered that seven commissioners have notified the government that they were resigning their appointments to contest for political offices.\nIt was learnt that most of them would be contesting for the state House of Assembly and House of Representatives’ seats.\nSupport is reportedly being mobilized for one of the commissioners to become the next governor of the state."
  },
  {
    "headline": "Nigeria, UK Launch Device To Tackle Climate Change Registration March 26",
    "summarized_story": "Energy Commission of Nigeria (ECN), the Federal Ministry of Environment and the British High Commission have jointly launched an updated version of the Nigeria Energy Calculator 2050 (NECAL 2050) to tackle climate change.\nJidere Bala, the director-general/ CEO Energy Commission of Nigeria, and various stakeholders.\nAt the event minister of science, technology and innovation, Dr Ogbonnaya Onu, said, “This is an energy planning tool that enables choices in energy development pathway to be examined, along with its environmental consequences.\nThis will be used in planning energy needs for Nigeria’s Vision 2050 and beyond.\nThe British high commissioner to Nigeria, Catriona Laing in her remarks said, “The launch of the Nigeria Energy Calculator 2050 further strengthens bilateral collaboration between the UK and Nigeria on the clean energy transition."
  },
  {
    "headline": "Putin's paper reveals 10,000 Russian soldiers killed in Ukraine, deletes report",
    "summarized_story": "A pro-Kremlin Russian tabloid Komsomolskaya Pravda said nearly 10,000 Russian soldiers have died fighting in Ukraine.\nKomsomolskaya Pravda on Sunday published a story citing Russian Defense Ministry officials who disputed casualty numbers reported by their Ukrainian counterparts.\nThe Ukrainian estimates were followed in the article by figures from the Russian Defense Ministry, which put losses at 9,861 and 16,153 injured.\nThe article published by Pravda, founded in 1925 as a Soviet youth paper, gives a positive account of Russian troops’ progress in southeastern Ukraine.\nHowever, the General Staff of the Armed Forces of Ukraine said in a Facebook post Monday that Russian troops are sustaining “heavy casualties,” deserting or are in “dire need” of repairs to military equipment."
  },
  {
    "headline": "Mr. Ibu seriously sick, refuses to take drugs (Video)",
    "summarized_story": "Nollywood actor and comedian, John Okafar, popularly known as Mr. Ibu is seriously sick, but he has refused to take his drugs.\nA video on his TikTok page showed the comedian in tears, refusing to take drugs administered to him by his daughter.\nMr. Ibu, rather, told his daughter to take the pills on his behalf as he had a phobia of drugs.\nSend him love, dad needs it.”Watch video belowThe 60-year-old actor is considered to be one of Nigeria’s most talented and highly paid comic characters.\nHe has acted in more than 200 Nollywood movies including Mr.Ibu (2004), Mr. Ibu and His Son, Coffin Producers, Husband Suppliers, International Players, Mr.Ibu in London (2004), Police Recruit (2003), 9 Wives (2005), Ibu in Prison (2006) and Keziah (2007)."
  },
  {
    "headline": "BREAKING: MultiChoice Increases Prices Of GOtv, DStv Packages",
    "summarized_story": "The prices of MultiChoice Nigeria’s DStv and GOtv packages have gone up.\nMultiChoice Nigeria is a subsidiary of MultiChoice Africa, the owner of DStv and GOtv in Nigeria.\n“In light of the rising costs of inflation and business operations, we have had to review the price of our packages to keep delighting our customers with great entertainment, anytime and anywhere,” the statement reads.\nTherefore, from April 1, 2022, a new pricing regime for both our DStv and GOtv packages will be in effect.”"
  },
  {
    "headline": "BREAKING: Terrorists Attack Community In Buhari’s Home State, Kill Residents, Abduct Many Others",
    "summarized_story": "BREAKING: Terrorists Attack Community In Buhari’s Home State, Kill Residents, Abduct Many OthersGunmen suspected of being bandits killed at least two people in Mai Bakko village, Sabuwa Local Government Area, Katsina State.\nResidents informed SaharaReporters that the terrorists, known locally as bandits, raided the community Tuesday morning as people were getting ready for prayer and stayed for several hours.\n“The attackers started firing indiscriminately, resulting in the death of the victims,” it was learned when they arrived in the area on motorcycles.\nDespite being President Muhammadu Buhari’s home state, Katsina has seen intermittent attacks by bandits and kidnappers that have taken many lives.\nOn the same day, 84 Islamiyya students from Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area, were kidnapped but later rescued."
  },
  {
    "headline": "Police Take Over Cross River Assembly",
    "summarized_story": "All access to the Cross River State House of Assembly have been blocked by various Nigeria Police Force troops.\nAccording to eyewitnesses, they took positions as early as 6 a.m. Tuesday, according to the DAILY POST.\nA few police officers can also be seen standing near Governor Ben Ayade’s office, which is only a few meters away.\nMotorists and innocent bystanders are finding it impossible to navigate through the mass of security officers, their vans, and other witnesses.\nThe ruling APC had stated that they had asked to the Court for a stay of execution of the judgment while they appealed."
  },
  {
    "headline": "JUST IN: Governor Soludo reveals how much debt he inherited from Willie Obiano",
    "summarized_story": "JUST IN: Governor Soludo reveals how much debt he inherited from Willie ObianoNewly sworn-in Governor of Anambra State, Prof Charles Soludo has revealed the amount of debt he inherited from immediate past governor Willie Obiano.\nSoludo was sworn in on Thursday, taking over from Obiano, who is in the custody of the Economic and Financial Crimes Commission (EFCC) for alleged money laundering.\nSpeaking on Arise TV Tuesday, Soludo said his predecessor, Willie Obiano left N300 million cash and a debt of over N400 billion as at December 2021.\nAccording to Soludo, other financial details from January to date are still unavailable but will be made available as soon as possible because they’re public documents."
  },
  {
    "headline": "VIDEO: Petrol, diesel storage tanks explode in Niger",
    "summarized_story": "A fire outbreak on Monday engulfed a building in Javino, an area of Gauraka in Tafa Local Government Area of Niger.\nWith fuel scarcity in the country, the owner of the goods was said to also store diesel in tanks for sale to customers as ‘black market’.\nThe fire rose to consume other tanks containing fuel and diesel, a few shops around and the roof of a building under construction.\nLinda Albert, one of the eyewitnesses, wants the dealers of such goods taken away from residential area.\nThis is a residential area and imagine if this fire incident started in the night, lives would have been lost,” Albert said."
  },
  {
    "headline": "Breaking: Plateau assembly declares ex-speaker’s seat vacant over defection",
    "summarized_story": "The Plateau State House of Assembly during Tuesday’s plenary declared the seat of the lawmaker representing Jos East constituency Hon.\nIncumbent Speaker of the house, Rt.\nYakubu Sanda, who declared Abok’s seat vacant said the decision was predicated upon a letter from the state chapter of the All Progressives Congress (APC), seeking for the declaration of the seat vaccant.\n“According to the sections of the law, Section 109(1), I therefore declare the seat of Rt.\nAbok vaccant,” Hon."
  },
  {
    "headline": "Npower batch C employment: NASIMS announces kicks off January stipend pay to beneficiaries",
    "summarized_story": "In a bid to put smiles on the faces of Npower Batch C stream 1 beneficiaries, following the delay in their January stipend payment, National Social Investment Management System, NASIMS, has announced that the January Npower stipend payment process has commenced.\n“As a matter of clarity, your January 2022 payment is currently being reviewed and is at the concluding stage.\n“For now, we can’t tell the exact commencement date for payment of January 2022 stipends, But we do know, you will be paid anytime soon.\nAs it is at the moment, NASIMS has only paid four-month stipends to the batch C1 Npower beneficiaries.\nPayment from September to December 2022 has been covered remaining January to February 2022 stipends payment."
  },
  {
    "headline": "Bamise’s Murder: Lagos Govt Arraigns BRT Driver, Court Fixes May 9 For Trial",
    "summarized_story": "The Lagos State Government has arraigned the driver of the Bus Rapid Transport (BRT), Andrew Nice Omininikoron, before the State High Court sitting at Tafawa Balewa Square, TBS.\nHe was arraigned on a 4 count bordering on rape, conspiracy and murder of his passenger, Oluwabamise Ayanwola.\nAccording to the prosecutor, the offences committed is contrary to and punishable under Sections 411, 223, 260 and 165 of the Criminal Laws of Lagos State, 2015.\nFollowing his plea, the DPP asked the court to order a further remand of the defendant at the Ikoyi prison.\nJustice Sonaike subsequently adjourned the case to May 9, 10 and 11, 2022 for commencement of trial."
  },
  {
    "headline": "Bamise’s Murder: Lagos Govt To Arraign BRT Driver Andrew Nice Today",
    "summarized_story": "The Bus Rapid Transport (BRT) driver, Andrew Nice Omininikoron, accused of murdering 22-year-old fashion designer, Oluwabamise Ayanwola, will be arraigned today (on Tuesday) before a Lagos High Court sitting at the Tafawa Balewa Square (TBS) area of the state.\nChannels Television gathered that the suspect would be arraigned before Justice Sherifat Sonaike on a four-count charge of conspiracy, murder, and two counts of rape.\nThe arraignment follows legal advice from the office of the Director of Public Prosecution, Dr Jide Martins, recommending the prosecution of the BRT driver.\nBamise went missing after boarding the BRT bus on Saturday, February 26.\nAndrew Nice Omininikoron, 47, was later arrested at his hiding place at Ososa, Ogun State by operatives of the Department of State Services (DSS)."
  },
  {
    "headline": "Vaccinated Travellers Arriving Nigeria No Longer Required To Take COVID-19 Test – FG",
    "summarized_story": "Fully vaccinated travellers coming into Nigeria will no longer be required to take a pre-departure PCR COVID-19 test.\nThis is according to the Chairman of the Presidential Steering Committee, Boss Mustapha.\nMr Mustapha made the comment on Monday during a briefing of the PSC announcing a revision of International Travel Protocols.\nREAD ALSO: Lagos Lists Alternative Routes Ahead Of Airport Project Commissioning By BuhariHowever, passengers who are unvaccinated or partially vaccinated are still expected to take a COVID-19 PCR test 48 hours before departure, or do a Day 2 and day 7 test on arrival.\nSuch passengers, he said, will be expected to pay for their PCR tests through the Federal Government’s travel platform, while fully vaccinated passengers will not be charged for rapid antigen tests at the airport."
  },
  {
    "headline": "Court Sacks 20 Cross River Lawmakers For Defecting To APC",
    "summarized_story": "A Federal High Court in Abuja has sacked 20 members of the Cross River State House of Assembly for defecting to the All Progressives Congress (APC).\nThe Peoples Democratic Party (PDP) had instituted a suit against the lawmakers over their defection to the APC.\nIn opposing the suit, Mike Ozekhome, counsel to the 4th-25th defendants, had challenged the court’s jurisdiction to hear the suit.\nREAD ALSO: Court Strikes Out Suit Seeking To Halt Umahi’s Removal From OfficeIn his judgement, the presiding judge, Justice Taiwo Taiwo, held that “there is nothing against the law that the suit be heard by this court”.\nThe APC had in their submissions, told the court that the lawmakers are not registered members of their party."
  },
  {
    "headline": "Chinese Recovery Teams Sift Debris Of Crashed China Eastern Jet",
    "summarized_story": "Chinese recovery teams on Tuesday picked through the debris of a crashed China Eastern jet after it inexplicably plummeted from the sky into a mountainside with 132 people on board.\nState media showed uniformed search teams clambering over upturned earth, blasted trees and scattered debris, including a section of plane bearing the carrier’s blue and red livery.\nThe disaster occurred after a high-speed vertical nosedive, according to a video carried by Chinese media.\nChinese media reported that the airline will now ground all the 737-800 jets.\nThe deadliest Chinese commercial flight accident was a China Northwest Airlines crash in 1994 that killed all 160 onboard."
  },
  {
    "headline": "Protesting women defy security, protest at NASS Complex",
    "summarized_story": "Women groups protesting the rejection of gender bills by the two chambers of the National Assembly on Tuesday gained access into the first gate.\nSecurity operatives are preventing them from moving further.\nThe women insisted on being addressed by the leadership of the parliament over their demands, a revisit of the five gender bills, instead of three.\nThe women said they are determined not to settle for less.\nTop on their demand is the reconsideration and passage of the clause seeking additional seats for women at state and federal Parliaments"
  },
  {
    "headline": "Screening of Aspirants for APC National Convention Commences Tuesday",
    "summarized_story": "The All Progressives Congress (APC) National Convention Screening Sub-Committee has invited aspirants for the exercise.\nEmmanuel Chukwuemeka Otagburuagu, the aspirants will be screened in two batches at the Katsina State Governor’s Lodge, Asokoro-Abuja.\nDimeji Bankole, CFR, the Co-Chairman of the APC 2022 National Convention Screening Committee, hereby invites all the Aspirants to the Screening Excercise scheduled as follows:1.\nTuesday 22nd March 2022, Screening of National Chairman and other National Working Committee AspirantsTime: 10 PM.\nWednesday, 23rd March 2022, Screening of Aspirants into the Zonal officesTime: 10amVenue: Katsina State Governor’s Lodge, Asokoro, Abuja.”"
  },
  {
    "headline": "APC Leaders Fully Together, Forge Ahead With Convention -",
    "summarized_story": "The Chairman of the Media Committee of the All Progressives Congress, APC Convention, Governor Abdullahi Sule of Nassarawa State says the party’s Governors have resolved their differences and have put behind them all the bickering witnessed in the recent weeks.\nGovernor Abdullahi Sule who spoke at the formal inauguration of the Media Committee and its various subcommittees said “ the Leadership of the party under Governor Mai Mala and the members of the caretaker committee are making every effort to take everyone along and I believe it is the only path for a successful Convention and victory at elections.\nWe believe in unity in diversity, and this is the mantra of our Convention.”Governor Abdullahi said all is well in the party and the plans for the Convention taking place on the 26th of the are fully on course.\nMeanwhile the Committee has broken into subcommittees that have speedily moved on on their various assignments aimed at delivering a successful Convention six days from today."
  },
  {
    "headline": "President Buhari meets Gov Uzodinma, Power minister, Economic adviser -",
    "summarized_story": "President Muhammadu Buhari has summoned Imo State Governor, Hope Uzodinma and the Minister of Power, Abubakar Aliyu, as well as his Chief Economic Adviser, Prof Doyin Salami, to a meeting at the Presidential Villa on Monday afternoon.\nSenior Special Assistant to the President on Media & Publicity, Garba Shehu disclosed this in a statement.\nHe said President said Buhari is scheduled to meet separately with the Governor and he would be apprised of the latest developments in Imo State, the power sector and the state of the economy.\nThe President had pledged to review security situation in South East Nigeria while reacting to the weekend attack on a Police Station in Owerri and the house of Professor George Obiozor, President General of Ohanaeze Ndigbo.\nHe had also voiced his concern over the frequent power outages, apologising to Nigerians and assuring a quick relief to the situation."
  },
  {
    "headline": "‘Our Products Have Already Reached The US, Brazil, India and Mexico’- Aliko Dangote",
    "summarized_story": "Aliko Dangote, at the commissioning of the Dangote Fertilizer Plant says “The fertilizer plant will reduce import dependency and improve on exports to drive a sustainable economy”,and “Low fertilizer, common reason for low production in the country “"
  },
  {
    "headline": "Buhari Arrives Dangote Fertilizer Plant for Commissioning",
    "summarized_story": "Share on TwitterShare on Facebook1 of 3 - +President Buhari arrives Dangote Fertilizer plant in Ibeju Lekki, to commission the 3 metric tons expandable fertilizing plant."
  },
  {
    "headline": "Russia-Ukraine War: Civilians Fleeing Mariupol Describe Street-to-Street Battles",
    "summarized_story": "Civilians making the dangerous escape from Ukraine’s embattled southern port hub of Mariupol described fleeing through street-to-street gun battles and past unburied corpses as a steady Russian bombardment tried to pound the city into submission.\nThe regained territory allowed Ukrainian forces to retake control of a key highway to the west and block Russian troops from surrounding Kyiv from the northwest.\nRussian President Vladimir Putin’s forces are increasingly concentrating their air power and artillery on Ukraine’s cities and the civilians living there, killing uncounted numbers and sending millions fleeing.\nOlga Nikitina, who fled Mariupol for the western Ukrainian city of Lviv, where she arrived Sunday, said gunfire blew out her windows, and her apartment dropped below freezing.\nTalks between Russia and Ukraine have continued by video but failed to bridge the chasm between the two sides."
  },
  {
    "headline": "Diesel Hike, Energy Crisis May Cause Job Losses, Nigerian Manufacturers Warn",
    "summarized_story": "The Manufacturers Association of Nigeria (MAN) has appealed to the federal and state governments to protect industries from the erratic power supply and hike in price of diesel across the country.\nHe expressed concern that the manufacturing industry was yet to fully recover from the monumental strangulations occasioned by COVID-19 pandemic, while describing the subsisting energy crisis as the exact antithesis of what the industry can’t contain at this time.\nHe lamented that electricity generated from the national grid had recorded no improvement and was hampering the activities of MAN.\nMAN urged the state and federal governments to save the manufacturing sector from imminent collapse, which according to him could be a major catastrophe to the already bad economy.\nIt asked that interest rates on industrial loans be reduced by commercial banks, the widening of the foreign exchange windows to industries and a drastic reduction of interest rates as done with the COVID-19 era palliatives to 2.5 percent."
  },
  {
    "headline": "Russia Bans Facebook and Instagram Under ‘Extremism’ Law, WhatsApp Exempted",
    "summarized_story": "A Russian court has labelled Meta Platforms Inc an “extremist organisation”, banning the activities of the United States company on Russian territory.\nAccess to Meta’s flagship platforms Facebook and Instagram had already been partially limited amid Russia’s attack on Ukraine.\nstricted Russian state media’s ability to earn money on the social media platform and limited access to the RT and Sputnik news outlets across the European Union.\nA court in Moscow has ruled the activities of Instagram and Facebook are “extremist” and banned their operations in Russia.\nEarlier this month, prosecutors called for a criminal investigation into Meta, citing Russian propaganda and extremism laws."
  }
]