[
  {
    "headline": "Tofa: We’ve lost a statesman, says Coalition of Northern Groups",
    "summarized_story": "“We pray the Almighty Allah to overlook his shortcomings, forgive his gentle soul, admit him to Jannah and grant his family the fortitude to bear the loss”, CNG said.\nCopyright PUNCH.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "UCH narrates how Olubadan of Ibadan died, UI mourns",
    "summarized_story": "The University College Hospital, Ibadan has narrated that the Olubadan of Ibadan, Oba Saliu Adetunji, died at the Intensive Care Unit of the hospital at 01.15 am.\n“The late Monarch was referred to the UCH from a private hospital in Ibadan at about 9.30 pm yesterday.\nThe VC noted that Oba Adetunji was an enthusiastic investor and consummate people manager who contributed immensely to the success of many Nigerians.\n“On behalf of the governing council, management, staff, and students of the University of Ibadan, we sincerely commiserate with the Governor of Oyo State, Engr.\nSeyi Makinde, the immediate family of the late Olubadan, Olubadan-in-Council, Central Council of Ibadan Indigenes (CCII), and all Ibadan indigenes and residents.”Copyright PUNCH."
  },
  {
    "headline": "Hustle a curse, it takes God for Igbos to give money – Pastor Biodun Fatoyinbo",
    "summarized_story": "Pastor Biodun Fatoyinbo of Commonwealth of Zion Assembly, popularly known as COZA, has alleged that it is difficult for Igbos to donate money to the church despite their claim of believing in God.\nSpeaking during a sermon at his church in Abuja, Fatoyinbo, however, said they have large hearts but do things at their will.\nIt takes God for an Igbo guy to give.\nNo Church with a Yoruba pastor takes more Igbo songs than COZA.\n“Some people find it hard to give because they hustled to get that money."
  },
  {
    "headline": "Saraki mourns former presidential candidate, Bashir Tofa",
    "summarized_story": "Former Senate President, Bukola Saraki has expressed sadness over the death of Alhaji Bashir Othman Tofa, who was the major challenger of MKO Abiola, during the June 12, 1993, Nigeria presidential election.\nDAILY POST had reported that the former presidential candidate of the defunct National Republican Convention (NRC) died on Monday morning.\nReacting, the former lawmaker described the deceased as an industrialist and a good leader who had contributed to the development of the nation.\nIn a post on his verified Facebook page, Saraki prayed that Almighty Allah gives the family of the deceased the fortitude to bear the loss.\nThe post reads, “Industrialist, politician, and thought leader, during his incredible lifetime, Alhaji Bashir Othman Tofa contributed tremendously towards the development of Nigeria."
  },
  {
    "headline": "Tofa’s contributions to Nigeria’s democracy indelible – Ganduje",
    "summarized_story": "Governor Abdullahi Umar Ganduje of Kano State has mourned the death of Alhaji Bashir Othman Tofa, former Presidential candidate of the defunct National Republican Convention (NRC) in the June 12, 1993 election, saying his contributions to Nigeria’s democracy remains indelible.\nHe said as a businessman, trader and philanthropist, Tofa touched the lives of many people, especially the down-trodden, and expressed the belief that the legacies of the deceased will be approximated for posterity.\n“The legacy of his political beliefs and triumphs will be important footnotes in the literature of Nigeria’s government and politics for generations yet to come.\n“He was a great man, a quintessential democrat and outstanding statesman who has left very hold prints both on the politics and political history of Nigeria,” the statement added.\nThe governor prayed Almighty Allah to grant his soul Aljannah Firdausi and the fortitude for his family, friends and associates to bear the irreparable loss."
  },
  {
    "headline": "Tofa: Nigeria has lost perfect gentleman – Northern speakers’ chairman",
    "summarized_story": "Alhaji Yusuf Ibrahim Zailani, Chairman Northern Speakers Forum and Speaker, Kaduna State House of Assembly, has described as shocking the death of a former presidential candidate, Alhaji Bashir Tofa, saying Nigeria has lost a perfect gentleman.\nIn a statement signed by his Special Adviser on Media and Publicity, Ibrahim Dahiru Danfulani, the Speaker noted, “Nigeria has lost a perfect gentleman.\nThe statement added that Tofa never played do-or-die politics, adding that he was an embodiment of democracy at its finest.\nZailani stated that late Tofa would be deeply missed by all for his silent role in stabilizing the polity.\nHe condoled with his immediate family, the Kano State Government, President Muhammadu Buhari and Nigerians over what he described as a “monumental loss”."
  },
  {
    "headline": "Your failure responsible for zoning calls – Oyedepo blasts Nigerian leaders",
    "summarized_story": "Akogun Iyiola Oyedepo, a chieftain of the All Progressives Congress, APC, in Kwara State, on Monday, faulted the call for zoning of political offices in the country.\nOyedepo ascribed the clamour for zoning of political offices to the failure of the leadership class in Nigeria.\nSpeaking in Ilorin, Kwara State, the APC chieftain stressed that zoning was an unfortunate development.\n“Zoning is an unfortunate development; it is also a result of the failure of leadership, particularly in Kwara State.\n“Same thing with the Kwara North, but I can understand the north, they have suffered perennial neglect for a very long time,” he added."
  },
  {
    "headline": "Why Buhari signed 2022 budget, by Presidency",
    "summarized_story": "The Presidency has explained that President Muhammadu Buhari signed the 2022 budget despite his reservation over the insertion of 6,576 contracts into it by the National Assembly.\nIt also denounced the interpretations of Buhari misgivings about the inclusion of the contracts as a sign of a battle between the Executive and the Legislature.\nSenior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu, said in a statement yesterday, that the President signed the bill in order not to “throw away the baby with the bath water.”Shehu however hinted that amendment to the 2022 Amendment Budget was in the offing.\nPresident was clear and candid in expressing his reservations with the numerous changes to the 2022 Budget made by the National Assembly, which would hamper its implementation.\n”The Executive and the 9th National Assembly have since moved away from the wild, destructive political games of the past, conducting themselves in a way that puts national interest supreme in their decisions.”"
  },
  {
    "headline": "Washington says Sudan still needs civilian-led government",
    "summarized_story": "Washington says Sudan still needs civilian-led governmentFollowing the resignation of Sudanese Prime Minister Abdullah Hamdok, the United States is pushing for the East African country to regain a civilian government.\n“After PM Hamdok’s resignation, Sudanese leaders should set aside differences, find consensus, and ensure continued civilian rule,’’ the U.S. State Department’s Bureau of African Affairs said on Twitter.\nThe long-term strongman was forced out of office in April 2019 by months of mass protests and a military coup.\nThe military and the civilian opposition then agreed on a transitional government to pave the way for democratic elections.\nIn addition, extensive economic reforms were planned, which would have caused the military to suffer considerable economic losses."
  },
  {
    "headline": "Customs generate N188.6bn at Onne Port in 2021 — Official",
    "summarized_story": "The Area two Command of Nigeria Customs Service in Onne Port has collected N188.6 billion from January to December 2021.\nThis was made known on Monday in a statement made available to the News Agency of Nigeria (NAN) by Mrs Ifeoma Ojekwu, Customs Public Relations Officer at Onne Port Command in Rivers.\nThe statement quoted Comptroller Mohammed as saying that the command’s revenue generation in 2021 surpassed the 2020 collection by N69.6 billion.\n“ Indeed, our various meetings with stakeholders and port users paid off in 2021 because we have noted remarkable improvements in compliance levels.\n“In 2022, whoever attempts doing the wrong thing, like smuggling through Onne Port, will get his cargo seized and risks facing arrest for prosecution in accordance with the Customs and Excise Management Act (CEMA)."
  },
  {
    "headline": "Masari didn’t order arrest, detention of any journalist – Aide",
    "summarized_story": "Aminu Masari of Katsina State says he is unaware of the reported arrest and detention of any journalist.\nAlhaji Abdu Labaran, the Director-General Media to the governor said this in a statement issued in Katsina on Sunday night.\nLabaran was reacting to a statement issued by the FCT Chapter of the NUJ accusing Masari of ordering the arrest of one Nelson Omonu of Summit Post newspaper.\nMasari, or, for that matter, any official of the Katsina State government, has not ordered for the arrest or detention of any journalist, in Abuja or anywhere else,” the statement read in part.\n“And the FCT Council is supposed to lead the rest of the councils across the nation."
  },
  {
    "headline": "Former presidential candidate Bashir Tofa, dies at 74",
    "summarized_story": "Former presidential candidate of the defunct National Republican Convention (NRC), Alhaji Bashir Tofa is dead.\nTofa, 74, died on Monday at a hospital in Kano metropolis.\nA brother to the late politician, Alhaji Muhammad, who confirmed the death, said that he passed in the early hours of Monday after a brief illness.\nThe late Tofa contested against the Social Democratic Party (SDP) flagbearer, Chief MKO Abiola in the annulled June 12, 1993, presidential election.\n- Advertisement -Born in June 1947, Tofa was also the Chairman of the Kano Elders Forum and a chieftain of the All Progressives Congress (APC)."
  },
  {
    "headline": "How Bashir Tofa died in Kano",
    "summarized_story": "BY DESMOND MGBOH, KANOOne of the leading candidates in the 1993 Presidential election, Alhaji Bashir Tofa, has diedFamily sources said the former presidential candidate died in the early hours of Monday after a protracted illness.\nAlhaji Tofa was the Presidential candidate of the defunct National Republican Convention and a major challenger of Chief MKO Abiola’s in the controversial June 12, 1993, presidential election, annulled by the military government of General Ibrahim Babangida.\nTofa was born in Kano to a Kanuri family on June 20, 1947.\nHe had his primary education at Shahuci Junior Primary, Kano, and then continued studies at City Senior Primary School in Kano.\nAfter completing his studies at the Provincial school, he worked for Royal Exchange Insurance company from 1967 to 1968."
  },
  {
    "headline": "Lekan Balogun tipped as successor as Olubadan dies",
    "summarized_story": "The fact that Oba Adetunji was produced by the Balogun Lineage has automatically positioned the Otun Lineage to produce the next Olubadan.\nIn this instance, the four most senior chiefs on the Otun Line are Senator Balogun as the Otun Olubadan; Senator Rashidi Ladoja, former governor of Oyo State, as Osi Olubadan; Eddy Oyewole as Ashipa Olubadan and Abiodun Kola-Daisi, as Ekerin Olubadan.\nBuhari, Kalu, Tinubu, Dare pour tributes, encomiumsEminent Nigerians have paid glowing tributes on the late Olubadan.\nIn a condolence message released by his Media Office and signed by Mr. Tunde Rahman, Asiwaju Tinubu said:“The late Olubadan was a sage.\n“On the throne, the late Olubadan worked assiduously for peace and stability of not only Ibadanland, Oyo State and Yorubaland, but also the entire country."
  },
  {
    "headline": "MBF, Arewa, Afenifere, Ohanaeze, MBF set agenda for Buhari – The Sun Nigeria",
    "summarized_story": "The Ohanaeze Ndigbo, the Middle Belt Forum (MBF), the Yoruba socio-cultural group, Afenifere and the Arewa Consultative Forum were among groups and individuals who, yesterday, advised the APC-led Federal Government on what to do to bring about peace as the New Year dawns.\nSpecifically, the MBF decried the plight of people of the Middle Belt who have continued to suffer severe and persistent attacks from marauding gangs of murderous herdsmen.\n“These killings have become the trend in many parts of the Middle Belt region of southern Kaduna, Niger, Plateau, Benue, Adamawa, among others.\nWhen innocent and vulnerable people are left unprotected from the terror of criminals, there can be no option left than self-defence,” Its National President, Dr. Pogu Bitrus, in a statement, yesterday.\nThe forum called on relevant security agencies not to relent in cleansing the Middle Belt communities of terrorists who take pleasure in kidnapping, destroying communities and dislocating people."
  },
  {
    "headline": "Okpella on warpath with Edo govt over airport project",
    "summarized_story": "From Tony Osauzo, BeninThe siting of a proposed airport in Edo North is generating drum beats of war between limestone-rich Okpella community in Etsako East Local Government Area and the state government.\nOkpella community, at a press conference, yesterday, alleged marginalisation by the government, stressing that any attempt to site the proposed airport project outside the community, would be a disservice to them.\n“To our surprise, a letter from the Federal Ministry of Aviation (FMA) dated December 16, 21 with reference number FMA/ADD/402/5.42/C.9/12 conveying approval for an airport project, wrongly mentioned Okpella as being part of Etsako West Local Government Area.\n“But if otherwise, we cannot guarantee the peaceful co-existence between the investors and the community unless Okpella ceases to be their host community.\n“We demand that nothing negative or untoward be done by government to disrupt or distort the industrial harmony and peace currently prevailing in our community,” the Okpella community said."
  },
  {
    "headline": "Why PDP can’t fail to rescue Nigeria –Wike",
    "summarized_story": "Wike said he had chosen the New Year to visit the Abia State governor because of the quality of friendship they share both on official and personal level.\nHe said Ikpeazu had championed the need for a change in the previous leadership of PDP to align with the expectations of Nigerians.\nWike described Ikpeazu as a man of character and a faithful ally who supported him when it mattered most and never allowed him to be disgraced.\nHe also described Ikpeazu as a true believer in the Nigerian project who supported everything that would foster the development of the country.\nHe said in Abia State, the people shared in Governor Wike’s concern for a better Nigeria and the need to rescue the country from the brinks."
  },
  {
    "headline": "NFF to Deny Unvaccinated Journalists Access to Eagles Training",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Nigeria Football Federation (NFF) has made the possession of COVID-19 vaccination cards mandatory for journalists wishing to cover the Super Eagles training session at the Moshood Abiola National Stadium, Abuja.\n“We appreciate you for positively projecting our darling team, the Super Eagles.\n“There will be full media access to the team’s training today, 3rd January, 2022 from 5pm.\nThere will also be 15 minutes access to all players and officials after the training.\n“In strict adherence to COVID-19 protocols, everyone will present their COVID-19 vaccination cards or PCR Test result (72hrs maximum) at the gate,” the statement said."
  },
  {
    "headline": "Breaking: Bashir Tofa, Ex-presidential Candidate, is Dead",
    "summarized_story": "By Ibrahim Shuaibu in KanoAlhaji Bashir Othman Tofa, presidential candidate of the defunct National Republican Convention (NRC) in the June 12, 1993 election, is dead.\nTofa, according to family sources, died at the Aminu Kano Teaching Hospital (AKTH) in the early hours of Monday after a brief illness.\nConfirming his death, one of the deceased relations, said: “Alhaji Bashir Tofa died after a brief illness.”Tofa was the challenger of late Chief MKO Abiola, candidate of the defunct Social Democratic Party (SDP), winner of the June 12 election.\nThe result of the election, which was not fully released officially, was annulled by the military regime of President Ibrahim Babangida.\nBorn on June 20, 1947 in Kano, the late Tofa was also a businessman, oil trader and industrialist."
  },
  {
    "headline": "2019 Audit Report: 178,459 Firearms, Ammunition Missing from Police Armoury",
    "summarized_story": "The report accused the Nigeria Police headquarters of lacking comprehensive details of unserviceable weapons, lamenting that such could fall into unauthorised hands for illegal use.\nThe AuGF report stated, “Audit observed from the review of Arms Movement Register, Monthly Returns of Arms and Ammunition and Ammunition Register at the Armoury section that a total number of lost firearms as reported as at December 2018 stood at 178,459 pieces.\nFormal report on the loss of firearms through dully completed Treasury Form 146 (loss of stores) were not presented for examination.\n“Records obtained from force armament at the Force headquarters showed 21 Police Mobile Force (PMF) Squadron, Abuja, did not report a single case of missing firearm, whereas, schedule of missing arms obtained from the same PMF showed a total number of forty six (46) missing arms between year 2000 and February 2019.\n“The above anomalies could be attributed to weaknesses in the internal control system at the Nigeria Police Force Armament."
  },
  {
    "headline": "It’s War Clearing Goods at Ports, Organised Private Sector Tells FG",
    "summarized_story": "The leaders of the real sector spoke in separate chats with THISDAY.\nThey noted that removing hindrances to the activities of manufacturers and other key players in the country’s real sector would enhance productivity, especially as Africa prepares to fully implement the African Continental Free Trade Area (AfCFTA).\nSome of the major constraints they asked the government to address included low FX supply and poor electricity to the real sector, challenges at the country’s seaports, and low patronage of made in Nigeria goods.\nThe Nigeria Customs Service (NCS) is always like never wishing us to clear our goods at a time meant for them to be cleared.\nAjayi-Kadir said stakeholders from the private sector should be nominated to monitor the disbursement of forex by commercial banks to ensure transparent and timeous allocation to bona fide manufacturers."
  },
  {
    "headline": "With $130trn Tied to Renewables Globally, Nigeria Walks Tight Rope in Bid for Oil Sector Investment",
    "summarized_story": "In its oil and gas outlook for 2022, Wood Mackenzie predicted that record cash flows would come under increasing scrutiny as operators would begin to align with their pledges on decarbonisation.\n“Financing oil and gas was getting harder before COP26, but the pressure will ratchet up in 2022.\nOf more concern is the possibility that the development of new discoveries may be prohibited,” Wood Mackenzie noted.\nAt a projected 1.86 million barrels daily oil production in the country’s 2021 budget, Nigeria recorded a huge deficit of almost 200 million barrels of the liquid in the first 11 months of last year.\nFigures from the NURPC obtained by THISDAY last week indicated that while Nigeria was expected to pump approximately 635 million barrels of oil by November 2021, it only struggled to produce 441 million barrels for the entire period."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "I'll Clean Up El-Rufai’s Mess, Shehu Sani Says After Joining Kaduna Governorship Race",
    "summarized_story": "A former lawmaker representing Kaduna Central Senatorial District at the National Assembly, Shehu Sani, has indicated interest to join the governorship race in 2023.\nThe lawmaker disclosed this while speaking during a radio interview in Kaduna on Saturday.\nSani said he was joining the race to rescue the state from the mess that had been created by Governor Nasir el-Rufai.\nThis is what my supporters wanted and I trust them.\nTherefore, I call on the people of Kaduna to support and collaborate with me."
  },
  {
    "headline": "I'll Clean Up El-Rufai’s Mess, Shehu Sani Says After Joining Kaduna Governorship Race",
    "summarized_story": "A former lawmaker representing Kaduna Central Senatorial District at the National Assembly, Shehu Sani, has indicated interest to join the governorship race in 2023.\nThe lawmaker disclosed this while speaking during a radio interview in Kaduna on Saturday.\nSani said he was joining the race to rescue the state from the mess that had been created by Governor Nasir el-Rufai.\nThis is what my supporters wanted and I trust them.\nTherefore, I call on the people of Kaduna to support and collaborate with me."
  },
  {
    "headline": "OBITUARY: Bashir Tofa, MKO Abiola's opponent who rejected declaration of June 12 as Democracy Day",
    "summarized_story": "Yet Tofa, who died at 74, is beyond just another “opponent” in Nigerian politics but a businessman and industrialist.\nIt was in 1976 Tofa began his political journey after he was elected the councillor of Dawakin Tofa LGA in Kano.\nJUNE 12 ELECTIONDuring the build-up to the 1993 election, Tofa was relatively unknown in other parts of the country except for his base in Kano.\nDespite the Social Democratic Party (SDP) choosing Abiola, who was popular across the country, Tofa inexplicably was selected NRC candidate ahead of more popular aspirants.\n“I have never supported the rotational presidency for the simple fact it is an idea that will never promote unity amongst Nigerians."
  },
  {
    "headline": "OBITUARY: Bashir Tofa, MKO Abiola's opponent who rejected declaration of June 12 as Democracy Day",
    "summarized_story": "Yet Tofa, who died at 74, is beyond just another “opponent” in Nigerian politics but a businessman and industrialist.\nIt was in 1976 Tofa began his political journey after he was elected the councillor of Dawakin Tofa LGA in Kano.\nJUNE 12 ELECTIONDuring the build-up to the 1993 election, Tofa was relatively unknown in other parts of the country except for his base in Kano.\nDespite the Social Democratic Party (SDP) choosing Abiola, who was popular across the country, Tofa inexplicably was selected NRC candidate ahead of more popular aspirants.\n“I have never supported the rotational presidency for the simple fact it is an idea that will never promote unity amongst Nigerians."
  },
  {
    "headline": "CLOSE-UP: The man who would become next Olubadan of Ibadan",
    "summarized_story": "Just as the world was celebrating the transition to a new year, news filtered in that Salihu Adetunji, the Olubadan of Ibadan, had passed on.\nAdvertisementAdetunji, who was crowned as the 41st Olubadan in March 2016, died at the University College Hospital, Ibadan, Oyo state in the early hours of Sunday.\nAdvertisementIn the hierarchy of Ibadan chiefs, Lekan Balogun, a former senator and currently the Otun Olubadan, who is the second-in-command to the throne, is next in line to be king.\nOther Ibadan chiefs include Rashidi Ladoja, former governor of Oyo and the Osi Olubadan; Owolabi Olakulehin, Balogun Olubadan; Olufemi Olaifa, Otun Balogun; ‎Eddy Oyewole, Ashipa Olubadan; Tajudeen Ajibola, Osi Balogun; Amidu Ajibade, Ekaarun Olubada; Lateef Gbadamosi, Ashipa Balogun Olubadan; Kola Adegbola, Ekarun Balogun‎, and Abiodun Kola-Daisi, Ekerin Olubadan‎.\nWHO IS LEKAN BALOGUN?"
  },
  {
    "headline": "CLOSE-UP: The man who would become next Olubadan of Ibadan",
    "summarized_story": "Just as the world was celebrating the transition to a new year, news filtered in that Salihu Adetunji, the Olubadan of Ibadan, had passed on.\nAdvertisementAdetunji, who was crowned as the 41st Olubadan in March 2016, died at the University College Hospital, Ibadan, Oyo state in the early hours of Sunday.\nAdvertisementIn the hierarchy of Ibadan chiefs, Lekan Balogun, a former senator and currently the Otun Olubadan, who is the second-in-command to the throne, is next in line to be king.\nOther Ibadan chiefs include Rashidi Ladoja, former governor of Oyo and the Osi Olubadan; Owolabi Olakulehin, Balogun Olubadan; Olufemi Olaifa, Otun Balogun; ‎Eddy Oyewole, Ashipa Olubadan; Tajudeen Ajibola, Osi Balogun; Amidu Ajibade, Ekaarun Olubada; Lateef Gbadamosi, Ashipa Balogun Olubadan; Kola Adegbola, Ekarun Balogun‎, and Abiodun Kola-Daisi, Ekerin Olubadan‎.\nWHO IS LEKAN BALOGUN?"
  },
  {
    "headline": "Mbaka: There was a plot to kill me after I was summoned by Enugu Catholic bishop",
    "summarized_story": "Ejike Mbaka, spiritual director of Adoration Ministry Enugu Nigeria (AMEN), has alleged there was a plot to kill him after he was summoned by the Catholic Diocese of Enugu in May 2021.\nAdvertisementMbaka disclosed this when he addressed worshippers at the Adoration ground in Enugu on Saturday.\nIn May, some residents of Enugu took to the streets to protest over the whereabouts of Mbaka who was alleged to be missing.\nI was asked to just move somewhere else other than Adoration ground or my house.\nThen, they will take me to Abuja and the story will be much, they will kill themselves, not me.”"
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "Nigerian cinemas shed pandemic blues earns N2.4bn in 2021 ticket sales",
    "summarized_story": "Nigeria’s cinema industry emerged stronger from the ravages of a global pandemic last year with ticket sales doubling figures realized in 2020.\nThe total weekend movie ticket sales rose by 100 percent to N2.4 billion in 2021 from N1.2 billion in 2020 according to data by the Cinema Exhibitors Association of Nigeria (CEAN).\nHowever, this figure was 41.5 percent lower than the N4.1 billion recorded as ticket sales in 2019.\nIn the past, Nigerians converged at cinemas to watch foreign movies but recently, people are beginning to appreciate the local movies at the cinemas.\nAccording to CEAN data, cinemas made N20.6 million from movie ticket weekend sales in the month of September 2020."
  },
  {
    "headline": "Mafab Communications, MTN face 4 hurdles ahead 5G deployment",
    "summarized_story": "MTN Nigeria and Mafab Communications may have secured the provisional license bag for the 5G spectrum at the cost of $273 million, but there are still hurdles to face.\nFour of these hurdles may include meeting the condition for payment, unfinished business with right of way charges and state policies, power generation, and economic case for 5G.\nIf the volatility rates continue MTN Nigeria and Mafab are likely to pay close to or more than N200 billion for the licence.\nIn countries where broadband penetration is at its peak, it would be easy to present a solid economic case for 5G.\nExperts however project that MTN Nigeria is in a better position to prove the economic case for 5G In the long run."
  },
  {
    "headline": "Nigeria will need more than oil to lift economy",
    "summarized_story": "Nigeria will need more than oil to lift economyNigeria will get another chance this year to lay the building blocks of a long-touted transition away from oil and finally set the economy on the path to robust growth.\nIn the first quarter, public sector jobs were negative -3,038 as against the 79,465 jobs created in formal (21,477 jobs) and informal jobs (61,026 jobs).\nThe oil sector of Africa’s largest economy marked its sixth consecutive period of contraction in the third quarter of 2021, thanks to poor crude oil production capacity.\n“Already, the country has fallen behind Libya in terms of output.”While the oil sector continues to be a major source of the Federal Government’s revenue and export, the contribution of the oil sector to the economy (7.5%) has continually shrunk.\nThe country’s crude oil production has been languishing at only two-thirds of its full capacity this year, especially many of its large oil fields in the Niger Delta."
  },
  {
    "headline": "Obaseki mourns death of ex-Edo sports commissioner, Brown Ebewele – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has mourned the passing of former Edo State Sports Commissioner, Brown Ebelewe.\nMr. Ebewele, whose death was reported at the weekend was an Olympian and former National Champion, and was part of the Edo delegation to the 20th edition of the National Sports Festival, which held in Benin.\nObaseki, who bemoaned the tragic loss, said Ebewele’s passing was painful, as he still had a lot to offer Edo State and the country in general.\nAccording to Obaseki, “I am saddened by the news of the passing of seasoned sportsman and sports administrator, who made indelible contributions to the development of sports in the old Bendel State and also in Edo State.\nObaseki extended his condolences to the Ebewele family, the sports community as well as friends and associates of the deceased, praying that God will grant all the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Obaseki charges politicians on service delivery, quality representation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has charged politicians on quality and efficient representation, urging them to ensure effective service delivery to their constituents.\nObaseki, who spoke to journalists in Benin City, urged politicians to represent and speak for the people who voted them into power, rather than any godfather.\nAccording to him, “Our politics has changed, as we don’t play politics of stomach infrastructure.\nAccording to him, “Change is difficult but it must come from Oredo.\nPolitics should not be practiced that way going forward."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "CBN to improve access to credit for households, businesses in 2022",
    "summarized_story": "The Central Bank of Nigeria (CBN), says the banking sector will increase access to loans for Nigerian households and businesses in 2022.\nCBN governor, Mr. Godwin Emefiele who disclosed this in a statement emphasized the need for all stakeholders to work to build a more resilient economyAccording to him, the objective of the central bank in 2022 would be to increase access to loans for households.\n“The policy focus of the bank for 2022 is with a pledge to sustain improved access to finance and credit for households and businesses, mobilise investment to boost domestic productivity, enable faster growth of non-oil exports, and support employment generating activities,” Emefiele said.\nThe CBN governor noted that one of the vital lessons learned from the COVID-19 outbreak was the need to make conscious measures to diversify Nigeria’s economic base.\nEmefiele also said that all necessary approvals had been obtained for the Infrastructure Corporation to begin operations in early 2022"
  },
  {
    "headline": "Oyetola, Osun speaker mourn Obi, ex-military administrator",
    "summarized_story": "Adebayo ObajemuOsun State governor Adegboyega Oyetola on Sunday mourned the death of a former Military Administrator in the state, Anthony Obi, saying his death was painful.\nThe ex military administrator passed away on January 1.\nMr Oyetola, in a statement signed by his media aide, Ismail Omipidan, on Sunday in Osogbo, expressed sadness at the death of Mr. Obi and sent his condolences to his family.\nHe said that the late Mr Obi was one of the leaders, who laid the foundation of the state.\nSimilarly, Speaker of Osun House of Assembly, Timothy Owoeye, in his condolence message, said the late Mr Obi would be greatly missed."
  },
  {
    "headline": "2023: Gov Ikpeazu endorses Anyim Pius Anyim for President",
    "summarized_story": "Abia State governor, Dr. Okezie Ikpeazu has endorsed the presidential aspiration of former president of the senate, Anyim Pius Anyim ahead of the 2023 general election, noting that he is the ideal candidate for Nigerian president of Igbo extraction.\nThe governor stated this on Sunday at his country home in Umuobiakwa, Obingwa Local Government Area of the state, when he received Anyim who visited him.\nHe described Anyim as “a man whose public service credentials and experience are good enough for the Presidency of Nigeria”.\nThe Abia governor who joins other stakeholders of the Southeast to endorse Anyim, assured the former secretary to the government of the federation of his support.\nHe noted that what matters now is “just for the Igbo to be given a chance to produce the next Nigerian President”."
  },
  {
    "headline": "Alex Otti Builds New Council Hall, Pushes for Greater Unity, Development in Isialangwa South",
    "summarized_story": "The memories of the 2020 Ehi na Uguru Day celebration were brought back to life on Friday 31st December, 2021 as the 2021 Edition of Ehi na Uguru Day came to a successful completion.\nBasking from the euphoria of the successful 2020 event, the people’s enthusiasm to return home and be part of the 2021 event clearly manifested as this year’s event witnessed a massive turnout of people.\nThere were also several winners of individual cash prizes in the Bicycle competition.\nHe made reference to the Eleven Kilometre Isieketa Mbawsi road attracted by the renowned economist which has brought tremendous development and made life more bearable for the people, and stated that he felt fulfilled by the Construction of the Council Hall which Otti singlehandedly executed and equipped.\nThe highly excited people of the different communities joined Dr. Alex Otti, 12 Traditional Rulers, and community leaders from different parts of Ngwa Land to commission the New Council Hall built and equipped by Dr. Otti."
  },
  {
    "headline": "Gov Uzodinma To Name Sponsors Of Insecurity In Imo Tuesday",
    "summarized_story": "Imo State governor, Hope Uzodinma, will publicly name those behind the spate of insecurity in the state on Tuesday.\nThe State Commissioner for Information and Strategy, Hon.\nDeclan Emelumba, disclosed this in a statement in Owerri, the capital of Imo State on Sunday.\nEmelumba said the governor will use the occasion of the 6th edition of Imo Stakeholders Forum to name those who are sponsors and financiers of insecurity in the state.\nADVERTISEMENTHe, therefore, urged all those invited to the ceremony to be punctual before the arrival of the state governor."
  },
  {
    "headline": "2022 Budget Insertions: No Rift Between Buhari, NASS – Presidency",
    "summarized_story": "Happily, the 9th National Assembly is more about policy than politics.\nOngoing Capital Projects, Critical Recurrent Votes, Priority New Projects – all feature in the 2022 Budget and Mr. President’s forbearance in assenting to the Budget will save these provisions from implementation delays and other challenges.\nThe presidential spokesman further stated that President Buhari is a democrat who deeply believes in the supremacy of the Constitution, with its checks and balances across the three arms of Government.\nAccording to him, in terms of the passage of legislations like the Appropriation Act and other Money Bills, the National Assembly has equal responsibilities with the Executive.\n“It is hoped that the National Assembly will carefully consider and approve the 2022 Amendment Budget Proposals, once presented to them in due course, for the benefit of all Nigerians."
  },
  {
    "headline": "Buni Bags ‘Authentic Man Of The Year’ Award, Blueprint Deputy Online Editor, Others Shine",
    "summarized_story": "Kaduna-based multiple award winning online news medium, Authentic News Daily, has announced winners of the seventh edition of its prestigious annual awards for the year 2021.\nThe organisation also named the Deputy Online Editor of Blueprint Newspaper, Bode Olagoke, as the Journalist of the Year 2021.\nAccording to the statement, the Governor-elect of Anambra State, Prof. Charles Soludo, is the ‘Authentic Politician of the Year’.\nThe statement congratulated the winners, while urging them to keep up the good works that earned them the recognition.\nOther awardees include; Rivers State governor Nyesom Wike and his Gombe counterpart, Inuwa Yahaya as ‘Authentic Governors of the Year’, while Kaduna State Assembly Speaker, Hon."
  },
  {
    "headline": "Buni Bags ‘Authentic Man Of The Year’ Award, Blueprint Deputy Online Editor, Others Shine",
    "summarized_story": "Kaduna-based multiple award winning online news medium, Authentic News Daily, has announced winners of the seventh edition of its prestigious annual awards for the year 2021.\nThe organisation also named the Deputy Online Editor of Blueprint Newspaper, Bode Olagoke, as the Journalist of the Year 2021.\nAccording to the statement, the Governor-elect of Anambra State, Prof. Charles Soludo, is the ‘Authentic Politician of the Year’.\nThe statement congratulated the winners, while urging them to keep up the good works that earned them the recognition.\nOther awardees include; Rivers State governor Nyesom Wike and his Gombe counterpart, Inuwa Yahaya as ‘Authentic Governors of the Year’, while Kaduna State Assembly Speaker, Hon."
  },
  {
    "headline": "Lawan Hails Abia Traditional Ruler, Ikonne, At 93",
    "summarized_story": "The Senate President, Ahmad Lawan, has sent his felicitation to a former chairman, Abia State Traditional Rulers’ Council, HRH Dr Isaac Ikonne, Enyi 1 of Aba, Abia State, on his 93rd birthday anniversary.\nLawan, who is also a titleholder of Onyentukwasi Obi 1 of Aba, joined family members, friends, associates, other traditional rulers and well wishers to rejoice with His Royal Majesty on the auspicious occasion.\nA statement signed by the media adviser to the Senate President, Ola Awoniyi, on Sunday, quoted Lawan as saying: “I felicitate with His Royal Highness, Eze Isaac Ikonne, Enyi 1 of Aba on his 93rd birthday.\n“I congratulate him for God’s blessings of longetivity and for being in good health to witness this day.\nADVERTISEMENT“His Royal Majesty has been a man of peace, with useful counsel to constituted authourities and I pray that his domain will continue to witness peace and development throughout his reign.”The Senate President once again wished the paramount ruler a happy celebration."
  },
  {
    "headline": "Anyim mourns Olubadan, says he was a patriotic Nigerian",
    "summarized_story": "Oyo StateCONDOLENCE ON THE DEATH OF HIS IMPERIAL MAJESTY, OBA SALIU ADETUNJI, THE OLUBADAN OF IBADANI have received with sadness, news of the death of our highly respected traditional ruler, His Imperial Majesty, Oba Saliu Adetunji, the Olubadan of Ibadan.\nLet me convey to your Excellency, the family of His Royal Majesty and the good people of Ibadan, my deepest condolences on this sad event.\nLate Oba Adetunji was a patriotic Nigerian who was deeply committed to the peace, unity and development of our country.\nHis nearly six years on the throne brought peace and great development to his kingdom and the entire Oyo state.\nI pray that the Lord will comfort his family and grant his soul eternal rest in His bosom."
  },
  {
    "headline": "Anyim mourns Olubadan, says he was a patriotic Nigerian",
    "summarized_story": "Oyo StateCONDOLENCE ON THE DEATH OF HIS IMPERIAL MAJESTY, OBA SALIU ADETUNJI, THE OLUBADAN OF IBADANI have received with sadness, news of the death of our highly respected traditional ruler, His Imperial Majesty, Oba Saliu Adetunji, the Olubadan of Ibadan.\nLet me convey to your Excellency, the family of His Royal Majesty and the good people of Ibadan, my deepest condolences on this sad event.\nLate Oba Adetunji was a patriotic Nigerian who was deeply committed to the peace, unity and development of our country.\nHis nearly six years on the throne brought peace and great development to his kingdom and the entire Oyo state.\nI pray that the Lord will comfort his family and grant his soul eternal rest in His bosom."
  },
  {
    "headline": "Criticism trails EbonyLife’s Chief Daddy 2 on Netflix",
    "summarized_story": "Since its release on Netflix on New Year’s Day, Nollywood comedy film Chief Daddy 2: Going for Broke has largely been panned by movie-watchers and critics.\nThe film, directed by Niyi Akinmolayan and produced by EbonyLife’s Mo Abudu, is a sequel of the original Chief Daddy film, which premiered in 2018.\nThe original film follows a ragtag group of immediate and extended family members as they struggle to claim a part of the wealth left behind by the titular Chief Daddy.\n“This Chief Daddy 2 strategy is working.\nMake everyone want to watch it to confirm it’s terrible,” the user tweeted."
  },
  {
    "headline": "Tiwa Savage’s ex-husband, Teebillz welcomes another child with lover",
    "summarized_story": "Talent manager, Tunji ‘Teebillz’ Balogun, has announced the addition of another son to his life.\nTeebillz, who was married to Nigerian singer, Tiwa Savage, took to his Instagram page on Sunday to announce that he was happy to be a father again.\nKing Zayn.”See post below:The music executive had announced the birth of a son three months ago in October 2021.\nIt was reported that his first marriage to Kenea Udoh, Teebillz had two children and his union with Tiwa Savage produced her son, Jamil Balogun.\nThough the number of children by the talent manager is not certain, Teebils had last year appreciated his lover for taking care of his five children named Khalil, Gaetano, Jamil, Bisi, and Ona."
  },
  {
    "headline": "Bisi Akande wrote nonsense: Olu Falae",
    "summarized_story": "Chief Olu Falae, former Secretary to the Government of the Federation, has slammed Chief Bisi Akande’s portrayal of his role in the 2014 National Constitutional Conference (CONFAB).\nHe described Akande as a reckless individual who wrote “nonsense”.\nHe said his passion for a new and better Nigeria was the reason he attended the national conference, contrary to Akande’s allegation.\nAkande had claimed that Falae, including Ayo Adebanjo and others attended the CONFAB due to mouth-watering allowances doled out by former President Goodluck Jonathan.\n“I have decided not to say a word about the nonsense which Akande wrote."
  },
  {
    "headline": "Fred Oghenesivbe begs Gov. Okowa for forgiveness",
    "summarized_story": "Fred Oghenesivbe, the erstwhile Executive Assistant on Communications to Governor Ifeanyi Okowa of Delta State, who was sacked last week over insubordination, has begged the governor for forgiveness.\nOghenesivbe was sacked after he alleged that Okowa didn’t treat him fairly for the past five years he has worked with him.\nOghenesivbe said he got two 25kg bags of rice and N50,000 out of the recent N25m released by Okowa to his media team.\nthe Governor of Delta State, and did not provoke media uprising.\nIt fell into the hands of one of my core detractors and before it could be deleted, he went virile with it on social media."
  },
  {
    "headline": "Gunmen Kill APC Party Chieftain In Akwa Ibom On His Way Home From Crossover Service",
    "summarized_story": "Otu Inyang, a chieftain of the All Progressives Congress in Akwa Ibom State, was assassinated by gunmen suspected of being hired assassins.\nWhen he was quite close to his home, the late politician was ambushed by his killers, who fired six shots into his head.\nI knew Elder Otu Inyang very well, back in our days in ANPP 2000 – 2003 when he helped us build a formidable opposition party.\n“The command has received such report and it is unfortunate.\nSo, we are on top of the situation and I want to assure you that the culprits will not escape,” he said."
  },
  {
    "headline": "2023 Elections Under Threat If Buhari Fails To Address Insecurity In Remaining Months — Coalition Of Northern Groups",
    "summarized_story": "The CNG said, “In the North especially, government should, with the entire national resolve behind its efforts, work to achieve final disengagement, disarmament, demobilisation, reintegration and reconstruction within the next few months.\nUnless this is done as quickly as possible, the 2023 elections would be greatly threatened and that would in turn affect the nation’s democratic progress and set the country back several decades.\n“No nation can aspire to greatness or seek to remain secure and safe when its youth and the productive segments of society are left to indulge in self-destructive practices like drug and substance abuse.\n“Failure to do so will indubitably mean that every effort made in isolation will defeat all the endeavours and render the task of ending the crisis the more difficult and futile.\n“Every one of us must therefore become a stakeholder and a committed actor in this struggle to free our society and our country of this debilitating problem.”"
  },
  {
    "headline": "BREAKING: MKO Abiola Challenger, Bashir Tofa Is Dead",
    "summarized_story": "The Presidential Candidate of the defunct National Republican Convention (NRC), Alhaji Bashir Othman Tofa is dead.\nTofa was MKO Abiola’s major challenger in the controversial June 12, 1993, presidential election, annulled by the military government of General Ibrahim Babangida.\nAccording to family sources, he died in the early hours of Monday after an illness.\nConfirming his death, one of the deceased’s relations, Alhaji Muhammad, said “Alhaji Bashir tofa died after being admitted in hospital for sometime.”"
  },
  {
    "headline": "Olubadan Stool: Ex-Oyo Senator, Lekan Balogun To Succeed Oba Adetunji",
    "summarized_story": "According to the DAILY POST, a former Oyo State senator, High Chief Mashood Olalekan Balogun, would succeed the immediate past Olubadan of Ibadan land, Oba Saliu Akanmu Adetunji.\nThe departed monarch, Oba Adetunji of the Balogun line, was the Balogun of Ibadan territory till his installation.\nAccording to our source, ascension to the Olubadan stool begins with installation from Mogaji and continues with promotion to either Ajia Balogun of Ibadan land or Ajia Olubadan of Ibadan territory.\nAccording to DAILY POST, he will succeed the monarch in accordance with Ibadan tradition.\nHigh Chief Mashood Olalekan Balogun – Otun OlubadanHigh Chief Akinloye Owolabi Olakunlehin – Balogun of IbadanlandHigh Chief Tajudeen Abimbola Ajibola – Otun Balogun of IbadanlandHigh Chief Senator Rashidi Adewolu Ladoja – Osi OlubadanHigh Chief Eddy Oyewole – Asipa OlubadanHigh Chief Lateef Gbadamosi Adebimpe – Osi BalogunHigh Chief Abiodun Kola-Daisi – Eekerin OlubadanHigh Chief Salaudeen Hamidu Ajibade – Eekarun Olubadan"
  },
  {
    "headline": "Breaking: Popular Nigerian singer is dead",
    "summarized_story": "Popular Nigerian singer, Joshua Olonitan, popularly known as Slim Joe, has died at the age of 30.\nThe famous singer of ‘O ti Yanyan’ reportedly died on Sunday, after a prolonged battle with kidney disease.\nThe death of the late artist was confirmed on Monday, by his colleague, Raymond Gbaji via his Facebook handle, where he penned a touching tribute to Olonitan.\nThe versatile entertainer, who hails from Odo-Ayedun in Ikole Local Government Area of Ekiti State, had been on dialysis for some time after he was diagnosed with kidney failure."
  },
  {
    "headline": "Breaking: Another ex-presidential candidate is dead",
    "summarized_story": "The presidential candidate of the National Republican Convention (NRC), during the 1993 presidential election, Alhaji Bashir Othman Tofa, has passed on.\nAccording deceased relation, Tofa died in the early hours of Monday at the Aminu Kano Teaching Hospital (AKTH) after a protracted illness.\nTofa died few months after Obadiah Mailafia, a former presidential candidate of the African Democratic Congress (ADC), in the 2019 general elections was confirmed dead and buried.\nAlhaji Tofa was a rival of late MKO Abiola in the June 1993 presidential election.\nIn the later annulled election, he lost his Kano home state to the winner Abiola, the candidate of the Social Democratic Party."
  },
  {
    "headline": "Breaking: Ex-Osun state governor is dead",
    "summarized_story": "The family of former military governor of Osun state, Colonel Anthony Uzoma Obi (rtd), has announced his demise.\n“Our father was a Lion, a warrior, a brave soldier who served the Nation Nigeria as a Two Time Military Administrator and Governor of Osun State, and Abia State Nigeria.\n“Anthony Uzoma Obi was a loving husband first, and a devoted father who instilled love, discipline, and humility in all he did on his time on earth.\n“We ask that in this time of our grief, that prayers and goodwill are directed towards our family in this trying moment.\n“Adieu Colonel A. U. Obi, your whole family will forever keep your memory alive, through the mercy of God”."
  },
  {
    "headline": "Gunmen Kill Seven In Fresh Kaduna Attacks",
    "summarized_story": "No fewer than seven people have been killed in separate attacks by gunmen on villages in three local government areas of Kaduna State.\nThe affected local governments are Igabi, Chikun and Zango Kataf.\nAccording to the Commissioner, one other person was left injured, while the gunmen carted away some motorcycles and food supplies from the community.\nREAD ALSO: Air Force Kill Two Notorious Bandit Leaders, Several Others In ZamfaraThis is even as two people were killed by gunmen in two attacks in Igabi and Chikun local government areas.\nSimilarly, gunmen attacked Ungwan Zallah in Udawa of Chikun local, and shot one man to death."
  },
  {
    "headline": "Soot Pollution: Wike Orders Shutdown Of Illegal Refining Sites",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has ordered the shutdown of illegal crude oil refining sites in the state with immediate effect.\nIn his new year message released on Saturday by his spokesman, Kelvin Ebiri, the governor directed council chairmen and community leaders to report those behind illegal bunkering and crude oil refining sites in their localities to his office for prosecution.\nThe move, Wike stated, has become necessary to contain the menace of soot pollution which has continued to endanger public health in the state.\n“Consequently, I have directed the chairman of Port Harcourt city local government council to go after all the illegal crude oil refining sites along Creek road and adjourning areas of the city and shut them down with immediate effect.\nAway from the soot pollution, Wike reiterated his administration’s commitment in ridding the state of all forms of criminality in 2022."
  },
  {
    "headline": "Turn Over A New Leaf Or Lose It All, NDLEA Boss Warns Drug Barons",
    "summarized_story": "Chairman/Chief Executive Officer of the National Drug Law Enforcement Agency (NDLEA), Brig.\nGen. Mohamed Buba Marwa (Rtd) has asked all those still involved in the illicit drug business to turn over a new leaf or risk losing their freedom and assets in the new year.\nThat should be a clear signal to anyone in the drug trade that the rules of the game have changed.\n“Those who heed this warning will thank themselves for taking the wise decision to quit the drug trade in the days ahead.\nAnd in the court of law, as proven by recent developments, there is no respite for drug traffickers and barons."
  },
  {
    "headline": "FG Reassures Nigerians Of Plan To Generate 25,000 Megawatts Of Electricity",
    "summarized_story": "The Federal Government has assured Nigerians of its readiness to generate 25,000 megawatts of electricity in the country as part of efforts to enhance power-related businesses and other economic activities in the country.\nREAD ALSO: FG: Nigerians Suffering Epileptic Power Owing To Years Of NeglectThe windmill project contract which was awarded in June 2009 was designed to generate 10 megawatts of electricity for Katsina State and was expected to be completed within 24 months.\nEach of the turbines has the capacity to generate 275 kilowatts.\nIn the meantime, the newly appointed Minister of Power inspected three power transmission substation projects meant not only to serve as booster stations to the windmill project but also to boost electricity supply across the state.\nThey include 330 KV substation located at Fatima Shema Estate which is coming from Kano, construction of 33/11 KV Liyafa substation at Katsina- Kano Road as well as the 133/33 KV Kankia Transmission Substation."
  },
  {
    "headline": "Man Arrested In Ogun For Paying Friend To Kill His Pregnant Wife",
    "summarized_story": "A 35-year-old man, Eluyera Wasiu has been arrested in Ogun State for allegedly planning with his friend, to kill his pregnant wife.\nPreliminary investigation, according to the police spokesperson revealed that Wasiu Eluyera was married to Bola Taiwo but they got separated due to irreconcilable differences.\n“But somehow, he met with his former wife and they started going out together again which resulted to pregnancy,“In order not to upset his new wife, Wasiu asked Bola Taiwo to terminate the pregnancy, the suggestion that was rejected by Bola Taiwo.\n“It was when all his personal efforts to kill her failed that he contracted Adeniyi Taiwo to help him eliminate her.\nHe confessed further that, he personally took Adeniyi to the woman’s house, and he gave him her picture for easy identification."
  },
  {
    "headline": "Buhari, Tinubu, others mourn late Olubadan, Saliu Adetunji",
    "summarized_story": "Tributes are pouring in for the late Olubadan of Ibadan, Oba Saliu Adetunji as President Muhammadu Buhari, Bola Ahmed Tinubu & others have sent their condolence messages.\nOba Adetunji died on Sunday at the University Teaching Hospital, Ibadan.\nHe was aged 93."
  },
  {
    "headline": "Focus: Electoral Amendment Bill - TVC News",
    "summarized_story": "It is a new year and it will be a very busy one in the political space as the nation prepares for the next general elections which will happen early next year.\nAs political parties and the Independent National Electoral Commission put their houses in order for this, one issue which still stands out is the Electoral Amendment Bill which President Buhari withheld assent to in what he says is in the interest of democracy.\nSo what’s it going to be?\nWill the National Assembly veto the president or remove the contentious clause which prescribes mandatory direct primaries for political parties?"
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "With $130trn Tied to Renewables Globally, Nigeria Walks Tight Rope in Bid for Oil Sector Investment",
    "summarized_story": "In its oil and gas outlook for 2022, Wood Mackenzie predicted that record cash flows would come under increasing scrutiny as operators would begin to align with their pledges on decarbonisation.\n“Financing oil and gas was getting harder before COP26, but the pressure will ratchet up in 2022.\nOf more concern is the possibility that the development of new discoveries may be prohibited,” Wood Mackenzie noted.\nAt a projected 1.86 million barrels daily oil production in the country’s 2021 budget, Nigeria recorded a huge deficit of almost 200 million barrels of the liquid in the first 11 months of last year.\nFigures from the NURPC obtained by THISDAY last week indicated that while Nigeria was expected to pump approximately 635 million barrels of oil by November 2021, it only struggled to produce 441 million barrels for the entire period."
  },
  {
    "headline": "Nigeria: Private Sector Bemoans Difficulty Clearing Goods at Ports",
    "summarized_story": "Members of Nigeria’s organised private sector (OPS) have advised the federal government to make deliberate efforts to remove impediments to the conduct of business in the country in 2022, especially with respect to clearing of goods at the ports, stressing that its war clearing goods at the country’s seaports.\nThe leaders of the real sector spoke in separate chats with THISDAY.\nSome of the major constraints they asked the government to address included low FX supply and poor electricity to the real sector, challenges at the country’s seaports, and low patronage of made in Nigeria goods.\nThe Nigeria Customs Service (NCS) is always like never wishing us to clear our goods at a time meant for them to be cleared.\nAjayi-Kadir said stakeholders from the private sector should be nominated to monitor the disbursement of forex by commercial banks to ensure transparent and timeous allocation to bona fide manufacturers."
  },
  {
    "headline": "Audit Reveals Over 90,000 Firearms Missing from Nigeria Police Armoury in 2019",
    "summarized_story": "The Office of the Auditor General for the Federation (OAuGF) has disclosed that about 178,459 different types of arms and ammunition got missing from the Nigeria Police armoury in 2019, without any trace or formal report on their whereabouts.\nThe report accused the Nigeria Police headquarters of lacking comprehensive details of unserviceable weapons, lamenting that such could fall into unauthorised hands for illegal use.\nFormal report on the loss of firearms through dully completed Treasury Form 146 (loss of stores) were not presented for examination.\n“Records obtained from force armament at the Force headquarters showed 21 Police Mobile Force (PMF) Squadron, Abuja, did not report a single case of missing firearm, whereas, schedule of missing arms obtained from the same PMF showed a total number of forty six (46) missing arms between year 2000 and February 2019.\n“The above anomalies could be attributed to weaknesses in the internal control system at the Nigeria Police Force Armament."
  },
  {
    "headline": "Nigerian Governors Visiting Presidential Villa in Abuja to Undergo Rapid Covid Test",
    "summarized_story": "All categories of visitors including state governors to the seat of government in Abuja will henceforth take a rapid COVID-19 test before being allowed to visit the President or any other top government official.\nHis words: “Yes, a new regime of Covid-19 regulation has been put in place for all visitors to the Villa, not for Governors alone.\n“Every visitor to the Villa, not just those seeing the President, is now required to do a rapid test at the gate.\nThis is purely temporary in view of the recent spike in cases, and will be removed any moment the situation abates.\nThis policy has rightfully been justified following the discovery of Covid positivity in some of those tested since the last few days of the practice”."
  },
  {
    "headline": "SERAP Urges Buhari to Probe Alleged Misuse of Security Votes by Nigerian Governors",
    "summarized_story": "“As revealed by a recent report by Transparency International (TI), most of the funds appropriated as security votes are spent on political activities, mismanaged or simply stolen.\n“It is estimated that security votes add up to over N241.2 billion every year..On top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance.\n“While sitting state governors may enjoy immunity from arrest and prosecution, they do not enjoy immunity from investigation.\nAny allegations of mismanagement of security votes against sitting governors can and should be investigated pending the time they leave office and lose immunity.\n“SERAP urges you to instruct the Economic and Financial Crimes Commission (EFCC) and Independent Corrupt Practices and Other Related Offences Commission (ICPC) to jointly track and monitor spending of security votes by the 36 state governors."
  }
]