[
  {
    "headline": "JUST IN: Lagos announces second term resumption date for schools",
    "summarized_story": "Lagos State Government has announced that all public and private schools below the tertiary level in the state will resume for the second term 2021/2022 academic session on Tuesday, January 4, 2022.\nThe Director-General, Office of Education Quality Assurance, Mrs. Abiola Seriki-Ayeni, made this known in a statement on Friday, titled, ‘Lagos public and private schools resume Tuesday, January 4, 2022, for 2nd term’.\nSeriki-Ayeni noted that all students are expected back in school as academic activities start the same day.\n“School leaders should also note that the Mid-Term break for the second term is Thursday 17th and Friday 18th of February, 2022 while school closes on Friday 8th April, 2022,” the statement added.\nShe added that the Office of Education Quality Assurance will monitor compliance with the resumption date in the Lagos State Unified Academic Calendar and observe the teaching and learning process in schools."
  },
  {
    "headline": "Delta to raid street beggers, child hawkers in 2022",
    "summarized_story": "The Delta State Government said it would no longer tolerate street begging and child hawking during school hours.\n“The agency is now convinced that the time has come to commence enforcement of the law,” the committee chairman said.\nShe declared, “This press briefing is to let the world know that the Child’s Rights Implementation Committee is in existence and committed to implementing the Child Rights Law going forward.\nWe also intend to cascade the activities of the Committee to the grassroots by inaugurating the Local Government Child Rights Implementation Committees.\nThis Committee, empowered by law, therefore, is committed to the enforcement of the law as regarding Child Protection and Child Rights in the best interest of our Delta children”."
  },
  {
    "headline": "Nigeria on path of solutions to challenges — Bishop Kukah",
    "summarized_story": "Bishop Matthew KukahBy Musa Annabi – SokotoThe Catholic Bishop of Sokoto Diocese, Matthew Kukah, has said he was not in doubt that with the signing of the 2022 appropriation bill by President Muhammadu Buhari, Nigeria was on the path of solutions to its debt problems.\nThe cleric spoke at the St Bakhita Catholic secretariat in Sokoto State, in a chat with newsmen to mark the end of the year 2021.\nHe said: “We’ve heard that the President will sign the budget very soon.\nWe hope it will herald a new beginning for a better life for all of us.\nThe Catholic Bishop admonished followers of political personalities to not only support politicians of their choices but be wise, adding: “I have always told people that I cannot and will never make religion an issue in my lifetime.”Vanguard News Nigeria"
  },
  {
    "headline": "BREAKING: Buhari signs 2022 Appropriations Bill of N17.127trn into law",
    "summarized_story": "By Johnbosco AgbakwuruPresident Muhammadu Buhari is currently signing the 2023 Appropriations Bill of N17.126 trillion into law.\nThe signing ceremony is taking place at the Council Chambers, Presidential Villa, Abuja.\nPresent at Council Chamber to witness the ceremony are the President of Senate, Dr Ahmad Lawan, the Speaker, Rt.\nFemi Gbajabiamila, and the Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed.\nAlso Read:Others are the Secretary to the government of the Federation, SGF, Boss Mustapha, the Senior Special Assistant to the President on National Assembly Matters (Senate) Senator Babajide Omoworari and some staff of the President."
  },
  {
    "headline": "Gov Emmanuel swears in new judges",
    "summarized_story": "…Okays reorganization of APICO to aid self-sustainability, profitabilityJustice Eme Daniel Ekong and Justice Effiong Asuquo Effiong were on Thursday swore in two new High Court Judges for the Akwa Ibom State Judiciary by Governor Udom Emmanuel.\nPrincess Eme Ekong, 56, after being called to Bar in December 1990, has served in the Akwa Ibom State Judiciary and rose through the ranks to the position of Chief Magistrate 1, while Effiong Effiong FCIA, 48, last served as Chief Registrar in the State Judiciary, prior to the appointment.\n“While I congratulate the two judges, I’m happy we’re doing this before the end of 2021.\nHe further buttressed the commitment by indicating readiness to approve the appointment of at least ten new Magistrates for the State magistrates courts and considerations of more members into the customary courts.\nIn a related development, has urged members of the State Executive Council to work round the clock so as to see to the implementation of the government’s Completion Agenda."
  },
  {
    "headline": "Abducted Plateau Monarch regains freedom, 8 suspects arrested",
    "summarized_story": "By Marie-Therese Nanlong, JosThe abducted Sum Pyem (Traditional Ruler of the Gindiri people in Mangu LGA, Plateau State), Charles Mato Dakat has regained his freedom from his abductors after spending about five days in captivity.\nIt could not be confirmed the conditions that ensured his release as the abductors had earlier placed a ransom of N500m for his freedom.\nFor the period the Sum Pyem spent with the abductors, there was no official statement from the State government except, the security agents who confirmed the incident.\n“Consequently, Eight suspects were arrested in connection with the kidnap incidence and are being interrogated.\nFollowing this development, the paramount ruler early this morning of Friday 31 December 2021 was released by his abductors."
  },
  {
    "headline": "Sanwo-Olu set to sign N1.758trn 2022 budget into law",
    "summarized_story": "By Olasunkanmi AkoniLagos State Governor, Bababjide Sanwo-Olu has concluded plans to sign the state’s 2022 budget of N1.758 trillion into a law.\nSanwo-Olu scheduled to sign the budget tagged: “Consolidation,” into law at the Lagos House, Alausa, Ikeja, today, December 31, 2021.\nYishawu, after the plenary, explained that the total budget size passed has addition of leftover from the previous allocations in the 2021 budget.\nHe said the leftover was rolled into ‘contingency fund’ in the Year 2022 budget.\nWhile the recurrent expenditure is N591,280,803,486bn, the Capital expenditure is N1.166,915,843,358 trillion, taking the budget total size to N1,758,196,44,844 trillion."
  },
  {
    "headline": "2022: Southern senators optimistic of good times to come",
    "summarized_story": "Senators operating under the Southern Senators Forum have expressed optimism that 2022 would be a year of abundance and prosperity while they asked the citizens to keep hope in God.\nHe added that God does not create human beings for hardship because when God created man and woman in the Garden of Eden, they were created in the midst of abundance.\nThe governorship aspirant of the All Progressives Congress (APC) said, “I am confident that in the year, there will be prosperity and Abundance for Nigerians.\n“I am imploring Nigerians to continue to have faith in God and be rest assured that whatever that is currently difficult at present moment will be resolved.\n“God does not create human beings to suffer, when God created the first man and woman, they were created in the midst of abundance."
  },
  {
    "headline": "Primate Ayodele reacts to accusation of issuing false prophecies",
    "summarized_story": "Primate Ayodele said contrary to the publication, his prophecies often come to pass.\nOsho Oluwatosin, the media aide to the popular prophet, reacted to Sahara Reporters’ publication on ‘Prophecies That Missed The Mark In 2021’.\nThe publication tagged “Prophecies That Missed The Mark in 2021,” identified five prophecies from Primate Ayodele and claimed was not fulfilled.\nIn a statement, Osho explained how the prophecies of Primate Ayodele came to pass.\n“Sahara Reporters mentioned five prophecies of Primate Ayodele and claim they didn’t come to pass."
  },
  {
    "headline": "Approach 2022 with patriotism – Ekiti traditional rulers",
    "summarized_story": "The Ekiti State Council of Traditional Rulers has advised Ekiti indigenes and Nigerians at large to approach 2022 with patriotic minds to serve the country in the most profitable and dignifying fashion.\nA statement signed by the Council’s Chairman and Onisan of Isan Ekiti, Oba Gabriel Ayodele Adejuwon, said what the country requires now for its political stability and economic rebirth is having the leaders and followers displaying uncommon patriotism.\nOba Adejuwon specifically appealed to politicians of Ekiti extraction to approach the next governorship election with civility, advising that no election was worth the blood of any Ekiti person.\nA nation that can deliver and meet our aspirations and protect all of us as citizens,” the statement read.\n“As we go into the new year, let us search our minds and do what is right and justiceable."
  },
  {
    "headline": "Sunday Igboho should’ve sought prayers, guidance from men of God before agitation – Pastor Giwa",
    "summarized_story": "Pastor Giwa, who is the Senior Pastor of the Awaiting the Second Coming of Jesus Christ Ministry, Akure, Ondo State, stated this during a popular radio programme in the state monitored by our correspondent.\nAccording to Pastor Giwa, Igboho gave himself out over the unrestricted utterances which he said exposed him to his enemies.\nWhile describing Igboho as a true Yoruba son, the pastor said he will soon be free from incarceration.\n“Before he embarked on such mission he ought to have approached men of God for prayers and spiritual guidance over his actions and utterances.\nWhile baring his mind on the Federal Government’s borrowing, Pastor Giwa said, “Borrowing is not a bad idea, but when you borrow for frivolities, then that becomes dangerous."
  },
  {
    "headline": "Aregbesola/Oyetola feud: Osun lawmakers solicit Adeboye’s help",
    "summarized_story": "As preparations hit top gear for the 2022 gubernatorial election in Osun State, state lawmakers elected under the platform of the All Progressives Congress (APC) have visited the General Overseer of the Redeemed Christian Church of God (RCCG), Pastor E.A.\nThe visit was to convince the clergyman on the need for peace between Governor Adegboyega Oyetola and his predecessor, Rauf Aregbesola.\nAssociates of Aregbesola, the current Minister of Interior, operating under the aegis of The Osun Progressives (TOP) are currently locked in a supremacy battle with Oyetola for the soul of the party in the state.\nRecall that sometime in 2020, the National Leader of the party, Senator Bola Tinubu; and a former Governor of Osun, Adebisi Akande, twice initiated peace moves that failed.\nThe source said, “The visit was led by the Speaker and they sought Baba’s help in brokering peace between the duo."
  },
  {
    "headline": "Africa’s biggest oil discoveries in 2021",
    "summarized_story": "As the lifeblood of industrialised nations, oil and gas are valuable sources of energy that underpin socio-economic development and ensure energy security.\nAfrica, positioned as the world’s final frontier for hydrocarbon exploration, has been accelerating its oil and gas exploration activities with significant discoveries made over the past year, marking the beginning of a promising decade for the continent.\nShocking the oil and gas industry following the publication of preliminary results from exploration wells in Namibia’s 6.3-million-acre Kavango Basin, Canadian oil and gas exploration company, Reconnaissance Africa (ReconAfrica), uncovered the potential of a massive oil discovery estimated to contain 120 billion barrels of oil.\nIn October, Eni once again made three oil and gas discoveries, this time, in Egypt’s western desert region – holding a potential 50 million barrels of oil equivalent in reserves.\nLocated in the Meleiha and Southwest Meleiha concessions, the discoveries include oil, gas, and condensate reserves, with initial well-testing indicating a stable oil production capacity of up to 2,500 bpd."
  },
  {
    "headline": "BREAKING: Buhari signs 2022 budget of N17.126tr",
    "summarized_story": "President Muhammadu Buhari on Friday signed the 2022 Appropriation Bill into law.\nIt is entitled “Budget of economic growth and sustainability.”The budget, valued at N17.126 trillion, was transmitted to the President by the National Assembly on December 24.\nThe President also signed the Finance Bill 2021, which he said was critical to the execution of the 2022 budget.\n- Advertisement -President Buhari had submitted the draft proposed 2022 budget of N16.391trillion to the joint session of the National Assembly on October 7, calling on the legislators to give it a speedy consideration.\nThe breakdown of the budget include N869 billion for statutory allocation, N3.8 trillion for debt servicing, N6.9 trillion and N5.4 trillion for recurrent and capital expenditure respectively."
  },
  {
    "headline": "Bandits bought drugs for abducted Plateau monarch, cared for him, says Palace",
    "summarized_story": "Bandits bought drugs for abducted Plateau monarch, cared for him, says PalaceThe suspected bandits who abducted the Paramount Ruler of Gindiri in Mangu Local Government Area of Plateau State, Charles Mato Dakat, took good care of him, a palace source said on Friday.\nA palace source said the abductors bought drugs for the monarch and did not maltreat him.\nThe source said: “We thank God Almighty that our paramount ruler is now released and is in good condition.\n“We also thank God that he was not maltreated by his abductors.\n“What matters at the moment is that our paramount ruler is now released and we give God the glory.”The traditional ruler was abducted from his palace at about 1am on Sunday."
  },
  {
    "headline": "JUST IN: Abducted Plateau monarch regains freedom",
    "summarized_story": "The Paramount Ruler of Gindiri in Mangu Local Government Area of Plateau State, Charles Mato Dakat, has regained freedom.\n- Advertisement -It could not be ascertained as of press time if any ransom was paid .\n“Consequently, eight suspects were arrested in connection with the kidnap incidence and are being interrogated.\n“Following this development, the paramount ruler early this morning of Friday 31 December 2021 was released by his abductors.\n“Meanwhile Operations SAFE HAVEN is still very much on ground to ensure all those involved in the kidnap of the traditional ruler are arrested and made to face the full wrath of the law.”"
  },
  {
    "headline": "With City of David, Gov Umahi ends 2021 on a high, by Femi Adesina",
    "summarized_story": "He turned his idea into action, his dream to reality, and out came spectacular and breathtaking King David University of Medical Sciences, a modern City of David.\nEven as a People’s Democratic Party (PDP) Governor, President Buhari had visited Ebonyi in 2017, and stayed the night, something not very common.\nKing David University of Medical Sciences is envisioned to develop specialized manpower in all aspects of medicine.\nThank you Governor Umahi.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "UK pledges £105m to assist Nigeria, others tackle Omicron",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom has pledged £105 million to help tackle Omicron in Nigeria and other African countries.\n“The UK Foreign Secretary, Liz Truss, has pledged up to £105 million of UK emergency aid to help vulnerable countries tackle the Omicron COVID-19 variant, with a particular focus on Africa.\n“Doses donated by the UK have reached four continents and provided vital protection from COVID-19 in countries, including Nigeria, Angola, the Democratic Republic of Congo, Ethiopia, Ghana and Rwanda.\nThe UK has so far donated to Nigeria over 1.2 million doses of Oxford-AstraZeneca vaccines through COVAX in 2021.\nI am proud we have already delivered over 30 million vaccines to our friends abroad."
  },
  {
    "headline": "Lives lost under Buhari govt worrisome, says Kukah",
    "summarized_story": "From Tunde Omolehin, SokotoBishop of the Catholic Diocese of Sokoto, Matthew Kukah, has expressed worries over the rising numbers of deaths under the President Muhammadu Buhari.\nSpeaking at an interactive session with journalists in Sokoto, yesterday, the cleric reiterated that the president owed Nigerians explanations on the rising kidnappings and killings.\nRemember that I have said similar things about previous governments, depending on their wickedness or wrongdoings as at that time.\nBut the most important thing is for anyone who wants to counter my criticism to first come with valid and superior arguments.\nI realised that we are indifferent to learning how to disagree with each other for the purpose of agreeing with ourselves.”"
  },
  {
    "headline": "Igboho: NANS demands repatriation of Yoruba nation activist, Igboho",
    "summarized_story": "From Laide Raheem, AbeokutNational Association of Nigerian Students (NANS) has demanded the repatriation of Yoruba nation activist, Sunday Adeyemo, also known as Sunday Igboho back to Nigeria from Benin Republic where he is being incarcerated.\nHis lawyer, Yomi Alliyu, had claimed that Nigerian government, not the Benin Republic Government, is holding him in prison.\nBut, the student umbrella body in the South West called for his repatriation, saying his stay in Benin Republic is no longer justifiable.\n“The activities of the Federal Government however communicates nonchalance and unwillingness that suggest Benin Republic is only acting a script orchestrated by Nigeria’s government.\nWe must warn the government of Benin Republic that Nigerians are now disenchanted by their manner of handling this case.,” Adegboye said."
  },
  {
    "headline": "Audit report indicts NASS over N9.425bn, Reps summon CNA",
    "summarized_story": "From Ndubuisi Orji, AbujaAn audit report by the Office of the Auditor General of the Federation (AuGF) has indicted the management of the National Assembly and National Assembly Service Commission (NASC) over an alleged N9.424 billion “unexplained” expenditure in the 2019 financial year.\nConsequently, the House of Representatives Committee on Public Account ( PAC) has summoned the Clerk of the National Assembly (CNA), Amos Ojo, to appear before it after the Christmas and New Year holidays.\nThe audit report said about N5.521 billion of the expenditure were credited to the House of Representatives, N3.595 billion to the senate and N307.676 million was credited to the National Assembly Service Commission.\nThe audit report with reference AuGF/AR.2019/02 and addressed to the clerk to the National Assembly and dated 15th September 2021 was signed by the Auditor General of the Federation, Adolphus Aghughu.\nThe report said N2.550 billion was given to members of the House as running costs between July and December 2019."
  },
  {
    "headline": "IPOB alleges mass arrest, killings in Imo communities by security agents",
    "summarized_story": "From Stanley Uzoaru, OwerriIndigenous People of Biafra (IPOB) has alleged mass arrest and secret killings of indigenes of Orsuihitekwa, Nkwere and Orlu in Orlu Local Government Area of Imo State by a combined team of Nigeria security agencies.\nThe group, in a statement by its spokesperson, Emma Powerful, claimed security agents seven months ago invaded Orsuihitekwa and environs with armoured tanks and fighter jets searching for its members who they accused of being behind the killings in the area.\n“But unfortunately, when these innocent folks alerted security agents of this sad development, instead of the double-faced and compromised security agents going after the bad boys, they rather resorted to mass arrest of the innocent youths in the community after a gun duel with the hoodlums.\nThe mass arrest of innocent youths of Orsuihiteukwa took place on December 13, 2021 and 26 people from the community were involved in the arrest.”Powerful called for the unconditional release of all those wrongfully arrested by security operatives in the state.\nNigeria security must stop unleashing mayhem on the people because they are Igbo or Biafrans."
  },
  {
    "headline": "FG Outlines Administration’s 100 Achievements in 2021",
    "summarized_story": "Olawale Ajimotokan in AbujaThe federal government, yesterday, presented the scorecard of President Muhammadu Buhari, citing 100 core achievements of his administration in 2021.\nMohammed, who addressed the media in Lagos, said government’s economic recovery plan remained on a steady path throughout 2021.\nMohammed stressed that under the Buhari administration, the rate of inflation had continued to decline on a year-on-year basis since April 2021.\nAccording to Mohammed, “The recovery of the economy remained on a steady path throughout the year 2021.\nThe minister disclosed that non- oil export grew by 21.17 per cent, from N1.19 trillion to N1.44 trillion over the same period."
  },
  {
    "headline": "NDDC: We Shall Recover Every Stolen Kobo, Vows Buhari",
    "summarized_story": "*Restates few people squandered region’s fund in over two decadesDeji Elumoye in Abuja and Okon Bassey in UyoPresident Muhammadu Buhari has vowed to recover all misappropriated funds of the Niger Delta Development Commission (NDDC).\nBuhari also emphasised the readiness of his administration to prosecute all culprits indicted in the NDDC forensic report currently being reviewed by the federal government.\nThe president stated, “The Niger Delta Development Commission needs to demonstrate that it can achieve the objectives it was conceived for and make its impact felt all over the Niger Delta Region.\nHe added, “President Buhari is focused on development of Nigeria and the Niger Delta.\nSpeaking also, Sole Administrator of NDDC, Mr. Effiong Akwa, thanked the president for honouring the institution by commissioning three projects in a year."
  },
  {
    "headline": "Report: At 55 Years, Every Lagos Resident Would’ve Spent Over Six Years in Traffic",
    "summarized_story": "FDC, led by Nigerian economist, Mr. Bismarck Rewane, also highlighted in its latest report published this month the economic outlook for 2022.\nThe Lagos-based research and investment firm stated that while Lagos residents spent 1,080 hours in traffic a year, residents of London, which is said to have the highest congestion in the world, spent about 148 hours.\nThe report stated, “Lagosians are spending approximately 1,080 hours a year in traffic, compared to 148 hours in London, the city with the worst traffic jams in the world (excluding Nigeria and Egypt).\nIn other issues, the FDC report stated that economic policy vagueness and “regulatory autocracy” plagued the Nigerian economy for most part of 2021.\nHowever, the FDC stated that high debt servicing costs, large public wage bill and security expenses would keep government spending elevated throughout the period."
  },
  {
    "headline": "Buhari, Jonathan Meet in State House",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday played host to his predecessor, Dr. Goodluck Jonathan, at the State House, Abuja.\nAlthough the agenda of the duo’s meeting was not made public, it might not be unconnected with mediatory works of erstwhile President Jonathan in the West African subregion.\nThe former President is known to frequent the Villa to brief the President on his activities as ECOWAS Special Envoy to Mali.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Osimhen Contracts COVID-19 Second Time, Pulls out of AFCON",
    "summarized_story": "The 23-year-old has reportedly cancelled his planned journey to his base in Naples, Italy for checkups on his cheekbone injury before flying to Cameroon for the tournament.\nIn a terse statement issued by Napoli Thursday, Osimhen was told to self-isolate in Nigeria while his scheduled checkup has been rescheduled for another time.\nVictor (Osimhen) is a very dedicated player.\nUntil this second COVID-19 positive test, Osimhen was planning a return journey to Naples to play the Juventus match on January 6.\nThere is no official statement yet from the NFF on whether Osimhen would be replaced in the squad."
  },
  {
    "headline": "EXCLUSIVE: Christian Association Of Nigeria Directs Kaduna Churches To Suspend Christmas Eve Programmes Over Security Concerns",
    "summarized_story": "The Christian Association of Nigeria (CAN) has directed churches in Kaduna State to suspend this year's Christmas Eve services.\nHe added, \"Yes, we have written to churches to suspend this year's Christmas Eve and New Year's Eve events because of security concerns.\n\"However, in areas our people feel they can afford to congregate for Christmas Eve services, they should do so under security measures.\nSaharaReporters on November 29, 2021, reported that a group of bandits had written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks.\nIt further says, \"Since 2011, inter-communal violence, rooted in competition over scarce resources, has escalated in central and north-west Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Christian Association Of Nigeria Directs Kaduna Churches To Suspend Christmas Eve Programmes Over Security Concerns",
    "summarized_story": "The Christian Association of Nigeria (CAN) has directed churches in Kaduna State to suspend this year's Christmas Eve services.\nHe added, \"Yes, we have written to churches to suspend this year's Christmas Eve and New Year's Eve events because of security concerns.\n\"However, in areas our people feel they can afford to congregate for Christmas Eve services, they should do so under security measures.\nSaharaReporters on November 29, 2021, reported that a group of bandits had written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks.\nIt further says, \"Since 2011, inter-communal violence, rooted in competition over scarce resources, has escalated in central and north-west Nigeria."
  },
  {
    "headline": "Over 20 Farmers Killed, 5,000 Displaced In Nasarawa Clashes",
    "summarized_story": "No fewer than 20 people have been reportedly killed and 27 injured in a feud between farmers and herders in Lafia, Obi and Awe local government areas of Nasarawa State.\nAccording to Daily Trust, a source said at least 5,000 farmers across 12 communities have been displaced as a result of the attacks in the three local government areas.\nSome of those who sustained injuries were said to be currently receiving treatment at hospitals in the Obi, Lafia and Awe local government areas.\nConfirming the incident, the Police Public Relations Officer, Nasarawa State Command, ASP Ramhan Nansel, affirmed that a complaint was made on Friday.\nMeanwhile, Governor Abdullahi Sule on Monday disclosed that his administration had launched a manhunt of the killers of Fulani herder and Tiv farmers in the state at the weekend."
  },
  {
    "headline": "Over 20 Farmers Killed, 5,000 Displaced In Nasarawa Clashes",
    "summarized_story": "No fewer than 20 people have been reportedly killed and 27 injured in a feud between farmers and herders in Lafia, Obi and Awe local government areas of Nasarawa State.\nAccording to Daily Trust, a source said at least 5,000 farmers across 12 communities have been displaced as a result of the attacks in the three local government areas.\nSome of those who sustained injuries were said to be currently receiving treatment at hospitals in the Obi, Lafia and Awe local government areas.\nConfirming the incident, the Police Public Relations Officer, Nasarawa State Command, ASP Ramhan Nansel, affirmed that a complaint was made on Friday.\nMeanwhile, Governor Abdullahi Sule on Monday disclosed that his administration had launched a manhunt of the killers of Fulani herder and Tiv farmers in the state at the weekend."
  },
  {
    "headline": "Eight Arrested As First-class Plateau Monarch Abducted On Boxing Day Regains Freedom",
    "summarized_story": "Eight suspected kidnappers have been arrested as the Paramount Ruler of Gindiri in the Mangu Local Government Area of Plateau State, Charles Mato Dakat, who was kidnapped on Boxing Day regains his freedom.\nThe monarch was abducted by gunmen who attacked his palace on Sunday around 1 am.\nFile PhotoHis abductors made contact with the family members a few days later and demanded a ransom of N500 million for his release.\nMeanwhile, Operation Safe Haven says eight suspects have been arrested in connection with the kidnap of the traditional ruler.\n“Consequently, eight suspects were arrested in connection with the kidnap incidence and are being interrogated."
  },
  {
    "headline": "BREAKING: FG extends deadline for NIN-SIM linkage by three months",
    "summarized_story": "The federal government has extended the deadline for the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise by three months.\nAdvertisementThe new deadline is March 31, 2022."
  },
  {
    "headline": "BREAKING: FG extends deadline for NIN-SIM linkage by three months",
    "summarized_story": "The federal government has extended the deadline for the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise by three months.\nAdvertisementThe new deadline is March 31, 2022."
  },
  {
    "headline": "'6,576 new projects, reduction of police allowance' -- Buhari laments alterations in 2022 budget",
    "summarized_story": "President Muhammadu Buhari has expressed reservations over the “worrisome changes” made by the national assembly to the 2022 executive budget.\nThe presidency had submitted a proposal worth N16.391 trillion to the national assembly.\nIn his remarks after signing the budget, Buhari said the lawmakers reduced the amount allocated to some projects — but added 6,576 projects of their own to the 2022 budget.\nAdvertisement‘‘Provisions made for as many as 10,733 projects were reduced while 6,576 new projects were introduced into the budget by the National Assembly.\n‘‘Reduction in the provisions for many strategic capital projects to introduce ‘Empowerment’ projects."
  },
  {
    "headline": "'6,576 new projects, reduction of police allowance' -- Buhari laments alterations in 2022 budget",
    "summarized_story": "President Muhammadu Buhari has expressed reservations over the “worrisome changes” made by the national assembly to the 2022 executive budget.\nThe presidency had submitted a proposal worth N16.391 trillion to the national assembly.\nIn his remarks after signing the budget, Buhari said the lawmakers reduced the amount allocated to some projects — but added 6,576 projects of their own to the 2022 budget.\nAdvertisement‘‘Provisions made for as many as 10,733 projects were reduced while 6,576 new projects were introduced into the budget by the National Assembly.\n‘‘Reduction in the provisions for many strategic capital projects to introduce ‘Empowerment’ projects."
  },
  {
    "headline": "Lawan: Nigeria benefiting from cordial relationship between executive and legislature",
    "summarized_story": "Senate President Ahmad Lawan says the country is benefiting from the cordial relationship between the executive and the legislative arm of government.\nAdvertisementSpeaking with journalists on Friday after President Muhammadu Buhari signed the 2022 appropriation into law, Lawan said the legislature and the executive arms of government played roles in passing the bill into law.\n“The secret is cooperation, partnership, synergy, and that understanding and mutual respect,” the senate president said.\n“Nigeria is benefiting from that kind of relationship.\nPresident, congratulations to him for signing the 2022 appropriation bill today, even though today is the last day of the year."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "GetEquity is changing startup investment in Africa. But how?",
    "summarized_story": "GetEquity, a Nigeria-based investment platform, came into the market with the mantra of “challenging the status quo of startup financing and venture capital” in Africa.\nInitially, the co-founders didn’t set out to democratise startup investment in Africa.\nOn GetEquity, startups get instant access to several angel investors, syndicates and institutional investors.\nApparently, GetEquity operates like every other VC: its team of diverse backgrounds—law, marketing, investment, business development—analyse the potential growth of a startup before onboarding them on their platform.\nIf that’s the case, one can chose to question the validity of the disruption the company promises to bring into startup investment."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Reviewing Nigerian fintech in 2021: Local investors are stepping up",
    "summarized_story": "Share this article:Between January and September 2021, African fintechs raised up to $1.4 billion, signalling an increasing investor appetite for Africa’s growing fintech space, and Nigeria has taken centre stage.\nAccording to data gathered by Intelligence by Techpoint, Nigerian fintech startups raised almost $800 million in 2021.\nBut, so far, there’ve been massive improvements in the fintech space beyond smartphone apps.\nIn January 2021, Olowe made some interesting predictions which, in the real sense, are educated guesses based on the trends from past years, and we created a little analysis.\n“I must admit that MTN would find it really tough to play in the financial space."
  },
  {
    "headline": "Web3: The Internet evolution to come in 2022 and beyond",
    "summarized_story": "Share this article:If you’ve come across the buzzword, non-fungible tokens (NFT) on the Internet, chances are you have also seen the latest buzzword — Web3.\nA decentralised World Wide Web owned by no one but run based on everyone’s decisions.\nHe envisioned the Web in three ways: a Web of documents (Web1), a Web of people (Web2) and a Web of data (Web3).\nThe same way Web3 is causing a stir now on the Internet, the coming of Web2 also did the same thing.\nLike Web2, Web3 wants to make the Internet more inclusive but, in contrast, take control away from big corporations like Facebook, Google, and Amazon."
  },
  {
    "headline": "More money for power sector as DisCos ramp up collection",
    "summarized_story": "Nigeria’s electricity distribution companies (DisCos) have vastly improved their ability to collect revenue from customers, improving liquidity in a cash-strapped power sector and raising hopes for new investments.\nAnalysis of the collection pattern shows that DisCos are prioritising distribution of power to areas where customers are both willing and able to pay.\n“At best, improvements have been modest,” said Ayodele Oni, energy lawyer and founder of Bloomfield law firm in his assessment of the power sector this year.\nThe regulator said of the 11,058,939 registered energy customers as of June 30, 2021, only 4,529,497 (40.95%) have been metered.\nThis implies that out of every 10 registered electricity customers, six are without meters, thus on estimated billing."
  },
  {
    "headline": "Why Lagos-Ibadan Expressway is project to watch",
    "summarized_story": "For several reasons, the Lagos-Ibadan Expressway is a major infrastructure project to watch in 2022.\nThe completion of the expressway, according to the government and infrastructure development experts, would mean a big boost for the economy and a huge relief for motorists.\nThe Expressway is one of the 12 federal highways with a combined length of 1,963km the Federal Government had concessioned under the initiative.\nThese are experiences that await motorists as reconstruction tapers to an end on Lagos-Ibadan Expressway where stress and delay define daily motoring and commuting experience.\nAdedamola Kuti, director of Federal Highways, South West, disclosed that efforts were being intensified to complete projects like the Lagos-Ibadan Expressway, adding that designs for the four tollgates were being tidied up."
  },
  {
    "headline": "2021 fails to meet manufacturers’ expectations",
    "summarized_story": "Okhai Ehimigbai, export executive at Aarti Steel, said the year did not go as expected as challenges intensified and worsened the manufacturers’ plight.\nMany manufacturers were forced to retrench workers as they could not cope with the rising cost, he said, and some companies suspended operations.\nThis forced manufacturers to source for inputs locally, which also was a struggle due to rising insecurity, bad roads, and poor infrastructure to preserve raw materials, etc.\nThese challenges and more also damped efforts to participate in the ongoing AfCFTA, as Nigerian manufacturers lacked the ability to compete with other countries, especially electricity supply and right policies.\nSome companies expanded production: Constantly-changing consumer preferences, environmental and global conditions forced some manufacturers to rethink business strategies, refine goods produced and services rendered in order to meet changing demand."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "‘Be circumspect in your words and actions’ – Nnamdi Kanu advises followers in end-of-year message",
    "summarized_story": "The detained leader of the Indigenous People of Biafra (IPOB), Mazi Nnamdi Kanu, has called on his followers to more circumspect in their words and actions, while thanking them for remaining undaunted.\n“He was also emphatic on the need for UMUCHINEKE to be circumspect in their words and actions.\nHe has supplicated unto ChukwuOkike Abiama to guide and protect Umuchineke and to continually expose and punish those elements intent on besmirching them.\n“The new year offers us renewed hope in ChukwuOkike Abiama.\nChukwuOkike Abiama being and abiding with us, we shall reap and appropriate beneficially comprehensive victory on all sides.”"
  },
  {
    "headline": "Buhari signs Nigeria’s N17.1 trillion 2022 budget",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has signed the country’s 2022 budget into law.\nThe president signed the budget at the Presidential Villa in Abuja on Thursday, two weeks after the Senate and House of Representatives passed the bill presented by the president a few weeks earlier.\nThe lawmakers had approved a total expenditure of N17.1 trillion against the N16.3 trillion proposed by the president in October.\nIn the budget, statutory transfer was put at N869.6 billion, debt service at N3,88 trillion, recurrent (non-debt) expenditure at N6.9 trillion and capital expenditure at N5.46 trillion.\nThose who witnessed the signing of the budget include Vice President Yemi Osinbajo, Senate President Ahmad Lawan and the Speaker of the House of Representatives, Femi Gbajabiamila."
  },
  {
    "headline": "Performance report: PDP accuses Buhari govt of peddling falsehood",
    "summarized_story": "Nigeria’s main opposition party, the People’s Democratic Party (PDP), has dismissed as falsehood, achievements listed by the President Muhammadu Buhari government as its accomplishments in 2021.\nThe Minister of Information and Culture, Lai Mohammed had on Thursday, listed 100 achievements of the Buhari administration in 2021.\nBut reacting to the list, the PDP in statement on Thursday night by its National Publicity Secretary, Debo Ologunagba, titled ‘FG’s 2021 performance claims, a litany of lies- PDP’, dismissed it as a celebration of falsehood.\nIt, therefore, challenged the APC government to name one landmark project it conceptualised, commenced and completed in the last six years.\nIt further said the APC is oblivious of the pains and tears that its leadership has “inflicted on Nigerians.”"
  },
  {
    "headline": "Osun mines highest grade open-pit gold in commercial quantity",
    "summarized_story": "Olusesan LaoyeIn what could be described as part of the efforts of the present government of Governor Adegboyega Oyetola of Osun State at industrializing the state, Segilola the open-pit Gold mining operation which commenced operation in 2020, has reached a commercial quantity.\nApart from being Nigeria’s first “commercial-scale gold mine”, it has also been described as the “highest grade open pit gold operation in West Africa” and “the largest defined gold deposit in Nigeria”It’s owned by Thor Explorations, listed on the Toronto Stock Exchange.\nMining is another sector in which the Buhari Administration and now Governor Adegboyega Oyetola has been paying much attention.\nThe Segilola gold mine is regarded as the most advanced gold project in Nigeria with a total reserve of 517, 800 gold ounces grading at 4.02 g/t and now the the first Nigeria’s commercial gold deposit.\nIt is also now operating at 90,000 tonnes of ore material with 2 ore zones prepared for the commencement of higher- grade direct tip operations."
  },
  {
    "headline": "Asiko Breaks Ground On First Dual Liquefied LNG Storage Terminal",
    "summarized_story": "The ground-breaking ceremony of the dual-liquefied gas storage terminal located in Ijora, Lagos State, took place on December 13, 2021, and on completion, the facility will house 5000 metric tonnes of Propane/LPG storage and a 30 million-litre LNG storage tank.\nAlso when completed, the terminal under construction will be the country’s first dual liquified gas fuel terminal, with the ability to receive, store and distribute both LPG and LNG.\nADVERTISEMENT“As we commence the construction of our propane/LPG terminal, we are also laying the foundation for a co-located LNG terminal consisting of a full containment tank making this the first land-based LNG receiving terminal in Africa,” he added.\nEkundayo thanked the Board of Directors of Asiko Energy, shareholders, colleagues, financiers, and supply partner of 15 years and counting, the Nigeria LNG (NLNG) Limited.\nAsiko recently signed a contract with the NLNG for the domestic distribution of LNG, making it the only company to be involved in both the domestic LPG and domestic LNG distribution in Nigeria."
  },
  {
    "headline": "Firefighters Avert Disaster As Petrol Tanker, Trailer Collide In Kwara",
    "summarized_story": "Prompt intervention of the men of Kwara State Fire Service on Thursday averted what could have been a major fire disaster in the state.\nA trailer truck with registration number PKM 141 ZY and a petrol tanker with registration number FLK 105 FA loaded with 45 litres of petroleum product collided along Bode Saadu- Jebba highway in Moro local government area of the state.\nIt was further gathered that the firefighters quickly responded to the distress call sent to their office and in no time arrived at the Shao junction scene of the accident.\nADVERTISEMENTThe firefighters quickly moved into action and evacuated petrol from the tanker, thereby preventing it from exploding.\nHe quoted the director of the State Fire Service, Prince Falade Olumuyiwa, urging tanker drivers to always drive safely to avoid carnage on the highways."
  },
  {
    "headline": "Firefighters Avert Disaster As Petrol Tanker, Trailer Collide In Kwara",
    "summarized_story": "Prompt intervention of the men of Kwara State Fire Service on Thursday averted what could have been a major fire disaster in the state.\nA trailer truck with registration number PKM 141 ZY and a petrol tanker with registration number FLK 105 FA loaded with 45 litres of petroleum product collided along Bode Saadu- Jebba highway in Moro local government area of the state.\nIt was further gathered that the firefighters quickly responded to the distress call sent to their office and in no time arrived at the Shao junction scene of the accident.\nADVERTISEMENTThe firefighters quickly moved into action and evacuated petrol from the tanker, thereby preventing it from exploding.\nHe quoted the director of the State Fire Service, Prince Falade Olumuyiwa, urging tanker drivers to always drive safely to avoid carnage on the highways."
  },
  {
    "headline": "Buhari Appoints Acting CG For Fire Service As Liman Bows Out",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Karebo Samson as the acting Controller-General of the Federal Fire Service (FFS).\nThis followed retirement of the FFS CG, Dr. Liman Ibrahim.\nA statement signed by the FFS public relations officer, SF Ugo Huan, on Thursday, announced the new development.\nOn his part, the outgoing Controller-General, Dr. Liman Ibrahim, also thanked President Buhari for giving him the opportunity to serve the nation.\nADVERTISEMENTIbrahim said the current administration of President Buhari lifted the Fire Service “from sorry state to a world-class standard.”"
  },
  {
    "headline": "Buhari Appoints Acting CG For Fire Service As Liman Bows Out",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Karebo Samson as the acting Controller-General of the Federal Fire Service (FFS).\nThis followed retirement of the FFS CG, Dr. Liman Ibrahim.\nA statement signed by the FFS public relations officer, SF Ugo Huan, on Thursday, announced the new development.\nOn his part, the outgoing Controller-General, Dr. Liman Ibrahim, also thanked President Buhari for giving him the opportunity to serve the nation.\nADVERTISEMENTIbrahim said the current administration of President Buhari lifted the Fire Service “from sorry state to a world-class standard.”"
  },
  {
    "headline": "CSOs reject FG’s claim of making ‘tremendous’ progress in 2021",
    "summarized_story": "), made what he described as tremendous progress in the fight against banditry and insurgency in 2021.\n“The Digital Economy sector was highly instrumental in lifting the Nigerian economy out of recession.\n“The telecommunications sector alone recorded a growth rate of 15.90 per cent, representing its highest growth rate in the last 10 years.\nIn the NBS report for the Q1 2021, the ICT sector maintained its position as the fastest-growing sector of the economy.\nThis, therefore, indicates that the Digital Economy sector has proven to be vital for the diversification of the Nigerian economy,” he added."
  },
  {
    "headline": "CSOs reject FG’s claim of making ‘tremendous’ progress in 2021",
    "summarized_story": "), made what he described as tremendous progress in the fight against banditry and insurgency in 2021.\n“The Digital Economy sector was highly instrumental in lifting the Nigerian economy out of recession.\n“The telecommunications sector alone recorded a growth rate of 15.90 per cent, representing its highest growth rate in the last 10 years.\nIn the NBS report for the Q1 2021, the ICT sector maintained its position as the fastest-growing sector of the economy.\nThis, therefore, indicates that the Digital Economy sector has proven to be vital for the diversification of the Nigerian economy,” he added."
  },
  {
    "headline": "APC carpets Makinde over insecurity, infrastructure",
    "summarized_story": "The All Progressives Congress has said the administration of Governor Seyi Makinde has performed abysmally low in terms of provision of adequate security and infrastructural development in Oyo State.\nThe statement read in part, “The government of Seyi Makinde claimed to have procured fire fighting vehicles from Turkey for about one year without functioning.\n“The Ajumose buses in the state are due for replacement; Governor Seyi Makinde claimed to have procured some, which are only seen when his party, the PDP, has assignments outside Oyo State.\nGovernor Makinde chose to celebrate his birthday in Saki, Oke Ogun, what followed was mayhem – maiming and killings.\n“Can the people of Oyo State forget the wanton overnight destruction of Igangan town in the Ibarapa area of Oyo State on the dawn of June 6, 2021?"
  },
  {
    "headline": "APC carpets Makinde over insecurity, infrastructure",
    "summarized_story": "The All Progressives Congress has said the administration of Governor Seyi Makinde has performed abysmally low in terms of provision of adequate security and infrastructural development in Oyo State.\nThe statement read in part, “The government of Seyi Makinde claimed to have procured fire fighting vehicles from Turkey for about one year without functioning.\n“The Ajumose buses in the state are due for replacement; Governor Seyi Makinde claimed to have procured some, which are only seen when his party, the PDP, has assignments outside Oyo State.\nGovernor Makinde chose to celebrate his birthday in Saki, Oke Ogun, what followed was mayhem – maiming and killings.\n“Can the people of Oyo State forget the wanton overnight destruction of Igangan town in the Ibarapa area of Oyo State on the dawn of June 6, 2021?"
  },
  {
    "headline": "Breaking: Death hits Pastor Odukoya's family again, loses twin sister",
    "summarized_story": "General Overseer, Fountain of Life Church, Pastor Taiwo Odukoya has lost his twin sister, Kehinde to the cold hands of death.\nKehinde’s death came less than two months after Pastor Odukoya lost his second wife, Nomthi.\n❤️.”On 9 November, 2021, Pastor Odukoya lost his second wife, Nomthi to cancer.\nPastor Odukoya’s first wife, Bimbo Odukoya died on 10 December 2005 in a Sosoliso airline which crashed during landing at Port Harcourt International Airport.\nHowever, with the love and support from friends and family, Pastor Taiwo Odukoya remarried a South African, Rosemary Simangele Zulu (Nomthi) on the 5th of January 2010, five years after the passage of Bimbo Odukoya."
  },
  {
    "headline": "Ibiza lounge set to unlock New Year with CDQ",
    "summarized_story": "Ibadan city will on Saturday, January 1, 2022 witness a massive gathering of fun lovers as popular hip-hop act, Sodiq Abubakar Yusuf better known as CDQ storms The Ibiza Lounge.\nIbiza Lounge, according to its owner, Oyedokun Oyewumi has set a new standard in nightlife activities in Ibadan.\nIbiza is literally in your backyard in Ibadan”, Oyewumi said.\n“Since inception, Ibiza Lounge, located at Adeoyo, Ring-road, Ibadan is dedicated to providing the best nightlife experience possible”, he added.\nOyewumi also guaranteed maximum security of properties, adding that the lounge is located in a secured arena, for fun lovers."
  },
  {
    "headline": "Bandits Abduct Lecturer’s Wife, Two Daughters In Zamfara",
    "summarized_story": "On Friday, gunmen suspected of being bandits raided Mereri village in Gusau, the capital of Zamfara State, kidnapping the wife of Dr AbdulRazaq, a lecturer at the Federal College of Education (Technical) Gusau, as well as his two daughters, Maryam AbdulRazaq and Hafsat AbdulRazaq.\nMany things, including money, were plundered in the Mareri village, which is located on the outskirts of the state capital, according to eyewitness testimony.\nOne of the lecturer’s neighbors, who requested anonymity for security reasons, told reporters that the bandits rushed the residence with sophisticated weapons and began shooting sporadically.\nAccording to the source, some of them arrived barefoot and gained entry to the area via a forest that connects the Geba, Jajjayen, and Kwanar Mai communities in Gusau.\nWhen contacted, Mohammad Shehu, the state Police Public Relations Officer (PPRO), stated an investigation is ongoing and that once validated, he will contact journalists for further information."
  },
  {
    "headline": "BREAKING: Buhari Signs 2022 Budget Into Law",
    "summarized_story": "President Muhammadu Buhari signed the appropriation bill for 2022 on Friday.\nAt a ceremony at the Presidential Villa in Abuja, Buhari signed the bill into law.\nSenator Babajide Omoworare, Buhari’s Senior Special Assistant (Senate) on National Assembly Matters, submitted the appropriation bill to him.\nThis comes around seven days after the National Assembly passed and delivered the appropriation bill to the president.\nOn Friday, the President signed the national budget in the Presidential Villa’s Council Chamber in Abuja, the Federal Capital Territory (FCT)."
  },
  {
    "headline": "BREAKING: Kidnappers Release Plateau Monarch Five Days After Abduction",
    "summarized_story": "Charles Mato Dakat, the kidnapped traditional ruler of Plateau State, has been released.\nHis kidnappers had made contact with the monarch’s family a few days later and demanded a ransom of N500 million before releasing him.\nThe traditional ruler, though, was said to have regained his freedom in the early hours of Friday.\nDakat’s release was confirmed by a family source to The PUNCH in Jos on Friday.\nAsked how much ransom was paid to the kidnappers to secure the release of the tradional ruler, the source said, “All I can tell you is that life is more than money."
  },
  {
    "headline": "Gov. Ugwuanyi Signs N186.64 Billion 2022 Budget Into Law",
    "summarized_story": "The Speaker of the State House of Assembly, Rt.\nEdward Ubosi, revealed that the budget proposal was not contentious when presenting it to Gov.\n“Looking at the Ministry of Works and Infrastructure which is about N36 billion, it shows that you (Ugwuanyi) are prepared to fulfill the campaign promises you made to the people of Enugu State.\n“Your Excellency, the budget was well packaged and we must commend you and members of your executive for that wonderful budget”, he said.\nMrs. Cecilia Ezeilo, the Deputy Speaker, Rt."
  },
  {
    "headline": "Breaking: Kidnapped Plateau paramount ruler released",
    "summarized_story": "The Military has confirmed the release of the paramount ruler of Gindiri in Mangu local government area of Plateau state, Chief Charles Mato.\nAccording to a press statement on Friday, “While the Paramount Ruler of Gindiri in Mangu Local Government Area of Plateau State, Chief Charles Mato was with his abductors, the commander Operation SAFE HAVEN Major General Ibrahim Ali placed the troops deployed at Gyanbus on red alert and hot trail of the perpetrators.“Consequently, eight suspects were arrested in connection with the kidnap incidence and are being interrogated.\n“Following this development, the paramount ruler early this morning of Friday 31 December 2021 was released by his abductors.\n“Meanwhile Operations SAFE HAVEN is still very much on ground to ensure all those involved in the kidnap of the traditional ruler are arrested and made to face the full wrath of the law.”The monarch was kidnapped on Sunday December 26, 2021."
  },
  {
    "headline": "Breaking: Buhari signs 2022 budget into law, hours before New Year",
    "summarized_story": "President Muhammadu Buhari on Friday signed the 2022 Appropriation Bill of N17.126 trillion into law.\nThe President signed the year’s budget at the Council Chamber of the Presidential Villa in Abuja, the Federal Capital Territory (FCT).\nThe appropriation bill was presented to the President by his Senior Special Assistant (Senate) on National Assembly Matters, Senator Babajide Omoworare.\nWhile signing the budget, President Buhari was flanked by the President of the Senate, Ahmed Lawan, and the Speaker of the House of Representatives, Femi Gbajabiamila.\nThere were other senior government officials."
  },
  {
    "headline": "Breaking: Super Eagles’ camp depletes as 4 key players pull out, 10 days to AFCON 2021 kickoff",
    "summarized_story": "There are growing concerns in the camp of Super Eagles after up to four key players were confirmed to have pulled of Africa Cup of Nations scheduled for Cameroon as from January 9, 2021.\nA statement from the Nigeria Football Federation (NFF) on Friday morning confirmed that experienced goal poacher Victor Osimhen will not make to the biennial soccer championship.\nIn his place, out of form France-based Henry Onyekuru has been drafted.\nAjayi can also play as a midfielder.\n“Osimhen’s absence paves way for Greece-based Henry Onyekuru who was also at the last finals in Egypt."
  },
  {
    "headline": "UPDATED: Buhari Signs 2022 Budget, Displeased With Changes Made By NASS",
    "summarized_story": "President Muhammadu Buhari has signed the 2022 Appropriation Bill of N17.126 trillion into law.\nHe was, however, displeased with some changes as well as major additions and reductions made by the National Assembly in critical projects ‘without justification’.\nIn his response, the Senate President told State House correspondents that the lawmakers were right in their decisions.\nThe National Assembly raised the total 2022 budget figure from the proposed N16.391 trillion to N17.126 trillion.\nChannels Television had also obtained a communication addressed to the Presidency by the Clerk to the National Assembly, Mr Ojo Amos, indicating that the bill had been transmitted by the National Assembly."
  },
  {
    "headline": "NCDC Confirms 1,139 New COVID-19 Cases In 18 States, FCT",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says 1,139 new infections were confirmed on Thursday, as the country’s daily COVID-19 cases continue to rise.\nGiving an update on its efforts at containing the spread of the disease, the agency revealed in a Facebook post on Friday that the new cases were confirmed in 18 states and the Federal Capital Territory (FCT).\nSimilarly, there was a backlog of confirmed cases from Lagos State from December 17 to 29 (321), while 99 infections were recorded on December 30.\nData from the NCDC revealed that one more fatality was recorded on Thursday, raising the nation’s toll to 3,030.\nThe NCDC said it has collected and tested a total of 3,823,309 samples while 24,480 cases are still active in various states and the FCT."
  },
  {
    "headline": "Omicron: UK Foreign Secretary Pledges £105m In UKAid To Nigeria, Other African Countries",
    "summarized_story": "The UK Foreign Secretary, Liz Truss, has pledged up to £105 million of UK emergency aid to help vulnerable countries tackle the Omicron Covid-19 variant, with a particular focus on Africa.\nDoses donated by the UK have reached four continents and provided vital protection from Covid-19 in countries including Nigeria, Angola, the Democratic Republic of Congo, Ethiopia, Ghana and Rwanda.\nMillions more vaccines will be sent to Nigeria and other countries in 2022, including 20 million Oxford-AstraZeneca doses and 20 million Janssen doses.\nI am proud that we have also delivered over 30 million vaccines to benefit our friends around the world this year.\n“I am proud that we have already delivered over 30 million vaccines to our friends abroad."
  },
  {
    "headline": "NNPC Transformation, PIA Passage, Economic Recovery – Lai Lists Buhari’s 2021 Achievements",
    "summarized_story": "The Nigerian economy was hit by the pandemic in mid- 2020, and the economic disruptions led to a recession.\nMany have described it as the most profound event in the Nigerian oil and gas space in the last 20 years.\nOut of the total length of the Federal road network of about 35,000km, the first phase of the proposed project will cover a total length of about 1,963.24km.\nThe Digital Economy sector was highly instrumental in lifting the Nigerian economy out of recession.\nThis therefore indicates that the Digital Economy sector has proven to be vital for the diversification of the Nigerian economy."
  },
  {
    "headline": "‘Joke Of The Year,’ PDP Tackles Buhari Over 2021 Achievement List",
    "summarized_story": "The Peoples Democratic Party (PDP) has described the list of President Muhammadu Buhari’s achievements in 2021 as a ‘joke of the year.’Minister of Information and Culture, Lai Mohammed had earlier said on Thursday that despite the challenges in 2021, the Buhari administration made “tremendous” progress in fighting insecurity and growing the economy.\nHe also highlighted “major achievements” which he said the Buhari administration recorded in 2021.\nToday, our nation has become the poverty capital of the world due to the mismanagement, corruption, and recklessness of the APC government.\n“It is self-evident that only the APC gangsters can claim to have performed in the face of life discounting experiences of the ordinary Nigerians.\nThe PDP challenges the APC government to name one landmark project it conceptualized, commenced and completed in the last six years”."
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Tens of Thousands Flee as Colorado Fires Burn Hundreds of Homes",
    "summarized_story": "Hundreds of homes have been destroyed and tens of thousands evacuated in Colorado, United States, after wildfires driven by high winds engulfed two towns near the state capital, Denver.\nThe neighbouring towns are roughly 32km (20 miles) northwest of Denver, a city of more than 715,000 people.\nAccording to the Denver Post, the fire is the most destructive in Colorado’s history in terms of the number of homes destroyed.\nThe National Weather Service (NWS) said in a social media post that smaller fires were also reported in at least two areas.\nThe extent of property losses was not immediately known, but a news station aired footage of homes engulfed in flames near Louisville."
  },
  {
    "headline": "South Korea’s Ex-President Park Freed after Nearly 5 Years in Prison",
    "summarized_story": "Former South Korean President Park Geun-hye was released from prison on Friday nearly five years after being convicted of corruption, fuelling debate over whether she would play any role ahead of a March presidential election.\nBroadcasters showed Park leaving a Seoul hospital, where she had stayed since last month for medical treatment, after correction officials delivered a letter of pardon at midnight.\nPark’s release comes as her old party, the main opposition conservative People Power Party, and Moon’s Democratic Party are in a tight presidential race.\nAbout 200 people held a protest in downtown Seoul against her release, the Yonhap news agency reported.\nPeople Power’s presidential candidate Yoon Suk-yeol, who investigated the Park scandal as prosecutor-general, said on Friday he had done his job as a public servant, adding he would like to visit Park when her health improved."
  },
  {
    "headline": "Putin Warns Biden Against Major Sanctions Over Ukraine",
    "summarized_story": "Russian President Vladimir Putin has told his United States counterpart Joe Biden that any sanctions over Ukraine would be a big mistake, an aide to the Kremlin said on Thursday, after the two leaders spoke by phone ahead of lower-level talks next month.\nIt was the second time Putin and Biden held direct talks this month, as the Russian military buildup near Ukraine continues to heighten fears that Russia may be preparing for an imminent invasion of its neighbour.\nIn a statement describing Thursday’s talks, the White House said Biden urged Putin to “de-escalate” the simmering tensions and “made clear that the United States and its allies and partners will respond decisively if Russia further invades Ukraine”.\nThose discussions in Geneva are set to take place on January 10, while Moscow and NATO representatives are expected to meet on January 12.\nPutin has said Russia is not looking for war with its neighbour but wanted an “immediate” response from the US and its allies to its demand for security guarantees."
  },
  {
    "headline": "Sudanese Security Forces Kill Four Anti-Coup Protesters",
    "summarized_story": "Sudanese security forces have shot four people dead during nationwide protests, a doctors’ group said, as tens of thousands of people marched against military rule.\nSecurity forces fired tear gas and stun grenades as protesters marched through Khartoum and the neighbouring cities of Omdurman and Bahri towards the presidential palace on Thursday.\nThe Central Committee of Sudanese Doctors (CCSD) said four protesters were shot dead by security forces, three of them in Omdurman.\nReporting from Khartoum, Al Jazeera’s Mohamed Vall said the situation in Omdurman had developed into a serious confrontation between the security forces and anti-coup protesters.\nEarlier on Thursday, Security forces confronted protesters about 2km (1.2 miles) from the palace in the centre of the capital, Reuters news agency reported, adding that there was a heavy security presence in the area."
  },
  {
    "headline": "Osimhen, Balogun, Dennis, Shehu to Miss AFCON as Health Concerns Force Nigeria to Amend 28-Man List",
    "summarized_story": "Lively forward Victor Osimhen’s positive test to the coronavirus a couple of days ago and injury to the versatile Abdullahi Shehu have forced Nigeria to amend its final 28-man list for the 33rd Africa Cup of Nations starting in Cameroon next weekend.\nAjayi can also play as a midfielder.\nOsimhen’s absence paves way for Greece-based Henry Onyekuru who was also at the last finals in Egypt.\nIn-form rapid raider Emmanuel Dennis, whose English Premiership club is baring fangs, has been excused to provide room for Czech Republic –based forward Peter Olayinka.\nThe 33rd Africa Cup of Nations finals will end on 6th February."
  }
]