[
  {
    "headline": "Okpala shines in Heat’s win over Bucks",
    "summarized_story": "D’Tigers forward, KZ Okpala, produced his best performance for Miami Heat this season in their 113-104 win over NBA champions Milwaukee Bucks on Thursday.\nMiami were without star forwards, Jimmy Butler and Bam Adebayo for the encounter while the Bucks had the compliment of their top players.\n“They coaches have been seeing me everyday and they believe in me and because they believe in me, so I just had to come in and believe in myself as well and play my game,” Okpala said after the game.\nHe’s a great outside defender just moving around and sliding so I just stayed active.”Okpala has averaged 2.1 points, 1.7 rebounds, and 0.5 assists per game this season.\nHis compatriot, Gabe Vincent recorded three points, three assists and one rebound in 15 minutes on the court."
  },
  {
    "headline": "Dennis good enough for big EPL teams – Ranieri",
    "summarized_story": "Watford manager, Claudio Ranieri, says Nigerian forward, Emmanuel Dennis is good enough to play for some of the big teams in the English Premier League.\nDennis has been an instant hit for the Hornets in the Premier League since completing a move to the club from Belgian giants Club Brugge in the summer for a fee reported being in the region of £3.4m.\nThe 24-year-old had previously been linked to Manchester United and Arsenal while at Brugge and Ranieri believes that he could play for such teams so long he continues to improve.\n“I think he could play for these big teams,” Ranieri told SkySports.\nI’m sure at the end of the season he can go into the big teams – but also he can stay in Watford!"
  },
  {
    "headline": "Simon willing to play any position for Eagles at AFCON",
    "summarized_story": "Super Eagles winger, Moses Simon, says he is willing to play any position for the team at the 2021 Africa Cup of Nations in Cameroon in January.\nRohr has recently preferred the 3-5-2 formation, which has seen the Nantes forward drop to a right-wing position.\nThe former Gent winger says he is willing to play as a goalkeeper for his country, so long the manager has confidence in his abilities.\nHe has a lot of strings to his bow,” the Eagles gaffer added.\nHeading into the AFCON in Cameroon, the Eagles boasts of strong options in the forwards including Samuel Kalu, Samuel Chukwueze, Emmanuel Dennis as well as skipper Ahmed Musa."
  },
  {
    "headline": "Yuletide: Ban on fireworks still in force — Delta CP",
    "summarized_story": "The Police Command in Delta says it will enforce all the extant laws prohibiting the use of fireworks during the Yuletide.\nAli warned parents to ensure that their wards did not violate the laws before, during and after the festive season.\nThe police commissioner also warned traders dealing in fireworks to desist from the sale of the products.\n“The ban on the use of fireworks is still in force and the Command will enforce all the extant laws prohibiting the use of fireworks such as ‘knock-out’, ‘banger’ and others especially during this Yuletide season.\nAli, however, directed all Area Commanders, Divisional Police Officers and Tactical Commanders to ensure strict compliance with the ban on fireworks in their respective Areas of Responsibility."
  },
  {
    "headline": "Bill for crèche at work places passes 2nd reading",
    "summarized_story": "A bill for an Act to amend the Labour Act and ensure the establishment of creches in public and private workplaces has passed the second reading at the House of Representatives.\nThe bill which sought to boost breastfeeding among working-class mothers was sponsored by Rep. Sergius Ogun (PDP-Edo) at plenary on Thursday.\nLeading the debate, Ogun said that the provisions of the Labour Act which provided for four months of maternity leave for nursing mothers may be insufficient for exclusive breastfeeding of babies.\n“Exclusive breastfeeding has the potential to provide stronger immunity, reduced risk of infections and resistance to childhood diseases.\nHe referred the bill to the Committee on Labour, Employment and Productivity for further legislative actions."
  },
  {
    "headline": "Oromoni’s death, violence in schools further signs of govt failure",
    "summarized_story": "We have not mentioned the local governments because the state governments have totally emasculated that tier of governance in flagrant violation of the Constitution and democratic ethos which those running governments at federal and states sworn to protect.\n“The collapse of discipline and orderliness in our schools is reflective of the collapse of these virtues in the larger society.\n“What the LATSMA officers did was symptomatic of how Nigerian governments ambush the citizens, and still go ahead to punish these citizens who try to disentangle themselves.\n“State governments should remove their stranglehold on local governments so that the third tier can, along with the communities they serve, pay more attention to the educational institutions in their respective areas.\nParents and guardians too should be more alive to their responsibility as their failure at home is reflecting on undisciplined behavior of their children.”"
  },
  {
    "headline": "132 youths to access N1bn fund as LASG, EbonyLife organize cinematography training",
    "summarized_story": "By Bose AdelajaTo reduce idleness among Nigeria youths, Lagos State Government has partnered EbonyLife Creative Academy (ELCA) to train 132 Nigeria youths in various skills of cinematography just as the youths will access N1 Billion fund by the government.\nThe three months training was facilitated through Lagos State Creative Industries Initiative (LACI), under the Ministry of Tourism, Arts and Culture with features in film making and media content production.\nREAD ALSO:Police arrest man with fresh human parts in IkoroduSpeaking at the event, Lagos State Governor, Mr. Babajide Sanwo-Olu admonished them to judiciously utilise the opportunity given to them saying t sum of N1 Billion has been set aside by the government.\n“The Multi Million Naira project was advertised on various platforms and over 2,000 youths applied but not all of them were admitted into the school.\nPermanent Secretary, Ministry of Tourism, Arts and Culture, Lagos State, Mrs. Adenike Adedoyin-Ajayi urged them to justify the investment by the government."
  },
  {
    "headline": "Bandit’s storm Abuja community, abduct 8 persons, kill housewife",
    "summarized_story": "Armed bandits have reportedly shot and killed a house-wife and abducted 8 eight other residents at Piri, an Abuja community in the Kwali Area Council of the FCT.\nThe kidnappers were said to have stormed the remote community community in the wee hiurs connecting Tuesday and Wednesday morning.\nREAD ALSO:Banditry, insurgency, responsible for deplorable state of Army Barracks — SenateA resident, Yakubu Saidu told newsmen that the kidnappers first attacked two houses and whisked away two persons amid sporadic gunshots.\nThey were said to have returned to the community on Wednesday during which Salamatu was killed.\n“Some gangs of the kidnappers, who positioned themselves at strategic places within the community, invaded two houses and whisked away three residents."
  },
  {
    "headline": "Insecurity: Government to restore mobile telecom network in Katsina",
    "summarized_story": "Dwellers in the 13 frontline local government areas in Katsina State who were denied access to mobile telecommunication service due to the incessant banditry attacks in their community will start enjoying the services once again as government has concluded plans to lift the ban.\nThe Special Adviser on Security Matters in the state, Ibrahim Katsina, revealed this in a telephone conversation with DAILY POST on Friday.\n“As I speak to you, network have been restored in some local government areas,” Katsina was quoted to have said.\nThe 13 local governments disconnected from the mobile telecommunication network include: Sabuwa, Faskari, Dandume, Batsari, Danmusa, Kankara, Jibia, Safana, Dutsin-Ma, Funtua, Bakori, Malumfashi and Kurfi LGA.\nKaduna and Jigawa State Governments had since restored telecommunication network in the affected frontline areas of the state."
  },
  {
    "headline": "Install CCTV in dormitories, classrooms of pubic, private schools – MSSN tells governments, school owners",
    "summarized_story": "The Muslim Students’ Society of Nigeria (MSSN), Lagos State Area Unit has appealed to governments at all levels and school owners to without waisting more time, install Closed-circuit Television (CCTV) in dormitories, classrooms and premises of both day and boarding private and public schools.\nThe organisation noted that this is necessary in order to reveal happenings in schools across the country.\nThe organisation explained that when installed, the CCTV would be revealing various cases of sharp practices among teachers, students and other staff of public and private schools in the country.\nMSSN, while reacting, recommended installation of CCTV in all dormitories, classrooms and premises of both private and public schools.\nHe said, “The organisation hereby recommends the installation of CCTV in all dormitories, classrooms, and premises of both day and boarding of private and public schools."
  },
  {
    "headline": "Revealing Fani-Kayode’s medical condition totally wrong – Egor EFiok blasts ex-wife, Chikwendu",
    "summarized_story": "Egor Efiok, multi-award-winning British/Nigerian producer has criticised former Beauty Queen, Precious Chikwendu for revealing the medical condition of her ex-husband, Femi Fani-Kayode.\nBut, Egor Efiok, who is also a friend of Chikwendu, told DAILY POST that Chikwendu should focus on havingaccess to her children rather than revealing Fani-Kayode’s private medical condition.\nWhen asked if she’s in support of her friend’s decision to publicly disclose Fani-Kayode’s medical condition, Efiok told DAILY POST, “No, sorry I’m not in support of this.\nThe focus should solely be on getting access to her children and preventing him from harassing her further; not revealing his private medical condition.\nIt is totally wrong to publicly mock someone’s medical condition, regardless of how terrible that person is."
  },
  {
    "headline": "Investigate your officers who wrongly detained ASCSN President – Labour union tells NAPTIP DG",
    "summarized_story": "Our correspondent gathered that Audu was arrested and detained by NAPTIP officials due to the crisis that is rocking the labour union.\nNational Coordinator of AWC, Comrade Andrew Emelieze while condemning the arrest and detention of the ASCSN President, enjoined NAPTIP DG to investigate the officers who were used to arrest the ASCSN President.\nEmelieze who spoke with DAILY POST in Ibadan on Thursday also urged NAPTIP to drop all charges against the ASCSN President.\nEmelieze, who called the NAPTIP DG to investigate the officers, insisted that NAPTIP DG should not allow the agency to be used to settle union matters.\nWe therefore call for the investigations of officers involved in the arrest and detention of the ASCSN President."
  },
  {
    "headline": "Insecurity: JNI sends a powerful message to President Buhari, Northern Governors’ Forum",
    "summarized_story": "According to him, the citizens are becoming more and more aggressive, and agitated.\nWhile condemning the killing and burning of 43 people at Gidan Bawa village along Sabon Birni- Sokoto road by bandits, he expressed the condolences of JNI to the families of the victims.\nHe said, despite the establishment of combined security forces along known routes where bandits operate, they still carry out their dastardly acts freely.\n“What really is the matter that the government has not been able to halt the operations of bandits against innocent citizens particularly in North Western Nigeria?\n“Nigerians are desperately yearning for concrete actions against all forms of criminalities,” he said."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Omicron forces Sanwo-Olu to suspend planned peace walk",
    "summarized_story": "By Oyebola Owolabi, Moses Emorinken, Abuja and Alao AbiodunLagos State Governor Babajide Sanwo-Olu has shelved the proposed peace walk billed for this month.\nSanwo-Olu, in his last address on Tuesday, invited some known faces of the #EndSARS protest in the state in October 2020 to a peace walk for “the healing of Lagos”.\nStudents of the Lagos State University, clerics, other groups expressed solidarity to join the Walk of Peace.\nIt noted that only fully vaccinated Nigerians with a six-month interval between their last vaccinations will be eligible to get the booster doses.\n“It is pertinent to reiterate the fact that the Nigerian COVID-19 vaccination programme is science-driven."
  },
  {
    "headline": "106.341-klm Kano-Maiduguri Road inaugurated",
    "summarized_story": "Nigerians were yesterday told to expect the inauguration of more road projects across the nation.\nPresident Muhammadu Buhari gave the assurance in Azare, Bauchi State, during the inauguration and handing over of the 106.341-kilometer Kano-Maiduguri Road, Section III (Azare-Potiskum) in Bauchi and Yobe states.\nHe further applauded the collaborative effort between the Federal and Bauchi State government to restore the Bauchi-Ningi and Bogoro-Bauchi-Dawaki roads damaged by flood.\nAccording to the Permanent Secretary in the Ministry of Works and Housing, Mr Babangida Hussaini, the Kano-Maiduguri Section III (Azare -Potiskum) connects four Local Government Areas in Bauchi (Azare and Dambam) and Yobe (Nangere and Potiskum) states respectively.\nYesterday’s inauguration of Azare- Potiskum Section III (Azare – Potiskum) marked the fourth in the series after the Sokoto-Tambuwal-Jega-Kontagora-Makera Road in Sokoto and Kebbi states; Vandeikya-Obudu Cattle Ranch Road in Benue and Cross River states and Nnewe-Oduma Road Section in Enugu and Ebonyi states."
  },
  {
    "headline": "Obaseki: new SANs are inspiration to youths",
    "summarized_story": "Edo State Governor Godwin Obaseki has said the three new Senior Advocates of Nigeria (SANs) from the state: Prof. Oluyinka Osayeme Omorogbe, Prof. Edobo Bright Omoregie and Dr. Ehiogie West-Idahosa, are inspiration to youths.\nRead Also; 72 new SANs for inauguration December 8Obaseki said: “I heartily congratulate Prof. Omorogbe, Prof. Omoregie and Dr. West-Idahosa on the attainment of the exalted rank of SAN.\n“The government and people of Edo State are proud of your accomplishments and what you stand for in the practice of the legal profession.\nYou are an inspiration to Edo youths.\n- Advertisement -“At a time youths are looking for role models, you present a sterling example of who they should aspire to be."
  },
  {
    "headline": "Bayelsa youths praise Dickson, Diri over factory",
    "summarized_story": "Youths in Bayelsa State, under the auspices of Bayelsa West Youth Leaders Forum (BWYLF), have praised former Governor Seriake Dickson for initiating a 60 metric tonnes of cassava processing plant at Ebedebiri in Sagbama Local Government.\nThe body said the project, when inaugurated, would employ thousands of youths in the district and the state, a development that would empower youths.\nThe statement said: “The starch, cassava and garri factory is one of the biggest of its kind in Nigeria.\nIt has the capacity to generate thousands of jobs for deserving youths in Bayelsa West and the state at large.\nIt said the continuation of the project by Diri would consolidate his administration’s prosperity agenda."
  },
  {
    "headline": "Katsina Commissioner murder: We’ve made arrest – Police Chief",
    "summarized_story": "From Agaju Madugba, KatsinaThe Police authorities in Katsina have confirmed the killing of the Commissioner for Science and Technology, Dr. Nasir Rabe, on Wednesday night, at his residence at the Fatima Shema Housing Estate.\nThe Katsina State Commissioner of Police, Sanusi Buba, told reporters on Thursday evening that, “we have successfully evacuated the corpse to the hospital and investigation has started.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“A suspect has been arrested and investigation has since begun.”Governor Aminu Bello Masari was also among the numerous dignitaries who visited the scene of the murder on Thursday.\nReports say the body of the slain Commissioner was discovered in his residence late on Thursday morning after efforts to reach him on telephone failed."
  },
  {
    "headline": "Ban on Twitter not violation of citizens’ rights – Court declares",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court has held that the restriction of Nigerians to access to twitter by the Federal Government did not amount to a violation of citizens’ right to freedom of expression and accordingly dismissed the suit filed by Social-Economic Rights and Accountability Project (SERAP).\nDelivering judgment on Thursday,Justice Obiora Egwuatu further held that the ban on twitter in Nigeria did not in anyway violate the constitutionally guaranteed press freedom.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said since Nigerians have other social media platforms to express themselves, and that talks were at advance stage to resolve issues with the Nigerian government, the ban on twitter cannot be said to have constrained Nigerians’ freedom.\nThe judge proceed to dismiss the suit and awarded N100million cost against SERAP and in favour of the respondents."
  },
  {
    "headline": "Insecurity: Bandits have turned north to killing field, says Sultan",
    "summarized_story": "The Sultan who indicated that the bandits are holding the region spellbound especially northwest, and was particularly concerned that most of the killings are not reported or underreported.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nWe need to come up with possible solutions to the problems of Nigeria, particularly as regards rising insecurity.\nThe Sultan lamented that terrorists unleash terror on communities and kill people on a daily basis in north “freely”, and should be stopped forthwith.\n“We have to be careful in the way we handle, say and do things as religious leaders."
  },
  {
    "headline": "Insecurity: Gunmen massacre 16 worshippers in Mosque in Niger community",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nSeveral other worshippers sustained various degree of gunshot injuries during the attack and are currently receiving treatment at the Kontagora General hospital.\nThe state Commissioner of Police, Mr Monday Bala Kuryas who confirmed the incident however said the number of death are nine worshippers, describing the incident as very unfortunate.\nHe however maintained that security agencies will never shy away from their responsibility of protecting lives and property of the people of the state and Nigerians in particular.\nClick here ."
  },
  {
    "headline": "(Updated) Buhari commissions locally built warship in Lagos",
    "summarized_story": "President Muhammadu Buhari arrive the Nigerian Navy Dockyard in Lagos for the commissioning of a locally built warship, NNS OJI, which he laid the keel in 2017.\nPresident Buhari came for the commissioning the third Seaward Defence Boat (SDB) christened NNS OJI, built by the Naval Dockyard.\nThe locally built warship NNS Oji, is the third of its series to be locally built at the Naval Dockyard Limited, Lagos solely by Navy engineers after the successes of NNS Adoni, and NNS Karaduwa, commissioned in 2016 by President Buhari.\nSpeaking at the event, , President Buhari said the new inductions to the Naval fleet would boost their capability in securing Nigeria’s maritime domain.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today ."
  },
  {
    "headline": "Made-in-Nigeria Vessel: Buhari Inaugurates NNS Oji Vessel",
    "summarized_story": "President Muhammadu Buhari on Thursday in Lagos inaugurated a Seaward Defence Boat (SDB) III built by the Nigerian Navy.\nThe indigenously constructed SDB, NNS Oji, is the third in its series to be locally built at the Naval Dockyard Limited, Lagos, solely by Naval engineers following the successes recorded in the building of NNS Adoni and NNS Karaduwa, inaugurated in 2016 by President Buhari.\n‘‘Let me assure you that the government will continue to support the ideals of the Nigerian Navy in the performance of its constitutional duties.\n“God bless the Nigerian Navy, God bless the Federal Republic of Nigeria.\n‘‘Local partners should share in this commendation for their efforts at local facilitation as outlined in the government’s local content policy,’’ he said."
  },
  {
    "headline": "Buhari: Akande, a Victim of Obasanjo’s Diabolical Political Double-cross",
    "summarized_story": "‘‘He emerged as Governor of Osun State in 1999 when the military handed over to the civilians.\n”His first action was to stop payment of “critical allowances” a euphemism for government money customarily shared by the big boys in Osun State.\n”By 2003 Chief Akande had virtually sanitised governance in Osun State having cleared some of the troublemakers from his government and, though reluctant to serve a second term, he was persuaded to run again”.\n”Chief Akande was unanimously chosen as the first Chairman of this great coalition.\nA perfect public officer, he said."
  },
  {
    "headline": "Saudi Arabia Bans Flights from Nigeria over Omicron Fears",
    "summarized_story": "The Saudi Arabian government has suspended all incoming flights and entry to the Kingdom for non Saudi nationals coming directly or indirectly from Nigeria over fears of Omicron variant of coronavirus, which had been reported in Nigeria and several other countries around the world.\nA circular by the General Authority of Civil Aviation (GACA) to all airlines operating in the airports of the Kingdom of Saudi Arabia, including private aviation, announced the suspension of flights coming from and to Nigeria.\nThe Saudi Arabian government also stipulated home quarantine for a period of five days for Saudi citizens coming from Nigeria, who must undertake PCR examination on the first day and the fifth day.\nThe GACA circular said failure to comply with the instruction was an explicit violation of government orders, warning that legal procedures would be initiated against violators.\nNigeria has a large Muslim population which embarks on pilgrimage to the Kingdom’s holy sites in Mecca and Medina annually in observance of the pillars of Islam."
  },
  {
    "headline": "Raid on Odili’s Residence: We Shall Resist Clandestine Attempts to Silence Us, CJN Warns",
    "summarized_story": "The CJN spoke against the recent raid on the residence of the second most senior Justice of the Supreme Court, Mary Peter-Odili, by alleged security operatives.\nAccording to Muhammad, the silence of the judiciary should never be mistaken for stupidity or weakness.\n“The silence of the judiciary should never be mistaken for stupidity or weakness”, he said.\n“We shall begin to resist any clandestine attempt to silence or ridicule us to oblivion.\nSpeaking further, Dongban-Mensem further disclosed that the court disposed of 5, 669 cases and 10, 798 motions in the same year."
  },
  {
    "headline": "RenCap Predicts M&A among Nigeria’s Mid-tier Banks",
    "summarized_story": "“We have not seen any meaningful capital being allocated to Nigeria, given the central bank’s capital controls and exchange rate policy over the last one to two years.\nOn what prompted its upgrade of Nigeria’s rating, he said economic reforms and policies of the federal government had positively affected Nigeria’s rating.\nAdepoju said: “The cash reserve requirement policy of the central bank is very massive, in terms of the impact on the liquidity in the local market.\n“So, you see more of the liquidity sitting with the central bank, earning zero per cent.\n“Never would you see cash reserve going to 40 per cent threshold."
  },
  {
    "headline": "BREAKING: Katsina’s Commissioner For Science, Technology, Nasir Murdered By Gunmen",
    "summarized_story": "The Katsina State Commissioner for Science and Technology, Dr Rabe Nasir, has been assassinated.\nAccording to Century Chronicle, the commissioner was assassinated in his residence located at Fatima Shema Housing Estate in the Katsina metropolis.\n“He was shot after prayer in his residence here in Fatima Shema Estate.\nThe body of the slain commissioner is still inside the residence,” the source said.\nDr Nasir was educated at the University of Abuja, University of Kansas Lawrence, Bayero University Kano, and Government Secondary School Giwa, Kaduna State."
  },
  {
    "headline": "BREAKING: Katsina’s Commissioner For Science, Technology, Nasir Murdered By Gunmen",
    "summarized_story": "The Katsina State Commissioner for Science and Technology, Dr Rabe Nasir, has been assassinated.\nAccording to Century Chronicle, the commissioner was assassinated in his residence located at Fatima Shema Housing Estate in the Katsina metropolis.\n“He was shot after prayer in his residence here in Fatima Shema Estate.\nThe body of the slain commissioner is still inside the residence,” the source said.\nDr Nasir was educated at the University of Abuja, University of Kansas Lawrence, Bayero University Kano, and Government Secondary School Giwa, Kaduna State."
  },
  {
    "headline": "BREAKING: Katsina’s Commissioner For Science, Technology, Nasir Murdered By Gunmen",
    "summarized_story": "The Katsina State Commissioner for Science and Technology, Dr Rabe Nasir, has been assassinated.\nAccording to Century Chronicle, the commissioner was assassinated in his residence located at Fatima Shema Housing Estate in the Katsina metropolis.\n“He was shot after prayer in his residence here in Fatima Shema Estate.\nThe body of the slain commissioner is still inside the residence,” the source said.\nDr Nasir was educated at the University of Abuja, University of Kansas Lawrence, Bayero University Kano, and Government Secondary School Giwa, Kaduna State."
  },
  {
    "headline": "BREAKING: Court Strikes Out N2billion Suit Against SaharaReporters, Others Over Alleged Defamation Of Buhari's Minister, Malami",
    "summarized_story": "The Federal High Court in Abuja has struck out a N2 billion suit instituted against SaharaReporters and others for alleged defamatory publication against the Attorney General of the Federation and Minister of Justice, Abubakar Malami.\nA group, Incorporated Trustee of Global Integrity Crusade Network, had in the suit accused SaharaReporters, Vanguard Media Limited and two others of defamation against Malami.\nSee Also News Sowore Tackles Malami's Proxy Over Suit Challenging SaharaReporters Story on Justice Minister's Lavish LifestyleBut during the trial held on Thursday, the court dismissed the case.\nIn his judgement, justice Obiora Egwuatu awarded N100,000 against the litigants, saying they have no right to approach the Federal High Court to sue on behalf of the AGF.\nSee Also Corruption REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son Uncovered"
  },
  {
    "headline": "BREAKING: Court Strikes Out N2billion Suit Against SaharaReporters, Others Over Alleged Defamation Of Buhari's Minister, Malami",
    "summarized_story": "The Federal High Court in Abuja has struck out a N2 billion suit instituted against SaharaReporters and others for alleged defamatory publication against the Attorney General of the Federation and Minister of Justice, Abubakar Malami.\nA group, Incorporated Trustee of Global Integrity Crusade Network, had in the suit accused SaharaReporters, Vanguard Media Limited and two others of defamation against Malami.\nSee Also News Sowore Tackles Malami's Proxy Over Suit Challenging SaharaReporters Story on Justice Minister's Lavish LifestyleBut during the trial held on Thursday, the court dismissed the case.\nIn his judgement, justice Obiora Egwuatu awarded N100,000 against the litigants, saying they have no right to approach the Federal High Court to sue on behalf of the AGF.\nSee Also Corruption REVEALED: Multi-million Naira Property Built By Nigeria's Attorney-General, Malami For 22-year-old Son Uncovered"
  },
  {
    "headline": "Nine worshippers killed as gunmen attack mosque in Niger",
    "summarized_story": "Nine worshippers have been killed by gunmen in an attack on a mosque at Tungan Ba’are village in Mashegu LGA of Niger state.\nAdvertisementAccording to the Niger police command, six other people were injured in the attack that took place on Thursday.\nMonday-Bala Kuryas, commissioner of police in the state, said the worshippers were killed during morning prayer.\nIn October, some worshippers were killed when gunmen invaded a mosque at Mazukaka village in the same LGA of the state.\nThe gunmen also abducted seven other worshippers from the mosque."
  },
  {
    "headline": "Nine worshippers killed as gunmen attack mosque in Niger",
    "summarized_story": "Nine worshippers have been killed by gunmen in an attack on a mosque at Tungan Ba’are village in Mashegu LGA of Niger state.\nAdvertisementAccording to the Niger police command, six other people were injured in the attack that took place on Thursday.\nMonday-Bala Kuryas, commissioner of police in the state, said the worshippers were killed during morning prayer.\nIn October, some worshippers were killed when gunmen invaded a mosque at Mazukaka village in the same LGA of the state.\nThe gunmen also abducted seven other worshippers from the mosque."
  },
  {
    "headline": "Mamora: Less than one-third of 30,000 primary health centres in Nigeria functional",
    "summarized_story": "Olorunnimbe Mamora, minister of state for health, says primary healthcare centres (PHCs) require adequate funding to become functional.\nAdvertisementMamora spoke on Thursday at a public hearing organised by the house of representatives committee considering bills seeking to establish federal medical centres.\nThe minister said less than one-third of the 30,000 primary healthcare centres in the countries are functioning optimally.\nWhether federal medical centres, whether they are teaching hospitals, even at the primary health centre level in the communities,” he said.\nTertiary centres are supposed to be referral centres."
  },
  {
    "headline": "Mamora: Less than one-third of 30,000 primary health centres in Nigeria functional",
    "summarized_story": "Olorunnimbe Mamora, minister of state for health, says primary healthcare centres (PHCs) require adequate funding to become functional.\nAdvertisementMamora spoke on Thursday at a public hearing organised by the house of representatives committee considering bills seeking to establish federal medical centres.\nThe minister said less than one-third of the 30,000 primary healthcare centres in the countries are functioning optimally.\nWhether federal medical centres, whether they are teaching hospitals, even at the primary health centre level in the communities,” he said.\nTertiary centres are supposed to be referral centres."
  },
  {
    "headline": "Katsina commissioner 'murdered' at his residence",
    "summarized_story": "Rabe Nasir, commissioner for science and technology in Katsina state, has been killed.\nAdvertisementHe was said to have been killed on Wednesday evening at his residence in Fatima Shema estate of Katsina state.\nSanusi Buba, Katsina commissioner of police, confirmed the discovery of the body during a visit to the deceased’s residence on Thursday.\nBuba also said a suspect has been arrested and investigation is ongoing.\nAdvertisement“As you can see, we’ve successfully evacuated the corpse to the hospital and investigation has started,” he said."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nIn Ivory Coast, CinetPay’s first market, up to 75% of the population owns a mobile money account whereas less than 25% have a bank account.\nCinetPay’s payment gateway aggregates all mobile money available in the region, enabling merchants, through digital accounts, to accept online payments and reduce the reliance on cash.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "“We like to invest in businesses where the founders are in control.” – Ian Lessem on HAVAÍC’s investment thesis",
    "summarized_story": "Techpoint Africa had a chat with Ian Lessem, where he explained the firm’s origins and how they make investment decisions.\nImportantly, we like to invest in businesses where the founders are in control.\nThere are many, but in South Africa, it would be hearX, which provides audiology solutions to the mass market using technology.\nIn South Africa, we call them spaza shops, but they’re just local shops.\nSo while their main operations are in South Africa, Kenya, or Nigeria, they are very much international businesses."
  },
  {
    "headline": "Jega Ex-INEC chair moans over Nigeria’s cash and carry judges",
    "summarized_story": "The outspoken but widely regarded former chairman of Nigeria’s Independent National Electoral Commission (INEC), Attahiru Jega, has lashed out at judges and lawyers enriching themselves from participation in election cases in the country.\nAccording to Jega who spoke at the Owolabi Afuye memorial lecture organized by the Nigeria Bar Association (NBA), said the corrupt judges quickly went into retirement after they had made so much money selling judgments to the highest bidders.\nThis way, he said they escaped being sanctioned by the National Judicial Council.\n“Similarly, many judges have become notorious for corrupt enrichment for ‘cash and carry’ judgments, especially in election matters generally and in election tribunals, more specifically.\nHe said while some argue with those who describe Nigeria as a failed state, no person would dispute that Nigeria was fast failing."
  },
  {
    "headline": "How Nigeria’s external debt stock ballooned to $70bn",
    "summarized_story": "The World Bank international debt report 2022 has provided deeper insights into how Nigeria’s total external debt stock ballooned from just $18billion in 2010 to a staggering $70 billion in 2020.\nThe report breaks down the relevant data on Nigeria’s total external debt stock into summary of external debt data by debtor type, external debt stock by creditor type, net financial inflows as well as debt ratios.\nBy 2018, the total external debt stock of Nigeria had climbed to $54.184, $60.006 in 2019 and then $70.318 the following year.\nRead Also: Nigeria’s external debt stock skyrockets by 252.2% in a decade – World BankOf the external debt stock in 2020, a total of $5.958 is classified as “use of IMF credit” and $11.415 accounted by debt owed the World Bank itself while the total long-term external debt was put at $64.370.\nSimilarly, by 2020, the ratio of reserves to the country’s external debt stocks stood at 52 per cent."
  },
  {
    "headline": "Christmas shopping in Dubai drives demand for dollar",
    "summarized_story": "Christmas shopping in Dubai occasioned by Emirates Airline resumption of flight between Dubai and Nigeria is now driving demand for the dollar despite selling off of hoarded foreign exchange (FX) by speculators, BusinessDay findings show.\nCalculations based on information provided by one of the travel agencies show that 6,860 people travel to and fro Dubai weekly.\nOn dollar inflows, the BDC operator said supply is not commensurate with demand as some people who go to the banks to purchase dollars could not get due to documentation issues.\nSome importers who could not get enough dollar supply patronise such inflows abroad at a very high cost, he said.\nThe CBN limits the amount of dollar purchase for PTA to $4,000 and BTA for $5,000 quarterly."
  },
  {
    "headline": "Edo govt visits Idogbo secondary school, assesses level of destruction – Nigerian Observer",
    "summarized_story": "Speaking shortly after inspecting the school facilities, Commissioner for Education, Dr. Joan Osa-Oviawe, described the event as “disturbing.”According to her, “This is a very disturbing occurrence in this school.\nThe population of this school is high, so it’s important that we address this issue before this school is reopened.\nWe are not going to stand for this kind of behavior; the parents and the students are going to be held accountable for this,” she reassured.\nEarlier, the principal of Idogbo Secondary School, Mr. Sunday Osaretin, while giving the account of what transpired, said that some students and unknown hoodlums numbering 49, invaded the school premises hauling dangerous objects at students and teachers.\nOsaretin said that it took the efforts of the police personnel and vigilante to put the situation under control."
  },
  {
    "headline": "Olayiwola Afolabi: Another Mile-age of His Unique Philanthropy – Nigerian Observer",
    "summarized_story": "Olayiwola Afolabi expectedly continued with his usual media comments and unique philanthropy.\nIn June 2021, Afolabi’s attention was on the unsafe Benin/Auchi Road in Edo State.\nLater in the July month, Afolabi boldly waded into the raging conflict between herdsmen and farmers in Edo state and without mincing words urged Edo state Government to pass the anti-open-grazing bill, immediately.\nIn August 2021, Afolabi openly declared his endorsement of President Buhari’s move to grant full financial autonomy to the 774 Local Government Councils in Nigeria.\nTo the round of the month, he advised Edo state Governor to rescind his controversial executive order of NO VACCINATION, NO ENTRY TO PUBLIC PLACES."
  },
  {
    "headline": "Obaseki swears in five SSAs, 40 SAs in Ikpoba-Okha LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in five Senior Special Assistants (SSAs) and 40 Special Assistants (SAs) in Ikpoba-Okha Local Government Area (LGA) of the state.\nObaseki, who swore in the appointees at Idogbo, the administrative headquarters of Ikpoba-Okha, hailed the LGA for being politically organized and united.\nAccording to him, “Ikpoba-Okha is an LGA with a very high number of PDP members in the country.\n“Ikpoba-Okha is the largest local government in terms of population in Edo State and it’s setting the example in terms of politics.\nYou are well organized and it shows in the unity of leaders in the council, which has made harmonization possible."
  },
  {
    "headline": "WhatsApp launches ‘YouSaid’ campaign to curb false news – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – WhatsApp on Wednesday launched ‘YouSaid,’ a campaign that educates people on how to verify information and reduce the spread of false news in Nigeria.\nWhatsApp in a statement said that the campaign offers tips for users to spot false news and take responsibility in minimising its spread.\n“Regardless of the person you received the information from, as soon as you share, it becomes something people think ‘YouSaid’.\n“If you are unsure whether a message is true, check trusted news sites to see where the story came from.\nThe WhatsApp official noted that today the app protects the personal communication of over two billion users all over the world, securing it with end-to-end encryption by default."
  },
  {
    "headline": "U.S. and Nigeria Launch Biotech Cowpea Outreach, Say Crop Improves Nutrition, Food Security in Nigeria",
    "summarized_story": "The Foreign Agricultural Service of the U.S. Department of Agriculture and Nigeria’s National Biotechnology Development Agency, on Thursday, launched a nutrition outreach “Eating is Believing” to increase consumption of Bt cowpea, Nigeria’s first biotech food crop.\nDelivering remarks at the event, Counselor for Agricultural Affairs, U.S. Mission Nigeria, Gerald Smith, said the new bean will improve nutrition and food security across Nigeria.\n“The commercialization of the transgenic bean underscores that extensive food safety studies were conducted to demonstrate that it is safe for human consumption,” Smith stated.\nSmith added that the outreach campaign is a community engagement activity that seeks to boost the demand for Bt cowpea and healthy bean-based food products.\nThe Foreign Agricultural Service (FAS) is the overseas arm of the United States Department of Agriculture."
  },
  {
    "headline": "‘We want you to be our governor’ – Ebonyi youths drum support for Anyi Chuks ahead of 2023",
    "summarized_story": "OBINNA EZUGWUYouths of Ebonyi State, Southeast Nigeria, under the the auspices of Ebonyi Youths Coalition for Progressive Change (EYCPC), have rallied support for Lagos State based business tycoon and popular philanthropist, Dr. Ifeanyi Chukwu Odi, popularly called Anyi Chuks, asking him to join the race for the state’s governorship seat ahead of the 2023 general elections.\nUka Ibom Anya, a youth leader in the state and Coordinator of the Youth Coalition, made the call on Wednesday in Abakaliki, the state capital while interacting with journalists.\nHe expressed confidence that Ebonyi will witness tremendous socio-economic transformation which will positively impact on the welfare and well-being of the people if Anyi Chuks emerges governor in 2023.\nAccording to the youth leader, Anyi Chuks has the caring mind and the resource capacity to serve the people diligently.\nHe explained that throwing open the contest to the three senatorial zones was more democratic since all the zones had tested the seat since 1999."
  },
  {
    "headline": "9mobile, NIMC reiterate commitment to effective national identity management",
    "summarized_story": "Nigerian telecommunication services provider, 9mobile, has reiterated its support to the nation’s identity management commission.\nThe telco gave the assurance at the one-day stakeholder engagement workshop and capacity building interactive session organized in collaboration with the National Identity Management Commission (NIMC), held last weekend in Abuja.\nThe workshop was organized to examine the capabilities and challenges in the NIMC service delivery process to proffer solutions to identified challenges.\nDelivering his remarks, Chief Executive Officer, 9mobile, Juergen Peschel, commended the management of NIMC for supporting the workshop to engage stakeholders in the industry.\nHe said, “9mobile will continue to play a pivotal role in the country’s national identity management enrollment scheme, especially in the rural areas where we have the mandate to register 10 million individuals."
  },
  {
    "headline": "SEC to collaborate with stakeholders to reduce Nigeria’s housing deficit",
    "summarized_story": "The Securities and Exchange Commission (SEC) has pledged to collaborate with relevant stakeholders on real estate investments in a bid to bring about a reduction in the housing deficit in the country.\nYuguda stated that the SEC Values the service that NIESV provides to the capital market and the nation adding that there is a large room for greater collaboration between the Commission and the Institution.\nAccording to him, “There is a renewed focus on Real Estate Investment Trust now, we are getting to see how the sector contributes more to our GDP by facilitating the trading of assets in the real estate sector.\nI think there is a huge room for collaboration, you have a very big role in the real estate sector.\nYou have a crucial role to play in the capital market especially as we focus on the Real Estate Investment Trust sector."
  },
  {
    "headline": "Katsina Commissioner Assassinated",
    "summarized_story": "The commissioner for Science, Technology and Innovation in Katsina state, Rabe Nasir, has been assassinated by unknown gunmen in his private residence in Katsina.\nThe commissioner of Police, Katsina State command, Mr. Sanusi Buba, confirmed the incident when he visited the residence of the deceased on Thursday evening at Fatima Shema Estate in Katsina.\nBuba explained that the command has started investigating the incident, saying that an arrest has already been made.\n“As you can see, we’ve successfully evacuated the corpse to the hospital and investigation has started.\nAminu Masari’s aide in science and technology from 2015 to 2019 before he was elevated to the status of a commissioner."
  },
  {
    "headline": "Katsina Commissioner Assassinated",
    "summarized_story": "The commissioner for Science, Technology and Innovation in Katsina state, Rabe Nasir, has been assassinated by unknown gunmen in his private residence in Katsina.\nThe commissioner of Police, Katsina State command, Mr. Sanusi Buba, confirmed the incident when he visited the residence of the deceased on Thursday evening at Fatima Shema Estate in Katsina.\nBuba explained that the command has started investigating the incident, saying that an arrest has already been made.\n“As you can see, we’ve successfully evacuated the corpse to the hospital and investigation has started.\nAminu Masari’s aide in science and technology from 2015 to 2019 before he was elevated to the status of a commissioner."
  },
  {
    "headline": "US Donates Additional 2.5m Doses of COVID-19 Vaccines To Nigeria",
    "summarized_story": "The United States (US) Embassy in Nigeria has donated an additional 2.5 million doses of Pfizer vaccine to help in the fight against the COVID-19 pandemic.\n“To date, the United States has donated more than 13.5million doses of COVID-19 vaccine in partnership with COVAX, or bilaterally to Nigeria.\n“Additionally, the United States has provided more than $119 million in COVID-19 related health assistance.\nThat’s why the United States is committed to helping end the pandemic in Nigeria and everywhere.”ADVERTISEMENTThe United States is committed to donating more than one billion vaccine doses around the world, by early 2022.\n“Improving equitable distribution remains a priority for the United States to prevent the emergence of new variants that threaten populations everywhere,” the statement said."
  },
  {
    "headline": "US Donates Additional 2.5m Doses of COVID-19 Vaccines To Nigeria",
    "summarized_story": "The United States (US) Embassy in Nigeria has donated an additional 2.5 million doses of Pfizer vaccine to help in the fight against the COVID-19 pandemic.\n“To date, the United States has donated more than 13.5million doses of COVID-19 vaccine in partnership with COVAX, or bilaterally to Nigeria.\n“Additionally, the United States has provided more than $119 million in COVID-19 related health assistance.\nThat’s why the United States is committed to helping end the pandemic in Nigeria and everywhere.”ADVERTISEMENTThe United States is committed to donating more than one billion vaccine doses around the world, by early 2022.\n“Improving equitable distribution remains a priority for the United States to prevent the emergence of new variants that threaten populations everywhere,” the statement said."
  },
  {
    "headline": "Buhari Yet To Decide On Electoral Bill, Says Presidency",
    "summarized_story": "President Muhammadu Buhari is yet to decide on whether to assent or reject the Electoral Act (Amendment) Bill 2021, the Presidency has clarified.\nSenior special assistant to the president on National Assembly Matters (House of Representatives), Hon.\nHe said the responsibility lies with all the political parties.\nHe said party primaries is the role of political parties and not INEC.\n“For direct primaries, what the INEC chairman told us is that only the political parties have the responsibility on primaries and the funding of the primaries,” he said."
  },
  {
    "headline": "Weeping as suspected bandits kill 16 worshippers in Niger",
    "summarized_story": "Sixteen people who were performing their morning prayers in a mosque have been killed by suspected bandits in Ba’are village in Mashegu Local Government Area of Niger State.\nOur correspondent learnt on Thursday that the incident occurred on Wednesday morning.\nThe bandits stormed the village on motorcycles and headed for the mosque where they killed and injured the worshippers.\nThe Niger State Commissioner of Police, Monday Bala Kuryas, confirmed the incident in a telephone interview.\nA similar incident occurred some months ago when bandits killed 18 worshippers in Maza kuka village of Mashegu Local Government Council."
  },
  {
    "headline": "Weeping as suspected bandits kill 16 worshippers in Niger",
    "summarized_story": "Sixteen people who were performing their morning prayers in a mosque have been killed by suspected bandits in Ba’are village in Mashegu Local Government Area of Niger State.\nOur correspondent learnt on Thursday that the incident occurred on Wednesday morning.\nThe bandits stormed the village on motorcycles and headed for the mosque where they killed and injured the worshippers.\nThe Niger State Commissioner of Police, Monday Bala Kuryas, confirmed the incident in a telephone interview.\nA similar incident occurred some months ago when bandits killed 18 worshippers in Maza kuka village of Mashegu Local Government Council."
  },
  {
    "headline": "Kaduna: Bandits still collect levies from farmers in Birnin Gwari ,despite military offensive – Local",
    "summarized_story": "Bandits have continued to collect levies from farmers in Birnin Gwari, even after the restoration of telecommunication services in the state, Alhaji Zubairu Abdurra’uf ,an indigene and traditional title holder of ‘Dan Masanin Birnin Gwari has said.\nReports from.Birnin Gwari and from other parts of Kaduna State, indicated that the bandits have committed nefarious acts with impunity, after the authorities restored telecommunication services in the state.\nSome natives from Birnin Gwari said the bandits had denied farmers in the area from conveying the farm.produce they harvested,in spite of the series of counter attacks by the nation’s security agencies.\nAlhaji Zubairu Idris Abdurra’uf,the Ɗan Masanin Birnin Gwari ,told the BBC Hausa that ” restoring the telecommunication services had afforded the people of Birnin Gwari the opportunity to communicate with each other and with the security agencies ,anytime the bandits attacked.”“The soldiers have bombarded Birnin Gwari forests,but it appeared nothing has changed about insecurity in the area.\nHe said the disturbing fact was that the bandits were currently imposing tax on farm produce and farmers must pay or be dealt with."
  },
  {
    "headline": "Troops rescue 20 police officers abducted by terrorists in Yobe",
    "summarized_story": "The military said troops of Operation Hadin Kai have rescued 20 Nigeria Police Force personnel abducted by suspected terrorists.\nThe military added that the police personnel were abducted when terrorists attacked a police station at Buni Yadi in Yobe state.\nHe also said a total of 62 terrorists were killed, 28 arrested, and 54 arms and 144 rounds of ammunition were recovered from the terrorists.\n“During the operation, 45 armed bandits were neutralized and their structures, housing logistics items, and weapons were destroyed.\nOther incidents with significant results were recorded at; Hayin Gada and Rugan Alhaji Ori villages in Igabi LGA of Kaduna State.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Bisi Akande's autobiography unveiling in pictures",
    "summarized_story": "By Efunla Ayodele (Photos)Eminent Nigerians thronged the Eko Hotel and Suites on Thursday to honour former Interim National Chairman of the All Progressives Congress, APC, Chief Bisi Akande.\nThe event was the unveiling of his autobiography, titled: “My Participations.”At the event were President Muhammadu Buhari, Senate President, Dr. Ahmad Lawan; National leader of APC, Asiwaju Bola Tinubu; APC Caretaker Committee Chairman, Mai Mala Buni; Governor Kayode Fayemi of Ekiti State and Governor Atiku Bagudu."
  },
  {
    "headline": "Bada Akinwumi heads AEDC's interim management team",
    "summarized_story": "By Folasade AkpanThe Bureau of Public Enterprises (BPE), has announced Bada Akinwumi as Interim Managing Director of Abuja Electricity Distribution Company (AEDC) Plc.\nBada heads five-member interim management team appointed for the troubled electricity distribution company as announced in a statement on Thursday in Abuja by Amina Othman, Head, Public Communications, BPE.\nShe said that the Nigerian Electricity Regulatory Commission (NERC), the power sector regulator, has approved the appointment of the interim management team.\nOther members of the team are Sani Usman as Interim Chief Business Officer, and Babajide Ibironke as Interim Chief Finance Officer, Donald Etim as Interim Chief Marketing Officer, and Femi Zachaeus as Interim Chief Technical Officer.\n“The receiver/manager has agreed to the appointment of an interim management team in conjunction with BPE as part of measures designed to address business failure events and ensure continuity of service to end-use customers in the service area.”"
  },
  {
    "headline": "BREAKING: Gunmen Assassinate Katsina’s Commissioner For Science, Technology, Nasir",
    "summarized_story": "Dr Rabe Nasir, the Katsina State Commissioner for Science and Technology, was killed.\nAccording to Century Chronicle, the commissioner was assassinated in his home in the Katsina metropolis’ Fatima Shema Housing Estate.\n“He was shot in his home in Fatima Shema Estate after praying.\nDr. Nasir received his education at the University of Abuja, the University of Kansas in Lawrence, Bayero University in Kano, and the Government Secondary School in Giwa, Kaduna State.\nBetween 2007 to 2011, he served in the House of Representatives as a member of the Mani/Bindawa federal constituency."
  },
  {
    "headline": "How Obasanjo Diabolically Double-crossed APC Chieftain, Bisi Akande – Buhari",
    "summarized_story": "Former President Olusegun Obasanjo’s diabolical double-cross, according to President Muhammadu Buhari, lost Chief Bisi Akande, the All Progressives Congress, APC, chieftain, his bid for a second term.\nThe president made the announcement at the public launch of Akande’s autobiography, “My Participations,” in Lagos State.\n“It is common knowledge that Akande was the victim – along with other AD Governors – of a diabolical double-cross which ended his gubernatorial career.\nBuhari lauded Akande as a “great public officer” and someone he would trust in the jungle.\nHe explained that the APC leader maintained his “inflexible integrity” both inside and outside of government, never accepting or providing bribes."
  },
  {
    "headline": "Precious Chikwendu Is Suffering From Bi-polar Disorder, Claiming That Her Son Has Covid Is A Lie From The Pit Of Hell – FFK Blows Hot",
    "summarized_story": "Femi Fani Kayode has blown hot in his recent statement stating that his estranged wife, Precious Chikwendu is suffering from bi-polar disorder and claiming that her son is down with COVID-19 is a big fat lie.\nOrdinarily, we cannot be expected to respond to the crass, filthy, delusional, salacious, disgraceful and absurd allegations of an insane person.\nWe appreciate the fact that Precious is clinically unstable, is as mad as a hatter and is prone to telling monstrous lies and making delusional statements.\nAnd neither is it true that his lawyers made any such claims in court or elsewhere.\nMeanwhile, we will meet her in court where she will be exposed for who and what she is and what she suffers from."
  },
  {
    "headline": "BREAKING: Tanker Drivers Barricade Asaba-Benin Road Over Alleged Shooting Of Colleague By Police",
    "summarized_story": "Tanker drivers flocked to the Asaba-Benin Expressway in Delta state on Thursday to protest the alleged shooting of one of their colleagues by a police officer.\nAccording to SaharaReporters, the incident that sparked the Thursday protest occurred on Tuesday, when a police officer allegedly shot a tanker driver near the River Niger Bridge’s Asaba tollgate area.\nThe drivers were demonstrating against police intimidation and the suspected shooting of one of their colleagues by a police officer, according to an eyewitness.\nThen out of fear of being beaten and arrested, the tanker driver took to his heels and as he was running, one of the police officers in the convoy shot him in the leg,” the eyewitness said.\nThe gridlock caused by the tanker drivers started around 7:00 am on Thursday and lasted several hours, as commuters and motorists were seen stranded."
  },
  {
    "headline": "Breaking: Katsina commissioner found dead inside residence",
    "summarized_story": "Katsina State Commissioner for Science and Technology, Dr Rabe Nasir, was on Wednesday night found dead at his residence.\nHe was said to have killed by gunmen.\nNeither the state government, nor the Police has confirmed the latest development.\nDetails loading…"
  },
  {
    "headline": "Pictures: Maximum available opportunities, FG tells Nigerian youth",
    "summarized_story": "The Minister of Youth and Sports Development, Mr. Sunday Dare, has advised Nigerian youth to ensure total utilisation of every opportunity being made available to them, as it will greatly impact their lives positively.\nRepresented by the Permanent Secretary, Federal Ministry of Youth and Sports Development, Alhaji Ismaila Abubakar, the Minister assured the Nigerian youth and the students in particular, that they will not regret utilising the golden opportunities given to them.\nHe stated further that, the ministry will continue to collaborate with relevant stakeholders with a view to promoting grassroot sports as an avenue for ensuring socio-economic growth and development of the country.\nHe stated further that within the year 2019 and now, the students have participated in both International and National sporting competitions, and won a total of 36 medals from different sports.\nThe Managing Director therefore called for sustainability of the existing relationship between the school and the ministry with a view to enhancing grassroots sports development in the country."
  },
  {
    "headline": "Breaking: Sanwo-Olu suspends planned peace walk in Lagos",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, has put off proposed Lagos peace walk scheduled for December 2021.\nThe governor cited the spread of Omicron COVID-19 as the reason for the latest decision.\nGovernor Sanwo-Olu who spoke via a statement he signed on Thursday, November 9, 2021, said he is “constrained to stand down all preparations for the Walk for Peace” so as not to “endanger the life of any Lagosian” amid the outbreak of the Omicron COVID-19 variant.\nThe peace walk according to the governor would herald the healing of the land “in the face of the misinformation and misunderstanding following the recent leak of a report by the Judicial Panel of Enquiry.\nSome notable comedians who the governor had extended open invitation to ahead of the peace walk declined to be part of it."
  },
  {
    "headline": "Minister: Insecurity Responsible For Nigeria’s Fall Among Top Investment Destinations",
    "summarized_story": "The Minister of Industry, Trade, and Investment, Mr. Niyi Adebayo, on Thursday, said Nigeria’s slip in a ranking of top investment destinations in Africa was due to insecurity.\nPresident Muhammadu Buhari, while speaking at the Expo 2020 Dubai trade and investment forum in UAE, had boasted that Nigeria was Africa’s most attractive investment destination.\nBut a report by Rand Merchant Bank (RMB) titled ‘Where to Invest in Africa 2021’ placed Nigeria in the 14th position on investment attractive nations in Africa.\n“The reasons for that are various, the major one being the security problems that we have in the country,” Mr. Adebayo said on Thursday while briefing reporters at the State House in Abuja.\n“Our position is getting better because there seems to be a big interest now in investing in Nigeria.”"
  },
  {
    "headline": "Buhari Inaugurates Made-In-Nigeria Vessel, Other Projects In Lagos",
    "summarized_story": "President Muhammadu Buhari has inaugurated a locally-built Seaward Defence Boat (SDB) 111 in Lagos State.\n“Let me assure you that the Government will continue to support the ideals of the Nigerian Navy in the performance of its constitutional duties.\nGod bless the Nigerian Navy, God bless the Federal Republic of Nigeria.\n“Local partners should share in this commendation for their efforts at local facilitation as outlined in the Government’s local content policy,’’ he said.\nWhile acknowledging the efforts of the Nigerian Navy in securing Nigeria’s vast oil and gas industry, he said the Navy is a major contributor to the nation’s economic development."
  },
  {
    "headline": "U.S. Donates 2.5 Million Doses Of Pfizer COVID-19 Vaccines To Nigeria",
    "summarized_story": "The United States has announced the donation of 2.5 million Pfizer vaccine doses to Nigeria.\nAccording to the statement, the vaccine doses arrived in Abuja this week and were received by the National Primary Health Care Development Agency and taken to cold storage in preparation for distribution.\nThe vaccines are planned to be distributed to over 3,000 health facilities across all 36 states and FCT-Abuja.\nThe statement explained that the United States is committed to helping end the pandemic in Nigeria and everywhere, also committed to donating more than one billion vaccine doses around the world, by early 2022.\nImproving equitable distribution remains a priority for the United States to prevent the emergence of new variants that threaten populations everywhere."
  },
  {
    "headline": "Sanwo-Olu Halts Preparations For Peace Walk",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, has announced that preparations towards Lagos peace walk planned for December 2021 be put on hold.\nThe governor disclosed this in a statement signed by him on Thursday, November 9, 2021.\nHe said he is “constrained to stand down all preparations for the Walk for Peace” so as not to “endanger the life of any Lagosian” amid the outbreak of the Omicron COVID-19 variant.\nREAD ALSO: Yuletide: Lagos Govt Issues Guidelines On Parties, OthersHe said the suspension of the Peace Walk was necessary due to “unseen enemy called COVID-19 which began to ravage the world and indeed our nation.” He added that as the Incident Commander in the quest to protect the lives of Lagos residents, “we subjected ourselves to the dictates of science.”The governor, in an address on November 30, 2021, had called on some popular entertainers in the state to join him on a peace walk.\nThe peace walk according to the governor would herald the healing of the land “in the face of the misinformation and misunderstanding following the recent leak of a report by the Judicial Panel of Enquiry on the #EndSARS debacle.”See the full statement released by the governor on Thursday below…"
  },
  {
    "headline": "Napoli Win Thriller To Knock Leicester Out Of Europa League",
    "summarized_story": "Napoli sent Leicester crashing out of the Europa League as the Italian side advanced to the knockout stages with a 3-2 win in a dramatic conclusion to Group C on Thursday.\nLeicester would have salvaged their Europa League place if Legia’s Tomas Pekhart hadn’t missed a stoppage-time penalty.\nNapoli ended in second place, two points ahead of Leicester, and will feature in the Europa League knockout round play-offs in February.\n“I was focused on the Europa League and winning this group and at the very least finishing second.\nReal Sociedad secured second place in Group B with a 3-0 win against PSV Eindhoven, who drop into the Europa Conference League."
  },
  {
    "headline": "Bisi Akande is someone I can go into the jungle with, says Buhari -",
    "summarized_story": "”My first personal contact with Chief Akande was, if I recall correctly, in 2006 when preliminary consultations were coming to fruition for a grand coalition to unseat the PDP Government.\n‘‘He emerged as Governor of Osun State in 1999 when the military handed over to the civilians.\n”Bisi Akande stood four square and faced all the challenges head-on and overcame most of them.\n”His first action was to stop payment of “critical allowances” a euphemism for government money customarily shared by the big boys in Osun State.\n”Chief Akande was unanimously chosen as the first Chairman of this great coalition."
  },
  {
    "headline": "INEC yet to come up with any cost to either direct or indirect primaries",
    "summarized_story": "Chairman of the Independent National Electoral Commission, Professor Mahmood Yakubu, says the commission did not come up with any cost to either direct or indirect primaries.\nNews had been making the round that the commission requires no less than five hundred billion Naira to monitor the direct primaries of political parties.\nThe Chairman, who met with the House Committee on Appropriations behind closed doors.\nThe Chairman , Appropriation, Mukhtar Betara, told newsmen after the meeting that the committee wanted to know INEC’s requirements for the 2023 elections as well as cost of direct or indirect Primaries.\nHe disclosed that the INEC Chairman told the committee the role of the commission in direct or indirect primaries which he said was just minimal and that the responsibility lied with all the political parties."
  },
  {
    "headline": "Osoba returns, hosts Ogun exco members, scores Abiodun high on roads, others -",
    "summarized_story": "Former Governor of Ogun state, Olusegun Osoba, on Wednesday, hosted members of the Ogun State Executive Council, with a charge to Governor Dapo Abiodun to focus more on projects and programmes that would be of great benefit to the people of the state.\nI know he is doing very well on road construction and other sectors; more attention should also be given to security.\nOgun is the fastest growing state in Nigeria because the governor is taking the advantage of our closeness to Lagos”, Osoba added.\nHe, however, urged Governor Abiodun to remain resolute in executing sustainable projects across the state.\nMy prayer is that you will leave Ogun state better than you met it”."
  },
  {
    "headline": "Resign now if you have political ambition, Gov Abiodun tells appointees -",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun, has directed all serving political appointees with 2023 political ambitions in the State to resign on or before Jan 31 2022 to pursue their dreams.\nA statement issued in Abeokuta on Tuesday by his Chief Press Secretary, Mr. Kunle Somorin, said the directive had become expedient to avoid observed distractions and loss of focus in the discharge of their responsibilities.\nWhilst noting that it is legitimate to have such ambitions, the Governor, however, said: “As an Administration unwaveringly committed to delivering on its electoral promises, any activity that is capable of undermining the implementation of the Building Our Future Together Agenda of the Administration will not be tolerated”.\nGovernor Abiodun counselled that those who cannot wait till the appropriate time for 2023 electioneering process should take their leave to pursue their ambitions without constituting a clog in the wheel of the implementation of government programmes and activities, the statement concluded."
  },
  {
    "headline": "Biden Sounds Alarm at Virtual Summit About Global Democracy",
    "summarized_story": "President Joe Biden on Thursday opened the first White House Summit for Democracy by sounding an alarm about a global slide for democratic institutions and called for world leaders to “lock arms” and demonstrate democracies can deliver.\n“This is an urgent matter,” Biden said in remarks to open the two-day virtual summit.\nBut the gathering also drew backlash from the United States’ chief adversaries and other nations that were not invited to participate.\nSome advocates also want Biden to focus on other ways to shore up democracy at home.\n“Facts once again show that the so-called Leadership Democracy Summit has nothing to do with international public welfare, but to serve the American private sector; it has nothing to do with global democracy, but to maintain American hegemony,” Chinese Foreign Ministry spokesperson Wang Wenbin said on Thursday."
  },
  {
    "headline": "Gumi Unsafe Now That Bandits Have Been Declared Terrorists – Trending with Ojy Okpe – Arise News",
    "summarized_story": "Controversial Islamic cleric, Sheik Ahmad Gumi, on Wednesday denounced his advocacy for bandits, following their declaration as terrorists by the federal high court in AbujaMeanwhile, reports reaching us indicate that police officers and civil servants in the ‘federal ministries’ and agencies have been advised to spend their salaries for the month of November “wisely”; because their salaries for the month of December may not be processed until January 2022.\nIn a related development, a kidnappers den was discovered behind a police checkpoint, along the “Auchi-Abuja expressway, by travellers accessing the route last week.\nIn a video that has now gone viral, bullets, lighters and tear-gas canisters, were found in the building, that was believed to have housed an insane man.\nA heartwarming ideo of a 9-year-old pupil; Jadel Ojokayode of Treasure Trove Montessori school in Osun State; who was vying for the position of Head Boy has won the hearts of many Nigerians after delivering an outstanding campaign speech that has now gone viral."
  },
  {
    "headline": "Nigeria Must Produce Its Own Vaccines, Says Deputy Health Minister Mamora",
    "summarized_story": "The Minister of Health Dr Osagie Ehanire, Wednesday admitted that Nigeria had been forced to withdraw expired COVID-19 vaccines from circulation, adding that the doses will be destroyed by the National Agency for Food and Drug Administration, NAFDAC.\nAccording to the minister, Nigeria has utilized over 10 million short-life doses of COVID-19 vaccines so far donated to the country in good time and saved more than $40 million in foreign exchange.\nHe said donations of surplus vaccines with expiring shelf lives to low and middle-income countries has been communicated and is a matter of international discussion.\n#Ehanire pointed out that developing countries like Nigeria accept them because they close critical vaccine supply gaps and save scarce foreign exchange procurement costs.\nMinister of State for Health, Dr. Olorunimbe Mamora discusses this new challenge and tells us what options Nigeria is left with to ensure that it has access to and can procure COVID-19 vaccines with longer shelf lives."
  },
  {
    "headline": "Justice for Sylvester: Dowen College Parents Hold Candlelight Vigil",
    "summarized_story": "1 of 5 - +Parents of pupils of Dowen College in Lekki Lagos have held a candlelight procession for the late Sylvester Oromoni who died last Tuesday.\nSome of the parents called on the authorities to ensure that little Sylvester does not die in vain by ensuring that justice is done.\nARISE correspondent Tokunbo Oyetunji, has the details…"
  },
  {
    "headline": "Saudi Arabia Bans Flights From Nigeria Over Omicron",
    "summarized_story": "The Saudi Arabia Government has suspended Nigerians from entering into the kingdom in its bid to prevent further spread of Omicron variant of coronavirus after six reported cases in Nigeria.\nA source from the kingdom noted that the Saudi government suspension of flights from Nigeria into the country was in order to check the spread of omicron in the holy land.\nHe said that though circular has been issued to flight operators on the suspension, all the flights currently enroute to Saudi from Nigeria would be allowed into the kingdom till official announcement.\nCircular has been issued to travel operators and other stakeholders to suspend airlifting of passengers from Nigeria.\nAccording to him, a circular has been issued that all Lesser Hajj flights should be canceled and there will be no more flights from Nigeria until further notice."
  }
]