[
  {
    "headline": "Atiku meets Wike, says Nigerians waiting for PDP in 2023",
    "summarized_story": "FORMER Vice President, Alhaji Atiku Abubakar, has said Nigerians were eagerly awaiting the return of the Peoples Democratic Party to power come 2023.\nThe former PDP Presidential candidate in the 2019 elections spoke after a meeting with the Rivers State Governor, Nyesom Wike, at his private residence earlier on Wednesday.\nThis was contained in a statement issued by the Special Assistant to the Rivers State Governor on Media, Kelvin Ebiri.\nThe statement was titled, ‘Nigerians are waiting for PDP to take over power in 2023-Atiku.’Ebiri, quoted Atiku as telling newsmen at Government House, Port Harcourt, that the meeting with Wike was fruitful.\nI believe that Nigerians can’t wait for 2023 to come, so that PDP will return.”On Nigeria’s security challenges, Atiku described the situation as dire."
  },
  {
    "headline": "New tenant commits suicide in Delta community, residents shocked",
    "summarized_story": "Residents of Kotokoto Layout, off Orhuwhorun Road, in the Udu Local Government Area of Delta State woke up on Wednesday to the news of a young man, Pius Idise, who took his life by drinking substance, suspected to be insecticide.\nLate Idise neighbour, Samson, said the deceased was found dead in his apartment with the door wide open and an empty container of the insecticide his side.\n“We all woke up this morning (Thursday) to discover the door to Mr Pius Idise’s apartment wide open.\nAnother resident, who did not want to be identified, said the late Idise was a Master’s degree holder in Quantum Physics.\nThe acting Police Public Relations Officer for Delta command, Mr Bright Edafe, said, “The police are aware of the incident."
  },
  {
    "headline": "NCWS begs bandits to release remaining Baptist students",
    "summarized_story": "By Ibrahim Wuyo, KadunaNational Council of Women’s Societies (NCWS), Kaduna state chapter has said that the release by bandits of 28 Bethel Baptist School students was a welcome development, butappealed to the kidnappers to release the remaining students.\nThe NCWS also expressed worry over the rise in acts of banditry and kidnapping in Kaduna State.\nPresident of NCWS in Kaduna State, Barr.\nThe NCWS president also commended the Police command for the release of 28 kidnapped Bethel Baptist school students.\n“It is a welcome development, however, we appeal to the kidnappers to please release the remaining students in their den,” she said."
  },
  {
    "headline": "Resettlement: Zulum asks committee to restore civil authorities in Abadam",
    "summarized_story": "The Governor said the government is concerned about the plights of its people, hence, it is ready to deploy all the needed resources and support to ensure the safe return of all IDPs pick up their pieces and begin a better livelihood.\nZulum also enjoined the committee which is tasked with the responsibility of relocating all IDPs to Abadam communities including Malam Fatori town to encourage all returnees to actively participate in farming activities to improve their economic conditions.\nHe, therefore, commended the Theatre Commander, Major General Musa Christopher, his troops and other security agencies for their sustained efforts towards the fight against Boko Haram terrorists in the state.\n“The terms of reference include; ensure the safe return of IDPs back to Mallam Fatori, ensure restoration of civil authorities, provide food and non-food items to all the returnees, provide potable drinking water, health care services, social amenities and return of Civilian Joint Task Force and Hunters even before the relocation exercise,” Zulum stated.\nSpeaking on behalf of the Committee, its Chairman, Engineer Bukar Talba who is also the Commissioner Ministry of Agriculture, assured that they will do justice and will not leave any stone unturned to ensure the safe return of the IDPs back to their ancestral homes."
  },
  {
    "headline": "Shiloh Word Chapel clocks 10",
    "summarized_story": "The Abuja based church; Shiloh word chapel will be celebrating its 10th anniversary on July 30 and 31st, 2021.\nIn a media chat recently, the general overseer, Prophet Samuel (popularly known as I.O Samuel), joyously invites everyone to the event holding at Apo mechanic Village Abuja.\nThe Similarities of a Father and Son from the Same Country but Different Tribes can be clearly seen in the relationship between Prophet TB Joshua and Prophet I.O Samuel.\nCrowd Miracles Salvation Souls Everywhere; Yet the prophetic move got me stuck with prophet TB Joshua From the Year 2000 till June 5th 2021.\nJune 25-28 great things happened in Exousia TV, it was like TB Joshua Visit In Global Crusade."
  },
  {
    "headline": "Olympic FLICKs by Tony Ubani (2): Words mean different things to different people",
    "summarized_story": "By Tony Ubani, TokyoWords often mean different things to different people.\nTo a Kogi person, he would hug you passionately when you call him Otami while a Yoruba man would slap (gba oju ee) you.\nBut the moment you call an Igbo man OLAYEMI, the meaning automatically changes.\nOLABISI is another good Yoruba name that changes meaning once addressed to an Igbo man.\nI have heard of Brazilian hair, not Japanese hair."
  },
  {
    "headline": "Ward Congress: Anxiety in Osun as APC group alleges party’s national officials are incommunicado",
    "summarized_story": "According to the group, the officials who reportedly arrived Osogbo last Saturday, were first camped at the Government House and were not allowed to relate with APC members, including the Secretary of the party, Alhaji Rasaq Salinsile.\nThe group, in a statement made available yesterday in Osogbo, stated that the officials were later moved to an unknown hotel where they were also placed on surveillance.\nThey are not either at the State Party Secretariat or any other place carrying out their national duty.\n“The Governor has hijacked the forms and other materials meant for the congress for his political group, IleriOluwa.\n“We call on President Muhammadu Buhari and other national leaders of the APC to intervene and call Governor Oyetola and Prince Famodun to order.”Vanguard News Nigeria"
  },
  {
    "headline": "UNTH mgt. hails Gov. Ugwuanyi’s massive projects at ESUT Teaching Hospital",
    "summarized_story": "The management of University of Nigeria Teaching Hospital (UNTH), Enugu, has expressed delight at the massive development projects being executed simultaneously at the permanent site of the Enugu State University of Science and Technology (ESUT) Teaching Hospital and College of Medicine, Igbo-Eno, by the administration of Governor Ifeanyi Ugwuanyi.\nProf. Onodugo stressed that the members of the UNTH management team were highly impressed and amazed, and commended Gov.\nThe UNTH CMD, who was led round the ongoing projects alongside members of his team by the Commissioner for Works and Infrastructure, Engr.\nWe are happy and I want to say kudos to the Governor of this State (Enugu).\nOn his part, the Contractor handling the ESUT Teaching Hospital project, Architect Henry Arinze revealed that the health facility is “conceived as Nigeria’s response to the problem of medical tourism”."
  },
  {
    "headline": "Lagos king, Buhari Oloto dies 10 months after disputed installation",
    "summarized_story": "A traditional ruler in Lagos, Buhari Oloto, is dead.\nThe 80-year-old died at the Lagos State University Teaching Hospital (LASUTH), Ikeja.\nThey pointed out that the Appeal Court had issued an injunction on August 30 against the installation.\n“It is surprising to see Lagos State Government crown our opponent, Buhari Oloto.\nWe have been on the case for over 14 years, the matter is in the Appeal Court”, he said."
  },
  {
    "headline": "FBI vs Hushpuppi: Police IG, Alkali Baba orders review of allegation against Abba Kyari",
    "summarized_story": "The Inspector General of Police, IGP Usman Alkali Baba, on Thursday ordered the review of the allegation against Abba Kyari, Deputy Commissioner of Police by the Federal Bureau of Investigation, FBI.\nKyari, who is the head of the Intelligence Response Team (IRT), was linked to fraudster, Hushpuppi, whose name is Ramon Abass.\nThis, Kyari has deniedHowever, the IGP said the review was in line with the commitement of the Nigeria Police Force to ensure justice and professionalism.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\n“Further developments on this case will be communicated to members of the public accordingly.”Hushpuppi: US court orders FBI to arrest, detain Abba Kyari"
  },
  {
    "headline": "Go out, crush all drug cartels – Marwa charges newly-promoted NDLEA personnel",
    "summarized_story": "Newly-promoted officers and men of the National Drug Law Enforcement Agency, (NDLEA), have been charged to crush drug cartels across the country.\nGen. Mohamed Buba Marwa,(Rtd), Chairman and Chief Executive of the NDLEA gave the charge while decorating newly promoted Deputy Commanders General of Narcoticsand Assistant Commanders General of Narcotics.\nHe gave the charge during a ceremony to decorate newly promoted Deputy Commanders General of Narcotics, DCGNs and Assistant Commanders General of Narcotics, ACGNs.\nHe then charged the topmost officers to go all out and crush the drug scourge in every part of the country.\nNDLEA: Marwa, officials undergo drug test"
  },
  {
    "headline": "Be fair, transparent in appointment of judges in Oyo – Group tells Makinde",
    "summarized_story": "Political Awareness Group (PAG), a group of Muslim professionals and technocrats for good governance, has advised Governor Seyi Makinde of Oyo State to be fair and transparent in appointment of new judges in the state judiciary.\nDAILY POST recalls that three Muslim lawyers nominated as Judges in the state judiciary died between December last year and this year while awaiting approval.\nHe said that finding had revealed that Makinde was planning to fill the four vacant postion of judges in the state.\nHe then called on Makinde to be fair, transparent and consider the interest of all religions in the selection of judges in the state.\nHe said, “We remind your Excellency that as at present, the number of non-Muslim Judges are almost double that of Muslim Judges in Oyo State."
  },
  {
    "headline": "DSS denied us access to Kanu, lawyer alleges",
    "summarized_story": "By Nicholas Kalu, AbujaLead Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) Ifeanyi Ejiofor on Thursday alleged the Department of State Security Services (DSS) denied him access his client.\nThis, he said, was in violation of a court order.\nHe said the DSS insisted the request to meet Kanu would be looked into and accordingly approved by their DG before access can be granted.\n“Attached for your ease of reference is a copy of the Court Order under reference.\n“Should anything untoward happen to Our Client, the Nigerian Government and the Department of State Security Services should be held responsible."
  },
  {
    "headline": "Tears, tributes at slain Super TV CEO’s service of songs",
    "summarized_story": "By Alao AbiodunIt was a teary and solemn moment as family, friends, associates and other sympathisers gathered for the Service of songs in honour of the late CEO Super TV, Micheal Ataga.\nFollowing his death, the Lagos Police Command arrested a 21-year-old UNILAG student Chidinma for allegedly killing him.\nSifo, as he was called by family and close associates, was born June 17, 1971 and founded Super TV.\nHe has been robbed of the joy of seeing a project he spent seven years working on.\nMy mind had raced through all the possibilities of where you were and what could have happened but death, death wasn’t an option."
  },
  {
    "headline": "Akeredolu verdict: Danger ahead, Keyamo warns APC",
    "summarized_story": "Justice Peter-Odili added: “This Article draws strength from Section 183 of the 1999 Constitution.\nThe PDP spokesman, Kola Ologbondiyan, said it is an aberration for Buni to serve as Yobe State governor and chairman of the APC at the same time.\nOlogbondiyan said: “That is totally an aberration of the doctrine and dictates as established in the APC Constitution as well as the 1999 Constitution as amended.\n“We insist that the process that led to the emergence of Governor Akeredolu was, and remains a violation of the APC Constitution as well as the 1999 Constitution.\n“Section 183 of the 1999 Constitution states that no governor should hold any other position in any capacity, apart from the office of the governor."
  },
  {
    "headline": "Delta APC committee members escape lynching as stakeholders seek postponement",
    "summarized_story": "By Okungbowa Aiwerie, AsabaDelta All Progressives Congress (APC) stakeholders have called for postponement of ward congress to allow thousands of aspirants who have paid for forms collect and return same.\nThere was also confusion as hundreds of angry aspirants besieged the Delta APC Secretariat in Asaba with bank tellers.\nMany aspirants expressed frustration over their inability to collect forms and submit to the committee.\nADVERTISEMENTEgbe said he got clearance from APC headquarters to commence sales on July 24 but ran out of forms on 26th July.\nThe APC ward congresses are billed to commence on July 31 nationwide."
  },
  {
    "headline": "BREAKING: $1.1 million bribe: Police order probe of Abba Kyari over FBI indictment",
    "summarized_story": "Molly Kilete, AbujaThe Inspector General of Police(IGP), Usman Alkali Baba, has ordered an investigation into the alleged indictment by the Federal Bureau of Investigation (FBI), against the commander of the IGP Intelligence Response Team, DCP Abba Kyari.\nForce public relations officer Frank Mba, who made this known in Abuja, also confirmed the receipt of the said allegations by the FBI, by the police force headquarters.\nMba assured reaffirmed the commitment of the Nigerian Police Force to conduct a through investigation so as not to jeopardize its professional relationship with the FBI and other international partners.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Hushpuppi’s: Go clear your name in US, HURIWA tells Kyari",
    "summarized_story": "A US court had said that Hushpuppi allegedly used Kyari to arrest and jail a co-conspirator, Chibuzo Vincent, after the latter threatened to expose a $1m fraud committed against a Qatari businessman.\nAlthough, Kyari had, in a statement, denied allegations of conspiracy with Hushpuppi, saying he only met him two years ago and did not benefit financially from him.\nBut, HURIWA’s National Coordinator, Emmanuel Onwubiko, in a statement yesterday, said Kyari should not be scared of injustice because of the transparent nature of the judicial system in the United States.\n“The United States of America is an organised Constitutional democracy where the Rule of Law is supreme.\n“This allegation is heavy and it has been filed in the Court of law and not in the court of public opinion."
  },
  {
    "headline": "How DCP Abba Kyari collected $1million bribe from me -Hushpuppi",
    "summarized_story": "Vincent subsequently contacted the victim and informed them that they were being scammed by a syndicate involving him and Abbas.\nThis elicited anger from Abbas, who contacted Kyari to arrest and jail his rival over the dispute.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” U.S. Justice department said in a statement.\nAbbas pleaded guilty to multi-million fraud earlier this month and faces up to 20 years in jail."
  },
  {
    "headline": "I never demanded, collected $1.1 million bribe from Hushpuppi – IRT boss Abba Kyari",
    "summarized_story": "From Molly Kilete, AbujaCommander of the Inspector General of Police Intelligence Response Team (IRT), Deputy Commissioner of Police Abba Kyari, has denied demanding or receiving a $1.1million bribe from celebrity internet fraudster Ramon Olorunwa Abbas, alias “Hushpuppi”.\nHushpuppi, who recently pleaded guilty in the United States, has narrated how he bribed Nigeria’s celebrated police chief Abba Kyari in court documents seen by an online publication, Peoples Gazette.\nFederal authorities in the US have been investigating Mr Abbas and his co-conspirators after their syndicate was busted in Dubai, New York and other top cities last June.\n‘Nobody demanded for a kobo from Abbas Hushpuppi.\n‘Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "FG issues flood alert in 28 states",
    "summarized_story": "From Charity Nwakaudu, AbujaThe Federal Government has warned Nigerians to expect heavy flooding this year, listing Lagos and Osun states as likely to experience more flood-related disasters.\nHe said current flood incidents were caused by inadequate drainage systems, as localised heavy downpour generated the flash and urban flooding, adding that river and coastal flooding are yet to set in.\nHe said Lagos and Ogun states may likely experience the three stages of floods -urban, river and coastal flooding due to their geographical location.\nIt must be pointed out virtually that all the flood incidents above were caused by poor drainage systems as localised rainfall generated the urban flooding.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Hushpupi: FBI Writes Nigeria Police over Kyari’s Indictment, IG Orders investigation",
    "summarized_story": "Kingsley Nwezeh in AbujaThe United States Federal Bureau of Investigation (FBI) Thursday wrote the Nigerian Police detailing the allegations levelled against Deputy Commisioner of Police, Mr Abba Kyari.\nIt also served the police the indictment processes with regard to the $1.1 million fraud committed by internet fraudster, Ramon Abbas Olarewaju also know as Hushpupi, which was linked to Kyari.\nA statement issued by Force Public Relations Officer, Mr Frank Mba, a Commisioner of Police, said the IG on receipt of the process ordered an investigation into the matter and a review of the information from the FBI.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners”, it said.\nThe statement titled “Alleged Indictment of DCP Abba Kyari: IGP Orders a Review of the Information”, said “further developments on this case will be communicated to members of the public accordingly”."
  },
  {
    "headline": "CBN Set to Refund Pending Licensing Fees to BDC Promoters",
    "summarized_story": "James Emejo in AbujaThe Central Bank of Nigeria (CBN) Thursday said it will commence the immediate refund of capital deposits and licensing fees, where applicable, to Bureau De Change (BDC) promoters who have pending license applications with the bank.\nThe CBN’s move is sequel to Tuesday’s Monetary Policy Committee(MPC) briefing where the apex bank’s Governor, Mr. Godwin Emefiele announced a ban on sale of foreign exchange to BDC operators forthwith.\nHe had also declared a stoppage to all pending applications for new licences to operate a BDC.\nIn addition, the CBN further directed all deposit money banks to henceforth stop accepting instructions from customers to transfer capital deposits of N35 million to the designated CBN account for the purpose of applying for BDC licenses.\nThe CBN further reminded banks that a toll-free line had been set up at the apex bank to enable bank customers to escalate unresolved complaints related to their FX requests."
  },
  {
    "headline": "Hushpuppi: US Court Orders Arrest of DCP Kyari",
    "summarized_story": "By Kingsley NwezehA United States Court has ordered the arrest of Nigeria’s top cop and Deputy Commissioner of Police, Mr Abba Kyari.\nA District Court of California issued a warrant of arrest for Kyari over his role in series of fraud committed by notorious internet fraudster, Ramon Abbas aka Hushpuppi.\nTHISDAY gathered that Otis Wright of the United States District Court for the Central District of California ordered the Federal Bureau of Investigation (FBI) to arrest Kyari and produce him in the United States for his role in a $1.1million fraud.\nUS Court documents showed that American prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nIt was further gathered that Judge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26, 2021."
  },
  {
    "headline": "Buni’s Position as Caretaker Chair Not Injurious to APC Congresses, Anambra Guber, Says APC Counsel",
    "summarized_story": "Akintola who addressed a press conference on Thursday morning alongside the Secretary of the party, Sen. John Akpanudoedehe, called on all prey members not to entertain any fear.\nHe said the Tribunal ruled that the holding of political position does not contravene Section 183 of the Constitution, which he said was upheld by the Appeal Court as well as the Supreme court.\nAkeredolu’s victory, which rested on a split judgment of four against three out of the seven justices on the election panel, had managed to scale through because the opposition Peoples Democratic Party (PDP) failed to join Buni in the matter.\nHis prayer was hinged on the fact that the acting National Chairman of the APC and Yobe State Governor, Mai Mala Buni, was the one, who forwarded Akeredolu’s name to the Independent National Electoral Commission (INEC) as candidate of the APC in the October 20, 2020 poll.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Nigeria’s Super Cop, Abba Kyari, Named in Hushpuppi’s $1m Fraud Case",
    "summarized_story": "Ramon Olorunwa Abbas, also known as Ray Hushpuppi“After this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nAccording to the indictment, Abbas allegedly conspired with Abdulrahman Imraan Juma, a.k.a.\nThe proceeds of the fraud allegedly were laundered in several ways.\nAccording to the indictment, Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria."
  },
  {
    "headline": "Nigeria Police Force Finally Speaks On FBI Fraud Allegations Against Its Celebrated Cop, Abba Kyari",
    "summarized_story": "\"The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\nThe United States' Court earlier issued a warrant of arrest for Kyari, over his role in serial internet fraudster, Ramon Abbas, more commonly Hushpuppi’s multi-million naira fraud probe.\nThe FBI said Abbas and Kyari have been friends and were both involved in a conspiracy to launder money.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "Nigeria Police Force Finally Speaks On FBI Fraud Allegations Against Its Celebrated Cop, Abba Kyari",
    "summarized_story": "\"The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\nThe United States' Court earlier issued a warrant of arrest for Kyari, over his role in serial internet fraudster, Ramon Abbas, more commonly Hushpuppi’s multi-million naira fraud probe.\nThe FBI said Abbas and Kyari have been friends and were both involved in a conspiracy to launder money.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "Nigeria's Celebrated Policeman, Kyari Tells International Fraudster, Hushpuppi: I Will Send My Team's Account Details For You To Bribe Them",
    "summarized_story": "This elicited anger from Abbas (Hushpuppi), who contacted Kyari to arrest and jail his rival over the dispute.\nAbbas (Hushpuppi) said Kyari sent pictures of Vincent in jail and subsequently sent a bank account number to him (Hushpuppi) to which a wire transfer should be made having done a 'good' job as sent by Abbas (Hushpuppi).\nAccording to the document, after an earlier discussion with Kyari, Hushpuppi requested for Vincent's (also known as Chibuzor) contact details, which the latter provided.\nHushpuppi forwarded the contact details to Kyari and on January 15, 2020, Hushpuppi sent an audio recording to Kyari via WhatsApp, stating that he wanted to remind Kyari about what they discussed earlier.\nHushpuppi responded “Ok sir, tomorrow by noon.\""
  },
  {
    "headline": "Nigeria's Celebrated Policeman, Kyari Tells International Fraudster, Hushpuppi: I Will Send My Team's Account Details For You To Bribe Them",
    "summarized_story": "This elicited anger from Abbas (Hushpuppi), who contacted Kyari to arrest and jail his rival over the dispute.\nAbbas (Hushpuppi) said Kyari sent pictures of Vincent in jail and subsequently sent a bank account number to him (Hushpuppi) to which a wire transfer should be made having done a 'good' job as sent by Abbas (Hushpuppi).\nAccording to the document, after an earlier discussion with Kyari, Hushpuppi requested for Vincent's (also known as Chibuzor) contact details, which the latter provided.\nHushpuppi forwarded the contact details to Kyari and on January 15, 2020, Hushpuppi sent an audio recording to Kyari via WhatsApp, stating that he wanted to remind Kyari about what they discussed earlier.\nHushpuppi responded “Ok sir, tomorrow by noon.\""
  },
  {
    "headline": "Economic And Financial Crimes Commission Recovers Trapped N5.4billion For Nigeria's Health Insurance Scheme",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has recovered N5.4 billion for the National Health Insurance Scheme (NHIS).\nThis information was provided in a statement by the Head, Media and Publicity for the EFCC, Wilson Uwajaren, on Thursday.\nSambo commended the EFCC for the recoveries and assured that every kobo recovered will be judiciously utilised.\nHe also informed the EFCC about the reform efforts at the NHIS, which include the recruitment of health professionals to improve the scheme.\n“The EFCC has no choice but to work with you, to make you succeed."
  },
  {
    "headline": "Falana: Buratai wanted Igboho handed over to him -- but Benin Republic told him to follow due process",
    "summarized_story": "Femi Falana, human rights lawyer, says Benin Republic told Tukur Buratai, Nigeria’s ambassador to the country, that the rule of law will guide the extradition of Sunday Adeyemo, a youth leader popularly known as Sunday Igboho.\nAdvertisementIgboho, who is currently in detention in Benin Republic, was arrested on July 19 in Cotonou by the country’s security forces while trying to flee to Germany.\nSpeaking on the development, Falana, on Thursday, in a programme on Channels Television, said Buratai, the former chief of army staff, asked that Igboho should be handed over to him.\nThe human rights lawyer asked the federal government to respect human rights and always follow the legal approach in dealing with those calling for secession so that the country will be respected among civilised nations.\nAdvertisement“Unless we respect the rights of our people and the human rights of people in our country, we are going to be embarrassed continuously,” he added."
  },
  {
    "headline": "Falana: Buratai wanted Igboho handed over to him -- but Benin Republic told him to follow due process",
    "summarized_story": "Femi Falana, human rights lawyer, says Benin Republic told Tukur Buratai, Nigeria’s ambassador to the country, that the rule of law will guide the extradition of Sunday Adeyemo, a youth leader popularly known as Sunday Igboho.\nAdvertisementIgboho, who is currently in detention in Benin Republic, was arrested on July 19 in Cotonou by the country’s security forces while trying to flee to Germany.\nSpeaking on the development, Falana, on Thursday, in a programme on Channels Television, said Buratai, the former chief of army staff, asked that Igboho should be handed over to him.\nThe human rights lawyer asked the federal government to respect human rights and always follow the legal approach in dealing with those calling for secession so that the country will be respected among civilised nations.\nAdvertisement“Unless we respect the rights of our people and the human rights of people in our country, we are going to be embarrassed continuously,” he added."
  },
  {
    "headline": "IGP orders probe of bribery allegations against DCP Kyari",
    "summarized_story": "Usman Alkali Baba, the inspector-general of police (IGP), has ordered an internal probe of the allegations against Abba Kyari, a deputy commissioner of police.\nAdvertisementFrank Mba, the police spokesman, broke the news in a statement on Thursday.\nThe statement was released a few hours after an exclusive report by TheCable that the police will set up a panel to probe Kyari over his alleged relationship with Hushpuppi.\nIn the statement, the IGP said no stone will be left unturned in unearthing the truth in the matter.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners."
  },
  {
    "headline": "IGP orders probe of bribery allegations against DCP Kyari",
    "summarized_story": "Usman Alkali Baba, the inspector-general of police (IGP), has ordered an internal probe of the allegations against Abba Kyari, a deputy commissioner of police.\nAdvertisementFrank Mba, the police spokesman, broke the news in a statement on Thursday.\nThe statement was released a few hours after an exclusive report by TheCable that the police will set up a panel to probe Kyari over his alleged relationship with Hushpuppi.\nIn the statement, the IGP said no stone will be left unturned in unearthing the truth in the matter.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners."
  },
  {
    "headline": "MAN IN THE NEWS: DCP Abba Kyari, the super cop entangled in Hushpuppi's fraud case",
    "summarized_story": "It was on this basis, the court documents stated, that Hushpuppi was said to have contacted Kyari to facilitate his arrest.\nAdvertisementAs news of the alleged dealings with the embattled socialite became public knowledge, Kyari denied the allegations.\nSuper cop tasked with high-profile assignmentsKyari, born March 17, 1975, leads the inspector-general of the police intelligence response team (IGP-IRT).\nBut despite his well-publicised sterling qualities as a police officer, Kyari has also been accused of several acts unbecoming of a supposedly model cop.\nAdvertisementN41 million ‘extortion’ caseIn October 2020, Kyari was accused of extorting N41 million from one Afeez Mojeed, a Lagos-based businessman."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "Here’s why PiggyVest acquired VFD-owned Savi",
    "summarized_story": "The Nigeria-based wealth management app giant announced in a Medium post that it has acquired a smaller competitor Savi.ng.\nUnder the deal, all existing Savi.ng users will be automatically migrated to Piggyvest.\n“It’s more of a team acquisition,” PiggyVest co-founder, Joshua Chibueze, explained to TechCabal over a call.\nThe team behind Savi are reputed to have solid expertise in finance and are savvy with financial tools.\nPiggyVest did let TechCabal know that there are more acquisition announcements to come in the year."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Alpha Mead launches Call2Fix app",
    "summarized_story": "Share this article:“More than 70% of the lifecycle of any building is in maintenance.”These were the words of Femi Akintude, Group CEO, Alpha Mead Group (AMG), at the launch of its latest product, the Call2Fix app, recently.\nIt is the first FM company in Nigeria to be certified to international standards — ISO 9001: 2015.\nAlpha Mead hopes to solve this problem, and after almost 36 months of research, the company has officially launched its Call2Fix app.\nYou can choose to open several at once, depending on if you want to be a customer, service provider, materials supplier, or all.\nCurrently, the company is present only in Lagos, but Ogunyooye revealed that over the next three months, Call2Fix would expand into major cities in Nigeria."
  },
  {
    "headline": "4 tech tools to help people with dyslexia overcome workplace and school challenges",
    "summarized_story": "Numerous assistive technologies exist to aid dyslexics with reading, writing, and organising their work or events.\nWe have identified four tools that can help dyslexics succeed academically and professionally.\nIt can also pick a font designed to help users read comfortably and change font size, spacing, and background colour.\nUsing evaluation and instructional help, more tech tools like word processing, voice recorder, spell check, word prediction, and speech recognition can assist in learning, reading, writing, and editing.\nHence, the use of AT tools to help them perform better."
  },
  {
    "headline": "An insight into how early-stage venture firm, LoftyInc Capital Management, invests in African startups",
    "summarized_story": "They are both portfolio companies of LoftyInc Capital Management, creators of Wennovation Hub, Nigeria’s first private incubator.\nInspired by the Houston Angel Network, they decided to set up the LoftyInc Angel Network in Nigeria.\nAdvertisementAnd so, in June 2012, together with a few other African angel investors including Tomi Davies and Dotun Sulaiman, the Lagos Angel Network was formed.\nCriteria for investing in startupsLoftyInc is a sector-agnostic firm that invests in startups building products that users really need.\nIn doing so, we have found our experiences launching startups, building larger corporations, and angel investing have proven invaluable,” Bello adds."
  },
  {
    "headline": "Experts canvass UK model to fix Nigeria’s housing delivery problems",
    "summarized_story": "As Nigeria’s housing demand-supply gap continues to widen as a result of delivery problems investors have to contend with, experts have canvassed the use of the UK model to fix the problems.\nIn Nigeria, housing delivery is largely private-sector driven unlike the UK where, the experts say, the government plays a major role, creating policy and regulatory environment for delivery of affordable housing through the Ministry of Housing and a dedicated agency known as Homes England.\nNigeria’s housing problem as reflected in its 20 million units’ deficit and about 100,000 annual output which basically resides in affordable housing for low income earners.\nThough some analysts say affordable housing is not social housing, others describe it as that house-type that does not take more than 30 percent of household income to buy.\nThe group must also engage in joint planning towards the creation of affordable housing at different levels of society."
  },
  {
    "headline": "Family of detained separatist leader, Kanu complains to UK over lack of assistance",
    "summarized_story": "Family of detained separatist leader, Kanu complains to UK over lack of assistanceThe family of Nnamdi Kanu, a secessionist leader and British citizen who is detained in Nigeria, has accused Britain of failing to provide him with consular assistance, the family’s London lawyers said on Thursday.\nBindmans, a London law firm, said it had sent a pre-action letter to British Foreign Secretary Dominic Raab on behalf of Kanu’s family, challenging Britain’s failure to assist him.\nHowever, Bindmans said no consular visit had taken place.\nHis Nigerian lawyer has accused authorities in Kenya of detaining and mistreating him before handing him over to Nigeria; Kenya has denied involvement.\nBindmans said Kanu might have been the subject of extraordinary rendition from Kenya to Nigeria, an unlawful practice."
  },
  {
    "headline": "Banks say ready to provide dollar as CBN stops BDCs",
    "summarized_story": "Banks say ready to provide dollar as CBN stops BDCsNigeria’s deposit money banks (DMBs) on Thursday assured the public of their readiness to carry out the function of providing foreign exchange (FX) services to customers as directed by the Central Bank of Nigeria (CBN).\nHerbert Wigwe, group managing director/CEO, Access Bank, disclosed this to journalists at a zoom meeting on Thursday.\nResponding to the…"
  },
  {
    "headline": "Obaseki unveils plan to make Edo one of Africa’s top 20 economies, rallies United Nations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has unveiled the Making Edo Great Again (MEGA) vision to the United Nations Country Team (UNCT) in Nigeria, outlining the government’s audacious plan to make Edo State one of the 20 top economies in terms of Gross Domestic Product (GDP) in Africa by 2050.\nThe governor, in a presentation titled, ‘The Edo Vision: From Who We Are To Where We Want To Be by 2050’, at the United Nations House, Abuja, noted that the state is harnessing its human and natural resources to place it as a leading destination for investment in Nigeria.\nHe added: “With an estimated population of 10 million residents by 2050, our educational system must be the best in Nigeria and we should boast of one of the best workforce on the continent.\n“This will be achieved through rigorous planning in regional and urban planning, which will point to and emphasize what we must do to attain double-digit growth over the next three decades, and socio-economic master plans to complement the physical master plans.\n“The government will ensure the sustenance of its massive investment in infrastructure to take advantage of the location of Edo."
  },
  {
    "headline": "Obaseki charges citizens on civic duties, obedience to state’s laws – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged citizens to continue to obey laid down laws and regulations, and contribute their quota towards the development of the state.\nObaseki made the call when he received the executive members of the Police Officers Wives Association (POWA), Edo State Chapter, who were on a courtesy visit at the Government House, Benin City.\nObaseki, represented by his Chief of Staff, Hon.\nOsaigbovo Iyoha, noted that in running an open and transparent government, his administration will continue to maintain law and order in the state.\nAccording to him, “The Edo State Government, in all its dealings, is transparent, accountable and open, and will never witch hunt anyone."
  },
  {
    "headline": "PRESCO PLC Holds AGM, Shoots Up Revenue Profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Against the backdrop of the collapse in oil prices coupled with the COVID-19 pandemic, rising inflation, unemployment, infrastructure deficit, among others, PRESCO PLC shot up its revenue profile to N23.89 billion for the year 2020.\nThe highpoint of the AGM was the declaration and approval of a dividend of 200 kobo per share with N2,000,000,000 (Two billion naira only) set aside for shareholders subject to withholding tax.\nIn the Chairman’s statement, the revenue of N23.89 billion, represented a 21 percent increase on N19.72 billion of 2019.\nAccording to him, 52,178 tons of crude and refined products were sold during the year under review and 50,335 tons in 2019 with Fresh Fruit Bunches (FFB) harvest being 214,872 tons while in 2019 it was 200, 163 tons.\nThe Chairman, however observed that while the year under review had been of significant challenges, they were happy that the fundamentals of the company’s business remained strong which enabled them to achieve improved operational and financial results."
  },
  {
    "headline": "Supreme Court Judgment On Akeredolu Vindicated Me Why APC Will Lose Anambra And Others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn June I wrote an article to warn APC that it will lose Anambra, Ekiti and Osun elections.\nIf APC conducts its primaries for Ekiti-2022 and Osun-2022 elections, it will lose because caretaker committee is strange to APC constitution.\nAPC constitution does not recognize caretaker committee talk less of their activities.\nThe practice of democracy in Osun APC is today a mockery to democratic principles.\nMy attention has been drawn to a purported suspension Kolapo Alimi by the APC caretaker committee in Osun State, Elerin, ward 9, Irepodun South LCDA, Erin-Osun, State of Osun."
  },
  {
    "headline": "Nigerian govt institutions owe bulk of N70bn customer debts – Ikeja Electric",
    "summarized_story": "Ikeja Electric says some of the challenges facing the power distribution company include an outstanding N70.97 billion debt owed to the company by its customers.\nAccording to Mr Obi-Chukwu, Ikeja Electric had estimated a Capital Expenditure (CAPEX) that would strengthen its distribution network, improve revenue collection, reduce technical losses and efficient service delivery going forward.\nMr Obi-Chukwu noted that the number of metered customers under Ikeja Electric was the highest among all the 11 DisCos.\nHe said the DisCo had been making investments to upgrade its network in order to guarantee reliable and stable power supply to its customers.\nEarlier in her address of welcome, Folake Soetan, chief executive officer, Ikeja Electric, thanked the lawmakers for the visit to the company."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Flour Mills reports N233.7bn turnover in Q1",
    "summarized_story": "Adebayo ObajemuFlour Mills of Nigeria Plc on Wednesday published its financial statement for First Quarter ended, 30 June 2021.\nA turnover of N233.703 billion was reported for the three months period, up by 51.19% from N154.58 billion reported the previous year.\nProfit after tax grew by 9.57% to N5.446 billion from N4.971 billion reported the previous year.\nEarnings per share of Flour Mills increased to N1.33 from the EPS of N1.21 in Q1 2020.\nAt the share price of N30.75, the P.E ratio of Flour Mills stands at 23.15x with earnings yield of 4.32%."
  },
  {
    "headline": "Ecobank remains payment gateway in Africa – Akinwuntan",
    "summarized_story": "Adebayo ObajemuThe Managing Director, Ecobank Nigeria, Patrick Akinwuntan has reiterated that the Pan African bank remains the payment gateway for Africa.\nHe noted that “naturally for us as a Pan African bank, we are set up to support the economic integration and development of Africa.\nIt is a payment switch that ensures payment without going through SWIFT but ensures instant value across the network.\nShe said LCCI will continue to partner with ECOWAS institutions to realise its objective of wealth creation, economic integration and commitment to peace and development.\nHe was optimistic that collaboration with the organized private sector would further boost commerce and the economy of member states"
  },
  {
    "headline": "Lafarge Africa boosts Q2 profit by 21.4% to N28.3bn",
    "summarized_story": "Adebayo ObajemuLafarge Africa (Wapco) on Thursday published its financial statement for the Second Quarter ended 30 June 2021.\nThe cement producer improved for the period under review achieved significant growth in its topline and bottom line figures.\nA turnover of N145.02 billion was reported, up by 20.30% from N120.54 billion reported the previous year.\nProfit after tax grew by 21.40% to N28.32 billion from N23.33 billion reported the previous year.\nAt the share price of N22.90, the P.E ratio of Lafarge Africa stands at 13.02x with earnings yield of 7.68%"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Head Of Service Worries Over Pension Scheme Implementation",
    "summarized_story": "The head of service of the federation, Dr. Folasade Yemi- Esan, has expressed concern over the incessant complaints about the contributory pension scheme by civil servants.\nShe spoke on Thursday at a virtual Town Hall Meeting on effective pension administration in the public service held in Abuja.\nADVERTISEMENTAccording to her, the review of the Pension Reform Act, 2014 is a major assignment that must be approached headlong.\n“In the same vein, over the past few years, series of articles have been published about the Pension Reform Act, 2014.\n“Thus, the Office of the Head of the Civil Service of the Federation has identified the review of the Pension Reform Act, 2014 as a major assignment which must be approached headlong and with every sense of responsibility,” she stated."
  },
  {
    "headline": "Head Of Service Worries Over Pension Scheme Implementation",
    "summarized_story": "The head of service of the federation, Dr. Folasade Yemi- Esan, has expressed concern over the incessant complaints about the contributory pension scheme by civil servants.\nShe spoke on Thursday at a virtual Town Hall Meeting on effective pension administration in the public service held in Abuja.\nADVERTISEMENTAccording to her, the review of the Pension Reform Act, 2014 is a major assignment that must be approached headlong.\n“In the same vein, over the past few years, series of articles have been published about the Pension Reform Act, 2014.\n“Thus, the Office of the Head of the Civil Service of the Federation has identified the review of the Pension Reform Act, 2014 as a major assignment which must be approached headlong and with every sense of responsibility,” she stated."
  },
  {
    "headline": "Hushpuppi: IGP Orders Probe Of Allegations Against Abba Kyari",
    "summarized_story": "The Inspector-General of Police (IGP), Usman Alkali Baba, has ordered investigation into the allegations against a leading operative of the Nigeria Police Force elite squad, DCP Abba Kyari, by the America’s Federal Bureau of Investigation (FBI).\nLEADERSHIP reports that Kyari was indicted in a multimillion-dollar money laundering scam involving Ramon Abbas aka Hushpuppi.\nKyari, however, denied the allegations, saying he only had a different and professional encounter with Hushpuppi.\nADVERTISEMENTBut a terse statement issued by the Force Public Relations Officer (FPRO), CP Frank Mba, on Thursday night, said IGP Baba’s decision followed the formal receipt of allegations and indictment processes against Kyari from the FBI by the Nigeria Police Force.\n“Further developments on this case will be communicated to members of the public accordingly,” Mba stated."
  },
  {
    "headline": "Hushpuppi: IGP Orders Probe Of Allegations Against Abba Kyari",
    "summarized_story": "The Inspector-General of Police (IGP), Usman Alkali Baba, has ordered investigation into the allegations against a leading operative of the Nigeria Police Force elite squad, DCP Abba Kyari, by the America’s Federal Bureau of Investigation (FBI).\nLEADERSHIP reports that Kyari was indicted in a multimillion-dollar money laundering scam involving Ramon Abbas aka Hushpuppi.\nKyari, however, denied the allegations, saying he only had a different and professional encounter with Hushpuppi.\nADVERTISEMENTBut a terse statement issued by the Force Public Relations Officer (FPRO), CP Frank Mba, on Thursday night, said IGP Baba’s decision followed the formal receipt of allegations and indictment processes against Kyari from the FBI by the Nigeria Police Force.\n“Further developments on this case will be communicated to members of the public accordingly,” Mba stated."
  },
  {
    "headline": "EFCC Recovers N5.4bn For NHIS",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has recovered N5.4billion for the National Health Insurance Scheme (NHIS).\nExecutive Secretary of NHIS, Prof. Muhammad Nasir Sambo, made the disclosure on Thursday when he led the management of the agency on a courtesy visit to the headquarters of the EFCC in Jabi, Abuja.\nADVERTISEMENTProf Sambo commended the EFCC for the recoveries and assured that every kobo recovered will be judiciously utilized.\nResponding, the executive chairman of the Commission, Abdulrasheed Bawa, who was represented by the Director of Operations, Abdulkarim Chukkol, reiterated the agency’s resolve to work with the NHIS in achieving universal health coverage.\n“The EFCC has no choice but to work with you, to make you succeed."
  },
  {
    "headline": "BBNaija6: Why I can’t do without Yousef –Saskay",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Saskay, has revealed that she’s attracted to Yousef because of this personality.\nSaskay said this during her Diary Session with Big Brother on Thursday, day five of the show.\nIn Big Brother Naija, a Diary Session is a one-on-one conversation with Big Brother, where you get to answer questions about your experiences in the house.\nDuring the session, Biggie asked Saskay how she felt about Peace’s choice of Yousef as her Deputy Head of House.\nSaskay said she believed that Peace chose Yousef because of his personality which is attractive to “every lady”."
  },
  {
    "headline": "BBNaija6: Why I can’t do without Yousef –Saskay",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Saskay, has revealed that she’s attracted to Yousef because of this personality.\nSaskay said this during her Diary Session with Big Brother on Thursday, day five of the show.\nIn Big Brother Naija, a Diary Session is a one-on-one conversation with Big Brother, where you get to answer questions about your experiences in the house.\nDuring the session, Biggie asked Saskay how she felt about Peace’s choice of Yousef as her Deputy Head of House.\nSaskay said she believed that Peace chose Yousef because of his personality which is attractive to “every lady”."
  },
  {
    "headline": "Unilorin Final Year Student Lands in Jail Over Cybercrime",
    "summarized_story": "By JUMOKE SANNIThe Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, has secured the conviction of a final year student of University of Ilorin, Ajani Samuel, over internet-related offences, including romance scam.\nAjani, 25, was among the 30 suspected fraudsters arrested on May 4, 2021 around Tanke Area, University Road, Ilorin by operatives of the Commission.\n“The evidence of the sole prosecution witness remained credible and reliable even after the cross-examination.\nThe defendant entered defence, but failed to neutralise, controvert or damage the evidence of the prosecution”, the judge said.\nThe judge also ordered the forfeiture of the convict’s iPhones, laptop and the manager’s cheque of N 100,000 (One Hundred Thousand Naira) raised as restitution by the convict to his victims, to the Federal Government."
  },
  {
    "headline": "Unilorin Final Year Student Lands in Jail Over Cybercrime",
    "summarized_story": "By JUMOKE SANNIThe Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, has secured the conviction of a final year student of University of Ilorin, Ajani Samuel, over internet-related offences, including romance scam.\nAjani, 25, was among the 30 suspected fraudsters arrested on May 4, 2021 around Tanke Area, University Road, Ilorin by operatives of the Commission.\n“The evidence of the sole prosecution witness remained credible and reliable even after the cross-examination.\nThe defendant entered defence, but failed to neutralise, controvert or damage the evidence of the prosecution”, the judge said.\nThe judge also ordered the forfeiture of the convict’s iPhones, laptop and the manager’s cheque of N 100,000 (One Hundred Thousand Naira) raised as restitution by the convict to his victims, to the Federal Government."
  },
  {
    "headline": "Breaking: U.S. Congress blocks arms sale to Buhari govt over rights abuses",
    "summarized_story": "Reported by Doyinsola Oladipo and Mike Stone/Reuters; additional reports by AbankulaU.S. Congress has put on hold a proposal to sell almost $1 billion of weapons to Nigeria over human rights abuses by the Buhari government.\nReuters, which reported the Obama era-like arms embargo, relied on three sources, said to be familiar with the matter.\nForeign Policy reported earlier this week that the State Department had informally notified Congress of the proposed sale but it was frozen in the Senate committee.\nUnder normal practice, the State Department tells Congress of proposed arms sales informally in advance to give lawmakers the chance to put a hold on the proposals to raise concerns.\nIf Congress opposes the sale after a formal notification, it can pass legislation to block it."
  },
  {
    "headline": "Abba Kyari: PDP demands forensic investigation",
    "summarized_story": "By Kazeem UgbodagaThe Peoples Democratic Party (PDP) on Thursday demanded a forensic investigation into reports that the United States (US) Federal Bureau of Investigation (FBI) has linked head of IGP Intelligence Response Team, DCP Abba Kyari, to international fraudster, Abbas Ramon, popularly known as Hushpuppi.\n“Our party demands that the APC administration should not sweep this matter under the carpet given the manifest rapport between Kyari and some top APC leaders,” it said.\nThe statement urged Buhari not to “ease out” this case of corruption but should immediately restore the integrity and image of the nation by allowing for a forensic investigation on the suspect.\n“Moreover, if this Abba Kyari matter is not well handled, it will be a permanent stain on the reputation of our police, security system and our nation at large,” the party added.\nThe PDP therefore asked Buhari to direct the Inspector General of Police to take in Abba Kyari for questioning and that if found culpable, he should be handed over to the FBI."
  },
  {
    "headline": "Abba Kyari: IGP Alkali Baba speaks on FBI indictment",
    "summarized_story": "The Inspector General of Police, Alkali Baba has ordered an “internal review” of the indictment of DCP Abba Kyari, by the FBI of the United States.\nIn a short statement, IGP Baba said he had received the FBI papers and has ordered an internal review.\nPerhaps, unknown to Kyari, Hushpuppi and Vincent jointly carried out the Qatari man’s scam and quarrelled over loot sharing formula.\nThe indicted three in Africa are Abba Kyari, Vincent and the Kenyan .\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria."
  },
  {
    "headline": "BREAKING: Police IG, Usman Baba Orders Probe Of Abba Kyari Over Internet Fraud Scandal",
    "summarized_story": "ALLEGED INDICTMENT OF DCP ABBA KYARI: INSPECTOR-GENERAL OF POLICE ORDERS A REVIEW OF THE INFORMATIONSequel to the receipt of allegation and indictment processes from the Federal Bureau of Investigation (FBI) against one of the personnel of the Nigeria Police Force, DCP Abba Kyari, the Inspector General of Police IGP Usman Alkali Baba psc (+), NPM, fdc has ordered an internal review of the allegations.\nThe Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\nFurther developments on this case will be communicated to members of the public accordingly.\nCP FRANK MBAFORCE PUBLIC RELATIONS OFFICER,FORCE HEADQUARTERS,ABUJA."
  },
  {
    "headline": "Gunmen Kidnap Popular Nightclub Owner In Bayelsa",
    "summarized_story": "Tari Ajanami, the owner of a prominent nightclub in Yenagoa, the capital of Bayelsa State, has been kidnapped by unknown gunmen.\nAjanami, a native of Ayamasa town in the state’s Ekeremor Local Government Area, was kidnapped at his construction site on Otiotio Road in the state capital around 6 p.m. on Wednesday.\nAjanami, 43, is the owner of Club 64, a prominent nightclub in Yenagoa’s Bay Ridge neighborhood, as well as a cash officer at Wema Bank.\nSaharaReporters gathered that the victim was at his building site to pay workers when the gunmen whisked him away to an unknown destination.\n“All operatives have been alerted and are on the trail of the suspects.”"
  },
  {
    "headline": "VIDEO: Buhari Goofs On International Stage, Says “You Cannot Succeed Outside Your Educational Qualification”",
    "summarized_story": "President Muhammadu Buhari claims that no one can prosper without a good education, therefore Nigerians understand the importance of education.\nBuhari stated that the country’s population presents a difficulty for any administration; nonetheless, the government and the people have recognized that education is the foundation for prosperity.\nAnybody who missed education has missed everything.\nNigerians are acutely aware of the priority of education, and parents are making sacrifices to ensure that their children and wards get educated,” Buhari said.\nPresidents Nana Akufo-Addo of Ghana, Faure Gnassingbe of Togo, Uhuru Kenyatta of Kenya, and Lazarus Chakwera of Malawi were on the panel with Buhari."
  },
  {
    "headline": "BREAKING: Again, DSS Denies Lawyers Access To Nnamdi Kanu",
    "summarized_story": "Ifeanyi Ejiofor, Nnamdi Kanu’s lawyer, claims the Department of State Security Services (DSS) denied him access to his client on Thursday.\nAccording to a statement released by Ejiofor, the DSS refused to enable them to meet with Kanu on Thursday evening as required by a court order given by Justice Binta Nyako last Monday.\n“The Department of State Security Services (DSS) for the umpteenth time, denied us access to our Client today, insisting that our request would be looked into and accordingly approved by their DG before we could be granted access to him.”“On the 26th Day of July 2021, His Lordship, Hon.\nJustice Nyako of Court No.\nLet the World and all responsible Foreign Government take Notice of this dangerous trend.”"
  },
  {
    "headline": "Breaking – Fraud allegations against Abba Kyari: IGP breaks silence",
    "summarized_story": "Kyari had arrested and jailed one Chibuzo Vincent, an estranged co-conspirator in a $1.1million fraud case at the behest of Hushpuppi.\nThe deputy commissioner also allegedly sent a bank account to Hushpuppi reportedly for the payment for Vincent’s arrest and imprisonment.\nAccording to the indictment, “Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\n“Kyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” the US court document read in part."
  },
  {
    "headline": "Breaking: Two BBNaija season 6 ‘Shine Ya Eye’ wildcards revealed",
    "summarized_story": "Existing ‘wild cards’ in the Big Brother Naija season six ‘Shine Ya Eye’ reality show have finally been revealed.\n‘Wild Cards’ are fake housemates planted among the 22 housemates when the show kicked off on July 24.\nThe fake housemates were revealed to viewers during Thursday’s ‘diary session’ of the house.\nThe Wild Cards’ purpose is to provide entertainment in the Big Brother house.\nThe fake housemates would be evicted during the live show only if the housemates were able to identify them, and failure to identify the wildcards, allows them remain in the house."
  },
  {
    "headline": "Breaking: US Court orders FBI to arrest Abba Kyari over multi-million dollar fraud allegation",
    "summarized_story": "US Court has issued a warrant of arrest on Nigeria’s deputy police commissioner, Abba Kyari, Court documents have revealed.\nMr Abbas was arrested in Dubai last June and he pleaded guilty to fraud in the U.S. this week.\nMr Kyari was also indicted of receiving bribes from Mr Abbas to arrest a member of the syndicate in Nigeria.\nAmerican prosecutors first sought a court warrant to arrest Mr Kyari on February 12, 2021, according to court documents seen by The Gazette.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "Abba Kyrai: PDP demands full investigation -NigPilot",
    "summarized_story": "Peoples Democratic Party, PDP , has demanded a forensic investigation into reports that the United States (US) Federal Bureau of Investigation (FBI) has linked the head of IGP Intelligence Response Team, DCP Abba Kyari, to the international fraudster, Abbas Ramon, popularly known as Hushpuppi.\nAccording to the party, the revelation of the involvement of Kyari, the head of Nigeria’s intelligence response unit, as a receiver of proceeds of international fraud is worrisome, disturbing, and a stain on the integrity of our nation.\n“Our party demands that the APC administration should not sweep this matter under the carpet, given the manifest rapport between Kyari and some top APC leaders.\nWe urge President Buhari not to “ease out” this case of corruption, but should immediately restore the integrity and image of our nation by allowing for a forensic investigation on the suspect.\n“Moreover, if this Abba Kyari matter is not well handled, it will be a permanent stain on the reputation of our police, security system, and our nation at large.”The PDP asked President Buhari to direct the Inspector General of Police to take in Abba Kyari for questioning and if found culpable, he should be handed over to the FBI."
  },
  {
    "headline": "UK global Education summit Photo Op-NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Akeredolu’s Supreme Court Victory, A Legal Seal On Popular Choice Of The People-Fayemi -NigPilot",
    "summarized_story": "Ekiti State Governor, Dr. Kayode Fayemi , has congratulated his Ondo State counterpart, Arakunrin Oluwarotimi Akeredolu (SAN) on the affirmation of his election by the Supreme Court.\nGovernor Fayemi in a statement by his Chief Press Secretary, Yinka Oyebode, said the apex court in the land has put a legal seal on the popular choice made by the people of Ondo State at the October 10, 2020 election.\n” This is a great news not only for my brother Governor Akeredolu and our party, the All Progressives Congress ( APC), it is victory for democracy.\nI congratulate Govermor Akeredolu and the people of Ondo State for the atmosphere of peace that reigned throughout the period of the judicial process.\nOn behalf of the government and people of Ekiti State I congratulate Governor Akeredolu, the government and people of Ondo State and wish the governor a successful tenure’ he added."
  },
  {
    "headline": "Tenure elongation: CSO calls for respect of Public Service Rules -NigPilot",
    "summarized_story": "The group under the umbrella of the Civil Society Network for Good Governance has called for the respect of Public Service Rules, citing the continuous stay in office of the Accountant General of the Federation, AGFIn a press conference held on Thursday in Abuja, the group’s National President, Barr.\nAdefila Kamal decried that the AGF who ought to have “relinquished his position” was “unilaterally” given a tenure elongation.\nThe group worried that “rampaging corruption” has characterized Nigeria’s public service, adding that laws are manipulated by people in positions of authority.\n“It is the informed position of our organization that there is no guise under which clearly stipulated provisions of our laws should be bent to serve personal interests in institutions owned by the collective powers of Nigerians.\n“The sitting Accountant General of the Federation is a classic case in point of this ill-advised practice of unilaterally subverting the interests of all Nigerians to serve sectional interests."
  },
  {
    "headline": "Hushpuppi: IGP Orders Review Of Allegations Against Abba Kyari",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has ordered an “internal review of the allegations” against a Deputy Commissioner of Police, Abba Kyari, by a United States Court.\nKyari also allegedly sent Hushpuppi bank account details for an account into which Hushpuppi could deposit payment for Vincent’s arrest and imprisonment.\nMr Kyari, in a Facebook post on Thursday, denied the allegations.\n“Nobody demanded a kobo from Abbas Hushpuppi,” Mr Kyari said.\nThe clothes “were brought to our office and he sent somebody to collect them in our office,” Mr Kyari said."
  },
  {
    "headline": "US Court Issues Arrest Warrant For Abba Kyari",
    "summarized_story": "A US court has issued an arrest warrant for a Deputy Commissioner of Police, Abba Kyari over his links to alleged fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe arrest warrant was issued by a U.S magistrate judge, Otis Wright, a spokesperson in the United States Attorney’s Office confirmed to Channels Television.\nMr Kyari also allegedly sent Hushpuppi bank account details into which Hushpuppi could deposit payment for Vincent’s arrest and imprisonment.\n“Nobody demanded a kobo from Abbas Hushpuppi,” Mr Kyari said.\nThe clothes “were brought to our office and he sent somebody to collect them in our office,” Mr Kyari said."
  },
  {
    "headline": "Terrorism War: We Are Available To Help, Boris Johnson Tells Buhari",
    "summarized_story": "British Prime Minister Boris Johnson has said that the UK is available to assist Nigeria in its war against terrorism.\nJohnson stated this while holding bilateral talks at the sidelines of the Global Education Summit in London on Thursday.\nPresident Buhari had earlier reviewed the security situation in the different regions of the country, while PM Johnson pledged Britain’s preparedness to lend a helping hand.\n“We are available to help,” he said.\nNigeria’s power needs and efforts which are being made, as well as initiatives geared at achieving food security, were also brought to the table."
  },
  {
    "headline": "Despite Order, DSS Fails To Produce Igboho’s Detained Aides In Court",
    "summarized_story": "The Department of State Services (DSS) has defied a court order to produce the 12 detained aides of Yoruba-nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho.\nJustice Obiora Egwuatu of the Federal High Court in Abuja had ordered the DSS to produce in court on July 29, the 12 aides who have been in their custody since July 2, 2021.\nBut since the DSS failed to bring the aides before the court on Thursday, the case has stalled yet again, with Justice Egwatu now issueing another order, asking the DSS to produce the 12 aides in court on Monday, August 2.\nIn addition, Olajenbasi asked that the court orders the DSS to release the aides on bail and grant him access to them.\nThe suspects had earlier sued the DSS before the Federal High Court Abuja, on grounds that their fundamental human rights had been infringed."
  },
  {
    "headline": "Amazon Quarterly Profit Jumps But Shares Slide",
    "summarized_story": "Amazon said Thursday second-quarter profit jumped 48 percent from a year ago to $7.8 billion, but shares in the tech and e-commerce giant fell on a disappointing revenue number.\nTotal revenues increased 27 percent to $113.1 billion, below most Wall Street forecasts, sparking a slide of some six percent in after-hours trading.\nAndy Jassy, who took over as chief executive earlier this month from Jeff Bezos, said Amazon remained focused on delivering goods and services for consumers during the pandemic.\nAmazon has faced criticism over its workplace policies but has argued that it pays above-average wages and invested billions for employee safety.\nA growing number of consumers turned to Amazon during the pandemic for delivery of goods and services including groceries, and its cloud computing division also grew to help businesses and consumers stay connected."
  },
  {
    "headline": "“We are available to help Nigeria fight insecurity” – UK PM",
    "summarized_story": "President Muhammadu Buhari and Prime Minister Boris Johnson of Britain on Thursday, appraised the war against different forms of terrorism in Nigeria, and agreed that the judicial process be allowed to run its course.\nHolding bilateral talks at the sidelines of the Global Education Summit in London, the two leaders said it was important that the judicial process runs without interference, no matter who was involved.\nPresident Buhari briefed the Prime Minister on Nigeria’s power needs and efforts being made, as well as initiatives geared at achieving food security.\nHe also reviewed the security situation in the different regions of the country, while PM Johnson pledged Britain’s preparedness to lend a helping hand.\nAdvertisementThe two leaders equally discussed how to increase trade between the two countries, develop solar and wind power, leadership of the Commonwealth going forward and other matters of mutual interest."
  },
  {
    "headline": "Zamfara Assembly confirms receipt of deputy Gov’s letter, denies impeachment plan",
    "summarized_story": "The Zamfara state deputy governor, Mahdi Aliyu Gusau has described his impeachment plan by the state House of Assembly as improper, indecorous and and inappropriate.\nThe Deputy Governor said the move by the state Assembly is illegal as a federal high Court in Abuja had ordered the state Assembly to Suspend any move of impeachment against him.\nHe said despite the foregoing state of affairs, the Zamfara state Assembly have embarked on steps and actions to overreach the pending suit by scheduling a sitting to proceed with impeachment proceedings on ThursdayThe Zamfara state House of Assembly is accusing the state Deputy Governor Mahdi Aliyu of official misconduct and organizing a political rally when the state is mourning the death of fifty six persons killed by armed Bandits in Maradun local government area of the state.\nThey want him to appear before the House and answer questions.\nAdvertisementThe Deputy Governor had earlier shunned the invitation but has now expressed willingness to honour the invitation as soon as the court order allows him."
  },
  {
    "headline": "IGP orders review of Abba Kyari’s indictment by FBI",
    "summarized_story": "The Inspector General of Police, has ordered an internal review of the allegation against a Deputy Commissioner of Police, Abba Kyari.\nOtis Wright of the United States District Court for the Central District of California, United States had on Wednesday ordered the Federal Bureau of Investigation (FBI) to track down Mr Kyari and produce him in the United States for his role in a multi-million dollar fraud perpetrated by Ramon ‘Hushpuppi’ Abbas, a notorious Nigerian fraudster.\nNarrating his side of the story, Mr Kyari said his over two decades record in the profession remains unblemished, insisting his hands are clean and those celebrating his indictment will be disappointed.\nBut in a statement issued on Thursday by the Force PRO, Frank Mba, the Nigeria Police Force reaffirmed its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners.\nFurther developments on this case will be communicated to members of the public accordingly."
  },
  {
    "headline": "Again DSS Flouts Court Order, Denies IPOB Lead Counsel Access to Separatist Leader Nnamdi Kanu",
    "summarized_story": "Ifeanyi Ejiofor, counsel to detained leader of proscribed Indigenous People of Biafra (IPOB) has again been denied access to Nnamdi Kanu by Nigeria’s Department of State Security Services (DSS).\nHe continued, “while we awaited to be admitted for the visit, the officials of the DSS unfortunately came back to inform us that we should go and await further communication from them pending the approval of our request.\n“I am not suprised by the conduct of the DSS who has the history of disobedience to court orders, but I am worried because, we do not know the present state of health of our client.\nI cannot categorically confirm to the world the present state of Mazi Nnamdi Kanu, as at today.\n“Let the World and all responsible Foreign Government take Notice of this dangerous trend.”By Abel Ejikeme"
  },
  {
    "headline": "US Orders Arrest of Nigeria Supercop Abba Kyari Over Hushpuppi Bribe Allegations",
    "summarized_story": "A US court has ordered the arrest of a celebrated Nigerian cop, Deputy Commissioner of Police Abba Kyari, court documents have shown.\nSome reports suggest American prosecutors first filed a court warrant to arrest Kyari on February 12, 2021, while a new warrant for his arrest was issued on April 29, 2021.\nOn July 26, Judge Wright’s order allowing the FBI to arrest Kyari and hold him in US custody was made public.\n“Nobody demanded a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Cryptocurrencies Not Suitable As Legal Tender, IMF Warns",
    "summarized_story": "The International Monetary Fund (IMF) has warned against the adoption of cryptocurrencies like Bitcoin and Ethereum as legal tenders.\nAs contained in a blogpost titled ‘Crypto Assets as National Currency?\nThe IMF said, “Bitcoin and its peers have mostly remained on the fringes of finance and payments, yet some countries are actively considering granting crypto assets legal tender status, and even making these a second (or potentially only) national currency.\n“Crypto assets are unlikely to catch on in countries with stable inflation and exchange rates, and credible institutions.\n“Households and businesses would have very little incentive to price or save in a parallel crypto asset such as Bitcoin, even if it were given legal tender or currency status."
  },
  {
    "headline": "Mauritius Commercial Bank Signs $20m Term Loan with Bank of Kigali",
    "summarized_story": "The Mauritius Commercial Bank Limited (MCB) has successfully signed a $20Million term loan facility with Bank of Kigali Plc to support its strategic growth objectives.\nThis move is one among the many partnership areas MCB and Bank of Kigali Plc have had over the years.\nDespite the challenging market conditions, Bank of Kigali Plc maintains strong financial performance and continues to attract the support of financial institutions, showcasing investors’ confidence in the bank.\nBank of Kigali Plc remains a systemically important bank in Rwanda and injection of the funds into the economy will likely boost growth and development.\nThis transaction is one among the many partnership areas MCB and Bank of Kigali Plc have had over the years."
  },
  {
    "headline": "Nigeria: Central Bank to Refund Capital Deposits, Licensing Fees Of Pending BDC Applications",
    "summarized_story": "Following the Central Bank ban on the sales of FX to Bureaux de Change (BDC) operators, the apex bank is set to refund all capital deposits and licensing fees to promoters who have BDC licence applications.\nIn the circular, the apex bank informed BDC promoters with pending applications to forward their requests for the refund in writing to its headquarters in Abuja.\n“The requests should be accompanied with the following documents: (a) Telex copy of the capital deposit of N35 million,” the circular reads.\n“(b) Account details for the refund, which should be the same as the account from which the capital deposit originated, including the: (i) Bank name (ii) Account name (iii) Account number.\n“(c) Copy of the bank draft/telex for payment of licensing fee of N1 million (if any)."
  }
]