[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Davido records over billion streams on Spotify",
    "summarized_story": "DavidoBy Adeleye AdegboyegaAfrobeats superstar, David Adeleke, popularly known as Davido has achieved a new feat in his stellar music career by becoming the latest Nigerian artiste to record a billion streams across all credits on global digital platform, Spotify.\nHe joins Wizkid, Burna Boy, and Ckay as the other Nigerian artists who have surpassed a billion streams across all credits on Spotify.\n@davido has now surpassed 1 billion streams on Spotify across all credits.\nThe total stream is 1,000,319,205 across all credits and 1,066,022 Equivalent Album Sales.\nDavido is one of Africa’s most prominent music figures with 5M+ monthly listeners on Spotify."
  },
  {
    "headline": "143 stranded Nigerian returnees from Libya arrive Lagos",
    "summarized_story": "By Prince OkaforA fresh batch of 143 stranded Nigerian returnees from Libya, Tuesday, arrived at the Murtala Muhammed International Airport, Lagos.\nThey were received by the National Emergency Management Agency of Nigeria, NEMA, an agency set up by the Federal Government, responsible for tackling disaster-related issues through the establishment of concrete structures and measures.\nAccording to NEMA Director General, Mustapha Ahmed, “The Returnees were brought back to Nigeria through the Cargo Wing of the MMIA, with Al Buraq Air Boeing 737-800 registration number 5A – DMG at about 1518 hours“The profile of the individuals consists of 96 male adults, eight boys are eight, and one male toddler.\nWe had a total of 36 female adults, a girl, and a female toldler.\n“Among them are a female and a male adult with serious medical issues.” Meanwhile, the coordinator did not disclose the nature of their sickness."
  },
  {
    "headline": "2023: We’ll reject Muslim-Muslim ticket ― CAN Youth Wing",
    "summarized_story": "By Luminous Jannamike, AbujaThe Christian Association Nigeria, Youth Wing, has said there was no way it would allow its members to vote for a Muslim-Muslim ticket in the 2023 presidential election.\nThe Chairman, North-central zone of the body, Owoyemi Alfred Olushola, who briefed journalists in Abuja on Tuesday, said the Christian youths had resolved never to support the idea.\nAny well-meaning presidential candidate will focus the all-inclusive Federal Character.\n“Consequently, the Nigerian Christian youth are not unaware of division and tension currently overheating an heated polity in Nigeria and, therefore, will not support or encourage any action or decision capable of further dividing and setting this nation on fire.\n“Muslim-Muslim presidential ticket insults the sensitivity of Nigerians and the Christian youths are saying a big NO!"
  },
  {
    "headline": "FG has not borrowed a dime from pension funds, Pencom insists",
    "summarized_story": "By Luminous Jannamike, AbujaThe National Pension Commission (Pencom) has said that the Federal Government has not borrowed money from any pension fund administrator in the country.\nHe clarified that instead of the government to borrow pension funds, it was the investment teams of pension fund administrators that seek and put money into government bonds to balance their return and risk considerations.\n“The Federal Government has not borrowed pension funds, because people are giving the impression as if these monies are kept somewhere and government has dipped its hands into it.\n“Pension funds are invested.\n“Therefore, government does not borrow pension funds."
  },
  {
    "headline": "Transporters of Petroleum Products seek FGN’s support towards reducing cost of operations",
    "summarized_story": "By Abdulmumin Murtala, KanoThe Association of Distributors and Transporters of Petroleum Products (ADDITOPP) is calling on the Federal Government to create necessary concessions to its operations in order to reduce cost and provide petroleum products at a lesser retail rate.\n“The issue of foreign currency comes about as we are exploring ways to reduce the cost of operation and others.\nThe tires and most of the maintenance products, the lubricants are bought abroad, non of these things are manufactured locally.\n“Secondly, the issue of converting their trucks from using diesel to natural gas is also geared towards reducing the cost of operation.\n“Like you heard, the cost of picking up a product from Lagos to Kano per truck is about N1.2 million."
  },
  {
    "headline": "Nigerian govt condemns opposition to Water Bill as critics allege ‘Fulani interest’",
    "summarized_story": "The Federal Government of Nigeria said it will not be deterred by “detractors sponsoring false narratives” against the passage of the National Water Resources Bill.\nMinistry of Water Resources, Suleiman Adamu, condemned opposition to the bill at a news conference in Abuja on Tuesday.\nThe minister said it had been reviewed by water resources experts who worked on the grey areas.\nThe official explained that the bill seeks institutionalisation of a regulatory body to help fix the water sector to aid cost recovery and improve irrigation.\nThe reforms in the water resources sector would reposition it for the benefits of all Nigerians, Adamu added."
  },
  {
    "headline": "ASUU strike: It won’t take two days to resolve this problem – Prof. Osodeke",
    "summarized_story": "The president of the Academic Staff Union of Universities (ASUU), Prof. Emmanuel Osodeke, has claimed it will not take two days to resolve the current strike.\nASUU embarked on the current industrial action on February 14, 2022.\nEver since then, public universities have been shut down, the lecturers continued to press for their demands to be met.\nPresident Muhammadu Buhari earlier on Tuesday, gave the Minister of Education, Adamu Adamu, two weeks to resolve issues of contention regarding the ASUU strike.\nThat should not take two days,” Osodeke said."
  },
  {
    "headline": "Peter Obi a good manager of men, resources – Soludo",
    "summarized_story": "Anambra State Governor, Charles Soludo, has sent a goodwill message to Peter Obi.\nSoludo hailed Obi for his management of people and resources.\nThe governor said this was evident during Obi’s two-term tenure as Anambra chief executive.\n“Obi is a good manager of men and resources who gave his best in service to Anambra during his time in office”, he noted.\nSoludo encouraged Obi to devote the remaining part of his life to service to humanity."
  },
  {
    "headline": "CBN increases benchmark interest rate to 14%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) on Tuesday increased the Monetary Policy Rate (MPR) to 14 per cent from its initial 13 per cent.\nThe Governor, Godwin Emefiele said the MPC unanimously agreed to hold all other monetary policy parameters constant.\nEmefiele explained that the parameters were retained to contend the rising trend of inflation in Nigeria.\nThe MPC considered the continued aggressive movement in inflation even after the rate hike at its last meeting.\nThe CBN chief said members felt that loosening will trigger the weakening of the exchange rate which could pass through to domestic prices."
  },
  {
    "headline": "EFCC, ICPC told to investigate governors owing salaries, pensions",
    "summarized_story": "The Trade Union Congress of Nigeria, TCN, has asked that the Economic and Financial Crime Commission, EFCC, and the Independent Corrupt Practices Commission, ICPC, to investigate governors owing salaries and pensionsThe TUC president, Quadri Olaleye made the call at the 12th Triennial National Delegates Conference on Tuesday in Abuja.\nHe expressed worry over the huge number of states owing pension, salaries and allowances in arrears after collecting refund, bailout funds, budget support fund and the Paris debt refund.\n“We condemn it and demand that the EFCC and ICPC investigate and bring the governors to book.\n“It’s our thought that paying retirees their entitlement will assist to curb corruption because when people know that they will get their entitlements when they retire, it will check stealing.”Olaleye noted that the governors who claimed that they had no money to pay, have money to pay their predecessors and also fund “their reckless lifestyle’.\n“For those of them withholding the contributory pension deductions from workers salaries without remitting same to their Pension Fund Administration (PFAs), we warn that it is illegal and attracts some penalties,” Olaleye said."
  },
  {
    "headline": "Terrorists kill six, injure six others in Katsina village The Nation Newspaper",
    "summarized_story": "Terrorists kill six, injure six others in Katsina villageNo fewer than six people were killed on Tuesday afternoon when terrorists attacked Ruwangodiya village in Faskari Local Government Area of Katsina State.\nThe terrorists also injured six other persons during the incident, which happened around 1:30 pm.\nThe residents, who spoke under the condition of anonymity, further told The Nation that the terrorists were in the town to rustle domestic animals.\nKatsina Police Command spokesman SP Gambo Isah confirmed the incident when contacted by our correspondent.\nThe terrorists struck around 1.30 p.m and killed 6 people while 6 were injured."
  },
  {
    "headline": "Aviation fuel hits N892 per litre The Nation Newspaper",
    "summarized_story": "The challenges facing local airline operators worsened yesterday as aviation fuel price surged above N800 per litre.\nIn Lagos a litre went for N822; Abuja, N859; Port Harcourt, Rivers State N852; Yola, Adamawa State, N890 and Maiduguri, Borno State N892.\nThe product sold for between N580 and N600 per litre last month.\nAn industry player hinted to The Nation that the development might result in higher cost of tickets; delayed flights or outright cancellations.\nThe operator said “ This ( aviation price hike) will indeed affect our operations."
  },
  {
    "headline": "We will consider 100 per cent pay rise proposal",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has said it is open to considering the 100 percent pay rise being proposed by the Federal Government.\nThe union however said the government was yet to reach out on the new pay offer.\nFagge said the union was waiting for the government to give approval to the Briggs committee to sign the draft agreement reached with ASUU.\nHe said: “We have negotiated with a duly mandated committee that is appointed by government and we have reached draft agreement.\n“However, the 100 percent pay rise proposal is not before us."
  },
  {
    "headline": "Lagos-Ibadan Highway: Still a nightmare The Nation Newspaper",
    "summarized_story": "It has become normal for the contractor to narrow the road anytime without putting a sign or notice to inform millions of commuters.\nCommuters, who spoke to The Nation, wondered if the contractor could do this in its home country, Germany, and get away with it.\nCommuters also contend with highway robbers and petty thieves because the perennial traffic provides a cover for them.\nThe expressway has become a death trap for many, with long travelling hours experience for motorists and road users alike.\nOn Thursday, The Nation noted that the traffic on the expressway resurfaced after the resumption of construction at the Otedola/Secretariat end of the road."
  },
  {
    "headline": "$3.5m fraud: EFCC extradites FBI-wanted suspect to US The Nation Newspaper",
    "summarized_story": "A wire fraud suspect, Fatade Idowu Olamilekan, on the Federal Bureau of Investigation (FBI) wanted list was on Thursday, July 14 extradited to the United States for allegedly stealing over $3.5million worth of equipment in various cities across the US.\nRead Also:Fatade was indicted by a grand jury in the Southern District of New York for offences of wire fraud, interstate transportation of stolen property and identity theft.\nAccording to a statement by EFCC Head, Media & Publicity, Wilson Uwujaren, the suspect was arrested on September 30, 2021 by operatives of the EFCC and his extradition trial commenced sometime in November, 2021 before Justice Chukwujekwu Aneke of a Federal High Court sitting in Ikoyi, Lagos.\nOn May 1, 2022, the Judge granted the requestto extradite the suspect to the United States to answer to the criminal charges against him.\nUpon his arrival in the United States, the suspect is billed to appear before a United States District Court."
  },
  {
    "headline": "ASUU strike: Buhari gives Adamu 2-weeks ultimatum to resolve impasse with varsity unions",
    "summarized_story": "He gave the directive after he received briefings from relevant government Ministries, Agencies and Departments involved in resolving the face-off with the university unions, yesterday.\n“We have read in the media that there is a proposal for the review of salary for University staff with a differential of teaching staff taking between 108 to 180 percent and unreasonable of 10 percent for non teaching staff.\n“While we only met twice with them, we are aware that they have met with the teaching staff not less than ten times.\nWe are surprised how the so-called percentage was allocated to non teaching staff.\nWe are seriously shocked and taken aback by the media report that a certain miserable, unacceptable percentage was recommended to non teaching staff."
  },
  {
    "headline": "Adeboye denies endorsing Tinubu, stands by CAN’s directive",
    "summarized_story": "By Chinelo Obogo and Fred Ezeh, AbujaThe Redeemed Christian Church of God (RCCG) has denied reports that its General Overseer, Pastor Enoch Adeboye, met with the presidential candidate of the All Progressives Congress (APC), Bola Tinubu and endorsed his candidacy.\n“Pastor Adeboye and the RCCG have not and will not endorse any candidate for the 2023 general elections in Nigeria.\nThe body said the candidate must not be a member of any cult, must not have any involvement with drugs, witchcraft, Boko Haram or any violent religious group.\nThe Christian youth leader described the Muslim-Muslim ticket as adopted by APC as an insult on the sensitivity of Nigerians, and Christian youths have loudly said a big No to that decision.\nHe, thus, called on all peace-loving Christian youths and their counterparts in other faiths not to allow themselves to be bought over or cajoled into accepting actions and decisions that are not for the unity and progress of Nigeria."
  },
  {
    "headline": "Buhari unveils NNPC Ltd, assures of value with global best practices",
    "summarized_story": "By Adewale Sanyaolu and Juliana Taiwo-Obalonye, (Abuja)President Muhammadu Buhari has officially unveiled the Nigerian National Company Limited (NNPC), with a charge that it must ensure that its over 200 million shareholders and Nigerians at large, get value in line with global best practices.\nHe noted that the Petroleum Industry Act 2021 has no doubt give additional impetus for transparent and profitable energy venture.\n“We are transforming our petroleum industry, to strengthen its capacity and market relevance for the present and future global energy priorities.\n“By chance of history, I was privileged to lead the creation of the Nigerian National Petroleum Corporation on the July 1, 1977.\n“Coincidentally, I, on the 1st of July 2022 authorised transfer of assets from the Nigerian National Petroleum Corporation to its successor company, the Nigerian National Petroleum Company Limited, and steered the implementation leading to the unveiling of Africa’s largest National Oil company today."
  },
  {
    "headline": "Osinbajo making steady progress, starts walking –Doctors",
    "summarized_story": "Doctors in charge of Vice President Yemi Osinbajo’s care at the Duchess International Hospital, Ikeja, Lagos, have said he is making good and steady progress.\nChief Executive Officer of the hospital, Adetokunbo Shitta-Bey, who gave the update, yesterday, said the vice president was expected progress.\nShitta-Bey said the affordability of the facility was among the reasons the vice president chose to have a medical procedure here in Nigeria.\nOn his part, the Medical Director of the hospital, Adedoyin Dosunmu-Ogunbi, said Osinbajo was making steady progress.\nAnd in many cases, it is available, but if we do not have such services available in Nigeria then they can get it elsewhere,” he said."
  },
  {
    "headline": "APC unveils presidential running mate, Shettima, today",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) has announced it would formally unveil its vice presidential candidate, Kashim Shettima, to the Nigerian public today.\n“Others include presidential aspirants at the June 2022 special national convention, state chairmen, state secretaries and state organising secretaries.\nMeanwhile, Tinubu Campaign Organisation (TCO) has said choice of Shettima was not to ignore religious concerns and ethnic sensitivities of Nigerians.\n“Religion or ethnicity was far from the calculations of the APC and its presidential candidate, Bola Tinubu, in picking his running mate.\nAccording to Onanuga, Nigerians have a lot to gain in having the two tested leaders at the helm of affairs."
  },
  {
    "headline": "Transfer: Bayern Sign De Ligt for £67.8m from Juventus – THISDAYLIVE",
    "summarized_story": "Bayern Munich have signed the Netherlands defender Matthijs de Ligt from Juventus on a five-year contract in a deal worth €80m (£67.8m)The fee equalled Bayern’s transfer record, paid for defender Lucas Hernández from Atlético Madrid in 2019.\nDe Ligt, 22, joined Juventus from Ajax on a five-year contract in July 2019 and spent three seasons with the Serie A champions.\n“I’m very glad that I’m now becoming part of the FC Bayern story.”De Ligt won one Serie A title and one Coppa Italia in 117 appearances for Juventus.\nWanted by Chelsea, he became the second Dutch international to join Bayern this summer after midfielder Ryan Gravenberch’s transfer to the club.\nBayern have also bought Sadio Mane from Liverpool and right-back Noussair Mazraoui from Ajax, while striker Robert Lewandowski is poised to join Barcelona."
  },
  {
    "headline": "Amstel Malta Ultra Predicts Good Outing for Falcons at the World Cup – THISDAYLIVE",
    "summarized_story": "Amstel Malta Ultra the official malt drink of the Super Falcons has hailed the brave display by the Nigeria women’s team in their semi-final clash against the Atlas Lionesses of Morocco at the ongoing Women’s Africa Cup of Nations.\nMorocco who are the host of the biennial continental tournament needed the lottery of penalty kicks to deny the Super Falcons a 10th WAFCON final appearance and by extension a chance for a record-extending 10th African crown.\nAmstel Malta Brand Manager, Maire Abia-Bassey, while saluting the spirited display by the Super Falcons said the Nigerian Ladies have shown great promise, they would be more than ready for next year’s World Cup in Australia and New Zealand.\nShe said: “The Super Falcons have shown that they are worthy ambassadors and they deserve to be celebrated even though they did not make it to the final like we all wished and prayed for.\n“However, beyond that, the team has shown they have great potentials that they can unlock at the World Cup if the momentum is properly built upon.”Having missed out on the title, the Super Falcons will try to ensure they get the bronze medals when they take on the Copper Queens of Zambia in Casablanca on Friday."
  },
  {
    "headline": "Goalkeeper Nnadozie Critical of Officiating, Laser Attacks – THISDAYLIVE",
    "summarized_story": "Super Falcons first choice goalkeeper, Chiamaka Nnadozie, was very critical of the officiating in the Nigeria versus Morocco semifinal clash in the ongoing WAFCON 2022 on Monday night.\nAccording to Nnadozie who plys her trade with Paris FC in the French Division 1 Féminine, the officiating of the semi final was horrible.\nNnadozie also claimed Moroccan fans “did everything to distract” her side, with Nigerian players targeted by laser pens during the penalty shootouts.\nHowever, despite the defeat, Former Nigerian striker, Mercy Akide praised the Super Falcons’ performance against Morocco in a social media post yesterday.\nAkide represented Nigeria at three FIFA Women’s World Cup in 1998, 2000 and 2002 before hanging her boots."
  },
  {
    "headline": "Zambia Petition CAF, Call for Replay with South Africa – THISDAYLIVE",
    "summarized_story": "Zambia’s Football Association (FAZ) has requested a replay of its Women’s Africa Cup of Nations semi-final against South Africa, citing complaints about refereeing decisions.\nThe Copper Queens were beaten 1-0 on Mondayafter Linda Motlhalo converted a contentious 94th-minute penalty, which was awarded following a Video Assistant Referee (VAR) check.\nZambia coach Bruce Mwape queried the purpose of VAR after the match, while the country’s President Hakainde Hichilema said it was a “questionable penalty”.\nFAZ has lodged an official complaint with WAFCON organisers the Confederation of African Football, highlighting “six key incidences” as grounds for a replay.\nMwape was “very disappointed with the way the penalty was given” and that the VAR decision was harsh on his frustrated players."
  },
  {
    "headline": "Heritage Bank Feeds 500 Underprivileged Children – THISDAYLIVE",
    "summarized_story": "Nume EkegheAs part of its sustainability drive in the corporate social responsibility space, Heritage Bank Plc has reiterated its commitment to improving the welfare and economic development of communities by feeding over 500 underprivileged children.\nThe support is in collaboration with Adyva Foods’ project tagged, “Feed a Kid,” which was in commemoration of Children’s Day celebration.\nIn a statement made available to THISDAY, the Ag.\n“Heritage Bank’s partnership in this event offers us an opportunity to fulfil our quota in adherence to the sustainable banking practices that ensures that banks and related institutions have the interest of their stakeholders at the core of their strategies,” Utulu stated.\nShe added, “I will advise parents to ensure they educate their children and teach them the savings culture and financial literacy for future benefits.”"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Army Dismisses 80 Soldiers For Fleeing From Boko Haram Terrorists After Running Out Of Ammunition",
    "summarized_story": "The Nigerian Army has allegedly dismissed no fewer than 80 soldiers from service over 'disobedience to a standing order.'\nThe soldier denied the claim by the army authorities that the soldiers abandoned their duties and ran away.\nAccording to him, sufficient arms and ammunition were not provided for them to fight terrorists; therefore, they soon ran out of ammunition.\n“At around 10 am, we started experiencing a shortage of ammunition, and we immediately started communicating our challenges.\nBut in a situation where we didn't have ammunition again and our commander had taken off already, what should we do?"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Army Dismisses 80 Soldiers For Fleeing From Boko Haram Terrorists After Running Out Of Ammunition",
    "summarized_story": "The Nigerian Army has allegedly dismissed no fewer than 80 soldiers from service over 'disobedience to a standing order.'\nThe soldier denied the claim by the army authorities that the soldiers abandoned their duties and ran away.\nAccording to him, sufficient arms and ammunition were not provided for them to fight terrorists; therefore, they soon ran out of ammunition.\n“At around 10 am, we started experiencing a shortage of ammunition, and we immediately started communicating our challenges.\nBut in a situation where we didn't have ammunition again and our commander had taken off already, what should we do?"
  },
  {
    "headline": "EXCLUSIVE: Forgery Case: Akwa Ibom Governor’s Stooge, Eno, Withdraws ‘Confirmation of Result’ From Court After WAEC’s Denial, Tenders Testimonial With More Discrepancies",
    "summarized_story": "In a joint statement of defence, Eno and PDP, who are the defendants, have withdrawn the ‘Confirmation of Result’ earlier tendered to the court in defence of the certificate forgery allegation.\nIt could be recalled that while responding to Mr Okon’s earlier statement of claim to the Federal High Court, Eno had in his first statement of defence attached a copy of ‘Confirmation of Result’.\nHowever, in the joint statement of defence, Eno has withdrawn the said ‘Confirmation of Result’ and replaced it with a ‘Leaving Certificate and Testimonial’.\nAs I speak, the two people who signed the forged confirmation of result have been arrested,” the source said.\nThe case, which was called for mention on Monday, July 18, 2022, before Justice Agatha A. Okeke of the Federal High Court, Uyo, was adjourned to Thursday."
  },
  {
    "headline": "EXCLUSIVE: Forgery Case: Akwa Ibom Governor’s Stooge, Eno, Withdraws ‘Confirmation of Result’ From Court After WAEC’s Denial, Tenders Testimonial With More Discrepancies",
    "summarized_story": "In a joint statement of defence, Eno and PDP, who are the defendants, have withdrawn the ‘Confirmation of Result’ earlier tendered to the court in defence of the certificate forgery allegation.\nIt could be recalled that while responding to Mr Okon’s earlier statement of claim to the Federal High Court, Eno had in his first statement of defence attached a copy of ‘Confirmation of Result’.\nHowever, in the joint statement of defence, Eno has withdrawn the said ‘Confirmation of Result’ and replaced it with a ‘Leaving Certificate and Testimonial’.\nAs I speak, the two people who signed the forged confirmation of result have been arrested,” the source said.\nThe case, which was called for mention on Monday, July 18, 2022, before Justice Agatha A. Okeke of the Federal High Court, Uyo, was adjourned to Thursday."
  },
  {
    "headline": "EXCLUSIVE: Forgery Case: Akwa Ibom Governor’s Stooge, Eno, Withdraws ‘Confirmation of Result’ From Court After WAEC’s Denial, Tenders Testimonial With More Discrepancies",
    "summarized_story": "In a joint statement of defence, Eno and PDP, who are the defendants, have withdrawn the ‘Confirmation of Result’ earlier tendered to the court in defence of the certificate forgery allegation.\nIt could be recalled that while responding to Mr Okon’s earlier statement of claim to the Federal High Court, Eno had in his first statement of defence attached a copy of ‘Confirmation of Result’.\nHowever, in the joint statement of defence, Eno has withdrawn the said ‘Confirmation of Result’ and replaced it with a ‘Leaving Certificate and Testimonial’.\nAs I speak, the two people who signed the forged confirmation of result have been arrested,” the source said.\nThe case, which was called for mention on Monday, July 18, 2022, before Justice Agatha A. Okeke of the Federal High Court, Uyo, was adjourned to Thursday."
  },
  {
    "headline": "'Eligibility, polling unit locations' -- INEC in talks with NCoS on allowing inmates to vote",
    "summarized_story": "The Independent National Electoral Commission (INEC), on Tuesday, met with officials of the Nigerian Correctional Service (NCoS) for discussions on the modalities for allowing inmates to vote.\nAdvertisement“So, will inmates vote outside or inside the prison?\n“Will political parties be allowed to campaign inside the correctional centres?\nWill observers and the media be allowed access to the correctional centres on election day, so that the process is really transparent?\n“Will elections hold in all 218 federal correctional centres currently holding inmates nationwide or there are some correctional centres where this process can start instead of all the 218?"
  },
  {
    "headline": "'Eligibility, polling unit locations' -- INEC in talks with NCoS on allowing inmates to vote",
    "summarized_story": "The Independent National Electoral Commission (INEC), on Tuesday, met with officials of the Nigerian Correctional Service (NCoS) for discussions on the modalities for allowing inmates to vote.\nAdvertisement“So, will inmates vote outside or inside the prison?\n“Will political parties be allowed to campaign inside the correctional centres?\nWill observers and the media be allowed access to the correctional centres on election day, so that the process is really transparent?\n“Will elections hold in all 218 federal correctional centres currently holding inmates nationwide or there are some correctional centres where this process can start instead of all the 218?"
  },
  {
    "headline": "ASUU: Our strike won't last 2 days if politicians' children attend Nigerian public varsities",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), says the union’s strike would have been addressed earlier if politicians’ children attend public universities in the country.\nEarlier, TheCable reported that President Muhammadu Buhari has given Adamu Adamu, minister of education, two weeks to resolve issues of contention regarding the ASUU strike.\nAdvertisementReacting to Buhari’s directive, the ASUU president said the two-week ultimatum is “too long”, and that the union can suspend its strike in less than two days if the federal government honours its agreement with the union.\nAdvertisement“For this strike, universities are shut down.\nIf the children of all the ministers and senators are all in our public universities, this will not last two days."
  },
  {
    "headline": "ASUU: Our strike won't last 2 days if politicians' children attend Nigerian public varsities",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), says the union’s strike would have been addressed earlier if politicians’ children attend public universities in the country.\nEarlier, TheCable reported that President Muhammadu Buhari has given Adamu Adamu, minister of education, two weeks to resolve issues of contention regarding the ASUU strike.\nAdvertisementReacting to Buhari’s directive, the ASUU president said the two-week ultimatum is “too long”, and that the union can suspend its strike in less than two days if the federal government honours its agreement with the union.\nAdvertisement“For this strike, universities are shut down.\nIf the children of all the ministers and senators are all in our public universities, this will not last two days."
  },
  {
    "headline": "NNPC: We did not direct oil marketers to hike petrol price",
    "summarized_story": "Nigerian National Petroleum Company (NNPC) Limited says it did not direct marketers or review the ex-depot price and pump price of premium motor spirit (PMS), also known as petrol.\nFollowing the hike in diesel price, oil marketers made a case for the increment of petrol price, citing soaring transport costs.\nAlthough the federal government had insisted that the pump price of petrol remain N165 a litre, oil marketers said it is “not sustainable”.\nOn Tuesday, reports claimed that NNPC, in a notice to oil marketers, approved an upward review in the pump price from N165 per litre to N179 per litre as well as the ex-depot price from N148.17 to N167 per litre.\nAdvertisement“The NNPC no longer approves pump price review."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Ping Express founders admit to breaking US AML rules.",
    "summarized_story": "The firm, Ping Express, admitted in US district court filings that it broke money laundering rules after it transferred $167 million out of the US.\nPing Express CEO Anslem Oshionebo, 45, and COO Opeyemi Ode, 43, both recently received 27-month prison sentences, and the company’s business manager, Aleoghena Okhumale, received a 42-month prison sentence for intentionally transferring criminal proceeds.\nPing Express also admitted it failed to seek sufficient details about the sources or purposes of the funds it helped to transmit, or the customers initiating the transmissions.\nPing Express itself faces up to 5 years of probation and a $500,000 fine.\nPer Bloomberg, the current controlling shareholder of Payzen, Adekanmi Adedire, said that his company is “unrelated” to Ping Express, which is a “totally different entity”."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Softcom’s Weyinmi Barber is making HR desirable one startup at a time",
    "summarized_story": "I was at the Softcom head office in Ikeja on a warm July afternoon to speak with Weyinmi Barber, the SVP, People and Culture, a.k.a, head of HR.\nWhat usually happens with startups is they get to a certain level and they start having HR crisis and at that point, they are running around looking for HR professionals.”In conversation with Weyinmi Barber.\nIt is safe to say that Weyinmi Barber is passionate about HR and is on a mission to make it desirable despite people’s misconceptions.\nMany of the things that are considered best practices in HR work in other industries, but they don’t work in the startup space.\nWeyinmi Barber."
  },
  {
    "headline": "AU wants domestication of Juncao Technology in Nigerian varsities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe African Union Development Agency (AUDA-NEPAD) has called on the government of China to partner with the Nigerian government to domesticate Juncao Technology in the country’s universities of agriculture.\nPrincess Gloria Akobundu, the Chief Executive Officer of AUDA-NEPAD, Nigeria, said this in Abuja on Tuesday at a three-day workshop on application of Juncao Technology and its contribution to the Sustainable Development Goals (SDGs).\nJuncao Technology is an environmental friendly system that capacitates smallholder farmers and entrepreneurs to grow mushrooms from dried, chopped grasses, without cutting down trees and damaging the environment.\nShe said the technology when domesticated would create direct and indirect jobs, promote agro business, ensure sustainability and enhance nutrition.\n”We can move closer to the goal of attaining Zero Hunger (Sustainable Development Goals 2) if we explore new options like the Juncao technology."
  },
  {
    "headline": "8.6m MWh electricity generated in Q3, 2021- NERC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Electricity Regulatory Commission (NERC) has said that a total of 8.693 million Megawatts-hour (MWh) of electricity was generated in the third quarter of 2021.\nNERC made this known in its Third Quarter Report 2021 obtained on Tuesday by the News Agency of Nigeria (NAN) in Lagos from its website.\nThe regulatory agency said, ”the total quarterly generation in 2021/Q3 was 8.6million MWh.\nNERC said maintenance and shortages of gas supply also contributed to the decline in performance.\n“To improve this performance, the commission continued consultations with relevant stakeholders to develop lasting solutions to gas supply and other challenges that continue to impede capacity utilisation and ultimately electricity generation in the Nigerian Electricity Supply Industry."
  },
  {
    "headline": "Water transport: Owners of overloaded boats risk 7 years imprisonment – Nigerian Observer",
    "summarized_story": "The communities visited are Sagbo Koji in Amuwo Odofin, Irede in Oriade and Ibeshe.\nShe listed some of the misnomers to include night sailing (beyond 7.00 p.m.), driving of unregistered boats, driving without paddles, driving without licence, and driving rickety and leaking boats.\nWhile donating authentic life jackets in the communities, the NIWA boss seized the opportunity to differentiate between fake or substandard life jackets and standard ones.\nA youth Leader at Sagbo Koji, Mr Bobby Sanni, advised the authority to include youths in their task force because.\n“Most of the life jackets given to passengers are very dirty and they cannot put them on,” he, however, said."
  },
  {
    "headline": "57% electricity consumers on estimated billing, says NERC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Electricity Regulatory Commission (NERC) says 57.07 per cent of electricity consumers in the country were still on estimated billing as at September 2021.\nThe huge metering gap for end-use customers, according to NERC, remains a key challenge in the Nigerian Electricity Supply Industry (NESI).\nIt added that a total of 288,431 meters were installed in 2021/Q3 as compared to the 315,717 meters installed in2021/Q2.\nOthers are: Port Harcourt, 54.81 per cent; Ibadan, 37.64 per cent; Jos, 29.12 per cent; Kaduna, 21.84 per cent; Kano, 27.64 per cent; and Yola, 17.19 per cent.\n“Customers are metered on DisCo’s own account without paying for the meters by customers except through end-user tariffs."
  },
  {
    "headline": "How EFCC official forced me to indict Jonathan, Adoke – Witness tells court",
    "summarized_story": "Mr Aliyu Abubakar, a defence witness in the trial-within-trial of Justice Mohammed Adoke, former Minister of Justice, has told a Federal High Court, Abuja that an EFCC officer forced him to indict Goodluck Jonathan, Nigeria’s former president, in alleged money laundering.\nAbubakar also told the court that Sanga informed him that there was another evidence which indicated that he (Abubakar) gave the sum of 50 million dollars to ex-President Jonathan.\n“He (Sanga) asked how close I am to Adoke.\nAdoke’s counsel, Kanu Agabi, SAN, while crossed-examining Abubakar, asked him to reconfirm his statement that Sanga told him to implicate Adoke and he answered in the affirmative.\n“Ibrahim said anything Sanga asked us to do we should do."
  },
  {
    "headline": "Killing of Imo youths: Southeast youth group gives Uzodinma 7 days to resign",
    "summarized_story": "Youths of Nigeria’s Southeast under the umbrella the Coalition of Southeast Youth Leaders (COSEYL), on Tuesday gave Hope Uzodinma, Imo state governor, seven days to resign as governor of the state or face impeachment by the state assembly.\nThis is in response to the alleged killing of about seven youths by suspected members of Ebube Agu security outfit on Sunday.\n“We will not accept the killing of 14 innocent youths laying low, Governor Hope Uzodinma must resign within 7 days resign from office as governor of Imo State or be Impeached by the Imo State House of Assembly else the youths will occupy the roads lawfully in protest to demand his resignation as Executive Governor of Imo State.\n“Democracy is about problem-solving, bringing democracy dividends to the people and making people happy but what we are seeing now in Imo State is the direct opposite of what democracy should be.\nWith the way and manner, in which Imo youths are being killed on daily basis, Imo youths face a threat of extinction before 2023."
  },
  {
    "headline": "Nigerian-born Kemi Badenoch loses bid to become UK Prime Minister",
    "summarized_story": "Kemi Badenoch Nigerian-born United Kingdom parliamentarian, has crashed out of the race for the country’s prime minister after MPs voted on the next Tory Leader.\nBadenoch was on Tuesday voted out of the race as other contestants; former Chancellor Rishi Sunak, Penny Mordaunt, and Foreign Secretary Liz Truss advanced to the final voting stage.\nThe results as of Tuesday are as follows; Rishi Sunak with 118 votes, Penny Mordaunt with 92 votes, Liz Truss with 86 votes and Ms Badenoch with 59 votes.\n“I’m grateful to my colleagues and the party members who have supported me,” Ms Badenoch said on Twitter after the results were announced.\nThank you.”Last week, Badenoch berated Nigerian politicians for being selfish and failing to serve the country."
  },
  {
    "headline": "JUST IN: Dana Air plane makes emergency landing in Abuja",
    "summarized_story": "A Dana Air Boeing 737 aircraft with registration number (5N DNA), on Tuesday, made an emergency landing on approach at the Nnamdi Azikiwe International Airport following an issue with one of its engines.\nThe airline confirmed the incident in a statement on Tuesday, saying it happened at about 2:52 pm and the passengers were unhurt.\n“Our Abuja-bound Boeing 737 aircraft with registration number (5N DNA) embarked on an emergency landing today, 19th July 2022, due to an indication on one of its engines,” the statement said.\n“The pilot in command briefed the passengers on the incident and landed the aircraft safely at the Abuja International Airport at about 2:52 pm.\n“All 100 passengers disembarked safely and the aircraft has been grounded for immediate attention by our team of engineers."
  },
  {
    "headline": "BREAKING: Buhari gives education minister 2 weeks to end ASUU strike",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari given Adamu Adamu, minister of education two weeks to resolve the prolonged industrial action embarked upon by the Academic Staff Union of Universities (ASUU) and other university-based unions.\nBuhari had summoned them to get more information on why the strike had persisted for too long.\nRecall that ASUU commenced one month warning strike on February 14, and other unions also joined them over the alleged inability of the federal government to meet up with their demands.\nAfter Tuesday’s briefing, the President ordered the education minister to ensure that the areas of disagreements were sorted out within two weeks and report back to him.\nSources at the meeting also said Buhari directed that the Minister of Labour and Employment, Senator Chris Ngige must be in any of the meetings to resolve the crisis."
  },
  {
    "headline": "Obaseki Praises Shaibu For Tackling Security, Flooding Challenges In His Absence",
    "summarized_story": "Edo State governor, Godwin Obaseki, has praised his deputy, Comrade Philip Shaibu, for tackling security, flooding and other challenges in the State in his absence.\nObaseki had proceeded on a three-week annual leave, and handed over power to the State’s deputy governor, Shaibu.\nDuring the three-week vacation, Obaseki took time to join the Peoples Democratic Party (PDP) governorship campaign in Osun State until the conduct of the election exercise and eventually victory of the party’s governorship candidate, Senator Ademola Adeleke.\nOn return to Benin City, the state capital on Tuesday, Obaseki, who took his verified Facebook page, said he returned to a rousing welcome by Edo people amid praises for Shaibu.\nComrade Philip Shaibu, who acted in my absence and addressed security and flooding challenges, among other issues that arose in my absence.”"
  },
  {
    "headline": "Obaseki Praises Shaibu For Tackling Security, Flooding Challenges In His Absence",
    "summarized_story": "Edo State governor, Godwin Obaseki, has praised his deputy, Comrade Philip Shaibu, for tackling security, flooding and other challenges in the State in his absence.\nObaseki had proceeded on a three-week annual leave, and handed over power to the State’s deputy governor, Shaibu.\nDuring the three-week vacation, Obaseki took time to join the Peoples Democratic Party (PDP) governorship campaign in Osun State until the conduct of the election exercise and eventually victory of the party’s governorship candidate, Senator Ademola Adeleke.\nOn return to Benin City, the state capital on Tuesday, Obaseki, who took his verified Facebook page, said he returned to a rousing welcome by Edo people amid praises for Shaibu.\nComrade Philip Shaibu, who acted in my absence and addressed security and flooding challenges, among other issues that arose in my absence.”"
  },
  {
    "headline": "PDP Kano, Katsina Guber Candidates, Ex-Gov Yari Meet Wike In Rivers",
    "summarized_story": "Governorship candidates of the Peoples Democratic Party (PDP) in Katsina and Kano States, Senator Yakubu Lado Danmarke and Alhaji Mohammed Abacha, respectively, on Tuesday, met with Rivers State governor, Nyesom Ezenwo Wike, at the latter’s private residence in Port Harcourt.\nThe visit of the duo to the Rumuepriokom residence of the governor, came barely two hours after a former Zamfara State governor, Abdullaziz Abubakar Yari, paid a private visit to Wike.\nLEADERSHIP gathered that immediately the two governorship candidates arrived at the governor’s residence, they went into a closed-door meeting with Wike.\nRecall that Yari, who is of the All Progressives Congress (APC), had earlier in the day visited Wike’s residence where he also met with the governor behind-closed doors."
  },
  {
    "headline": "PDP Kano, Katsina Guber Candidates, Ex-Gov Yari Meet Wike In Rivers",
    "summarized_story": "Governorship candidates of the Peoples Democratic Party (PDP) in Katsina and Kano States, Senator Yakubu Lado Danmarke and Alhaji Mohammed Abacha, respectively, on Tuesday, met with Rivers State governor, Nyesom Ezenwo Wike, at the latter’s private residence in Port Harcourt.\nThe visit of the duo to the Rumuepriokom residence of the governor, came barely two hours after a former Zamfara State governor, Abdullaziz Abubakar Yari, paid a private visit to Wike.\nLEADERSHIP gathered that immediately the two governorship candidates arrived at the governor’s residence, they went into a closed-door meeting with Wike.\nRecall that Yari, who is of the All Progressives Congress (APC), had earlier in the day visited Wike’s residence where he also met with the governor behind-closed doors."
  },
  {
    "headline": "Nigeria, Equatorial Guinea In Partnership Talks To Boost Gas Production",
    "summarized_story": "Nigeria and Equatorial Guinea have started talks on commercial partnership to boost gas production for the benefit of both countries.\n“Equatorial Guinea is working close with Nigeria regarding the possibility of utilizing the gas for the benefit of our both people, especially for the purpose eradicating the energy poverty.\n“And we are working on the possibility to sign a bilateral agreement that will allow more commercial activities to happen between Nigeria and Equatorial Guinea.\n“If you put together Equatorial Guinea, Cameroon, Congo, Gabon, it is not enough market.\n“But if you put together Nigeria, Ghana, the Equatorial Guinea, DRC, that is when we are talking about serious business,” Lima added."
  },
  {
    "headline": "EFCC extradites FBI-wanted Olamilekan Fatade to US: Case against him",
    "summarized_story": "U.S. Attorney Damian Williams said: “Fatade Idowu Olamilekan is alleged to have carried out a sprawling criminal scheme to fraudulently obtain medical equipment and other merchandise.\nIn particular, during the coronavirus/COVID-19 pandemic, OLAMILEKAN impersonated the Chief Procurement Officer of New York State in an effort to fraudulently obtain medical equipment, including defibrillators.\nFor example, OLAMILEKAN appears to have specifically targeted a medical supplier that was already providing medical equipment to New York State in or to avoid suspicion when OLAMILEKAN, who was impersonating the Chief Procurement Officer of New York State, contacted the supplier to obtain medical equipment.\nThe spoofed email accounts used by OLAMILEKAN usually had the same username as the procurement official’s email account but added an extra letter or common domain name to the domain of the email account.\nThese spoofed email accounts were therefore specifically designed to trick suppliers to impersonated procurement officials into thinking the spoofed email accounts were authentic."
  },
  {
    "headline": "Kemi Badenoch knocked out of UK Prime Minister race",
    "summarized_story": "Kemi Badenoch has been knocked out from the UK Conservative Party leadership race, leaving three contenders battling to replace Boris Johnson as prime minister.\nMs Truss appears to have the most momentum, picking up 15 votes on yesterday’s result, while Ms Mordaunt gained 10 and Mr Sunak increased his tally by just three.\nThe departure of former equalities minister Ms Badenoch was expected, given she was competing against three MPs with extensive Cabinet experience, and she was always considered one of the race’s underdogs.\nMr Sunak appears guaranteed to reach the final two, as things stand, with Ms Truss and Ms Mordaunt hoping to gain the votes made available by Ms Badenoch leaving the race.\nLawmakers will eliminate one more before the governing party’s 200,000 members choose their new leader, who will automatically become prime minister."
  },
  {
    "headline": "17 U.S. lawmakers arrested for protesting abortion rights",
    "summarized_story": "Agency ReportAt least 17 Democratic lawmakers, including prominent progressives Alexandria Ocasio-Cortez and Ilhan Omar, were arrested at an abortion rights protest outside the Supreme Court in Washington on Tuesday, police said.\n“We made a total of 35 arrests for Crowding, Obstructing or Incommoding,” the police said.\n“That arrest number includes 17 Members of Congress.”The small demonstration came three weeks after a controversial ruling by the Supreme Court that overturned the 1973 landmark decision of Roe v. Wade, which had guaranteed women’s access to abortion.\n“Today I was arrested while participating in a civil disobedience action with my fellow Members of Congress outside the Supreme Court,” Omar, a representative from Minnesota, said on Twitter.\n“I will continue to do everything in my power to raise the alarm about the assault on our reproductive rights!” she tweeted."
  },
  {
    "headline": "BREAKING: Abducted Priest Found Dead In Kaduna, CAN Reacts",
    "summarized_story": "John Mark Cheitnum by terrorists has been referred to as a dangerous environment for Christian leaders by the Kaduna State chapter of the Christian Association of Nigeria (CAN).\nJohn Joseph Hayab, CAN state chairman in Kaduna expressed sadness while reacting to the killing of one of the priests, Very Rev.\nJohn Mark Cheitnum, who until his death, was the CAN Chairman of Jema’a Local Government Area of the state, as well as coordinator of CAN in Southern Kaduna.\nJohn Mark Cheitnum.\nJohn Mark Cheitnum was the Dean of Kwoi Deanery, Director of Communications in the Diocese of Kafanchan and the Pastor of St. James Parish Fori, Jama’a local government area of Kaduna State."
  },
  {
    "headline": "JUST IN: Fuel Tanker Explodes In Lagos",
    "summarized_story": "JUST IN: Fuel Tanker Explodes In LagosOn Tuesday evening, a petroleum tanker caught fire at mile 2 of Otto Wharf in Lagos State.\nThe Lagos State Emergency Management Agency claims that the organization responded to distress calls at the mentioned location by activating its response plan.\nOfficials and locals were seen attempting to contain the fire, which had spread rapidly and caused panic in the neighborhood.\n“Upon arrival at the scene by the agency response team, a fire outbreak from a fuel tanker and drums was encountered.\nIt added that emergency responders “are currently battling the inferno to contain it.”“Operation is still ongoing."
  },
  {
    "headline": "BREAKING: Buhari Gives Education Minister 2 Weeks To End ASUU Strike",
    "summarized_story": "Malam Adamu Adamu, the minister of education, has been given a directive by President Muhammadu Buhari to end the protracted industrial action that the Academic Staff Union of Universities (ASUU) and other university-based unions have started.\nIn order to learn more about why the strike had continued for so long, Buhari had summoned them.\nOn February 14, ASUU began a one-month warning strike, and other unions soon followed suit in protest of what they claimed was the federal government’s failure to satisfy their demands.\nAfter Tuesday’s briefing, the President ordered the education minister to ensure that the areas of disagreements were sorted out within two weeks and report back to him.\nSources at the meeting also said Buhari directed that the Minister of Labour and Employment, Senator Chris Ngige must be in any of the meetings to resolve the crisis."
  },
  {
    "headline": "BREAKING: CBN Raises Interest Rate To 14% To Tame Rising Inflation",
    "summarized_story": "The monetary policy rate (MPR), which measures interest rates, was hiked from 13% to 14% by the Central Bank of Nigeria’s (CBN) policy-setting committee.\nEvery other interest rate employed in an economy is based on the monetary policy rate (MPR), which serves as its foundation.\nGodwin Emefiele, governor of the top bank, said the increase in interest rates will aid in containing growing inflation in a statement to journalists on Tuesday following the committee meeting at the CBN headquarters in Abuja.\nMore to come…"
  },
  {
    "headline": "Breaking: Fatal crash averted as Dana air makes emergency landing",
    "summarized_story": "What would have resulted to an air crash was averted after Dana Air passenger plane, a Boeing 737 aircraft, made an emergency landing safely at Nnamdi Azikiwe international airport.\nAccording to a statement by the Nigerian Civil Aviation Authority (NCAA), the airline operator has briefed it on the incident, and the aircraft has been grounded.\n“Our Abuja-bound Boeing 737 aircraft with registration number (5N DNA) embarked on an emergency landing today 19th July, 2022, due to an indication on one of it’s engines.\n“The Pilot in command briefed the passengers on the cident and landed the aircraft safely at the Abuja International airport at about 2.52pm.\nAll 100 passengers disembarked safely and the aircraft has been grounded for immediate attention by our team of engineers."
  },
  {
    "headline": "FirstBank Personal Loan Against Salary: Unlocking wealth through salary account",
    "summarized_story": "FirstBank of Nigeria Limited introduced Personal Loan Against Salary (PLAS) to support customers and assist them in meeting their daily obligations.\nWith support from the bank, salary account holders can gain more than just receiving their monthly pay.\nThe First Bank Personal Loan Against Salary (PLAS) account was specifically structure to enable the bank customers tackle their pressing financial needs before the pay day.\nAnd this can be achieved through the FirstBank’s Personal Loan Against Salary (PLAS).\nSo borrowing as a salary account holder enables you to manage your challenges when you do not have cash at hand and when you are in a fix."
  },
  {
    "headline": "Breaking: Crisis rocks ASUU as faction pulls out of strike",
    "summarized_story": "Crisis has hit Academic staff Union of Universities (ASUU) as a breakaway faction of the union has dissociated itself from the ongoing strike in Nigerian universities.\nThe factional group reiterated that it was not a part of the decision to embark on the ongoing strike by ASUU.\nThe faction also announced its independence as a union of academics in Nigerian universities.\n“The Congress of University Academics would like to seize this opportunity to announce its independence as a union of academic staff in Nigeria’s public universities.\nCONUA said it believed that strikes had a crippling effect on the Nigerian university system."
  },
  {
    "headline": "Strike Can Be Resolved In Two Days, Not Weeks – ASUU President Tells Buhari",
    "summarized_story": "﻿The Academic Staff Union of Universities (ASUU) says the two-week ultimatum issued by the President to resolve the concerns raised by the union is too much.\nAt the meeting, he directed the education minister to proffer a solution to the continued industrial action by the lecturers and report back to him in two weeks.\nWhile the ASUU president sees the President’s action as a welcome development, he is of the opinion that giving such a directive is not new.\n“That committee didn’t invite us for a meeting until we rolled over the strike in May and we all went.\nDoes it take you two weeks to look at what you have negotiated?” the ASUU president queried."
  },
  {
    "headline": "Buhari Directs Education Minister To Proffer Solution To ASUU Strike In Two Weeks",
    "summarized_story": "Following the prolonged industrial action by the Academic Staff Union of Universities (ASUU), President Muhammadu Buhari has directed the Minister of Education, Adamu Adamu, to proffer a solution to the challenge and report back to him in two weeks.\nAlthough it is not unusual for the President to hold briefings with the ministers, it was gathered that President Buhari placed a high premium on the issue of resolving the lingering ASUU strike.\nBesides the directive to the education minister, the President instructed that the Minister of Labour and Employment, Chris Ngige, as well as the Secretary to the Government of the Federation, Boss Mustapha, must be in attendance in all the meetings to speedily resolve the crisis.\nASUU commenced a nationwide strike on February 14 over the adoption of the Integrated Personnel Payroll Information System (IPPIS) of the government as the payment system in the university sector.\nSince the industrial action began, several negotiations between the union and the government have ended in deadlock."
  },
  {
    "headline": "NNPC Limited Will Guarantee National Energy Security, Says Buhari At Unveiling",
    "summarized_story": "President Muhammadu Buhari on Tuesday unveiled the Nigerian National Petroleum Company Limited, assuring that the new company will guarantee energy security in the country.\nREAD ALSO: Buhari, Lawan Attend Unveiling Of NNPC Limited In AbujaHe said the new enterprise would also support sustainable growth across other sectors of the economy as it delivers energy to the world.\nHe added that the company would focus on becoming a dynamic global energy company of choice to deliver energy for today, for tomorrow, and for the day days after tomorrow.\n“By chance of history, I was privileged to lead the creation of the Nigerian National Petroleum Corporation on the 1st July 1977.\n“Coincidentally, I, on the 1st of July 2022 authorized the transfer of assets from the Nigerian National Petroleum Corporation to its successor company, the Nigerian National Petroleum Company Limited, and steered the implementation leading to the unveiling of Africa’s largest National Oil Company today,” he stated."
  },
  {
    "headline": "CBN Raises Interest Rate To 14% To Check Inflation",
    "summarized_story": "The Central Bank of Nigeria (CBN) has raised the Monetary Policy Rate (MPR) from 13 percent to 14 percent.\nCBN Governor Godwin Emefiele announced this on Tuesday during the 286th meeting of the Monetary Policy Committee held in Lagos.\nREAD ALSO: UPDATED: CBN Raises Interest Rate For First Time In Over Two Years To 13%According to him, it was the right option considering economic realities.\nHe added, “Committee thus vote unanimously to raise the Monetary Policy Rate (MPR).\nOne member voted to increase the MPR by 150 basis points, six members by 100 basis points, one member by 75 basis points and three members by 50 basis points."
  },
  {
    "headline": "EFCC Extradites FBI Wanted Suspect To US Over Alleged $3.5m Fraud",
    "summarized_story": "A wire fraud suspect, Fatade Olamilekan, has been extradited to the United States for allegedly stealing over $3.5 million worth of equipment in various cities across the country.\nThe Economic and Financial Crimes Commission (EFCC) disclosed this in a statement on Tuesday, five days after the suspect was extradited to answer for the alleged crime.\nOn May 1, the judge granted the request to extradite the suspect to the United States to answer the criminal charges against him.\nUpon his arrival in the United States, the suspect is billed to appear before a United States District Court.\nThe suspects, the EFCC said, were arrested based on credible intelligence on their alleged illegal oil bunkering operations."
  },
  {
    "headline": "Police arrest 15 suspected armed robbers, drugs dealers, others in Ekiti -",
    "summarized_story": "The Ekiti State Police Command has clamped down on a group of hoodlums in their criminal hideout at Atikankan, Ado-Ekiti.\nAccording to a statement by the command spokesperson, DSP Abutu Sunday, fifteen suspected drug dealers, armed robbers and cultists were arrested during the operation.\nAdvertisementThose arrested include Musa Madaki ’35yrs’, Abdullahi Umar ’25yrs’, Shola Adeyemi ’43yrs’, Hawalu Ali ’45yrs’, Usman Amisu ’30yrs’, Haruna Usman ’20yrs’, Yanusa Abubakar ’25yrs’, Usman Lawali ’20yrs’, Ajayi Opeyemi ’20yrs’, Toheeb Isa ’21yrs’, Ajiboye Michael ’19yrs’, Kayode Yinka ’20yrs’, Taiwo Michael ’20yrs’, Jimoh Zarheal ’19yrs’ and David Henry ’36yrs’.\nThe team also recovered some items which include:AdvertisementAdvertisement√ Two(2) locally made single barrel guns√ Two(2) battle axes√ Two (2) locally made pistols√ Some wraps of weeds suspected to be Indian hempThe statement added that the suspects confessed to be members of armed robbery gang, illicit drug dealers and cultists.\nAdvertisementThe Command’s PPRO, DSP Abutu Sunday said the suspects shall be arraigned accordingly as soon as investigation is concluded."
  },
  {
    "headline": "NPF releases list of successful candidates for 2021 recruitment",
    "summarized_story": "The Nigerian Police Force, NPF has released the list of successful candidates who participated in the medical screening of the 2021 recruitment exercise.\nAdvertisementThe list which was released on Sunday, July 17 is for the recruitment of Ten Thousand (10,000) Police Constables into the service of the Nigeria Police Force.\nCandidates who took part in the medical screening process for the 2021 recruitment exercise are expected to check their names on the list, according to a statement issued by the Force Public Relations Officer, CSP Olumuyiwa Adejobi.\nAdvertisementAdvertisementHe added that successful candidates are expected to print out their invitation slip and proceed to the Police Training College/School indicated against their names for the training exercise which commences on Monday, 25th July, 2022.\nThe statement reads in part ‘2021 RECRUITMENT EXERCISE: SUCCESSFUL CANDIDATES TO CHECK APPLICATION STATUS ON RECRUITMENT PORTAL, PRINT INVITATION SLIP’ reads: “The Nigeria Police Force invites candidates who participated in the medical screening exercise of the 2021 recruitment exercise of Ten Thousand (10,000) Police Constables into the service of the Nigeria Police Force to check their recruitment status on the recruitment portal, www.policerecruitment.gov.ng."
  },
  {
    "headline": "Kano bans tricycles operations after 10pm",
    "summarized_story": "Kano state government has announced a ban on the operations of tricycles popularly known as A Daidata Sahu after 10:00pm with effect from Thursday, July 20, 2022.\nA statement issued by the commissioner for Information, Malam Muhammad Garba indicated that decision to that effect was reached at the end of the state security meeting.\nAdvertisementHe said the measure was part of effort to ensure security of lives and property in the state.\nThe commissioner, in the statement, urged tricycle riders to comply and stop operating at the stipulated time as security agents would enforce the ban without compromise.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Troops repell attack on Military Base in Niger State -",
    "summarized_story": "Terrorists have in the early hours of Monday July 18th attacked a Military camp in Sarkin Pawa In the Munya Local Government area of Niger State.\nThe terrorists according to him came in hundreds trying to dislodge the military base.\nAdvertisementAdvertisementThe military engaged them in a gun duel which lasted for about 2 hours until the military called for reinforcement and successfully neutralized them.\nHe added that It took the military less than 30 minutes to arrive Sarkin Pawa from Minna in response to the distress call for reinforcement.\nThe activities of Terrorists, Bandits and Other Criminla elements within Niger State has recently increased with some communities within the State reportedly currently under occupation by Terror Group Ansaru an offshoot of Boko Haram."
  },
  {
    "headline": "To Tackle Rising Inflation, Nigeria Raises Interest Rates to 14%",
    "summarized_story": "The policy-setting committee of the Central Bank of Nigeria (CBN) has raised the monetary policy rate (MPR), from 13% to 14% to tackle rising inflation.\nIn June, Nigeria’s inflation rate reached a five-year high of 18.60%.\nThe monetary policy rate (MPR) is the baseline interest rate in an economy, every other interest rate used within an economy is built on it.\nAddressing journalists on Tuesday after the committee’s meeting, Godwin Emefiele, governor of the apex bank, said the hike in interest rate will help address rising inflation."
  },
  {
    "headline": "New Dawn for Nigeria as Buhari Unveils Profit-Driven NNPC Limited",
    "summarized_story": "Nigeria President Muhammadu Buhari on Tuesday in Abuja unveiled the new Nigerian National Petroleum Company Limited, affirming that the company is mandated by law to ensure that Nigeria’s national energy security is guaranteed.\n‘‘This is a landmark event for the Nigerian oil industry.\n‘‘By chance of history, I was privileged to lead the creation of the Nigerian National Petroleum Corporation on the 1st July 1977.\n‘‘Coincidentally, I, on the 1st of July 2022 authorized transfer of assets from the Nigerian National Petroleum Corporation to its successor company, the Nigerian National Petroleum Company Limited, and steered the implementation leading to the unveiling of Africa’s largest National Oil Company today.\nSylva described the unveiling of NNPC Limited as a new dawn in the quest for the growth and development of the Nigerian Oil and Gas Industry, opening new vintages for partnerships."
  },
  {
    "headline": "Nigeria FA to Investigate Penalty Shootout for Match Fixing",
    "summarized_story": "Nigeria’s football federation will launch an investigation into a case of suspected match fixing in a regional FA Cup final match.\nRelatedStories No Content AvailableRemo Stars lost 3-0 on penalties to Ijebu United in the final of the Ogun State FA Cup, the regional qualifying tournament where both finalists qualify for the National FA Cup competition.\nMohammed Sanusi, general secretary of the Nigeria Football Federation, described the incident as “embarrassing” and told ESPN that an investigation will be launched.\nAt the final, the referee made some dodgy calls, even denying us what was a clear penalty kick,” the source said.\nBarring disqualification, Remo Stars will join Ijebu United as the Ogun State representatives to the National FA Cup competition."
  },
  {
    "headline": "Increasingly Bitter Race to Replace UK PM Johnson Narrows to Four",
    "summarized_story": "Britain’s former finance minister Rishi Sunak held onto his lead in the race to become Britain’s next prime minister on Monday as another hopeful was knocked out, leaving four candidates in an increasingly bitter contest to replace Boris Johnson.\nSunak got 115 votes in the third ballot of Conservative lawmakers on Monday, ahead of former defence minister Penny Mordaunt on 82 and Foreign Secretary Liz Truss on 71.\nread more“The nature of the Conservative Party is to have vigorous debate and then coalesce once a new leader is selected.\nI have no doubt that the same will happen on this occasion,” Conservative former minister David Jones told Reuters.\nSunak extended his lead over Mordaunt, who lost support and registered one fewer vote than she had in round two."
  },
  {
    "headline": "Putin Heads to Tehran for Talks with Leaders of Iran, Turkey",
    "summarized_story": "Russian President Vladimir Putin will visit Iran on Tuesday in just his second foreign trip since he launched the invasion of Ukraine in February.\nMr Putin will meet Iranian Supreme Leader Ayatollah Ali Khamenei and Turkish President Recep Tayyip Erdogan.\nTuesday’s visit will offer Mr Putin the opportunity to deepen ties with Iran, one of Moscow’s few remaining international allies and a fellow target of Western economic sanctions.\nIt follows allegations by US officials last week that Tehran was planning to supply Russia with hundreds of drones for its war in Ukraine.\nAnkara has refused to impose sanctions on Moscow since Mr Putin launched his invasion of Ukraine on 24 February, with Mr Erdogan’s government seeking to play the role of mediator."
  }
]