[
  {
    "headline": "Mentally-ill woman wrongfully accused of baby theft, gun possession lynched in Lagos",
    "summarized_story": "A yet-to-be-identified mentally-ill woman has been killed by hoodlums, who accused her of stealing a baby and being in possession of three AK-47 rifles in the Abule Ado area of Lagos State.\nPUNCH Metro gathered that the hoodlums lynched the woman and set her body ablaze before fleeing the scene on Monday.\nThe incident, which attracted public attention, was investigated by the state police command, which confirmed that the woman was killed unjustly as no baby or AK-47 rifles were found in her possession.\nAs of the time of filing this report, an order had been given for the arrest of those responsible for her death.\n“Based on preliminary investigation, it was discovered that the woman had been living in the area for several years before she was lynched by some hoodlums in the area on the suspicion of being in possession of a baby and three AK-47 rifles."
  },
  {
    "headline": "Suspected soldier nabbed over AÍbom businessman’s killing",
    "summarized_story": "A man suspected to be a soldier of the Nigeria Army has been arrested by the police in connection with the alleged murder of a businessman in the Ikot Abasi Local government Area of Akwa Ibom State.\n“The incident happened on Sunday; a motorist offered a serving army officer a ride in his vehicle, not knowing that he was going to kill him.\nThey got to a place and the soldier attacked and killed him and dumped his corpse by the roadside.\n“On Monday, the deceased relatives came to the police in Ikot Abasi for assistance.\n“The matter is still under investigation, we are trying to get report and also trying to determine the identity of the person involved,” he said."
  },
  {
    "headline": "Toye Sobande: Building a New Generation of African Leaders",
    "summarized_story": "Kindly Share This Story:When you count the legal luminaries transforming Nigeria’s socio-political landscape, Toye Sobande would likely be among your top three.\nSobande’s training in the Nigerian Law School, the University of Buckingham, United Kingdom, propelled him for the zeniths he soars today.\nSobande has always been a student of life and a staunch promoter of Leadership, Politics, and Governance.\nHe is a weekly columnist with BusinessDay Newspapers and his column is Dubbed, “The Leadership Factory with Toye Sobande”.\nFrom a child of astounding ambitions to a man of purpose, grit and vision, Sobande is one Nigerian championing leadership development and worth celebrating."
  },
  {
    "headline": "Lagos LG poll: Surulere chairman aspirants, stakeholders back Suleiman Yusuf",
    "summarized_story": "Aspirants such as Mrs Bamidele Hussein, Prince Adewale Dosumu, Mr Alim Alaka, took turns to support Mr Yusuf.\nSpeaking at the stakeholders’ meeting, a chairmanship aspirant for Surulere Local government Area, Mrs Bamidele Hussein urged all warring factions to sheathe their swords and work for the party’s victory at the polls.\nAlso read:Hussein said: “I will not want us to get to our wards and start fighting over petty issues.\nEven if we are one million contestants, just one person will be elected; we have to disagree to agree in the APC.\nDespite our agreement on the chairmanship position, I know from experience that some members are still angry.”Vanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Oyo to pass whistleblower protection law",
    "summarized_story": "Kindly Share This Story:Governor Seyi Makinde of Oyo State says the state will soon pass the whistleblower protection law to make the job of its anti-corruption agency easier.\nMakinde disclosed this on Tuesday during a training workshop organised for board members, management and members of staff of Oyo State Anti-Corruption Agency (OYACA) in Ibadan.\nHe said “There is regime of law that you pass to complement each other in securing financial management and control of the state.\n“We will be passing the whistleblower law with the reversed audit law.\n“The law will protect and intensify the whistleblower to come out to give information."
  },
  {
    "headline": "COVID-19: International Hearing Centre offers free screening",
    "summarized_story": "Kindly Share This Story:Says Covid-19 pandemic has further isolated many with hearing lossBy Chioma ObinnaTo mark this year’s World Hearing Health Month, International Hearing Centre, IHC, Nigeria has begun free hearing health checks across its five centres in the country even as it stated that COVID-19 has isolated many with hearing loss.\nBriefing journalists in Lagos, the Chief Executive Officer of the International Hearing Centre, IHC, Nigeria, Dr. Irene Okeke-Igbokwe, who is also a fellow of the American Academy of Audiology, AAA, said the organization was offering free hearing screening, free counselling on prevention of hearing loss and free hearing aid check as part of activities to mark the month in Nigeria.\n“The COVID-19 pandemic and the necessity of wearing masks have made life doubly difficult for people with hearing loss.\nShe also enumerated some of the strategies for reducing hearing loss include annual hearing screening, newborn hearing screening, good maternal and childcare practices, genetic counselling, identification and management of common ear conditions, and occupational hearing conservation programmes for noise and chemical exposure.\nShe appealed to the federal and state governments to assist in promoting awareness and creating programs and necessary environments to prevent hearing loss across Nigeria."
  },
  {
    "headline": "Lawmakers advocate more financial commitment to healthcare",
    "summarized_story": "Lawmakers in the health sector say they have begun a review of the country’s health sector with a view to strengthening it with requisite laws following the emergence of the COVID-19 pandemic.\nThe lawmakers made the assertions at the Annual Legislative Summit on Health, which focused on Universal Health Coverage and Health Security.\nThey explained that the National Assembly is amending laws to ensure that the health sector serves the nation as it should.\nHe said the legislators were worried by the weak financial commitment of the government in the health sector, the poor implementation of healthcare laws.\n‘‘The Act that establishes the National Health Insurance Scheme has been amended to afford Nigerians the opportunity to benefit from health insurance."
  },
  {
    "headline": "Daniel, Amosun traumatised me for 16 years",
    "summarized_story": "Former Governor of Ogun State, Chief Olusegun Osoba has said he was traumatised by his successors for 16 years after he left office in 2003.\nThis premises (Governor’s office) became no go area for me.\n“The first eight years, I was virtually declared persona non grata in Ogun state, well that is settled, those involved have come to apologise.\nOsoba who expressed his joy for coming back to the Oke-Mosan Governor’s office after 16 years of leaving office, said “Mr.\nThe governor added that the centre would accord journalists the opportunity to write their stories and do their jobs conveniently."
  },
  {
    "headline": "Boko Haram: ISWAP kill, arrest Shekau’s commanders",
    "summarized_story": "Fighters of the Islamic State of West Africa Province (ISWAP) are sustaining their assault against the Abubakar Shekau-led Boko Haram.\nThe ISIS affiliate, has killed and arrested some Boko Haram commanders and members.\nThe sect captured Shekau’s commanders like faction including Mustapha Krimima Jaysh, Ba’akaka, Malkin Tijjani, Hirasama and Mallam Ballu who refused to surrender.\nSeries of meetings are being held in Sabeel Huda camp in the heart of Sambisa forest between ISWAP commanders and other surrendered senior Boko Haram members.\nThe ISWAP Service Chiefs and its Commanding Officers are all under the supervision of Abu-Mosad Albarnawy."
  },
  {
    "headline": "Kaduna air crash: Nigerian Air Force sets up committee",
    "summarized_story": "Four days after the Kaduna air crash that claimed the lives of Army Chief, Lt. Gen. Ibrahim Attahiru and other officers, the Nigerian Air Force (NAF) has constituted an audit committee.\nThe Chief of the Air Staff (CAS), Air Marshal Oladayo Amao formed a team of serving and retired senior officers to conduct a safety audit of all NAF operational and engineering units.\nThe committee is to, among others, analyse safety reports from operational and engineering units, conduct safety evaluation of NAF units and recommend safety measures.\nAbout 20 military officers have died in three crashes in the last three months.\n“We demand the result of earlier investigations published and a military Committee of Enquiry empanelled to investigate the incessant crashes”, said the President, Solomon Adodo."
  },
  {
    "headline": "Constitutional review: Fayemi opens public consultation",
    "summarized_story": "The one-day consultation was held to harmonise views of the Government and people of Ekiti State on the review process of the 1999 Constitution (as amended).\nFayemi said the 1999 Constitution had been under severe criticism because it was largely a product of military decrees, adding that it did not emanate from process of public involvement, consultation nor pass through any referendum.\n“No doubt, constitutional making and review have always been a challenging issue in any society, and the reason for the challenges is not farfetched.\nSome of the speakers, who made presentations at the forum included the Attorney General and Commissioner for Justice, Olawale Fapohunda; Speaker Ekiti State House of Assembly, Rt.\nHon Funminiyi Afuye represented by his Deputy, Hakeem Jamiu; Chief Judge of Ekiti State, Justice Ayodeji Daramola represented by Justice John Adeyeye; Chairman Traditional Rulers Council and Alawe of Ilawe Ekiti, Oba Ajibade Alabi, Bishop, Catholic Diocese of Ekiti, Rev Felix Ajakaiye and Chairman Ekiti State Civil Society Organisation, Professor Christopher Oluwadare."
  },
  {
    "headline": "Sagay calls for adoption of 1963 Constitution",
    "summarized_story": "By Raymond MordiThe Chairman of the Presidential Advisory Committee Against Corruption (PACAC), Professor Itse Sagay, has called for the adoption of the 1963 Constitution, to address agitations in some parts of the country.\nThe highly-respected scholar said everything that is missing in the 1999 Constitution and which is being clamoured for is in the 1963 Constitution.\nHe said the 1999 Constitution is a unitary constitution masquerading as a federal constitution.\nHis words: “My own personal preference is that we should scrap this constitution (referring to the 1999 constitution) and adopt the 1963 constitution that can contain everything that is being agitated for now.\nUnder 1963 Republican Constitution, Nigeria had four regions — East, North, West, and Mid-West — with independent structures that reflected its peculiarities."
  },
  {
    "headline": "Igbifa not in our custody, says DSS",
    "summarized_story": "By Nicholas Kalu, AbujaThe Department of State Services (DSS) has said its operatives did not arrest President of Ijaw Youth Council, Comrade Peter Timothy Igbifa.\nSpokesperson of the Service, Dr Peter Afunanya, in a WhatsApp message on Tuesday said: “The DSS has nothing to do with the alleged arrest or whisking away of President of Ijaw Youth Council, Comrade Peter Timothy Igbifa, by suspected masked men.”ADVERTISEMENTThere has been uncertainty over Igbifa’s whereabouts.\nWhile some sources claimed that Igbifa was kidnapped by masked gunmen, others said the IYC boss was not abducted."
  },
  {
    "headline": "One dead, two students injured in Osun multiple accidents",
    "summarized_story": "By Toba Adedeji, OsogboA student of Ataoja Secondary School, Damilola Akinola, has died in multiple accidents along Osogbo/Sekona road, Osogbo capital of Osun State.\nFive students of Ataoja Secondary School were involved in the accident on Monday evening while three of them sustained injuries.\nADVERTISEMENTIt was learnt the accident occurred when the students were crossing to get a bus that will convey them to their bus stops.\nSpokesperson of the Federal Road Safety Corps (FRSC), Osun Command, Agnes Ogungbemi, confirmed the incident.\nThe vehicles and motorcycle were taken to the Ataoja police station for safekeeping."
  },
  {
    "headline": "Sanwo-Olu implementing Lagos APC agenda for development",
    "summarized_story": "Lagos State All Progressives Congress (APC) Publicity Secretary Seye Oladejo writes on the achievements of Governor Babajide Sanwo-Olu as he marks his second year in officeThe Lagos State All Progressives Congress (APC) is proud of the achievements of Governor Babajide Sanwo-Olu, who is marking his second year in office this week.\nThe Lagos State government underscored its humane nature with the various impactful empowerment and poverty alleviation programs.\nIt’s noteworthy that the novel Lagos State Security Trust Fund remains the rallying point for the provision of the requisite support for the security agencies in the state.\nThe provision of operational vehicles, communication gadgets and other logistics has no doubt made Lagos State the safest in the country.\nThe Lagos State government under Governor Jide Sanwo-Olu has become the reference point for good, focused, impactful, inclusive, responsible, responsive, innovative and humane governance."
  },
  {
    "headline": "NNPC, Bonga sign agreement to unlock 2bn barrels in OML 118",
    "summarized_story": "Nigeria stands to reap about $700million benefit as the Nigerian National Petroleum Corporation (NNPC) and Bonga PSC signed agreements to unlock about two billion barrels of oil for the country under the Oil Mining Lease (OML) 118.\nUnder the arrangement, the NNPC and Bonga PSC will be executing five agreements that will deliver about $700million of immediate benefit to Nigeria.\nThe OML 118 with its straddle fields boast of the presence of the five major players in the deepwater space not only in Nigeria but also globally.\nOML 118 is the first major deepwater development in Nigeria in the deepwater Niger Delta 75 kilometres from shore containing the Bonga fields at water depth over 1000m.\nThe objective was that the HoT would translate to fully termed agreements including the Dispute Resolution Agreement and a new PSC Agreement for the OML 118 Contract Area."
  },
  {
    "headline": "Drop arms, embrace agriculture, Emefiele advises youths",
    "summarized_story": "From Uche Usim, AbujaGovernor, Central Bank of Nigeria (CBN), Godwin Emefiele, has urged restive youths across the country to drop their arms and embrace the Anchor Borrowers’ Programme (ABP), an agricultural revolution scheme aimed at solving the unemployment and food insufficiency nightmare.\nEmefiele who made these disclosures at the end of MPC May on Tuesday urged the state governments to repay the $2.1 budget support loan hanging on their necks.\nEmefiele said: “Security challenges and the economy are interconnected.\nI am aware that six of them are coming to the country in the month of July and August.\nOur brothers should drop their arms and embrace the Anchor Borrowers Programme.”“I’m optimistic that before the end of the year, this challenge would have abated”."
  },
  {
    "headline": "Restructuring’ll end insecurity, boost economy –Obi",
    "summarized_story": "From Felix Ikem, NsukkaFormer Governor of Anambra State, Mr. Peter Obi, has said restructuring Nigeria will boost the economy and put an end to the security challenges in the country.\nObi said this in Nsukka, Enugu State, yesterday, while delivering the 4th Adada Lecture titled “Restructuring, security challenges and development,”organised by Association of Nsukka Professors (ANP), held at the University of Nigeria, Nsukka (UNN).\nHe said with restructuring governors of various states would look inward to make their states productive and establish state, local and community police that would end criminality.\nHe wondered why Nigerians are not so comfortable when they hear the word ‘restructuring’ stressing that people should stop misunderstanding restructuring as a plan to divide the country, but rather see it as measure to boost the economy as well as end insecurity in the country.\nChinyeaka Ohaa,chairman of the occasion said that the topic of the occasion could not have come at a better time as the country than now when the country is witnessing serious security challenges."
  },
  {
    "headline": "South West govs building ethnic monsters –Northern Elders",
    "summarized_story": "From Fred Itua, AbujaNorthern Elders Forum (NEF),yesterday, accused South West governors of building ethnic monsters.\nThe forum said leaders from the region are pampering the monsters and hiding under them to blackmail the Federal Government into achieving their ambition in 2023.\nThe elders also described the posture of South East leaders in taming the growing insecurity in the region as unacceptable.\n“In the South West, elected leaders and pampered ethnic bullies are closing ranks to provide a front that apes the do-what-we-want-or-we-leave-the-country strategy of the marginalised leaders of the South East.\n“The South South is squeezed between fear and uncertainty, and its leaders are gambling that they can benefit from further weakening the federal administration and the north if it rides along with the rest of the South."
  },
  {
    "headline": "BREAKING: CBN retains all policy parameters",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) said it again voted to retain the monetary policy rate at 11.5 percent.\nCentral Bank of Nigeria Governor Godwin Emefiele made the announcement during a press briefing at the CBN headquarters on Tuesday.\nThe MPC also noted that at least 70% of Nigeria’s population must be vaccinated if the country means to achieve economic recovery.\nResponding to questions on the CBN ban on cryptocurrency transactions in Nigerian banks, the CBN governor insisted that the encrypted nature of cryptocurrency transactions makes it hard for fraud to be investigated and criminals apprehended.\nAccording to Emefiele, no responsible Central Bank will support such transactions."
  },
  {
    "headline": "£4.2m Ibori Loot Returned to Delta, Says Accountant General",
    "summarized_story": "By Adedayo AkinwaleThe Accountant General of the Federation, Mr. Ahmed Idris, has revealed that the £4.2 million loot recovered from a former Governor of Delta State, James Ibori, and his associates, which was recently repatriated from the United Kingdom, has been returned to Delta State.\nMalami’s stance consequently led to calls from the Delta State government and other stakeholders on the federal government to return the recovered loot to the state in line with established precedents whereby such funds were returned to states from which the recovered loot was stolen.\nHe explained that such funds like that of Ibrori which was looted from the treasury of a state were always returned to the state.\nSome recoveries are for State governments – specific state governments.\nSuch recoveries goes specifically to thoseStatess.”When asked where the Ibori loot was paid into, Idris without mincing words, said it was paid to Delta State government."
  },
  {
    "headline": "CBN Retains Interest Rate at 11.5%",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN), Tuesday resolved to retain Monetary Policy Rate (MPR) otherwise known as interest rate at 11.5 per cent.\nThe CBN Governor, Mr. Godwin Emefiele, after the two-day monthly Monetary Policy Committee meeting, said the committee also resolved to maintain the asymmetric corridor of +100/-700 basis points around the MPR.\nThe apex bank also left the Cash Reserve Ratio at 27.5 per cent and Liquidity Ratio at 30 per cent.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Queries Legality of Southern Governors’ Ban on Open Grazing",
    "summarized_story": "•Okays ranching, revival of grazing reserves’ take-off in JuneBy Deji ElumoyePresident Muhammadu Buhari yesterday took issue with Southern governors over their ban on open cattle grazing in the region.\nThe president’s stance on the Southern governors’ Asaba Declaration came a few days after the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami (SAN), expressed similar views.\nMalami, while fielding questions on a live television programme, had kicked against the open grazing ban, saying it was unconstitutional.\nThe AGF had compared the Southern governors’ decision to their Northern counterparts banning spare parts trading in the North, considering the fact that the majority of spare parts traders in the North are from the South.\nIt is as good as saying maybe the Northern governors coming together to say that they prohibit spare parts trading in the North."
  },
  {
    "headline": "OPS Excited over Manufacturing Sector’s Recovery from COVID-19 Headwinds",
    "summarized_story": "The data also showed that the manufacturing sector recorded a 3.40 per cent growth rate in Q1 2021 after recording negative growth in the Q4 of 2020.\nIn addition, its Q1 2021 performance was also higher than the 0.81 per cent and 0.43 per cent it recorded in Q1 2019 and Q1 2020 respectively, which were pre-COVID-19 era.\n“In Q1 2021, manufacturing activities more or less rebounded to the level of pre-COVID-19 period.\nSo, it is expected that the sector will present a better performance in Q1 2021 than what obtained in Q4 2020.\nThe MCCI is a quarterly survey of the manufacturing sector."
  },
  {
    "headline": "Buhari Questions Legality of Southern Govs’ Ban on Open Grazing, Okays Ranching, Revival of Forest Reserves",
    "summarized_story": "The plan of action include approved actionable plan of rehabilitating grazing reserves in the states, starting with those that are truly committed to the solution and compliant with specific requirements.\nThe President also picked on the Southern Governors and described their recent decision to ban open grazing as illegal saying it infringes on the constitutional right of Nigerians to move freely in any part of the country.\nSouthern governors had at their summit in Asaba recently banned open grazing in the region to end the frequent clashes between farmers and herders and called for restructuring of the country.\nThe statement said it was very clear that there was no solution offered from the Southern Governors resolutions to the herder-farmer clashes that had been continuing in the country for generations.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States."
  },
  {
    "headline": "Sowore Remains Our Chairman, AAC Says As It Disclaims Leonard Nzenwa As Speaker At Event",
    "summarized_story": "The African Action Congress (AAC) has urged the public to disregard an information being circulated that Leonard Nzenwa will speak as the chairman of the party at an upcoming webinar.\nIt also reiterated that Mr. Omoyele Sowore remains the National Chairman of the AAC, as ratified in the convention of the party on the 6th October, 2018.\n\"As a political party that engages with the principles of democracy as its guide, Leonard Nzenwa was issued a query letter on the 17th January, 2019 and was suspended pending investigation and his defense (https://aacparty.org/case-against-dr-leonard-ezenwa/).\nThe AAC REITERATES THAT THE SAID INDIVIDUAL, LEONARD NZENWA IS NO LONGER A MEMBER of the AFRICAN ACTION CONGRESS (AAC), let alone an executive at the national level.\n\"COMRADE OMOYELE SOWORE REMAINS THE NATIONAL CHAIRMAN OF THE PARTY, ratified alongside other officers at the first and only Convention which held in Lagos on 6th, October 2018 in line with the provisions of Section 57 of the party’s constitution."
  },
  {
    "headline": "Sowore Remains Our Chairman, AAC Says As It Disclaims Leonard Nzenwa As Speaker At Event",
    "summarized_story": "The African Action Congress (AAC) has urged the public to disregard an information being circulated that Leonard Nzenwa will speak as the chairman of the party at an upcoming webinar.\nIt also reiterated that Mr. Omoyele Sowore remains the National Chairman of the AAC, as ratified in the convention of the party on the 6th October, 2018.\n\"As a political party that engages with the principles of democracy as its guide, Leonard Nzenwa was issued a query letter on the 17th January, 2019 and was suspended pending investigation and his defense (https://aacparty.org/case-against-dr-leonard-ezenwa/).\nThe AAC REITERATES THAT THE SAID INDIVIDUAL, LEONARD NZENWA IS NO LONGER A MEMBER of the AFRICAN ACTION CONGRESS (AAC), let alone an executive at the national level.\n\"COMRADE OMOYELE SOWORE REMAINS THE NATIONAL CHAIRMAN OF THE PARTY, ratified alongside other officers at the first and only Convention which held in Lagos on 6th, October 2018 in line with the provisions of Section 57 of the party’s constitution."
  },
  {
    "headline": "History Will Be Cruel To Tinubu, Bisi Akande, Gbajabiamila, Others Over Their Position On Yoruba Nation",
    "summarized_story": "The umbrella body for Yoruba self-determination groups, Ilana Omo Oodua, has criticised the National Leader of the All Progressives Congress, Bola Tinubu, and other APC leaders in the South-West leaders for opposing “separatist agitations”.\nSaharaReporters had reported that Tinubu and some other APC leaders in the South-West, including the Speaker of the House of Representatives, Femi Gbajabiamila had opposed agitations for Yoruba Nation at a meeting on Sunday.\nBut Ilana Oodua through its spokesperson, Maxwell Adeleye, told The PUNCH that the decision made by the APC leaders was unfortunate.\nWhat we are fighting for is the self-determination right of our people as guaranteed by the United Nations Charter on Human rights and even the 1999 constitution.\n“It is unfortunate that Chief Bisi Akande is present where the yearning and aspirations of Yoruba people will be denied."
  },
  {
    "headline": "History Will Be Cruel To Tinubu, Bisi Akande, Gbajabiamila, Others Over Their Position On Yoruba Nation",
    "summarized_story": "The umbrella body for Yoruba self-determination groups, Ilana Omo Oodua, has criticised the National Leader of the All Progressives Congress, Bola Tinubu, and other APC leaders in the South-West leaders for opposing “separatist agitations”.\nSaharaReporters had reported that Tinubu and some other APC leaders in the South-West, including the Speaker of the House of Representatives, Femi Gbajabiamila had opposed agitations for Yoruba Nation at a meeting on Sunday.\nBut Ilana Oodua through its spokesperson, Maxwell Adeleye, told The PUNCH that the decision made by the APC leaders was unfortunate.\nWhat we are fighting for is the self-determination right of our people as guaranteed by the United Nations Charter on Human rights and even the 1999 constitution.\n“It is unfortunate that Chief Bisi Akande is present where the yearning and aspirations of Yoruba people will be denied."
  },
  {
    "headline": "Stop Crying More Than The Bereaved, Miyetti Allah— Falana Tells Buhari Government",
    "summarized_story": "Human rights lawyer, Femi Falana (SAN) has condemned the opposition of the federal government to the ban on open grazing by some Southern governors.\nThe Senior Advocate further advised the Presidency to study the Grazing Reserves Act of 1964 so as not to compound the crisis by giving the erroneous impression that grazing reserves are different from ranches.\n\"Instead of weeping more than the bereaved, the Federal Government should listen to the Miyetti Allah which has accepted the ban on open grazing and demanded the establishment of ranches.\n\"Since there is a popular demand for the proscription of open grazing, all hands should now be on deck to establish ranches without any further delay.\nThe Presidency should not compound the crisis by giving the erroneous impression that grazing reserves are different from ranches.\""
  },
  {
    "headline": "Emefiele: We're expecting 12 fighter jets to help us solve insecurity",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says the country is expecting 12 fighter jets to help solve insecurity.\nAdvertisementEmefiele, while speaking on Tuesday at a monetary policy committee meeting in Abuja, expressed concern over the negative effects of insecurity on the economy.\nAdvertisementAccording to Emefiele, the fighter jets will help address the rising security challenges in the country.\n“If you want an economy to grow, the level of insecurity must be low because if there is a high level of insecurity like what we see today, the economy will suffer,” he said.\nAdvertisement“About three years ago, the federal government and the United States signed a pact that resulted in a government-to-government acquisition of military equipment, out of which, we are expecting 12 fighter planes that would help us solve our insecurity."
  },
  {
    "headline": "Emefiele: We're expecting 12 fighter jets to help us solve insecurity",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says the country is expecting 12 fighter jets to help solve insecurity.\nAdvertisementEmefiele, while speaking on Tuesday at a monetary policy committee meeting in Abuja, expressed concern over the negative effects of insecurity on the economy.\nAdvertisementAccording to Emefiele, the fighter jets will help address the rising security challenges in the country.\n“If you want an economy to grow, the level of insecurity must be low because if there is a high level of insecurity like what we see today, the economy will suffer,” he said.\nAdvertisement“About three years ago, the federal government and the United States signed a pact that resulted in a government-to-government acquisition of military equipment, out of which, we are expecting 12 fighter planes that would help us solve our insecurity."
  },
  {
    "headline": "Open grazing: Southern governors building ethnic monsters, say northern elders",
    "summarized_story": "The Northern Elders’ Forum (NEF) has accused southern governors of building “ethnic monsters” in a bid to whip up sentiments in the country.\nAdvertisementTwo weeks ago, governors of the 17 southern states had met in Asaba, Delta state capital, to discuss the state of the nation.\nAfter the meeting, the governors called on President Muhammadu Buhari to be fairer in political appointments, convene a national dialogue, embrace the calls for restructuring, and ban open grazing.\nBut their resolutions were criticised by some leaders from the north, including Senate President Ahmad Lawan and Yahaya Bello, governor of Kogi state.\nAdvertisementIn a statement on Tuesday, Hakeem Baba-Ahmed, spokesperson of NEF, said the resolutions by the southern governors is an attempt to split the north and subject its people to humiliation and attacks."
  },
  {
    "headline": "Open grazing: Southern governors building ethnic monsters, say northern elders",
    "summarized_story": "The Northern Elders’ Forum (NEF) has accused southern governors of building “ethnic monsters” in a bid to whip up sentiments in the country.\nAdvertisementTwo weeks ago, governors of the 17 southern states had met in Asaba, Delta state capital, to discuss the state of the nation.\nAfter the meeting, the governors called on President Muhammadu Buhari to be fairer in political appointments, convene a national dialogue, embrace the calls for restructuring, and ban open grazing.\nBut their resolutions were criticised by some leaders from the north, including Senate President Ahmad Lawan and Yahaya Bello, governor of Kogi state.\nAdvertisementIn a statement on Tuesday, Hakeem Baba-Ahmed, spokesperson of NEF, said the resolutions by the southern governors is an attempt to split the north and subject its people to humiliation and attacks."
  },
  {
    "headline": "NAF sets up committee to conduct safety audit -- days after Kaduna crash",
    "summarized_story": "The Nigerian Air Force (NAF) has set up a committee to conduct safety audit on its operational and engineering units.\nThe committee is chaired by Abraham Adole, deputy theatre commander, operation Hadin Kai (formerly known as Lafiya Dole) — a military operation aimed at defeating Boko Haram.\nAdvertisementThe NAF spokesman added that the committee will submit its report on or before June 18, 2021.\n“The committee is to, among other terms of reference, analyse safety reports from operational and engineering units, conduct safety evaluation of NAF units, and recommend measures to enhance safety of operations in the units,” the statement reads.\nAttahiru and 10 other military officers lost their lives while on the Beechcraft 350, a military aircraft belonging to NAF."
  },
  {
    "headline": "Jo’Burg, Marrakesh, Lagos: Which African cities have the highest internet speeds?",
    "summarized_story": "In a world of online gaming, Zoom meetings and video-on-demand streaming, internet speed is everything.\nSouth Africa leads mobile, Ghana fixed broadbandUsers can test internet speed using a number of options.\nFor this, we’ll focus on mobile internet speeds and latency – a measure of how responsive an internet connection is.\nAs such, we are limited in how certain we are of the cities with the top internet speeds in Africa.\nHowever, the numbers show a wide gap between internet speeds in Africa and the rest of the world."
  },
  {
    "headline": "Ethiopia awards its first private telecoms licence to Vodafone consortium",
    "summarized_story": "Ethiopia has awarded one out of the two private telco licences it intends to award to a consortium that includes the Vodafone group.\nThe consortium, which made a winning bid of $850 million, comprises Vodafone, Nairobi-based Safaricom Ltd, CDC Group Plc and Sumitomo Corp.\nEtisalat, Orange Telecoms, MTN and Saudi Telecom Company were some of the companies that registered interest.\nIn the end, only two companies put bids forward; the Vodafone consortium and MTN.\nRegardless, MTN also made a bid of $600 million which was considered not good enough, and now the second telecoms licence will now be retendered for new offers."
  },
  {
    "headline": "Successful product managers are walking encyclopedias.",
    "summarized_story": "Successful product managers need to learn a little bit about each of them because we do a lot of directing in our work.\nShould aspiring product managers expect to manage diverse teams?\nHow then do successful product managers navigate team management?\nI asked her what other skills she believes aspiring product managers need to be excellent in their roles?\nSuccessful product managers must own the product and visualize the bigger picture at all times."
  },
  {
    "headline": "Samsung A12 Vs Infinix HOT 10T: Which Is A Better Buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inches.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "New FirstBank Website Puts YOU, the customer, First!",
    "summarized_story": "With this design, the FirstBank website reformats to fit the screen of whatever device the visitor is using to view it and allows users the flexibility to conduct business wherever they may be.\nOn its new website, FirstBank puts an obvious button to online banking in top navigation so visitors know exactly where to go.\nSeparate Product Pages with Strong Calls-to-ActionThe FirstBank website has unique secondary pages for every product, and clear calls-to-action for people to be able to navigate to those pages.\nWith the new FirstBank website, customers are at an edge in the industry as they establish a relationship with the Bank that puts YOU, its customers, First.\nYou can visit the new FirstBank website here."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "[SPONSORED] Techuncode reviews Samsung A12 vs Infinix HOT 10T: Which is a better buy?",
    "summarized_story": "Phones like the Infinix HOT 10 and the Samsung Galaxy A12 are one in the number of stellar products offered by both brands.\nScreen sizeThe Samsung Galaxy A12 uses a 6.52-inch HD+ screen while the Infinix HOT 10 pushes its screen size up to 6.82 inch.\nSamsung Galaxy A12 uses the MediaTek p35 processor while the Infinix HOT 10T uses the MediaTek G70 processor.\nHowever, the Samsung Galaxy A12 provides better charging ability with 15w fast charging technology against Infinix HOT 10’s 10W charging technology.\nAt the rear side of the Galaxy A12 Samsung uses a 48+5+2+2MP camera while the Infinix HOT 10 uses a 48+2+AI camera."
  },
  {
    "headline": "Egyptian agritech startup, Mozare3, raises over $1 million pre-seed to grow its network of farmers",
    "summarized_story": "Egyptian agritech startup, Mozare3, has raised over $1 million in a pre-seed round.\nThe startup also plans to develop the first digital community for Egyptian farmers and offer them agronomy support through its professional network.\nThe agritech startup assists farmers sell their crops by working with institutional buyers like frozen vegetable processors, large retailers, and wholesalers.\nAccording to MENabytes, Abou Bakr said they currently have offtake agreements with 100 farmers and three large institutional buyers.\nAdvertisementThe Egyptian agritech startup plans to introduce credit solutions to fund purchases of different products like motorbikes for the farmers and their families."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenue",
    "summarized_story": "Shell’s $10bn Bonga project to proceed in N320bn boost to govt revenueThe long-delayed $10billion Shell Bonga South West project is likely to commence soon as partners resolve a lingering dispute over terms and ink a deal that will restart the project.\nThis development could create jobs, boost Nigeria’s revenue, and prompt other operators whose projects have also been suspended due to contract disputes with the Nigerian…"
  },
  {
    "headline": "Starved of dollars, Nigeria struggles to meet cash-call obligations",
    "summarized_story": "The uncertainties surrounding access to foreign currency are currently making it difficult for Nigeria to meet cash-call arrears owed to multinational oil companies, which are joint-venture partners of the state-owned Nigerian National Petroleum Corporation (NNPC).\nThe development is a huge stain on NNPC, whose previous default rate of meeting cash-call obligations in various joint venture…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Telecom’s growth hits 3-year low as government policy stifles sector",
    "summarized_story": "Nigeria’s telecommunication sector recorded its lowest growth in three years, thanks to the Federal Government decision to ban SIM card sales, stifling the growth of the sector that has contributed immensely to the growth of the economy over the years.\nAccording to a recent report by the National Bureau of Statistics (NBS), telecom’s growth rate…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "EIRS Hails IUO On Tax Compliance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOKADA(OVIA NORTHEAST) – Edo State Internal Revenue Service (EIRS), yesterday appreciated Igbinedion University, Okada (IUO) for being tax compliant.\nResponding to the raised tax issues on behalf of the Vice Chancellor, IUO, Professor Lawrence Ikechukwu Ezemonye, Dr. Nosa Edogiawerie (Bursar) appreciated the delegation and encouraged its continuance for ease of tax administration in the state.\nHe affirmed that non payment of tax would dent the image of the hospital and possibly attract a riot act from government.\nAn expatriate and Director of Administration, Igbinedion University Teaching Hospital, Michael Strauss, stated that taxes must be deducted to be responsible employees to government which depends on revenue to succeed.\nHe stated that if taxes are not paid to government one could get punished (nailed) as applicable in advanced countries hence appreciated government for it’s resilience at tax collection."
  },
  {
    "headline": "Ambrose Alli Varsity: Visitation Panel indicts ousted mgt of 1.7bn fraud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…N133m lease obtained for motor vehicle procurementBENIN CITY – The Ambrose Alli University, Ekpoma, Special Visitation Panel has indicted the ousted management of the institution for “indiscriminate procurement of loans/overdraft” to the tune of N1,794,069,811.02 within the period under review.\nThe panel, which was constituted by Governor Godwin Obaseki in the wake of the agitation by staff unions in the school and other stakeholders in the university community, was tasked to investigate operations of the university in terms of revenue generation, transparency, accountability, adherence to due process, mode of employment and promotions and sustainability.\nThe panel, set up in October, 2020, was chaired by Prof. Ikponmwosa Omoruyi, a Professor of Law at the University of Benin.\nProf. Lawrence Atsegbua, who is a member of the panel, is also a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN).\nOthers on the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary."
  },
  {
    "headline": "CLEEN Foundation Trains Law Enforcement Agencies On Anti-Human Trafficking / Forced Migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A Non-Governmental Organization (NGO), CLEEN Foundation has called for concerted efforts among law enforcement agencies in Edo State against the menace of human trafficking and forced migration.\nBenson Olugbuo, Executive Director of the foundation, who made the call at a two-day capacity building workshop for law enforcement agencies in Edo State, noted that a united front would contribute significantly to solving the problem.\nOlugbuo said law enforcement agencies can play a critical role in the fight against the menace through intelligence gathering, prosecution of traffickers within the ambit of the law, protection of victims and others as stipulated by various operational legal frameworks.\nAccording to him, the role of the law enforcement agencies cannot be downplayed if we are ever going to make significant strides in our effort to overcome this enigma.\nHe, therefore, urged the participants to be more resolute in fighting human trafficking and forced migration in the state and to provide necessary support for victims."
  },
  {
    "headline": "Intimidating Profile And Destruction Of Aregbesola’s 64th Birthday Billboard – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestNon progressive in Osun State are being intimidated by Aregbesola’s rising profile.\nA billboard erected by the Caretaker Secretary of the All Progressives Congress (APC) in the State of Osun, Hon.\nThe billboard was erected at the famous Old Garage area, Osogbo, The billboard was erected at the famous Old Garage area, Osogbo, the state capital.\nThis was a direct attack on Aregbesola and his rising profile in Osun State.\nInwalomhe Donald writes fro Osogbo, Osun State..."
  },
  {
    "headline": "£4.2 million Ibori loot paid to Delta govt – Accountant General",
    "summarized_story": "The £4.2 million recovered from the former governor of Delta State, James Ibori, has been paid to the Delta State Government, the Accountant General of the Federation, Ahmed Idris, said on Tuesday.\nHe stated that “all recovered funds that belong to the respective states are paid directly to the states”.\nAdejoro Adeogun (APC, Ogun), the chairman of the committee, asked Mr Idris specifically if the Ibori loot was paid to Delta State.\n“It was paid to the state, it was paid to Delta State.\nThe agreement to return the money to Nigeria was done under the auspices of the U.K.-Nigeria Memorandum of Understanding (MoU)."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "How police officer detonated grenade in Ebonyi State",
    "summarized_story": "The Ebonyi State police command has explained that an explosion which happened in the Afikpo area of the state was caused by a grenade detonated by a police officer, Idi Aminu.\nIn a statement, its Police Public Relations Officer (PPRO), DSP Loveth Odah, the Ebonyi police command, explained that the police officer mistakenly hit the device which killed him.\nShe stressed that there was no bomb explosion in Ebonyi state contrary to initial speculations.\n“My attention has been drawn to a news making the round in some section of the media that there was an explosion of a suicide bomb in Afikpo, Ebonyi State this afternoon.\nA similar incident equally occurred in front of the Ebonyi State Old Government House as some mobile police officers were servicing their APC machine."
  },
  {
    "headline": "CBN’s MPC retains Monetary Policy Rate at 11.5%",
    "summarized_story": "OBINNA EZUGWUThe Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) on Tuesday, voted unanimously to retain Monetary Policy Rate (MPR) at 11.5 percent.\nThe committee also retained Cash Reserve Ratio (CRR) at 27.5 percent, and Liquidity Ratio at 30 percentIt equally maintained Asymmetric Window of +100 and -700 basis points around the MPR.\nMore later…"
  },
  {
    "headline": "Police kill two gunmen in Imo, recover arms",
    "summarized_story": "The Imo State Police Command says it killed two gunmen during a gun duel that lasted for hours in the Ohaji/ Egbema axis of the state on Tuesday.\nHe said the bandits were suspected to be part of the gang that attacked the Owerri Correctional Centre and the state Police command headquarters in Owerri, on April 5.\n“Imo Police Command neutralised hoodlums that masterminded the attack on the Command Headquarters and Correctional Centre in April, 2021.Recovered AK 47 Rifle with a cache of live ammunition,” he said.\n”One Ak47 Rifle with breach number 11654 and a cache of live ammunition were recovered.\nAlso recovered are a number of expanded ammunition, matchets and criminal charms tied around the waist of the suspects."
  },
  {
    "headline": "Just in: £4.2m Ibori loot paid to Delta State govt – Accountant General",
    "summarized_story": "The Accountant General of the Federation, Mr. Ahmed Idris has said the £4.2m ‘looted’ by ex-governor of the state, James Ibori, has since been transmitted to Delta state government.\nMr. Idris made the disclosure before the House of Representatives Ad hoc Committee on “Assessment and Status of all Recovered Loots Movable and Immovable Assets from 2002-2020 by agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilization”.\nHe was responding to posers from the legislators on the difference between the Federation and Consolidated Revenue Fund Accounts of the Federation, and the desegregation of Recovered Assets and funds, according to Vanguard.\nRecall that the Federal Government had recently announced that the government of United Kingdom had returned £4.2m said to have been looted by Ibori and his associates while he was in office as governor."
  },
  {
    "headline": "Group Condemns Akeredolu’s Alleged Imposition Of Oodua Athem On Ondo Ijaws",
    "summarized_story": "The Arogbo Ijaw Patriots have condemned in strong terms the imposition of the Oodua anthem on the Ijaw minority in Ondo State.\nThe group said in a statement on Tuesday that the State governor, Rotimi Akeredolu’s (SAN) attempt to foist an ethnic anthem on the Ijaws of Ondo State amounted to a flagrant violation of the rights of the Ijaw ethnic minority in Ondo State.\nThe group said that it was absurd and rather disturbing that the Governor would make it compulsory for Oodua or ‘Ondo anthem’ (in Yoruba) to be sung in all secondary schools in the Ondo State where there are indigenous Ijaws.\nADVERTISEMENTThe group noted that Ondo State comprises of two ethnicities: The dominant Yoruba who occupy 17 local government areas and the minority Ijaws who occupy a local Government area of their own.\nAccording to them, their territory which became part of Ondo State in 1976 is not a vassal territory and shouldn’t be treated as such."
  },
  {
    "headline": "Estate Developer Accuses Politicians Of Taking Credit For Private Infrastructure In Abuja",
    "summarized_story": "The chief executive officer of Perfect Estate Developers Ltd, Arc.\nDayo Babatunde, has raised the alarm that politicians have begun to take credit for privately built infrastructure in their localities within the Federal Capital Territory Abuja.\nBabatunde in a chat with journalists on Tuesday said that the access road to his Perfect Estate in Kuje, Abuja has been variously appropriated by politicians and is being showcased as part of their projects to undiscerning citizens.\nAs a matter of fact, without a good access road,you discover that marketing the Estate becomes a big challenge.\nSo we are also under pressure to makethe road a reality while also building the houses."
  },
  {
    "headline": "FCTA Moves To End Multiple Taxation",
    "summarized_story": "The Federal Capital Territory Administration (FCTA), has expressed concern over alleged outrageous demands and notices just as the authorities have vowed to put an end to multiple taxation for the benefit of Abuja residents.\nAliyu assured chairmen of the six Area Councils of the readiness of her office to collaborate with them for a mutual desire to make life better for residents at the grassroots in the interest of good governance.\n“We can easily recall and relate to the viral but avoidable incident where customers were locked inside a restaurant in the FCC by overzealous Area Council’s revenue officials; a situation that gravely caused serious embarrassment to the government.\n“The more friendly our businesses environment is, the more we will be able to attract investments that will in turn result to higher tax revenue.\nThe corollary will undermine our revenue generation efforts to the detriment of all,” Adesola added."
  },
  {
    "headline": "EFCC Arrests Niger Politician Over Alleged Employment Scam",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested one Mohammed Umar, a Bida, Niger State based politician and businessman, for alleged employment scam.\nEFCC spokesperson, Wilson Uwujaren, said operatives from the Cybercrime section at the EFCC headquarters, Abuja arrested Umar on May 18, 2021 following a petition from a victim whom he allegedly defrauded through a fake employment offer with the Nigeria Customs Service.\nHe said Umar allegedly requested for the sum of N750, 000 from the victim to facilitate the employment.\nHowever, the victim gave him a deposit of N200, 000 and promised to pay the balance when he gets his appointment letter.\nThe distraught victim consequently petitioned the EFCC, leading to the arrest of the suspect."
  },
  {
    "headline": "Chadian Crisis May Compound Insecurity In Nigeria, Others – Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja has said the consequences of a destabilised Chad to the West African sub-region cannot be imagined, saying it will compound the insecurity in Nigeria and other neighboring countries.\n‘‘The need to support the Chadian government to effectively carry out its planned 18-month transition is sacrosanct.\n‘‘The transition period should be civilian-led, with requisite powers given to the constitutionally mandated organs of government saddled with the responsibility of administering the country,’’ President Buhari in a statement by presidential spokesman, Femi Adesina, said.\nEulogising the Marshal of Chad, President Buhari described the late President as a committed African leader and statesman who stood for peace and stability of the Lake Chad Region, the Sahel and the African continent in general.\n‘‘His passion, commitment and zeal to the cause of the Lake Chad and African unity would be greatly missed,’’ he added."
  },
  {
    "headline": "Covid-19: We have achieved 96% target of our vaccination status",
    "summarized_story": "*Urges individuals eligible for second doses to do soDoosuur Iwambe, AbujaThe Federal Government, FG, has revealed that it has been able to achieve over 96%( 1,929,237) of its covid-19 vaccination target in Nigeria.\nWe have now provided the first COVID-19 vaccine doses to a total number of 1,929,237 Nigerians, representing 96% of the targeted population.\nIn addition, we have begun providing second doses, and that number has reached 4,683.\nThose individuals currently eligible for second doses will have received their first dose 6 to 12 weeks ago.\nAdditionally, the United States announced it will donate 20 million vaccine doses by the end of June to the COVAX scheme”."
  },
  {
    "headline": "Sifax boss, Afolabi, donates 4,000 copies of Obasanjo’s book to varsities, libraries",
    "summarized_story": "The biography account of the former president, written by his former aide, Otunba Femmy Carrena, was officially launched in December 2020.\nThe donation of the books to the Obasanjo Library for onward distribution to schools and libraries is to commemorate Obasanjo’s 84th birthday in arrears.\nREAD ALSO: Coup: Mali’s Military Detains President, Prime Minister, Defence Minister as UN KicksAccording to Afolabi: “Chief Obasanjo has done so much for Nigeria and he should be celebrated.\nThe entire 4,000 copies will be received by the former President Obasanjo on behalf of the Library.\nAccording to Carrena, who is the author of the book, he is passionate about anything on the former President Obasanjo because he has impacted humanity at all levels."
  },
  {
    "headline": "BREAKING: NAF sets up committee to conduct safety audit, following multiple crashes",
    "summarized_story": "The Nigerian Air Force has formed a committee to conduct a safety audit of its operational and engineering units after several air crashes, according to our correspondents.\nThe statement was signed by NAF Director of Public Relations and Information, Air Commodore Edward Gabkwet, on Tuesday.\n‘NAF Establishes Committee To Conduct Safety Audit Of Its Operational And Engineering Units,’ read the document.\nAt least 20 military officers have died in three crashes involving Nigerian Air Force jets in the last three months.\nDetails shortly…"
  },
  {
    "headline": "BREAKING: Recovered £4.2m Ibori loot returned to Delta -Accountant-General",
    "summarized_story": "The Accountant General of the Federation, Mr. Ahmed Idris, has said the £4.2m looted by a former Governor of Delta State, James Ibori, which the Federal Government recently repatriated from the United Kingdom, has been returned to the state.\nIdris made this known in Abuja on Tuesday when he appeared before the House of Representatives’ Ad hoc Committee on Assessment and Status of All Recovered Loots Movable and Immovable Assets from 2002 to 2020 by Agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilisation.\nREAD ALSO: Coup: Mali’s Military Detains President, Prime Minister, Defence Minister as UN KicksThe Accountant-General, who was grilled by the committee for over one hour, stated that such funds looted from the treasury of a state are always returned to the state.\nHe added that states can sue the Federal Government to recover such funds.\nDetails later…"
  },
  {
    "headline": "$23m withdrawal: Trouble looms as reps query AGF, Ahmed Idris",
    "summarized_story": "Members of the House of Representatives on Tuesday queried the Accountant General of the Federation, Ahmed Idris, over the borrowings from the assets recovery account by government agencies.\nSpecific reference was made to the sum of $23 million from the account, which is yet to be refunded.\nHe said unless the Accountant General could provide evidence of the refund, it would be considered that such withdrawals were made illegally.\n“What we are trying to draw attention to is that money is being borrowed out from the recovery account and not being refunded.\nUnless you are able to prove to us that it was refunded, we consider that to mean that payments have been made illegally,” Adeogun said."
  },
  {
    "headline": "$23m withdrawal: Trouble looms as reps query AGF, Ahmed Idris",
    "summarized_story": "Members of the House of Representatives on Tuesday queried the Accountant General of the Federation, Ahmed Idris, over the borrowings from the assets recovery account by government agencies.\nSpecific reference was made to the sum of $23 million from the account, which is yet to be refunded.\nHe said unless the Accountant General could provide evidence of the refund, it would be considered that such withdrawals were made illegally.\n“What we are trying to draw attention to is that money is being borrowed out from the recovery account and not being refunded.\nUnless you are able to prove to us that it was refunded, we consider that to mean that payments have been made illegally,” Adeogun said."
  },
  {
    "headline": "Marwa to politicians, students: You must undergo drug test",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency, Brigadier General Buba Marwa (retd.\n), has emphasised on the need for politicians seeking public offices and students seeking admission into higher institutions to undergo drug integrity tests.\nThe statement titled ‘Why politicians, students, must undergo drug test – Marwa’ was made public by the NDLEA Director of Publicity and Media, Femi Babalola, where the Chairman pointed out that politicians in the forthcoming elections should undergo drug tests.\n“He said same thing applies to students who are seeking admission into higher institutions.\n“He said because of the evidence-based strong nexus between drug abuse and security challenges across the country, concerted efforts must be made towards tackling the drug scourge headlong."
  },
  {
    "headline": "Marwa to politicians, students: You must undergo drug test",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency, Brigadier General Buba Marwa (retd.\n), has emphasised on the need for politicians seeking public offices and students seeking admission into higher institutions to undergo drug integrity tests.\nThe statement titled ‘Why politicians, students, must undergo drug test – Marwa’ was made public by the NDLEA Director of Publicity and Media, Femi Babalola, where the Chairman pointed out that politicians in the forthcoming elections should undergo drug tests.\n“He said same thing applies to students who are seeking admission into higher institutions.\n“He said because of the evidence-based strong nexus between drug abuse and security challenges across the country, concerted efforts must be made towards tackling the drug scourge headlong."
  },
  {
    "headline": "N1.8bn fraud rocks Ambrose Alli University",
    "summarized_story": "By Jethro Ibileke/BeninA special visitation panel constituted by Governor Godwin Obaseki of Edo, to visit the state-owned Ambrose Alli University (AAU), Ekpoma, has indicted the ousted management of the institution for “indiscriminate procurement of loans/overdraft” to the tune of N1,794,069,811.02 within the period under review.\nLawrence Atsegbua, a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN), was also a member of the panel.\nOthers members of the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary.\nThe panel was tasked to investigate operations of the University, in terms of revenue generation, transparency, accountability, adherence to due process, mode of employment and promotions and sustainability.\nThe panel also recommended that indiscriminate procurement of motor vehicles through lease financing should be stopped, as payment of N133,138,324.39, within 5 years as lease financing is not sustainable."
  },
  {
    "headline": "Lagos attracts $8.32 billion foreign investments in two years",
    "summarized_story": "The Lagos State Government on Tuesday said it has attracted investment worth $8.32 billion into the state in the last two years.\n“The Office started on a strong footing that has seen investment worth close to 8.32 billion dollars in investment being proposed for start-up in the State,” she said.\nThe special adviser the Office participated in high level investment forum that would eventually yield the desired investment target for the State.\nShe noted that more than 12 private sector were supported in investing in Lagos in the area of transportation, telecoms, real estate, marine sustainability, entertainment, renewable energy, waste management, water, agriculture and car manufacturing, with up to N190 billion investment in the pipeline.\nPersonnel from these relevant MDAs with required approval authority will all be in the office to Fast-track the ease of granting these approval,” she said."
  },
  {
    "headline": "Ortom to Buhari: Cattle routes, open grazing ideas of 1950s not 21st Century",
    "summarized_story": "By AbankulaGovernor Samuel Ortom of Benue has slammed the Buhari government’s insistence on open grazing and cattle routes, saying they are ideas that were prevalent in the 1950s and no longer tenable in the 21st century.\nIn a statement released by Ortom’s spokesman Terver Akase, Ortom said Buhari’s insistence on open grazing reserves was curious.\nThe Buhari Presidency on Monday queried the legality of the ban on open grazing by governors in the entire southern part of the country.\n“As it stands, the Presidency is the lone hand pushing for the continuation of open grazing and the return of cattle routes of 1950s and 60s.\nAccording to the United States Department of Agriculture, USDA, India has 303 million cattle, Brazil, 226 million, China, 100 million, USA, 93 million, Argentina, 53 million and Australia 27 million."
  },
  {
    "headline": "BREAKING: Suicide Bomber Strikes Near Primary School In Ebonyi",
    "summarized_story": "According to Vanguard, a suspected suicide bomber detonated explosives in Ebonyi on Tuesday.\nAccording to witnesses in the area, the attack happened around 12:00 p.m. near a primary school in Afikpo community, Afikpo North Local Government Area.\n“He attempted to enter Amaizu/ Amangballa Primary School, but was turned away by school security since he could not justify his presence.\n“He quickly began rushing inside an adjacent bush before a loud bang was heard,” a witness told Vanguard.\nThe incident comes as Nigerian troops hunt down suspected IPOB members in Ebonyi and other parts of the country’s south-east, where separatist agitations have grown in recent weeks."
  },
  {
    "headline": "BREAKING: Recovered £4.2m Ibori Loot Returned To Delta — Accountant-General",
    "summarized_story": "The £4.2 million looted by a former Governor of Delta State, James Ibori, which the Federal Government recently repatriated from the United Kingdom, has been restored to the state, according to the Accountant General of the Federation, Mr. Ahmed Idris.\nIdris revealed this in Abuja on Tuesday when he testified before the House of Representatives’ Ad hoc Committee on Assessment and Status of All Recovered Loots Movable and Immovable Assets by Agencies of the Federal Government of Nigeria for Effective Efficient Management and Utilisation from 2002 to 2020.\nThe Accountant-General, who was interrogated for nearly an hour by the committee, maintained that funds plundered from a state’s treasury are always restored to the state.\nStates can sue the federal government to recoup such payments, he added.\nMore details later…"
  },
  {
    "headline": "BREAKING: Cholera Outbreak Kills 20 People In Bauchi",
    "summarized_story": "In Bauchi State, a new cholera outbreak has killed at least 20 people in different regions of the state.\nAccording to reports, 322 people have been affected with the sickness.\nDuring a press conference on Tuesday morning, the State Commissioner for Health, Dr Aliyu Mohammed Maigoro, provided an update on the situation.\nSince the first case was reported in April, he said, the disease has spread to nine local government regions.\nThe index instance, according to the Commissioner, was a 37-year-old patient admitted to Burra General Hospital on April 24, 2021."
  },
  {
    "headline": "Breaking – OML 118: FG to rake in $780m in revenues as NNPC, SNEPCo, others sign multi-billion dollar deep-water agreement",
    "summarized_story": "The five agreements signed include, Dispute Settlement Agreement, Settlement Agreement, Historical Gas Agreement, Escrow Agreement and Renewed PSC Agreement.\nAccording to him, this is an indication of “a renewed confidence between NNPC and her partners; between the Government and the investing communities which include NNPC.\n“Ultimately, these agreements will engender growth in our country where investment will come in for other assets, not just in the deep-water, but even for new investors.\nIt is an opportunity for them to see that this country is ready for business,” the GMD enthused.\n“Today, we have signed agreements that define the future of deep-water for Nigeria."
  },
  {
    "headline": "Pictures: President Buhari presides over extraordinary summit of the Lake Chad Basin Commission in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Gunmen invade, burn another Police station, 5 dead",
    "summarized_story": "Another Police station located in Iwollo Oghe Police station in Ezeagu local government area of Enugu state has been invaded and burnt on Tuesday morning.\nUp to five persons, including police personnel were feared killed in the attack that saw the police facility totally razed.\nIt was also learnt most of the vehicles and other property in the premises were burnt down.\nAlready, Police Public Relations Officer in Enugu state Daniel Ndukwe has confirmed the attack but could not give further details as at the time of filling this report.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Electronic giant bags Red Dot award for excellence in product design -NigPilot",
    "summarized_story": "Electronic giant, LG has bagged the Red Dot award for its strength in consumer product design and quality for most of its products across the globe.\n“Among the most meaningful is the honor bestowed upon LG designer appliances in the Materials and Surfaces category for their implementation of color, material, and finish CMF.\n“Introduced as a bold reimagining of conventional appliances, LG’s designer appliance is a melding of technologically advanced home appliances with premium materials that can be customized to meet the specifications of each customer.\nOther honors include recognition for LG WashTower™, a single-unit, vertical laundry solution that frees up more floor space while handling ultra-large loads, for exceptional design.\nThe Red Dot Design Award is one of the three most prestigious professional design competitions in the world and the distinctive mark has become established internationally as one of the most sought-after seals of quality for exceptional design.."
  },
  {
    "headline": "Environmental: LG to partner key stakeholders on improved planet -NigPilot",
    "summarized_story": "President, LG Electronics, Middle East & Africa Region, Mr. IL Hwan Lee has expressed the readiness to partner with key organizations with shared goals across the globe to promote an improved environment.\nAccording to him, LG’s pledge is to support stakeholders’ growth and independence through partnership.\nThe Achievement of the United Nations Sustainable Development Goals (SDGs) by 2030 is a Grand Challenge, especially for businesses.\n“As a responsible global corporate citizen, LG Electronics is set to contributing to the achievement of the SDGs as the main goal of its social contribution activities.\nSome of such that promote eco-friendly society include LG DUAL Inverter, LG NeON 2, LG WashTower and the CordZero M9 robot vacuum cleaner."
  },
  {
    "headline": "ARAN commends FG over efforts to recover stolen artifacts -NigPilot",
    "summarized_story": "Artifacts Rescuers Association of Nigeria , (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral.\nObalosa reiterated committment of his associations’ readiness to continue working with the Federal Government and all security agents in the country, assuring that all Nigeria’s treasures will be returned."
  },
  {
    "headline": "Film producers drums support for APGA aspirant -NigPilot",
    "summarized_story": "The Chairman Board of Trustees (BOT), Association of Music, Film Producers and Marketers of Nigeria, (AMFPMN) , Mayor Uzoma Ubaoha said that Dr. Okwudili Christopher Ezenwankwo is the only credible aspirant among other aspirants within the All Progressive Grand Alliance (APGA).\nHe however cautioned All progressive Grand Alliance (APGA) not to make a serious mistake in giving the ticket to any other person instead of Dr. Okwudili Christopher Ezenwankwo.\nIt is not being done to give any body who is not a home based and never laboured for the party ticket to sell the party over-night.\nDr. Ezenwankwo has led the entire Anambra Markets and did marvelously well.\nWe in the music industry wants him, traders needs him because he consolidated all Anambra Markets and mingled with the common people,” he said."
  },
  {
    "headline": "Ibori’s £4.2m Loot Returned To Delta State Govt – Accountant-General",
    "summarized_story": "The Accountant General of the Federation, Ahmed Idris on Tuesday said the £4.2m looted by ex-Delta State Governor, James Ibori, has been returned to the state.\nAccording to him, any recovery arising from looted funds from a particular state would go directly to the states.\n“It was paid to Delta State,” he said when asked where the money was diverted to.\nHonourable Chairman, any recovery arising from the looted funds from a particular state goes to the state.\nThe state governors will not even allow this to fly.”READ ALSO: FG Expects £4.2m Ibori Loot From UK Govt SoonHe added, “Some recoveries are for some state governments, specific state governments."
  },
  {
    "headline": "FG’s Insistence On Open Grazing Points To A Hidden Agenda – Benue Govt",
    "summarized_story": "Benue State Governor, Samuel Ortom on Tuesday said the Federal Government’s insistence on open grazing suggests it has a hidden agenda.\nThe Presidency had on Monday faulted the recent resolutions of the Southern Governors, including the ban on open grazing in the entire southern part of the country.\nThe Southern Governors, the Benue leader added, adopted ranching as the alternative method of rearing animals.\nHe added, “As it stands, the Presidency is the lone hand pushing for the continuation of open grazing and the return of cattle routes of 1950s and 60s.\nBesides, the international best practice of animal husbandry is ranching; and that’s the stand of Benue State.”"
  },
  {
    "headline": "CBN Retains Monetary Policy Rates At 11.5%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has again voted to retain the monetary policy rate at 11.5 percent.\nThe announcement was made by the CBN governor, Godwin Emefiele during a press briefing at the CBN headquarters on Tuesday.\nHe explained that the move is expected to allow further economic growth, after the country exited recession in the fourth quarter of 2020, amid rising inflation.\nThe MPC also noted that at least 70% of Nigeria’s population must be vaccinated if the country means to achieve economic recovery.\nResponding to questions on the CBN ban on cryptocurrency transactions in Nigerian banks, the CBN governor insisted that the encrypted nature of cryptocurrency transactions makes it hard for fraud to be investigated and criminals apprehended."
  },
  {
    "headline": "Gunmen Kill Four Police Officers, Burn Down Station In Enugu",
    "summarized_story": "Gunmen on Tuesday attacked Iwollo Oghe Police Station in Ezeagu Local Government Area of Enugu State, killing four officers.\nThe officers died of gunshot wounds sustained in a gun duel while trying to repel the attack.\nAn investigation has been launched into the attack to fish out the assailants and their cohorts.\nEarlier in April, two officers were killed in an attack on a police station in Adani, Uzo-Uwani Local Government Area of Enugu State, raising concerns over incessant assaults on security formations in the largely peaceful South-East region.\nTo curtail these attacks, the Inspector-General of Police (IGP), Usman Baba last week launched a special operation designed to restore peace to the South-East."
  },
  {
    "headline": "Army To Hold Passing Out Parade For Recruits One Week After Attahiru’s Death",
    "summarized_story": "The Passing Out Parade (POP) of the 80 Regular Recruit Intakes (RRI) has been postponed to May 29 following the death of the Chief of Army Staff (COAS), Lt.-Gen. Ibrahim Attahiru.\nAttahiru, alongside 10 other senior military personnel died last week Friday in a plane crash in Kaduna State.\nAudu Arigu, Assistant Director, Army Public Relations, Nigerian Army Depot, announced the postponement via a statement on Tuesday.\nThe ceremony was originally scheduled for May 22 with the late Army chief supposed to serve as Reviewing Officer and Special Guest of Honour.\nHe said the event was the climax of the recruits’ intensive training, adding that the ceremony showcases the height of military discipline and regimentation."
  },
  {
    "headline": "Ebonyi State Government denies suicide bomber explosion, says incident was an accident",
    "summarized_story": "Ebonyi State Government has denied that there was a Suicide Bomber explosion in the state.\nThe Ebonyi State Government, Southern, Nigeria has flayed the reports that a particular suicide bomber had detonated explosives attached to his body in the state.\nHe said “My attention has been drawn to a news making the round in some section of the media that there was an explosion of a suicide bomb in Afikpo, Ebonyi State this afternoon.\n“A similar incident equally occurred in front of the Ebonyi State Old Government House as some mobile police officers were servicing their APC machine.\n“Furthermore, Ebonyians and residents of Ebonyi State are reminded that generating and spreading of fake news aimed at causing panic in the state is actionable."
  },
  {
    "headline": "Bandits Kill Ten In Five Zamfara Communities Unspecified number of Persons Abducted -",
    "summarized_story": "Bandits have killed ten persons and several others were abducted in five Zamfara communitiesThe Communities are Dandamji, Gidan Runji, Doka, Yanmadanga and Yarkatsina all in Bungudu local government area of the stateThe bandits invaded the communities Monday evening on motorcycles with sophisticated weaponsUnspecified number of persons were abducted and livestock were also taken awayThe spokesperson of the Zamfara State Police Command Shehu Mohammed Confirmed the incident to TVC NEWSAdvertisementHe says troops are on the trial of the criminals to ensure the safe return of the abducted persons."
  },
  {
    "headline": "Nigeria Needs to Localise Police to Keep Up with Armed Non-state Actors: Tanwa Ashiru",
    "summarized_story": "Tanwa Ashiru, a security and intelligence analyst, and a US Air Force veteran who worked in the Department of Defense and the US National Security Agency spoke to ARISE News on Nigeria’s security challenges and possible solutions.\nThese include the framework for a national dialogue, the import of ISWAP and Boko Haram joining forces, and localising police to help subdue armed non-state actors.\nWatch this insightful video for more."
  },
  {
    "headline": "Education Key to Unlocking the Potential in Africa’s Music Industry: Godwin Tom",
    "summarized_story": "Godwin Tom is an African entertainment industry change agent constantly driving innovations in management within the music and entertainment industry.\nFounder of Music Business Academy for Africa and CEO iManage Africa Entertainment Limited,he hascover 18 years as a talent manager and business executive and has practical experience at management level in marketing, public relations, image consulting, branding, and publishing.\nOver the years, he has successfully worked with or managed talents such as Wizkid, Davido, Waje, MI, Wande Coal, Bez, Ice Prince, Show Dem Camp, to mention a few.\nBringing professionalism to the entertainment industry with an understanding of the demands of a business environment, he is now introducing The Music Business Academy for Africa 2021, a platform dedicated to training and developing an informed and empowered workforce for Africa’s entertainment industry.\nHe speaks with Seyitan Atigarin in this interview."
  },
  {
    "headline": "Nigeria: Repatriated £4.2m Ibori Loot ‘Returned to Delta State’",
    "summarized_story": "Nigeria’s Accountant-General, Ahmed Idris says the recently repatriated £4.2 million loot recovered from a former governor of Delta State, James Ibori and his associates has been returned to the state government.\nThe Accountant General of the Federation told members of the ad hoc committee of the House of Representatives that the money was returned to the state to avoid litigation against the federal government.\nSome recoveries are for state governments, and when they come, we will send them to the state governments, including the Ibori loot.\n“The recovery of the Ibori loot was paid to Delta state.\nThe states will not allow their monies to be taken; they will take us to court, and we don’t joke with that.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria: Gunmen Kill Four Police Officers in Southeastern Enugu",
    "summarized_story": "Gunmen in the early hours of Tuesday attacked the Iwollo Police Division in Ezeagu Local Government Area of Enugu State and razed the station.\nThe Commissioner of Police in Enugu State, Mr Mohammed Aliyu, who confirmed the attack in a statement said he was already on ground to ascertain the level of destruction and casualties.\nThe eyewitness said that the attack threw the entire Iwollo community into fear and panic throughout the night.\nRecall that on April 21, unknown gunmen shot two police operatives dead during an attack on Adani Police Station in Uzo-Uwani Local Government Area of Enugu State.\nThe station was also set ablaze completely at about 2:30 am."
  },
  {
    "headline": "US to Reopen Jerusalem Consulate, Upgrading Ties with Palestine",
    "summarized_story": "The US will reopen its Consulate General in Jerusalem — a move that restores ties with Palestinians that had been downgraded by the Trump administration.\nTrump’s move infuriated the Palestinians, who view east Jerusalem as occupied territory and the capital of their future state.\nBlinken announced the step after a meeting with Palestinian President Mahmoud Abbas in Ramallah, in the occupied West Bank.\nHe later announced nearly $40 million in aid to the Palestinians, including $5.5 million in emergency assistance for Gaza.\nThe truce remains tenuous since tensions are still high in Jerusalem and the fate of the Palestinian families is not yet resolved."
  }
]