[
  {
    "headline": "Monkeypox can be transmitted through sex, says NCDC",
    "summarized_story": "Monkeypox, a disease endemic to West and Central African countries, can be transmitted through sexual intercourse, the Nigeria Centre for Disease Control has warned.\nThis is as a medical virologist and immunologist noted that the disease is deadlier in patients suffering from other diseases.\nThe PUNCH reports that Monkeypox, a rare disease that is caused by infection with the monkeypox virus, belongs to the Orthopoxvirus genus in the family Poxviridae.\nThe World Health Organisation, in a statement it released last week, noted that the outbreak of the Monkeypox disease is being discovered in countries where it is not endemic.\n“They can also occur in and around the genitals which is why contact during sex is one mode of transmission."
  },
  {
    "headline": "Critical APC stakeholders support my presidential ambition, says Fayemi",
    "summarized_story": "Governor of Ekiti State, Dr. Kayode Fayemi, has described as false insinuations in some quarters that he may be asked to step down as presidential aspirant of the All Progressives Congress in ensuring the party produces a consensus candidate.\nThe governor said he was favourably positioned and had the backing of the real stakeholders in APC ahead of the presidential primary election to clinch the APC ticket.\nBut Fayemi in a statement issued in Abuja by the Head of Media and Spokesperson of his Fayemi Presidential Campaign Organisation, Femi Ige, described the report as “absolute rubbish.”He said, “No meeting took place between us and any aspirant about stepping down.\nWe are undoubtedly among the leading aspirants for the position and one to watch in the race.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Electricity workers reject inaugurated TCN board",
    "summarized_story": "*Say members are politicians, not professionalsBy Victor Ahiuma-YoungELECTRICITY Workers in the country have rejected the inaugurated Board of Transmission Company of Nigeria, TCN, claiming members are politicians instead of professionals.\nThe workers under the aegis of the National Union of Electricity Employees, NUEE, in a statement yesterday, contended the new board would worsen the power situation in the country.\n“In inaugurating a Board for TCN and the need to revamp the ailing Power Sector, it is pertinent to enquire what the terms of reference issued to them are.\n“This brings to bare numerous questions begging for answers concerning the composition of the TCN Board.\nThe Power Sector has to be salvaged and in doing so, we must square pegs in square holes.”"
  },
  {
    "headline": "EFCC arrests 92 internet fraud suspects in Port Harcourt",
    "summarized_story": "Soni DanielOperatives of the Port Harcourt Zonal Command of the Economic and Financial Crimes Commission have arrested 92 suspected internet fraudsters (aka Yahoo Boys) in a sting operation in the early hours of Wednesday, June 1, 2022, at various locations in Port Harcourt, Rivers State.\nThe 92 suspects were arrested for alleged internet fraud activities at locations including Choba and Ada George axis of Port Harcourt, Rivers State, following an intelligence report.\nA statement by the EFCC Spokesman, Wilson Uwujaren, and made available to Vanguard on Friday, said that the analyses of the devices recovered from the suspects established that 64 of the suspects have incriminating items in their phones and emails.\nTallick, Prosper Osadebameh, Prince Onyebuchi Ifeanyi, Gift Henry, Miracle Danien, Anyaeri Chidiebere, Udechukwu Ezenna, Udechukwu Victor, Favor Kelechi, Ernest Chidubem, Endurance Erebo, Chigozie Emeonye and Precious Enomah.\nThe indicted suspects will be charged to court as soon as the investigation is concluded"
  },
  {
    "headline": "EFCC gets direct access to 114m INTERPOL criminal records",
    "summarized_story": "The agreement on Direct Access to and Use of Interpol Information Systems, grants the EFCC unrestricted access to nine key global databases containing 114 million records of 195 countries hosted by the Interpol on its i24/7 secure global records and communication system.\nThe global criminal databases that the EFCC now has unhindered access to, include:i. Nominal Database containing records of personal data and the criminal history of people subject to request for international police cooperationii.\nStolen and Lost Travel and Identity Documents (SLTD) Database containing information on travel and identity documents reported as stolen, lost revoked, invalid or stolen blankiii.\nTravel Documents Associated with Notices (TDOWN) Databases, containing records of all extracted information from all Interpol Noticesiv.\nFingerprints Database grants authorized users in member countries access to view, submit and cross-check records in the fingerprints database via a user-friendly automatic fingerprint identification system (AFIS)viii."
  },
  {
    "headline": "Intensify efforts to free Mama Africa from DSS – IPOB leader, Nnamdi Kanu tells Legal team",
    "summarized_story": "By Chinonso AlozieThe detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, on Friday urged his legal team to intensify efforts to see to the immediate release of Ukamaka Ejezie (Mama Biafra) who was allegedly detained by the Department of State Services, DSS.\nKanu made this statement in Owerri, through his lead counsel, Ifeanyi Ejiofor, after they had visited him (Kanu) at the DSS facility last Thursday.\nTo achieve this, the IPOB leader directed that all the legal parties should step up in the direction of ensuring she would be freed.\nAccording to IPOB legal team, “Consistent with the subsisting Court-Ordered guideline, we visited our amiable Client – Onyendu Mazi Nnamdi Kanu, today.\nWe implore you all to intensify your supplications and prayers, as it is impacting so positively UMUCHINEKE.”"
  },
  {
    "headline": "Buhari departs Madrid for Abuja after 3-day official visit",
    "summarized_story": "President Muhammadu Buhari departed Madrid on a return journey to Abuja on Friday at the end of a three-day state visit.\nBuhari met with President Pedro Sanchez as well as the Spanish monarch, His Majesty King Felipe VI, on Wednesday.\nAccording to him, for quite a number of decades, Spain has been one of Nigeria’s most important trade partners.\nAlso on Thursday, President Buhari hosted representatives of the Nigerian community in Spain, including professional footballers and some Spanish investors with interests in Nigeria.\nOthers were Kenneth Omeruo Super Eagles international who plies his trade with Leganes FC, Madrid and Obinna Okafor, a football agent."
  },
  {
    "headline": "Oyo terminates appointments of waste collectors",
    "summarized_story": "The Oyo State Government has terminated the appointment of waste collectors in the state.\nOni, while addressing the gathering, reiterated that the new initiative was conceived in order to actualize the vision of keeping the state clean.\nHe further assured residents of the state that the state government was taking holistic measures to ensure that the state experiences a turnaround in the environmental sector.\nHe also announced that the State Governor, Engr Seyi Makinde has approved the appointment of a new waste management consultant.\nShe enjoined all the stakeholders to work with the state government in actualizing this agenda."
  },
  {
    "headline": "We’ll conduct all-inclusive census – National Population Commission",
    "summarized_story": "The National Population Commission (NPC) has assured of conducting an all-inclusive census, insisting that everyone within the boundaries of Nigeria must be enumerated during the 2023 Population and Housing Census.\nNasir Isa Kwarra, Chairman of NPC, stated this while declaring open a workshop on a special population survey in Mararaba, Nasarawa State.\n“Practically, it means that everyone within the boundaries of the Federal Republic of Nigeria must be enumerated in the 2023 Population and Housing Census(PHC).\nMs. Ulla Mueller, Country Representative, United Nations Population Fund (UNFPA) assured of the UN’s support in the conduct of a reliable, credible, and acceptable census in Nigeria.\nHe pointed out that the 2023 PHC has provided the opportunity for NPC to re-write the history of the census in Nigeria as the forthcoming census is the first digital census."
  },
  {
    "headline": "2023: Politics doesn’t respect history – Shehu Sani reacts as Tinubu claims he made Buhari president",
    "summarized_story": "Former lawmaker, Senator Shehu Sani, has told a presidential aspirant of the All Progressives Congress (APC), Chief Bola Tinubu, that politics doesn’t always respect history.\nSani said this while reacting to the claim by Tinubu, the Jagaban of Borgu Kingdom, that President Muhammadu Buhari would not have emerged as the president in 2015 without his support.\nTinubu had yesterday claimed that without his support, President Buhari would not have won the 2015 election.\nSpeaking in Ogun State, Tinubu said, “If not for me that led the war from the front, Buhari would not have emerged as the president.\n“But I went to his home in Katsina, I told him you would contest and win, but you won’t joke with the matters of the Yorubas."
  },
  {
    "headline": "Abba Kyari to know fate in extradition battle with FG Aug 29",
    "summarized_story": "The judge fixed the date on Friday after taking arguments for and against the suit by the parties involved.\nKyari, whose arguments were presented by a Senior Advocate of Nigeria SAN, Nureni Jimoh, asked the court to refuse the extradition request on the ground that he committed no offense to warrant the Federal Government to ferry him to America.\nIn the two letters tendered in court, Kyari explained that the purpose was to give confidence to the suspected fraudster and lure him to come to Nigeria where an ambush was already laid for a sting operation by his own strike force.\nBesides, he informed the court that American authorities once commended him for the commitment he was exhibiting in the battle against internet fraud.\nHowever, the Federal Government, represented by Mr Pius Akuta, urged the court to discountenance the arguments of the defendant."
  },
  {
    "headline": "Spain trip: Buhari departs Madrid after 3-day visit",
    "summarized_story": "President Muhammadu Buhari departed Madrid, Spain, on a return journey to Abuja on Friday at the end of a three-day state visit.\nAt the meeting with President Sanchez, Nigeria and Spain signed nine Agreements and Memoranda of Understanding covering a Treaty on mutual legal assistance in criminal matters and the transfer of sentenced persons and extradition.\nOn Thursday, President Buhari attended a Political and Business Leaders Forum, jointly organised by the Spanish Chamber of Commerce, the Ministry of Trade, and the Confederation of Employers.\nAccording to him, for quite a number of decades, Spain has been one of Nigeria’s most important trade partners.\nAlso, on Thursday, President Buhari hosted representatives of the Nigerian community in Spain, including professional footballers and some Spanish investors with interests in Nigeria."
  },
  {
    "headline": "BREAKING: Court sends late Osinachi’s husband to Kuje prison",
    "summarized_story": "A High Court of the Federal Capital Territory (FCT) in Wuse has ordered the remand of Peter Nwachukwu, the husband to the late gospel singer, Osinachi, in the Kuje prison.\nJustice Ngozi Nwosu-Iheme, in a ruling on Friday, ordered that Nwachukwu remains in custody until the conclusion of his trial.\nShe granted accelerated hearing and adjourned till June 16 at 12 noon for the commencement of trial.\nOsinachi was a lead gospel singer at the Dunamis Church, Abuja until her death.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: INEC releases guidelines for 2023 polls",
    "summarized_story": "The Independent National Electoral Commission (INEC) has released the legal framework that will guide the 2023 general elections.\nINEC Chairman Professor Mahmood Yakubu, said with the presentation of the Regulations and Guidelines, the Commission has concluded formal preparations for the polls.\nHe said it is the first time the Commission is releasing the guidelines nine months to the general elections.\nDetails Shortly…"
  },
  {
    "headline": "Visit to Spain: Let’s buga for Mr President, by Femi Adesina",
    "summarized_story": "And having been with President Muhammadu Buhari in Madrid, Spain, since Tuesday, I decided to use the headline above, with due credit to Kizz Daniel and Tekno.\nPresident Buhari told them of what he would like to see at the All Progressives Congress (APC) primary to elect a presidential candidate early next week.\nPresident Buhari was also to be hosted by the King of Spain, His Majesty King Felipe V1.\nThey must have seen that President Buhari has no loot stashed in any part of the world.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "Three siblings found dead in parked car",
    "summarized_story": "Three siblings have been found dead inside a parked car they were playing in at Owode Elede area of Ikorodu, The Nation has learnt.\nIt was gathered that they had entered a parked Hyundai Accent car with registration number BDG404CL to play at 16, Gbamire Street, Owode Elede, and couldn’t come out of the vehicle.\nIt was however not clear how long they stayed inside the vehicle before their bodies were discovered by some visitors of the car owner.\n“Apparently, the children were not in the care of anyone else, the person in charge of them would have looked for them before their mother returned from the market,” said a source.\nConfirming the incident, police spokesman, SP Benjamin Hundeyin said operatives attached to Owode Onirin received information around 7pm on Thursday that the young siblings were found inside the car lifeless."
  },
  {
    "headline": "Buhari departs Madrid after three-day visit",
    "summarized_story": "President Muhammadu Buhari has departed the Spanish capital, Madrid, for the journey back to Abuja, after a three-day State visit.\nThe President, who arrived on Tuesday, departed Torrejon Airbase, Madrid around 8 am on Friday.\nWhile in Madrid, Buhari met with the Spanish President, Pedro Sanchez as well as the monarch, His Majesty King Felipe VI.\nDuring his meeting with President Sanchez, Nigeria and Spain signed some nine agreements and Memoranda of Understanding (MoU), including Treaty on Mutual Legal Assistance in criminal Matters; Transfer of Sentenced Persons; Extradition; Economic and Commercial Cooperation; Tourism.\nHe later on hosted and addressed representatives of the Nigerian community in Spain, including professional footballers, and some Spanish investors with interests in Nigeria."
  },
  {
    "headline": "Osinachi’s Death: Court remands Husband, Nwachukwu in Kuje Prison,",
    "summarized_story": "Justice Njideka Nwosu-Iheme made the remand order after his arraignment before the trial court.\n“Defendant should be remanded in Kuje Correctional Facility pending the hearing and determination of this suit,” she ruled.\nNwachukwu’s wife died on April 8 and many of her colleagues had accused her husband of subjecting the deceased to domestic violence, leading to her death.\nIt alleged that the defendant, Nwachukwu, had at a time, forcefully pushed his late wife out of a moving vehicle.\nSome of the counts (like culpable homicide) recommends death penalty, 1-year jail term or fine (VAPP Act), among others."
  },
  {
    "headline": "2023: Coalition drums support for Atiku",
    "summarized_story": "From Ndubuisi Orji, AbujaA coalition of Persons with Disabilities in the Peoples Democratic Party (PDP) has said the party’s 2023 president candidate, Atiku Abubakar, has the wherewithal to lead the country out of poverty, if voted as president in next year’s elections.\nChidi Olujie, who spoke with journalists,in Abuja, said the emergence of Atiku as PDP presidential candidate at the party’s convention, has strenghtened its resolve to win the 2023 polls.\n“T he special delegate convention to elect our Presidential Flag-Bearer, has strengthened our party and demonstrated our leader’s readiness to take over the affairs of this country come 2023.\nThis singular gesture will undoubtedly remain the cornerstone of our Association as a party that is ready to take leadership.\n“We are committed to engaging, mobilizing, and actualizing the Atiku Presidency come 2023."
  },
  {
    "headline": "APC govs meet again on Buhari’s successor",
    "summarized_story": "By Wilfred EyaFour days to the presidential primaries of the All Progressives Congress (APC), 22 governors of the ruling party are expected to meet again this weekend in Abuja to decide on President Muhammadu Buhari’s successor.\nThe governors, he said, have become jittery that President Buhari and APC might lose at the poll if the procedure for electing the ruling candidate was not transparent.\nAbout five northern governors were alleged to be behind the new plot to cause confusion.\nSome of the APC governors, especially those on second term, do not subscribe to the imposition of APC presidential candidate.\nHe made the appeal when he had audience with the APC governors and the National Chairman of of the party, Senator Abdullahi Adamu."
  },
  {
    "headline": "Troops eliminate 14 terrorists, arrest 15, rescue 100 family members",
    "summarized_story": "The Defence Headquarters, yesterday, said that troops of Operation Hadin Kai had, in the past two weeks, eliminated 14 terrorists and arrested 15 others.\nHe said that 100 family members of terrorists in the North East, comprising 33 women and 67 children, were also rescued by the troops.\nHe said the terrorists fled in disarray due to the superior fire power of the troops and abandoned their properties and family members.\nThe defence spokesperson further said that troops also recovered a dump truck belonging to the Borno State Road Maintenance Agency.\nOnyeuko said further that troops on patrol in Ashigashiya, Kodele, and Apagaluwa in Gwoza Local Government Area, encountered terrorist-herders, who engaged the former in a fierce gun battle."
  },
  {
    "headline": "Kalu appointed DG of Lawan Campaign Organisation",
    "summarized_story": "The Ahmad Lawan Central Campaign Organisation has announced the Chief Whip of the Senate, Sen. Orji Kalu as its Director-General ahead of the 2023 general elections.\nHe added that the campaign organisation would ultimately lead Lawan to victory in the general election.\nChairmen of eight committees of the Campaign Organisation are Auwal Lawan, Chairman, Finance and Budget and Senator Sani Musa, co-chairman, Strategy and Planning, Senator Ikechukwu Obiora, chairman, and Senator Betty Apiafi, deputy chairman.\nSen. Aliyu Sahabi Abdullahi and Femi Fani Kayode would serve as chairman and deputy chairman of Media and Publicity, respectively.\nSecurity and Intelligence has Mallam Lawal Daura–Chairman and Commodore Mohammed Barau (retd) as deputy chairman."
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "Buhari Would Have Lost Presidential Election Fourth Time In 2015 If Not For Me – Tinubu",
    "summarized_story": "One of the presidential aspirants of the All Progressives Congress (APC) and former Lagos State governor, Bola Tinubu, says he led a political struggle that produced President Muhammadu Buhari in 2015.\nHe spoke at presidential lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primaries.\nSpeaking on Buhari’s emergence, he said “If not me that led the war front, Buhari wouldn’t have emerged.\nHe told Tinubu that delegates from the state would do “the right thing” at the convention.\nAbiodun described Tinubu as a political warrior, serial winner and strategist."
  },
  {
    "headline": "BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, Nzenwa",
    "summarized_story": "An Appeal Court sitting in Abuja has affirmed that human rights activist and presidential aspirant, Omoyele Sowore, is the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nThe court therefore set aside the judgment of the lower court recognising Nzenwa as acting Chairman.\nThe court further awarded the sum of N200,000 damages against Nzenwa in favour of Sowore.\nIt would be recalled that Nzenwa secretly obtained a judgment from the FCT High Court on June 19, 2019, to the effect that Sowore had been suspended as the National Chairman of the party alongside Deputy National Chairman, Dr. Malcom Fabiyi."
  },
  {
    "headline": "BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, Nzenwa",
    "summarized_story": "An Appeal Court sitting in Abuja has affirmed that human rights activist and presidential aspirant, Omoyele Sowore, is the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nThe court therefore set aside the judgment of the lower court recognising Nzenwa as acting Chairman.\nThe court further awarded the sum of N200,000 damages against Nzenwa in favour of Sowore.\nIt would be recalled that Nzenwa secretly obtained a judgment from the FCT High Court on June 19, 2019, to the effect that Sowore had been suspended as the National Chairman of the party alongside Deputy National Chairman, Dr. Malcom Fabiyi."
  },
  {
    "headline": "‘Condom infection’: Court rejects FCT school’s request to halt probe of pupil’s death",
    "summarized_story": "An Abuja court has struck out an application by Premiere Academy Lugbe seeking to stop a probe of the circumstances that led to the alleged rape and death of Keren Akphagher, one of its students.\nA report issued to the family by Queen’s Hospital Abuja stated that decomposed condom particles and dead sperm were found in the girl’s vagina.\nThe house of representatives had also directed that a DNA test be conducted on the male staff at Keren’s school so as to fish out the culprit.\nAfter Keren’s death, Vivien Akphagher, her mother, had lodged a complaint at the Federal Competition and Consumer Protection Commission (FCCPC).\nBut on Friday, the Abuja federal high court struck the request to halt FCCPC’s investigation into the case."
  },
  {
    "headline": "KWASU student posing as US widow jailed 3 years",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has secured the conviction of a student of Kwara State University (KWASU) Malete.\nAdvertisementThs student, identified as Aderibigbe Sheu, has been sentenced to three years imprisonment.\nSheu was said to have posed as a widow resident in the United States to defraud unsuspecting victims.\nAdvertisementFollowing his guilty plea, Rasheedat Alao, counsel to the EFCC, reviewed the facts of the case and tendered the extra-judicial statements of the defendant.\nIn his judgment, Sani pronounced Sheu guilty of the charge and sentenced him to three years imprisonment with the option of a fine in the sum of N982,403."
  },
  {
    "headline": "UI, Oniru beach… Google lists Nigerians most clicked sites in the past year",
    "summarized_story": "Google has released data showing the most clicked sites in Nigeria over the past year to mark its 15th street view anniversary.\nAdvertisementThe data, released on Thursday, examined the most clicked beaches, museums, and general points of interest in the country.\nAccording to Google, Oniru Beach Resort in Lagos ranked the most visited beach in Nigeria during the period under review.\nThe statement also showed the National Museum in Benin city, Edo state, was the most clicked museum in Nigeria in the past year.\nAdvertisementA further breakdown showed the most clicked place of interest in the country was the Bariga Waterfront Jetty followed by Nike Art Gallery, and Lekki Conservation Centre respectively."
  },
  {
    "headline": "‘My in-law was found dead in Imo boarding school’ — rapper Ikechuwku cries foul",
    "summarized_story": "Ikechuwku Onachukwu, the Nigerian rapper, has demanded justice for his wife’s cousin who he said was found dead inside the boarding house of an Imo state catholic school.\nThe rapper also called for an investigation and autopsy to be carried out before the burial of the late boy.\n“Earlier on today, I put up a post about Obinna and his tragic passing.\nAdvertisementHe said the school involved is Queen of the Holy Innocent Secondary School, Ogwume in Ideato LGA.\nHe was found at 1 am dead in the boarding house at this school."
  },
  {
    "headline": "BBNaija reunion: Peace opens up on her social media absence",
    "summarized_story": "Peace Ogor, ex-housemate of the 2021 Big Brother Naija (BBNaija) reality TV show, has revealed the reason behind her long absence from social media.\nAdvertisementThe reality star spoke during the BBNaija reunion show which premiered on Thursday night.\nOgor said she needed the break in order to make new strategies and plans.\nOgor emerged as the first head of house (HOH) for the BBNaija ‘Shine Ya Eye’ edition.\nAdvertisementThe reality star had earlier disclosed that she avoided dating on the reality show because she didn’t want to limit herself."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Founder of Babymigo speaks on reducing maternal deaths in Africa",
    "summarized_story": "Kemi OlawoyeThe role of tech in improving maternal healthcareHA: How big of a role do you think tech can play in improving maternal health in Nigeria?\nHA: What singular aspect of maternal healthcare in Nigeria do you think needs the most urgent intervention?\nHA: What are the things you believe will accelerate the growth of the maternal health sector in Nigeria?\nKO: The first thing will be to identify policies and interventions that affect outcomes in terms of maternal and child health.\nIn the next 3 years, we hope to provide healthcare services to 10 million mums across the African continent."
  },
  {
    "headline": "Patricia’s CEO on taking risks and building for impact",
    "summarized_story": "He’d received a gift card worth ₦30,000 (~$73), in 2015, from his uncle in the US, in lieu of a monthly allowance.\nNeeding to exchange the gift card for cash, he went online to transact with a gift card exchange, only to fall victim to a scam.\nGift card scams are commonplace: users are asked to disclose the card’s number, unwittingly granting the scammer access to its funds.\nFor the next 2 years, from 2017 through 2018, Patricia would operate as a gift card exchange.\nIn 2019, Fejiro transitioned Patricia from gift card exchanging to a line that he found to be blossoming in popularity and demand: crypto trading."
  },
  {
    "headline": "Losing everything to find a gem",
    "summarized_story": "So, today I’ll talk about:How Ademi found a gem in cryptoSwvl Kenya’s intra-city rides suspensionM-Pesa’s GlobalPay Visa virtual cardHow Ademi found a gem in cryptocurrencyHow much money can you lose before it becomes unbearably painful?\nSee, I understand that life is full of uncertainties, but losing $10,000 on a volatile investment is a no!\nNonetheless, Swvl Kenya has started rolling out a product that will allow commuters to use the platform for long-distance travel.\nThe M-Pesa GlobalPay Visa virtual cardEarly M-Pesa usage.\nSource: Vodafone webisteYesterday, June 2, 2022, Visa, digital payments giant, and Safaricom, Kenya’s leading telco, launched the M-Pesa GlobalPay Visa virtual card."
  },
  {
    "headline": "Even after a $10,000 loss, this crypto trader found a gem in the crypto space, and she’s never letting go",
    "summarized_story": "This is what an expert crypto trader who identifies simply as Ademi asks anyone who wants to make money from crypto.\nEven after losing $10,000, she still sticks to crypto trading as a career.\nStarting with the 2017 bull marketPhoto by CardMapr.nl on UnsplashA crypto bull market is a time when the value of crypto assets keeps rising.\nHowever, a bear market — what comes at the end of a bull market — is what separates the newbies from the experts.\nHowever, just as Bitcoin reached the $20,000 limelight, it was followed by a 30% drop that bloodied the entire crypto market."
  },
  {
    "headline": "Talk360’s $4 million seed",
    "summarized_story": "Today, I’ll be discussing:How Victoria Fabunmi helps founders get capitalTalk360’s $4 million seedAppetito’s acquisitionHow Victoria Fabunmi helps founders get capitalVictoria Fabunmi.\nIf you want to understand how the Venture Capital market works, look for his story every Wednesday at 12 p.m. WAT!\nPerhaps you’re wondering how to get started in venture capital; wonder no more!\nCheck them out here: How Victoria Fabunmi helps startup founders get capital to drive growthTalk360’s $4 million seedTalk360, South Africa’s international calling platform, had announced a $4 million seed round.\nThe company wants to use some of its funding to build its own payment platform to make payment and checkout easier for its African users."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Missing Crown: Prosecution Counsels Express Fear Over Magistrate’s Neutrality – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Prosecution counsels in the case involving Chief Ayirimi Emami and the Commissioner of Police have expressed lack of confidence on the neutrality of the Magistrate trying the matter at the Warri South Magistrate Court.\nThe aggrieved counsels consequently want the case to be tried by another Magistrate in the court alleging bias by the presiding Magistrate Ejiro Diejomaoh (Mrs).\nThis application was vehemently opposed by the defence counsel, Chief Otomewo arguing that there was no provision for the use of Statement on Oath at the Magistrate’s Court.\nIt is also on record that the Magistrate had never recorded Chief Ariyo as a Chief even though Chief Ariyo announces himself as such.\nThe Prosecution counsels, however, said that they had tried to distinguish between an objection arising from the lack of neutrality of a court and other forms of objection."
  },
  {
    "headline": "Obaseki strengthens ties with German govt for investments in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is in talks with key Ministries, Department and Agencies (MDAs) of the German Government to discuss areas of mutual collaboration, highlighting untapped investment opportunities in different sectors of the state’s economy, including agriculture, healthcare, technology and education, among others.\nThe series of meetings being held in Germany are facilitated by GIZ-Skye, aimed at strengthening existing partnerships between the two governments in job creation, youth development, arts and culture as well as investments in industries and the productive sector.\nThe governor also met with the Association of German Chambers of Industry and Commerce (DHK) to discuss areas of partnership for investment and employment promotion in Edo State.\nHe is expected to be meeting with senior officials of the German government to foster relations between Edo State and Germany.\nObaseki’s visit to Germany is the latest of the series of investment trips embarked on by the Governor to attract investments into the state to grow its economy."
  },
  {
    "headline": "FIDA Edo marks week, pushes for end to GBV – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The International Federation of Female Lawyers (FIDA), Edo State Branch has kicked against gender based violence (GBV), as statistics from the Directorate of Public Prosecution (DPP) showed that of its 1,059 cases in court, 205 pertained to GBV cases with 4-10 of such cases originating from Police case files.\nDeclaring the FIDA week open which ran with the theme, “Changing the narrative of gender based violence: A multidimensional approach, “Chief Judge, Edo State, Hon.\nJustice Joe Acha represented by Justice Geraldine Ono Imadegbelo said violence against women, girls and children should be treated under the violence against persons prohibition (VAPP) Law.\nEarlier in her welcome address to stakeholders, legal luminaries and representatives of organizations, CSO’s, NGO’s and the media at the FIDA occasion, Chairperson Edo FIDA, Mrs. Violet Oghogho Olumese stated that apart from counselling and rendering Pro bono services to indigents, FIDA was poised to change the narrative in incidents of GBV through reliance on the VAPP Law as domesticated in Edo State in 2021.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo IRS,Security Agencies set to embark on Vehicle Verification Exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State lnternal Revenue Service in conjunction with relevant Security Agencies has concluded plan to embark on motor Vehicle particulars verification exercise soon.\nA Statement signed by Abu Sadat, Acting Head, Edo State lnternal Revenue Service and made available to The NIGERIAN OBSERVER in Benin City yesterday noted that the exercise would hold across the State and federal government ministries, Departments and Agencies ( MDAs).\n” We will need your support in this regard by informing your Staff to update their Vehicle documentation”,the statement addedWhile soliciting for the maximum cooperation of those concerned, the release further hinted that the exercise would be needed to make Edo State motorists fully compliant with motor vehicle Administration law, adding that the exercise may be carried out on private vehicles in the respective Government MDAs premises.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "CBN instructs banks to demand indemnity for online transfers above N1m",
    "summarized_story": "The Central Bank of Nigeria (CBN), has directed banks and payment service providers (PSPs) to accept indemnity from customers for highly secured online funds transfer.\nThe CBN said the directive is applicable on transfers amounting to N1 million for individual customers and N10 million for corporate customers.\nIt, however, set a maximum limit on the transferable amount at N25 million for individual customers, and N250 million for corporate customers.\n“Implement electronic indemnity with stricter controls requiring biometric verification of identity.\n“Adhere to multiple-factor authentication for highly secured online funds transfer."
  },
  {
    "headline": "Buhari never asked govs to help him pick successor – Femi Adesina",
    "summarized_story": "Femi Adesina, presidential spokesman, has dismissed suggestions that President Muhammadu Buhari asked members of the Progressives Governors’ Forum to pick a consensus presidential candidate for the ruling All Progressives Congress.\nHe said President Buhari told them of what he would like to see at the APC presidential primary to elect a presidential candidate early next week.\nHe said, “No word about zoning, consensus, or imposition of candidate.\nHe asked the governors to ensure that all interests ‘converge’ as regards the outcome of the presidential primary.\nThe President added that the person who emerges as the presidential candidate must be one who could give Nigerians a sense of victory even before the polls."
  },
  {
    "headline": "VIDEO: Buhari would not have become president without me – Tinubu",
    "summarized_story": "Bola Tinubu, presidential aspirant and chieftain of the All Progressives Congress (APC), has said President Muhammadu Buhari would not have become president of Nigeria in 2015 without his support.\nTinubu, a former Lagos State governor who spoke in Yoruba, noted that President Buhari, prior to 2015 had contested for president several times and lost.\nThe former governor who spoke to APC delegates in Abeokuta, Ogun State on Thursday, said, “If not for me that led the war front, Buhari won’t have emerged.\nI will stand with you and you will win but you won’t joke with the matters of the Yorubas.\n“I don’t want them to just mention me in history books for nothing,” Mr Tinubu said."
  },
  {
    "headline": "Ibrahim Magu, ex-EFCC boss accused of corruption decorated as AIG",
    "summarized_story": "Former chairman of the Economic the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu has been decorated as an assistant inspector-general of police (AIG).\nMagu who was suspended over corruption allegations and subsequently replaced by Abdulrasheed Bawa, had been promoted by the police service commission (PSC)The former EFCC boss was accused of abuse of office and engaging in corrupt practices by Abubakar Malami, the attorney general of the federation.\nThe PSC spokesperson, Ikechukwu Ani while speaking on the promotion in a statement released on the 16th of May revealed that Magu had missed the last two promotions despite being the most senior CP of his cadre.\nThe Inspector-General of Police, Usman Baba on Thursday decorated Magu at the police headquarters in Abuja, with Magu’s wife in attendance.\nThis is coming after the force confirmed that Magu had retired from the Nigeria Police Force (NPF), having clocked 60, the mandatory retirement age on May 5."
  },
  {
    "headline": "Newly acquired Union Bank appoints Gumel board chair, Amray CEO",
    "summarized_story": "Union Bank of Nigeria Plc has announced the appointment of Mr Mudassir Amray as its new Chief Executive Officer (CEO) and Mr Farouk Mohammed Gumel as Board Chairman/Non-Executive Director, effective June 2, 2022.\nThe appointments followed the reconstitution of the bank’s Board of Directors on the completion of acquisition of its majority shareholding by Titan Trust Bank (TTB).\nTitan Trust Bank acquired 93.41 percent of Union Bank’s issued share capital in a transaction that commenced in December 2021, thus transferring the control of the bank to the new majority shareholder and core investor.\nThe regulatory authorities were further notified of the resignation and subsequent retirement of the erstwhile 10-man Board of Union Bank, led by Mr Emeka Okonkwo, CEO, and Mrs Beatrice Hamza Bassy, Chair/Non-Executive Director.\n“Prior to being appointed the Chief Executive Officer for Union Bank, Mr. Amray led the establishment of Titan Trust Bank Limited and subsequently became the Bank’s pioneer CEO in October 2019."
  },
  {
    "headline": "EFCC Arrests 39 Suspected Cyber Fraudsters In Oyo",
    "summarized_story": "Operatives of the Ibadan Zonal Command of the Economic and Financial Crimes Commission (EFCC) on Wednesday, June 1, 2022, arrested 39 suspected internet fraudsters in a sting operation in Ibadan, Oyo State.\nThe suspects who claimed to be undergraduates of different tertiary institutions in Ibadan were arrested at Apete area of the State capital, following useful intelligence on their cyber-fraudulent activities.\nHowever, following analyses carried out on their devices, incriminating documents, and messages of their fraudulent bank transactions were recovered from 34 of the suspects.\nOthers are: Egberongbe Adebayo Adedamola, Ajadi Ayinla Ibrahim, Ajeigbe Christian Toluwase, Alabi Daniel Oluwatosin, Olawooyin Taoheed Olakunle, Oguntuase Tope Francis, Salami Adam Akanfe, Olanrewaju Michael Damola, Kareem Afeez Alabi, Onuma Chidubem Williams, Rasaq Sodiq Olamilekan, Okusanwo Mayowa Daniel and Wahab Adebayo Abdullahi.\nADVERTISEMENTFive exotic cars, mobile phones, laptops were among the items recovered from the suspects"
  },
  {
    "headline": "EFCC Arrests 39 Suspected Cyber Fraudsters In Oyo",
    "summarized_story": "Operatives of the Ibadan Zonal Command of the Economic and Financial Crimes Commission (EFCC) on Wednesday, June 1, 2022, arrested 39 suspected internet fraudsters in a sting operation in Ibadan, Oyo State.\nThe suspects who claimed to be undergraduates of different tertiary institutions in Ibadan were arrested at Apete area of the State capital, following useful intelligence on their cyber-fraudulent activities.\nHowever, following analyses carried out on their devices, incriminating documents, and messages of their fraudulent bank transactions were recovered from 34 of the suspects.\nOthers are: Egberongbe Adebayo Adedamola, Ajadi Ayinla Ibrahim, Ajeigbe Christian Toluwase, Alabi Daniel Oluwatosin, Olawooyin Taoheed Olakunle, Oguntuase Tope Francis, Salami Adam Akanfe, Olanrewaju Michael Damola, Kareem Afeez Alabi, Onuma Chidubem Williams, Rasaq Sodiq Olamilekan, Okusanwo Mayowa Daniel and Wahab Adebayo Abdullahi.\nADVERTISEMENTFive exotic cars, mobile phones, laptops were among the items recovered from the suspects"
  },
  {
    "headline": "JUST-IN: INEC Releases Guidelines For 2023 Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has released the legal framework that will guide the 2023 general elections.\nINEC chairman, Prof Mahmood Yakubu, disclosed this on Friday in Abuja at a special meeting of the Inter-Agency Consultative Committee on Election Security (ICCES) to review security arrangements for the Ekiti State governorship election.\nYakubu said with the presentation of the Regulations and Guidelines, the Commission has concluded formal preparations for the polls.\nADVERTISEMENTAccording to him, “On several occasions, the Commission has assured Nigerians that we are finalizing the Regulations and Guidelines for the elections.\nHe said, “I led a team of INEC National Commissioners to Ekiti State early this week to assess the Commission’s preparations for the elections."
  },
  {
    "headline": "JUST-IN: INEC Releases Guidelines For 2023 Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has released the legal framework that will guide the 2023 general elections.\nINEC chairman, Prof Mahmood Yakubu, disclosed this on Friday in Abuja at a special meeting of the Inter-Agency Consultative Committee on Election Security (ICCES) to review security arrangements for the Ekiti State governorship election.\nYakubu said with the presentation of the Regulations and Guidelines, the Commission has concluded formal preparations for the polls.\nADVERTISEMENTAccording to him, “On several occasions, the Commission has assured Nigerians that we are finalizing the Regulations and Guidelines for the elections.\nHe said, “I led a team of INEC National Commissioners to Ekiti State early this week to assess the Commission’s preparations for the elections."
  },
  {
    "headline": "BREAKING: Court Remands Osinachi’s Husband In Kuje Prison",
    "summarized_story": "Peter was accused of killing his wife, Osinachi.\nThe court gave the order on Friday after he pleaded not guilty to 23 count charges bordering on domestic violence and homicide, among others.\n“The business for today is for arraignment, accelerated hearing is hereby ordered,” declared Justice Nwosu-Iheme.\nADVERTISEMENT“Defendant should be remanded in Kuje Correctional Facility pending the hearing and determination of this suit,” she ruled.\nSome of the counts (like culpable homicide) recommends death penalty, 1-year jail term or fine (VAPP Act), among others."
  },
  {
    "headline": "BREAKING: Court Sends Late Osinachi’s Husband To Kuje Prison",
    "summarized_story": "Peter Nwachukwu, the late gospel singer Osinachi’s spouse, has been remanded in the Kuje jail by a Federal Capital Territory (FCT) High Court in Wuse.\nIn a Friday judgement, Justice Ngozi Nwosu-Iheme ruled that Nwachukwu be held in custody until the end of his trial.\nThe judge made the decision after Nwachukwu pleaded not guilty to the 23-count indictment presented against him by the Attorney General of the Federation, which included domestic violence and homicide, among other things (AGF).\nShe granted an accelerated hearing and postponed the start of the trial until June 16 at 12 p.m.Until her death, Osinachi was the lead gospel vocalist of the Dunamis Church in Abuja.\nMore details later…"
  },
  {
    "headline": "How Saraki led campaign of calumny against me in 2015 – Tinubu",
    "summarized_story": "Presidential aspirant and National Leader of the All Progressives Congress, Bola Tinubu, on Thursday, narrated how former Senate President, Bukola Saraki, allegedly led a campaign of calumny against him in 2015.\nTinubu spoke at the Presidential Lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primary.\nThis is the first place I am saying this,” Tinubu who addressed the delegates in Yoruba said.\nAccording to him, Saraki’s campaign of calumny affected his emergence as the running mate of Muhammadu Buhari in the 2015 presidential election.\n“This is me telling you between me and God Almighty, Buhari called me to be his Vice President."
  },
  {
    "headline": "JUST IN: Without me, Buhari wouldn’t be president – Tinubu",
    "summarized_story": "Tinubu spoke at the Presidential Lodge in Abeokuta, the state capital, while addressing the APC delegates ahead of the party’s primary.\nSpeaking on Buhari’s emergence, he said “If not for me that led the war front, Buhari won’t have emerged.\n“This is me telling you between me and God Almighty, Buhari called me to be his Vice President.\nHe won’t get the Senate president because the Senate president cannot also be a Muslim; that was how they started the campaign of calumny against me.\nThat was how I nominated Vice President Yemi Osinbajo."
  },
  {
    "headline": "Tinubu’s TV station Deletes poll after Nigerians rated Osinbajo ahead of him",
    "summarized_story": "Ahead of the presidential primary of the ruling All Progressive Congress, APC, a now-deleted poll conducted by TVC, a Nigeria-based broadcast outlet, tipped Vice President Yemi Osinbajo as the favourite for the party’s ticket.\nAfter 1,721 people had voted, with Osinbajo leading with 43%, followed by Tinubu with 40%, Amaechi with 8%, and Lawan with 9% of the total votes cast, the tweet was deleted, Quest Times reported.\nIn related news, a Twitter handle “BiggDaaddyy1” known to be a dogged follower of the Asiwaju camp, and who was simultaneously hosting a Twitter space, had to delete his poll which asked: “Refusing Bola Tinubu APC ticket is a betrayal; YES or NO?”.\nA total of 1,763 people voted; 73 voted NO and only 27% voted YES.\nThis is not the first time the Vice President will defeat his opponents in an opinion poll, Quest Times reported."
  },
  {
    "headline": "Breaking: Court sends Osinachi’s husband to prison, orders accelerated trial",
    "summarized_story": "Peter Nwachukwu, husband to late popular gospel singer, Osinachi, has been sent to Kuje prison by a High Court of the Federal Capital Territory (FCT) sitting in Wuse.\nJustice Ngozi Nwosu-Iheme, in a ruling on Friday, ordered that Nwachukwu remains in custody until the conclusion of his trial.\nThe judge gave the ruling after Nwachukwu pleaded not guilty to the 23-count charge, bordering on domestic violence and homicide, among others, brought against him by the office of the Attorney General of the Federation (AGF).\nShe ordered that the suspect be remanded at the correctional facility while the trial was adjourned to June 16 and June 17.\nThe gospel singer died on April 8, and many of her colleagues had accused her husband of subjecting the victim to domestic violence, which led to her death."
  },
  {
    "headline": "TVC makes u-turn, quickly deletes Twitter poll after Osinbajo toppled Tinubu",
    "summarized_story": "A privately-owned television station, Television Continental (TVC), tried to beat a quick retreat to delete its own polls, when it became obvious that current Vice President, Yemi Osinbajo, dusted National Leader of the All Progressives Congress (APC), in the opinion poll it conducted on Twitter.\nThe poll centred on who would carry the day, eventually at the primaries of the ruling party, in which the former Governor of Lagos state, has filed out to contest against the VP and other contestants across the country, which kicks off in Abuja on Monday.\nAhead of the event, the popular TV station owned by Tinubu apparently shocked by the result, which tipped Osinbajo as the favourite for the party’s ticket, had to delete the result of the outcome, after seeking the opinions of Nigerians on who was more favoured among all the candidates.\nIt was discovered that after 1,721 people had voted, with Osinbajo leading with 43 per cent of votes cast, followed by Tinubu with 40 per cent, Amaechi with eight per cent, and Lawan with nine per cent of the total votes cast, the tweet was deleted.\nIn related news, a Twitter handle “@BiggDaaddyy1” known to be a dogged follower of the Asiwaju camp, and who was simultaneously hosting a Twitter space, had to delete his poll which equally got the same negative result."
  },
  {
    "headline": "Tinubu opens up: Without me Buhari won’t be president",
    "summarized_story": "The former Lagos state governor also went memory lane on how he ensured the emergence of Professor Yemi Osinbajo and Mr Dapo Abiodun as vice president and Ogun state governor respectively.\nOn his entourage were Lagos state Governor Babajide Sanwo-Olu, Kano state Governor Abdullahi Umar Ganduje and former Borno state governor, Senator Kashim Shettima.\n“This is me telling you between me and God Almighty, Buhari called me to be his Vice President.\nOn Governor AbiodunOn the current Ogun state governor, Tinubu also said without God and him, Abiodun would not have emerged governor in 2019.\nThe list also showed Kebbi state Governor Atiku Bagudu and Imo state Governor Hope Uzodinma of Imo state as co-chair of the election planning committee."
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "Why we reversed $3.1bn e-customs project – FG",
    "summarized_story": "By Mathew Dadiya, AbujaFederal Government has explained the reasons why the $3.1 billion contract for ‘complete automation’ of the Nigerian Custom Service, approved by the Federal Executive Council (FEC), in 2020 was reversed.\nIt clarified that disagreements between partners that formed a consortium for the project, delayed its takeoff despite efforts by the government through the office of the Attorney General of the Federation to mediate.\nAsked to explain the rationale behind a new e-Customs concession agreement between the NCS, Africa Finance Corporation (AFC) and China’s Huawei Technologies Limited, Ahmed said: “The E-customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements between the concession partners.\nAnd at the end of the day, I think one of the partners in the concession did not agree with the arrangements”, she stated."
  },
  {
    "headline": "INEC Launches Regulations, Guidelines For General Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has launched the regulations and guidelines for the conduct of general elections in the country.\n“With the coming into force of the Electoral Act 2022, it has become necessary to review the commission’s regulations and guidelines to govern the conduct of elections,” he said.\n“The Constitution of the Federal Republic of Nigeria 1999 (as amended), the Electoral Act 2022 and the regulations and guidelines constitute the electoral legal framework.\n“On several occasions, the commission has assured Nigerians that we are finalising the regulations and guidelines for the elections.\nBeside the general elections, the INEC chief also spoke about their preparations for the governorship elections in Ekiti and Osun States, as well as the Continuous Voter Registration (CVR)."
  },
  {
    "headline": "APC Primary: Osinbajo, Lawan In Last-Minute Push As Tinubu, Others, Talk Tough",
    "summarized_story": "Although his spokesperson, Laolu Akande, has yet to confirm this, the meeting was reportedly held on Thursday evening at the official residence of the Vice President in Abuja.\n“That was how I nominated Vice President Yemi Osinbajo, I surrendered my right to him.\nI was asked to submit three names – Yemi Cardozo, Wale Edun, and Yemi Osinbajo.”23 Aspirants For TicketAs part of activities lined up for its presidential primary, Osinbajo, Lawan, Tinubu, and 20 others had appeared before the John Oyegun-led APC Presidential Screening Committee.\nHe charged the governors to ensure that the party’s convention picks a presidential candidate that reflects all the values and virtues of the party.\nDespite the development within the party, Governor Oluwarotimi Akeredolu of Ondo State has insisted that the APC must zone its ticket to the South to retain the presidency in 2023."
  },
  {
    "headline": "Extradition: Court Fixes August 29 To Decide Abba Kyari’s Fate",
    "summarized_story": "Justice Inyang Ekwo of the Federal High Court Abuja has fixed August 29 for judgment in a suit seeking to extradite a suspended Deputy Commissioner of Police DCP, Abba Kyari to the United States of America for trial on alleged internet fraud.\nThe Judge fixed the date after taking arguments for and against the suit by the parties involved.\n[READ ALSO] Extradition: Court Grants Abba Kyari’s Request To File More EvidenceIn the two letters tendered in court, Kyari explained that the purpose was to give confidence to the suspected fraudster and lure him to come to Nigeria where an ambush was already laid for a sting operation by his own strike force.\nBesides, he informed the court that American authorities once commended him for the commitment he was exhibiting in the battle against internet fraud.\nCounsel to the Federal Government, Pius Akuta urged the court to discountenance the arguments of the defendant."
  },
  {
    "headline": "Without Me, Buhari Wouldn’t Have Become President – Tinubu",
    "summarized_story": "﻿A chieftain of the All Progressives Congress (APC) Bola Tinubu has recalled his role in the emergence of President Muhammadu Buhari in 2015, maintaining that the Katsina-born leader would have lost the election if not for his efforts.\nTinubu made the comment on Thursday while addressing party delegates at the Presidential Lodge in Abeokuta, Ogun State.\n“If not for me that stood behind Buhari, he wouldn’t have become the President.\nThe third, he failed,” Tinubu, one of the frontline aspirants for the APC presidential ticket, told the delegates.\nThat was how I nominated Vice President Yemi Osinbajo."
  },
  {
    "headline": "Abiodun Wouldn’t Have Been Ogun Governor Without Me – Tinubu",
    "summarized_story": "A presidential hopeful and chieftain of the All Progressives Congress (APC), Bola Tinubu, on Thursday explained the role he played in the process that led to the emergence of Mr Dapo Abiodun as the governor of Ogun State.\nAccording to the former governor of Lagos State, party stakeholders in Ogun had rejected Governor Abiodun as the APC governorship candidate in the build-up to the election, but for his intervention.\n“Dapo that’s sitting down here, could he have become Governor without me?” he queried while addressing the APC delegates in Yoruba during his consultation visit to Ogun, the home state of another presidential hopeful, Vice President Yemi Osinbajo.\nIn the build-up to the election, Governor Abiodun emerged as the APC candidate amid a reported dispute within the chapter of the party in the state.\nHe, however, lost to Governor Abiodun who is seeking to extend his term in office by another four years when his tenure ends in May 2023."
  },
  {
    "headline": "I will not step down, except by consensus, Okorocha vows",
    "summarized_story": "Former governor of Imo State and APC Presidential aspirant, Rochas Okorocha has denied jumping bail and/or not honouring EFCC invitation by the Economic and Financial Crimes Commission, EFCC.\nThe former governor of Imo state disclosed this while appearing on TVC News’ premium current affairs show, Journalists’ Hangout.\nSenator Okorocha said as much as he is not interested in discussing the matter any longer, insists it is important to clear some critical areas of the matter.\nAs a serving senator, EFCC could have approached the national assembly through the president and request my presence.\n2023 will be very interesting.”The former Imo state governor said he remains the only Southern APC aspirant who can win win votes in the north because of his record and he has done for them."
  },
  {
    "headline": "Makinde congratulates Atiku, says PDP determined to rescue Nigeria in 2023 -",
    "summarized_story": "Oyo State Governor, Seyi Makinde, said the Peoples Democratic Party (PDP) remains determined to rescue Nigeria from the throes of bad leadership.\nA statement by the Chief Press Secretary to the governor, Taiwo Adisa, indicated that the governor stated these in his weekly newsletter.\nNyesom Wike, said “we will play our part to ensure that the PDP’s Operation Rescue Nigeria is a resounding success.”He said: “As you already know, we had the People’s Democratic Party (PDP) primaries in which we again demonstrated two things to Nigerians:“One, that the PDP is serious about ensuring that we make the right decisions for Operation Rescue Nigeria.\nThe weaker party had to wait for the results of the PDP convention before they made their move.\n“Two, that the PDP stands head and shoulders above the rest in coordinating primaries at the state and national levels."
  },
  {
    "headline": "Kaduna PDP delegate lauded for sharing N7m with less privileged -",
    "summarized_story": "A People’s Democratic Party (PDP) delegate in Kaduna state Mr. Tanko Sabo, who shared part of the cash he received from his party’s aspirants among less privileged members of his community, has been lauded for his kindness.\nMr Tanko Sabo was one of the national delegates to the recent National Assembly, Governorship and Presidential primary election of the PDP.\nA former Special Adviser (SA) on Media to the late Kaduna State Governor Yakowa, Mr. Reuben Buhari, revealed that Mr. Sabo spent about 7 million Naira on indigent members of Sanga Local Government Area.\nHe was said to have paid the school fees of a couple of children and settled the hospital bills of others.\nMr Tanko Sabo had promised to support his community if chosen as a PDP delegate, a promise many say he has fulfilled."
  },
  {
    "headline": "Tinubu meets APC delegates in Oyo",
    "summarized_story": "Leading presidential aspirant on the platform of the All Progressives Congress, Asiwaju Bola Tinubu has met with the party’s delegates in Oyo State.\nHe was accompanied by the Governor of Kano, Abdullahi Ganduje, former Governor of Borno, Kashim Shettima, Speaker of Lagos Assembly, Mudashiru Obasa and other party Chieftains.\nThe presidential hopeful was received by the Governor of Lagos, Babajide Sanwo-Olu and other party loyalists in Oyo State.\nThe APC chieftain was cheered up by crowd of supporters and delegates as he engaged in conversations with them ahead of the forthcoming presidential primary.\nThe delegates gave their assurance that Asiwaju Tinubu will get their votes at the convention to be able to clinch the party’s ticket for the 2023 presidential election."
  },
  {
    "headline": "Atiku’s Running Mate: Wike, Ekweremadu, Bruce Join Race as Stakeholders Consider Okowa, Okonjo-Iweala, Udom, Anyim",
    "summarized_story": "New scenarios have emerged, as permutations to find a running mate for the Peoples Democratic Party (PDP) presidential candidate, Atiku Abubakar, intensifies.\nAlso, on the cards for consideration for the number two slot, are the Akwa Ibom State Governor, Udom Emmanuel, and a former Secretary to the Government of the Federation, Senator Anyim Pius Anyim.\nWike, Wednesday, reciprocated the visit to his residence by Atiku, when the governor visited the PDP presidential candidate at his Abuja residence.\nThe visit came in the wake of increasing speculations that Wike might join the race for consideration as running mate to Atiku.\nAside Wike, Ekweremadu and Bruce, party sources claimed, were also being considered as likely options, from both the South-east and South-south to balance the Atiku ticket."
  },
  {
    "headline": "200,000 Undetected Tuberculosis Infections Occur Annually in Nigeria, Says FG",
    "summarized_story": "The revelation came just as government said there was a 15 per cent increase in tuberculosis notification from 120,266 cases in 2019, to 138,591 in 2020.\nSimilarly, stakeholders in the campaign against tuberculosis scourge in Nigeria have advocated for increased local funding for tuberculosis intervention programme.\nHe said Nigeria was one of the few countries in the world to record an increase in tuberculosis case notification during the 2020 COVID-19 pandemic.\nHe expressed hope that the compendium would be a useful tool for all stakeholders, in the efforts to scale up tuberculosis control activities and to further maximise the yield from all our investments in tuberculosis control.\nHe used the occasion to pay tribute to those Nigerians who have contributed significantly to the efforts to eradicate tuberculosis in Nigeria, especially the deceased."
  },
  {
    "headline": "Nigeria’s Power Generation Cannot Support Economic Growth, Says Power Minister Aliyu",
    "summarized_story": "The Minister of Power, Mr. Abubakar Aliyu, Thursday admitted that Nigeria’s current electricity generation was incapable of powering the economy of over 200 million Nigerians.\nHe explained that power generation in the country had been about 5000 megawatts, stating that the country had been inconsistent in power generation.\n“As you are all aware, the electricity being delivered is not enough to support the level of our population,” Aliyu said.\n“So, I want to appeal to the chairman, who I know is a very experienced person with some other board members I have seen.\nThere’s a lot that you have to do in order to change the narrative in the power sector,” he said."
  },
  {
    "headline": "Nigeria will Be Secured for Businesses to Thrive, Buhari Assures Spanish Firms",
    "summarized_story": "President Muhammadu Buhari on Thursday in Madrid, Spain, met with two Spanish companies doing business in Nigeria and assured them of a safe, secured and prosperous Nigeria for businesses to thrive.\nAccording to him, Naturgy was interested in extending its relationship with Nigeria on gas, citing its 178 years experience in the business.\nThe president told the gathering of Spanish and Nigerian corporations and investors to look towards Africa for the opportunities therein.\nHe added that Nigeria was committed to increasing its volume of trade with Spain, even as Spain is currently one Nigeria’s strongest EU trading partners.\n“Since signing the African Continental Free Trade Agreement (AfCFTA) Nigeria is also a gateway to the wider African market."
  },
  {
    "headline": "Nigeria’s Production Quota Hits 1.8m bpd as OPEC Ups July Crude Allocation",
    "summarized_story": "The new oil drilling limit increased Nigeria’s production deficit by an estimated 400, 000 barrels per day, since the country has only been able to produce about 1.4 million barrels daily of the 1.8 bpd ration.\nThe cartel and its allies, OPEC+ would increase oil production by 648,000 barrels per day in July, as opposed to the 400,000 bpd initially approved and the subsequent increase to 432,000bpd.\nFrom the approved schedule, Saudi Arabia would drill 10.833 million barrels per day in July, same for Russia, while the UAE would produce 3.127 million barrels per day.\nIn the same vein, Angola would produce 1.502 barrels per day, Iraq would be 4.58 million bpd while Algeria was given a limit of 1.039 million bpd.\n“Advance the planned overall production adjustment for the month of September and redistribute equally the 0.432 mb/d production increase over the months of July and August 2022."
  }
]