[
  {
    "headline": "Countries need to be more ambitious in climate goals —UN",
    "summarized_story": "Countries that have signed up to the Paris accord to tame climate change need to be more ambitious in their own national efforts, the UN’s climate chief said on Saturday.\nOnly just over half of countries that are party to the accord have submitted updated proposals for limiting their carbon emissions, Patricia Espinosa said in a statement.\nAnd “the level of ambition reflected in those national climate action plans also needs to be enhanced,” she said.\nUnder the accord, every participating country originally had until the end of 2020 to submit new or updated “nationally determined contributions” or “NDCs”.\nThis can only be achieved through more ambitious NDCs,” Espinosa said."
  },
  {
    "headline": "Hushpuppi to be sentenced in October –US court",
    "summarized_story": "The United States Attorney’s Office at the Central District of California says that Ramon Abbas, aka, Hushpuppi, will be sentenced in October 2021.\nHushpuppi has recently pleaded guilty to various offences bordering on internet scam and money laundering, among others.\nThe court also confirmed that it ordered the FBI to arrest Deputy Commissioner of Police Abba Kyari, for his alleged role in a $1m scam allegedly perpetrated by Hushpuppi and five others.\n“Hushpuppi is currently scheduled to be sentenced in late October,” Mrozek stated.\nThe court official, however, did not disclose whether Kyari must be in court with Hushpuppi by late October."
  },
  {
    "headline": "Hushpuppi: Police Service Commission to carry out separate investigation on DCP Abba Kyari from IGP’s",
    "summarized_story": "A statement on the IGP’s directive titled, ‘Alleged Indictment of DCP Abba Kyari: Inspector General of Police Orders A Review of the Information’, was signed by CP Frank Mba, Force Public Relations Officer.\nIt read, “Sequel to the receipt of allegation and indictment processes from the Federal Bureau of Investigation (FBI) against one of the personnel of the Nigeria Police Force, DCP Abba Kyari, the Inspector General of Police IGP Usman Alkali Baba has ordered an internal review of the allegations.\nAccording to the source the PSC would carry out independent investigations irrespective of findings of the Police authorities on the bribe allegation against Kyari.\n“Yes it is true that we will wait for the full report of the investigation and it will be treated officially by the commission in accordance with the law.\nHowever, after sitting and coming out with the findings of their investigation, the findings are sent to the PSC, whose own investigations department sits and vets, for final decision."
  },
  {
    "headline": "APC Ward Congress: Due process not followed in Kano — National Party Chair aspirant alleges",
    "summarized_story": "By Bashir Bello, KanoA stalwart of the All Progressive Congress, APC who is aspiring for the position of National Party Chairman, Ahmad Mansir Aliyu has raised the alarm that due process was not followed to select consensus candidates in the ongoing APC ward Congress in Kano State.\nAliyu who spoke to newsmen at his Tarauni ward in Tarauni Local government area of Kano decried low turnout recorded during the Congress.\n“The turnout is low because some party members have pulled out or some aggrieved members are annoyed with the procedure.\n“So I call on the party stakeholders at national or state to make sure that we follow the party constitution and procedure so that we have progress in the party.\n“So I call on the party members let’s come out to support our party so that we will have prosperous future so that our party win the 2023 general elections,” Aliyu however stated."
  },
  {
    "headline": "Police cordon off Njaba forest after killing 2 hoodlums in Imo",
    "summarized_story": "By Chinonso AlozieThe Imo State Police command said it has cordoned off the Njaba Local Government Area of Imo State, after two suspected hoodlums were killed in a gun battle with the Police and others fled into the thick forest of Njaba with gun shot injuries.\nThe State Commissioner of Police disclosed this to newsmen at the Command’s headquarters in Owerri on Saturday.\nThe Police said they got intelligence that the hoodlums were on their way to Njaba to carry out attacks and they were intercepted by the operation restore peace of the Police and the hoodlums engaged the police in gun fire.\nHowever, the Imo police command has pleaded with the people of Njaba during this period to remain calm as the command has embarked on what the commissioner called “clearance operation” of the fleeing hoodlums.\nThe Police said: “On 31/7/2021 at about 01:20 hours, a convoy of bandits moving towards Njaba Town to launch an attack but were intercepted by Operation Restore Peace team of the Nigeria Police , Imo State Command."
  },
  {
    "headline": "HushKyari: Holy sinner in circle of thieves",
    "summarized_story": "Kyari, in spite of this allegation, must either prove his innocence or otherwise face the consequences for his sins should in case he is declared guilty.\nThe current predicament of Kyari can be best described as ‘holy sinner in circle of thieves’, and it will take only the grace and benevolence of Buhari’s regime to save him from this doom that is imminent.\nThe native clothes and caps (5 sets) were brought to our office and he sent somebody to collect them in our office.\nCould it be that Mr. Kyari is just a middleman between the embattled Nigerian socialite (Hushpuppi) and his accomplice?\nAs it stands right now, Kyari is just a suspect until found guilty by a competent court."
  },
  {
    "headline": "BDCs: With one stone Emefiele has shot at corruption, money laundering, terrorism",
    "summarized_story": "The CBN has managed BDCs like cancerous tumors for decades now, with little or no positive impact on the economy, especially naira.\nThe Central Bank of Nigeria, CBN, under the leadership of Godwin Emefiele has once again lived up to its core mandate of ensuring monetary stability and restoring investors’ confidence in the system.\nFunding of terrorism that is connected with black market forex transactions, will be limited to barest minimum.\nA nation like Nigeria battling hydra-headed monsters of terrorism, internet scams and corruption should be very strict with its foreign exchange market.\nI think Godwin Emefiele and his lieutenants at the apex bank should be commended and supported for this real courage."
  },
  {
    "headline": "Ikwerre people should allow others produce next Rivers governor in 2023 – Peterside",
    "summarized_story": "The former Director-General of the Nigeria Maritime Administration and Safety Agency, NIMASA, Dr Dakuku Peterside, has called on the people of Ikwerre ethnic nationality in Rivers State to allow other regions of the state produce the next governor in 2023.\nThe Ikwerre people will be completing a 16-year rule of the state in 2023 when the tenure of the incumbent governor, Nyesom Wike, expires.\n“Ideally, my brothers from the Ikwerre ethnic nationality should allow people from other parts of Rivers State take a chance or a shot at the governorship seat.\n“That does not deny them the chance of aspiring for the office of Governor of Rivers state.\nBut to accommodate others it’s only right and fair that other parts of the state should be given a chance,” he said."
  },
  {
    "headline": "PDP felicitates Taraba’s Gov Ishaku at 67",
    "summarized_story": "The Peoples Democratic Party (PDP) has felicitated the Governor of Taraba State, Arc.\nIn a statement by Kola Ologbondiyan, National Publicity Secretary of the party, on Saturday, the party said Ishaku has repositioned the state in line with PDP’s developmental ideology and vision.\n“Our party notes that as Governor of Taraba State, Arc.\nIshaku has repositioned and revolutionized the state along the critical sectors of life in line with the developmental ideology and vision of the PDP,” the statement read.\n“The PDP congratulates Governor Ishaku on this auspicious occasion and prays to God, in His mercies, to grant him many more decades in good health and wisdom in the service of humanity."
  },
  {
    "headline": "Imo: Police repel another attack, kill two bandits",
    "summarized_story": "The Imo State Police Command says its operatives killed two bandits in a crossfire in Njaba Local Government Area on Saturday.\nHe said one AK-47 rifle and an operational vehicle were recovered from the bandits during the gun duel.\n“On 31/7/2021 at about 0120 hours, a convoy of bandits moving towards Njaba town to launch an attack were intercepted by Operation Restore Peace team of the Nigeria Police.\n“They detonated an Improvised Explosive Device into the parking lots of a nearby Njaba Police Station causing minimal damage,” the statement read.\n“Residents should avail Police with information of persons seen treating bullet wounds or hiding within the community.“"
  },
  {
    "headline": "IPMAN threatens to suspend distribution of products in Port Harcourt, Enugu, Makurdi, others",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has threatened to suspend the supply and distribution of products within its designated Eastern zone effective Monday.\nDAILY POST reports that depots to which IPMAN supplies products in its designated Eastern zone are Aba, Port Harcourt, Enugu, Calabar and Makurdi.\nIPMAN moves against illegal oil theft, tanker roadblocksIt stated, “Following the series of unwarranted attacks by the police against IPMAN, Eastern Zone comprising the National Executive Committee of IPMAN resolved that members withdraw their services at these units/depots immediately until further notice.\nIt added, “On Friday, a group loyal to a parallel faction which lost out in the court was led to forcefully take over the IPMAN office at the Port Harcourt depot.\n“Dr Joseph Obele, the lawfully elected chairman of the depot was elected in October 2019 following an election which these people participated in."
  },
  {
    "headline": "Zamfara: Group demands Dansadua Emir’s sack over alleged involvement in banditry",
    "summarized_story": "No fewer than 150 people from Dansadua Emirate in Mari Local Government Area of Zamfara State demonstrated on Friday in Gusau, the state capital, for the dethronement of their Emir by the state government.\nThe group appealed to Matawalle to fully implement the report and finally sack the Emir of Dansadau, saying that it is a big insult to the traditional institution.\n“Dansadau emirate has been under fire by notorious bandits and kidnappers for the past one decade now.\nIt is no longer news that Dansadau has been the colony of banditry in Nigeria,” they lamented.\nDAILY POST also reports that the government suspended and arrested the Emir of Zurmi recently for also being involved in banditry activities."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Sammie, Angel get all cozy in jacuzzi after wager win",
    "summarized_story": "By Gbenga BadaBBNaija Shine Ya Eye housemates Sammie and Angel are fast taking their closeness to another height.\nThe feast declared by Biggie for the 22 housemates after winning their first wager task gave the two an opportunity to get all mushy and cozy in the jacuzzi.\nThe feast and the party had Sammie stuck like glue on Angel all through the night from the jacuzzi to the room.\nADVERTISEMENTObviously happy for Sammie’s performance during the task, Angel seemed to enjoy every moment.\nSammie, according to Biggie, deserved applause and an award for his brilliant performance in the task."
  },
  {
    "headline": "BBNaija Shine Ya Eye: I want to socialise but don’t know how to, Beatrice",
    "summarized_story": "By Adeniyi AdewoyinBig Brother Naija Shine Ya Eyes housemate, Angel has adviced Beatrice to step up her game in the house else, she would be evicted next week.\nBeatrice who broke down in tears had complained to Angel that she’s confused on how to socialize in the house making her feel uncomfortable.\nADVERTISEMENT“I don’t know what’s happening in the house.\nI want to socialize with everyone but don’t know how to,” said Beatrice while crying on Friday night.\nAdvising her, Angel said: “if you no vibe, them go nominate you and you dey go house next week.”"
  },
  {
    "headline": "Police repel another attack in Imo, kill two bandits",
    "summarized_story": "Agency ReporterThe Imo Police command says its operatives had killed two bandits during crossfire in Njaba Local Government Area on Saturday.\nThe Commissioner of Police, Mr Abutu Yaro, confirmed this in a statement signed by the command’s Spokesman, CSP Mike Abattam, a copy of which was made available to the News Agency of Nigeria (NAN) in Owerri.\nADVERTISEMENTHe said one AK47 riffle and an operational vehicle were recovered from the bandits during the gun duel.\n“On 31/7/2021 at about 0120 hours, a convoy of bandits moving towards Njaba town to launch an attack were intercepted by Operation Restore Peace team of the Nigeria Police.\n“They detonated an Improvised Explosive Devices into the parking lots of a nearby Njaba Police Station causing minimal damage."
  },
  {
    "headline": "Latest: Tested and Trusted platforms to Sell Gift cards, Bitcoin and Greendot in Nigeria DAVYCARDS",
    "summarized_story": "VERIFIED PLATFORMS FOR GIFT CARD TRADES TESTED AND TRUSTED081040661580808852864809024359660is the recommended platform to trade gift cards and Bitcoin securely in Nigeria and Ghana.\nThe country: The most traded gift cards are US cards, thus most US gift cards have high value.\nHowever, other countries like the UK, Canada, Australia, Singapore, Spain, Germany, Switzerland, Newzealand etc.. have their own gift cards too but not all their gift cards are good.\nConvert iTunes gift card to Naira or bitcoinConverting an iTunes gift card to Naira or bitcoin is very easy now.\nConvert Apple store gift card to Naira or bitcoinConverting apple store gift card to Naira or bitcoin is very easy now."
  },
  {
    "headline": "What you probably didn’t know about Blessing Okagbare",
    "summarized_story": "The body said Okagbare tested positive for the prohibited substance in an out-of-competition test on July 19 – four days before the Olympics opened.\nOn the senior national stage, she was a triple jump bronze medallist at the 2004 Nigerian National Sports Festival.\nHer first international outing came at the 2006 World Junior Championships in Athletics, where she performed in the qualifying rounds of both the long and triple jump competitions.\nIn May 2007, at the All-Africa Games trials in Lagos, she established a Nigerian record of 14.13 metres in the triple jump.\nOn July 27, 2013, at the London Anniversary Games, Okagbare set a new African record of 10.86 s in her 100 m race."
  },
  {
    "headline": "BREAKING: Mayhem in Imo as bandits behead 2 police officers, bomb station",
    "summarized_story": "From Stanley Uzoaru, OwerriThere was palpable fear in Umuaka, Njaba Local Government Area Imo State as group of bandits allegedly bombed the Umuaka divisional police station, police quarters as well allegedly beheaded 2 of the officers in an early morning attack on Saturday.\nHowever, police ‘Operation Restore Peace who got hint of the activities of the bandits attack at the station immediately swung into action, killing 2 of the criminals while others ran away.\nThe State Police spokesperson, Michael Abattam confirmed the attack at the station and the police killing of the 2 bandits but he could not confirm the beheading of his colleagues .\nHe promised to get back to our correspondent when confirmed.\nDetails shortly…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Veteran Nollywood actress, Rachel Oniga dies",
    "summarized_story": "Veteran Nollywood actress, Rachel Oniga is dead.\nOriginally from Eku, Delta State in Southern Nigeria, Rachel Oniga was born on 23 May 1957 in Ebutte Metta, Lagos State.\nShe worked briefly at Ascoline Nigeria Limited, a Dutch Consultant Company before her first movie titled Onome and her debut Yoruba movie was Owo Blow.\nOver the years, Rachel Oniga has featured in notable Nigerian films such as Sango, a movie scripted by Wale Ogunyemi, produced and directed by Obafemi Lasode and Wale Adenuga’s television series, Super story.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "APC ward congresses hold today – Malami",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee, has insisted that the proposed ward congress of the ruling party will hold today following the endorsement by the office of the Attorney-General and Minister of Justice, despite the crisis trailing the exercise.\nThe ruling party in its earlier statement had threatened to come hard on anybody involved in parallel congresses, stressing; “all activities or processes leading up to the congresses and thereafter which do not have the approval of the CECPC are exercises in futility.\n“So, our programmes will continue to roll on in the normal course of things.\nWe want to assure teeming members of the APC across the country to come out and elect officers at the ward level.\nThis party believes so much in grassroots politics, grassroots democracy; that is the strength of the party.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "APC congresses, exercise in futility – PDP",
    "summarized_story": "From Ndubuisi Orji, AbujaIn the aftermath of the split judgment by the Supreme Court on the Ondo State governorship poll, the Peoples Democratic Party (PDP), yesterday, placed a political caveat emptor on the All Progressives Congress (APC).\nThe PDP National Publicity Secretary, Kola Ologbondiyan, who spoke at a press briefing, in Abuja, said the APC has “become technically invalidated and now lacks the statutory structure” to continue to exist as a political party in our country.\nConsequently, the opposition spokesman admonished aspirants in the forthcoming APC ward, local government and state congresses and national convention to be wary of the ruling party.\nHe equally admonished aspirants hoping to contest the next general election on the platform of the APC as president, governor, federal and state legislators to beware.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "At 80, I still do exercises, cook, clean the house every day –Taiwo Ajai-Lycett, legendary actress",
    "summarized_story": "You can’t know what I’m thinking; I can’t know what you are thinking.\nThey don’t know the first thing about me.\nThere are exercises that I would do – exercises of the mind, exercises of having sharp memory and alertness.\n“Let your people know who you are, what you are doing, let them know you are representing them very well abroad.\nDon’t think that you are better than anybody."
  },
  {
    "headline": "Actress Rachel Oniga is Dead",
    "summarized_story": "By Vanessa ObiohaOne of Nollywood’s admirable actresses Rachel Oniga has died.\nOniga was a popular actress in both the English and Yoruba language film industry.\nUntil her death, the actress was said to have been on set for an upcoming movie.\nHer last Instagram post was a picture of her with the TV personality Denrele Edun at the premiere of ‘My Village People’ last month.\nBorn in Ebutte Metta in 1957, the Delta State actress celebrated her birthday last May."
  },
  {
    "headline": "Okagbare Suspended from Tokyo Olympics, Tests Positive for Dope",
    "summarized_story": "Nigeria’s Blessing Okagbare has tested positive to banned substance and has provisionally been suspended from the ongoing Tokyo Olympic.\nShe was due to compete in the semifinals of the women’s 100m this morning before the Athletics Integrity Unit (AIU) announced her suspension.\nThe AIU said in a statement issued this morning that the 32-year-old had tested positive for a human growth hormone following an out-of-competition test on July 19.\nIt stressed that Okagbare was notified of her provisional suspension this morning.\nThe AIU ruled they were unable to take part because of non-compliance with out-of-competition drug testing requirements in the run-up to the Olympics."
  },
  {
    "headline": "Banking on Malami’s Rule of Law, APC Holds Ward Congresses Today",
    "summarized_story": "We want to assure teeming members of the APC across the country to come out and elect officers at the ward levels.\nBuni said: “As stakeholders of the party, we have great responsibility to make the ward Congress in all the participating states successful.\nCourt Stops Imo CongressThe APC Ward congresses in Imo State have been stopped by an Abuja federal high court.\nAll action regarding APC congresses in the state are to be placed on hold, pending the hearing of the application slated for August 10.\nAmong the issues he wants the court to determine are: whether the APC can conduct a ward congress when there is no elected ward executive committee of the APC."
  },
  {
    "headline": "Kaduna Files Terrorism, Treasonable Felony Charges Against El-Zakzaky",
    "summarized_story": "Bayero said the fresh charges of terrorism and treasonable felony against El-Zakzaky would be jointly prosecuted by the Federal and Kaduna State governments.\nHe said: “The terrorism case was filed based on the utterances of El-Zakzaky, under section 17 (A) of the Terrorism Prevention Act 2013.\nHe will face a nine-count charge at the Federal High Court, Kaduna.\nWe couldn’t move forward quickly because the Federal High Court is on vacation.\nHe, however, admitted that a day before the judgement of the state High Court, there was an attempt to serve El-Zakzaky some court papers."
  },
  {
    "headline": "Royal Dutch Shell Commences Major Divestment of Assets in Nigeria",
    "summarized_story": "*Shallow water and onshore assets to be offloaded*Sale documents issued, EOIs due September 10Emmanuel Addeh in AbujaRoyal Dutch Shell has launched a major divestment of its Nigerian assets, especially those in the shallow water and onshore, several sources familiar with the matter said yesterday.\n“Discussions with the Nigerian government are ongoing on the next steps for our onshore business in Nigeria.\nThe source adds: “Alternatively, Shell may sell portions of equity in the whole of SPDC to different consortia of buyers.\nIn February, a Dutch court held Shell’s Nigerian subsidiary responsible for multiple oil pipeline leaks in the Niger Delta and ordered it to pay damages to farmers, leading van Beurden to call its Nigerian onshore assets a “headache”.\nIt owns 360 producing oil wells, 60 producing gas wells and a network of 4,000 kilometres of oil and gas pipelines and flowlines, according to the Shell website."
  },
  {
    "headline": "EXCLUSIVE: APC Leader, Tinubu Hospitalised In US, Undergoes Surgery",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently hospitalised in Maryland, the United States, SaharaReporters has learnt.\nIn January 2021, Tinubu was also reported sick and hospitalised in Paris, France.\nTinubu had earlier complained of exhaustion and had travelled out to rest before the news of his collapse gone viral.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age illnesses.\nSee Also Scandal 2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age“Tinubu is in Paris, France for a medical checkup."
  },
  {
    "headline": "EXCLUSIVE: APC Leader, Tinubu Hospitalised In US, Undergoes Surgery",
    "summarized_story": "The National Leader of the All Progressives Congress and former Lagos State Governor, Bola Tinubu, is presently hospitalised in Maryland, the United States, SaharaReporters has learnt.\nIn January 2021, Tinubu was also reported sick and hospitalised in Paris, France.\nTinubu had earlier complained of exhaustion and had travelled out to rest before the news of his collapse gone viral.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age illnesses.\nSee Also Scandal 2023: Tinubu In France For Medical Checkup, His Health Deteriorating Due To Old Age“Tinubu is in Paris, France for a medical checkup."
  },
  {
    "headline": "EXCLUSIVE: Inside Details Of FBI's Meeting With Inspector-General Of Police Over Embattled Officer, Abba Kyari, Hushpuppi",
    "summarized_story": "This was sequel to the revelations made by serial fraudster, Ramon Olorunwa Abbas, alias Hushpuppi, who recently pleaded guilty in the United States.\nTop sources in the IGP’s office told SaharaReporters that the FBI detectives were with the IGP office till he went for the Friday’s Juma’at prayers.\nThey added that Kyari was given till next week to formally respond to the allegations till his extradition to the US would be decided by the police authorities.\nThe FBI personnel were insistent and had a long meeting with the IGP till the close of work.\n“Abba Kyari was given till next week to respond to allegations."
  },
  {
    "headline": "EXCLUSIVE: Inside Details Of FBI's Meeting With Inspector-General Of Police Over Embattled Officer, Abba Kyari, Hushpuppi",
    "summarized_story": "This was sequel to the revelations made by serial fraudster, Ramon Olorunwa Abbas, alias Hushpuppi, who recently pleaded guilty in the United States.\nTop sources in the IGP’s office told SaharaReporters that the FBI detectives were with the IGP office till he went for the Friday’s Juma’at prayers.\nThey added that Kyari was given till next week to formally respond to the allegations till his extradition to the US would be decided by the police authorities.\nThe FBI personnel were insistent and had a long meeting with the IGP till the close of work.\n“Abba Kyari was given till next week to respond to allegations."
  },
  {
    "headline": "Hushpuppi Scandal: Abba Kyari Assembles Team Of lawyers, Threatens To Expose Other Police Officers If Extradited",
    "summarized_story": "Embattled Deputy Commissioner of Police, Abba Kyari, on Friday assembled a team of lawyers to fight off his looming arrest and extradition by the Federal Bureau of Investigation, United States, which appears to be hell bent in returning with the alleged fraudulent officer.\n“There was a stormy meeting on Friday at the Inspector-General of Police’s office between the IGP and police authorities and the FBI agents.\nKyari on his part is threatening that many senior officers benefited from his ‘generosity’ and if he’s betrayed, he would expose them.\nAbba Kyari is still being assured by the police hierarchy that he would not be extradited to the US.\nSaharaReporters since Thursday in several reports on Kyari exposed how Hushpuppi claimed to have offered bribes to the top police officer, going by court documents that were ordered unsealed."
  },
  {
    "headline": "'It will cause more suffering' — Ohanaeze Worldwide kicks against IPOB's sit-at-home order",
    "summarized_story": "Ohanaeze Ndigbo Worldwide, a sociocultural association, has kicked against the sit-at-home order by the Indigenous People of Biafra (IPOB).\nAdvertisementThe group is different from Ohanaeze Ndigbo, the more popular one headed by George Obiozor.\nAdvertisementBut in a statement by Okechukwu Isiguzoro, its secretary-general, Ohanaeze Ndigbo Worldwide said the sit-at-home order will further worsen the economic woes of the region.\nThe group asked IPOB to consult with key stakeholders in the south-east, including governors and traditional rulers before enforcing the order.\nAdvertisement“Southeastern governors should be consulted with other stakeholders including Igbo traditional rulers and market administrators to ascertain the consequences of sit-at-home orders in the past and the best strategies to free Nnamdi Kanu."
  },
  {
    "headline": "'It will cause more suffering' — Ohanaeze Worldwide kicks against IPOB's sit-at-home order",
    "summarized_story": "Ohanaeze Ndigbo Worldwide, a sociocultural association, has kicked against the sit-at-home order by the Indigenous People of Biafra (IPOB).\nAdvertisementThe group is different from Ohanaeze Ndigbo, the more popular one headed by George Obiozor.\nAdvertisementBut in a statement by Okechukwu Isiguzoro, its secretary-general, Ohanaeze Ndigbo Worldwide said the sit-at-home order will further worsen the economic woes of the region.\nThe group asked IPOB to consult with key stakeholders in the south-east, including governors and traditional rulers before enforcing the order.\nAdvertisement“Southeastern governors should be consulted with other stakeholders including Igbo traditional rulers and market administrators to ascertain the consequences of sit-at-home orders in the past and the best strategies to free Nnamdi Kanu."
  },
  {
    "headline": "Masari: I have no joy governing Katsina -- the insecurity is alarming",
    "summarized_story": "Aminu Masari, Katsina governor, says he has no joy governing a state plagued by insecurity.\nHe said the security situation in Katsina state has been giving him sleepless nights.\n“In this difficult time and uncertainty, all the issue of governance has been dominated by security matters from sunset to dawn.\nAdvertisementAccording to him, the insecurity level in Katsina is alarming, adding that “no sensible leader who has the feeling of his people at heart will be happy in such situation”.\n“Governing in this difficult time I see no joy that people are saying we are enjoying,” he said."
  },
  {
    "headline": "Masari: I have no joy governing Katsina -- the insecurity is alarming",
    "summarized_story": "Aminu Masari, Katsina governor, says he has no joy governing a state plagued by insecurity.\nHe said the security situation in Katsina state has been giving him sleepless nights.\n“In this difficult time and uncertainty, all the issue of governance has been dominated by security matters from sunset to dawn.\nAdvertisementAccording to him, the insecurity level in Katsina is alarming, adding that “no sensible leader who has the feeling of his people at heart will be happy in such situation”.\n“Governing in this difficult time I see no joy that people are saying we are enjoying,” he said."
  },
  {
    "headline": "Daily COVID Tracker: Nigeria's fatalities surge as NCDC logs 590 cases, eight deaths",
    "summarized_story": "Nigeria records 590 infectionsAdvertisementThe Nigeria Centre for Disease Control (NCDC) confirmed 590 COVID-19 cases across 17 states and the federal capital territory (FCT) on Friday.\nThe NCDC in its update said the report for Friday includes 12 cases reported for Niger state for July 28 and 11 cases for July 29.\nIt added that the report also contains cases reported for Delta state for July 10 (1), July 11 (1), July 13 (3), and July 29 (4).\nCurrently, Nigeria has 173,411 confirmed COVID-19 cases and 164,978 recoveries.\nTokyo Olympics logs 21 COVID-19 casesThe Tokyo Olympic organising committee on Saturday reported 21 COVID-19 cases linked to the games."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Airtel Africa receives $200 million to invest in network and sales infrastructure",
    "summarized_story": "It had also gotten a $100m investment from Mastercard in Airtel Mobile Commerce BV (AMC BV) in April.\nAirtel Africa says that QIA will hold a minority stake in the company while it retains the majority.\nComparing revenue from Q1 2020 with Q1 2021, Airtel saw a significant increase in revenue at $1.03b, dwarfing Q1 2020’s revenue of $899m by 21.7%.\nIts mobile money customer base went from 18.3 million in Q1 2020 to 21.7 million in Q1 2021, an 18.5% increase.\nHe also believes that the Sovereign Wealth Fund’s investment in Airtel Africa will contribute to sub-Saharan Africa’s financial inclusion."
  },
  {
    "headline": "Who puts out your IT fires when you’ve deleted an entire file from the company’s servers?",
    "summarized_story": "Share this article:Recently, the job of a system administrator — sometimes called a sysadmin or system admin — had begun to fascinate me.\nMy first experience with system administrators was with the technical support staff in the ICTU/CRPU unit of the University of Benin.\nAdvertisementWho are System Administrators?\nSystem Administrators troubleshoot all day, every day.\nHowever, according to Olusegun Balogun, an IT Support Specialist, you don’t necessarily have to have those degrees to become a system administrator."
  },
  {
    "headline": "How LoftyInc Capital invests, Dyslexia and assistive technology, Google’s app update",
    "summarized_story": "How LoftyInc Capital Management invests in Capital investsLoftyInc Capital Management Management Partners.\nThey are all LoftyInc Capital Management (LCM) portfolio companies, one of the oldest venture capital firms in Nigeria.\nThis is an excellent time to revisit it: The unique case of Africans with learning disabilities and assistive technology.\nGoogle has announced a new policy update on the Android Play Store to support user control, privacy, and security, beginning September 1, 2021.\nGoogle claims that with its User Data Policy update, it will be illegal to link persistent device identifiers to personal and sensitive user data or resettable device identifiers unless for pre-approved use cases."
  },
  {
    "headline": "Urban poverty shows Nigerians need social security, jobs",
    "summarized_story": "Economic activities are gradually picking up in Nigeria but the pace is not enough for jobs to be rapidly created, or for those who were disengaged to find replacements.\nThis is especially for urban dwellers who are the most hit by the COVID-19 pandemic, compared with their rural counterparts.\nThis is likely to see some…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The protestant: SS/21 collection of Ejiro Amos Tafiri",
    "summarized_story": "Like every other collection, the SS/21 collection of Ejiro Amos Tafiri, The Protestant, delves into storytelling that reflects hope, celebration and reconciled diversity.\nThis collection is a total documentation of the times we live in,” she tells me.\nEjiro Amos Tafiri, popularly called E.A.T, is an eponymous womenswear label founded by the very talented Ejiro Amos Tafiri.\nHowever, the pandemic struck and there became a purposeful lockdown in Lagos, Nigeria, which started during the mid-times of March, that year.\nAccording to the official PR statement of the brand;The Ejiro Amos Tafiri SS/21 is inspired by the course of the year as the pandemic hits."
  },
  {
    "headline": "The prosumer as a new market force",
    "summarized_story": "The term, prosumer, is an amalgamation of the terms ― producer and consumer.\nThe term, prosumer is not a new term.\nBut in the present times, the term, prosumer, has got a completely different meaning.\nThe term prosumer was created by modifying the term consumer.\nA prosumer has an enormous number of followers on social media and other internet platforms."
  },
  {
    "headline": "Edo govt begins awareness campaign on inactivated polio vaccine …inspects Benin Airport, insists on strict adherence to COVID-19 protocols – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Friday, kicked off a fresh campaign to enlighten residents on the need to immunize their children with the Inactivated Polio Vaccine (IPV) to guarantee full protection against Polio Mellitus.\nThe Edo State Deputy Governor, Rt.\nShaibu, while speaking with the Edo women on the need to vaccinate their children, noted that the inactivated polio vaccine provides additional and rapid immunity that covers all three types of polioviruses.\nHe however urged them not to neglect the Oral Polio Vaccine (OPV), adding that a combination of both the OPV and IPV provide stronger protection for the children.\nThe deputy governor was also at the Benin Airport to check protocols put in place by the airport management to prevent the importation of the Delta variant of coronavirus (COVID-19) into the state."
  },
  {
    "headline": "Obaseki vows to recover Edo taxpayers’ money looted through Benin Stormwater Project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…expresses satisfaction with progress of work on ongoing dualization of Ekehuan RoadBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has vowed that his administration will recover taxpayers money wrongfully spent on the Benin Stormwater Project.\nObaseki gave the assurance while on an inspection tour of ongoing construction of New Lagos Road, Textile Mill Road, 2nd West Circular Road and Ekehuan Road, all in Benin City, the Edo State capital.\nYou recall that I said I am going to probe that contract, but wanted to convince myself that it was not a case of witch-hunt.\nThe governor continued: “At Evbareke Market, there is supposed to be a road and drainage.\nYou are standing on very huge underground drainage and it has been covered, as you will not know that there is an extensive drainage under it."
  },
  {
    "headline": "Obaseki, UK High Commission brainstorm on strategies to sustain anti-human trafficking campaign gains – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Governor, Mr. Godwin Obaseki, has reiterated the commitment of his administration to sustain the gains made in the fight against human trafficking and irregular migration.\nThe governor made the submission during an event to mark the World Day Against Trafficking in Persons 2021, organized by the United Kingdom AID (UKAID) and the International Organisation for Migration (IOM).\nGovernor Obaseki said the state government has recorded tremendous progress in the fight against human trafficking, especially in the rehabilitation and resettlement of returning illegal migrants.\nAccording to him, “Our intervention to address the issue of human trafficking has been pragmatic and far-reaching.\nThe Edo State Government, in 2018, enacted the Edo State Trafficking in Persons Prohibition Law, as part of its over-arching strategy to combat the menace of human trafficking, after securing the support of traditional institutions in an aggressive campaign to drastically reduce the incidence of human trafficking in the state."
  },
  {
    "headline": "Obaseki unveils plan to make Edo one of Africa’s top 20 economies, rallies United Nations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has unveiled the Making Edo Great Again (MEGA) vision to the United Nations Country Team (UNCT) in Nigeria, outlining the government’s audacious plan to make Edo State one of the 20 top economies in terms of Gross Domestic Product (GDP) in Africa by 2050.\nThe governor, in a presentation titled, ‘The Edo Vision: From Who We Are To Where We Want To Be by 2050’, at the United Nations House, Abuja, noted that the state is harnessing its human and natural resources to place it as a leading destination for investment in Nigeria.\nHe added: “With an estimated population of 10 million residents by 2050, our educational system must be the best in Nigeria and we should boast of one of the best workforce on the continent.\n“This will be achieved through rigorous planning in regional and urban planning, which will point to and emphasize what we must do to attain double-digit growth over the next three decades, and socio-economic master plans to complement the physical master plans.\n“The government will ensure the sustenance of its massive investment in infrastructure to take advantage of the location of Edo."
  },
  {
    "headline": "BREAKING: Tokyo Olympics: More bad news for Nigeria as Oduduru gets disqualified",
    "summarized_story": "ADVERTISEMENTThere was more bad news for Team Nigeria on Saturday afternoon as one of Nigeria’s best athletics prospects, Divine Oduduru, was disqualified from the 100m men’s event for a false start.\nThe video replay showed America’s Fred Kerley had made a movement before the gun but it was Oduduru who was disqualified, starting from Lane 2.\nOn Saturday, Team Nigeria woke up to the news that 100m women medal hopeful, Blessing Okagbare had been handed a ban from the Olympics because of a failed drug test.\nMore to come…"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Unity Bank records N23bn gross earnings in H1 2021",
    "summarized_story": "Unity Bank Plc has declared half-year result posting gross earnings of 23.6 billion Naira, which is a 3% increase compared with the corresponding period of 2020.\nThe Bank grew bottom-line by 34% as Profit before Tax (PBT) moved up significantly in positive territory to close at N1.50 billion from N1.12 billion recorded in H2 2020.\nInterest and similar income also rose though recording a marginal 2% growth to close at N20.27 billion compared to the N19.79 billion recorded in half-year 2020.\nEarnings per share rose by 3 kobo to close at 11.82 Kobo within the period compared to 8.82 Kobo recorded in the corresponding period of 2020.\nThe financial report also contained the details of the three months to June 2021 (Q2 2021) report showed that the Bank recorded a 17% leap in gross income to N12.32 billion from N10.50 billion recorded in the corresponding quarter of 2020."
  },
  {
    "headline": "Anambra 2021: Ozigbo campaign org. hails Appeal Court ruling overturning sack State PDP executives",
    "summarized_story": "The Valentine Ozigbo Campaign Organisation has hailed the ruling of the Court of Appeal Abuja Division delivered a few minutes ago in the case of PDP vs Samuel Anyakorah & ORS.\nThe appeal was against the judgment of Justice Adeniyi of FCT High Court delivered on the June 9, 2021 wherein the court, against the earlier and subsisting judgment of Honourable Justice Musa of the same FCT High Court, recognised Samuel Anyakorah and his group as the valid executive committee of the party in Anambra state.\n“Valentine Ozigbo is grateful for all the support and encouragement, and goodwill he has received since he won the primary, especially from people of Anambra State, PDP Governors, and the leadership of the party at ward, local government, state and national levels.\n“We are resolute in our resolve to actualise our grand vision to rescue Ndi Anambra from the abysmal All Grand Progressives Alliance (APGA) government come November.\nA. Nwabunike judgement pending before the Court of Appeal in Awka Division is based on."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Osun PDP Chairmanship Tussle: Sunday Bisi hails High Court’s suspension of judgement till Appeal Court decides",
    "summarized_story": "Mr. Bisi stated this in a press briefing shortly after the judgment on Thursday at the party’s secretariat in Osogbo.\n“The intended distraction of dragging us to court in the first place is not an option for us.\n“Our practice since I took charge as chairman of this PDP is all about our people and the overriding interest of Osun State.\n“We have traversed the length and breadth of the state to reawake and reenergize structures and another support base for our party.\nIf there is going to be any change at all, it is our candidate becoming the next governor of Osun come next year."
  },
  {
    "headline": "JUST-IN: Police Neutralise 2 Bandits In lmo",
    "summarized_story": "The Imo State Police Command has neutralised two bandits in a gun battle in Njaba local government area of the State on Saturday.\nIn a release made available to LEADERSHIP, which was signed by the Police Public Relations Officer (PPRO), Michael Abattam, the bandits were incepted on their way to Njaba community.\nAccording to the statement, “on 31/7/2021 at about 0120 hours, a convoy of bandits moving towards Njaba Town to launch an attack but were intercepted by Operation Restore Peace team of the Nigeria Police, Imo State Command.\nADVERTISEMENT“In the ensuing fire fight, one of their operational vehicles was demobilised and two of them neutralised and the remaining ones scampered into the bush.\nCSP Abattam called on the residents of the area to avail Police with information of persos seen treating bullet wounds or hiding within the community and report same to the nearest police station."
  },
  {
    "headline": "JUST-IN: Police Neutralise 2 Bandits In lmo",
    "summarized_story": "The Imo State Police Command has neutralised two bandits in a gun battle in Njaba local government area of the State on Saturday.\nIn a release made available to LEADERSHIP, which was signed by the Police Public Relations Officer (PPRO), Michael Abattam, the bandits were incepted on their way to Njaba community.\nAccording to the statement, “on 31/7/2021 at about 0120 hours, a convoy of bandits moving towards Njaba Town to launch an attack but were intercepted by Operation Restore Peace team of the Nigeria Police, Imo State Command.\nADVERTISEMENT“In the ensuing fire fight, one of their operational vehicles was demobilised and two of them neutralised and the remaining ones scampered into the bush.\nCSP Abattam called on the residents of the area to avail Police with information of persos seen treating bullet wounds or hiding within the community and report same to the nearest police station."
  },
  {
    "headline": "Hepatitis: Rotary Club Sensitises, Screens Rivers Community",
    "summarized_story": "The Rotary Club of Trans-Amadi, Port Harcourt, Rivers State, on Friday, carried out sensitisation on Hepatitis and screening of residents of Okuru-Ama community in Port Harcourt City local government area of the State, as part of activities marking the World’s Hepatitis Day.\nAsanga said the Club targets at least 200 people in the community for screening and any case found would be referred to one of the government hospitals for immediate commencement of treatment.\nADVERTISEMENTThe Rotary Club president said: “Today is World’s Hepatitis Day and as part of our seven areas of interest which include disease prevention and treatment, we came to Okuru Ama community to ensure the people here are healthy.\nThere are different types such as Hepatitis A, B and C. However, the most deadly is Hepatitis B and C.“Hepatitis has no cure but there are treatments for it, that is why we have always say that prevention is better than cure.\nHepatitis B destroys the liver faster unlike Hepatitis C that takes time before destruction.”"
  },
  {
    "headline": "Hepatitis: Rotary Club Sensitises, Screens Rivers Community",
    "summarized_story": "The Rotary Club of Trans-Amadi, Port Harcourt, Rivers State, on Friday, carried out sensitisation on Hepatitis and screening of residents of Okuru-Ama community in Port Harcourt City local government area of the State, as part of activities marking the World’s Hepatitis Day.\nAsanga said the Club targets at least 200 people in the community for screening and any case found would be referred to one of the government hospitals for immediate commencement of treatment.\nADVERTISEMENTThe Rotary Club president said: “Today is World’s Hepatitis Day and as part of our seven areas of interest which include disease prevention and treatment, we came to Okuru Ama community to ensure the people here are healthy.\nThere are different types such as Hepatitis A, B and C. However, the most deadly is Hepatitis B and C.“Hepatitis has no cure but there are treatments for it, that is why we have always say that prevention is better than cure.\nHepatitis B destroys the liver faster unlike Hepatitis C that takes time before destruction.”"
  },
  {
    "headline": "Kano Hisbah Arrests ‘Chemist’ For Having ‘Affair’ With Women",
    "summarized_story": "The Kano State Hisbah Board has arrested one Yahaya Zakari for allegedly taking a young woman to his house at Sabuwar Gandu in Kano metropolis.\nThe Commander General of the Board, Dr Harun Ibn-Sina, confirmed the arrest in a statement issued in Kano on Friday.\n“The young woman went to buy drugs from Zakari’s chemist when he took her to his house,” he said.\nIbn-Sina expressed displeasure over the alleged action, assuring that the Board would conduct thorough investigation into the incident.\nHe, therefore, advised parents to monitor the movement of their children closely, especially female wards, to prevent unwanted incidents."
  },
  {
    "headline": "Niger Delta group alleges: Akpabio plotting to stop protests with N2.5bn compensation",
    "summarized_story": "The people of Eleme and Ogoni communities in Rivers State have decried the release of N2.5bn for compensation to reconstruct the Eleme section of the dilapidated East-West road.\nThe President General, Ogoni Youths Federation, Legborsi Yamaabana, expressed mixed feelings over the release of the money for the payment of compensation to property owners along the East-West road.\nThis is just a statement issued by the Minister of Niger Delta Affairs, Senator Godswill Akpabio.\nWe don’t need remedial work anymore.\n“You and I know we have had remedial work on that road before and it still goes bad."
  },
  {
    "headline": "Niger Delta group alleges: Akpabio plotting to stop protests with N2.5bn compensation",
    "summarized_story": "The people of Eleme and Ogoni communities in Rivers State have decried the release of N2.5bn for compensation to reconstruct the Eleme section of the dilapidated East-West road.\nThe President General, Ogoni Youths Federation, Legborsi Yamaabana, expressed mixed feelings over the release of the money for the payment of compensation to property owners along the East-West road.\nThis is just a statement issued by the Minister of Niger Delta Affairs, Senator Godswill Akpabio.\nWe don’t need remedial work anymore.\n“You and I know we have had remedial work on that road before and it still goes bad."
  },
  {
    "headline": "Buhari welcomes Commonwealth support on security, climate change, others",
    "summarized_story": "By CHIKA CHIMEZIENigeria will be glad to receive support from the Commonwealth in diverse areas of needs and challenges, President Muhammadu Buhari has said.\nThe President spoke during a bilateral meeting Thursday with Commonwealth Secretary-General, Baroness Patricia Scotland, at the sidelines of the Global Education Summit holding in London, United Kingdom.\nSaying Nigeria was doing a lot to address food security through heavy investment in agriculture, and the security issues confronting the country in different regions, President Buhari welcomed the offer of assistance by the Commonwealth scribe.\nBaroness Scotland said the Commonwealth had developed programmes on agribusiness, adding value to agriculture products for young people to get involved, climate change, criminal justice reforms, police reforms, and security, inviting Nigeria to benefit from technical assistance that can be provided.\nOther areas the Commonwealth could assist, according to Baroness Scotland, include countering violent extremism, trade, and modalities to implement the African Continental Free Trade Agreement (AfCFTA)."
  },
  {
    "headline": "Buhari welcomes Commonwealth support on security, climate change, others",
    "summarized_story": "By CHIKA CHIMEZIENigeria will be glad to receive support from the Commonwealth in diverse areas of needs and challenges, President Muhammadu Buhari has said.\nThe President spoke during a bilateral meeting Thursday with Commonwealth Secretary-General, Baroness Patricia Scotland, at the sidelines of the Global Education Summit holding in London, United Kingdom.\nSaying Nigeria was doing a lot to address food security through heavy investment in agriculture, and the security issues confronting the country in different regions, President Buhari welcomed the offer of assistance by the Commonwealth scribe.\nBaroness Scotland said the Commonwealth had developed programmes on agribusiness, adding value to agriculture products for young people to get involved, climate change, criminal justice reforms, police reforms, and security, inviting Nigeria to benefit from technical assistance that can be provided.\nOther areas the Commonwealth could assist, according to Baroness Scotland, include countering violent extremism, trade, and modalities to implement the African Continental Free Trade Agreement (AfCFTA)."
  },
  {
    "headline": "Bad Day for Team Nigeria in Tokyo as D’Tigers lose again",
    "summarized_story": "Team Nigeria suffered another setback in Tokyo Saturday after its highly ranked basketball team D’Tigers crashed out of the games.\nD’Tigers lost their third Group B game in the men’s basketball event of the Tokyo Olympics 71-80 to Italy.\nD’Tigers’ loss followed the shattering news that sprinter Blessing Okagbare, will not take part in the semi-finals of the Olympics 100m semi-final on Saturday evening over doping.\nOkagbare, a medal hope, will also no longer take part in the 200 metres.\nOkagbare’s suspension was the latest blow for Nigeria’s athletics team after 10 members were ruled ineligible for the Tokyo Games on Wednesday for failing to meet minimum testing requirements."
  },
  {
    "headline": "IPMAN threatens strike action",
    "summarized_story": "By Chimezie AnasoThe Independent Petroleum Marketers Association of Nigeria (IPMAN) on Saturday threatened to suspend the supply and distribution of products within its designated Eastern zone effective Monday.\nDepots to which IPMAN supplies products in its designated Eastern zone include Aba, Calabar, Enugu, Makurdi, and Port Harcourt.\n“Following the series of unwarranted attacks by the police against IPMAN, Eastern Zone comprising the National Executive Committee of IPMAN resolved that members withdraw their services at these units/depots immediately until further notice.\n“The Zonal Chairman, East, should kindly forward (the notice) to chairmen, IPMAN, Aba, Calabar, Enugu, Makurdi and PH Depots/Units for compliance,” it stated.\n“So we have resolved to withdraw our services in the Eastern zone indefinitely until legality is restored,” he said."
  },
  {
    "headline": "Breaking: Blessing Okagbare knocked out of Tokyo for doping",
    "summarized_story": "Nigerian sprinter Blessing Okagbare, in the running for a medal in the 100 metres, will not be on the start line in the semi-finals.\nThe AIU, which is an independent integrity body created by the World Athletics, disclosed this in a statement on Saturday.\nA provisional suspension is mandatory following an adverse analytical finding for such substance under the World Athletics Anti-Doping Rules.\nThe WADA-accredited laboratory which analysed the sample notified the AIU of the adverse analytical finding at mid-day Central European Time on Friday.\nAIU said the athlete was notified of the adverse analytical finding and of her provisional suspension Saturday morning in Tokyo."
  },
  {
    "headline": "Nigerian Pastor Reveals Terrifying Vision About Nnamdi Kanu",
    "summarized_story": "Evangelist Victor Nwaogu, an Enugu-based preacher, has disclosed that he had a dream that Nnamdi Kanu, the proscribed Indigenous People of Biafra (IPOB) leader, was shot in the chest by Nigeria’s secret police, the Department of State Services (DSS).\n“I told people around me what I saw in my dream yesterday concerning nnamdi KANU,” Nwaogu wrote in an update shared to a pro-Biafra Facebook group on Saturday.\n“Nigeria govt have no evidence to sentence to him to death which is all they wanted.\nThey now adopted delay method in other to allow buhari finish his remaining 2yrs.however, pressure from allover the world pushed them to finalize his case in which nnamdi KANU won and was giving Biafra flag instantly.something happened, immediately nnamdi KANU worked out of the Court room to meet with the great biafran crowd jubilating, as he raised the biafran flag Nigerian DSS instantly shot him on the Chest.so immediately a serious bloody war erupted allover the country.\n“So, I began to pray and cry to God to save nnamdi KANU and save us from crying on that beautiful day we are suppose to rejoice.”"
  },
  {
    "headline": "Inside Details Of FBI’s Meeting With Inspector-General Of Police Over Embattled Officer, Abba Kyari, Hushpuppi",
    "summarized_story": "This came after serial fraudster Ramon Olorunwa Abbas, nicknamed Hushpuppi, pleaded guilty in the United States.\nThe FBI detectives remained with the IGP’s office till he went for Friday’s Juma’at prayers, according to top sources in the IGP’s office.\nOne of the competent sources said, “The FBI detectives left when he (IGP) went for Friday Juma’at prayers.\nThe FBI personnel were insistent and had a long meeting with the IGP till the close of work.\n“Abba Kyari was given till next week to respond to allegations."
  },
  {
    "headline": "APC Leader, Tinubu Hospitalized In U.S, Undergoes Surgery",
    "summarized_story": "Bola Tinubu, the National Leader of the All Progressives Congress and former Governor of Lagos State, is currently hospitalized in Maryland, according to SaharaReporters.\nSaharaReporters have learned that Tinubu, who has made multiple medical trips this year, had surgery last week and could be charged for another for an illness that has yet to be revealed.\nThe APC National Leader has been absent from official and party engagements in the country for some time, amid speculation that he is being groomed to succeed Muhammadu Buhari’s dictatorial dictatorship in 2023.\nHe couldn’t participate in launching his Arewa library, and he couldn’t participate in the Local Government Area elections last week.\n“He had a surgery last week,” an authoritative source disclosed."
  },
  {
    "headline": "Two Kidnapped As Bandits Attack Zamfara General Hospital",
    "summarized_story": "Armed men suspected of being bandits have stormed a general hospital in the Dansadau town of Zamfara State’s Maru local government area.\nThe incident occurred on Friday, according to NEWS DIRECT, when criminals broke into the hospital and kidnapped two health personnel.\nDr. Mannir Bature, the chairman of the Nigerian Medical Association’s Zamfara State Chapter, verified the occurrence to Channels Television.\nFollowing the event, Dr. Bature stated that the NMA Zamfara branch will host an emergency state officers council meeting at the NMA Secretariat on Saturday, July 31, 2021 to discuss the matter.\nSP Mohammed Shehu, the state’s Police Public Relations Officer, was unable to receive calls or respond to text messages provided to him."
  },
  {
    "headline": "Breaking: Nigeria’s Adogoke, Itsekiri hit 2020 Olympics 100m semi-final race",
    "summarized_story": "Nigerian sprinters, Enoch Adegoke and Usheoritse Itsekiri, have made it to the semi-final of the men’s 100 meters race at the ongoing 2020 Olympic games.\nIn another development, Nigeria’s Divine Oduduru was disqaulified from men’s 100m at the same category.\nGreat Britain’s Reece Prescod was first to have a false start in heat 5 but was pardoned as the officials ruled.\nAt the next try, Oduduru started falsely and the officials ruled for disqualification.\nThat ends Oduduru’s journey in the 100m at the Tokyo Olymoics."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigers lose third Olympics basketball game vs Italy",
    "summarized_story": "Nigeria’s men national basketball team D’Tigers have again lost their match against Italy 80-71, the third at the ongoing 2020 Olympic Games in Tokyo Japan.\nThe Nigerian team which led in the second and third quarters collapsed the final quarter.\nDetails loading…"
  },
  {
    "headline": "Breaking – Tokyo Olympics: Nigeria’s Tobi Amusan wins 100m hurdles, Tokyo semi-final",
    "summarized_story": "From the ongoing 2020 Olympics in Tokyo comes a report that one of Nigeria’s medal prospects, Tobi Amusan, has advanced to the semi-final of 100 meters hurdles after emerging first at the heat.\nDetails loading…"
  },
  {
    "headline": "APGA leadership Tussle: Jude Okeke wins as Appeal Court strikes out Factional Chairman Edozie Njoku’s appeal -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "East-West Road: Akpabio urges indigenes to support Government efforts -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio, has appealed to indigenes of host communities at the Eleme and Onne axis of the East-West road in Rivers State, to support ongoing efforts of the government aimed at completing the road project as scheduled.\nThe minister made this call during his meeting with Stakeholders and Management of Reynold Construction Company, RCC in his office, on Thursday in Abuja.\nThe minister further disclosed that due to the volume of traffic on the road, it has become imperative that the road be expanded to six lanes, with additional flyovers.\nNader Yusuf noted that the main issue in the Eleme Junction is in the delay of compensation to the indigenes that have properties on that axis of the road.\nHe advised that once relevant funds are made available, payment of compensation would commence immediately."
  },
  {
    "headline": "Host Community Urges Exploration company to commence operations in Atala Marginal field -NigPilot",
    "summarized_story": "With the new license for exploration given to Halkin Exploration and Production Company, the people of Ekeremor constituency 2 and other host communities have urged Halkin Exploration to commence operations in the Atala Marginal field as soon as possible.\nThe host community noted that this will bring the long-awaited dividends to the people of the community.\nIn a statement signed by the member representing Ekeremor Constituency 2 and Deputy Minority Leader in Bayelsa State House of Assembly, Hon.\nThey posited that the Bayelsa State Government should as a matter of urgency congratulate the newly licensed exploration company and avail them the enabling environment to thrive, as her current position is also misleading.\nThe group however applauded the Federal Government for doing the needful by awarding the Atala Oil Field to indigenous oil Exploration Company, the group said any other decision would have been perceived as utter neglect towards the interest of the host communities."
  },
  {
    "headline": "NAF moves to solve pension crisis, creates Directorate of Veteran Affairs -NigPilot",
    "summarized_story": "The CAS disclosed this while declaring open a 2-day Conference for NAF Administrative and Medical personnel.\nHe said the outcome of such innovations would stimulate NAF human resource management efforts to be at par with global organizational standards and best practices.\nTo this end, we will continue to epitomize best human resource management practices to promote our operational effectiveness,” he said.\nThe Chief of Medical Services, Air Commodore Olabode Babalola revealed the desire of the CAS to ensure that the NAF Medical Services measure up to the global best practice.\nHe said the CAS approval of the Medical Conference is a further attestation of his willingness to improve healthcare delivery in the NAF."
  },
  {
    "headline": "Again, Nigeria Records Highest Daily COVID-19 Cases In Almost Five Months",
    "summarized_story": "It has been a week filled with worries for Nigerian authorities as the country’s daily coronavirus (COVID-19) figures witnessed a steady rise all through.\nThis comes as the Nigeria Centre for Disease Control (NCDC) announced yet another disturbing tally of 590 fresh infections reported from various parts of the country.\nFriday’s figure was the highest single-day tally to be recorded in almost five months – since March 4, 2021, when a total of 708 cases were confirmed.\nOn Monday, 213 new cases were reported while 404 new cases were confirmed on Tuesday, with 535 and 558 more infections recorded on Wednesday and Thursday respectively.\nThe new cases recorded on Friday were reported from 17 states across the country, as well as the Federal Capital Territory (FCT)."
  },
  {
    "headline": "Veteran Nollywood Actress, Rachel Oniga, Is Dead",
    "summarized_story": "Rachel Oniga, a highly respected Nollywood actress, is dead.\nAnother actress in the movie industry, Bimbo Oshin, posted the news on her verified Instagram page.\nView this post on Instagram A post shared by Bimbo Oshin (@bimbooshin)Samklef, a music artiste, also posted about the death of the veteran without going into details.\nView this post on Instagram A post shared by SAMKLEF 💰 (@samklef)Born on 23 May 1957, in Ebute Metta, Lagos, she began her acting career in 1993.\nBefore she made her major acting debut in Nollywood with “Onome,” Oniga worked briefly at Ascoline Nigeria Limited, a Dutch Consultancy firm."
  },
  {
    "headline": "Okagbare Banned From Tokyo Olympics After Failing Drug Test",
    "summarized_story": "One of Nigeria’s brightest chances of a medal at the Tokyo Olympics, Blessing Okagbare, has been provisionally suspended from the competition.\nThe Athletics Integrity Unit (AIU), the independent body created by the World Athletics that manages all integrity issues for the sport, announced the decision on Friday.\nAccording to the AIU, Okagbare tested positive for Human Growth Hormone.\nThe WADA-accredited laboratory that analysed the sample notified the AIU of the adverse analytical finding at mid-day Central European Time yesterday, Friday 30 July.\n“The athlete was notified of the adverse analytical finding and of her provisional suspension this morning in Tokyo."
  },
  {
    "headline": "Bandits Attack General Hospital In Zamfara, Kidnap Health Worker",
    "summarized_story": "Armed bandits have attacked a General Hospital within the Dansadau community in the Maru local government area of Zamfara State.\nThe attack which took place in the early hours of Friday led to the abduction of a health worker and one other individual.\nWorried about the unfortunate incident, Dr. Bature noted that the NMA Zamfara branch will hold an emergency state officers council meeting on Saturday 31st July 2021 at NMA Secretariat to deliberate on the issue.\nDansadau community has been in the news recently for several attacks by bandits, leading to the kidnapping of residents.\nThe community has been reaching out to the Federal and State Governments, pleading that more security personnel be deployed to the troubled area."
  },
  {
    "headline": "Olympics: Nigeria’s Tobi Amusan Qualifies For Women’s 100m Hurdles Semis",
    "summarized_story": "Nigerian athlete, Tobi Amusan, has qualified for the semi-finals of the Women’s 100m Hurdles at the ongoing Tokyo 2020 Olympic Games in Japan.\nThe 24-year-old advanced to the next round of the competition on Saturday morning after winning Round 1 (Heat 3), running from lane four.\nOthers athletes in the heat included Charlton Devynne from Bahamas (12.84), Finland’s Korte Annimari (13.06), Koala Marthe of Burkina Faso (13.11), and Japanese representative Aoki Masumi (13.59).\nHowever, Pesiridou Elisavet from Greece who would have complete the list of eight athletes in the heat did not finish the race.\nAmusan had lost out at the 2019 World Championships in Doha, Qatar, in the hunt for a medal as she finished fourth."
  },
  {
    "headline": "Ward Congress: Sokoto APC adopts Consensus option",
    "summarized_story": "The All Progressives Congress in Sokoto State have unanimously adopted the consensus option in ongoing Ward congresses of the party.\nStakeholders of the party had earlier adopted this option at a stakeholders meeting held at the resident of the former governor of the state and senator representing Sokoto North Senatorial district, Aliyu Magatakarda Wamakko.\nCaretaker chairman of the party in Sokoto, Isa Sadiq Achida announced the decision of using the consensus option for the ward congress.\nAdvertisementSpeaking at the party Secretariat, former Governor of the state and leader of the party in Sokoto, Aliyu Magatakarda Wamakko said APC is United and strong in Sokoto.\nHe said all relevant party stakeholders are in tune with the direction the party is going and those who are not with them are only an insignificant numbers of members."
  },
  {
    "headline": "Blessing Okagbare suspended for doping",
    "summarized_story": "Nigeria’s hope of securing any medal in the ongoing Olympic games in Tokyo mayo have been dashed completely.\nThis is as one of the underdogs for the 100-meter final, Blessing Okagbare, was suspended for doping on Saturday (July 31st) after testing positive for growth hormone, the Unit said.\nThe 32-year-old Okagbare was tested out of competition on July 19.\nShe is the first athlete declared positive during the Olympic period of the Tokyo Games.\nAdvertisementWith the suspension of Okagbare, Nigeria return home from the prestitious event without any medal."
  },
  {
    "headline": "Imo Police Command repels Bandits attack on Njaba town",
    "summarized_story": "Police in Imo state have Intercepted a convoy of bandits moving towards Njaba Town to launch an attack early hours of Saturday.\nIn a Statement by the Command’s Public relations officer, Micheal Abattam said the operatives of “Operation Restore Peace” on sighting the bandits engaged them on gun duel.\nIn the process one of their operational vehicle’s was demobilised and killed two of them while the remaining ones scampered into the bush.\nThe team also detonated an Improvised Explosive Devices into the parking lots of a nearby Njaba Police Station causing minimal damage.\nAdvertisementThe command also urged members of the Public to avail the Police information of persons seen treating bullet wounds or hiding within the community."
  },
  {
    "headline": "‘War Has Changed’: US Calls for New Response to Delta Variant",
    "summarized_story": "The war against COVID-19 has changed because of the highly contagious Delta variant, the U.S. Centers for Disease Control said, proposing a clearer message, mandatory vaccines for health workers and a return to universal masking.\nIt can be passed on even by vaccinated people, and may cause more serious disease than earlier coronavirus strains.\n“High viral loads suggest an increased risk of transmission and raised concern that, unlike with other variants, vaccinated people infected with Delta can transmit the virus,” CDC head Rochelle Walensky said in a statement.\nIn parts of the world where large numbers of people have yet to be vaccinated, the Delta variant has led once again to surging death rates and hospitalisations.\nFrom Monday, army personnel will help police Australia’s biggest city Sydney, checking that people who have tested positive are isolating."
  },
  {
    "headline": "Simone Biles Withdraws from More Olympics Event Finals",
    "summarized_story": "Simone Biles has withdrawn from the vault and uneven bar apparatus finals at the Tokyo Olympics on Saturday as the US gymnast continued to wrestle with mental health issues.\nThe 24-year-old, however, might yet make another appearance at the Tokyo Games having not ruled herself out for floor exercise on Monday and beam on Tuesday.\n“Today, after further consultation with medical staff, Simone Biles has decided to withdraw from the event finals for vault and the uneven bars,” said USA Gymnastics in a statement.\nThe decision to drop out of two more finals means Biles will not defend the vaulting gold she won at the 2016 Rio Olympics.\nMyKayla Skinner, who had the fourth-highest score in vault during qualifications, will compete in vault finals for the US alongside Jade Carey, who finished with the second-highest score."
  },
  {
    "headline": "Israel Accuses Iran Over Deadly Oil Tanker Attack",
    "summarized_story": "Israel has accused Iran of being behind an attack on an oil tanker in which two crew members – a British national and a Romanian citizen – were killed.\nAnalysis box by Frank Gardner, security correspondentThe undeclared “shadow war” between Israel and Iran appears to be hotting up.\nAn Iranian Arabic-language television station quoted unnamed sources saying the attack was revenge for an alleged Israeli attack on an airport in Syria, an ally of Iran’s.\nAn unnamed Israeli official said it would be hard for Israel to turn a blind eye to the attack.\nAccording to Zodiac Maritime, it had no cargo on board at the time of the incident."
  },
  {
    "headline": "Nigeria ‘Not Aware’ of Major Arms Deal Blocked By US Senators",
    "summarized_story": "Nigeria’s federal government has denied reports that some lawmakers in the United States have blocked the planned sale of $875 million ammunitions to Nigeria due to poor human rights record.\n“We are quite satisfied with the progress and cooperation that we received from the government of the US on this issue.\n“As a matter of fact, six of the Tucano fighter jets will be launched on Aug. 3, this year.\n“We are not aware of the so called $875 million arms contract or some helicopters which they said some lawmakers in the US are trying to persuade the president of the US not to honour.\nIt reported further that influential U.S. lawmakers were masterminding a hold on a proposed sale of attack helicopters to Nigeria over concerns that the Buhari administration was drifting towards authoritarianism."
  },
  {
    "headline": "Nigeria’s Governing APC Holds Ward Congresses Saturday",
    "summarized_story": "Of course, Malami, after an elaborate analysis, cleared the Caretaker Committee to proceed with the ward congresses, assuring that Buni’s continued stay as Chair would not portend any crisis for the party.\nWe want to assure teeming members of the APC across the country to come out and elect officers at the ward levels.\nSo that is the position.”The National Secretary of APC’s CECPC, John Akpanudoedehe, also buoyed by Malami’s assurances, issued a statement Firday, saying Saturday’s ward congresses would go ahead as planned.\nAkpanudoedehe warned that any parallel congress, parallel party organ and or parallel party office would not be tolerated by the national leadership of the party ahead of the ward congresses.\nThis is to say that: any purported; parallel congress, parallel party organ and or parallel party office, is to say the least a nullity."
  }
]