[
  {
    "headline": "NYSC announces date for health insurance enrolment after PUNCH HealthWise story",
    "summarized_story": "-Says corps members will be enlisted for health insurance from February 11Alfred OlufemiThe management of the National Youth Service Corps has announced that all corps members will be enlisted in the National Health Insurance Scheme starting from February 11.\nThe NYSC statement followed a PUNCH Healthwise report that detailed how corps members who sustained injuries and health challenges during the mandatory one-year scheme have continued to bear medical costs, five years after the Federal Government approved that they should be incorporated into the health insurance scheme.\n“It is for that particular reason that the welfare of corps members remains topnotch, and a cardinal policy thrust of the National Youth Service Corps.\n“It is apt to put on record that Corps Members get medical refunds for sums expended on health challenges.\n“The flag-off of this insurance scheme is slated for Friday, 11th February 2022,” the statement said."
  },
  {
    "headline": "NYSC announces date for health insurance enrolment after PUNCH HealthWise story",
    "summarized_story": "-Says corps members will be enlisted for health insurance from February 11Alfred OlufemiThe management of the National Youth Service Corps has announced that all corps members will be enlisted in the National Health Insurance Scheme starting from February 11.\nThe NYSC statement followed a PUNCH Healthwise report that detailed how corps members who sustained injuries and health challenges during the mandatory one-year scheme have continued to bear medical costs, five years after the Federal Government approved that they should be incorporated into the health insurance scheme.\n“It is for that particular reason that the welfare of corps members remains topnotch, and a cardinal policy thrust of the National Youth Service Corps.\n“It is apt to put on record that Corps Members get medical refunds for sums expended on health challenges.\n“The flag-off of this insurance scheme is slated for Friday, 11th February 2022,” the statement said."
  },
  {
    "headline": "FG takes delivery of 2m doses of J&J COVID-19 vaccine",
    "summarized_story": "The Federal Government has taken delivery of two million doses of the Johnson & Johnson COVID-19 vaccine donated by the European Union.\nIn September 2021, additional 1,123,200 doses of the J&J vaccine were received, which the NPHCD said were part of the 39,800,000 doses procured by the Federal Government.\nThe single-shot J&J vaccine was received through the African Vaccine Acquisition Team (AVAT) of the African Union, a facility provided by Afri.\nAccording to him, the J&J vaccines will be given to those who are in the hard-to-reach areas (riverine areas, desert areas and security-compromised areas).\n“All COVID-19 vaccines approved by the World Health Organisation are safe and can deliver adequate protection against the disease."
  },
  {
    "headline": "FG takes delivery of 2m doses of J&J COVID-19 vaccine",
    "summarized_story": "The Federal Government has taken delivery of two million doses of the Johnson & Johnson COVID-19 vaccine donated by the European Union.\nIn September 2021, additional 1,123,200 doses of the J&J vaccine were received, which the NPHCD said were part of the 39,800,000 doses procured by the Federal Government.\nThe single-shot J&J vaccine was received through the African Vaccine Acquisition Team (AVAT) of the African Union, a facility provided by Afri.\nAccording to him, the J&J vaccines will be given to those who are in the hard-to-reach areas (riverine areas, desert areas and security-compromised areas).\n“All COVID-19 vaccines approved by the World Health Organisation are safe and can deliver adequate protection against the disease."
  },
  {
    "headline": "Bauchi students chide Gov Mohammed over late payment of bursary, laments poor education sector",
    "summarized_story": "Bauchi Governor, Bala MohammedBy Charly Agwam – BauchiA group of Bauchi State students under the umbrella of Air Marshal Abubakar Sadiq Students Forum (AMASS FORUM) has lambasted the Bauchi State governor, Bala Mohammed over late disbursement of bursary for students from the State in tertiary institutions of learning.\nThe forum which was chaired by Aliyu Hussaini, told journalists in Bauchi on Monday that it is concerned about numerous problems of Bauchi State Student said it is projecting solutions by engaging expertise in various sections.\n“We are traumatized by the method of local scholarship that is partially disbursed to few while segregating Higher Islamic Students and other Tertiary Institutions.\nAfter waiting for good 4 years, this is the least records of Scholarship disbursed in the history of the state.\nGladly (Alhamdulillah) God answered our prayer without wasting much energy we come across a gentle man in person of Air Marshal Abubakar Sadiq.”"
  },
  {
    "headline": "PDP rejects Kebbi LGs polls announced by KSIEC",
    "summarized_story": "By Haruna Aliyu,Birnin KebbiThe opposition peoples democratic party PDP on Monday rejected the outcome of the results announced by Kebbi state independent electoral commission which said the ruling APC in Kebbi State has won the 21 local councils and 225 councillors in the election that was held on February the 6th 2022.\nSpeaking to vanguard vie telephone the state chairman of peoples democratic party PDP Usman Bello Suru stated that, the opposition party totally rejected the results announced “while we reject the outcome we will sit to come up with our next line of action based on the outcome.\nKebbi state independent electoral body on Monday vie press release announced that, the February 6th local councils were conducted peacefully in the state and that, the ruling APC won in all the 21 local governments and 225 ward councillors.\nVanguard reported on Saturday how polls were marked by votes buying late arrivals or incomplete voting materials during the conduct of the disputed local councils’ polls.\nVanguard News Nigeria"
  },
  {
    "headline": "FG moves to avert aviation workers strike",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAThe Federal Government has commenced moves to avert the impending nationwide strike of aviation workers.\nIn his opening remarks, Ngige thanked the aviation workers for the matured way they went about their matter, saying they acted in the spirit of labour conciliation.\nHe noted that the aviation workers gave the necessary warning to his ministry, but they resolved that their parent ministry should first engage with them.\nHe lamented that since 2019 when the Minimum Wage Bill was signed into law, no worker from the Aviation Ministry has benefitted from it.\nHe also called for the approval/release of the reviewed conditions of service for aviation workers."
  },
  {
    "headline": "Iwo won’t betray you, Oluwo assures Oyetola",
    "summarized_story": "Shina Abubakar, OsogboOluwo of Iwo, Oba Abdulrosheed Akanbi has assured Osun State Governor, Adegboyega Oyetola that the people of Iwo would not betray him in the quest for a second term in office.\nOluwo, who speaks in Yoruba, said the community has resolved to support the Governor’s re-election bid so the town can be strategically placed to benefit during and after his second term in office.\nAlso Read:2023 PRESIDENCY: Why PDP, APC’re playing games with zoning — Source“Iwo community can not betray Governor Oyetola, I assure you that you will win your second term bid, you will come back as Governor-elect of this state by God’s grace.\n“Oyetola has done well, we are seeing good roads, the civil servants that are begging around before have stopped because the era of half Salary is long gone.\nEarlier in his address, Governor Oyetola said he was at the palace for royal blessing, having decided to seek another term of office."
  },
  {
    "headline": "It’s the turn of Ijaws to be governor in Rivers State",
    "summarized_story": "Excerpts:Former Rivers State governor, Dr Peter Odili is from the West Senatorial District of the state while both the immediate past governor, Rotimi Amaechi as well as the incumbent, Nyesom Wike are from the East Senatorial District which means the South East district has not had the opportunity to govern the state.\nDespite the heterogeneous nature of Rivers State as you have said, all the governors since 1999 came from one particular area, how do you feel about that?\nIt is the turn of the Ijaws to produce a credible candidate to be elected and serve as the next governor of Rivers State.\nWhat will be your agenda for the people of Rivers State if you become governor in 2023?\nAfter nearly 24years of uninterrupted democracy we can hardly perceive or feel a meaningful impact of governance positively changing lives in Rivers State."
  },
  {
    "headline": "Hushpuppi: US discussing with Buhari govt over Abba Kyari – Malami",
    "summarized_story": "Malami said both government’s are discussing Kyari’s extradition, because reasonable grounds for suspicion has been established against the former Head of the Intelligence Response Team, IRT.\nThe US Federal Bureau of Investigation, FBI, had linked Kyari to a $1m scam allegedly perpetrated by Hushpuppi and his gangs.\nDespite his denial, the Nigeria Police Force, NPF, had suspended Kyari, pending an investigation by the Police Service Commission, PSC.\nHowever, Malami said there has been exchange of correspondence between both governments on Kyari’s issue.\nAccording to Malami: “As far as I am concerned, the parties are discussing, the parties are collaborating, there are exchanges of correspondence from the perspective of investigation, from the perspective of extradition, and associated things."
  },
  {
    "headline": "Sanwo-Olu signs Lagos laws on real estate transactions, dangerous pets",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, on Monday, gave his assent to three bills.\nThe bills signed at the State House were passed by the House of Assembly in 2021.\nSanwo-Olu said his action will enhance good administration, improve governance and move Lagos State towards a more organised society.\nSanwo-Olu hailed Lagos Speaker, Mudashiru Obasa and the lawmakers for their work.\n“We will continue to ensure that our citizens are getting good governance and that trust in government is further deepened,” he assured."
  },
  {
    "headline": "Biafra: Ejimakor calls for unconditional release of Nnamdi Kanu",
    "summarized_story": "Special Counsel to the Indigenous People of Biafra, IPOB, and its leader, Nnamdi Kanu, Aloy Ejimakor, has called for the unconditional release of the secessionist leader from detention.\nAccording to him, Nigeria must first explain to domestic courts and the international community how Kanu ended up in their in chains.\nHe noted that the Kenyan Government has also vehemently denied that Kanu was subjected to any extradition.\n“The next best thing for Nigerian authorities to do is to toe the path of honour and contrition by releasing Nnamdi Kanu unconditionally.\n“In the interim, it may choose the easier option of forbearing any objections to reinstatement of Nnamdi Kanu’s bail, which will instantly clear the judicial path to his release.”"
  },
  {
    "headline": "Top 10 most followed people on Instagram as Ronaldo hits 400m followers",
    "summarized_story": "Manchester United forward, Cristiano Ronaldo, has become the first person in the world to hit 400 million followers on Instagram.\nCristiano Ronaldo (Portugal international and Manchester United player — 400m followers).\nKylie Jenner (American model, businesswoman — 309m followers).\nKim Kardashian (American model, businesswoman — 284m followers).\nKhloe Kardashian (American model, businesswoman — 219m followers)."
  },
  {
    "headline": "Lagos 2023: Muri-Okunola denies ‘secret plan’ to succeed Sanwo-Olu",
    "summarized_story": "Lagos State Head of Service, Hakeem Muri-Okunola, has debunked claims that he was a nursing a governorship ambition.\nSome political forces and state elders are reportedly backing him to succeed Governor Babajide Sanwo-Olu in 2023.\nIn a statement, Muri-Okunola denied a secret plan to, along with others, deny Sanwo-Olu a second term.\n“I reiterate my support for Governor Babajide Sanwo-Olu and his administration’s THEMES Agenda – the six-pillar development plan that is the compass for his projects and policies.\n“I am fully focused on carrying out my duties as head of service of the Lagos state government and taking the Public Service to greater heights”, he wrote."
  },
  {
    "headline": "Court to hear Nnamdi Kanu’s fundamental rights suit February 28",
    "summarized_story": "A Federal High Court in Abuja yesterday fixed February 28 to hear a fundamental rights enforcement suit filed by the Leader of proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nJustice Taiwo Taiwo fixed the date after counsel to the Department of State Services (DSS), Idowu Awo, informed the court that his clients had a counter-affidavit which had not been served on Kanu.\nAwo prayed the court for more time for the service of the application on Kanu’s lawyer, Maxwell Opara.\nBut Opara described the request of the DSS lawyer as an attempt to continue to subject his client to solitary confinement and other inhuman treatments.\nJustice Taiwo, who said the matter was coming before him for the first time, fixed February 28 for hearing."
  },
  {
    "headline": "Why we released Odili’s passports, by Immigration",
    "summarized_story": "The Nigerian Immigration Service (NIS) has said it released the international passports it seized from former Rivers State Governor Peter Odili in obeying a court judgment of October 18, 2021.\nAdamu spoke at the resumed hearing in a fundamental rights enforcement suit filed by Odili against the NIS and its Comptroller General.\nHe said although his clients had appealed the court’s October 18, 2021 judgment, it chose to obey the court’s order while still pursuing the appeal.\nThe NIS lawyer filed a motion yesterday in which he exhibited letter of request by Odili and other evidences showing that the former governor collected the passports through his daughter.\nThe judge also set aside the order for N2 million fine imposed on the NIS and its Comptroller General."
  },
  {
    "headline": "Court to decide on objections to claimants’ N50b suit against Shell",
    "summarized_story": "The High Court sitting in Port Harcourt, Rivers State has set aside March 23 and 24 to hear and decide on preliminary injunctions to the N50billion suit filed against the Shell Petroleum Development Company (SPDC).\nA couple and employees of Shell, Emeka and Stella Okoli, filed the suit seeking damages for medical negligence by Shell Hospital in Port Harcourt during an appendectomy operation on their child, Chinazam.\nChinazam, the only son of the claimants, suffered brain damage and remained incapacitated, confined to a wheelchair following the alleged negligent surgical procedure by the Shell hospital and its doctors.\nThose sued alongside Shell as second and third defendants are Dr. Alexander Dimoko and Dr. Dafe Akpoduado, who performed the appendectomy surgery on Chinazam in September 2016.\nThe defendants, through their lawyers, are labouring to stop the court from hearing the substantive matter through their applications on technicalities involved in serving processes."
  },
  {
    "headline": "Edo Assembly confirms eight commissioner-nominees",
    "summarized_story": "Edo House of Assembly yesterday confirmed eight of the nine commissioner-nominees sent to it by Governor Godwin Obaseki on February 1.\nThey were screened and recommended for clearance by the three-man ad hoc committee led by the Majority Leader, Mr. Henry Okhuarobo.\nThe Committee Chairman, Okhuarobo, presented a report on the screened nominees to the House for consideration.\nThe committee recommended that the nominees, having been found to be eligible, should be confirmed as commissioners.\nOnobun hailed Obaseki for giving youths like Okogbe Donald and Jonathan Lawani the opportunity to represent young people in his administration."
  },
  {
    "headline": "Elders’ council urges Uzodimma to recover ‘looted properties’",
    "summarized_story": "Imo State Council of Elders has urged Governor Hope Uzodimma not to relent in his efforts to recover properties belonging to the government and individuals, including the land looted or unlawfully converted to private properties by the ex-Governor Rocha Okorocha administration.\nThe council under the chairmanship of the Obi of Obinugwu, Eze Cletus Ilomuanya, also unanimously passed a vote of confidence in Uzodimma for his massive infrastructural and agricultural development of the state, noting that his efforts at protecting lives and property were commendable.\nThese, among others, were contained in a communiqué by the council at the end of its inaugural meeting in Owerri.\nThe communiqué was endorsed by Cletus Ilomuanya and Dr. Maxwell Duru, chairman and secretary.\nAccording to the communiqué, the council appreciates the efforts the governor is “making to enhance security as well as the bold steps being taken to recover stolen public and private property, including land, by the previous administration.”- Advertisement -The council described its establishment as a “remarkable decision by Uzodimma.”The governor said: “The council was established to serve as a watchdog on his administration”, and pleaded that the council should speak up when necessary, in the interest of the state.”"
  },
  {
    "headline": "NIS finally release ex-Gov Odili’s seized passport",
    "summarized_story": "The development followed Odili’s confirmation in the courtroom that the NIS had complied with the order on December 20, 2021.\nThe judge, who ordered the NIS to pay a N2 million fine for its conduct, directed the Attorney-General of the Federation (AGF) to take disciplinary action against the lawyer to NIS for alleged unprofessional conduct.\nResponding, Adedipe said he was informed over the weekend that his client’s passport had been released to him in accordance with the court order.\nHe said it was Adedipe who misled the court that deserved to be sanctioned and face the disciplinary action of the court.\nJustice Ekwo, after perusing the affidavit and other exhibits attached, vacated the orders against Adamu and NIS."
  },
  {
    "headline": "BREAKING: Ten family members of Niger Council Chairman regain freedom after paying N5m, 3 motorcycles as ransom",
    "summarized_story": "From John Adams, MinnaTen out of the 13 family members of the Chairman of Shiroro local government area of Niger State, Mallam Suleiman Chukuba have been released by their abductors after spending over 60 days in captivity.\nThe release of the victims, all women and their children, follows the payment of N5million and three motorcycles as ransom to the gunmen.\nRecalled that gunmen numbering over 50 and riding on motorcycles, stormed Chibani in Shiroro local government on November 27th last year and abducted about 50 members of the community, including 13 family members of the Council Boss.\nThe 13 family members of the Council boss were however not lucky as the gunmen whisked them away.\nBarely one week after their abduction, the gunmen demanded N60million as ransom for the release of the only 13 members of his family, but the amount was later reduced to N57million and two motorcycles."
  },
  {
    "headline": "Constitution amendment: Senators, reps reject eight bills, settle for 47",
    "summarized_story": "He said when the bills are presented to the two chambers, dissenting voices maybe in the minority.\nHe said: “There is no interim or final report yet on the constitution review exercise.\nThey have worked on 55 bills on constitution review.\nBy the end of the month, the final report will be ready.\n“The bills agreed upon by the the joint committee from the House of Representatives and the Senate are 47."
  },
  {
    "headline": "Insecurity: FG promises more equipment to military to check criminality",
    "summarized_story": "This is just as the government commended personnel of the armed forces for their resilience and commitment to keep the nation united.\nMinister of Defence, retired Major Gen. Bashir Magashi, made this known at the 2021 Army Headquarters Garrison West African Social Activities (WASA) in Abuja.\nHe said: “We shall continue to make efforts to ensure more platforms are prescribed to sustain the tempo of operations.\n“I wish to state that you must imbibe good maintenance culture to make this equipment readily available when needed for operations.\nAccording to him, worthy of note is the gallant performance and sacrifices of the Nigerian Army personnel in counterterrorism, counter insurgency and other operations across the country."
  },
  {
    "headline": "Your perception of Buhari’s administration wrong, Presidency tells Financial Times",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has faulted a Financial Times article on the state of security and the economy under President Muhammadu Buhari.\nThe article, entitled: ‘What is Nigeria’s Government for?’ by David Pilling, African editor of Financial Times, was published on January 31.\nReacting to the article, Senior Special Assistant to the President on Media and Publicity, Garba Shehu, in a letter addressed to Financial Times, yesterday, said the article left out the ‘security gains’ of the current government.\nThe Presidency said: “We wish to correct the wrong perceptions contained in the article, “What is Nigeria’s Government For,” by David Pilling, Financial Times (UK), January 31, 2022, in the letter which reads:“The caricature of a government sleepwalking into disaster (What is Nigeria’s government for?\nCriminal gangs took advantage of the instability, flush with guns that flooded the region following the Western-triggered implosion of Libya."
  },
  {
    "headline": "NFF Dumps Peseiro, Retains Eguavoen as Interim Technical Adviser",
    "summarized_story": "*Drafts Amuneke into technical crew as Head CoachDuro IkhazuagbeThe Nigeria Football Federation (NFF) on Monday officially put in the cooler negotiations with Portuguese Coach, Jose Peseiro, to take over the Super Eagles job from sacked Gernot Rohr.\nInstead, the federation announced a reconstituted technical crew of the Super Eagles with Augustine Eguavoen retained as Interim Technical Adviser.\nTo reinforce the technical bench ahead of next month’s 2022 World Cup playoff against Ghana’s Black Stars, NFF also drafted former Nigeria World Cup star and former U20 Boys’ Head Coach, Emmanuel Amuneke as immediate assistant to Eguavoen.\nHe is a Member of both the FIFA and CAF Technical Study Groups.\n“The NFF Board has approved a recommendation of the Technical and Development Committee retaining Augustine Eguavoen as Technical Director/Technical Adviser (interim) while Emmanuel Amuneke becomes the Chief Coach of the Super Eagles."
  },
  {
    "headline": "Amended Electoral Bill Bars Ministers, Commissioners from Contesting in Primaries",
    "summarized_story": "What this therefore, means is that ministers, commissioners and other political appointees are expected to resign ahead of their parties’ primaries in order to be eligible to contest in the primaries.\nBut the fear being expressed by many is that, with a clause that clearly breaches the provision of the constitution, the president might be forced to veto the electoral act amendment bill again.\nThe National Assembly had recently transmitted the new Electoral Act (Amendment) Bill to Buhari for assent, through the Clerk of the National Assembly, Olatunde Ojo.\nBefore the latest transmission, Buhari had in December 2021, vetoed the former amendment bill, leading to a recommittal by the National Assembly.\nBuhari had declined assent to the first amendment bill over the provision of direct primary as the only mode of choosing candidates by political parties."
  },
  {
    "headline": "Fitch: Nigeria’s Oil Sector Weak Performance May Slowdown Economic Growth",
    "summarized_story": "“Indeed, despite the new bill, our oil and gas team expects that oil production will gradually fall over the coming years.\nAll told, fixed investment spending will contribute just 0.6 per cent to headline growth in 2022.”The report projected that the poor performance of the oil sector, which is Nigeria’s key foreign exchange earner, would keep headline growth weak over the coming years.\nHeadline growth will be even weaker in per capita terms.\nIt said, “We at Fitch Solutions expect Nigeria’s economy will expand by 3.5 per cent in 2022.\nThe report explained, “This will contribute 2.2pps to headline growth."
  },
  {
    "headline": "Osinbajo to Announce Presidential Bid after APC Convention",
    "summarized_story": "* Secures go-ahead of his spiritual fatherAdedayo Akinwale in AbujaVice President Yemi Osinbajo has concluded plans to announce his presidential ambition immediately after the All Progressives Congress (APC) national convention, slated for Saturday, February 26.\nThe source said, “Take it to the bank, he will run and he is declaring soon after the APC convention.\nI believe prof is also motivated by the increasing level of support from across the country, especially, the youths of this country.\n“But, file this away, he is contesting and would declare after the APC convention.\nOsinbajo is a pastor in Redeem and Baba Adeboye would never leave one of his own to support someone else."
  },
  {
    "headline": "Despite Inauguration of New APC Chairmen, Crises Persist in 13 States",
    "summarized_story": "THISDAY gathered that Wamakko has six National Assembly members, a senator, and 13 members of the state House of Assembly in his faction.\nA faction of the APC in Anambra State led by the Minister of Labour and Employment, Dr Chris Ngige, has also rejected the inauguration of Mr Basil Ejidike as the state chairman.\nThe APC had sworn in Chief Yemi Sanusi, Chairman of a faction loyal to the state Governor, Prince Dapo Abiodun.\nDeputy Chairman of the faction led by the Minister of Information and Culture, Alhaji Lai Mohammed, in Kwara State, Hon.\n“The development shows that the national leadership of APC is unserious one and when the time comes, all of them will see it."
  },
  {
    "headline": "Popular Singer In Northern Nigeria Regrets Supporting President Buhari's Election",
    "summarized_story": "A popular singer in Northern Nigeria, Haruna Abdullahi Aliyu, says he has regretted supporting Muhammadu Buhari to emerge as the President of Nigeria.\nBuhari emerged as the President of Nigeria in 2015 after winning election and returned for a second term in office in 2019.\nHe asked why President Buhari could not deliver on his promises of tackling insecurity and building a vibrant economy.\nSpeaking in Hausa, Aliyu said, \"I deeply regret singing support songs for President Buhari because he's failed Nigerians, he's not kept his campaign promises.\n\"I swear to God I regret supporting him (Buhari) on a number of issues badly handled by his administration."
  },
  {
    "headline": "Popular Singer In Northern Nigeria Regrets Supporting President Buhari's Election",
    "summarized_story": "A popular singer in Northern Nigeria, Haruna Abdullahi Aliyu, says he has regretted supporting Muhammadu Buhari to emerge as the President of Nigeria.\nBuhari emerged as the President of Nigeria in 2015 after winning election and returned for a second term in office in 2019.\nHe asked why President Buhari could not deliver on his promises of tackling insecurity and building a vibrant economy.\nSpeaking in Hausa, Aliyu said, \"I deeply regret singing support songs for President Buhari because he's failed Nigerians, he's not kept his campaign promises.\n\"I swear to God I regret supporting him (Buhari) on a number of issues badly handled by his administration."
  },
  {
    "headline": "BREAKING: Falana Asks Police Inspector-General To Move Trial Of Adedoyin, Other Suspected Killers Of Murdered OAU Postgraduate Student, Adegoke, To Osun",
    "summarized_story": "After Adegoke was declared missing, the police were invited and seven suspects were arrested after which investigation commenced.\nLater, the Intelligence Response Team, Abuja, took over the investigation and the case was transferred to the Federal Capital Territory.\nThe letter read, “We are Solicitors to the aged parents of the Late Timothy Adegoke (hereinafter referred to as \"our clients\") on whose behalf we write this letter.\nOur clients' instructions are briefly summarised and stated as follows:“The son of our clients, Timothy Adegoke, was a 37-year-old Master of Business Administration student at the Obafemi Awolowo University, Ile Ife, Osun State.\nThank you for your great concern and sympathy.”Falana & Falana Chambers, in a statement sent to SaharaReporters, had accepted the family's invitation, saying, \"We have accepted the instructions of the bereaved Adegoke Family."
  },
  {
    "headline": "BREAKING: Falana Asks Police Inspector-General To Move Trial Of Adedoyin, Other Suspected Killers Of Murdered OAU Postgraduate Student, Adegoke, To Osun",
    "summarized_story": "After Adegoke was declared missing, the police were invited and seven suspects were arrested after which investigation commenced.\nLater, the Intelligence Response Team, Abuja, took over the investigation and the case was transferred to the Federal Capital Territory.\nThe letter read, “We are Solicitors to the aged parents of the Late Timothy Adegoke (hereinafter referred to as \"our clients\") on whose behalf we write this letter.\nOur clients' instructions are briefly summarised and stated as follows:“The son of our clients, Timothy Adegoke, was a 37-year-old Master of Business Administration student at the Obafemi Awolowo University, Ile Ife, Osun State.\nThank you for your great concern and sympathy.”Falana & Falana Chambers, in a statement sent to SaharaReporters, had accepted the family's invitation, saying, \"We have accepted the instructions of the bereaved Adegoke Family."
  },
  {
    "headline": "US Government Places $10million Bounty On Leader Of Islamic State, Khorasan",
    "summarized_story": "The United States government has placed a $10million (N4.1billion) bounty on Sanaullah Ghafari, leader of the Afghanistan regional chapter of the Islamic State group.\nThe US State Department announced that it needed information leading to the “identification or location” of Ghafari, AFP reports.\nISIS-K, known as the Islamic State–Khorasan Province, operates out of Afghanistan and Pakistan.\nThe State Department identified this faction's leader as Sanaullah Ghafari who took over in June 2020.\n“Ghafari is responsible for approving all ISIS-K operations throughout Afghanistan and arranging funding to conduct operations,” the State Department said in a statement."
  },
  {
    "headline": "Benin Republic has extended Igboho’s detention by six months, says lawyer",
    "summarized_story": "Yomi Alliyu, counsel to Sunday Adeyemo, a ‘Yoruba nation’ agitator better known as Sunday Igboho, says the government of Benin Republic has extended the activist’s detention period by six months.\nIgboho is being held in a prison facility in Cotonou, Benin Republic, after he was arrested at Cardinal Bernardin International Airport, Cotonou, in July 2021.\nHe had been declared wanted by the Nigerian government shortly before he was arrested in Benin Republic.\n“Contrary to what was speculated in the news by a lawyer, the government of the Republic de Benin has renewed the incarceration of chief Sunday Adeyemo a.k.a.\nIf they don’t release Sunday Igboho legally, we are going to take him out of Benin Republic."
  },
  {
    "headline": "Benin Republic has extended Igboho’s detention by six months, says lawyer",
    "summarized_story": "Yomi Alliyu, counsel to Sunday Adeyemo, a ‘Yoruba nation’ agitator better known as Sunday Igboho, says the government of Benin Republic has extended the activist’s detention period by six months.\nIgboho is being held in a prison facility in Cotonou, Benin Republic, after he was arrested at Cardinal Bernardin International Airport, Cotonou, in July 2021.\nHe had been declared wanted by the Nigerian government shortly before he was arrested in Benin Republic.\n“Contrary to what was speculated in the news by a lawyer, the government of the Republic de Benin has renewed the incarceration of chief Sunday Adeyemo a.k.a.\nIf they don’t release Sunday Igboho legally, we are going to take him out of Benin Republic."
  },
  {
    "headline": "'Gross misconduct': Zamfara assembly serves impeachment notice on deputy governor",
    "summarized_story": "The Zamfara house of assembly has announced the service of an impeachment notice on Mahdi Aliyu Gusau, deputy governor of the state.\nSpeaking at the briefing, Hassan said the allegations against the deputy governor include “insubordination, abuse of office, and criminal self-enrichment”.\n“The speaker, in conformity with status, has duly served the deputy governor, through the secretary to the state government.\n“The deputy governor mischievously approached the federal high court in Abuja, alleging that the house is in the process of impeaching him.\nThis gave the deputy governor the right to perform all functions of a deputy governor and not honour the invitation of the house."
  },
  {
    "headline": "'Gross misconduct': Zamfara assembly serves impeachment notice on deputy governor",
    "summarized_story": "The Zamfara house of assembly has announced the service of an impeachment notice on Mahdi Aliyu Gusau, deputy governor of the state.\nSpeaking at the briefing, Hassan said the allegations against the deputy governor include “insubordination, abuse of office, and criminal self-enrichment”.\n“The speaker, in conformity with status, has duly served the deputy governor, through the secretary to the state government.\n“The deputy governor mischievously approached the federal high court in Abuja, alleging that the house is in the process of impeaching him.\nThis gave the deputy governor the right to perform all functions of a deputy governor and not honour the invitation of the house."
  },
  {
    "headline": "Nigeria’s capacity to repay our loan is adequate, says IMF",
    "summarized_story": "The International Monetary Fund (IMF) says Nigeria has adequate capacity to repay its loan.\nThe IMF board commended the proactive approach of Nigeria’s authorities to contain the COVID-19 pandemic and its economic impacts.\n“Directors noted that Nigeria’s capacity to repay the Fund is adequate.\nThe directors emphasised the need for major reforms in the fiscal, exchange rate, trade, and governance areas to lift long-term, inclusive growth.\n“Directors welcomed the removal of the official exchange rate and recommended further measures towards a unified and market-clearing exchange rate to help strengthen Nigeria’s external position, taking advantage of the current favourable conditions."
  },
  {
    "headline": "Women and e-commerce: Capturing the $14bn opportunity in Africa",
    "summarized_story": "By contrast, female-owned businesses saw a 7% decline, per Women and E-commerce in Africa, a report by the International Finance Corporation (IFC) that examines the state of e-commerce across Kenya, Nigeria, and Ivory Coast.\nBut with equal participation rates from both men and women in e-commerce, the growth could be even higher, per the report.\nJuliet Anammah, Jumia Nigeria’s Chairwoman and Chief Sustainability Officer for the Group, notes that increasing the number of women selling through e-commerce platforms is crucial.\n“It’s clear one of the ways women can grow their businesses through e-commerce is participating on platforms,” Anammah says.\n“Cooperation between investors, e-commerce platforms, governments, and development organisations is needed to ensure a multi-stakeholder approach to address these issues."
  },
  {
    "headline": "The Next Wave: Who will win Africa’s music streaming wars?",
    "summarized_story": "According to a study by UK Research firm, Midia Research, worldwide streaming subscriptions grew by 26.4% in the second quarter of 2021.\nIt stood at 521.3 million subscribers at the end of the quarter, a huge growth from 109.5 million from the year before.\nAnghami has more than 70 million registered users and has a partnership with music’s Big Three—Universal Music Group, Sony Music, and Warner Music Group.\nStreaming services generated 84% of all US music revenue in the first 6 months of 2021, i.e.\nIn all, streaming subscriptions accounted for about two-thirds (65%) of total recorded music revenues in the first half of 2021 in the US."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "Nigeria’s identity management agency wants to replace ID numbers with digital tokens",
    "summarized_story": "India’s Aadhaar number is a good example of a widely successful digital identity project.\nNow NIMC has asked service providers to only verify NIN tokens, not the actual NINs.\nThis KYC policy update means that startups, telcos, and the organisations that use NIN will need to update their onboarding processes and app interfaces to be able to verify NIN tokens.\nAccording to Kasim Sodangi, Head of Compliance, NITDA, using NIN tokens to verify user identities will be cheaper for private companies’ KYC.\nUsers can create NIN tokens from NIMC’s mobile application or generate the tokens via USSD (*346*3*Your NIN*AgentCode#)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Who’s competing with fintechs?",
    "summarized_story": "AdvertisementMeanwhile, in Today’s Digest, we’d be discussingThe competition fintechs may not see coming, andThe tech/Afrobeats comboWho’s competing with fintechs?\nBut these fintechs might soon find themselves facing some stiff competition they might not have expected.\nAdvertisementIn this part of the world, streaming music didn’t become a thing until platforms like Soundcloud, Boomplay, and others burst onto the scene.\nNow, platforms like Spotify, YouTube Music, and Apple Music are currently trying to take a huge piece of the African pie.\nThey’ve also helped catapult Afrobeats — one of Africa’s most prominent exports on the music scene — to the world stage faster."
  },
  {
    "headline": "4th edition of Africa Tech Summit set to take place live in Nairobi on Feb 23-24th",
    "summarized_story": "Share this article:Nairobi, Kenya, Feb 4th , 2022 — The African tech ecosystem will finally have the opportunity to connect again in person at the fourth edition of Africa Tech Summit taking place in Nairobi, Kenya on February 23-24, 2022.\nCross-section of panelists at Africa Tech Summit Kigali (Feb. 2020)The 2022 edition will host three tracks — The Money and DeFi Summit , Africa Start-up Summit and the Africa Mobile Summit which drive interaction and a future line of sight across a range to sectors.\nAndrew Fassnidge, Founder of Africa Tech Summit (ATS) shared “We are delighted to be back in person for the fourth edition of Africa Tech Summit, live in Nairobi.\nFor more details please https://www.africatechsummit.com/nairobi/ @AfricaTechSMT /Africa Tech Summit Nairobi Africa Tech Summit Nairobi (ATSNBO) is a leading African tech event providing insight and networking with the African tech ecosystem.\nATSNBO brings together tech leaders, MNO’s, corporates, start-ups, international investors, entrepreneurs, governments, trade bodies, media and leading ventures to drive investment and business in African tech."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "Dangote Refinery to curb petrol import, subsidy impact muted",
    "summarized_story": "The current expectation is that the incoming Dangote Refinery will solve all of Nigeria’s petrol subsidy woes, the government thinks, but findings by BusinessDay show otherwise.\n“The Dangote Refinery will not solve the myriad of challenges bedevilling Nigeria’s downstream sector such as lack of transparency, accountability, the domineering stature,” he says.\nFor Adedipe, the Dangote Refinery is built on dollar-denominated loans, which means the project would focus more on speedily generating the dollars to services and repay those loans rather than selling cheap petrol.\n“The pump price of petrol from Dangote Refinery will reflect the market price of crude and cost of production, which will not be static at any point,” Adedipe notes.\n“Dangote Refinery as a silver bullet to solving Nigeria’s foreign exchange problem is a misunderstanding of the facts."
  },
  {
    "headline": "Dangote Refinery to curb petrol import, subsidy impact muted",
    "summarized_story": "The current expectation is that the incoming Dangote Refinery will solve all of Nigeria’s petrol subsidy woes, the government thinks, but findings by BusinessDay show otherwise.\n“The Dangote Refinery will not solve the myriad of challenges bedevilling Nigeria’s downstream sector such as lack of transparency, accountability, the domineering stature,” he says.\nFor Adedipe, the Dangote Refinery is built on dollar-denominated loans, which means the project would focus more on speedily generating the dollars to services and repay those loans rather than selling cheap petrol.\n“The pump price of petrol from Dangote Refinery will reflect the market price of crude and cost of production, which will not be static at any point,” Adedipe notes.\n“Dangote Refinery as a silver bullet to solving Nigeria’s foreign exchange problem is a misunderstanding of the facts."
  },
  {
    "headline": "10 key projects Nigeria can fix with N3trn subsidy spree",
    "summarized_story": "HealthcareFor instance, an analysis by BusinessDay shows the proposed subsidy spree of N3 trillion can fully equip 100,000 primary health centres across the country (at N30m each).\nSolar electricityThe subsidy spree is also capable of adding 27,342 megawatts (MW) of solar electricity to the national grid at N360 million per megawatt.\nThis means N3 trillion is capable of building 176,470 blocks of classrooms needed across Nigeria’s 774 local governments.\nThe subsidy spree is also capable of providing educational support through the tertiary level to 600,000 Nigerian children provided with educational support through the tertiary level at N5 million each.\nGood roadsThe decision to allocate N3 trillion to petrol subsidy also means Nigeria may have lost an opportunity to construct 6,000km of roads across major highways at N500 million each."
  },
  {
    "headline": "Edo NEWMAP inspects ongoing flood control projects, assures speedy completion – Nigerian Observer",
    "summarized_story": "Obaseki stated that the need to adhere to quality and guidelines informed the inspection exercise.\nHe reassured that the government will sustain efforts at tackling the problem of flooding and erosion across all Edo communities.\nResidents of Igbei, who spoke to journalists during the inspection, hailed the governor for putting the people at the forefront of his administration’s programmes and policies.\n“But the Governor Obaseki-led government through Edo State NEWMAP intervention has however changed this narrative with the near completion of this flood alleviation work in our community.\nThe stone-based road is the outcome of the underground drainage work done along the road, which now necessitated the asphalting of the road."
  },
  {
    "headline": "Group Urges Akhabue To Run For Edo Central Senatorial Seat – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAn Esan social cultural group — Esankugbe, with membership across the entire Edo Centre, has called on Ehia Olu Akhabue to join the Senate race for Edo Central Senatorial District.\n“ We are aware that someone like Senator Ordia once fought to frustrate Senator Ugbesia’s third term gambit.\nThe most honorable thing for him to do now is to back down and allow a fresh blood.\nWe know he has done his best these past 8 years and we appreciate him” the statement concluded.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "THREAT TO 2023 ELECTIONS: THE DANGER OF SPONSORTING THUGS TO WIN OSUN 2022 ELECTION – Nigerian Observer",
    "summarized_story": "Governor Oyetola is inducing violence in Osun APC by orchestrating thugs attack and manipulated the state APC congresses.\nThe illegality and the danger of sponsoring thugs to win Osun 2022 election poses a great threat to 2023 election in Nigeria.\nIllegal thugs funding for Osun 2022 election presents certain problems to future elections in modern liberal and the emerging democracy in Nigeria.\nThe outcome of Osun 2022 election may not reflect the interest of the majority in Osun State, but the interest of the financier of the thugs.\nThe danger ahead of Osun 2022 election is that Governor Oyetola used thugs to conduct APC state congress and he is set to use thugs against other political parties that will participate in the Osun 2022 election."
  },
  {
    "headline": "Edo completes training on e-governance for Permanent Secretaries, as Obaseki urges collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged the newly appointed Permanent Secretaries to foster the spirit of collaboration so as to achieve the Making Edo Great Again (MEGA) Agenda.\nThe governor made the call while addressing Permanent Secretaries and other participants at the closing ceremony of the onboarding programme for the Permanent Secretaries at the John Odigie-Oyegun Public Service Academy.\nHe noted, “We need to key into this new strategy and continue to use it in our everyday work as Permanent Secretaries to enable us to become professionals and masters of our fields.\n“It will enable you to treat files wherever you are and bring out your creativity.\nIt will put you in the right mode to effectively and efficiently deliver services to the state,” he said."
  },
  {
    "headline": "FCCPC, FRSC Partner To Curb Road Crashes By Articulated Vehicles",
    "summarized_story": "The Federal Competition and Consumer Protection Commission (FCCPC) has said the Commission would be stepping up its collaborative intervention with the Federal Road Safety Commission (FRSC) and on many fronts, including advocacy and public enlightenment to reduce road traffic fatalities caused by articulated vehicles.\nThe FCCPC said partnerships are effectively the back-bone for successful road safety achievements.\n“If citizens self-regulate and comply with the law, road accidents will be drastically reduced.\n“I don’t think we need parliament to agree by consensus that we needlessly lose people to road accidents.\nHe advised that emergency response to protect victims of traffic accidents and consumers in the country should be given priority."
  },
  {
    "headline": "Kwara NSCDC Arrests Suspected Human Trafficker, Recovers 3 Children",
    "summarized_story": "Operatives of the Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC) have arrested a 58-year-old woman, Mrs Modupe Bello over her alleged involvement in human trafficking and child labour.\nThe NSCDC’s operatives recovered three children in the woman’s custody during a raid on her residence at B5, Cappa street, Bacita, Edu local government area of the state.\nThe spokesman of the NSCDC in the state, Babawale Afolabi who confirmed the development said Mrs Bello’s arrest followed a complaint by a resident on the missing of his 18- year- old daughter.\nAfolabi added:” One Agbaje Oluwafemi came to the Bacita Divisional Office of the NSCDC to report that his 18 years old daughter, Damilola Agbaje was missing.\nADVERTISEMENT” Detectives from the intelligence and investigations department later swung into action and a raid was carried out at the woman’s residence in Bacita where three children were recovered while some photographs believed to be of the children that she had trafficked were also recovered."
  },
  {
    "headline": "Veteran Journalist, Sports Administrator, Peter Osugo, Dies",
    "summarized_story": "Renowned sports administrator and journalist, Pa Peter Chukwuma Osugo, popularly known as PECOS, has died at the age of 92.\nOsugo, also known as Jet Forces, was ex-Editor of the Sunday Times and Team Manager of the National Team and defunct Stationery Stores Football Club.\nOsugo joined the Nigeria Geological Survey in Kaduna as a technical assistant before finding his true calling as a journalist.\nADVERTISEMENTAdebajo approached PECOS to become the Team Manager of Stationery Stores Football Club, which became the lightning rod for Nigerian football with a fanatical Lagos and national fan base.\nPECOS was invited to become the Team Manager with up to nine Stores players in the national team."
  },
  {
    "headline": "Veteran Journalist, Sports Administrator, Peter Osugo, Dies",
    "summarized_story": "Renowned sports administrator and journalist, Pa Peter Chukwuma Osugo, popularly known as PECOS, has died at the age of 92.\nOsugo, also known as Jet Forces, was ex-Editor of the Sunday Times and Team Manager of the National Team and defunct Stationery Stores Football Club.\nOsugo joined the Nigeria Geological Survey in Kaduna as a technical assistant before finding his true calling as a journalist.\nADVERTISEMENTAdebajo approached PECOS to become the Team Manager of Stationery Stores Football Club, which became the lightning rod for Nigerian football with a fanatical Lagos and national fan base.\nPECOS was invited to become the Team Manager with up to nine Stores players in the national team."
  },
  {
    "headline": "Experts Decry Prevalence Of Cancer In Nigeria",
    "summarized_story": "Chairman, Me Cure Healthcare Limited, Samir Udani has decried the prevalence of cancer disease and poor attention being given to it in Nigeria.\nIn a bid to increase the survival rate of cancer patients in Nigeria, he said Me Cure Healthcare Limited has opened the first comprehensive cancer centre with Positron Emission Tomography and Computed Tomography (PET/CT), in Lagos State.\n“During the cause of treatment, the PET/CT can help to detect if the treatment being given to the patient is working or not.\nSix months after the treatment, the machine can help to detect if the cancer has been completely treated or if there are some cancerous cells still remaining in the body.\nAlso commending on the development, the chief strategist of Me Cure, Dr Kunle Megbuwawon, said it would help to reduce the financial burden of cancer patients, saying the health facility has set up a crowdfunding for PET/CT to help those who are unable to get the required funding."
  },
  {
    "headline": "Hushpuppi: Prima facie case established against Abba Kyari, says Malami",
    "summarized_story": "Attorney General and Justice Minister, Abubakar Malami said a prima facie case has been established against deputy commissioner of police Abba Kyari, who was indicted in a U.S. court.\nIt was in connection with a fraud case involving Ramon Abbas Olorunwa a.k.a Hushpuppi.\nThe justice minister spoke on some of the actions his ministry is taking quietly regarding the damning allegations against Kyari as revealed in FBI filings in a California court.\nMalami said Nigeria is collaborating with the United States government to ensure justice is served.\nPart of the money was allegedly given to Kyari as compensation to punish a partner of Hushpuppi, who was trying to disrupt the scam."
  },
  {
    "headline": "Mali begs for lifting economic sanctions",
    "summarized_story": "Mali’s government has asked the West African Economic and Monetary Union (UEMOA) to lift sanctions that will have severe consequences for the population, it said on Monday.\nWest Africa’s 15-nation ECOWAS bloc and the UEMOA regional monetary union both imposed sanctions on Mali on Jan. 9 after the military junta that first seized power in a 2020 coup decided to delay a national election.\nThe UEMOA, which has eight member countries including Mali, instructed all financial institutions under its umbrella to suspend Mali with immediate effect.\nMali blamed the sanctions for $31 million in bond defaults last week.\nThe European Union has imposed sanctions on Mali’s transitional prime minister and members of interim president Assimi Goita’s inner circle."
  },
  {
    "headline": "2023: Osinbajo Denies Planning To Declare For Presidency After APC Convention",
    "summarized_story": "Vice President Yemi Osinbajo has debunked news of his purported plan to announce his presidential bid ahead of the 2023 elections after the All Progressives Congress, APC, convention.\nReports had emerged online on Monday that Osinbajo would announce his intention to run for 2023 presidency soon.\nHowever, Osinbajo through his spokesman, Laolu Akande, clarified that the report making the rounds is false and speculative snippets.\nHe added that any information on the action of the Vice President will come directly from his office and not press.\nThe tweet read: “I’ve seen “news” that VP’ll announce presidential bid after APC’s convention."
  },
  {
    "headline": "BREAKING: Osun 2022: Ademola Adeleke Reportedly Storms Out Of PDP Peace Meeting",
    "summarized_story": "Senator Ademola Adeleke, a leading PDP candidate for the Osun 2022 gubernatorial election, has stormed out of a peace and reconciliation meeting convened by a former governor of the state, Prince Olagunsoye Oyinlola in his Okuku house, according to DAILY POST.\nAccording to our sources, Adeleke, who is trailed by five other hopefuls, was unhappy with the meeting’s direction.\nWhen reached, Oladele Bamiji, the Osun PDP Director of Media and Publicity, said he couldn’t say much because he wasn’t at the peace meeting, but that he will get back to us with more information.\nThe meeting went well.\n“By the grace of God, come March 7, 2022, we are going to have our party primary."
  },
  {
    "headline": "2023 Presidency: Muslim Clerics Shun Gov Mohammed, Prays For Yahaya Bello In Bauchi",
    "summarized_story": "Despite Bauchi State Governor Bala Abdulkadir Mohammed’s rumored presidential ambitions, approximately 500 Muslim clerics from the state’s 20 local government areas have decided to pray for Kogi State Governor’s ambition.\nClerics gathered in Bauchi to offer special prayers for Governor Yahaya Bello to be elected President of Nigeria in 2023.\nThe clerics, predominantly Imams and Qur’anic school professors, prayed specifically to Allah to approve their demand and elevate Yahaya Bello to the nation’s coveted Aso Rock seat.\n“We were moved by the youthfulness of Yahaya Bello aspiring for the nation’s much-coveted seat in the efforts to fix the country.\nImam Azare said he was optimistic that their prayers would provide the much-desired leadership for Nigeria even if such was not bestowed on Governor Bello."
  },
  {
    "headline": "JAMB Announces Code For Registration, Introduces WhatsApp Platform",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has announced the addition of a new 66019 registration code to its current 55019 code.\n“In essence, both codes are to be used to create profiles for the registration by candidates sitting for the 2022/23 examination.\nJAMB also said it has introduced the use of a WhatsApp platform, as an additional support and complaint platform for clients.\n“With the platform, candidates and other stakeholders would have the benefit of instant messaging and solutions to whatever query they might have regarding any of the operations of the board.\n“The platform is not meant to replace but complement the existing ticketing system, thereby expanding access to critical services among others,” JAMB said."
  },
  {
    "headline": "Zaɓen sabbin shugabannin ƙungiyar MOPPAN ya zo da sabon salo",
    "summarized_story": ""
  },
  {
    "headline": "Kannywood: Babban Kwamandan Hisbah ya watsa wa Shugaban Hukumar Finafinan Kano ƙasa a ido",
    "summarized_story": "Kazalika, gwamnan ya ɗauki nauyin bai wa ɗaruruwan ’yan masana’antar horo na musamman kan sana’ar tasu, wanda Kamfanin Moving Image ya jagoranta.\nA ƙa’ida ta shirya finafinai, furodusa ne ke da haƙƙin mallakar kowane izini kan fim ko waƙa, ba darakta ba.\nAn ce, shi kansa Gwamna Ganduje ya fusata kan yadda ya kyautata wa ’yan Kannywood, don a tsaftace masana’antar, amma a ƙarshe ya dawo ya zama abin zunɗe a wajensu.\nWannan ya sanya shi fara tunanin daga dukkan alamu ya ɗauko mugun hannu ne a cikinsu, domin maimakon ya samu yabo a wajensu, sai ya koma ya na shan bugu.\nWani sashe yayin liyafarSheikh Ibn Sina ya gabatar da doguwar addu’a a wajen taron yana mai roƙon Allah da ya inganta dangantakar masu shirya fim da Gwamnatin Kano, domin amfanin Musulunci da Musulmi, kuma ya roƙi Allah ya sanya albarka a cikin sana’ar shirin finafinan Hausa a jihar da ma ƙasa bakiɗaya."
  },
  {
    "headline": "Uwa ta kai ɗanta kotu a Kano",
    "summarized_story": ""
  },
  {
    "headline": "Tasirin abokan miji a zaman aure",
    "summarized_story": "Bar ta wannan zancen ma, ko kafin neman aure, har ma da lokacin biki dukka abokan ango suna da muhimmiyar rawar da suke takawa.\nBa zai yiwu don namiji kawai ya yi aure ba ya tare wajen matarsa kacokam.\nBa su da lokacin da za su zauna su karanci matansu har su fahimci juna.\nSai dai su irin waɗannan abokan ba su da yawa, kuma ba su da tasiri sosai saboda su za su faɗi gaskiya mai ɗaci ne.\nKa ji tsoron Allah ka yi zuga da shawarwari mugaye da za su jawo ya rushe ko a samu tazgaro a zaman aure."
  },
  {
    "headline": "Hushpuppi: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGF",
    "summarized_story": "The Nigerian government on Monday revealed some of the actions it is taking under the radar regarding the allegations against a police officer, Abba Kyari, and suspected fraudster, Ramon Abbas, popularly known as Hushpuppi.\nTop of these actions, according to the Minister of Justice and Attorney-General of the Federation (AGF), Mr Abubakar Malami, is the collaboration with the United States government to ensure justice is served.\nHaving spent about one year in custody maintaining his innocence, he later pleaded guilty to multi-million-dollar fraud charges filed against him by the American government.\nSix months after his suspension, the AGF told Channels Television on Monday that the Nigerian government was working with the U.S. on the cases against Kyari and Hushpuppi.\nExtradition LikelyMalami described Hushpuppi’s case as one involving multiple jurisdictions – Nigeria, the U.S., and the UAE."
  },
  {
    "headline": "2023: Nigeria Is Living On Extra Time – Sanusi",
    "summarized_story": "Ahead of the general elections, former Emir of Kano, Muhammadu Sanusi II, has said that Nigeria is living on extra time with deeper challenges to be confronted from 2023.\nREAD ALSO: Tinubu Returns To Nigeria After 10 Days Of ‘Consultation’ In UK“To be honest, we are living on extra time.\nIn 2023, we will be in an even much deeper hole than in 2015,” he said.\nThis country needs good politicians.\nIt needs imams, pastors, and bishops who are going to stand up and remind them (politicians) of the fear of God."
  },
  {
    "headline": "NFF Retains Eguavoen As Eagles Technical Adviser, Names Amuneke Chief Coach",
    "summarized_story": "The Nigeria Football Federation (NFF) has retained Austine Eguavoen as the interim technical adviser of the Super Eagles.\n“The NFF Board has approved a recommendation of the Technical and Development Committee retaining Augustine Eguavoen as Technical Director/Technical Adviser (interim) while Emmanuel Amuneke becomes the Chief Coach of the Super Eagles.\nNigeria’s next assignment is the 2022 FIFA World Cup playoff against Ghana billed for March.\n“We acknowledge and appreciate the interest that Mr Jose Peseiro has shown in Nigeria Football during our very cordial discussions and have absolutely no doubt about his capacity.\nWe believe that perhaps in the future, there could be an opportunity to work with him,” the NFF statement explained."
  },
  {
    "headline": "UPDATED: 104 ISWAP Fighters, Families Surrender To Troops In Borno – Army",
    "summarized_story": "One hundred and four members of the Islamic State West Africa Province (ISWAP) and their families have surrendered to troops, the Nigerian Army has said.\nThe army disclosed this on Monday via its verified Facebook page where it shared photos of some of the repentant terrorists and their relatives.\nAccording to the army, the former ISWAP fighters surrendered their weapons on Saturday to troops of the 25 Task Force Brigade in Damboa town of Borno State.\nThe latest feat comes barely two months after 192 people surrendered to troops fighting ISWAP and Boko Haram fighters in the North East.\nSee the photos shared by the army below:"
  },
  {
    "headline": "Terrorism Financiers: Nigerians Will Get Something Tangible In A Few Weeks – Malami",
    "summarized_story": "The Minister of Justice and Attorney General of the Federation (AGF), Abubakar Malami, on Monday, urged Nigerians to be patient with regards to the issue naming financiers of terrorism in Nigeria.\nWhile appearing as a guest on Channels Television’s Politics Today, the Justice Minister assured Nigerians that in a couple of weeks, the citizens will get something tangible to hold on to.\n“You will be happy with what we are doing as a government in a couple of weeks.\nThe Attorney General further assured that processed have been consummated in line with the dictates of the law.\nAccording to the minister, the analysis has resulted in the arrest of 45 suspects who will soon face prosecution and seizure of assets."
  },
  {
    "headline": "Move to impeach Deputy Gov. Mahdi Aliyu constitutional",
    "summarized_story": "The Zamfara State House of Assembly said it’s move to impeach the state Deputy Governor Mahdi Aliyu Gusau is Constitutional.\nThe assembly said the deputy governor has bridged the constitution.\nAdvertisementAddressing newsmen, the Chairman House committee on Information, Shamsudeen Bosko said the speaker has dully served the Deputy Governor through the Secretary to the State Government the impeachment notice.\nThe Zamfara House of Assembly is accusing the state Deputy Governor of abuse of office which includes constitutional breached of section 190 and 193 (1), (2) (a)(b)(c), of the Constitution of the Federal Republic of Nigeria 1999 (as amended).\nAdvertisementThe Zamfara State House of Assembly had been at logger head with the deputy governor over plans to Impeach himA federal high court in Abuja had last restrained the House from making any move to Impeach the Deputy Governor."
  },
  {
    "headline": "Governor Wike visits former Governor Makarfi in Kaduna -",
    "summarized_story": "Rivers State Governor Nyesom WIke says Nigeria is bleeding and the Peoples Democratic Party (PDP) will be disappointing Nigerians if they don’t reunite to rescue the country and chart a new way forward.\nHe stated this in Kaduna state when he led a delegation of PDP stalwarts to visit the leader of the party and former Governor of Kaduna state after his return from a medical tour to the United Kingdom.\nAdvertisementAhmed Makarfi, who was glad to recieve the Rivers Governor was full of appreciation and commended him for his contribution towards the Successful conduct of the the Partys’ nation convention."
  },
  {
    "headline": "Buhari holds bilateral meeting with Ethiopia Prime minister",
    "summarized_story": "President Muhammadu Buhari and Prime Minister Abiy Ahmed, on Sunday in Addis Ababa, Ethiopia, said African growth and development will require strong, visionary leadership that caters to the needs of the people, and effectively strengthens institutions that encourage peaceful co-existence, while providing disincentives to conflicts and coups.\nAt a meeting between both leaders at the Headquarters of the African Union, President Buhari commended the efforts of the Prime Minister in maintaining peace and unity in the country, and dedication to ensuring fairness and justice in development.\nAdvertisement"
  },
  {
    "headline": "Nigeria will continue to pursue peace, progress in Africa, World",
    "summarized_story": "Nigeria will continue to pursue peace and progress in Africa and the world at large by consistently seeking for justice, fairness and inclusiveness in global affairs.President Muhammadu Buhari stated this today at the ongoing African Union meetings in Addis Ababa, Ethiopia.\nAdvertisementHe assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nThe Heads of State and Government of the African Union have elected President of the Republic of Senegal, Macky Sall, as the new Chairperson of the African Union for the year 2022.\nAdvertisementThe event took place during the ongoing thirty-Fifth Ordinary Session of the Assembly of the Union, holding at the AU Headquarters in Addis Ababa.\nAdvertisementIn his inaugural speech, President Sall said Africa is beset by a multitude of problems despite its commendable progress over the past few decades."
  },
  {
    "headline": "24 Year Old Girl Arrested For Buying Contraceptives – What’s Trending",
    "summarized_story": "Nigeria’s Presidency on Sunday faulted a report on security challenges in the country, published in the January 31, 2022 edition of Financial Times of London Newspaper, saying banditry has been caged to the level that no territory in the country was under terrorists control.\nIn another breath, the Minister of Defence, Maj. Gen. Bashir Magashi (rtd), said at the weekend that the federal government was committed to providing more platforms for the military to sustain the tempo of operations in order to contain insurgency, banditry and other security challenges across the country.\nA 24 year old student of the Moshood Abiola Polytechnic, Abeokuta, Ogun State, Olanipekun Irenimofe, was recently arrested by the police and behind bars for buying a pregnancy test kit and contraceptive from a pharmacy."
  },
  {
    "headline": "Canada Trucker Protest: Ottawa Declares Emergency",
    "summarized_story": "The mayor of Canada’s capital Ottawa has declared a state of emergency in response to more than a week of truckers’ protests against Covid restrictions.\nJim Watson said the city was “completely out of control”, with demonstrators outnumbering police.\nA state of emergency will give the city additional powers, including access to equipment required by frontline workers and emergency services.\nOne demonstrator who drove for hours to join the protest in Ottawa, Kimberly Ball, told the AFP news agency that the protest was “about our freedom”.\nCovid-19 vaccines have cut the risk of severe illness in those infected with the virus and serious side effects are extremely rare."
  },
  {
    "headline": "Olatorera Majekodunmi-Oniru: I’m the Right Person for Ogun Central Senatorial Seat",
    "summarized_story": "More young Nigerians are beginning to heed the call for service by declaring their political ambitions ahead of the 2023 elections.\nOne of such aspiring politicians is Olatorera Majekodunmi-Oniru who has thrown her hat into the Ogun Central Senatorial contest.\nAccording to Ms Majekodunmi-Oniru, 2023 will usher in a new election cycle in the country, and young Nigerians must be ready to take over the baton and lead painstakingly."
  },
  {
    "headline": "Nigeria Faults Financial Times Report on Insecurity, Says Nowhere Controlled By Terrorists",
    "summarized_story": "According to the one-page letter, the presidency stated: “The caricature of a government sleepwalking into disaster (What is Nigeria’s government for?\nJanuary 31, 2022 ) is predictable from a correspondent, who jets briefly in and out of Nigeria on the same British Airways flight he so criticises.\nThe terror organisation Boko Haram used to administer an area the size of Belgium at inauguration; now, they control no territory.\nHe reassured the Nigerian army that the ministry would continue to accord the welfare of officers and soldiers and their family a priority.\nHe recalled the gallant performance and sacrifices of the Nigerian army personnel in counterterrorism, counter insurgency and other operations across the country."
  },
  {
    "headline": "Nigeria: Five Days After, Three Crewmen in SEPCOL Oil Platform Explosion Found Alive",
    "summarized_story": "Five days after a Floating Production Storage and Offloading (FPSO) facility belonging to Shebah Exploration and Production Company Limited (SEPCOL) exploded in Warri, the company on Sunday announced that three crew members aboard the ship had been found alive.\nThe statement said, “We can confirm that three crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need.\n“Furthermore, in the early hours of Sunday, 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\nThe FPSO serves as the primary production facility for OML 108 and it is also a government approved terminal for lifting operations for all the facility’s production.\nIkeazor said the National Oil Spill Detection and Response Agency (NOSDRA) had called the oil industry operators and the Clean Nigeria Associates, a cooperative responding to oil spill incidents, for support."
  }
]