[
  {
    "headline": "Cassava production training for 1,000, ex-militants begins in 2022",
    "summarized_story": "Dennis Naku, Port HarcourtThe Project Management Consultant for the 60-daily-metric-ton Bayelsa Cassava Processing Factory, Mr Adebowale Ayoade, has said about 1000 ex-agitators and delegates of the Presidential Amnesty Programme will begin training at the facility in the first quarter of 2022.\nAyoade, however said the training was subject to the approval of PAP’s leadership.\nHe described the facility as the biggest industrial starch plant in Nigeria and the second largest in Sub-Saharan Africa, saying delegates would receive theoretical and practical trainings on cassava cultivation, starch processing and management.\nAyoade while speaking to newsmen in Port Harcourt, Rivers State on Monday, explained that after the training, the ex-agitators would become out-growers of cassava stems to feed the factory.\nHe said the facility would buy all the cassava from the farms to be established by trained delegates, adding that the training would be handled by resource persons certified by the International Institute of Tropical Agriculture."
  },
  {
    "headline": "Poultry supply gap hits 529,000MT despite 85 million farmers – FG",
    "summarized_story": "The Federal Government on Monday put the supply gap of poultry meat in Nigeria at 529,000 metric tonnes despite having 85 million Nigerians who into one form of poultry business or the other.\nThe Minister of Agriculture and Rural Development, Muhammed Mahmoud, disclosed this at the inauguration of the cottage poultry processing facility in Dei-Dei livestock market, Abuja.\n“The FMARD 2019 projection of poultry meat output and demand put the national output at 551,000MT and demand at 1,080,000MT, thus leaving a supply gap of 529,000MT,” Mahmoud stated.\n“Of these, about 44 per cent, are raised in extensive systems, 33 per cent in semi-intensive, and 23 per cent in intensive systems,” he stated.\nMahmoud said the establishment of the cottage poultry processing facility within the Dei-Dei market was part of the Federal Government’s efforts in transforming the livestock industry."
  },
  {
    "headline": "How I endured hardship in London before getting breakthrough in business – Kevin Olu",
    "summarized_story": "Kevin Olu, has revealed how he endured hardship abroad before getting his first major breakthrough in business and life.\nI started working in the toilet, arranging perfume, telling people to freshen up for the ladies, inside the toilet.\nHe asked me to start working with him and as i started working with him, that was how all my breakthrough came.\nI went into politics snd started running my own business”, added Hon Kevin Olu.\nI worked and struggled my way to the success I attained today,” said Hon Kevin Olu, who holds a Diploma in Business Administration and Bsc."
  },
  {
    "headline": "Civil flight operations to commence from Benue in December – FAAN",
    "summarized_story": "The Federal Airports Authority (FAAN)The Federal Airport Authority of Nigeria (FAAN), and the Nigeria Air Force (NAF) have signed a memorandum of Understanding (MoU) to resume civil flight operations in Makurdi.\nThe News Agency of Nigeria (NAN) gathered that the civil flight operations route would be from Makurdi to Abuja to Lagos and Lagos to Abuja to Makurdi.\nThe FAAN Director of Legal, Dr Clifford Omozeghian, said that the civil aviation operations would serve as a catalyst of development in Benue.\nHe promised to deliver on the terms of the memorandum entered with them, adding that flight operations would resume in December.\nMeanwhile, the Chief of Air Staff, Air Marshal Ishaku Amao, pointed out that the decision to sign the of joint user agreement for the civil flight operations is to fulfill their Cooperate Social Responsibility."
  },
  {
    "headline": "Female actors and ‘immoral content’ banned from Afghan TV",
    "summarized_story": "The Taliban government in Afghanistan has imposed a series of draconian restrictions on what can be shown on the nation’s TV screens.\nFrom now on, TV stations will no longer be allowed to show dramas featuring women or that contradicts the militant Islamists’ hard-line interpretation of Sharia law or Afghan values.\nThis is in accordance with a directive issued to TV stations by the Ministry for the Promotion of Virtue and Prevention of Vice.\nBroadcasting of films that promote foreign cultures or traditions in Afghan society, or which provoke immorality, is also to be prohibited, the directive said.\nWhile women are no longer permitted to act, female presenters and reporters, are still permitted to appear on Afghan television on condition they wear the hijab."
  },
  {
    "headline": "#ENDSARS: Adamawa panel submits report to Fintiri",
    "summarized_story": "The Adamawa Commission of Inquiry on the alleged police brutality has submitted its reports to Gov.\nThe panel led by Justice, Adamu Hobon, Chairman of the commission, presented the report to the governor on Monday in Yola.\n“We hope it will be useful to the government of Adamawa State with regards to the purpose for which this commission was constituted.\nREAD ALSO: Endsars Panel in Adamawa submits report to Gov Fintiri“We sincerely urge for acceptance and implementation as your Excellency may deem fit,” he said.\nFintiri said that the report would be studied and fully implemented by the state government."
  },
  {
    "headline": "Delta variant still dominant COVID in Nigeria – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the Delta variant continues to be the dominant strain of Coronavirus in the country.\nThe NCDC Director-General, Dr Ifedayo Adetifa, made this known at the bi-weekly national briefing on COVID-19, in Abuja on Monday.\n“The team is currently collaborating on the development of a COVID-19 response sustainability plan and an intra action review to strategise on ways to reinvigorate the response,” he said.\n”So far, 138 COVID-19 positive cases have been detected in the country’s seaports and offshore platforms.\n“The positive cases detected among oil rig workers has also dropped significantly."
  },
  {
    "headline": "Birds strike Lagos-bound Air Peace flight",
    "summarized_story": "Air Peace flight P47159 Owerri to Lagos had a bird strike on Monday, a few minutes after take-off.\nHead of Communications, Stanley Olisa confirmed the incident in a statement.\nThe pilot diverted to Port-Harcourt, safely landed the aircraft and the passengers disembarked.\n“We have dispatched a rescue team and aircraft to airlift the passengers of the affected flight”, Olisa noted.\nThe statement assured of the airline’s commitment to the highest standards of safety."
  },
  {
    "headline": "Insecurity: You’ve allowed you bandits, terrorists kinsmen to operate freely, kill citizens – HURIWA to Buhari",
    "summarized_story": "The group wondered why the Commander-in-Chief of the Armed Forces, President Muhammadu Buhari, has failed to carry out his primary responsibility of protection of lives and properties of citizens.\nFurthermore, HURIWA cited the Global Terrorism Index (2019) which ranked Nigeria as the third-worst nation prone to terrorism with no improvement since 2017.\nThe group underlined the fact that many citizens are calling for the resignation of Buhari for “failing” to secure the country.\nDAILY POST can report that terrorists, who are referred to as bandits, have continued to operate freely in the North West Nigeria despite the shutting down of telecommunications In some areas in the region by the Federal Government.\nJust yesterday, there were cases of abduction of commuters travelling the Abuja-Kaduna highway by gunmen suspected to be bandits."
  },
  {
    "headline": "Help rescue education from catastrophic decay in Yobe – Govt begs civil servants",
    "summarized_story": "The Yobe State Government on Monday appealed to civil servants in the state to heartily support the government in its bid to rescue the state from the catastrophe of education decay.\nThis is following the destruction of the education system in the state as a result of the years of insurgency.\nThe Chairman Publicity Sub Committee for Yobe Education Recovery Appeal Fund, Hon.\nMuhammed Lamin, who is also the state Commissioner for Home Affairs, Information and Culture, said this during a press briefing to update the media on the state of preparation toward the forthcoming Yobe State Education Recovery Fund Raising schedule for December, 4th 2021.\nHe said it is longer news that the decade – long insurgency has impacted negatively on the entire lives of the citizenry."
  },
  {
    "headline": "Insurgency: You don’t need to go on television when you’re winning war – Wike tells CAS, Amao",
    "summarized_story": "Governor Nyesom Wike of Rivers State has commended the military for the success achieved in the fight against insurgency in the country.\nWike gave the commendation on Monday during a courtesy visit by the Chief of Air Staff, Air Marshall Isiaka Amao, at Government House, Port Harcourt.\nThe governor told Amao that he doesn’t need to go on the television to tell Nigerians that they are secured when the military is winning the war against insurgency.\nWhen people are secured, you don’t need to go to television to tell them that they are secured.\nWike pointed out that the prevailing peace in Rivers State was achieved because of the existing cooperation between all the heads of security with the state government."
  },
  {
    "headline": "FG reiterates commitment to alleviate poverty, unemployment through MSMEs development",
    "summarized_story": "The Federal Government has reiterated commitment to sustain partnership with private sectors and other critical stakeholders to strengthen Micro, Small and Medium Enterprises, MSMEs in order to alleviate poverty, unemployment and other economic challenges bedeviling the country.\nThe Permanent Secretary, Federal Ministry of Industry, Trade and Investment, Dr Evelyn Ngige, stated this on Monday at the opening of the technical session of the 13th meeting of the National Council of Industry, Trade and Investment, (NCITI).\nThis, she said, had led to the review of the National policy on Micro Small and Medium enterprises to encourage the establishment of more small and medium scale enterprises across the length and breadth of the country.\nDr Ngige commended Governor Kayode Fayemi and Ekiti State Government for the impressive support given to the council and for providing a conducive environment for the hosting of its 13th National Meeting.\nIn his welcome remarks, the State Commissioner for Industry, Trade and Investment, Aare Muyiwa Olumilua, said the primary focus of the annual meeting was to proffer policies and solutions to the industry, trade and investment sector and to champion a course that would transform the nation’s economy."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Nollywood veteran comedian Baba Suwe dies at 63",
    "summarized_story": "By Gbenga Bada, Alao Abiodun and Sam AnokamNigerians expressed shock and grief yesterday as popular Nollywood actor/comedian, Babatunde Omidina (aka Baba Suwe), died.\n- Advertisement -“This is to announce the sudden death of my father, Babatunde Omidina, the legend and rare gem, Baba Suwe, on November 22, 2021.\nBaba Suwe became popular for his comic roles in several Nollywood films and television productions between late ‘80s and mid-‘90s.\nPresident of the Actors Guild of Nigeria (AGN), Emeka Rollas, yesterday mourned Baba Suwe.\nMay God grant him eternal rest.”Also, some Nollywood actors, including Yewande Adekoya Abiodun, Sola Kosoko Abina, Muka Ray, and Sunny Alli, yesterday mourned Baba Suwe."
  },
  {
    "headline": "Ortom urges Benue residents to defend selves against herders",
    "summarized_story": "Benue State Governor Samuel Ortom has urged the residents to stop running away from herdsmen attacks.\nThe governor advised the people to stand up and defend their land against invaders.\nNow is the time to defend our land.\nAlso, Ortom has urged the Federal Government to provide security agencies with sophisticated weapons and gadgets to rid Nigeria of criminality.\n“I am pained that the security agencies lack sophisticated weapons; yet, they work tireless to secure our lives and property."
  },
  {
    "headline": "Absence of interpreter forces court to shelve Igboho’s aides’ arraignment",
    "summarized_story": "The scheduled arraignment of two aides to Yoruba nation agitator, Sunday Adeyemo (Sunday Igboho) – Jamiu Oyetunji and Amudat Babatunde – was stalled yesterday at a Federal High Court in Abuja, following the court’s inability to get an interpreter.\nThe DSS claimed that the defendants were involved in terrorism acts and allegedly had in their possession some prohibited firearms.\nAt the mention of the case, the defendants’ lawyer, Pelumi Olajengbensi, told the court that his clients do not understand English language.\n- Advertisement -Olajengbesi requested for an interpreter to enable his clients understand the court’s proceedings.\nEffort by the court to get an interpreter failed, and Justice Obiorah Egwuatu shifted the arraignment till January 24."
  },
  {
    "headline": "WAEC raises exam fee from N13,950 to N18,000",
    "summarized_story": "The West African Examinations Council (WAEC) has increased its examination fee per candidate from N13,950 to N18,000 for the 2022 West African Senior Secondary School Certificate Examination (WASSSCE).\n“We have received approval from the appropriate quarters, with effect from the WASSCE for school candidates 2022, to charge N18,000 per candidate.\nWe are, therefore, asking all school principals to collect N18,000 per candidate for registration.\nA part of this new fee has been dedicated to the enhancement of the remunerations for the various examination functionaries,” he said.\nAreghan announced that 81.7 per cent of the candidates who took the 2021 WASSCE for school candidates made Credit passes in five subjects, including English and Mathematics."
  },
  {
    "headline": "Rivers witnesses 3 fire outbreaks in 72 hours",
    "summarized_story": "From TONY JOHN, Port HarcourtProperty worth billions of naira have been lost, as fire outbreaks occurred at three different locations in Port Harcourt, Rivers State, in less than 72 hours.\nOn Monday, the third fire incident occurred at the Bonny/Bille Jetty and burnt several boats and destroyed goods and property.\nThe Federal Fire Service said its officials escaped mob action at the Bonny/Bille jetty, when they responded to contain the escalation.\nCommander of the Federal Fire Service in Rivers State, Abdullahi Audu Alfa, disclosed this to journalists.\n“Please, I want to plead with Rivers State people, government cannot do everything for you."
  },
  {
    "headline": "Veteran Nollywood Comedian “Baba Suwe” dies at 63",
    "summarized_story": "Veteran Nollywood actor and comedian, Babatunde Omidina, popularly known as “Baba Suwe”, has been confirmed dead, aged 63.\nThe death of “Baba Suwe” was confirmed to the News Agency of Nigeria (NAN) during a telephone interview by Bolaji Amusan, National President, Theatre Arts and Motion Pictures Practitioners Assocation of Nigeria (TAMPAN).\n“Yes, we lost Baba Suwe to the cold hands of death, it is unfortunate, further information will be sent out soon,” said Amusan who became emotional could not speak much.\nHe had featured and produced several Nigerian films such as: Baba Jaiye Jaiye.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today ."
  },
  {
    "headline": "82 percent candidates obtain five credits, including English, Maths in May/June 2021 WASSCE",
    "summarized_story": "By Gabriel DikeResults of the May/June 2021 West African Senior School Certificate Examination (WASSCE) have been released by the West African Examinations Council (WAEC).\nThe examination which was taken by 1, 560,261 candidates nationwide was also conducted in Benin Republic and Cote D’Ivoire.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nWAEC Head of National Office (HNO), Mr. Patrick Areghan, said 1, 274, 784 obtained credits and above in five subjects, including English Language and Mathematics.\nHe said the Minister of Education has approved that 2022 WASSCE will be conducted in May/June."
  },
  {
    "headline": "Banditry: Abuja schools on red alert",
    "summarized_story": "A school proprietor told our correspondent they were advised by top security agents that bandits were plotting to launch coordinated attacks and possibly ambush school buses conveying school children.\nShe further revealed the presence of large private and government security agents around many schools in Abuja, as part of moves to prevent any possible attack by bandits who are believed to be operating already around many parts of Abuja.\nShe admitted as genuine, fears being harboured in some quarters that bandits and terrorists are beginning to target schools in the FCT.\nMajor private schools on the fringes of Nasarawa, such as Mararaba and Nyanya, are apprehensive and have beefed up security.\nHowever, the FCT Administration has revealed that it would continue to pay adequate attention to school security."
  },
  {
    "headline": "How PDP’ll sack APC in 2023 –PDP BoT chairman",
    "summarized_story": "From Noah Ebije KadunaSecond republic senator and Chairman, Board of Trustees (BoT), Peoples Democratic Party (PDP), Jibril Walid, has given an insight on how the major opposition party would sack the ruling All Progressives Congress (APC) from power in 2023.\nHe also said that when PDP finally produces its presidential candidate and the zone is known, APC would have no option than to pack out of government.\nWe met and agreed that the national chairman of our great party should come from the North Central; and that one had been achieved.\n“The industrial development in Nigeria is not going well because government policy is not consistent over the years.\n“If government policy is consistent, Nigeria wouldn’t have been where it is."
  },
  {
    "headline": "Breaking: Veteran Nigerian Comic Actor Baba Suwe is Dead",
    "summarized_story": "By Vanessa ObiohaThe dark-skinned Nigerian comic actor Babatunde Omidina, better known as Baba Suwe has passed on.\n“This is to announce the sudden death of my father Mr Babatunde Omidina, the legend and rare gem ‘Baba Suwe’ 11/22/21,” read the post.\nBorn on August 22, 1958, Baba Suwe gained mainstream recognition after he featured in the movie ‘Omolasan’.\nThe Lagos State indigene started acting in 1971 and has featured and produced several Nigerian movies.\nIn 2019, Baba Suwe through the generosity of friends was flown to the United States for the treatment of diabetes."
  },
  {
    "headline": "Breaking: Flour Mills to Acquire 71.69% Stake in Honeywell in N80bn Deal",
    "summarized_story": "Kayode TokedeFlour Mills of Nigeria (FMN) Monday announced it had signed an agreement to acquire 71.69 per cent stake in Honeywell Group’s portfolio company, Honeywell Flour Mills Plc (HFMP), in a deal worth N80 billion.\nThe two flour processing companies in a joint statement noted that the transaction aims to create a strong national champion for Nigeria to further enhance food security.\nThe statement said Honeywell Group Limited had agreed to sell 71.69 per cent stake in Honeywell Flour Mills to Flour Mills of Nigeria Plc.\nThe statement obtained by THISDAY read: “For the proposed combination of FMN through its affiliates and Honeywell Flour Mills Plc.\nAt a total enterprise value of N80 billion, HGL will dispose of a 71.69per cent stake in HFMP to FMN.”The statement noted that the proposed combination was subject to approval from the appropriate regulators."
  },
  {
    "headline": "2023: Osinbajo Dares Tinubu as Support Group Opens Campaign Office in Abuja",
    "summarized_story": "A major pointer to this suggestion is the opening of a campaign office by a motley coalition of his supporters.\nThe campaign office, located at No.\nMeanwhile, the Tinubu Support Group refused to give an opinion on the development.\nHowever, prior to the inauguration of the campaign office, the Osinbajo group had in July lobbied some highly-placed members of APC to join forces towards mobilising support for Osinbajo.\nThough the support group has denied Osinbajo has a hand in it, analysts wonder where the group is getting the funding to bankroll its activities."
  },
  {
    "headline": "Zainab Ahmed: We Do Not Have Debt Problem, What We Have is Revenue Problem",
    "summarized_story": "Patient, articulate and sound with dignified carriage, you can only underrate the Minister of Finance, Zainab Shamsuna Ahmed, at your peril.\nYou said the economy is diversified, but why is Nigeria still heavily dependent on oil revenue to the extent that once there is a shock in the oil sector, the impact on our economy is always immediate?\nThe 2021 budget has 55 per cent revenue contribution from the non-oil sector and 45 per cent from the oil sector.\nSince then, we have seen our revenue increase on an incremental basis, but the problem is that our expenditure has also been increasing and much faster than the revenue.\nI say it again today, that we don’t have a debt problem, what we have is a revenue problem."
  },
  {
    "headline": "Security Experts Fault US Arms’ Embargo Threat against Nigeria",
    "summarized_story": "Usman (rtd), advised the US government to withdraw the threat of imposing arms embargo on Nigeria.\nUsman said, “I do not think that arms embargo is advisable.\nThe US should rescind its threat to impose arms embargo on Nigeria.\nThe official stated, “There is a lot going on between US and Nigeria not to warrant such an embargo.\nYahaya promised that the army would collaborate with other security services, agencies, and stakeholders to ensure the fight was won."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Governors against direct primaries should embrace dialogue, says Lawan",
    "summarized_story": "Senate President Ahmad Lawan says the national assembly expects President Muhammadu Buhari to sign the electoral amendment bill 2021 into law.\nOn November 19, the national assembly had transmitted the bill to Buhari for assent.\nThe decision to adopt direct primaries has elicited varied reactions, with stakeholders such as the Peoples Democratic Party (PDP) and some All Progressives Congress (APC) governors kicking against it.\nAsked how APC can ensure stability when governors are unhappy with direct primaries, Lawan said the best way forward is for people to engage.\nAdvertisement“Yes, of course, when we send a bill to Mr. president, we expect the bill to be signed."
  },
  {
    "headline": "Governors against direct primaries should embrace dialogue, says Lawan",
    "summarized_story": "Senate President Ahmad Lawan says the national assembly expects President Muhammadu Buhari to sign the electoral amendment bill 2021 into law.\nOn November 19, the national assembly had transmitted the bill to Buhari for assent.\nThe decision to adopt direct primaries has elicited varied reactions, with stakeholders such as the Peoples Democratic Party (PDP) and some All Progressives Congress (APC) governors kicking against it.\nAsked how APC can ensure stability when governors are unhappy with direct primaries, Lawan said the best way forward is for people to engage.\nAdvertisement“Yes, of course, when we send a bill to Mr. president, we expect the bill to be signed."
  },
  {
    "headline": "Northern coalition: Nigeria will become lawless state if Nnamdi Kanu is freed without prosecution",
    "summarized_story": "The Coalition of Northern Groups (CNG) has asked President Muhammadu Buhari not to consider releasing Nnamdi Kanu, leader of the Indigenous Peoples of Biafra (IPOB).\nAdvertisementTheCable had reported that Buhari said he would consider releasing Kanu who is in the custody of the Department of State Services (DSS).\nThe president said this on Friday when he hosted Igbo leaders led by Mbazulike Amaechi, former minister of aviation, who appealed for the release of Kanu.\nSpeaking at a press conference on Monday, Abdul-Azeez Suleiman, CNG spokesperson, said northerners will hold Buhari responsible for “the blood of its people unlawfully shed through the activities of Kanu”.\nThe CNG spokesman also alleged that Kanu and his group had killed over 400 security personnel."
  },
  {
    "headline": "Northern coalition: Nigeria will become lawless state if Nnamdi Kanu is freed without prosecution",
    "summarized_story": "The Coalition of Northern Groups (CNG) has asked President Muhammadu Buhari not to consider releasing Nnamdi Kanu, leader of the Indigenous Peoples of Biafra (IPOB).\nAdvertisementTheCable had reported that Buhari said he would consider releasing Kanu who is in the custody of the Department of State Services (DSS).\nThe president said this on Friday when he hosted Igbo leaders led by Mbazulike Amaechi, former minister of aviation, who appealed for the release of Kanu.\nSpeaking at a press conference on Monday, Abdul-Azeez Suleiman, CNG spokesperson, said northerners will hold Buhari responsible for “the blood of its people unlawfully shed through the activities of Kanu”.\nThe CNG spokesman also alleged that Kanu and his group had killed over 400 security personnel."
  },
  {
    "headline": "Buhari has endorsed Feb 2022 for APC convention, says Bagudu",
    "summarized_story": "Atiku Bagudu, chairman of Progressives Governors Forum (PGF), says President Muhammadu Buhari has endorsed February 2022 for the All Progressives Congress (APC) national convention.\nAdvertisementSpeaking with journalists on Monday after he and other APC governors held a meeting with Buhari at the presidential villa, Bagudu said February was suggested to the president, because four states have not held congresses.\n“The Progressive Governors Forum, after their meeting, suggested February to the party and the president has concurred.\nSo, we are going ahead to plan for the convention in February,” Buni said.\nI have my primary responsibility as a governor to go back to my state and carry out my primary responsibility,” he said."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "The NFT artist who captured the global lockdown with 700 portraits",
    "summarized_story": "Optimising this process, coupled with the overwhelmingly positive feedback he received from his 80 selected muses, encouraged him to create more portraits.\nIn the end, Adekola created 700 portraits, but there are only 40 portraits with striking designs and a collage of all 700 portraits on display at the exhibition halls of the gallery.\nNow titled Lockdown Portraits, his project would go on to form a part of his exhibition titled, Dislocation &… alongside Anthology of an African Wedding and Diaspora Axis.\nAdekola has evolved his art using Photoshop for over 20 years, creating over 20,000 texture designs that he used to create Anthology of an African Wedding.\nAnthology of an African Wedding, which also sells as an NFT on OpenSea, consists of 18 art pieces—9 showing traditional wedding scenes and 9 white wedding ones."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "6 Nigerian agencies unite to fight data privacy abuse by money lending fintechs",
    "summarized_story": "Many Nigerians receive unsolicited and embarrassing text and WhatsApp messages from money lending companies about close friends and family, and sometimes, like in my case, barely known acquaintances.\nIn Nigeria, on Friday, November 12, 2021, NITDA announced its partnership with the Federal Competition and Consumer Protection Commission (FCCPC) to tackle data privacy abuse by money lending operators.\nInterestingly, money lending in Nigeria is regulated by the various states.\nIf, for example, in the course of investigations, any money lending company has committed an offence under their purview, they could face prosecution.\nCooking up a thick broth to serve money lending operators, trying to ensure your data is protected."
  },
  {
    "headline": "A chat with Mr Eazi, Spotify and two Congos, Nigeria’s cryptocurrency clampdown",
    "summarized_story": "Share this article:Good day,Today I’m discussing:A chat with Mr EaziSpotify’s African expansionCBN’s clampdown on crypto tradingMr Eazi: Artiste, tech bro, investorMr Eazi.\nMeet Oluwatosin Ajibade, a.k.a Mr Eazi, Nigerian-born musician and founder of emPawa Africa, a talent incubator.\nBefore starting his music career and after graduating as a mechanical engineer, Oluwatosin traded FMCGs and gold before deciding to stick to music.\nNigerian pop artiste, Mr Eazi, to offer fans equity in his yet-to-be-released musicTrading jokes and sharing stories, our Senior Reporter, Nifemi, had a chat with Oluwatosin Ajibade for the latest edition of The Experts.\nOn Thursday, November 17, 2021, audio streaming platform, Spotify, announced its launch in two African countries: the Democratic Republic of the Congo and the Republic of the Congo."
  },
  {
    "headline": "Early Access: Interview with Mr Eazi; artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\n“I think Mr Eazi is a laid back musician.\nThe Nigeria-born musician later relocated to Ghana for his undergraduate studies before starting his music career in London.\nHe believes Africa is experiencing its best years in the global music industry, with many of its music genres being embraced globally.\nMotivation and obsessionOluwatosin Ajibade (Mr Eazi)."
  },
  {
    "headline": "MTN, Airtel to face stiff mobile money competition in Nigeria",
    "summarized_story": "Akanmu also has extensive knowledge of the telecoms industry having held the position of chief marketing officer for Airtel Nigeria from 2012 to 2013.\nOPay already claims it has more mobile money agents than MTN and other competitors, with over 300,000 compared with 230,000 MTN’s MoMo agents.\nTeamApt claims 150,000 mobile money agents, 70 million transactions carried out on a monthly basis with over 14 million users, and a $3.5 billion value transacted.\nIn Kenya or Ghana, MTN MoMo or Airtel Money users do not need a bank account or Bank Verification Number (BVN) to conduct a mobile money transaction.\nIt, therefore, means that MTN Nigeria and Airtel Africa cannot keep deposits even though they can accept."
  },
  {
    "headline": "MTN, Airtel to face stiff mobile money competition in Nigeria",
    "summarized_story": "Akanmu also has extensive knowledge of the telecoms industry having held the position of chief marketing officer for Airtel Nigeria from 2012 to 2013.\nOPay already claims it has more mobile money agents than MTN and other competitors, with over 300,000 compared with 230,000 MTN’s MoMo agents.\nTeamApt claims 150,000 mobile money agents, 70 million transactions carried out on a monthly basis with over 14 million users, and a $3.5 billion value transacted.\nIn Kenya or Ghana, MTN MoMo or Airtel Money users do not need a bank account or Bank Verification Number (BVN) to conduct a mobile money transaction.\nIt, therefore, means that MTN Nigeria and Airtel Africa cannot keep deposits even though they can accept."
  },
  {
    "headline": "How new PSBs will disrupt Nigeria’s financial landscape",
    "summarized_story": "The country had aimed to reach 70 percent of Nigerians with formal financial services by 2020; the actual figure was 51 percent.\nRead Also: MTN Nigeria, Airtel PSBs to create 1m direct jobsThere has been a long-standing and broad-based consensus on the part of Nigeria’s government and the central bank about the importance of boosting the provision and uptake of digital financial services (DFS).\nThis was in furtherance of the apex bank’s efforts to leverage technology to promote financial inclusion and enhance access to financial services for the unbanked and underserved segments of the population.\nAs such, their offerings are niche and they are not allowed to provide the entire gamut of banking services, such as asset products and fixed deposits.\nEvidence from the annual KPMG in Nigeria’s banking industry customer satisfaction survey (BICSS) suggests that this will be a viable strategy for PSBs."
  },
  {
    "headline": "Edo Govt Seeks Collaboration with NTA on MEGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government has called for the support of the Nigerian Television Authority (NTA) in driving the administration’s agenda of Making Edo Great Again popularly known as MEGA.\nWhile making his welcome address, the Commissioner reinstated the commitment of Edo government under Mr. Obaseki to economic revolution and institutional reforms of Edo state which are driven by the MEGA agenda.\nHe appealed to NTA to key into the vision by informing and sensitizing the people about the programmes of Edo government.\nEarlier, the zonal director of NTA Benin Network Centre, Mrs. Pauline Igbanor congratulated Hon.\nSolomon Imohiensen and other staff members of the Edo Ministry of Communication and Orientation."
  },
  {
    "headline": "Obaseki: Edo 30-year plan’ll drive state’s socio-economic growth, devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the newly launched 30-year development plan is a comprehensive and all-encompassing document to drive sustainable socio-economic growth and development in the state over the next three decades.\nObaseki stated this while delivering his welcome address at a one-day workshop on the overview of Edo State Development and Physical Planning, organised by the Edo State Ministry of Physical Planning and Urban Development and the Ministry of Budget and Economic Planning.\nIt is a process whereby all stakeholders are brought together and tools are deployed to activate and animate the planning exercise.\nOther dignitaries at the event include Secretary to Edo State Government, Osarodion Ogie Esq.\n; Attorney General and Commissioner for Justice, Oluwole Iyamu SAN; Commissioner for Physical Planning and Urban Development, Isoken Omo, and the Commissioner for Water Resources, Moses Agbukor, among others."
  },
  {
    "headline": "Edo College of Nursing Sciences to be affiliated with FD University, USA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBEINN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, received the letter of approval from the Nursing and Midwifery Council of Nigeria to commence training of nurses and midwives at the Edo State College of Nursing Sciences in Benin City, Edo State.\nNoting that the school’s benchmark should be the premium and premier nursing school in the country, the governor noted: “To achieve this, the Edo State Government is giving you a free hand to operate without interference.\n“We will also seek the permission of the Nursing and Midwifery Council of Nigeria to allow the Institution to be a continuing education provider.\nThis will enable the institution to run multiple programmes including programmes that will help nurses and staff to renew their licenses.\n“We would be in line with guidelines from the Nursing and Midwifery Council of Nigeria, which has given a mandate that, come 2023, all Diploma programmes would adhere to collegiate standards."
  },
  {
    "headline": "Retraction: Curbing Domestic Violence In The Society – Nigerian Observer",
    "summarized_story": "Check AlsoBENIN CITY – The Ohen, Odionwere and the entire people of Okhuoromi Village in Oredo …UHUNWONDE – Over what they described as strange happenings in the Village, the indigenes of …"
  },
  {
    "headline": "Airport staffer slumps, dies on duty in Abuja radar control room",
    "summarized_story": "Nigerian Airspace Management Agency ( NAMA) has announced the death of one of its Air Traffic Controllers (ATCO), Aniekan Effiong, while on duty on Monday.\nKhalid Emele, NAMA spokesman, confirmed the sad news in a statement in Lagos on Monday.\nMr Emele said Mr Effiong died on duty at the approach radar control site of NAMA Total Radar Coverage of Nigeria (TRACON), Nnamdi Azikiwe International Airport, Abuja.\n“Effiong reported to duty at the Abuja Approach Radar Control (TRACON) on Nov. 21 at 6p.m.\n“Effiong was a hardworking and dedicated staff who died at the prime of his career."
  },
  {
    "headline": "Buhari endorses February 22 date for APC National Convention",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has endorsed February 2022 as new date for the National Convention of the ruling All Progressives Congress (APC).\nChairman of Progressive Governors’ Forum, Alhaji Atiku Bagudu, confirmed this development to State House correspondents at the end of a closed door meeting with President Buhari at the Presidential Villa, Abuja, on Monday, NAN reported.\nBagudu, who was not specific on the exact date for the convention in February, said the convention was shifted because four states were yet to complete their congresses.\n“Yesterday, Nov. 21, the Progressive Governors’ Forum met, where we congratulated and thanked the Caretaker Committee for working so hard in leading the party.\nI have my primary responsibility as a Governor to go back to my state and carry out my primary responsibility."
  },
  {
    "headline": "DMO says FG’s November bonds oversubscribed by N117.15bn",
    "summarized_story": "Nigeria’s Debt Management Office (DMO) has said federal government’s bonds for November worth N150bn, which were auctioned on November 17, were oversubscribed by N117.15 billion.\nAccording to the DMO, the total subscription received from investors was N267.15bn, with only one of the bonds undersubscribed.\nIt said subscription of N50.75bn was received for the 12.50 per cent FGN January 2026 bonds; N46.69bn for the 16.2499 per cent FGN April 2037 bonds, which was undersubscribed; and N169.71bn for the 12.98 per cent FGN March 2050 bonds, which recorded the highest subscription.\nIt said, “Successful bids for the 12.50 per cent FGN January 2026, 16.2499 per cent FGN April 2037 and 12.9800 per cent FGN March 2050 were allotted at the marginal rates of 11.6500 per cent, 12.9500 per cent and 13.3000 per cent, respectively.\n“However, the original coupon rates of 12.5000 per cent for the 12.5000 per cent FGN January 2026, 16.2499 per cent for the 16.2499 per cent FGN April 2037 and 12.9800 per cent for the 12.9800 per cent FGN March 2050 will be maintained.”Facebook Notice for EU!"
  },
  {
    "headline": "Imo: Uzodinma nominates 17 commissioners seven months after dissolving cabinet",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodinma, has nominated 17 commissioners into the executive arm of the government.\nThe appointment comes seven months after the governor sacked 20 commissioners as well as Special Advisers and Senior Special Advisers.\n“Governor Hope Uzodimma of Imo State is gearing up to reconstitute his Cabinet barely six months it was dissolved,” he said.\n“He has therefore forwarded the names of 17 persons as Commissioners-designate to the Imo State House of Assembly for screening and possible confirmation.\n“They have been referred to the appropriate committee of the Imo State House of Assembly for screening, effective Tuesday, November 23, 2021.”Facebook Notice for EU!"
  },
  {
    "headline": "Flour Mills of Nigeria acquires Honeywell",
    "summarized_story": "Flour Mills of Nigeria (FMN) has acquired Honeywell Flour Mills PLC (HFMP).\nFMN which disclosed the development in a statement on Monday, said it signed an agreement with Honeywell Group Limited (HGL), owners of Honeywell Flour Mills for the acquisition.\nThe statement said Honeywell Group Limited agreed to sell a 71.69% stake in Honeywell Flour Mills to Flourmills of Nigeria.\n“For the proposed combination of FMN through its affiliates and Honeywell Flour Mills Plc (“HFMP”), a portfolio company of HGL.\nHoneywell Flour Mills currently has a market value of N29 billionFMN said the transaction will create a stronger company in the food industry."
  },
  {
    "headline": "Gbajabiamila Mourns Popular Comic Actor, Baba Suwe",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has mourned popular Nigerian comic actor, Babatunde Omidina, who passed away on Monday.\nGbajabiamila said Omidina, fondly called by his stage name, Baba Suwe, was one thespian that entertained Nigerians and brought joy to many Nigerian homes through his comical talent.\nThe Speaker implored his children and family to find solace in how Baba Suwe used his God-given talent to influence the lives of others positively, saying he left behind a vacuum too difficult to fill.\nSpeaker Gbajabiamila sent his condolences to the Omidina family, good people of Ikorodu, Lagos, the Nigerian film industry and Nigerians, especially the many fans of Baba Suwe.\nHe equally prayed for the repose of his soul."
  },
  {
    "headline": "Gbajabiamila Mourns Popular Comic Actor, Baba Suwe",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has mourned popular Nigerian comic actor, Babatunde Omidina, who passed away on Monday.\nGbajabiamila said Omidina, fondly called by his stage name, Baba Suwe, was one thespian that entertained Nigerians and brought joy to many Nigerian homes through his comical talent.\nThe Speaker implored his children and family to find solace in how Baba Suwe used his God-given talent to influence the lives of others positively, saying he left behind a vacuum too difficult to fill.\nSpeaker Gbajabiamila sent his condolences to the Omidina family, good people of Ikorodu, Lagos, the Nigerian film industry and Nigerians, especially the many fans of Baba Suwe.\nHe equally prayed for the repose of his soul."
  },
  {
    "headline": "Wike To Federal Govt: Consider Oil Theft As Treasonable Offence",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has called on the federal government to consider the damage caused by activities of crude oil thieves to the economic mainstay of the country and treat them as treasonable offenders.\nWike spoke on Monday when he hosted the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao, who paid courtesy visit to the Government House, Port Harcourt.\nIf not, there is no way bunkering can continue.\nAmao commended the governor for the good work he has continued to do in Rivers State in terms of provision of infrastructure.\nRivers State has been a very peaceful State."
  },
  {
    "headline": "Wike To Federal Govt: Consider Oil Theft As Treasonable Offence",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has called on the federal government to consider the damage caused by activities of crude oil thieves to the economic mainstay of the country and treat them as treasonable offenders.\nWike spoke on Monday when he hosted the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao, who paid courtesy visit to the Government House, Port Harcourt.\nIf not, there is no way bunkering can continue.\nAmao commended the governor for the good work he has continued to do in Rivers State in terms of provision of infrastructure.\nRivers State has been a very peaceful State."
  },
  {
    "headline": "Abuja-Kaduna Road Attack: 11 Kidnap Victims Rescued So Far – Kaduna Govt",
    "summarized_story": "The Kaduna State Government has received briefings from security forces on Sunday’s attack by armed bandits along the Kaduna-Abuja Expressway, saying 11 kidnap victims have been rescued so far.\nADVERTISEMENTResponding, the Commissioner, Internal Security and Home Affairs stated that Government was following the developments closely, having received assurances of commitment from the Police and Military.\nAruwan reiterated the commitment of the Kaduna State Government by way of continued provision of logistics and support to security agencies.\nHe described the attack as a setback, stating however that the Government of Kaduna State would not be deterred by this in its security efforts.\nHe pleaded with citizens experiencing communication difficulties to bear with the temporary measures in view of overall security advantages."
  },
  {
    "headline": "Umahi’s alleged N25m gift tears Ohanaeze youths apart",
    "summarized_story": "Ebonyi State Governor Dave Umahi has been accused of sponsoring division in the youth wing of the Ohanaeze Ndigbo and planting his stooge as the national youth leader of the organisation.\nFollowing the ratification of Okafor’s suspension, the Ohanaeze Youth Wing is warming up for a by-election for the office of a national youth leader.\nBut the governor is alleged to be bent on retaining the expelled youth leader, who is from his state.\nThe source alleged further that Umahi’s interest in the leadership of the organisation is to boost his 2023 presidential ambition.\n“Like it happens with most people imposed into a position of authority, Okafor (national youth leader) assumed a larger than life status, especially among his colleagues in the National Executive Committee of the Youth Wing."
  },
  {
    "headline": "Umahi’s alleged N25m gift tears Ohanaeze youths apart",
    "summarized_story": "Ebonyi State Governor Dave Umahi has been accused of sponsoring division in the youth wing of the Ohanaeze Ndigbo and planting his stooge as the national youth leader of the organisation.\nFollowing the ratification of Okafor’s suspension, the Ohanaeze Youth Wing is warming up for a by-election for the office of a national youth leader.\nBut the governor is alleged to be bent on retaining the expelled youth leader, who is from his state.\nThe source alleged further that Umahi’s interest in the leadership of the organisation is to boost his 2023 presidential ambition.\n“Like it happens with most people imposed into a position of authority, Okafor (national youth leader) assumed a larger than life status, especially among his colleagues in the National Executive Committee of the Youth Wing."
  },
  {
    "headline": "How air traffic controller slumped, died at Abuja airport",
    "summarized_story": "An air traffic controller, Aniekan Effiong, on Monday, slumped and died at the Nnamdi Azikiwe International Airport in Abuja, The PUNCH has learnt.\nEffiong, who was until his death, an Assistant General Manager, Operations, with the Nigerian Airspace Management Agency, was said to have died at the Abuja station of the agency around 4am on Monday.\nThe statement signed by NAMA General Manager, Public Affairs, Khalid Emele, was titled, ‘Demise Of Nama Air Traffic Controller (Aniekan Inuk Effiong)’.\nIt read, “The Nigerian Airspace Management Agency hereby announces with utmost grief, the passing of Mr Aniekan Inuk Effiong, an air traffic controller with the agency, at Abuja station, today, the 22nd of November, 2021.\nUntil his death, late Effiong was an Assistant General Manager, Operations."
  },
  {
    "headline": "How air traffic controller slumped, died at Abuja airport",
    "summarized_story": "An air traffic controller, Aniekan Effiong, on Monday, slumped and died at the Nnamdi Azikiwe International Airport in Abuja, The PUNCH has learnt.\nEffiong, who was until his death, an Assistant General Manager, Operations, with the Nigerian Airspace Management Agency, was said to have died at the Abuja station of the agency around 4am on Monday.\nThe statement signed by NAMA General Manager, Public Affairs, Khalid Emele, was titled, ‘Demise Of Nama Air Traffic Controller (Aniekan Inuk Effiong)’.\nIt read, “The Nigerian Airspace Management Agency hereby announces with utmost grief, the passing of Mr Aniekan Inuk Effiong, an air traffic controller with the agency, at Abuja station, today, the 22nd of November, 2021.\nUntil his death, late Effiong was an Assistant General Manager, Operations."
  },
  {
    "headline": "Italian Police smash Nigerian gang forcing ladies into prostitution",
    "summarized_story": "Italian customs police on Monday dismantled a Nigerian organised crime syndicate that forced dozens of young women into prostitution and begging on the streets of Italy.\nThe police in a statement said while the Nigerian crime syndicate was based in Italy, its operations extended to Germany, Libya and Nigeria.\n“Forty-one young women (were) assigned to prostitution, while nine were forced to beg,” the statement said.\nThe crime syndicate used a combination of methods to pump their ill-gained revenues back into Nigeria, mostly in real estate there, Italian authorities said.\nPolice said measures by Italian judicial authorities helped the young victims break “the ties of physical-psychological coercion which kept them bound” to their exploiters."
  },
  {
    "headline": "Education: Yobe civil servants to forfeit 10% of basic salaries",
    "summarized_story": "By Ahmed AbbaYobe Government says it will deduct 10 per cent of November basic salaries of its civil servants as their contributions to the current efforts to revive the education sector in the state.\nMai Mala Buni had on Nov. 9, 2021, inaugurated a 21-member State Education Appeal Fund Raising Committee to mobilise funds to revitalise the education sector.\n“By this briefing therefore, civil servants are informed that the deduction will be for only the month of November 2021.\n“In this regard, government is appealing to civil servants in the state to heartily support government in her bid to rescue our state from the catastrophe of educational decay.”, he said.\nThe state governor had at the inception of the administration declared a State of Emergency in the education sector."
  },
  {
    "headline": "BREAKING: Veteran Actor, Baba Suwe Is Dead",
    "summarized_story": "Babatunde Omidina, often known as Baba Suwe, was a veteran Nigerian comedy actor.\nBolaji Amusan, commonly known as Mr Latin, the president of the Theatre Arts and Motion Picture Producers Association of Nigeria, confirmed his death.\nIn an exclusive interview with The Punch, Mr Latin said, “It has been confirmed that Baba Suwe is dead.\nI just got off the phone with his son who confirmed that the actor is dead.\nI don’t have much details about his death.”"
  },
  {
    "headline": "Gov. Sani Bello’s Chief Of Staff, Balarabe Visits Minna General Hospital [Photos]",
    "summarized_story": "You may recall that Gov Abu Sani Bello was in Minna General Hospital to inspect the ongoing expansion of the hospital and promised that Niger State Government will continue to monitor activities of the hospital non-stop.\nAs a follow up to the above, as early as 6am today, 22nd November 2021, the Chief of Staff to Governor Abu Sani Bello, Alh.\nIbrahim Balarabe Kagara was at the Minna General hospital to witness firsthand the first class service being delivered at the hospital.\nThe Chief of Staff similarly toured the new massive expansion of the hospital that’s ongoing, visited every ward of the hospital and spoke to few patients to hear from them challenges facing them for onward forwarding to His Excellency, Governor Abu Sani Bello.\nThe COS was accompanied by the MD of the Hospital Dr. Muhammad Ishak Ma’ali and the Head of nursing services of the hospital, Yusuf Ciroma."
  },
  {
    "headline": "BREAKING: Alleged N19bn Fraud: Malami’s Letter Stalls Arraignment Of Ex-Aviation Minister, Stella Oduah",
    "summarized_story": "The scheduled arraignment of a former Minister of Aviation, Senator Stella Oduah, before Justice Inyang Ekwo of the Federal High Court Abuja, was on Monday stalled.\nOduah, now a senator representing Anambra North Senatorial district in the Senate, was to be arraigned on a 25-count charge, along 8 other defendants.\nThe letter of complaint according to Onoja claimed that Oduah and the other defendants are being persecuted.\nThe Court said, since a statutory and constitutional issue have been raised, that it will not hear the case summarily.\nTherefore, the court ordered parties to file written addresses on the issue before adjourning to February 10."
  },
  {
    "headline": "Federal High Court Announces Dates For New Legal Year, Yuletide Vacation",
    "summarized_story": "The Federal High Court of Nigeria has announced that the event celebrating the start of the court’s new legal year in 2022 would take place on Tuesday, December 14 in Abuja.\nThe event will end on Thursday, December 16, 2021, according to a circular signed by the Chief Judge of the court, Justice John Terhemba Tsoho.\n“Pursuant to the provisions of Order 46, Rule 4 (C) of the Federal High Court (civil Procedures) Rules, 2019, the Federal High Court will proceed on its Christmas vacation from Monday, 20th December, 2021 to Friday, 7th January, 2022”.\nAbu Bakar as the vacation judges for Abuja division.\nA statement by the Chief Information Officer of the court, Catherine Oby Christopher quoted the Chief Judge as wishing his fellow judges a wonderful vacation in advance."
  },
  {
    "headline": "Breaking: Another veteran Nollywood actor is dead",
    "summarized_story": "Popular Nollywood actor, Babatunde Omidina, popularly known as Baba Suwe has passed away.\nThe actor died on Monday at the age of 67.\nBaba Suwe’s death was announced by one of his daughters, Adesola Omidina.\nShe said: “This is to announce the sudden death of my father, Babatunde Omidina, the legend and rare gem, Baba Suwe on November 11, 2021.\nDetails and other arrangements will be announced shortly.”Baba Suwe became popular for his comical roles in Nollywood films with Yoruba language."
  },
  {
    "headline": "WAEC releases 2021 SSCE results *See link to check your result",
    "summarized_story": "The West African Examinations Council (WAEC) has released the 2021 Senior School Certificate Examination (SSCE) results.\nHe said candidates can visit the WAEC Direct Online website, https://www.waecdirect.org, to check their result.\nOf the number that registered for the examination, 1,560,261 candidates sat the examination.\n“The examination spanned seven weeks, between August 16 and October 8, 2021.\nAll these, coupled with the continuous effect of the COVID-19 Pandemic, made the whole exercise a Herculean one,” Areghan said."
  },
  {
    "headline": "2022 Hajj not certain, mood unclear – NAHCON",
    "summarized_story": "The National Hajj Commission of Nigeria (NAHCON) has said it still remains in the dark as to the certainty or otherwise of the 2022 hajj exercise.\nShe said: “Like any other nation with a Muslim population going on Hajj, the National Hajj Commission of Nigeria, NAHCON, is hopeful that foreign pilgrims will participate in Hajj 2022.\n“Thus, ordinarily, an annual Hajj calendar of events would have been released by the Commission by now as a guide towards preparations for the next year’s Hajj.\n“By the way, Hajj calendars are tentative milestones for activities the Commission wishes to accomplish within a certain period before Hajj, during Hajj and after Hajj.\nUntil a Memorandum of Understanding (MoU) is signed with Saudi Arabia on 2022 Hajj, NAHCON cannot circulate a speculative Hajj calendar that might be misconstrued as a binding document."
  },
  {
    "headline": "INEC, Civil Society Ask Buhari To Sign Electoral Amendment Act Bill",
    "summarized_story": "The Independent National Electoral Commission (INEC) and civil society organisations on Monday called on President Muhammadu Buhari to sign the Electoral Act Amendment Bill.\nThe National Assembly has passed the bill and transmitted the document to President Buhari on November 19 for assent.\nREAD ALSO: Capital Funding For Army ‘Grossly Inadequate’ – NdumeOn his part, Nwankwo said it is expedient for the electoral act amendment bill to be signed for the overall benefit of Nigerians.\n“I think it is expedient to have this bill signed.\nThe bill empowered the electoral umpire to determine the use of electronic voting as well as the transmission of results in an election."
  },
  {
    "headline": "Capital Funding For Army ‘Grossly Inadequate’ – Ndume",
    "summarized_story": "﻿The Chairman, Senate Committee on Army, Senator Ali Ndume, has reiterated calls for increased funding for the army.\nThe Senator made the call on Monday to members of the appropriations committee before submitting the final 2022 budget proposal of the Nigerian Army.\nNdume said the increased funding was critical as the army was engaged in unconventional war across the country.\nBut the capital aspect of it is grossly inadequate.\nNo matter what you do, if they don’t have the arms and ammunition, then the war cannot be effectively prosecuted."
  },
  {
    "headline": "UPDATED: Buhari Approves February 2022 For APC National Convention",
    "summarized_story": "President Muhammadu Buhari has approved February 2022 for the conduct of the national convention of the All Progressives Congress (APC).\nChairman of the Progressives Governors’ Forum and Kebbi State Governor, Atiku Bagudu, announced this on Monday in Abuja.\nGovernor Bagudu was accompanied to the villa by the Chairman of the APC National Caretaker Committee and Yobe State Governor, Mai Mala Buni, as well as Governor Abubakar Badaru of Jigawa State.\nHe, however, stated that that party’s leadership has yet to decide on a specific date to conduct its national convention.\nWhile addressing party leaders at the meeting, President Buhari had called for the immediate suspension of all pending litigations involving the APC and its members."
  },
  {
    "headline": "WAEC Releases 2021 Results, Records 81.7% Success Rate",
    "summarized_story": "The West African Examination Council (WAEC) has released the 2021 Senior Secondary School Examination (SSCE) results and noted that there was an improvement in the number of candidates who got credits in five subjects including Mathematics and English Language.\nThe head of the Nigeria National Office of the examination body, Patrick Areghan, disclosed this in a press conference on Monday.\nREAD ALSO: How To Check 2021 WAEC Results Via Text MessageA further breakdown of the results showed that 1,398,370 candidates who make up 89.62%, had credits and above in at least five (5) subjects (i.e with or without English Language and/ or Mathematics.\nAccording to him, 1,274,784 persons, representing 81.7%, had credits and above in a minimum of five (5) subjects, including English Language and Mathematics.\n“All these, coupled with the continuous effect of the COVID-19 Pandemic, made the whole exercise a Herculean one,” the statement read."
  },
  {
    "headline": "ICPC Arraigns LG Chairman In Abuja Over Alleged N10m Bribery",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has arraigned the Chairman of Gwagwalada Area Council, Adamu Danze, for allegedly receiving N10 million kickback from a contractor handling construction projects in the area council.\nAdesola, who also opposed the bail application, prayed the court to remand the accused in a correctional facility to prevent him from interfering and intimidating witnesses, some of whom were employees in the area council.\nJustice Kekemeke, having listened to both counsels, held that the defendant cannot jump bail based on his current position.\n“The defendant who is the current Chairman of Gwagwalada Area Council cannot evade his trial,” he held.\nBail is therefore granted to the defendant.”Danze was admitted to bail in the sum of N20 million and a surety in like sum while the case was adjourned until March 1, 2022, for trial."
  },
  {
    "headline": "Akeredolu, Security heads celebrate retiring Commissioner of Police, Bolaji Salami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has described the retiring Commissioner of Police in the state, Bolaji Salami, as a gentleman who is dedicated to duty.\nGovernor Akeredolu saluted him for being a reliable officer, describing him as a team player.\nAt a brief valedictory session held in his honor during the State Security Council Meeting on Monday, Governor Akeredolu commended the manner the Commissioner of Police handled the #Endsars crisis in the state, describing it as impressive.\nGovernor Akeredolu also applauded the retiring officer for his collaboration with other security agencies in the state, saying he is a bold man.\nI cherish coming here to work with you and I will say that I enjoyed everything in this state,” the retiring CP added."
  },
  {
    "headline": "President Buhari, APC Governors agree February 2022 for National Convention -",
    "summarized_story": "The ruling All Progressives Congress (APC) has tentatively scheduled its national convention to sometime in February, 2022.\nThis was disclosed to State House Correspondents on Monday by Chairman of the Progressive Governors Forum (PGF) Governor Atiku Bagudu after a closed-door meeting with President Muhammadu Buhari.\nBagudu met the President with the Caretaker Committee Chairman of the APC Governor Mai Mala Buni and his Jigawa counterpart, Mohammed Badaru.\nThe meeting with APC Governors was preceded by another meeting, also behind closed-door, with Senate President Ahmad Lawan at the Presidential Villa, Abuja."
  },
  {
    "headline": "Senator Marafa's Faction holds APC Congress In Zamfara LG's -",
    "summarized_story": "Hamza Mko -Tsafe LGA, Hon.\nTukur Waliyi – Bungudu LGA, Alh.\nSani Gyare kadauri – Maru LGA, Sa’idu Barebari- Gummi LGA, Al Mustapha Yakubu- Anka LGA others are Nasiru Sha’ibu – Bukkuyum LGA, Alh.\nSani Muh’d Kaya- Maradun LGA, Bello Halliru – Bakura LGA and Bello Sulaiman BS – Kaura Namoda LGA, Alh.\nIbrahim Imam – Birnin magaji LGA, Sirajo Ibrahim – Shinkafi LGA and Yakubu Mukhtar- Zurmi LGASenator Kabiru Marafa had on Friday last week Condemned the move by the APC National Headquarters to conduct Ward congresses in zamfara and vow to challenge the process in court."
  },
  {
    "headline": "Senate Transmits Electoral Act Amended Bill 2021 to Presidential Buhari -",
    "summarized_story": "The Senate has transmitted the Electoral Act amendment Bill 2021 to President Muhammadu Buhari for his assent.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare."
  },
  {
    "headline": "Cuomo Engaged in Sexual Harassment, New York State Lawmakers’ Probe Finds",
    "summarized_story": "Former New York Governor Andrew Cuomo engaged in “multiple instances of sexual harassment,” used state resources for a book and was “not fully transparent” on the number of COVID-19 deaths at nursing homes, state lawmakers said on Monday, summarizing the results of an investigation.\nA spokesperson for Cuomo did not immediately respond to a call for comment on Monday.\nHeastie initially asked the judiciary committee to determine whether Cuomo should be removed from office, after two women who worked for Cuomo went public with complaints of sexual harassment.\nShortly after Cuomo resigned, his successor, New York Governor Kathy Hochul, revealed that 12,000 more people died of COVID-19 than was reported under Cuomo.\nProsecutors in Manhattan, Nassau County, Albany County, Westchester County and Oswego County have also requested evidence from the attorney general’s investigation."
  },
  {
    "headline": "USAID Celebrates 60 years of Establishment By JFK",
    "summarized_story": "The United States Agency for International Development (USAID) is marking it’s 60 years of establishment.\nA statement from the organisation on Monday said: “During the month of November, the US Agency for International Development (USAID) is commemorating a major milestone, marking 60 years since its founding by President John F. Kennedy.\nIn 2021, USAID is spending $787 million in development and humanitarian assistance in Nigeria.\nToday USAID supports testing for 2.4 million Nigerians a year, and provides free life-saving antiretroviral therapy for 89 percent of the nearly 400,000 individuals who have tested positive.\nThrough Feed the Future, 2.3 million smallholder farmers benefited from improved products, improved techniques, and access to markets and financing through USAID agriculture programs last year."
  },
  {
    "headline": "ECOWAS: Fighting Terrorism Without Attacking Root Causes Exercise in Futility",
    "summarized_story": "The Economic Community of West African States (ECOWAS) Commission has said fighting terrorism without attacking the root causes is an exercise in futility.\nShe lamented that terrorism has unprecedented humanitarian consequences, stating that to date, more than three million people are displaced.\nFrom the North of Mali and Burkina Faso Violent Extremist groups conducted years back attacks in the southern Part of these members states.\nThis explains why Côte d’Ivoire saw a major escalation of violent extremism throughout 2020, including its first jihadist attacks since the 2016 Grand Bassam incident.\nShe disclosed that: “With regard to these root causes in the prevention and the fight against terrorism, the ECOWAS Commission has made the “nexus” between security and development its major area of focus.”She revealed that various strategies and programmes have been put in place to combat terrorism in the region."
  },
  {
    "headline": "Nigeria: Flour Mills Acquires Majority Stake in Honeywell Flour Mills For N80bn",
    "summarized_story": "Nigeria’s biggest flour maker, Flour Mills has announced an agreement to acquire Honeywell Group’s portfolio company, Honeywell Flour Mills PLC (HFMP), for 80 billion Naira.\nThe agreement which was disclosed in a press statement on Monday, revealed that Honeywell Group Limited has agreed to sell a 71.69 percent stake in Honeywell Flour Mills to Flour Mills of Nigeria (FMN).\nThe statement reads, “For the proposed combination of FMN through its affiliates and Honeywell Flour Mills Plc (“HFMP”), a portfolio company of HGL.\nHoneywell Flour Mills currently has a market value of N29 billion.\nFor over two decades, we have supported Honeywell Flour Mills to build a strong business with a production capacity of 835,000 metric tonnes of food per annum."
  },
  {
    "headline": "Nigeria: Arewa Forum Condemns Banditry Along Kaduna-Abuja Road, Says It’s ‘National Shame’",
    "summarized_story": "The Arewa Consultative Forum (ACF) has described the attacks and kidnappings along the Kaduna- Abuja road as a national shame, declaring that it is “completely unacceptable”.\nSagir was said to have been killed on Sunday by bandits along the Kaduna-Abuja road while several others were said to have been abducted.\n“This is a national shame and completely unacceptable to our forum.\n“Indeed Rijana has become a popular spot where these terrorist attacks are committed on a daily and routine basis.\nThe statement condoled with the immediate family of the slain Hamida Sagir and the Zamfara state Goverment and prayed Almighty God to give them the fortitude to bear the tragedy."
  }
]