[
  {
    "headline": "Talks with FG panel over strike fruitless – SSANU",
    "summarized_story": "Speaking in an interview with our correspondent on Tuesday, the National Vice-President, SSANU, Dr. Abdussobur Salaam, said the panel met only once with SSANU since it was inaugurated on March 7, 2022.\nIt is believed that the committee will submit its report to the Federal Government this week or get an extension.\nBut Salaam explained that the Briggs committee’s engagements with SSANU had been minimal and the timeline was not being adhered to.\nHe said, “Within the three months timeline, SSANU has only had one meeting with the Briggs renegotiation team.\nTo be breathed down upon by government officials as the engagements with the committee suggest is not good for confidence building."
  },
  {
    "headline": "Demolition: Osun property owners protest non-payment of compensation",
    "summarized_story": "Some property owners along Old Garage, MDS and Fakunle areas of Osogbo, Osun State capital, on Tuesday, staged a peaceful protest over non-payment of over N1bn compensation after the state government had demolished their property.\nThey said the State Governor, Adegboyega Oyetola, promised to pay their compensation in instalments when he assumed office.\n“On assumption of office of the Governor of Osun State, Alhaji Isiaka Oyetola, in 2019, a courtesy visit was paid to him by all the affected claimants.\nAt the meeting, the governor stated that compensation would be paid in tranches to all the claimants.\nShe then appealed to Oyetola to revisit the issue with a view to compensate the property owners for the losses they incurred."
  },
  {
    "headline": "Nwajiuba absent from APC convention",
    "summarized_story": "Omeiza Ajayi, AbujaIn a curious twist of event, one of the presidential aspirants and immediate past Minister of state for Education, Hon.\nChukwuemeka Nwajiuba was absent from the convention.\nHe was called upon at last three times to come and address the delegates, but he was nowhere to be found.\nThere was no official explanation as to his absence.\nOnly few days ago, he was thought of as a possible choice of President Muhammadu Buhari for the plum job."
  },
  {
    "headline": "I’ll succeed Buhari in 2023, Pastor Tunde Bakare insists",
    "summarized_story": "Pastor Tunde Bakare, one of the presidential aspirants, said he is not aware that the party’s leadership has shortlisted five candidates for its primary election.\nAmid a strong list of other persons including the vice president Yemi Osinbajo and former Lagos State governor Bola Tinubu jostling for the ticket, Bakare doubled down on his prediction to Nigeria’s 16th president.\n“I carry grace.\nGive me the opportunity to speak with party delegates and you will see what will happen,” Bakare said.\n“The president is 15th and I’ll be number 16th.”The cleric, however, noted that he will congratulate whoever emerges as APC presidential candidate at the end of the convention."
  },
  {
    "headline": "APC’s sole female Presidential Aspirant steps down for Tinubu",
    "summarized_story": "By Omeiza Ajayi, AbujaThe only women presidential aspirant in the ruling All Progressives Congress APC, Barr.\nUju Ken Ohanenye has stepped down for Asiwaju Bola Ahmed Tinubu.\nSpeaking at the convention ground on Tuesday night, she described Tinubu as a lifesaver.\nI am pleading with all the delegates to know that their votes are life savers.\n“I have decided to step aside for that life saver who is Asiwaju Bola Ahmed Tinubu”."
  },
  {
    "headline": "APC’s sole female Presidential Aspirant, Uju steps down for Tinubu",
    "summarized_story": "Omeiza Ajayi, AbujaThe only women presidential aspirant in the ruling All Progressives Congress APC, Barr.\nUju Ken Ohanenye has stepped down for Asiwaju Bola Ahmed Tinubu.\nSpeaking at the convention ground on Tuesday night, she described Tinubu as a lifesaver.\nI am pleading with all the delegates to know that their votes are life savers.\n“I have decided to step aside for that life saver who is Asiwaju Bola Ahmed Tinubu”."
  },
  {
    "headline": "I’ll replicate my achievements in Kogi at the centre — Yahaya Bello",
    "summarized_story": "Governor Yahaya Bello said he would replicate what he is doing in Kogi nationwide, if elected.\nAccording to him, he has fought insecurity, ensured ethnic harmony, improved on education, healthcare and ensured youths and women empowerment.\nPromising to do these at the centre, he said he would consolidate on President Buhari’s achievements.\nHe said with the support of millions of youths, he would win the presidential election before 2 pm on Election Day, February 25, 2023."
  },
  {
    "headline": "EFCC will come after some APC aspirants after presidential primary – Tunde Bakare",
    "summarized_story": "Pastor Tunde Bakare of The Citadel Global Community Church has claimed that the Economic and Financial Crimes Commission will go after some of the aspirants that contested in the All Progressives Congress (APC) presidential primary.\nThe fiery cleric made these remarks at the party’s special convention on Tuesday night.\nThe EFCC will soon be after them,” Bakare said.\nBakare also accused some of the contestants of “bringing delegates with delegates”.\nThis comes after he vowed not to join others in stepping down for the APC National Leader, Asiwaju Bola Tinubu."
  },
  {
    "headline": "Owo massacre: We’ve counted 38 bodies, still tracing others – Ondo Catholic Bishop",
    "summarized_story": "Most Reverend Jude Arogundade, Bishop of the Catholic Diocese of Ondo, on Tuesday, revealed that 38 people were killed in the last Sunday attack at Saint Francis Catholic Church in Owo, Ondo State.\nAccording to Arogundade, efforts were still being made to track those who took their loved ones’ bodies and did not bring them to the hospital.\nWhile speaking with reporters about the attack that rocked the community on Sunday, the Bishop revealed that “the figure that we can account for presently is 38.\n“Even some people came to take the bodies of their loved ones.\n“But in the catholic hospital which is Saint Louis Hospital in Owo and the Federal Medical Centre in Owo, we have 38 bodies.”"
  },
  {
    "headline": "Anambra: I don’t believe you – Soludo reacts to Fr Ebube Muonso’s prophecy",
    "summarized_story": "Muonso, who was addressing his congregation in a viral video, said there is need to pray for Anambra and Soludo.\nResponding to Muonso’s prophecy, Soludo in a statement he personally signed on Tuesday, said he doesn’t believe the prophecy, adding that no man has a say in his life.\nAccording to Soludo: “On your prophecy, you’re certainly entitled to claim that you “saw” anything, and to call for prayers.\nI need all the prayers in the world and I believe that thousands of people of goodwill are praying for us and for Anambra.\nI’ve lived my life to this age without needing or relying on “prophecies”, and it’s too late now to change."
  },
  {
    "headline": "Kaduna: Security operatives repel bandits’ attack, rescue three persons",
    "summarized_story": "The Kaduna State Police Command on Tuesday, said a combined team of operatives repelled bandits’ attack on commuters along Kaduna-Abuja road.\nIn a statement signed by the Kaduna State Police Command’s Public Relations Officer, ASP Mohammed Jalinge, said the operatives rescued three kidnap victims and recovered eight bandits’ operational motorcycles.\nAccording to the statement, the security operatives observed the suspicious movement of the bandits and exchanged fire arms just as the bandits escaped, leaving one of the abductees; a Chinese expatriate and two others.\nHe said the victims have been taken to a hospital for medical attention, while items recovered from the bandits are being analyzed.\nThe Kaduna State Commissioner of Police, CP Yekin Ayoku, applauded the commitment and synergy between the Police and other security agencies and encouraged officers at all levels to sustain the same for the interest of public safety."
  },
  {
    "headline": "APC convection: Our accreditation was a huge success – Gov. Abiodun",
    "summarized_story": "Ogun State Governor and Chairman, Accreditation and Decoration Committee for the All Progressives Congress (APC) Presidential Primary, Prince Dapo Abiodun, has described the accreditation of delegates, as a huge success, despite the minor hitches experienced during the commencement of the process.\nGovernor Abiodun who stated this when he spoke with newsmen at the International Conference Centre, Abuja, on the accreditation of delegates for the election, noted that despite some few notable hitches, the process recorded a big success.\nAccording to Prince Abiodun, “36 states and the Federal Capital Territory with 2322 delegates are being accredited.\nSince all these issues have been successful resolved, I think we are going to have a first class Primary election”, he stated.\nThe Senator representing Lagos West, Senator Olamilekan Adeola commended the governor Abiodun led committee for doing a good job advising the delegates to vote for a candidate that would work for the betterment of the people."
  },
  {
    "headline": "Owo Church Attack: OPC seeks tight security for Southwest",
    "summarized_story": "President of Oodua Peoples Congress Reformed, Dare Adesope, has said those who attacked worshippers at St. Francis Catholic Church in Owo, Ondo State, committed a callous and wicked crime against humanity.\nAccording to him, it is high time Southern governors empowered local security operatives, like members of OPC(R), to face terrorists threatening the region’s peace.\n“We are ready to work with other security operatives to save our communities from external terrorist,” he said.\nThe OPC (R) President urged all the Southern governors to take security issue serious.\nAdesope called for a formidable strategy to be put in place in the Southwest so that the region’s security personnel could protect the residents in all situations."
  },
  {
    "headline": "Owo Church Attack: WHO pledges support for govt",
    "summarized_story": "The World Health Organisation (WHO) has pledged to offer relevant support to the Ondo State government to help it recover from the effect of last Sunday’s terror attack on St. Francis Catholic Church in Owo, Ondo State.\nIt has sent emergency trauma kits and other support materials, including emergency medical personnel, to the state.\nDr. Mulombo, who applauded Akeredolu for his prompt response to the situation, despite being outside the state when the attack happened, described the attack as unspeakable.\nThe WHO chief said the global body was trying to engage other UN agencies to come together and see how they could support Ondo State to recover from the unfortunate incident.\nWe will remain available for any additional support as Ondo State might require to deal with this difficult situation.”Akeredolu promised that such terror attack would never happen in the Southwest."
  },
  {
    "headline": "Owo Church Attack: Adeboye prays against recurrence",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, has prayed God to save Nigeria from witnessing the type of bloodshed that occurred last Sunday at St. Francis Catholic Church in Owo, Ondo State.\nReacting to the killing of worshippers at the church, the cleric wrote: “My heart goes out to everyone who has suffered from this gruesome attack.\n“Every soul counts before God, and I know that He is greatly displeased with this wickedness.\n“I pray that God comforts the loved ones of the departed, and the people of Ondo at large.\nAnd may Nigeria never know such bloodshed again.”"
  },
  {
    "headline": "Owo Church Attack: Victims to be buried soon",
    "summarized_story": "The bodies of 38 worshippers among those killed last Sunday at St. Francis Catholic Church in Owo, Owo Local Government Area of Ondo State, are to be buried soon.\nIt was learnt that the Catholic Church had not fixed a date for the burial.\nA cleric in the church, who spoke in confidence, said: “There are plans to give mass burial to those who lost their lives in the Sunday attack.\n“Those that will be given mass burial are those whose bodies could not be identified by anyone.\n“But in the Catholic Hospital, which is Saint Louis Hospital in Owo, and the Federal Medical Centre (FMC) in Owo, we have 38 bodies,” he said."
  },
  {
    "headline": "UN urges govts to support plan to secure religious places",
    "summarized_story": "The High Representative for the UN Alliance of Civilisations (UNAOC), Mr. Miguel Moratinos, has urged all governments to support the implementation of Plan of Action to Safeguard Religious Sites to keep worshippers safe.\nMoratinos spoke against the backdrop of the attack on St. Francis Xavier Catholic Church in Owo, Ondo State, during last Sunday’s Pentecost mass.\nHe recalled the UN Plan of Action to Safeguard Religious Sites, developed by UNAOC, and appealed to all governments and relevant stakeholders to support its implementation.\nAttacks on places of worship are “abhorrent”, he said, urging the Nigerian authorities to spare no effort in bringing those responsible to justice.\nTill date, no group has claimed responsibility for the attack, which is considered unusual in Southwest Nigeria."
  },
  {
    "headline": "Nigeria recorded N1.2trn trade surplus in Q1 2022 –NBS",
    "summarized_story": "The National Bureau of Statistics (NBS) says Nigeria recorded a total N1.2 trillion trade surplus in the first three months of 2022.\nThe bureau stated this in its recent report titled: ‘Foreign trade in goods statistics (Q1 2022)’.\nA trade surplus is an economic indicator of a positive trade balance in which the exports of a nation outweigh its imports.\nIn the first quarter of 2022, Nigeria’s total trade stood at N13 trillion, this was higher than the value recorded in the fourth quarter of 2021 (N11.7 trillion) and the value recorded in the corresponding period of 2021, which stood at N7.86 trillion.\n“Total Exports were N7.1 trillion of which re-exports stood at N115.80 billion, while total imports stood at N5.90 trillion,” the report reads."
  },
  {
    "headline": "Breaking: Nicholas Felix steps down for Osinbajo",
    "summarized_story": "Nicholas Felix, a US-based Nigerian pastor of the Miracle Church International, and a presidential aspirant of the All Progressives Congress (APC), has annouced he was stepping down for the Vice President Dr Yemi Osinbajo.\nFelix made the announcement while address his supporters and delegates of the APC at the convention of the party at the Eagle Square.\nDetails soon…Partner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it .\nDo not miss the Vital Information, it goes off in 2 days!"
  },
  {
    "headline": "I’m the unifier Nigeria needs as president–Tinubu",
    "summarized_story": "From Romanus Ugwu, AbujaFormer Governor of Lagos State, Asiwaju Bola Ahmed Tinubu, has said that he is the unifier that Nigeria currently needs as president to reposition the country.\nThere is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\n“There is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\nWe need to build a Nigeria where sufficient jobs for the urban population are available and lead to a good life.\nBy giving me the party’s mandate, I hereby makey solemn vow to make Nigeria the best home for its citizens."
  },
  {
    "headline": "BREAKING: Amosun, Fayemi, Bankole, Akpabio, step down for Tinubu",
    "summarized_story": "Also Senator Ajayi Boroface announced he has stepped down, while Governor of Jigawa state Badaru Abubakar has announced he will be supporting the ambition of Senator Tinubu.\nThey announced this while giving their remarks at the ongoing national convention of the party.\n“Vote for Asiwaju Bola Tinubu.\nUnite Nigeria, vote for Tinubu,” Akpabio said.\nDetails soon…Partner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "APC presidential primary: Election imminent as aspirants refuse to step-down for each other",
    "summarized_story": "Earlier, speculations were riff that the race has been reduced to three aspirants, comprising Asiwaju Bola Ahmed Tinubu, Prof Yemi Osinbajo and Rotimi Chibuike Amaechi.\nFew hours later, another report trended that the northern APC Governors have shortlisted and submitted the names of five aspirants to President Muhammadu Buhari for consideration.\nEqually speaking on a television outfit, the Director-General of Yemi Osinbajo Support Groups, Kabiru Gaya, had claimed that the presidential contest has been narrowed between Tinubu and Osinbajo.\nThe governors have no power to reduce the number of aspirants, not even the party.\n“As far as we are concerned, we are ready for election, and if all the 23 people that are there are screened by the party and allowed for election, we will conduct an election."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Nine African startups joins Norrsken's accelerator",
    "summarized_story": "Nine African startups representing 8 countries have been selected to participate in the second edition of the Norrsken Impact Accelerator, a prominent early-stage accelerator.\nThe accelerator is one of the programmes of the Norrsken Foundation.\nNorrsken Foundation has been courting Africa since it announced in 2019 the launch of its entrepreneurship hub, Norrsken House, in Kigali, Rwanda.\nIn the same year, it selected 11 startups from Africa to join the inaugural edition of the Norrsken Impact Accelerator.\n“Our accelerator brings together over one hundred extraordinary individuals who channel their knowledge, experience and network to pave the way for early-stage, up-and-coming impact tech startups,” said Funda Sezgi, Norrsken Impact Accelerator managing director and co-founder."
  },
  {
    "headline": "Mara hires ex-Apple executive as Chief Marketing Officer",
    "summarized_story": "Mara, a pan–African crypto exchange platform, has appointed Susan Younis as its Chief Marketing Officer (CMO).\nThere, she oversaw marketing for African artists including Ayra Starr, Asa, Simi, Spinall, and Khaid.\n“I am thrilled to be joining Mara at such a critical time of transformation for the crypto economy in Africa,” Younis said.\nMara’s executive team and board advisors include former executives from Amazon, PayPal, Uber, Nvidia, and other Fortune 500 companies.\nIts flagship product is a consumer crypto-brokerage app that allows users to buy, send, sell and withdraw fiat and crypto assets."
  },
  {
    "headline": "Politicking down to the wire ahead of APC presidential primary",
    "summarized_story": "Politicking has reached fever pitch ahead of the presidential primary of the ruling All Progressives Congress (APC) as the party faces an uphill task of choosing its presidential candidate.\nThe indication is that the choice of the 2023 APC presidential candidate will emerge through the ballot at the ongoing national convention.\nIntensive lobbying of APC delegates has begun in Abuja as the ruling party prepares to choose its presidential candidate at the Eagle Square on Tuesday.\nA similar leak, though true, was the news about the northern APC governors’ support for a consensus candidate from the South.\nBut as it is, the southern region and APC presidential aspirants from that part of the country are yet to arrive at a consensus, as advised by the party’s hierarchy."
  },
  {
    "headline": "Politicking down to the wire ahead of APC presidential primary",
    "summarized_story": "Politicking has reached fever pitch ahead of the presidential primary of the ruling All Progressives Congress (APC) as the party faces an uphill task of choosing its presidential candidate.\nThe indication is that the choice of the 2023 APC presidential candidate will emerge through the ballot at the ongoing national convention.\nIntensive lobbying of APC delegates has begun in Abuja as the ruling party prepares to choose its presidential candidate at the Eagle Square on Tuesday.\nA similar leak, though true, was the news about the northern APC governors’ support for a consensus candidate from the South.\nBut as it is, the southern region and APC presidential aspirants from that part of the country are yet to arrive at a consensus, as advised by the party’s hierarchy."
  },
  {
    "headline": "Uju Kennedy Ohaneyen steps down for Tinubu",
    "summarized_story": "Uju Kennedy Ohaneyen, the only female aspirant on the All Progressives Congress (APC) has stepped down for Bola Ahmed Tinubu."
  },
  {
    "headline": "World Environment Day 2022: Chevron Nigeria’s Commitment to a Sustainable Future – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Every year on June 5, the world commemorates World Environment Day (“WED”) to celebrate and promote environmental awareness and sustainability across the globe.\nThe theme for this year is “Only One Earth” with focus on “Living Sustainably in Harmony with Nature.” It beams a spotlight on climate action, nature action and pollution action while encouraging everyone, everywhere to live sustainably.\n“Our Environmental philosophy and processes lay the foundation for sound environmental management.\nIn 2005, CNL began supporting a yearly postgraduate research scholarship for PhD students in environment and conservation, instituted by the NCF.\nEdu Memorial Lecture to promote environmental management awareness and partners with the Lagos State Government and NCF to sponsor an annual environmental awareness programme, tagged, Walk for Nature, an event held to create awareness and promote nature conservation and sustainable environmental management."
  },
  {
    "headline": "Edo FA Cup: Insurance FC, Feeders Land In Quarter Finals As Edo Queens Whitewash Genesis Queens – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFootball activities resumed yesterday in the ongoing Edo FA Cup after the tragic incident on Thursday that put the Challenge cup on hold as Bendel Insurance FC and Feeders defeated their opponents to book quarter finals place in the Challenge Cup.\nTaiwo tapped in Feeders grasuate Chinedu’s fine pull out from the right flank to take the game beyond the reach of Star City .\nIn the second game,Towo Eventus’ brace (8,51) minutes and Jude Oghe’s16th goals dumped out Konstanz Dike FC from the competitionThe defending champions Insurance FC will be playing against an experienced side B.J Foundation FC in the first quarter finals game today at the School of Health Technology.\nIn the female fixtures, Edo Queens FC have booked the finals ticket in the Edo FA Cup after Whitewashing Genesis Queens FC 9-0.\nThey await the winners between Fortress Ladies and Brave Hearts Ladies in the second semifinals game."
  },
  {
    "headline": "Owo church massacre: Your govt in Abuja has failed Nigerians – EDSG chides Edo APC – Nigerian Observer",
    "summarized_story": "According to him, “Edo APC has been uncomfortably mum about the recent attack at the St. Francis Catholic Church in Owo, Ondo State, which has drawn condolences and condemnation from across the country.\n“When Governor Godwin Obaseki embarks on foreign trips to seek investment, Edo APC is quick to throw tantrums.\nBut on a very important occasion such as the Owo attack, they have failed to make a statement to commiserate with the victims.\nThis failing is what Edo APC has refused to acknowledge and draw the attention of its leaders in the executive arm of government to so as to forestall a reoccurrence.\nThe government must rise up to the occasion and take responsibility for the task of protecting the lives of Nigerians,” Osagie charged."
  },
  {
    "headline": "Obaseki extends tenure of AAU Special Intervention Team – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie, Esq., said the special team’s tenure was extended by 6 (six) months.\nOgie noted, “It is hereby announced for the information of the general public and in particular, the Ambrose Alli University Community that further to the provision of Section 2(c) of the Ambrose Alli University (Special Intervention Powers) Law 2021, the Governor, His Excellency, Mr. Godwin N. Obaseki has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team by 6 (six) months.\n“Accordingly, the general public and the Staff and students of the Ambrose Alli University, Ekpoma are to note the foregoing.”The intervention team was set up by Governor Obaseki to exercise all the powers and functions of the Governing Council of the Ambrose Alli University, with a charge for them to advance the government’s vision to reposition the institution to meet global standards.\n“You are also going to develop a means of funding the university outside government resources by developing a strategy that will help reduce overdependence on government and separate politics from the university.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "BREAKING: Akpabio, Amosun, Fayemi step down for Tinubu at APC presidential primary",
    "summarized_story": "Former governor of Akwa Ibom State, Godswill Akpabio; Ekiti State governor, Kayode Fayemi and Ibikunle Amosun, former governor of Ogun State have all stood down for Bola Tinubu at the APC presidential primary."
  },
  {
    "headline": "Senate majority leader dumps APC, joins PDP",
    "summarized_story": "Yahaya Abdullahi, Senate majority leader, has dumped the ruling All Progressives Congress (APC) to the opposition Peoples Democratic Party (PDP) in Kebbi State.\nYahaya’s special adviser on media and publicity Muhammad Jamil Gulma confirmed the defection.\n“Senate Leader Dr Yahaya Abdullahi will on Wednesday by 9 am leave Abuja for Kebbi and proceed to Kamba local government to formally declare for PDP and to possibly indicate his interest to contest his present seat,” he said.\nDr Yahaya who participated in the APC’s Kebbi governorship primaries was reported to have scored Zero votes, an outcome which he had since rejected."
  },
  {
    "headline": "How some politicians wanted to take advantage of separatist agitation in S/East — Uko",
    "summarized_story": "In the case of the Igbo, I think Igbo politicians are responsible for crashing the desire and dream for a South East Presidency.\n95 of them voted as delegates at the convention and 80 voted against South East Presidency.\nHistory has noted that over 80% of South East delegates voted against South East presidency.\nIs the South East worse off under APC than it was under PDP?\nThe errors made by the Igbo political class in handling the agitation, brought us to where we are today."
  },
  {
    "headline": "JUST IN: Court affirms Ifeanyi Odii as Ebonyi PDP guber candidate",
    "summarized_story": "A federal high court sitting in Abakaliki, capital of Ebonyi State has nullified the rescheduled primary elections of the Primary elections of the Peoples Democratic Party in Ebonyi State.\nThe Court ruled that the primary elections, that took place on June 5 and 6, 2023, which produced Senator Obinna Ogba as a governorship candidate and others were illegal, unconstitutional, null and void.\nThe Court also affirmed the primary elections earlier conducted, which held on May 29, 2022 in the state that produced Dr Ifeanyichukwu Odii as governorship candidate of the PDP"
  },
  {
    "headline": "Seven APC presidential aspirants reject govs’s list of five",
    "summarized_story": "Seven All Progressives Congress (APC) presidential aspirants aspirants have rejected the five names drafted by the party’s governors and recommended to President Muhammadu Buhari to choose from.\nHowever, the aspirants who failed to make the list, insisted that nobody consulted them before the Governors arrived at the decision.\nThe aggrieved aspirants made this claim in a terse statement issued in the early hours of Tuesday.\nThe aspirants said President Buhari did not equivocally support zoning the presidency to the South and questioned the motive of the governors.\nPresident’s directive is very simple, that all Presidential aspirants including those from the North should meet and harmonise in order to produce a single candidate."
  },
  {
    "headline": "BREAKING: Second Presidential Aspirant, Amosun, Steps Down For Tinubu",
    "summarized_story": "Senator representing Ogun Central and All Progressives Congress (APC) presidential aspirant, Ibikunle Amosun, has withdrawn from the race for the party’s presidential ticket, declaring support for fellow contestant, Asiwaju Bola Ahmed Tinubu.\nADVERTISEMENTAmosun was the immediate-past governor of Ogun State, where a fellow presidential aspirant, Vice President Yemi Osinbajo, SAN hails from.\nDetails Later…"
  },
  {
    "headline": "BREAKING: Second Presidential Aspirant, Amosun, Steps Down For Tinubu",
    "summarized_story": "Senator representing Ogun Central and All Progressives Congress (APC) presidential aspirant, Ibikunle Amosun, has withdrawn from the race for the party’s presidential ticket, declaring support for fellow contestant, Asiwaju Bola Ahmed Tinubu.\nADVERTISEMENTAmosun was the immediate-past governor of Ogun State, where a fellow presidential aspirant, Vice President Yemi Osinbajo, SAN hails from.\nDetails Later…"
  },
  {
    "headline": "APC Presidential Ticket: I Have Built Formidable Political Structure To Deliver Victory – Tinubu",
    "summarized_story": "Former Lagos State governor and All Progressives Congress (APC) presidential aspirant, Asiwaju Bola Ahmed Tinubu, on Tuesday night, said he has built a formidable political structure to deliver victory for party in the 2023 elections.\nADVERTISEMENTSpeaking at the party’s ongoing special national convention in Abuja, where a presidential candidate will be elected, he said the party’s presidential candidate must have the experience for the office of the president.\nI sincerely believe I am the person this moment calls for.”He said he has the experience for the job having transformed Lagos State into a formidable economic center in Africa.\n“I have constructed formidable political structures that has delivered victory upon victory,” he added.\nStressing that he has expertise and financial expertise, Tinubu said, “Let me be the man who can best articulate the vision of development."
  },
  {
    "headline": "APC Presidential Ticket: I Have Built Formidable Political Structure To Deliver Victory – Tinubu",
    "summarized_story": "Former Lagos State governor and All Progressives Congress (APC) presidential aspirant, Asiwaju Bola Ahmed Tinubu, on Tuesday night, said he has built a formidable political structure to deliver victory for party in the 2023 elections.\nADVERTISEMENTSpeaking at the party’s ongoing special national convention in Abuja, where a presidential candidate will be elected, he said the party’s presidential candidate must have the experience for the office of the president.\nI sincerely believe I am the person this moment calls for.”He said he has the experience for the job having transformed Lagos State into a formidable economic center in Africa.\n“I have constructed formidable political structures that has delivered victory upon victory,” he added.\nStressing that he has expertise and financial expertise, Tinubu said, “Let me be the man who can best articulate the vision of development."
  },
  {
    "headline": "JUST-IN: APC Delegate From Jigawa Slumps, Dies In Abuja",
    "summarized_story": "A delegate at the ongoing special national convention of the ruling All Progressives Congress (APC) from Jigawa State, Isah Baba-Buji, has slumped and died while taking his breakfast on Tuesday in Abuja.\nADVERTISEMENTThe APC spokesperson in Jigawa State, Bashir Kundu, confirmed the incident to journalists in the State.\nKundu said Baba-Buji’s body was being prepared to be conveyed back to Jigawa State for burial rites.\nThe deceased was the APC vice chairman for Jigawa South-West senatorial zone.\nSome of them include Vice President Yemi Osinbajo, APC national leader Bola Tinubu, Senate President Ahmad Lawan, and the immediate-past Transportation minster Rotimi Amaechi."
  },
  {
    "headline": "Breaking: Buhari leaves APC Convention venue",
    "summarized_story": "President Muhammadu Buhari departed the Abuja venue of the All Progressives Congress presidential convention early Wednesday, minutes after he delivered his address.\nIn his speech, Buhari urged members of his party to remain united and avoid acrimony.\nHe rallied delegates at the special convention to consider voting the presidential candidate with the best chances of securing victory in the 2023 general elections.\n”My fellow party members and compatriots, I commend you for your various roles and contributions towards the successful conduct of the various APC primaries across the nation.\n”I commend your efforts in organising party exercises and urge you not to rest on our achievements so far."
  },
  {
    "headline": "Voting begins at APC Presidential Primary election",
    "summarized_story": "Voting has begun at the All Progressives Congress (APC) Presidential primary to choose the party’s candidate in next year’s presidential election.\nVoting began at exactly 1:30am starting with Abia State delegates.\nNo fewer than 2,322 delegates from the 774 local government areas of the country are expected to vote at the APC presidential primary.\nAbout seven presidential aspirants have stepped down for Asiwaju Bola Tinubu and one for Vice President Yemi Osinbajo.\nAt least, 14 presidential aspirants are still in the race and one of them will emerge winner today."
  },
  {
    "headline": "Just in: Social media comedienne, Madam Social, is dead",
    "summarized_story": "Just in: Social media comedienne, Madam Social, is deadPopular social media comedienne, Madam Social, is dead.\nShe died on Tuesday, 7th of June, 2022.\nHer death was announced on her Instagram page."
  },
  {
    "headline": "BREAKING: Jigawa APC Delegate Slumps, Dies In Abuja",
    "summarized_story": "Report has it that Buji suffered a heart failure on Tuesday morning at Jigawa State Liason Office in Abuja.\nThe deceased was Assistant APC chairman in charge of the Jigawa central zone.\nJigawa APC Public Relations officer Malam Bashir Kundu confirmed the incident.\nHe slumped at Jigawa State Liaison Officer in Abuja and he was rushed to hospital and died before arriving at the hospital.\nIt had been said that he died of heart failure.”"
  },
  {
    "headline": "APC Convention: Progressive Governors Working on Fayemi, Amaechi for Election",
    "summarized_story": "A few hours before the commencement of voting at the presidential convention of the All Progressives Congress (APC) tonight, governors of the party, have begun to consider the possibility of pruning down the initial list of five to Governor Kayode Fayemi of Ekiti and the former Minister of Transportation, Rotimi Amaechi.\nThe initial five names are former Lagos State governor, Bola Tinubu, Vice-President Yemi Osinbajo, Ekiti State Governor, Kayode Fayemi, former Minister of Transportation, Rotimi Amaechi and the Ebonyi State Governor, Dave Umahi.\nWith this, the governor, the source explained, would leave them with the option of Fayemi, as the aspirant from southwest to face, Amaechi, who has emerged as a compromise candidate for both the Southeast and the South-south.\nThe only person in the race that could challenge Amaechi, the source said, was Umahi, whom they eventually argued would be unable to displace the former Rivers governor, having newly joined the party.\nThese new twists, the source, claimed were the resolutions that the governors planned to announce before voting commences tonight at the Eagle Square, Abuja."
  },
  {
    "headline": "I know a name that can change Nigeria for good – Pastor Adeboye",
    "summarized_story": "I know a name that can change Nigeria for good – Pastor AdeboyeGeneral Overseer of the Redeemed Christian Church of God, RCCG, Pastor Enoch Adeboye, says he knows a name that could change Nigeria for good.\n“I know a name that can change the current state of Nigeria for Good,” he posted.\nAdeboye in a post on his Facebook page on Tuesday, expressed sadness over the attack, saying every soul counts before God.\n“Every soul counts before God, and I know that He is greatly displeased with this wickedness.\nAnd may Nigeria never know such bloodshed again”."
  },
  {
    "headline": "Breaking: Madam Social, popular social media comedienne is dead",
    "summarized_story": "A popular social media comedienne simply known as Madam social has passed on.\nHer demise was announced on her Instagram on Tuesday.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Pictures: APC delegates arrive Eagle Square after accreditation",
    "summarized_story": "Accredited delegates of the All Progressives Congress (APC) from various states of the federation, have arrived at the Eagles Square, the venue of the ongoing Presidential primary.\nThe delegates arrived in their numbers shortly after accreditation at the International Conference Center.\nThe group of delegates from various states wore matching outfits to distinguish their various states.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Mayhem in Idi-Araba as Lagos task force clash with ‘Okada’ riders",
    "summarized_story": "There was pandemonium in Idi-Araba area of Lagos state on Tuesday after scores of commercial motorcyclists popularly called ‘Okada’ riders clashed with officials of Lagos State Environmental and Special Offences (Enforcement) Unit, also known as Task Force, who were on a routine enforcement of the state traffic rules.\nLagos state government had banned okada riders from operating in six local governments’ areas – Ikeja, Eti-Osa, Lagos Island, Surulere, Apapa and Lagos Mainland Local Governments.\nThe ban covers nine Local Council Development Areas (LCDAs) under the council including Onigbongbo, Ojodu, Ikoyi-Obalende, Iru-Victoria Island, Lagos Island East, Itire-Ikate, Coker-Aguda, Iganmu and Yaba.Meanwhile, this is not the first time the state would be banning commercial motorcycles.\nThe chaos extended to the Lagos University Teaching Hospital (LUTH) after some hoodlums invaded the hospital which caused panic amongst occupants.\nThere have been similar clashes in the past between the riders and task force officials in Amuwo-Odofin and Mile 2 areas of Lagos."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria",
    "summarized_story": "By our correspondentAn Agricultural based company operating under the aegis of Green Agriculture West Africa Limited; GAWAL has reiterated its commitment to contribute to food security in Nigeria via quality and high yielding seeds.\nHe said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tons per hectare.\nThis outstanding result has ensured that more and more people are showing interest in GAWAL R1 “Through different channels, a growing number of Nigerian farmers and organizations are reaching us to buy GAWAL R1 rice seeds.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company that not only sold seed but taught farmers advanced planting techniques for optimum yield."
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "LIVE: Delegates Vote As 14 Aspirants Vie For APC Presidential Ticket",
    "summarized_story": "Twenty-three aspirants later appeared before the APC presidential screening committee led by the party’s former chairman, John Odigie-Oyegun.\n– Rochas Okorochas#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/dH3BlkhHOM — Channels Television (@channelstv) June 7, 202211:14 pm: I am the most experienced of all the candidates.\n– Tunde Bakare#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/uq2fCfZQqn — Channels Television (@channelstv) June 7, 202211:00 pm: The APC should have zoned the ticket to the South-East.\n– Bola Ahmed Tinubu addresses APC delegates.#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/C50KEHYF33 — Channels Television (@channelstv) June 7, 20228:15 pm: Things are not falling apart in APC.\nExtra: More videos from TwitterPresidential aspirant Bola Ahmed Tinubu has arrived at Eagle Square, venue of the APC presidential primary."
  },
  {
    "headline": "Owo Terror Attack: 22 Dead, 56 On Hospital Admission – Akeredolu",
    "summarized_story": "Ondo State Governor, Arakunrin Oluwarotimi Akeredolu has disclosed that 80 persons were involved in last Sunday’s terror attack at St Francis Catholic Church, Owa-luwa street, Owo.\nGovernor Akeredolu said 22 people lost their lives to the horrific attack while 52 survivors are on admission at the Federal Medical Center, Owo, St Louis Hospital, Owo and the Owo General Hospital as well as some private hospitals.\n“The site, that is, St. Francis Catholic Church, Owaluwa, Owo presents a gory war-like scene.\nThe Federal Medical Centre, Owo, the St. Louis Hospital, Owo, the General Hospital, Owo as well as some private hospitals in Owo were filled with the injured, most of who were in critical conditions.\n“In the same vein, I commend the medical teams of the Federal Medical Centre, Owo, the St. Louis Hospital, Owo, the General Hospital, Owo and some private hospitals who showed love and participated in stabilising the victims in the various hospitals."
  },
  {
    "headline": "[UPDATED] Akpabio, Amosun, Fayemi, Four Others Step Down For Bola Tinubu",
    "summarized_story": "These aspirants later beckoned on their teeming supporters who stormed the venue of the APC presidential primary to vote for Tinubu when it was time for the election.\nSimilarly, six other aspirants mounted the podium to announce their withdrawal from the contest for the APC presidential ticket and subsequent support for Tinubu.\nBut I have stepped down for Bola Ahmed Tinubu.\nI am stepping down for Bola Ahmed Tinubu.\n– Kayode Fayemi#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/PcngsJQVZM — Channels Television (@channelstv) June 7, 2022Bankole Steps DownI will like to step down for Bola Ahmed Tinubu – Dimeji Bankole#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/QdPDhpE8iN — Channels Television (@channelstv) June 7, 2022Badaru Steps DownI want to reconfirm my withdrawal from this race and support our leader Bola Ahmed Tinubu – Mohammed Badaru Abubakar#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/Kte9P2iwhd — Channels Television (@channelstv) June 7, 2022Boroffice Steps DownI am stepping down for Bola Ahmed Tinubu – Ajayi Boroffice#APCPresidentialPrimaries#APCSpecialConvention pic.twitter.com/WcoRifWzfl — Channels Television (@channelstv) June 7, 2022This is a developing story, please check back for the updated version…"
  },
  {
    "headline": "APC Presidential Aspirant, Nicholas Felix Steps Down For Osinbajo",
    "summarized_story": "A presidential hopeful of the All Progressives Congress (APC), Nicholas Felix, has stepped down for the Vice President, Professor Yemi Osinbajo, to emerge as the party’s candidate in the coming elections.\nFelix, a Nigerian pastor based in the United States, announced that he was withdrawing from the contest to support the Vice President’s presidential ambition on Tuesday in Abuja.\nHe was addressing a crowd of APC faithful comprising party leaders, delegates, and other supporters at the Eagle Square, the venue of the presidential convention in the nation’s capital."
  },
  {
    "headline": "‘Where Is The Justice?’ Onu Asks APC To Zone Presidential Ticket To South-East",
    "summarized_story": "Former Minister for Science and Technology, Dr Ogbonnaya Onu has said there is no justice in having the All Progressives Congress (APC) fail to zone the 2023 presidency to the South East.\nOnu stated this on Tuesday at the Eagles Square, while pitching his agenda to party delegates just before the commencement of voting at the presidential primary.\n“What is very very important, exceptionally important, is that we must ensure that justice is upheld,” he said in his address.\n“The South West had eight years as president, eight years as vice president; the South South had eight years as president and vice president; where is the justice?\nHe recollected how 23 years ago, he sacrificed his presidential ambition just so that two candidates from the South West could run."
  },
  {
    "headline": "APC Special Convention is Nigeria's encounter with Destiny",
    "summarized_story": "Remember, we formed this party, APC, not simply to wrest power from a wrong and failing PDP.\nWithin this context, the APC under President Muhammadu Buhari has governed with patriotic and disciplined commitment this past seven years.\nThere is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\nThere is a general agreement that 2023 will be an encounter with destiny, when our nation shall need a certain type of leader to realise a better Nigeria.\nAs an indivisible, united country, we shall overcome the destructive forces attempting to steal our destiny."
  },
  {
    "headline": "Senators Akpabio, Amosun, Fayemi step down for Asiwaju Tinubu -",
    "summarized_story": "Senator Godswill Akpabio has stepped down from the Presidential race to back the candidacy of the National Leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu.\nFormer Ogun State Governor, Senator Ibikunle Amosun has also followed suit.\nOthers are Former Zamfara State Governor, Ahmad Sanni Yerima, Mr Jack Rich, Dr Jack Nicholas, Former Ogun State Governor, Senator Ibikunle Amosun, Ekiti State Governor Kayode Fayemi, Kogi State Governor, Yahaya Bello, Cross River State Governor Ben Ayade, Former Speaker of the House of Representatives, Dimeji Bankole, Jigawa State Governor, Mohammad Badaru, Former Akwa Ibom State Governor, Obong Godswill Akpabio and Senator Robbert Ajayi Borrofice and Others.\nFor his part, the National Secretary of the All Progressives Congress, Senator Iyiola Omisore, said the party is well positioned for all round success.\nHe added that with over 45 Millionm members the All Progressives Congress has ensured inclusivenes in Politics for a majority of Nigerians."
  },
  {
    "headline": "IGP Establishes Electoral Offences Desks Across Nigeria -",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, psc(+), has approved the establishment of Electoral Offences Desk at the Force Criminal Investigations Department (FCID), Force Headquarters, Abuja, and across Nigeria with the Commissioner of Police, FCID, as the Desk Officer.\nThe IGP has equally approved its establishment at State Commands across the nation with the Assistant Commissioners of Police in charge of the Criminal Investigation Departments as State Desk Officers.\nThe mandate of the Electoral Offences Desk Officers includes the collation and investigation of all electoral offences/complaints from members of the public or any quarters, with a view to determining culpability in line with the amended Electoral Act 2022, and …proffering charges before Courts of competent jurisdiction for necessary legal action.\nThe IGP tasked the Desk to commence its activities immediately with some isolated cases recorded during the pre-election activities such as screening, conventions, primaries, etc.\nThe Inspector-General of Police, IGP Usman Alkali Baba has ordered the immediate transfer of the case to the Electoral Offences Desk at the Force Criminal Investigation Department (FCID) and the immediate arrest of the concerned aspirant for necessary investigative actions."
  },
  {
    "headline": "Governor Seyi Makinde Announces Bayo Lawal as new running mate -",
    "summarized_story": "Governor of Oyo state Seyi Makinde has announced the chairman of the state’s Housing Corporation Bayo Lawal as his new running in the 2023 gubernatorial election.\nGovernor Makinde made this declaration during a stakeholders meeting with the Oke Ogun members of the Peoples’ Democratic Party in Ibadan.\nHe is also a former Attorney General of Oyo state in 1999 under the administration of Governor Lam Adeshina.\nThere has been no love lost between the Governor Seyi Makinde and his deputy, Engineer Rauf Aderemi Olaniyan, from the onset of the current administration.\nThe announcement of his defection was after the fait accompli that he will not return as deputy governor with the governor deftly waiting until his defection was official before picking a new running mate."
  },
  {
    "headline": "APC Presidential Ticket: Fayemi, Amosun, Akpabio Step Down for Bola Tinubu",
    "summarized_story": "Governors’ Chairman and Ekiti State Governor Kayode Fayemi, former Governor of Ogun State Senator Ibikunle Amosun, and former Governor of Akwa Ibom, Senator Godswill Akpabio have all stepped down their ambition for former Lagos State Governor, Asiwaju Bola Tinubu.\nThey all urged their supporters to vote for Tinubu ahead of delegates voting.\nDetails Later."
  },
  {
    "headline": "Olu Falae: I’m Not Interested in Amendments, Nigeria Needs a New Constitution",
    "summarized_story": "Elder Statesman, Olu Falae, says the constitution governing the laws in Nigeria remains a challenge for Nigerians.\nAdding that for Nigeria to move beyond basic hindrances the constitution should be changed."
  },
  {
    "headline": "Presidency Replies Tinubu’s Claim That He Made Buhari President- Trending With Ojy Okpe",
    "summarized_story": "The presidency on Monday reacted to remarks made by presidential hopeful on the platform of the All Progressives Congress Asiwaju Bola Ahmed Tinubu who last week said that Buhari would not have become president without him.\nIn another development, the Governor of Kogi State Yahaya Bello on Monday, rejected the decision by some APC governors to zone the All Prog Congress presidential ticket to the south.\nThe Governor was seen In a video, storming out of the building where northern APC governors met with President Muhammadu Buhari."
  },
  {
    "headline": "Yahaya Bello: Excluding Me From APC Presidential Ballot May Lead To Crisis, Only Buhari Can Make Me Step Down",
    "summarized_story": "Presidential aspirant of the ruling All Progressives Congress (APC) and Governor of Kogi State Yahaya Bello has warned that excluding his name on the ballot in the convention in Abuja on Tuesday to elect the party’s presidential flag bearer for the 2023 poll will be an invitation to trouble.\nBello, who is one of the 23 aspirants cleared to contest for the party’s presidential ticket ahead of the 2023 election, said there is a conspiracy against him, accusing the APC northern governors and some elite of gang-up.\nSpeaking with newsmen Tuesday at the State House, Abuja after a closed-door meeting with President Muhammadu Buhari, Bello described himself as a leading aspirant that would win overwhelmingly if the process is transparent and credible.\nHis words: “Getting into the arena today, I will win overwhelmingly if the process is credible”.\nAccording to him, the only reason that could make him not contest the presidential primary is if President Buhari tells him to step down."
  },
  {
    "headline": "Zinedine Zidane Headbutt Statue to Be Re-Installed in Qatar Ahead of 2022 World Cup",
    "summarized_story": "A statue immortalising Zinedine Zidane’s headbutt during the 2006 World Cup final will be re-installed in Qatar after it was removed in 2013 amid a domestic backlash, the head of Qater Museums said on Monday.\nShe said the original public location of the statue was “not right” and that the sculpture would be remounted at a new sports museum in Doha, which is hosting the World Cup later this year.\nAlthough statues are on public display in many Muslim countries, they are less common in the Arab Gulf.\nThe sculpture by Algerian-born French artist Adel Abdessemed depicts the moment during extra time in the 2006 World Cup final when Zidane head-butted Italy‘s Marco Materazzi.\nZidane was sent off in his final match as a professional footballer, and Italy went on to beat France on penalties."
  }
]