[
  {
    "headline": "Looming strike: Hold FG responsible, ASUU tells parents",
    "summarized_story": "At least two zones of the Academic Staff Union of Universities have asked Nigerians to hold the Federal Government responsible if the body of university lecturers embarks on another strike.\nThe zone comprises the Federal University of Lafia, Nasarawa State; Federal University of Technology, Minna, Niger State; Nasarawa State University, Keffi; Ibrahim Badamasi Babangida University, Lapai, Niger State; and the University of Abuja.\nLawal urged Nigerians and parents with children in public universities to hold the government responsible for the consequences that might arise from the non-implementation of the MoA.\n“This is the situation across all the federal universities in the country.\nThe public, in this circumstance, should not hold our union responsible for any disruption of academic activities in Nigerian public universities.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Police commission to determine Abba Kyari’s fate, says minister",
    "summarized_story": "The Minister of Police Affairs, Maigari Dingyadi, has said the findings and recommendations on the former Head, Police Intelligence Response Team, Abba Kyari, will be presented to the President, Major General Muhammadu Buhari (retd.\n), adding that the final decision will be taken by the Police Service Commission.\nHe added that the fate of the former acting chairman of the Economic and Financial Crimes Commission, Ibrahim Magu, would be determined by the President.\n“You have also reported that the committee has submitted its report to the IGP and the report and recommendations have also been submitted to the Attorney-General for legal opinion.\nThere has to be some consultations with the ministries of foreign affairs and justice before the right decision is taken."
  },
  {
    "headline": "2023: Battle in Imo East over Ihedioha’s ambition",
    "summarized_story": "…OZDU calls on APC, PDP, APGA to hand over the guber ticket to Imo EastBy Chinonso AlozieTop Stakeholders in Imo East Senatorial District, on Tuesday, set up a Contact and Mobilization Committee to actualize the agenda to produce the next governor of Imo State in 2023.\nThey were of the view that it would be politically fair for Ihedioha to support other persons from the same zone for equity and fairness to reign among the various clans in the Imo East.\nHowever, they demanded the all political parties should hand over the governorship ticket to the Imo East, including the All Progressives Congress, APC, Peoples Democratic Party, PDP, All Progressive Grand Alliance, APGA among others.\nPart of their argument was that “Although the people of Owerri Zone are determined to ensure the emergence of an Owerri Zone candidate as the next Governor of Imo State, such Governor must emerge from other parts of the Zone who are yet to taste the position.\n“We resolved that the next Governor of Imo State should come from Owerri Zone, in the interest of equity and justice."
  },
  {
    "headline": "BREAKING: Emir of Bungudu in Zamfara, Hassan Attahiru, kidnapped",
    "summarized_story": "The Emir of Bungudu in Zamfara, Alhaji Hassan Attahiru, has been reportedly kidnapped along Kaduna-Abuja highway Tuesday, a competent source has confirmed.\nRecall that Vanguard had reported how over 75 people were kidnapped and a military base reportedly overran by bandits in Zamfara, recently.\nAs telecommunications networks remain shut down in the state, criminal activities: Banditry, Kidnapping and killings remain on a steady rise with the state governor calling for the reinstatement of the Civilian Joint Taskforce.\nDetails soon…Vanguard News Nigeria"
  },
  {
    "headline": "Empowerment programme, not national cake to be shared — Gov Fintiri warns",
    "summarized_story": "Governor Ahmadu Fintiri of Adamawa has warned that the state’s empowerment programme was meant to eradicate poverty and was not a bonus or national cake to be shared.\nFintiri stated this at the inauguration and sensitisation of beneficiaries of the Adamawa state Social Support Programme on Tuesday, in Yola.\nAccording to the governor, the programme was designed to boost the livelihoods and businesses of the less privileged in the state.\nHe noted that the Social Support Programme was a strategic “bottoms up” approach of his administration to eradicate poverty and hunger across the state.\n” To the beneficiaries, do not make the mistake of considering this empowerment as your share of the so-called national cake, but as an opportunity to be responsible citizens that Adamawa state will be proud of."
  },
  {
    "headline": "Secure Nigeria’s borders, ensure passport reforms — Aregbesola tasks acting NIS CG",
    "summarized_story": "The Minister of Interior, Rauf Aregbesola, has urged the acting Comptroller-General of the Nigeria Immigration Service (NIS), Idris Jere, to effectively secure the nation’s borders and ensure nobody slipped in from outside to cause any harm.\n“You are pretty much aware of the reforms being carried out, foremost of which is in passport administration.\nThe minister added that the acting C-G must build on the achievements of his predecessor in office, noting that his appointment as the acting C-G was natural and easy, being the most senior officer.\nAregbesola also rallied the NIS to support the acting C-G and assured him of the cooperation and assistance of the ministry and the Federal Government.\n“Sir, the service is committed to our primary mandate, which is securing Nigeria’s borders and also concluding on the passport reforms initiated by my predecessor in office."
  },
  {
    "headline": "Bauchi governor suspends secretary of Muslim welfare board",
    "summarized_story": "By Charly Agwam – BauchiBauchi State governor, Bala Mohammed has suspended the Executive Secretary of the Bauchi State Muslim Pilgrims Welfare Board, Alh.\nAbubakar Babangida Tafida pending the outcome of an investigation that has been instituted by the government into the affairs of the Board.\n“His Excellency, the Executive Governor of Bauchi State Sen. Bala A. Mohammed CON, Fnipr (Kauran Bauchi) has approved the suspension of the Executive Secretary of the Bauchi State Muslim Pilgrims Welfare Board, Alh.\n“The suspension which was communicated to the Executive Secretary in a letter signed by the Secretary to the State Government dated the 14th of September was with immediate effect.\n“The suspended Executive Secretary was directed to hand over the affairs of the Board to the most senior officer in the Board pending the outcome of an investigation that has been instituted by Government into the affairs of the Board,” he said."
  },
  {
    "headline": "Kogi jail break: Gov Bello reads riot act to assailants, commiserates with families of fallen heros",
    "summarized_story": "Following the recent attacks on the Medium Federal Correctional Centre in Kabba, Kogi State, Governor Yahaya Bello has reassured of his administration’s commitments to forestall a reoccurrence of crime in the state.\nDAILY POST recalls that gunmen in their numbers, attacked the prison on Monday killed some officers and freed all inmates in the facility.\nThe governor gave the assurance on Tuesday through his Deputy, Chief Edward Onoja, who paid an on-the-spot tour at the affected Correctional Facility.\nDuring his assessment, the deputy governor noted that his visit was a follow up of an earlier assessment by some top officials who have been to the incident scene.\nOn his part, Deputy Comptroller General of the NCS said the Service is short-staffed with inadequate equipment to repel the concurrent attacks on its facilities across the country."
  },
  {
    "headline": "Zambia’s President-elect lauds Commonwealth’s role in peaceful election",
    "summarized_story": "President of the Republic of Zambia, Hakainde Hichilema, has attributed peaceful polls to roles played by the Commonwealth under the leadership of its Secretary-General, Patricia Scotland.\nHichilema said he was imprisoned on trumped-up charges, but was released in 2017 after the intervention of the Commonwealth Secretary-General.\nThe Commonwealth didn’t give up as they came back before the election”, even though the situation didn’t improve before she left in 2018.\nHe maintained: “I’m talking about issues of violence, community political violence that needed to be dealt with.\nThe presidential election that brought Hakainde Hichilema to power was conducted on August 12, 2021."
  },
  {
    "headline": "Expose rapists or be deposed – Bauchi district head warns village heads, others",
    "summarized_story": "With increasing rape cases in the society, the District Head of Dan Iya Ward of Bauchi Local Government Area of Bauchi State, on Tuesday, warned village heads and other traditional title holders in the district against treating such cases with kid’s gloves.\nAccording to Bashir, who said he was an advocate of women being in decision making bodies, submitted that when women were involved in decision making, they would be able to present issues affecting them and their children for proper action to be taken.\nWhile noting that who no home will progress without a woman, the district head urged both traditional title holders and religious leaders to always involve women in every decision making process.\nOn her part, the representative of the Bauchi State Ministry of Women Affairs and Child Development at the meeting, Esther Patrick, lamented that women are not adequately represented in decision making bodies.\nWhile reiterating the importance of women in decision making and nation building, she urged men not to see the call to support women participation in decision making as trying to complete with them."
  },
  {
    "headline": "Buhari govt launches programme to reduce youth unemployment in Nigeria",
    "summarized_story": "The President Muhammadu Buhari-led administration on Tuesday launched the Nigerian Youth Employment Action Plan (NIYEAP 2009-2011).\n“It is important to state that the economic and social consequences of youth unemployment transcend the youth group.\nThe minister said since he assumed office, the ministry has concentrated efforts on moving youth development interventions from the empowerment model to a sustainable system.\nHe added that the action plan emphasizes the 4Es: Employability, Entrepreneurship Development, Employment Creation and Equality and Rights.\nThey include Digital Economy, Rural Economy, Green Economy and Renewable energy sector, Manufacturing, Tourism, Construction and Services."
  },
  {
    "headline": "BREAKING: Gov Ugwuanyi signs anti-open grazing bill into law",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State has signed the anti-open grazing bill into law, at the Government House, Enugu.\nThe bill which is for a law prohibits open grazing, regulates cattle ranching, and for connected purposes was recently passed by the Enugu State House of Assembly.\nRecall that the Leader of the House, Rt.\nIkechukwu Ezeugwu, had explained after the passage of the bill, that it would be cited as the “Prohibition of Open Grazing and Cattle Ranching Law of Enugu State,” after the governor’s assent.\nUgwuanyi’s assent to this bill is expected to improve security and peace in the state."
  },
  {
    "headline": "Minister accuses private jet owners of aiding gold smuggling",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -Some private jet owners have been accused of aiding and abetting illegal mining and smuggling of gold out of Nigeria.\nMinister of State for Mines and Steel Development Uche Ogah, who made the allegation, was silent on the identities of the jet owners.\nHe made the declaration at an investigative hearing on alleged loss of $9 billion annually by the Federal Government to illegal mining and gold smuggling.\nThe hearing was organised by the Senate Committee on Solid Minerals, Mines, Steel Development and Metallurgy, also called for capital punishment for offenders.\nFadahunsi said: “Gold smuggling and illegal mining are carried out by political elites and not just the poor masses at the illegal mining sites."
  },
  {
    "headline": "IPOB sit-at-home does not affect South-East Governors – Umahi",
    "summarized_story": "Agency Reporter- Advertisement -Ebonyi Governor David Umahi has said the sit-at-home syndrome in the five states of the South-East does not affect the Governors.\nAbraham Nwali, as the new South-East Zonal Chairman of the Christian Association of Nigeria (CAN).\n“Governors of the southeast have done their best to check the situation and when people sit at home, it is not biting the governors.\n“When you sit at home, there is food for the governors in their homes and some of their children are outside the country,” Umahi, who is the Chairman, Southeast Governors’ Forum, said.\nIn a brief speech, the new Southeast CAN Chairman, Rev."
  },
  {
    "headline": "History of Prisons breaks in Nigeria",
    "summarized_story": "Ogun prisons breakOn 4 January , 2013, it was reported that the Sagamu Minimum Prisons, Ogun State was attacked.\nTwelve however escapedKogi prisons breakIn November 2014, there was a breach at the Federal Medium Security Prisons in Koto-Karffi, Kogi State.\nMinna prisons breakOn 6 December 2014, the Minna Medium Prisons was attacked by three gunmen suspected to be armed robbers.\nKuje prisons breakOn 24 June 2016, there was a jailbreak at the Kuje Medium Security Prisons in the Federal Capital Territory.\nOwerri prisons breakOn 5 April 2021, a group believed to be Eastern Security Network(ESN) attacked Owerri Prisons in Owerri, Imo State."
  },
  {
    "headline": "Six Nigerians named as global terrorism sponsors",
    "summarized_story": "Abdurrahaman Ado Musa, Salihu Yusuf Adamu, Bashir Ali Yusuf, Muhammed Ibrahim Isa, Ibrahim Ali Alhassan and Surajo Abubakar Muhammad were the six Nigerians placed on the Middle-East giant’s watch list.\nAhmed Mohammed Abdulla Mohammed Alshaiba Alnuaimi (UAE)2.\nMohammed Ahmed Musaed Saeed (Yemen)8.\nRashed Saleh Saleh Al Jarmouzi (Yemen)13.\nNaser Aljarmouzi Cargo & Clearing LLC49."
  },
  {
    "headline": "NCoS recaptures 114 escapees of Kabba Medium Security Custodial Centre",
    "summarized_story": "From Joseph Inokotong, AbujaFollowing the attack on the Medium Security Custodial Centre, Kabba in Kogi State on Sunday, and the swift intervention of the Controller General of Corrections, Haliru Nababa, a total of 114 escapees have been recaptured.\nThe CG, who personally led a team to the Custodial Centre for an on-the-spot assessment, directed the Search Party Response Team to go after the escapees even as Security has been beefed up through the deployment of additional Armed Squad personnel to fortify the facility.\nIn a statement issued by CC Francis Enobore, PRO, he said the CG commended the collaboration and support extended to the Service by sister security agencies including the Vigilante groups which assisted in recapturing the fleeing inmates.\nWhile assuring the general public of their safety, the CG stated that no effort will be spared in smoking out the fugitives from hiding.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "VAT war: No regret supporting FG- Umahi.",
    "summarized_story": "The Governor stated this on Tuesday during the inauguration of south east leaders of the Christian Association in Nigeria(CAN) with his Senior Special Adviser(SSA) on Religion and Welfare, Rev.\nHe said “the sit-at-home is not biting the south East Governors.\n“Nobody is sitting at home in the West, in the North, in the South South.\nWhen our people push for restructuring, yes, I agree with restructuring but it has to be administrative restructuring, I will continue to preach it.\nI will continue to preach that allow the federal government to collect VAT and share for us”."
  },
  {
    "headline": "BREAKING: Imo SSCE students: IPOB to rebuild damaged school property",
    "summarized_story": "“Any other purported sit-at-home including the suspended weekly sit-at-home on Mondays does not exist in the dairy of IPOB.\n“Anybody trying to enforce any sit-at-home order using the name of IPOB is a saboteur, and does so at his peril.\nExplaining why the order was relaxed on Mondays ,Powerful said “IPOB is a responsible organisation with reasoning and empathy.\nThat was why we reduced the sit-at-home protests to the days our leader, Mazi Nnamdi Kanu will be making appearances in court.\nAnybody trying to impose another sit-at-home order on our people or enforce illegal or imaginary sit-at-home is not IPOB, and must be dealt with."
  },
  {
    "headline": "Tension as gunmen kill soldiers, free 240 inmates at Kogi Custodial facility – The Sun Nigeria",
    "summarized_story": "From Emmanuel Adeyemi, LokojaThe Federal Government yesterday, said security forces have launched a manhunt for gunmen who attacked Kabba Medium Security Custodial Centre in Kogi State on Sunday.\nDaily Sun learnt that the gunmen attacked a military checkpoint located a few metres away from the correctional centre with heavy gunfire before attacking the prison.\nAnother eye witness account, however, said the gunmen attacked an uncompleted building where the soldiers normally hibernate and after that broke into the correctional centre releasing over 100 inmates.\nHe said during the attack, security officers on duty, comprising 15 soldiers, 10 police officers and 10 armed guards of the service fought gallantly to repel the attack.\nMeanwhile, some of the inmates who escaped have also voluntarily returned to the facility this morning,” he said."
  },
  {
    "headline": "Six Nigerians Named in UAE List of Terrorism Sponsors",
    "summarized_story": "The six Nigerians on the list are Abdurrahaman Ado Musa, Salihu Yusuf Adamu, Bashir Ali Yusuf, Muhammed Ibrahim Isa, Ibrahim Ali Alhassan and Surajo Abubakar Muhammad.\nAhmed Mohammed Abdulla Mohammed Alshaiba Alnuaimi (UAE)2.\nMohammed Ahmed Musaed Saeed (Yemen)8.\nRashed Saleh Saleh Al Jarmouzi (Yemen)13.\nNaser Aljarmouzi Cargo & Clearing LLC11."
  },
  {
    "headline": "Breaking: InfraCorp Kicks off in October",
    "summarized_story": "The infrastructure company (InfraCorp) being created by the Central Bank of Nigeria, African Finance Corporation and the Nigerian Sovereign Investment Authority to raise N15 trillion will be unveiled in October, CBN Governor Emefiele has disclosed.\nIn his address Tuesday at the 14th Annual Banking & Finance Conference, organized by the Chartered Institute of Bankers of Nigeria (CIBN), Emefiele said the “InfraCorp would enable the use of mostly private capital to support infrastructure investment that will have a multiplier effect on growth across critical sectors.”Emefiele explained that the purpose of the N15trn being raised was to address some of Nigeria’s infrastructure needs, while providing reasonable returns to investors.\n“We are all aware of the criticality of infrastructure in fostering economic growth.\nWhile noting that this well-structured fund could act as a catalyst for growth in the medium and the long run, the CBN governor said the support of the banking community was important in achieving this objective.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: CBN to Establish NIFC in 2022",
    "summarized_story": "To consolidate on the growth and resilience of Nigerian banks in the last decade, the Central Bank has announced that it will establish the Nigerian International Financial Centre (NIFC) in the next 12 months.\nIndeed, key indicators in the banking sector continue to reflect that our banking sector remains strong, resilient, and healthy.\nCapital Adequacy Ratio and Liquidity Ratio in the banking sector have remained above the prudential limits at 15.5 and 41.3 percent, respectively.\nOur banking sector remains well positioned to support the recovery efforts of the fiscal and monetary authorities.\n“The CBN governor declared that “Nigerian banks have become not only strong and resilient, but have also carved a good niche in the world.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Seeks Senate’s Approval to Obtain $4bn, €710m Loan",
    "summarized_story": "By Deji Elumoye and Emameh GabrielPresident Muhammadu Buhari has sought the approval of the Senate to obtain $4 billion and €710 million loan to address critical projects approved by the Federal Executive Council (FEC).\nThe request was contained in a letter read Tuesday at the resumption of plenary by the Senate after a two-month vacation by the President of the Senate, Dr Ahmed Lawan.\nIn the letter, the president said the projects listed in the external borrowing plan are to be financed through sovereign loans from the World Bank, French Development Agency, EXIM Bank and IFAD in the total sum of $4,054,476,863 and €710 million and grant components of $125 million.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Army Chief to War Commanders: I Won’t Accept Any More Excuses over Attacks",
    "summarized_story": "Yahaya asked commanders in the various theatres of operation to seize initiative and take decisive actions to defeat threats in their respective areas of responsibility.\nHe stated, “I have directed that serious attention be given to sustaining and improving the tempo in all on-going Nigerian Army operations across the country.\n“Commanders must, therefore, glean from my command philosophy to ensure that operational and administrative proficiencies of the Nigerian army units and formations are sustained and improved upon.\nThe Chief of Army Staff Combined Second and Third Quarter Conference 2021 was the first edition of the conference under Yahaya as army staff.\nThe quarterly programme of the Nigerian Army brought together Principal Staff Officers, General Officers Commanding, Commandants of Strategic Army formations, and operational commanders to brainstorm and interact with the Chief of Army Staff on the state of affairs of the Nigerian Army and review its plans for the next quarter."
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "EXCLUSIVE: How Director Of Nigeria’s Healthcare Agency, NPHCDA Uses COVID-19 Vaccination Exercise To Enrich Pocket – Workers",
    "summarized_story": "The recent drive by the Nigerian government to make COVID-19 vaccination compulsory for civil servants has been attributed to the lacklustre performance of the National Primary Healthcare Development Agency in the handling of the vaccination exercise across the country.\nSources in the agency told SaharaReporters that its Executive Director, Dr Faisal Shuaib, politicised the whole exercise at the detriment of getting Nigerians vaccinated.\nAnother source alleged that the agency’s Executive Director saw the vaccination programme as an avenue to enrich his pocket.\n\"In our agency, everything is overinflated, and no one dares to question the executive director.\nHe stated that with how the agency is undertaking the vaccination exercise, Nigeria might never attain effective vaccination of Nigerians against COVID-19."
  },
  {
    "headline": "BREAKING: Explosion Rocks Airport Road In Adamawa",
    "summarized_story": "A fuel tanker has exploded in the early hours of Monday in Yola, the capital of Adamawa state.\nThe incident happened at the busy PZ Roundabout along Airport Road.\nSaharaReporters learnt that the fuel compartment of the tanker, owned by Conoil, detached and fell while the driver was negotiating the roundabout.\nVehicles and shops within an 80-metre radius were burnt, causing losses yet to be evaluated.\nA combined team of firefighters from the state and federal fire services, Air Force, and Faro bottling company were seen working to put out the fire."
  },
  {
    "headline": "BREAKING: Explosion Rocks Airport Road In Adamawa",
    "summarized_story": "A fuel tanker has exploded in the early hours of Monday in Yola, the capital of Adamawa state.\nThe incident happened at the busy PZ Roundabout along Airport Road.\nSaharaReporters learnt that the fuel compartment of the tanker, owned by Conoil, detached and fell while the driver was negotiating the roundabout.\nVehicles and shops within an 80-metre radius were burnt, causing losses yet to be evaluated.\nA combined team of firefighters from the state and federal fire services, Air Force, and Faro bottling company were seen working to put out the fire."
  },
  {
    "headline": "Police officer killed, Zamfara emir kidnapped in attack on Kaduna-Abuja highway",
    "summarized_story": "Hassan Atto, Emir of Bungudu in Zamfara, has been abducted, following an attack that occurred on Tuesday on the Kaduna-Abuja highway.\nA police officer was also said to have been killed in the attack, while two other persons sustained injuries.\n“The Kaduna-Abuja road has been safe lately if not for this unfortunate incident.\nSecurity operations are also ongoing in areas affected by banditry across Zamfara — which shares border with Kaduna — leading to shutdown of telecommunications services.\nAdvertisementSpeaking on the shutdown, Isa Pantami, minister of communications and digital economy, had said security agencies requested the shutdown of telecommunications activities in Zamfara."
  },
  {
    "headline": "Police officer killed, Zamfara emir kidnapped in attack on Kaduna-Abuja highway",
    "summarized_story": "Hassan Atto, Emir of Bungudu in Zamfara, has been abducted, following an attack that occurred on Tuesday on the Kaduna-Abuja highway.\nA police officer was also said to have been killed in the attack, while two other persons sustained injuries.\n“The Kaduna-Abuja road has been safe lately if not for this unfortunate incident.\nSecurity operations are also ongoing in areas affected by banditry across Zamfara — which shares border with Kaduna — leading to shutdown of telecommunications services.\nAdvertisementSpeaking on the shutdown, Isa Pantami, minister of communications and digital economy, had said security agencies requested the shutdown of telecommunications activities in Zamfara."
  },
  {
    "headline": "Minister: Panel report on DCP Kyari submitted to Malami for legal advice",
    "summarized_story": "Muhammad Dingyadi, minister of police affairs, says the panel report on Abba Kyari, suspended deputy commissioner of police (DCP), has been submitted to Abubakar Malami, attorney-general of the federation (AGF).\nAdvertisementSpeaking on Tuesday during an interview with Channels Television, Dingyadi said after seeking Malami’s opinion, the report will be submitted to President Muhammadu Buhari for final consideration.\nAdvertisement“And we have also reported that the committee has submitted the report to the IGP, and we have submitted this report and recommendations to the AGF for legal opinion.\nWe have informed the Police Service Commission, and they have directed that the officer be suspended from duty, pending the outcome of the investigation,” he added.\n“By the time we finish this thing, we’ll refer what is needed to be referred to the Police Service Commission for final action."
  },
  {
    "headline": "Minister: Panel report on DCP Kyari submitted to Malami for legal advice",
    "summarized_story": "Muhammad Dingyadi, minister of police affairs, says the panel report on Abba Kyari, suspended deputy commissioner of police (DCP), has been submitted to Abubakar Malami, attorney-general of the federation (AGF).\nAdvertisementSpeaking on Tuesday during an interview with Channels Television, Dingyadi said after seeking Malami’s opinion, the report will be submitted to President Muhammadu Buhari for final consideration.\nAdvertisement“And we have also reported that the committee has submitted the report to the IGP, and we have submitted this report and recommendations to the AGF for legal opinion.\nWe have informed the Police Service Commission, and they have directed that the officer be suspended from duty, pending the outcome of the investigation,” he added.\n“By the time we finish this thing, we’ll refer what is needed to be referred to the Police Service Commission for final action."
  },
  {
    "headline": "Rivers takes FIRS to supreme court over VAT collection",
    "summarized_story": "The Rivers state government has asked the supreme court to set aside an order of the court of appeal which directed the state to maintain status quo on the collection of value-added tax (VAT) pending the determination of an appeal filed by the Federal Inland Revenue Service (FIRS).\nAdvertisementRecently, a federal high court in Port Harcourt issued an order restraining the FIRS from collecting VAT and personal income tax (PIT) in Rivers state.\nAlthough the federal tax authority had appealed for a stay of execution, the court dismissed it on the basis that it would “negate the principle of equity”.\nEmmanuel Ukala, a senior advocate of Nigeria, is the lawyer representing Rivers state.\nLagos state government had asked to join as a party in the appeal after passing the state’s VAT bill into law."
  },
  {
    "headline": "Goldman Sachs-backed Jumo launches its first loan product in Ivory Coast",
    "summarized_story": "South Africa-based Jumo has partnered with MANSA Bank and MTN Mobile Financial Services to provide loans to entrepreneurs and small businesses in Ivory Coast.\nIn Ivory Coast, which is Jumo’s most recent market, the collaboration will see the company introduce its new short-term and small-scale loan product, VitKash, built in partnership with MANSA and offered through MTN’s mobile money platform.\nThe recent expansion was driven by a number of factors, which according to Kone make the West African nation an “attractive market” for Jumo.\n“Ivory Coast has all the characteristics of an attractive market with high growth potential.\n“In the WAMU (West African Monetary Union) zone, there is a strong will from the BCEAO (the central bank of 8 Francophone West African States) to improve financial inclusion and financial literacy,” Kone said."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "Meet the startup transforming informal recycling in Nigeria",
    "summarized_story": "Waste collection methods driven by local authorities remain inadequate, particularly in rural areas.\nIt serves two broad sets of users – waste producers and recycling businesses.\nOn the business side are mobile collectors – typically young, low-income Nigerians – that fulfill on-demand recovery requests from waste producers within an area.\nWaste producers get paid directly in mobile wallets and funds can be redeemed in cash or directly transferred to the individual’s account.\nImage Credit: SuppliedDigitising informal recyclingIn Nigeria, the bulk of recyclable waste collection and processing is carried out by informal waste pickers and processors, with unregistered SMEs dominating the billion-dollar recycling sector."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "In battle for equity, Nigerian states tussle over taxes with FG",
    "summarized_story": "If Lagos state’s 55 percent contribution is factored into local VAT, then it implies the state contributed about N400 billion to the VAT pool last year.\nThe second largest contributor to VAT after Lagos only gets 1 percent of VAT revenue.\n“The current VAT revenue sharing formula among states is not equitable,” says Taiwo Oyedele, fiscal policy partner and Africa tax leader.\n“This is in line with fiscal federalism that we have been talking about,” Mudashiru Obasa, speaker, Lagos State House of Assembly, said.\nTo deliver equity for all states, an economist who spoke with BusinessDay recommends that the taxes are shared based on origination."
  },
  {
    "headline": "In battle for equity, Nigerian states tussle over taxes with FG",
    "summarized_story": "If Lagos state’s 55 percent contribution is factored into local VAT, then it implies the state contributed about N400 billion to the VAT pool last year.\nThe second largest contributor to VAT after Lagos only gets 1 percent of VAT revenue.\n“The current VAT revenue sharing formula among states is not equitable,” says Taiwo Oyedele, fiscal policy partner and Africa tax leader.\n“This is in line with fiscal federalism that we have been talking about,” Mudashiru Obasa, speaker, Lagos State House of Assembly, said.\nTo deliver equity for all states, an economist who spoke with BusinessDay recommends that the taxes are shared based on origination."
  },
  {
    "headline": "Explainer: America, Canada show how fiscal federalism works",
    "summarized_story": "The United States of America and Canada, where taxes are decentralised, are two countries that offer glowing examples of true fiscal federalism.\nEach level of government in both countries adequately finances its operations, a hallmark of the fiscal federalism that Nigeria is striving to achieve.\nThey all levy taxes on resources, revenues or profits generated within their jurisdictions, and property taxes are used to finance much of local government expenditures.\nThe federal government levies many of the same taxes, with the major exceptions of resource and property taxes.\nTheir municipalities (a political subdivision of a state) use property taxes extensively as well as taxes on natural resources."
  },
  {
    "headline": "Obaseki restates support for Made-In-Edo goods, as firm launches new product – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has pledged support to the growth of made-in-Edo goods in a new move to encourage local production.\nObaseki stressed that the growth of the local economy is a cardinal plan of his industrialization drive, which has informed his policy decisions and programmes in the last five years.\nThis product, Joe No Cocoa Tea, is a product of value addition.\nFor those who have made-in-Edo products, be assured that we are ready to support you so that you can make more profits.\nWe want to be able to support businesses in the state."
  },
  {
    "headline": "Academic Activities Grounded In Uniben As Students Protested N20,000 Extra fee charges – Nigerian Observer",
    "summarized_story": "On why the protest, a 400 level student of the university who pleaded anonymity told The NIGERIAN OBSERVER that the displeased students had explored dialogue before embarking on the peaceful protest.\nThe 200 level female student who didn’t want her identity revealed berated the alleged school management’s decision.\nSome students pay their fees by themselves.\nIt’s not even 10k but “20k and if the students have the money, they would have paid their fees before now.\nThe 400 level female student said: “The sudden 20k increment in fees is unjust and just doesn’t make sense…Why are we being punished for our inability to pay fees?"
  },
  {
    "headline": "COVID-19: Edo begins enforcement of restriction for unvaccinated persons with govt offices tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government will tomorrow, Wednesday, September 15, 2021, begin enforcement of restrictions on large public gatherings for persons without evidence of COVID-19 vaccination with government offices across the state.\n“Those that cannot provide their COVID-19 vaccination cards may have to excuse us and be working from home, pending when a decision will be reached.\nThe enforcement teams will commence tomorrow to help us reduce the number of cases and deaths that we are recording daily,” he added.\nIn view of this, we have trained 20 special teams that will be spread across the 18 local government areas of the state.\nWhat we expect our people to do is that, while going to work, they should go with their vaccination cards."
  },
  {
    "headline": "Edo to collaborate with POWA on healthcare, education, others – Nigerian Observer",
    "summarized_story": "Edo to collaborate with POWA on healthcare, education, othersShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has disclosed plans to partner with the Police Officers Wives Association (POWA) in the area of education, healthcare and empowerment, among others.\nAccording to him, “Following the success recorded with the introduction of EdoBEST, the state government introduced EdoBEST 2.0, to address secondary, tertiary and technical education in Edo State.\n“We have also revamped our healthcare sector to bring healthcare closer to the people, making it accessible and affordable for Edo citizens.\nOn her part, the National President of POWA said the team, under her leadership, is focusing on three agenda; including education, healthcare and empowerment.\n“We have done a lot in healthcare, education and empowering our women with skills to advance the course of our women,” she added."
  },
  {
    "headline": "‘Visitors, not residents died in Abuja Estate flood’ – Official",
    "summarized_story": "The Chairman of Trademore Estate, Phase 3 Residents Association, Adewale Adenaike, on Tuesday said none of the residents of the estate died as a result of the recent flooding.\nAltogether, about 166 houses were affected by the flood, which many of the old residents described as the worst in 12 years.\nMr Adenaike told PREMIUM TIMES that all the bodies recovered so far were swept into the estate by the flood.\nJustin Uwazuruonye, Head of National Emergency Management Agency (NEMA), Abuja Operations Office, in an interview with PREMIUM TIMES, said only four persons died in the flood incident.\nAn officer who pleaded anonymity because he was not authorised to speak told PREMIUM TIMES that the station lost quite a number of vital documents."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari seeks national approval to borrow extra $4bn, €710m",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari is seeking the approval of the country’s national assembly to borrow fresh $4,054,476,863 and €710 million in an addendum to the 2018-2020 borrowing plan.\nThe president also asked the national assembly to approve grant components of $125 million.\nThe request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday, Cable reported.\nIn July, the national assembly approved the sums of $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan.\n“The distinguished senate president may recall that u submitted a request on 2018-2020 borrowing plan for the approval of the senate in May 2021."
  },
  {
    "headline": "Osun govt committed to training and retraining of its workforce – Adedeji",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State government under the leadership of governor Adegboyega Oyetola has restated its commitment to training and retraining of its workforce to sharpen their skills and widen their horizon for better performance.\nChairman, Osun State Local Government Service Commission, Elder Tunde Adedeji, stated this while declaring open a four-day Improvement Workshop on Effective Office Management for Clerical officers from grade level 04 to 06 in the Local Government Service.\nElder Adedeji explained that the training programme for the junior officers is important because they are the bedrock of the Local Government Service, hence the need for them to acquire work ethics to make them better leaders in future.\nThe Commission’s Boss commended the state governor, Mr. Oyetola who in his magnanimity in providing the necessary resources for the training programme despite the dwindling resources.\nAlso in his goodwill message, the NULGE President in the State, Dr. Kehinde Ogungbamigbe eulogised the state helmsman Mr. Oyetola for keeping to his promise of building the capacity of the workers in the state."
  },
  {
    "headline": "No inch of Igbo ancestral land will be given for grazing – elders warn SE governors",
    "summarized_story": "Elders in Igboland under the aegis of Igbo Elders Consultative Forum (IECF), have warned governors of the Southeast zone against any attempt to cede land to federal government for grazing by herdsmen.\nThe elders decried what it called delay by some states in the zone to pass their anti-open grazing laws, as resolved by the recent meeting of the Southern Governors’ Forum, vowing that no antics would make the region give out its ancestral land for grazing.\nWhile reaffirming the commitment of the Igbo to one Nigeria, the elders said they would not, however, allow any plot to enslave the Igbo in their own land.\n“Our people have stated clearly that our ancestral land should never be given to anybody and there is no grammar in governance that can make it happen.\nAnybody who wants to waste money should give money to incumbent governors, but when those governors go, nobody will follow the agreement reached."
  },
  {
    "headline": "Nigeria spends N11.679tn on debt servicing in five years – Report",
    "summarized_story": "The sums of N2.254 trillion and N2.951 trillion went into debt service in 2019 and 2020, respectively.\nIn 2018, 2019 and 2020, public debt stood at N24.387 trillion, N27.401 trillion, and N32.915 trillion, respectively.\nThe CSJ chief executive stated that the debt service figures provided the factual background to the presentation of the Medium Term Expenditure Framework (MTEF’s) position on consolidated debt.\nHe said, “The Consolidated Debt Statement affirms the Medium-Term Debt Management Strategy (MTDS) 2020-2023 as the governing policy strategy.\n“Special interventions funds amounts to 3.04 per cent, 2.94 per cent, 2.61 per cent and 2.39 per cent respectively for the years 2021, 2022, 2023 and 2024."
  },
  {
    "headline": "Africa Capitalworks Makes Significant Investment In Dorman Long Engineering",
    "summarized_story": "Capitalworks (ACW), a Sub-Saharan Africa-focused private equity company, has announced a significant equity investment in Dorman Long Engineering Limited (DLE) of Nigeria, an indigenous and market leading company, providing high value engineering services, fabrication, asset management and galvanising services in the oil and gas sector.\nADVERTISEMENTACW’s investment will allow DLE to expand existing yards, acquire additional facilities and expand its service offering.\nCapitalworks’ philosophy is centered on building exceptional businesses through partnering with leading entrepreneurs and management teams.\nDorman Long Engineering Limited, established in Nigeria in 1949, is a leading indigenous oilfields equipment, structural steel, marine structures engineering and fabrication company.\nThe company focuses on oil and gas (onshore and offshore), telecommunications, manufacturing, and power industries in Sub-Saharan Africa."
  },
  {
    "headline": "Africa Capitalworks Makes Significant Investment In Dorman Long Engineering",
    "summarized_story": "Capitalworks (ACW), a Sub-Saharan Africa-focused private equity company, has announced a significant equity investment in Dorman Long Engineering Limited (DLE) of Nigeria, an indigenous and market leading company, providing high value engineering services, fabrication, asset management and galvanising services in the oil and gas sector.\nADVERTISEMENTACW’s investment will allow DLE to expand existing yards, acquire additional facilities and expand its service offering.\nCapitalworks’ philosophy is centered on building exceptional businesses through partnering with leading entrepreneurs and management teams.\nDorman Long Engineering Limited, established in Nigeria in 1949, is a leading indigenous oilfields equipment, structural steel, marine structures engineering and fabrication company.\nThe company focuses on oil and gas (onshore and offshore), telecommunications, manufacturing, and power industries in Sub-Saharan Africa."
  },
  {
    "headline": "BREAKING: Anglican Priest Shot Dead In Imo",
    "summarized_story": "Yet-to-be identified gunmen have gunned down an Anglican priest, Revd Emeka Merenu, in his parsonage at Iheteukwa, Orlu local government area of Imo State.\nA source said the late priest was allegedly killed for bringing in military personnel to secure the church and secondary school under his supervision against the sit-at-home order illegally imposed by IPOB.\nAlready the State Police spokesperson, Michael Abattam, has confirmed the priest’s death, adding that the Commissioner of Police has ordered an investigation into the gruesome murder of the cleric.\nADVERTISEMENTAlso, the Imo State House of Assembly member representing Nkwerre state constituency, Hon Obinna Okwara, has confirmed the development in a telephone conversation with our correspondent.\nThe late priest hailed from Amorji Agbomiri village in Nkwerre local government area of Imo State."
  },
  {
    "headline": "BREAKING: Anglican Priest Shot Dead In Imo",
    "summarized_story": "Yet-to-be identified gunmen have gunned down an Anglican priest, Revd Emeka Merenu, in his parsonage at Iheteukwa, Orlu local government area of Imo State.\nA source said the late priest was allegedly killed for bringing in military personnel to secure the church and secondary school under his supervision against the sit-at-home order illegally imposed by IPOB.\nAlready the State Police spokesperson, Michael Abattam, has confirmed the priest’s death, adding that the Commissioner of Police has ordered an investigation into the gruesome murder of the cleric.\nADVERTISEMENTAlso, the Imo State House of Assembly member representing Nkwerre state constituency, Hon Obinna Okwara, has confirmed the development in a telephone conversation with our correspondent.\nThe late priest hailed from Amorji Agbomiri village in Nkwerre local government area of Imo State."
  },
  {
    "headline": "NDA Attack: Reps Grill Defence Minister, Commandant",
    "summarized_story": "The House of Representatives Committee on Defence, on Tuesday, interrogated the minister of defence, Brig-Gen Bashir Magashi (rtd), and the commandant of the Nigerian Defence Academy (NDA), Maj. Gen. Ibrahim Yusuf, over the August 24 attack on the the military institution by bandits.\nThe legislative committee also urged the military authorities to ensure that the kidnapped officer was rescued from the bandit’s den.\nWhile the NDA commandant, who also appeared before the committee, submitted reports of investigation on the attack.\nBabajimi Benson, noted that his committee was interested in knowing how the abducted officer could be rescued.\nI am delighted to be given this opportunity to be here to shed light on the occurrence and perhaps more importantly the ongoing efforts we are making to recover the abducted officers."
  },
  {
    "headline": "VAT: Rivers govt drags FG to Supreme Court",
    "summarized_story": "Rivers State government, through its Attorney-General, has gone to the Supreme Court to set aside the decision of the Court of Appeal that ordered it to maintain status quo on the collection of Value Added Tax, VAT, pending the determination of an appeal that was lodged by the Federal Inland Revenue Service, FIRS.\nThe State, in its nine grounds of appeal, a copy of which was sighted by Vanguard on Tuesday, is praying the apex court to order that the substantive appeal by the FIRS, marked CA/PH/282/2021, and all other processes therein, be heard and determined by a new panel of the Court of Appeal.\nAside from the FIRS, the Attorney-General of the Federation was cited as Respondents in the appeal that Rivers State entered through its team of lawyers led by Emmanuel Ukala, SAN.\nMore details soon.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "VAT: Rivers govt drags FG to Supreme Court",
    "summarized_story": "Rivers State government, through its Attorney-General, has gone to the Supreme Court to set aside the decision of the Court of Appeal that ordered it to maintain status quo on the collection of Value Added Tax, VAT, pending the determination of an appeal that was lodged by the Federal Inland Revenue Service, FIRS.\nThe State, in its nine grounds of appeal, a copy of which was sighted by Vanguard on Tuesday, is praying the apex court to order that the substantive appeal by the FIRS, marked CA/PH/282/2021, and all other processes therein, be heard and determined by a new panel of the Court of Appeal.\nAside from the FIRS, the Attorney-General of the Federation was cited as Respondents in the appeal that Rivers State entered through its team of lawyers led by Emmanuel Ukala, SAN.\nMore details soon.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Minister: Owners of Private Jets in Nigeria aid gold smuggling",
    "summarized_story": "THE Senate was told Tuesday that owners of private Jets in the country were responsible for the high cases of illegal smuggling of Gold outside the shores of Nigeria.\nDisclosing this yesterday in Abuja at an investigative hearing on $9billion annual loss to illegal mining and smuggling of Gold, organised by Senator Tanko Al- Makura, All Progressives Congress, APC, Nasarawa South led Senate Committee on Solid Minerals, Mines , Steel Development and Metallurgy, Minister of State for Mines and Steel Development, Dr.Uche Ogah, alleged that owners of private Jets were masterminds of illegal mining in Nigeria as they are collaborators.\nOgar who lamented the rate of illegal mining in the country, said that all efforts to end the menace have failed because according to the Nigeria Customs Service, NCS, it has no powers to check private Jets, adding that illegal mining in Nigeria started far back in the early 1980s as a result of the indiginization policy of the military regime in the late 1970s.\nOgah who called for death sentence as punishment for offenders, said, “Gold Smuggling in Nigeria are often done using Private Jets , the very reason Private Jets ownership and operations , need to be streamlined in the country.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Minister: Owners of Private Jets in Nigeria aid gold smuggling",
    "summarized_story": "THE Senate was told Tuesday that owners of private Jets in the country were responsible for the high cases of illegal smuggling of Gold outside the shores of Nigeria.\nDisclosing this yesterday in Abuja at an investigative hearing on $9billion annual loss to illegal mining and smuggling of Gold, organised by Senator Tanko Al- Makura, All Progressives Congress, APC, Nasarawa South led Senate Committee on Solid Minerals, Mines , Steel Development and Metallurgy, Minister of State for Mines and Steel Development, Dr.Uche Ogah, alleged that owners of private Jets were masterminds of illegal mining in Nigeria as they are collaborators.\nOgar who lamented the rate of illegal mining in the country, said that all efforts to end the menace have failed because according to the Nigeria Customs Service, NCS, it has no powers to check private Jets, adding that illegal mining in Nigeria started far back in the early 1980s as a result of the indiginization policy of the military regime in the late 1970s.\nOgah who called for death sentence as punishment for offenders, said, “Gold Smuggling in Nigeria are often done using Private Jets , the very reason Private Jets ownership and operations , need to be streamlined in the country.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Fact Check: What Nigerian judges and other office holders actually earn [Tables]",
    "summarized_story": "Dongban-Mensem said the salaries, minus allowances, of judicial officers have stagnated for over 10 years.\nWhile his basic pay is N280,331.04, he also earns N70, 082 as personal assistant allowance, N140,165 as hardship allowance and N70,082 as dressing allowance.\nThe government picks the provides official accommodation and vehicles for the senior judicial officers and monetises such perks for other officers.\nHis basic salary is N292,892.08, just about N12,000 more than the CJN’s salary.\nThe CJN is only entitled to N50,000 outside of Abuja and the President Court of Appeal, N30,000."
  },
  {
    "headline": "EFCC docks Maiduguri man Irumekhai for criminal breach of trust",
    "summarized_story": "The EFCC has docked a man identified as David Osigbe Irumekhai before Justice Aisha Kumaliya of the Borno State High Court, Maiduguri on one count charge of criminal breach of trust.\nThe defendant was docked by Maiduguri Zonal Command of the EFCC, on Tuesday, after using the original title documents of property kept in his custody for safekeeping to secure a loan of N2, 300, 000.00.\nThe count read: “That you David Osigbe Irumekhai sometime in February, 2021 in Maiduguri, Borno State within the jurisdiction of this Honourable Court being entrusted with original title document in respect of Plot No.\nUpon his plea, prosecution counsel, Mukhtar Ali Ahmed asked the court for a trial date and to remand the defendant in the correctional facility pending the outcome of the case.\nJustice Kumaliya adjourned the matter till September 22, 2021 for commencement of trial and ordered that the defendant be remanded in the Correctional Centre."
  },
  {
    "headline": "BREAKING: Rivers Govt Drags FG to Supreme Court Over VAT Revenue",
    "summarized_story": "Rivers State government, through its Attorney-General, has gone to the Supreme Court to set aside the decision of the Court of Appeal that ordered it to maintain status quo on the collection of Value Added Tax, VAT, pending the determination of an appeal that was lodged by the Federal Inland Revenue Service, FIRS.\nAside from the FIRS, the Attorney-General of the Federation was cited as Respondents in the appeal that Rivers State entered through its team of lawyers led by Emmanuel Ukala, SAN.\nRecall that the Court of Appeal in Abuja, last Friday, ordered the Rivers and Lagos state governments to stay action on their bids to collect Value Added Tax (VAT) pending the resolution of the legal dispute on the matter.\nA three-man panel of the appellate court ordered that the enforcement of the judgment of the Federal High Court, Port Harcourt, latched on to by the state governments be put on hold.\nMore details soon."
  },
  {
    "headline": "BREAKING: Nigerian State Govt Bars Unvaccinated Civil Servants from Work",
    "summarized_story": "The Edo State Government has barred unvaccinated civil servants from their offices.\nIrowa said government had trained 20 special teams that will enforce the policy across the 18 local government of the state.\n“Beginning from September 15, Civil servants and others without COVID-19 vaccination cards will not be allowed into public facilities.\nGovernment House and public places will be manned by the task force.”“Those civil servants without the cards and those who have not vaccinated will have to stay and work from home.\nIrowa disclosed that the state recorded 33 new cases, three deaths including a 28-year-old pregnant woman and 114 recovery."
  },
  {
    "headline": "Family Confirms Death Of Florence Ajimobi’s Mother",
    "summarized_story": "Mrs. Victoria Amudoaghan, mother of the immediate past First Lady of Oyo State, Mrs. Florence Ajimobi, has died, according to her family.\nAjimobi, who served as Governor of Oyo State for eight years, died last year.\nThe deceased was born on April 10, 1943, in Kwale, Ntodokwa West Local Government Area of Delta State, according to the statement.\nMrs. Ajimobi is one of many children and grandchildren left behind by the dead, according to the family.\n“She is survived by children, grandchildren and great grandchildren, among them is Dr (Mrs) Florence Ajimobi, wife of the immediate past governor of Oyo State”."
  },
  {
    "headline": "Security Agents Are Arresting Wrong Suspects In Plateau Killings – Lawmaker Alleges",
    "summarized_story": "Dachung Bagos, a member of the House of Representatives, has accused security agents of arresting the wrong young people during the Plateau crisis.\nSecurity officers are arresting teenagers who are defending themselves against attacks, according to the member who represents Jos North/Jos South federal district.\nHerders are committing genocide against the people and taking their land, according to the politician.\nHe stated that justice is required to put an end to the deaths.\nHe added that “the real issue on the ground is genocide.”Bagos stated that swift application of justice will help to resolve the crisis."
  },
  {
    "headline": "(VIDEO) Sit-at-home: Pandemonium as suspected IPOB members set bus, tricycle ablaze in Anambra",
    "summarized_story": "At least one 18-seater commercial bus and a tricycle were set ablaze in some parts of Anambra state on Tuesday as suspected members of the proscribed Indigenous People of Biafra (IPOB) enforced compliance to their sit-at-home order.\nConfirming attack on a bus, the Police Public Relations Officer (PPRO), Anambra State Police Command, Mr Tochukwu Ikenga, said the force have been mobilised to the affected area to restore normalcy.\n“On 14/09/2021 at about 9:30hrs the command received a distress on call on a case of Arson and malicious damage along Nanka/Oko road.\nPolice operatives are currently on ground now and the situation is being monitored.\nPreliminary investigation reveals that the attackers stopped the tricycle and the commercial bus, chased occupants away and set the vehicle and tricycle on fire."
  },
  {
    "headline": "Open grazing: Abdullahi Adamu slams El-Rufai, Masari, Ortom, advocates free movement of cattle",
    "summarized_story": "A former governor of Nasarawa state and serving federal lawmaker, Senator Abdullahi Adamu, has faulted northern governors planning to ban open grazing in their states.\nAs at the time of this report, Ondo state Governor Rotimi Akeredolu and his Enugu counterpart, Ifeanyi Ugwuanyi had signed the anti-open grazing law, making open grazing an offence in their states.\nEl-Rufai, Masari, Ortom on open grazingAlthough the former governor was not specific on any northern governor, but Kaduna state Governor Nasir El-Rufai and his Katsina counterpart, had at different times faulted the open grazing by cattle herders.\nAlso, Benue state Governor David Ortom has signed into law the ban on open grazing amidst criticisms from certain quarters.\nSpeaking earlier in the year during a visit to Yola, Adamawa state, Governor El-Rufai had said:“I am a Fulani man."
  },
  {
    "headline": "Kogi jailbreak: We ‘re mobilising Interpol to track 256 escaped inmates – FG",
    "summarized_story": "Armed men have attacked a prison facility in Kabba, Kogi state, killing two officials and freeing many inmates, the federal government has confirmed.\nFasure also said security officers on duty, comprising 15 soldiers, 10 Police officers and 10 armed guards of the Nigeria Correctional Service “fought gallantly to repel the attack.\n“During the attack, security officers on duty which comprised of 15 Soldiers, 10 Police Officers and 10 armed guards of the NCoS on duty fought gallantly to repel the attack.\n“The Controller General of the Nigeria Correctional Service, Haliru Nababa, is currently monitoring the situation.\n“The Nigeria Correctional Service shall not be cowed by elements seeking to compromise the security of our nation; we shall deal with this situation with absolute resolve."
  },
  {
    "headline": "CCCN celebrates 2021 Mid-Autumn festival virtually -NigPilot",
    "summarized_story": "The China Cultural Center in Nigeria (CCCN) has unveiled series of online programs to celebrate the festival, beginning from 14 to 28 of September 2021.\nExplaining that the Mid-autumn festival is an annual Chinese traditional festival, Mr Wang disclosed that Sept 21 will witness the arrival of the 2021 Mid-autumn festival.\nAccording to the statement, “Nowadays the Mid-Autumn Festival celebration has already become very popular worldwide.\nThe Festival is the second most important festival in China just after the Chinese Spring Festival .\n“The highlight of this Mid-Autumn Festival celebration lies in Heilongjiang part."
  },
  {
    "headline": "e-commerce spending in Nigeria stood at $13bn -FG -NigPilot",
    "summarized_story": "Federal Government has disclosed that the current e-commerce spending in Nigeria is estimated at $13billion yearly.\nwho stated this in Abuja at the Second National E-commerce Roundtable Session in Nigeria, said e-commerce is projected to rise to about $75billion in revenue per annum by 2025.\nShe, therefore, said her ministry was passionate about the growing Investment opportunities in the e-commerce value chain, which are capable of contributing significantly to the country’s Gross Domestic Product(GDP).\nIn view of the cross-cutting nature of e-commerce, Ngige said her ministry was open to collaborate with any organisation that would support the development of the e–commerce ecosystem in Nigeria.\nHe lamented that in spite of the growing opportunities in the e-commerce, Nigeria has not been able to explore it’s enormous potential."
  },
  {
    "headline": "3.7m jobs in offing as FG launches youth employment plan -NigPilot",
    "summarized_story": "The employment market for Nigerian youths is about to receive a boost as the federal government is set to create 3.7 million jobs annually through joint efforts with the private sector in several priority areas with high job creation potentials.\nMinister of Youths and Sports Development, Mr. Sunday Dare, stated this Tuesday in Abuja at the official launch of the Nigerian Youth Employment Action Plan, NIYEAP, 2021-2024.\nNIYEAP, which was developed with technical assistance from the International Labour Organization, ILO, and support from ECOWAS and the Spanish Development Agency, is to promote decent jobs for youths.\nIt is also expected to contribute to the achievement of the job creation target of the National Youth Policy(2019) to create 3.7 million jobs annually.\nThe NIYEAP, which identifies strategic lines of action the “four Es”: Employability, Entrepreneurship, Employment, and Equality and Rights, is expected to contribute to address the challenge of youth employment through effective implementation."
  },
  {
    "headline": "Ministry organize validation workshop to end Gender Based Violence -NigPilot",
    "summarized_story": "Ministry of Women Affairs has organised a Validation Workshop on National Communication Strategy on ending all forms of violence and harmful practice against women and girls in Nigeria.\n“Permit me to say that preventing and responding to Violence against Women and Girls is a cornerstone of the Government’s commitment to advancing women’s fundamental human rights.\nAlso promoting gender equality and the empowerment of women and girls serves and catalyst to addressing problem of gender inequality patriarchy and gender stereo-typing,” Tallen said.\n“Violence against women and girls gender inequality patriarchy and harmful cultural practices significantly inhibits women’s potentials to fully contribute their quota and participate in rational development.\n“Furthermore, the effects of gender based violence and women and girls affect the entire communities’ women and girls, men and boys differently."
  },
  {
    "headline": "VAT Dispute: Rivers Govt Files Appeal At Supreme Court",
    "summarized_story": "The Rivers State government has approached the Supreme Court to challenge the ruling of the Court of Appeal in the Value Added Tax (VAT) dispute between the state and the Federal Inland Revenue Service (FIRS).\nThe Attorney-General of Rivers State is the appellant while the FIRS and Attorney-General of the Federation (AGF) are joined as respondents.\nFollowing the judgement delivered by Justice Stephen Pam of the Federal High Court, Rivers State Governor, Nyesom Wike, assented to the Valued Added Tax Law, 2021.\nThe bill had been passed by lawmakers in the Rivers State House of Assembly, along with four others that were also assented to by the governor.\nJustice Pam, therefore, stated that the state law on VAT was valid and subsisting, paving the way for Governor Wike to direct the state’s revenue agency to fully implement the VAT law."
  },
  {
    "headline": "President Buhari Writes Senate, Requests Fresh Loan Of $4bn And €710m",
    "summarized_story": "President Muhammadu Buhari has written to the National Assembly, seeking approval to borrow the sum of $4,054,476,863 billion and €710 million.\nThe request was made known in a letter read by Senate President Ahmad Lawan at plenary on Tuesday.\nIn the letter titled Addendum to Request For Senate’s Concurrent Approval Of Multilateral Fund Projects Under the 2018-2021 Federal Government External Borrowing (Rolling) Plan, President Buhari explained that owing to “emerging needs”, there is a need to raise more funds for some “critical projects”.\nA copy of the letter signed by President BuhariThis is not the first time President Buhari is writing to the National Assembly to request approval for external loans this year.\nIn May, he requested the sum of N2.343 trillion which according to him, was meant to part-finance the budget deficit of N5.602 trillion in the 2021 budget."
  },
  {
    "headline": "Soldier, Bandit Killed As Gunmen Abduct Woman, Children In Zaria",
    "summarized_story": "A soldier has been reported killed and four persons abducted by bandits who attacked Milgoma, a community near the Ahmadu Bello University Teaching Hospital in Zaria, Kaduna State.\nThose kidnapped by the gunmen included a woman, her daughter, and two sons.\nREAD ALSO: 12 Killed As Gunmen Attack Kaduna CommunityAccording to Sani, soldiers attached to the area responded to a distress call from the residents and swiftly moved to the scene.\nHe said the gunmen later moved to another location within the community where they took away the woman and her three children.\nThe attack on Milgoma took place a day after gunmen killed 12 locals in Peigyim village in Zangon Kataf Local Government Area of the state."
  },
  {
    "headline": "UNIBEN Students Block Highway, Protest Increased Late Registration Fee",
    "summarized_story": "Students of the University of Benin (UNIBEN) have rejected the N20,000 increase in the late registration fee recently imposed by the school’s management.\nThey took to the Benin-Lagos expressway in protest on Tuesday, causing gridlock on the ever-busy federal road.\nDuring an interview with Channels Television, while the demonstration was ongoing, some of the students described the increment as impromptu and asked the Vice-Chancellor, Professor Lilian Salami, to consider their plight.\nAnother student told Channels Television that they were aggrieved that the additional sum to their fees came barely two weeks when the portal was opened.\nEfforts made by Channels Television to contact Professor Salami proved abortive as she was unavailable as of the time of filing this report."
  },
  {
    "headline": "Lewandowski Nets Brace As Bayern Outplay Barcelona Again",
    "summarized_story": "Mueller has scored seven goals in six appearances now against the Catalans while Lewandowski has scored in 18 consecutive matches.\nThe early enthusiasm could only sustain Barcelona so long and as the game settled, gradually Bayern took control.\nLeroy Sane volleyed at Marc-Andre ter Stegen.\nA renewed push after half-time saw Sergio Busquets drive wide but Bayern came again.\nYet Bayern spared Barca a humiliation, waltzing through for one more late on as Lewandowski danced through a sprawl of bodies and fired with five minutes left."
  },
  {
    "headline": "1 Solder killed as bandits abduct 4 Persons In Zaria",
    "summarized_story": "A soldier has been killed and four other persons including three children abducted by bandits in Milgoma community near the Ahmadu Bello University Teaching Hospital in Zaria, that’s in Kaduna State.\nSources around the area say armed bandits in large number launched at attack on the community at about 9pm and went to the house of a lecturer working with Kaduna State University, to abduct victims.\nThose whisked away include a woman, and three of her children.\nThe bandits on sighting the security operatives, engaged them in a fierce gun duel which led to the death of one of the brave soldiers.\nMeanwhile the body of one of the bandits who died from bullet wounds was later discovered by soldiers."
  },
  {
    "headline": "Kabba Prison: NCoS recaptures 114 fleeing inmates",
    "summarized_story": "114 inmates who fled the Medium Security Custodial Centre Kabba Kogi State in the wake of the attack by gunmen have been recaptured.\nIn a statement by the spokesman for the Correctional Service, the task forces set up by the Controller General of Corrections, Haliru Nababa Is on the trail of the fleeing inmates.\nThe statement added that efforts are on to recapture more of the 240 escapees.\nHe advised the escapees to turn themselves in within the next 24 hours or risk prosecution if arrested."
  },
  {
    "headline": "Zamfara First Class Chief, Emir of Bungudu, Abducted In Kaduna -",
    "summarized_story": "The Emir of Bungudu in Zamfara state Hassan Attahiru has been kidnappedThe first class chief was abducted while traveling along Kaduna – Abuja highway Tuesday’s eveningA police personnel was said to have been killed during exchange of fire with the banditsTVC NEWS Gathered that only the emir was abducted in the convoy while some of his guards sustained injuries during the incidentHis Royal Highness Hassan Attahiru is the Paramount ruler of Bungudu emirate in Zamfara state"
  },
  {
    "headline": "VP Osinbajo charges bankers to finance transformative projects -",
    "summarized_story": "In their separate remarks, Presidents Buhari and Kagame commended leaders in Nigeria’s banking and finance sector for their contributions to the development of Africa’s economy.\nSuch matters include consumer finance but housing finance in particular.”He noted that a focus on how to finance housing is critical.\n“The evidence also suggests that there is a symbiotic relationship between housing finance and financial sector development.\nHousing finance helps to develop the financial sector itself and helps to contribute to economic growth.\nHow do we pay for moving from where we are especially fossil fuel-based power sources to renewable energy?"
  },
  {
    "headline": "Foundation Sponsors Open Heart Surgeries in Lagos",
    "summarized_story": "For more than a decade, First Cardiology Consultants Hospital in Lagos has been providing comprehensive cardiovascular care to patients in Nigeria.\nBut cardiovascular care, especially open heart surgery, isn’t affordable to a majority of people in the country.\nSo the group is now on a mission to deliver inclusive and accessible care to patients in need through their new foundation – The Healthy Heart Foundation.\nOn Monday, September 13, a team of local and international surgeons performed the very first open heart surgery to be sponsored by the foundation and its partners.\n(Warning: some content may be graphic and viewers discretion is advised)"
  },
  {
    "headline": "Six Nigerians Among 38 Names on UAE’s List of Terrorism Financiers",
    "summarized_story": "Six Nigerians have been named by the United Arab Emirates as financiers of terrorism including Boko Haram and other criminal activities.\nThe six Nigerians on the list are Abdurrahaman Ado Musa, Salihu Yusuf Adamu, Bashir Ali Yusuf, Muhammed Ibrahim Isa, Ibrahim Ali Alhassan and Surajo Abubakar Muhammad.\nThe 38 names on the list are mostly Arabs from the Middle East.\nThe North West has also have it’s fair share of terrorism with many students kidnapped from schools for ransom and many of the highways in the region infested by kidnappers bearing arms.\nThe government against the backlash of many have not declared the criminals in the North West, choosing to describe them bandits."
  },
  {
    "headline": "Alibaba Leads Investment Worth Over $300m in Chinese Autonomous Startup DeepRoute.ai",
    "summarized_story": "Alibaba Group Holding Limited has led investments worth more than $300 million into Chinese autonomous driving start-up called DeepRoute.aiDeepRoute.ai makes self-driving systems for vehicles that involve hardware and software.\nAlibaba is already an investor in another Chinese autonomous driving car start-up called AutoX and is backing electric vehicle maker Xpeng.\nOr it can also sell its autonomous driving system to automakers in return for a one-time fee as well as an annual service fee.\nIn the logistics space, DeepRoute.ai could run an autonomous driving fleet for a company or again, sell its driverless technology.\nChina’s autonomous driving industry is getting very competitive."
  },
  {
    "headline": "South Korea’s Antitrust Regulator To Fine Google $177m Over Improper Mobile Market Dominance",
    "summarized_story": "South Korea’s competition regulator has vowed to fine Google the U.S. tech giant, $176.9 million (207.4b Korean won) for allegedly using its dominant market position in the mobile operating system space to stifle competition.\nThe announcement which was made on Tuesday by the antitrust regulator or Korea Fair Trade Commission, allegedly stated that Google used its market position to block smartphone makers like Samsung from using operating systems developed by rivals.\nGoogle’s Android operating system which currently holds the lion’s share of the smartphone market, ahead of Apple’s iOS platform, was also allegedly practice stifled innovation in the development of new operating systems for smartphones, according to Yonhap News.\nThat agreement prevented device makers from installing modified versions of the Android operating system, known as “Android forks,” on their handsets, Yonhap reported.\nA Google spokesperson argued that Android’s compatibility program has spurred hardware and software innovation, and brought success to Korean phone makers and developers."
  },
  {
    "headline": "Rwandan Businessman Shot Dead in Mozambique",
    "summarized_story": "Revocant Karemangingo, a Rwandan businessman has been shot dead in Matola municipality, a few kilometres outside the Mozambican capital, Maputo.\nMr Karemangingo was shot about 50m from his residence in the Liberdade neighbourhood on Monday afternoon.\nThe killers are so far not known, much less the reasons for the crime that shocked the neighbourhood and the Rwandan community in Mozambique.\nThe Rwandan community has asked the Mozambican government to provide more protection.\nIn 2019, another Rwandan, Louis Baziga, was shot dead in a similar style in a Maputo suburb after gunmen intercepted his car."
  }
]