[
  {
    "headline": "‘people in mentally stimulating jobs have lower risk of dementia’",
    "summarized_story": "Amarachi OkehA new study has indicated that the risk of developing dementia at old age is lower in people who work more cognitively stimulating jobs than those in non-cognitively stimulating jobs.\nAccording to medicalnewstoday.com, “To determine whether a participant’s job was cognitively stimulating, the researchers looked at the occupation’s levels of demand and control.\n“The researchers deemed jobs that were psychologically demanding and offered the worker significant control to be cognitively stimulating.\n“In contrast, they classified ‘passive’ jobs that had low demand and offered no control as not cognitively stimulating.\n“However, the team characterised cognitively demanding jobs that gave the individual no control as stressful work or job strain, which is a possible risk factor for dementia."
  },
  {
    "headline": "‘people in mentally stimulating jobs have lower risk of dementia’",
    "summarized_story": "Amarachi OkehA new study has indicated that the risk of developing dementia at old age is lower in people who work more cognitively stimulating jobs than those in non-cognitively stimulating jobs.\nAccording to medicalnewstoday.com, “To determine whether a participant’s job was cognitively stimulating, the researchers looked at the occupation’s levels of demand and control.\n“The researchers deemed jobs that were psychologically demanding and offered the worker significant control to be cognitively stimulating.\n“In contrast, they classified ‘passive’ jobs that had low demand and offered no control as not cognitively stimulating.\n“However, the team characterised cognitively demanding jobs that gave the individual no control as stressful work or job strain, which is a possible risk factor for dementia."
  },
  {
    "headline": "India vaccinates over 10 million in one day",
    "summarized_story": "India has given more than 10 million COVID-19 vaccines in a single day for the first time, authorities said on Saturday, as the South Asian giant bolsters its defences for a predicted new surge.\nThe health ministry said the 10 million landmark was passed on Friday, beating the country’s previous daily record of 9.2 million.\nThe government has been stung by criticism after a brutal coronavirus wave in April and May killed more than 200,000 people.\nIndia’s daily infection count has dropped dramatically since the devastating surge in April-May which overwhelmed its creaking health infrastructure.\nDaily case numbers have started rising again above 40,000 and more than 500 deaths were reported on Saturday."
  },
  {
    "headline": "India vaccinates over 10 million in one day",
    "summarized_story": "India has given more than 10 million COVID-19 vaccines in a single day for the first time, authorities said on Saturday, as the South Asian giant bolsters its defences for a predicted new surge.\nThe health ministry said the 10 million landmark was passed on Friday, beating the country’s previous daily record of 9.2 million.\nThe government has been stung by criticism after a brutal coronavirus wave in April and May killed more than 200,000 people.\nIndia’s daily infection count has dropped dramatically since the devastating surge in April-May which overwhelmed its creaking health infrastructure.\nDaily case numbers have started rising again above 40,000 and more than 500 deaths were reported on Saturday."
  },
  {
    "headline": "Petroleum marketers call off strike in Imo",
    "summarized_story": "By Chinonso Alozie, OwerriThe Imo State Chapter of the Independent Petroleum Marketers Association, on Friday, called off its four days strike.\nIt should be recalled, the Petroleum Marketers had embarked on strike last Wednesday after they had obtained a court judgement against the state government to pay compensation to one of their members whose filling station was demolished by Former Governor of Imo State, Rochas Okorocha in the State.\nBut ending the strike, the oil Marketers said: “It is no longer news that the Association of the Imo Petroleum Marketers and Dealers embarked on industrial action since Wednesday 25th August 2021.\nHowever, it is imperative to consider the greater interest and sufferings of the people of Imo State in general occasioned by the industrial action.\nRelying on the above promise the government and the intervention of the DSS, Imo Petroleum Marketers and Dealers have suspended the industrial action forthwith.”“We are grateful to petroleum marketers, the Press for their effective reportage, members of Civil Society Organisation, the religious groups who have their efforts in reaching out and the general public for its understanding."
  },
  {
    "headline": "DELTA @ 30: Amuka, Clark, Ovia, Elumelu, Okonjo-Iweala, others bag lifetime achievement awards",
    "summarized_story": "Other awardees were Professor Joy Ogwu, Pastor Ayo Oritsejafor, Atunyota Akpobome (a.k.a Alibaba), Michael Collins Ajereh (Don Jazzy), Ese Brume and Timipamere Akiayefa.\nWhile Chief Mukoro Mowoe, Chief James Otobo and Chief Dennis Osadebay were honoured posthumously.\nThe Vanguard Newspaper Publisher, Mr Sam Amuka bagged the Lifetime Achievement Award as a Media guru.\nMr Tony Elumelu, Mr Jim Ovia and Chief Edwin Clark were among those in the Lifetime Achievement Award category.\nSome others were honoured in the category of Academia and Sports, while some others were for recognition."
  },
  {
    "headline": "El-Rufai victim of his own standards — Gerald Ilukwe, Kaduna Chief Information Officer",
    "summarized_story": "READ ALSO:El-Rufai victim of his own standards — Gerald Ilukwe, Kaduna Chief Information OfficerSo what influenced you?\nBriefly, for the common man…Frank Olisa’s common man ….what’s the ICT policy of Kaduna State ….so they can key in?\nWe have the ‘Digital Strategy For The Government and The People of Kaduna State’.\nNow, the Airtel limited and Kaduna State MoU on broadband connectivity, what exactly is that MoU all about?\nWhere do you see Kaduna State ICT wise in the next five year?"
  },
  {
    "headline": "Police battle suspected ESN members in Imo",
    "summarized_story": "Cop, gang leader, others killedBy Emmanuel Iheaka, OwerriThe police in Imo State have invaded a suspected camp of Eastern Security Network (ESN) in Akata, Oru East Local Government Area of the state.\nAbattam stated that the ESN members, upon sighting the tactical teams of the police, launched an attack before they were overwhelmed, resulting in the killing of their leader and others.\nAbattam added that many of the ESN members were killed during the second attack.\nAgain, the tactical team successfully dislodged the bandits where several of them were neutralized and others fled into the bush with bullets injuries.\n“Meanwhile, the tactical teams are presently, combing the bush for possible recovery of more arms and Improvised Explosives Devices."
  },
  {
    "headline": "El-Rufai victim of his own standards — Gerald Ilukwe, Kaduna Chief Information Officer",
    "summarized_story": "•Why I fell for his job•What makes him different•He’s data-driven and runs data driven govtMr. Gerald Ilukwe, is the Special Adviser to Governor Nasir Ahmad El-Rufai on Information and Communication Technology (ICT) and the Chief Information Officer (CIO) of Kaduna State.\nBriefly, for the common man…Frank Olisa’s common man ….what’s the ICT policy of Kaduna State ….so they can key in?\nWe have the ‘Digital Strategy For The Government and The People of Kaduna State’.\nNow, the Airtel limited and Kaduna State MoU on broadband connectivity, what exactly is that MoU all about?\nWhere do you see Kaduna State ICT wise in the next five year?"
  },
  {
    "headline": "Change MINILS to Imoudu varsity of labour studies – Gov Abdulrazaq tells govt",
    "summarized_story": "Governor Abdulrahman Abdulrazaq of Kwara State, has called for the change of Michael Imoudu National Institute for Labour Studies to Michael Imoudu University of Labour Studies.\nHe made the call when the Minister of state for Labour and Employment, Festus Keyamo, SAN, visited him at the Government House in Ilorin.\nGovernor Abdulrazaq told Keyamo who was accompanied on the visit by veteran labour leaders, Hassan Summonu, Ovie Kokori and the D-G of the Imoudu labour Institute, Comrade Isah Aremu, that, the institute has the infrastructure to cope as a university.\n” Most of the new universities we have today, don’t have the infrastructure in that institute.\nKeyamo had earlier described Governor Abdulrazaq as most labour friendly leader in the country in terms of labour relations."
  },
  {
    "headline": "Masari advocates national sensitization on Nigeria’s unity",
    "summarized_story": "Katsina State Governor, Aminu Bello Masari, has said that one of the major issues threatening Nigeria’s unity is not far-fetched from the fact that many citizens do not see or treat the country as one body.\nWhen it affects an Ibibio man, a Kanuri man will say it is happening to an Ibibio man.\nOn PCG’s quest for Vice President Osibanjo to succeed President Buhari, the Katsina Governor likened the scenario to putting the cart before the horse.\nHe urged the APC party stalwarts to go back to their locality and ensure that they have credibble people that would do the right thing for the country at the hems of affairs.\n“At an an appropriate time, I will reply you,” Governor Masari said."
  },
  {
    "headline": "Three United States men charged for illegally exporting arms, ammunition to Nigeria",
    "summarized_story": "Three U.S men from Maryland have been arrested for allegedly exporting arms and ammunition to Nigeria without licenses.\nThe trio, Wilson Nuyila Tita, 45; Eric Fru Nji, 40 and Wilson Che Fonguh, 39 were charged for violating Arms Export Control Act and the Export Reform Control Act, relating to the export of firearms and ammunition from the United States to Nigeria late Thursday.\nAccording to the United States Department of Justice, seven defendants have been charged in related cases while six of them have pleaded guilty and are awaiting sentencing.\nThe defendants further allegedly communicated about their efforts and plans using an online encrypted messaging application and code words in order to conceal their activities.\nEach of the defendants if convicted face 30 years imprisonment for conspiracy, violating the Arms Export Control Act, violating the Export Control Reform Act and for transportation of a firearm with an obliterated serial number."
  },
  {
    "headline": "Insecurity: APC lawmaker, Gagdi writes Buhari, blasts president’s style of leadership",
    "summarized_story": "Member of the House of Representatives from Plateau State in the All Progressives Congress (APC), Yusuf Gagdi, has called out President Muhammadu Buhari for the worsening security situation in Nigeria.\nThe Representative from Plateau State in the All Progressives Congress (APC) noted that the recent upsurge in insecurity in the country resulted from the inability of the Buhari regime to deal decisively with factors indicative of rising animosity in the country, mutual suspicion and religious frontlines.\nHe observed that the issue of insecurity has reached a point where the current strategies being adopted by the President’s administration have failed and are in no way adequate to guarantee safety.\nHe added that they can no longer hold water in a cup let alone in a basket.\nHe lamented the recent shameful raid on the highly fortified Nigeria Defence Academy, Kaduna, noting that the metropolitan attacks in Jos, Plateau State among others, have heightened fears of insecurity in Nigeria."
  },
  {
    "headline": "Abuja – Kaduna – Kano highway will be ready in 2023 — Official",
    "summarized_story": "Engr Yahaya Baba Ali, Federal Controller of Works, Kano field headquarters during the weekend assured that barring any last minute change, the hybrid Abuja-Kaduna-Kano federal highway would be delivered on schedule.\nThe federal Controller told reporters in Kano that activities at various sections of the strategic road are on smooth ride, adding that the 2023 delivery date is feasible.\nEngr Ali stated that, the hybrid road project includes upgrade and reconstruction of over 100 bridges, and box culvert within the stretch of Kano- Zaria section of the highway.\nHe disclosed that the hybrid highway that runs from the Federal Capital Territory through Kaduna State that terminates at the commercial city of Kano was among the list of 25 ongoing road projects in Kano and environs.\nThe federal Controller listed Kano – Katsina (phase 1) which terminates at Gidan Mutum Daya to have recorded 78 percent completion, while Kano – Shuwarin with a stretch of 202km, (sec 1) Kano- Maiduguri, divided into 5 sections, recorded 55 percent completion."
  },
  {
    "headline": "BBNaija: I can’t trade any housemate for my Boyfriend – Maria",
    "summarized_story": "Big Brother Shine Ya Eye housemate, Maria has revealed that she is not ready to trade her boyfriend for any guy in the house.\nShe also revealed that it is the reason she has been trying to maintain a mutual relationship with all the guys in the house.\nAccording to her, she wouldn’t want to hurt the guy she’s dating outside the house by dating any guy in the house.\n“I have a serious relationship outside the house and this is why I have been hopping from one guy to another in this house.\nHe also revealed that he is finding it difficult to move on even after she has made it known that she has a relationship outside the house."
  },
  {
    "headline": "Ronaldo breaks silence after returning to Man Utd",
    "summarized_story": "Cristiano Ronaldo has penned an emotional farewell letter to Juventus fans after he left the club to return to Manchester United on Friday.\nThe 36-year-old hailed the Bianconeri as “the biggest club in Italy” and one of the biggest in Europe.\nRonaldo however admitted that they did not achieve all they wanted at Juve, although they had good memories together.\n“Today I depart from an amazing club, the biggest in Italy and surely one of the biggest in all of Europe.\n“I gave my heart and soul for Juventus and I’ll always love the city of Turin until my final days."
  },
  {
    "headline": "BBNaija: Why I can’t move on from Maria – Pere",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Pere has admitted it is difficult to move on without Maria.\nSpeaking with Michael about Maria, Pere admitted that she gives him mixed signals which is frustrating.\nHe mentioned that he is unable to move on from Maria because he is not emotionally drawn to any female housemate apart from Maria.\nPere said: “Maria gives me mixed signals and I cannot move on from her because I don’t have many options here.\n“Remove sexual attractions, aside from Maria, I don’t think I’m emotionally drawn to any female housemate here."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Michael sees Angel like a ‘prostitute – Maria",
    "summarized_story": "Big Brother Shine Ya Eye housemate, Maria has said Michael sees Angel like a ‘prostitute.\n“Jackie told me how she felt about Angel being close to Michael.\n“She is creating enemies for her self in the house and Michael doesn’t even like her like that.\nDuring one of my diary session I told Biggie about Angels attitude and he shot me up,” she said.\nWhen asked for her opinion on Angel’s relationship with the male housemates in the house, Maria during her diary session berated Angel, describing her as not being trustworthy and disrespecting in the house."
  },
  {
    "headline": "I bleach to attract men – Ghanaian commercial sex worker, Farcadi",
    "summarized_story": "Popular Ghanaian commercial sex worker, Queen Farcadi, who proudly bears the tag of a prostitute or a pimp in Ghana has revealed how bleaching attracts men to her.\nSpeaking on the 77 Per cent show titled “how can we decolonize beauty standards?” Queen Farcadi noted that she bleached to attract more men.\nSpeaking about the impact after changing her complexion, Farcadi added that “after the skin lightening, I turned into Farcadi, before the skin lightening I was Enyonam.\n“I know that you are witch,” Delay told Farcadi.\nHowever, Queen Farcadi, who is a mother of one, denied possessing any witchcraft spirit but admitted that she consults spiritualists for her protection and added that she also attends church once a while."
  },
  {
    "headline": "Abducted Niger school kids recount ordeals",
    "summarized_story": "The children said they were made to trek for three days without water or food while being escorted to the kidnappers’ den.\nThey also said they slept under trees in the bush for almost one month before some shelter was improvised for them.\nSaid he: “They kept the girls separate from us when it was time to sleep but we always ate together.\nBut while briefing newsmen in Minna on Friday when he received the children, the governor said only 92 were abducted.\n“This has affected the morale and confidence of people from sending their children to school."
  },
  {
    "headline": "Again, bandit storms Zaria, kidnap 6",
    "summarized_story": "From Noah Ebije, KadunaBandits in the early hours of Friday stormed Zangon Shanu village, near the main campus of Ahmadu Bello University (ABU) Zaria, Kaduna State and kidnapped six persons.\nZangon Shanu is a settlement mostly inhabited by ABU lecturers, staff of Nigerian College of Aviation Technology and Ahmadu Bello University Teaching Hospitsl, Zaria.\nThe attack comes barely a month bandits attacked National Tuberculosis and Leprosy Training Centre and Nuhu Bamalli Polytechnic, Zaria and abducted scores of people.\nHe said the bandit shot sporadically into the air to scare residents after which they went away with their victims.\nIt was observed that security has been beefed up by the Authorities of Nigeria College of Aviation Technology (NCAT), Nigerian Institute of Transport Technology (NITT) and Ahmadu Bello University, and in neighbourhoods of the village."
  },
  {
    "headline": "PDP bars Secondus from caucus meeting",
    "summarized_story": "From Ndubuisi Orji, AbujaEmbattled National Chairman of the Peoples Democratic Party (PDP), Uche Secondus, was barred from participating in the party’s national caucus meeting, at the national secretariat, in Abuja, yesterday.\nThe PDP acting national chairman, Yemi Akinwonmi, who arrived the secretariat minutes later, met with Secondus in the latter’s office.\nOther party leaders also went to Secondus’ office to confer with him.\nThe information did not go down well with some of the party leaders, who objected vehemently.\nHe said the caucus would submit a proposal by the PDP National Working Committee (NWC) for the party’s convention to hold on October 30-31 to the National Executive Committee (NEC)."
  },
  {
    "headline": "Some men want me as second wife –Eberechukwu Nwizu, actress",
    "summarized_story": "Female filmmakers in Nigeria are expressing their God given talents and skills at the highest level and creating their own niche.\nJust like my birth name, Eberechukwu, which means God’s mercy and favour, I sound like a super hero.\nHave you ever been proposed to by a married man to be a second wife?\nYes, several times I have been asked to be a second wife, but I thought it was really funny to be one.\nHow do you handle men that want to have an affair with you just because they see you on screen?"
  },
  {
    "headline": "Fresh fear in South East over RUGA plot",
    "summarized_story": "“Imo State cannot afford to stand against the decision of Southern Governors’ Forum that was applauded by the masses,” he added.\nLaw No.9 of 2006 of Imo State, it was entitled “Prohibition of Grazing of Cattle.”Among other things, it read: “3.\n“Restricted Areas” means Areas within Imo State that are cultivated, residential and commercial.\nA cattle rearer shall not take his cattle into cultivated farms within Imo State.\nOn the enactment of anti-open grazing law, ADF said that Gov."
  },
  {
    "headline": "Secondus Complies With New Court Order, Asks Akinwonmi to Preside over PDP’s NEC Meeting",
    "summarized_story": "By Chuks OkochaIn compliance with the second court order that restrained him from presiding over the National Executive Committee (NEC) meeting, National Chairman of the Peoples Democratic Party, Prince Uche Secondus, has asked his deputy(South), Elder Yemi Akinwonmi, to preside over the NEC meeting.\n￼The injunction granted by a Cross River High Court also barred the PDP from allowing Secondus to function as national chairman or preside over the NEC meeting of the party.\nSecondus had obtained a Kebbi High Court order to reinstate him as national chairman last Thursday following an earlier injunction obtained against him from a Rivers State High Court.\nHe was also specifically barred from the NEC meeting holding on Saturday.\nThe NEC meeting is expected to end the Secondus era with the affirmation of plans for the National Convention now agreed to hold in October."
  },
  {
    "headline": "Obasanjo: It’ll Cost Nigeria More to Break up Than to Remain One",
    "summarized_story": "The former president’s declaration is coming amid secession agitations, fueled by perceived injustice and worsening security situation, across the country.\nBut Obasanjo, who was the convener of the programme in honour of Mbang, assured the respected Christian leader that the enemies of Nigeria would not win.\nAnd to assure him that whatever happens, we will continue to work for unity, peace, security and progress of this country.\nWe want to assure you that Nigeria will continue to exist because the cost for Nigeria not to continue to exist is much more than the cost for us to make Nigeria to continue to exist.\nThe former President eulogised Mbang for his steadfastness, which had kept their relationship intact over the years, and described the former President of the Christian Association of Nigeria as a lover of Nigeria."
  },
  {
    "headline": "FG Orders Stoppage of Striking Doctors’ Salaries",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe federal government has commenced the implementation of the no work, no pay rule on striking doctors with effect from Monday August 2, 2021.\nResident doctors under the auspices of the National Association of Resident Doctors (NARD) had vowed to sustain the ongoing nationwide industrial action until their demands were met by the federal and state governments.\nThe doctors, who are protesting the alleged non-implementation of the Memorandum of Agreement it reached with government in December 2020, said that the federal government and some states owed their members salary arrears ranging from seven to 19 months.\nThe striking doctors had earlier refused to sign a Memorandum of Understanding brokered by the Minister of Labour and Employment, Chris Ngige and the President of Nigerian Medical Association (NMA), Prof. Innocent Ujah, which gave specific timelines for addressing the doctors’ demands.\n“Consequent on the above, I am directed to inform you to commence the implementation of the no work, no pay, policy on the striking doctors, with effect from Monday August 2, including other health workers that may embark on strike subsequently."
  },
  {
    "headline": "Convoke National Dialogue Now to Save Nigeria, Okowa Tells FG",
    "summarized_story": "Okowa said, “The rich and the elite will not live peacefully in a country where there are many poor people.\n“I thank our past leaders for laying a solid foundation for the development of the state which we have been building upon.\nToday in Delta we can look round and find that there are many growing towns in the state unlike most states.\n“We have several growing cities in Delta State and when you take a tour to many states, you will find out that God has truly blessed us in Delta.\nHe pointed out that politics without integrity has been the bane of Nigeria’s development and urged politicians to stop cross-carpeting from one political party to another."
  },
  {
    "headline": "Breaking: Another 32 Baptist Students Released by Kaduna Bandits",
    "summarized_story": "Thirty-two of the remaining abducted 63 Bethel Baptist students have released.\n“32 of the students have been released this evening, remaining 31 with the bandits,” the CAN chair said.\nHayab said the released students had been reunited with their parents.\nLast Friday, another batch of 15 students were released by the bandits.\nBandits had on July 5 invaded the school and abducted 121 students."
  },
  {
    "headline": "BREAKING: Three Injured As Inspector-General Of Police Squad Opens Fire On Ondo Students’ Leaders",
    "summarized_story": "Operatives of the Inspector General of Police Intelligence Response Team on Friday night opened fire on students’ leaders in Akure, Ondo state.\nSaharaReporters gathered that the students were attacked by the operatives on illegal duty around Dome in Alagbaka area of the state capital.\n“They came to extort some students at the Federal University of Technology yesterday and we confronted them.\nThree of our students are currently injured,” a students’ leader told SaharaReporters.\nWATCH: Operatives Of Inspector-General Of @PoliceNG Squad On Illegal Duty Open Fire On Studentsâ\u0080\u0099 Leaders In Akure, Ondo State pic.twitter.com/RZGR2B2UcX — Sahara Reporters (@SaharaReporters) August 27, 2021More details later"
  },
  {
    "headline": "BREAKING: Three Injured As Inspector-General Of Police Squad Opens Fire On Ondo Students’ Leaders",
    "summarized_story": "Operatives of the Inspector General of Police Intelligence Response Team on Friday night opened fire on students’ leaders in Akure, Ondo state.\nSaharaReporters gathered that the students were attacked by the operatives on illegal duty around Dome in Alagbaka area of the state capital.\n“They came to extort some students at the Federal University of Technology yesterday and we confronted them.\nThree of our students are currently injured,” a students’ leader told SaharaReporters.\nWATCH: Operatives Of Inspector-General Of @PoliceNG Squad On Illegal Duty Open Fire On Studentsâ\u0080\u0099 Leaders In Akure, Ondo State pic.twitter.com/RZGR2B2UcX — Sahara Reporters (@SaharaReporters) August 27, 2021More details later"
  },
  {
    "headline": "BREAKING: Three Injured As Inspector-General Of Police Squad Opens Fire On Ondo Students’ Leaders",
    "summarized_story": "Operatives of the Inspector General of Police Intelligence Response Team on Friday night opened fire on students’ leaders in Akure, Ondo state.\nSaharaReporters gathered that the students were attacked by the operatives on illegal duty around Dome in Alagbaka area of the state capital.\n“They came to extort some students at the Federal University of Technology yesterday and we confronted them.\nThree of our students are currently injured,” a students’ leader told SaharaReporters.\nWATCH: Operatives Of Inspector-General Of @PoliceNG Squad On Illegal Duty Open Fire On Studentsâ\u0080\u0099 Leaders In Akure, Ondo State pic.twitter.com/RZGR2B2UcX — Sahara Reporters (@SaharaReporters) August 27, 2021More details later"
  },
  {
    "headline": "EXCLUSIVE: Hushpuppi: Police Panel Recommends Demotion For Disgraced DCP, Abba Kyari To Prevent His Extradition To US",
    "summarized_story": "SaharaReporters learnt that the panel found Kyari guilty of some infractions after its investigations but recommended that Kyari should be demoted and not dismissed.\n“The police report on Abba Kyari only recommends demotion to a lower rank.\nKyari is being probed for his alleged links with Hushpuppi, who has pleaded guilty in the United States.\nThe police panel report was submitted by the chairman of the SIP, DIG Joseph Egbunike, at the Force Headquarters, Abuja on Thursday, 26th August 2021, CP Frank Mba, the Force Public Relations Officer, stated.\n“Kyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment.”"
  },
  {
    "headline": "EXCLUSIVE: Hushpuppi: Police Panel Recommends Demotion For Disgraced DCP, Abba Kyari To Prevent His Extradition To US",
    "summarized_story": "SaharaReporters learnt that the panel found Kyari guilty of some infractions after its investigations but recommended that Kyari should be demoted and not dismissed.\n“The police report on Abba Kyari only recommends demotion to a lower rank.\nKyari is being probed for his alleged links with Hushpuppi, who has pleaded guilty in the United States.\nThe police panel report was submitted by the chairman of the SIP, DIG Joseph Egbunike, at the Force Headquarters, Abuja on Thursday, 26th August 2021, CP Frank Mba, the Force Public Relations Officer, stated.\n“Kyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment.”"
  },
  {
    "headline": "PROFILE: Omobola Johnson, pioneer minister, board chair, and a woman of many firsts",
    "summarized_story": "Omobola Johnson is one of Nigeria’s boardroom gurus, defying societal limits and breaking new grounds with remarkable achievements.\nAs a pioneer of many trains, she conquered mediocrity to set high standards, becoming a woman of many firsts.\nAdvertisementOn July 1, 2021, Johnson took over leadership of Guinness Nigeria Plc board as its first female chair.\nIn 2011, Jonathan appointed Johnson as Nigeria’s pioneer minister of communication technology.\nOn July 1, 2021, Johnson became the first female board chair of Guinness Nigeria Plc, a subsidiary of Diageo Plc, after serving as the company’s independent non-executive director."
  },
  {
    "headline": "PROFILE: Omobola Johnson, pioneer minister, board chair, and a woman of many firsts",
    "summarized_story": "Omobola Johnson is one of Nigeria’s boardroom gurus, defying societal limits and breaking new grounds with remarkable achievements.\nAs a pioneer of many trains, she conquered mediocrity to set high standards, becoming a woman of many firsts.\nAdvertisementOn July 1, 2021, Johnson took over leadership of Guinness Nigeria Plc board as its first female chair.\nIn 2011, Jonathan appointed Johnson as Nigeria’s pioneer minister of communication technology.\nOn July 1, 2021, Johnson became the first female board chair of Guinness Nigeria Plc, a subsidiary of Diageo Plc, after serving as the company’s independent non-executive director."
  },
  {
    "headline": "APC rep to Buhari: Your failure is responsible for insecurity in Nigeria",
    "summarized_story": "AdvertisementThe lawmaker said the strategies adopted by the Buhari administration have failed and cannot guarantee the safety of Nigerians.\nGagdi, a lawmaker from Plateau state and member of the All Progressives Congress (APC), said this in a letter addressed to the president.\nAll these have heightened fears of insecurity in Nigeria.\nAdvertisementGagdi said Simon Lalong, governor of Plateau, has made efforts in tackling insecurity in the state, adding that the support of the federal government is needed.\nWith particular reference to Plateau State, it should even be quicker given the miniature nature of Plateau State."
  },
  {
    "headline": "APC rep to Buhari: Your failure is responsible for insecurity in Nigeria",
    "summarized_story": "AdvertisementThe lawmaker said the strategies adopted by the Buhari administration have failed and cannot guarantee the safety of Nigerians.\nGagdi, a lawmaker from Plateau state and member of the All Progressives Congress (APC), said this in a letter addressed to the president.\nAll these have heightened fears of insecurity in Nigeria.\nAdvertisementGagdi said Simon Lalong, governor of Plateau, has made efforts in tackling insecurity in the state, adding that the support of the federal government is needed.\nWith particular reference to Plateau State, it should even be quicker given the miniature nature of Plateau State."
  },
  {
    "headline": "Garba Shehu: What Buhari has done to bandits is worse than declaring them terrorists",
    "summarized_story": "Garba Shehu, presidential spokesman, says what the government of President Muhammadu Buhari has done to bandits is worse than declaring them terrorists.\nAdvertisementSpeaking with BBC Pidgin on Saturday, Shehu said there is a subsisting order by the president to shoot any bandit on sight.\n“What the Buhari administration has done to the arms-wielding bandits is worse than being declared as terrorists,” he said.\nAdvertisement“Do you know that there is a subsisting order by the President that any arms-wielding, AK-47 bandits should be shot on sight.\nThere is nothing to suggest that these bandits are treated preferentially.”The presidential aide said progress has been made in taking out these bandits."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Soyinka chides Buhari over plans to review grazing routes",
    "summarized_story": "Wole Soyinka, a Nobel laureate, has faulted plans by President Muhammadu Buhari to go ahead with the reopening of grazing routes across Nigeria despite opposition to the plans.\nPresident Buhari had recently approved recommendations of a committee to review 368 grazing sites, across 25 states in the country, and to determine the levels of encroachment.\nBut speaking at a press conference, Friday in Lagos State, Soyinka noted that such idea was not in the best interest of Nigeria.\nAccording to him, “Virtually the whole nation is screaming that we do not want any open cattle grazing.\nWhether they go by the name of cattle routes or grazing reserves.”“Round the entire nation, we’ve had opinions surmounting the antiquated mode of cattle rearing."
  },
  {
    "headline": "HR experts give tips on interviewing for a dream job",
    "summarized_story": "That is why it is important especially for those new to job hunting, to know the right guidelines when preparing for an interview towards getting a dream job.\nIn a previous BusinessDay article, tips to note when writing a compelling Curriculum Vitae (CV) were highlighted.\nWhen asked a question and you do not say much, it makes the interview boring, ending it quickly.\nRead also: 5 HR experts on how to write compelling CVKnow about the industry that the role you are being interviewed for.\nWinnifred Omobolanle, Operations Lead at Utiva, an Edutech companyWhen questions are asked, try to understand and apply them to the company’s situation."
  },
  {
    "headline": "Saudi Arabia headhunts Nigerian doctors in brain drain deja vu",
    "summarized_story": "Nigerian medical doctors on Wednesday trooped in their hundreds to the Sheraton Hotel in Abuja for the recruitment exercise organised by the Saudi Arabia Ministry of Health.\nJennifer Oyelade, director of Transquisite Consulting, an international human resource consultancy noted that Saudi Arabia could gain cheap labour from Nigeria.\nThey decried that they feel neglected and unwanted in Nigeria following the attitude of the Nigerian government to their affairs, and are therefore determined to seize the opportunity presented by Saudi Arabia.\n“In fact, the people going to Saudi Arabia are only going for a while so that they can go elsewhere because the barrier is very low.\nNigeria will not be able to afford doctors until the central problem of poor healthcare funding is addressed, Odulana said."
  },
  {
    "headline": "Edo govt alerts residents on sale of fake entrance forms into College of Nursing Sciences – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has alerted residents to the activities of fraudsters circulating fake entrance forms into the Edo State College of Nursing Sciences.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie Esq., disclosed that the government has not commenced the sale of entrance/admission forms into the college, noting that sale of such forms will be duly publicized through the appropriate channels.\nThe statement reads: “It has come to the attention of the Edo State Government that some persons, in a bid to defraud unsuspecting members of the public, have resorted to putting on sale fake entrance forms into the Edo State College of Nursing Sciences.\n“Government therefore wishes to put all interested candidates, as well as the general public on notice, that the Edo State College of Nursing Sciences has not commenced sales of Entrance/Admission Forms.\n“For the avoidance of doubt, sale of entrance/admission forms into the College will be duly publicized through the appropriate channels, namely the official website of the Edo State Government on https://www.edostate.gov.ng and the Print and Electronic Media on commencement of the process.”“Government hereby reiterates the need to avoid dealing with any person purportedly acting as an agent to the Ministry of Health or the College of Nursing Sciences in respect of the sale of entrance/admission forms into the College,” Ogie noted."
  },
  {
    "headline": "Health, environment, safety top agenda as Edo Marks 30th anniversary – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said that the state government will continue to make investment in preserving the health, safety and environment of Edo people as the state marks its 30th anniversary.\nObaseki said this during the flag-off a tree-planting campaign held at Idu village in Orhionmwon Local Government Forest Reserve, as part of activities to mark the 30th anniversary of Edo State.\nIt is for this reason that we, collaborating with private stakeholders, have embarked on a reforestation program to have ten million trees planted in Edo State, over the next decade.\n“As we celebrate Edo at 30 today, our emphasis and focus must be on environmental sustainability.\nWe have continued to invest in our youth through various programs spearheaded by the Edo Skills Development Agency (EdoJobs), which has given birth to numerous enterprises in the Edo Production Centres, Edo Tech Hub and Edo Creative Hub."
  },
  {
    "headline": "COVID-19 3rd wave: Edo records one more death, 45 new cases, vaccinates over 7200 persons in 48 hrs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo has continued to record more deaths of persons who have not been inoculated with the COVID-19 vaccines, as the state recorded another COVID-19-related death, bringing the total number of fatalities to 8.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nHe said the state in the last 48 hours vaccinated over 7200 persons, following the flag-off of the second phase vaccination exercise across the state by Governor Obaseki.\nAccording to him, “Edo State, in the last 24 hours, recorded 45 new COVID-19 cases, 10 recoveries, and one more death.\nThe new death, also an unvaccinated person, brings the total number of fatalities recorded in the third wave of the pandemic to 8."
  },
  {
    "headline": "Agbor-Uromi road: Motorists, commuters appeal for Gov Okowa intervention – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAgbor – Residents, motorists, and commuters plying the Agbor-Uromi road have continued to groan over difficulty to pass through the Agbor/Igbanke section of the road, in Ika-South local government area of Delta State.\nThe Trunk A national road which link Edo, to and from other states in Nigeria has been rendered unpassable due to flood water from Agbor-Obi area and environ that finds it way beside Agbor Technical College to the road.\n“once the heavy erosion carry red sand enter the road; any motor enter, e go magnet am there.\nThose wen dey come from Port Harcourt go hang, unless dem dey go straight to Asaba side.\nEven the gutters wen suppose channel the water go river don block”, owner of a mechanic workshop adjacent the Agbor Technical College narrated in Pigin English."
  },
  {
    "headline": "EXCLUSIVE: Notorious bandit sets conditions for peace in Katsina",
    "summarized_story": "Mr Kachallah is believed to be leading criminal activities in Safana Local Government Area (LGA) of Katsina State, according to PREMIUM TIMES’ findings.\nHardened criminalSani Na-Ammee, a former accomplice of Mr Kachallah who has renounced banditry, told PREMIUM TIMES that he tried to persuade Mr Kachallah to stop criminality.\nThere was peace after talks with bandits – GovernmentThe Katsina State Government insisted that its 2016 peace dialogue with bandits resulted in peace between farmers and herders in the state.\nCommunities in Katsina were living in peace following the peace dialogue, he said.\nHe said the bandits refrained from attacking communities in 2017, 2018 and 2019; adding that there was peace in Katsina following the sincere peace dialogue with the bandits."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Zenith Bank proposes N9.42bn interim dividend for half year 2021",
    "summarized_story": "Zenith Bank Plc has proposed to pay the total sum of N9.42 billion as interim dividends to its shareholders for the half year period ended 30th of June, 2021.\nThe interim dividend will be paid electronically to shareholders on the 20th of September, 2021, subject to appropriate withholding tax.\nShareholders must have completed the e-dividend registration and must have mandated the Registrar (Veritas Registrar Limited) to pay their dividends directly into their bank accounts.\nTo facilitate the payment, the financial giant noted that its register of shareholders will be closed on 13th of September, 2021.\nZenith had declared a half year profit of N106.12 billion in HY 2021, indicating a slight increase of about 2.2% YoY."
  },
  {
    "headline": "Tottenham face Rennes, Mourinho’s Roma get CSKA in Europa Conference League",
    "summarized_story": "English Premier League side, Tottenham Hotspur will play Rennes, Vitesse Arnhem and Mura of Slovenia in the group stage of the inaugural Europa Conference League following Friday’s draw in Istanbul.\nSpurs, who are the sole English representative after finishing seventh in the Premier League last season, could probably not have got a tougher draw in the new, third-tier competition, AFP reported.\nTottenham qualified for the group stage by beating Pacos de Ferreira of Portugal 3-0 on Thursday for a 3-1 aggregate victory, with Harry Kane scoring twice.\nRennes, who came sixth in Ligue 1 last season and have spent 50 million euros ($58.8m) on new signings this summer, defeated Rosenborg of Norway to make it through.\nThe group stage will begin on September 16 and the final will be held in the Albanian capital Tirana on May 25 next year."
  },
  {
    "headline": "Open Grazing: Hope Uzodinma has betrayed Igbo race – ADF",
    "summarized_story": "“We therefore advise him to quickly go for spiritual cleansing before he can be seen as a normal member of the Igbo race,” ADF further noted.\nIt is needed and intended to protect the Igbo race and safeguard her ancestral lands.\nSo, for any Igbo Governor or person for that matter to renounce the anti-open grazing law is a pointer that he subscribes to the wiping out of the Igbo race from existence.\n“Whether the present Imo state Legislature takes action to preserve the Constitutional order order in Imo State or not, Imo state cannot claim to have a legitimate Executive Governor in the present circumstances.\n“May the Almighty God protect and preserve the people of Imo state and return a Constitutional order to their besieged state.”"
  },
  {
    "headline": "Secondus resumes as PDP chairman as Elder Akinwomi hands over",
    "summarized_story": "The National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Friday took over the affairs of the party.\nPrince Secondus who was obeying the purported experte order of a Degema High Court in Rivers State had stayed away but got reinstated after a Kebbi High Court presided over by Justice Nasirat.i.\nSequel to that Prince Secondus who had stayed away even though not served resumed and the Deputy National Chairman South, Elder Yemi Akinwomi who held forth in his absence upon receipt of the new Court order handed over to him.\nAt the brief handover , Prince Secondus pledged to continue providing astute leadership to the party.\nElder Akinwomi also announced his receipt of the court order which he presented to the caucus meeting."
  },
  {
    "headline": "Federal Govt To Repatriate 322,000 Nigerian Refugees From Niger, Cameroon, Chad",
    "summarized_story": "The federal government through the Ministry of Humanitarian Affairs, Disaster Management and Social Development is set to begin the repatriation of 322,000 Nigerian refugees in the Republics of Niger, Cameroon and Chad.\nMinister of Humanitarian Affairs, Sadiya Farouq, disclosed this while receiving the draft report from the Technical Working Group on the repatriation of Nigerian refugees in Cameroon in Abuja, yesterday.\nThe TWG presented the draft tripartite agreement for the voluntary repatriation of Nigerian refugees in Niger Republic and Chad to the minister in Abuja.\nADVERTISEMENTFarouq, in a statement issued in Abuja by her media aide, Nneka Anibeze, said the draft, after its ratification, would kick-start preparations for the repatriation of refugees from the Republic of Niger and Chad.\nReceiving the draft in Abuja, Farouq noted that a total of 322,000 Nigerian refugees were currently living in neighbouring countries."
  },
  {
    "headline": "Federal Govt To Repatriate 322,000 Nigerian Refugees From Niger, Cameroon, Chad",
    "summarized_story": "The federal government through the Ministry of Humanitarian Affairs, Disaster Management and Social Development is set to begin the repatriation of 322,000 Nigerian refugees in the Republics of Niger, Cameroon and Chad.\nMinister of Humanitarian Affairs, Sadiya Farouq, disclosed this while receiving the draft report from the Technical Working Group on the repatriation of Nigerian refugees in Cameroon in Abuja, yesterday.\nThe TWG presented the draft tripartite agreement for the voluntary repatriation of Nigerian refugees in Niger Republic and Chad to the minister in Abuja.\nADVERTISEMENTFarouq, in a statement issued in Abuja by her media aide, Nneka Anibeze, said the draft, after its ratification, would kick-start preparations for the repatriation of refugees from the Republic of Niger and Chad.\nReceiving the draft in Abuja, Farouq noted that a total of 322,000 Nigerian refugees were currently living in neighbouring countries."
  },
  {
    "headline": "Federal Govt Begins Conditional Cash Transfer To 10,000 Ogun Families",
    "summarized_story": "The Federal Government has begun the disbursement of monthly stipend of N5,000 to the poor and the vulnerable in Ogun State, under its Conditional Cash Transfer (CCT) programme.\n“The programme, HUP-CCT, is being coordinated by the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development.\nThe commissioner said that the pilot programme began in Ogun in October 2020 with enrolment and data capturing activities.\nSpeaking on behalf of the beneficiaries, Mrs Sufiana Idowu, commended the state and the federal governments for the gesture.\nShe, however, urged the federal government to ensure that the payment was consistent so as to lift the beneficiaries out of poverty."
  },
  {
    "headline": "Federal Govt Begins Conditional Cash Transfer To 10,000 Ogun Families",
    "summarized_story": "The Federal Government has begun the disbursement of monthly stipend of N5,000 to the poor and the vulnerable in Ogun State, under its Conditional Cash Transfer (CCT) programme.\n“The programme, HUP-CCT, is being coordinated by the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development.\nThe commissioner said that the pilot programme began in Ogun in October 2020 with enrolment and data capturing activities.\nSpeaking on behalf of the beneficiaries, Mrs Sufiana Idowu, commended the state and the federal governments for the gesture.\nShe, however, urged the federal government to ensure that the payment was consistent so as to lift the beneficiaries out of poverty."
  },
  {
    "headline": "Nollywood Veteran Actor, Prince Ifeanyi Dike, Is Dead",
    "summarized_story": "The Nigerian creative industry, Nollywood, has been thrown into mourning, as one of its veterans, Prince Ifeanyi Dike, is dead.\nThis is happening on the heels of the death of another veteran, Victor Olaotan, who reportedly died on Thursday but the news of his death filtered in on Friday morning.\nThe Imo State born actor, was said to have died on Friday morning.\nADVERTISEMENTPrince Ifeanyi Dike will be remembered for many things, more importantly, as founder and chairman, Board of Trustees, Actors Guild of Nigeria (AGN).\nHis demise is one that Nollywood will mourn for a long time to come."
  },
  {
    "headline": "BBNaija 6: Jealous Jackie B confronts Michael for flirting with Maria",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Jackie B, confronted Michael for flirting with Maria.\nAccording to Jackie B, Michael’s flirting with girls made her look stupid, and she doesn’t like that.\nBut it’s okay if you don’t understand, let it go.\nI’ll let it go but don’t make me look stupid.’Apparently, Michael had told Maria that he wanted to kiss her and Jackie B wasn’t cool with that.\nThe ‘Michael Jackson’ shipSince Michael got into the house two weeks ago, Jackie B has been so clingy to him and fans gave them the name ‘Michael Jackson’."
  },
  {
    "headline": "BBNaija 6: Jealous Jackie B confronts Michael for flirting with Maria",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Jackie B, confronted Michael for flirting with Maria.\nAccording to Jackie B, Michael’s flirting with girls made her look stupid, and she doesn’t like that.\nBut it’s okay if you don’t understand, let it go.\nI’ll let it go but don’t make me look stupid.’Apparently, Michael had told Maria that he wanted to kiss her and Jackie B wasn’t cool with that.\nThe ‘Michael Jackson’ shipSince Michael got into the house two weeks ago, Jackie B has been so clingy to him and fans gave them the name ‘Michael Jackson’."
  },
  {
    "headline": "Many killed, injured in raid on IPOB/ ESN Imo camp",
    "summarized_story": "An unspecified number of Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) members were killed in a clash with the police during a raid on their camp located at Akata in Oru East Local Government Area of Imo State on Friday.\nThe police also suffered heavy casualties when some groups of IPOB/ESN laid ambush on their vehicles while the police personnel were returning from the raid.\nIt was learnt that the bandits threw petrol bombs and Improvised Explosives Devices (I.E.Ds) at the police vehicles, causing heavy casualties.\nCredible information by the Imo Command’s intelligence unit revealed that some bandits suspected to be IPOB/ESN terror groups were seen mobilising to attack police formations and government installations from their camp located at Akata in Oru East LGA of Imo State.\nThe Police spokesman CSP Michael Abattam, who disclosed these in a statement, said on approaching the camp, the police teams were attacked by the terror groups."
  },
  {
    "headline": "Many killed, injured in raid on IPOB/ ESN Imo camp",
    "summarized_story": "An unspecified number of Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) members were killed in a clash with the police during a raid on their camp located at Akata in Oru East Local Government Area of Imo State on Friday.\nThe police also suffered heavy casualties when some groups of IPOB/ESN laid ambush on their vehicles while the police personnel were returning from the raid.\nIt was learnt that the bandits threw petrol bombs and Improvised Explosives Devices (I.E.Ds) at the police vehicles, causing heavy casualties.\nCredible information by the Imo Command’s intelligence unit revealed that some bandits suspected to be IPOB/ESN terror groups were seen mobilising to attack police formations and government installations from their camp located at Akata in Oru East LGA of Imo State.\nThe Police spokesman CSP Michael Abattam, who disclosed these in a statement, said on approaching the camp, the police teams were attacked by the terror groups."
  },
  {
    "headline": "President Buhari responsible for killings in Nigeria: Ortom drops another bombshell",
    "summarized_story": "Governor Samuel Ortom has once again accused President Muhammadu Buhari of backing the terrorists wreaking havoc in Nigeria.\nThe governor, in a fresh interview with BBC on Saturday, said Buhari is responsible for the killings in Nigeria.\nHe said the president refused to take the right actions against terrorists because they are Fulani.\nWhat Governor Ortom said“If the government has power to stop Sunday Igboho and Nnamdi Kanu, why don’t they have powers to stop bandits?\n“In fact, I was not the one who said it, even the Fulani bandits, they don’t want them to be addressed as Fulani."
  },
  {
    "headline": "Manchester City unveil Kompany, Silva statues",
    "summarized_story": "Manchester City have unveiled statues of club legends Vincent Kompany and David Silva outside the Etihad Stadium, ahead of the Arsenal game on Saturday.\nThe duo played huge roles after the Abu Dahani group took over Manchester City.\nThey have now been immortalized outside the Etihad by Scottish sculptor Andy Scott, who created the statues remotely during the coronavirus pandemic.\nSpeaking to Man City’s official website, Kompany said: “I didn’t really expect to be recognised by such a great club in that way.\nThis statue really represents the way I like to play, I love the pose the sculptor has chosen."
  },
  {
    "headline": "APC Lawmaker Writes Buhari, Blasts President’s Style Of Leadership",
    "summarized_story": "Yusuf Gagdi, a member of the All Progressives Congress (APC) in the House of Representatives from Plateau State, has blamed President Muhammadu Buhari for the country’s deteriorating security situation.\nThe All Progressives Congress (APC) Representative from Plateau State stated that the recent increase in insecurity in the country was due to the Buhari administration’s inability to deal decisively with factors indicative of rising animosity in the country, mutual suspicion, and religious frontlines.\nHe observed that the issue of insecurity has reached a point where the current strategies being adopted by the President’s administration have failed and are in no way adequate to guarantee safety.\nHe added that they can no longer hold water in a cup let alone in a basket.\nHe lamented the recent shameful raid on the highly fortified Nigeria Defence Academy, Kaduna, noting that the metropolitan attacks in Jos, Plateau State among others, have heightened fears of insecurity in Nigeria."
  },
  {
    "headline": "Police Kill Scores OF IPOB, ESN Members In Imo",
    "summarized_story": "In a gun battle with Imo State Police Command operatives, an unspecified number of Eastern Security Network and Indigenous People of Biafra members, including one of their leaders, were killed.\nOn Friday, members of the Indigenous Peoples of Biafra (IPOB) security wing were slain by police agents at Akata town in the state’s Oru East Local Government Area during a raid on their encampment in Imo State.\nThree police officers were also shot during the operation, according to the Daily Post, and were brought to the hospital for treatment.\nThe Inspector-General of Police, Usman Baba, had earlier in the week urged the police to be merciless with IPOB and ESN members, classifying them as terrorists, according to NEWS DIRECT.\nThe bandits threw petrol bombs and Improvised Explosives Devices at the police vehicles."
  },
  {
    "headline": "Mali’s Ex-Interim President, PM Released From House Arrest",
    "summarized_story": "The authorities who deposed former Malian interim President Bah Ndaw and his prime minister, Moctar Ouane, have released them from house arrest, according to a committee monitoring the post-coup transition.\nTheir arrest by military officers in May signified Mali’s second coup since President Ibrahim Boubacar Keita was deposed in August of the previous year.\nFollowing a military coup in August 2020, both men were selected as interim civilian leaders, tasked with guiding Mali back to civilian control.\nColonel Assimi Goita, Mali’s strongman, toppled Ndaw and Ouane in a second coup in May, following a sensitive government change.\nLater, Goita was named interim president."
  },
  {
    "headline": "Plateau Killings: Nigerian States Evacuate Students From Jos",
    "summarized_story": "As several states hurry to remove their citizens studying in Plateau State as a result of the activities of bloodthirsty men on the prowl, killing unsuspecting residents, indigenes, and those who have become stuck, the state remains tense.\nRecall that Plateau State was recently thrown into an unexpected security crisis following the August 13 slaughter of over 30 travelers along Rukuba Road in the state’s Jos North Local Government Area.\nAt least eight states, including Benue, Enugu, Abia, Ogun, Oyo, Kogi, Kwara, and Gombe, have successfully evacuated their students from Plateau as a result of the ongoing retaliation strikes.\nHowever, ASP Ubah Gabriel Ogaba, spokesman for the Plateau State Police Command, told DAILY POST on Friday that security has been tightened up in all locations suffering agitation.\nMany states have evacuated their citizens, some may not publish it in the media but they have."
  },
  {
    "headline": "Qatar 2022 Race: Togolese officials to take charge of Nigeria, Liberia clash",
    "summarized_story": "World football –governing body, FIFA has appointed Togolese official, Kouassi Attisso Attiogbe as the referee for next Friday’s FIFA World Cup Qatar 2022 qualifying match between Nigeria and Liberia scheduled for the Teslim Balogun Stadium, Surulere, Lagos.\nFIFA has also appointed Munkaila Nassam Adam from Ghana as match commissioner, while Abdellah El Achiri from Morocco will serve as referee assessor.\nThe match officials are expected to arrive in Lagos on Wednesday, while the delegation of Lone Star is scheduled to land on Tuesday.\nMeanwhile, the 5,000 –capacity Estádio Municipal Adérito Sena on the island of Mindelo will host the Day 2 clash between the Super Eagles and the Blue Sharks of Cape Verde.\nThat game will hold on Tuesday, 7th September, with the Super Eagles set to fly out of Lagos aboard a chartered jet on Monday, 6th September and return to Nigeria immediately after the match."
  },
  {
    "headline": "@36, Ronaldo becomes highest paid player in Premier League",
    "summarized_story": "Cristiano Ronaldo has now emerged the highest-paid player in the Premier League, following his shock return to Manchester United, according to Sky Italia.\nThe 36-year-old has agreed on personal terms with United, which will see him sign a two-year deal worth £480,000 a week.\nRonaldo is now ahead of Lukaku, who also moved back to Chelsea this summer.\nDe Bruyne’s new teammate, Jack Grealish, is paid £380,000-per-week including bonuses.\nCurrent top earners in EPLCristiano Ronaldo – £480,000-per-weekRomelu Lukaku – £450,000-per-week (including bonuses)Kevin de Bruyne – £385,000-per-weekJack Grealish – £380,000-per-week (including bonuses)David De Gea – £375,000-per-weekPierre-Emerick Aubameyang – £350,000-per-weekRaheem Sterling – £300,000-per-weekPaul Pogba – £270,000-per-weekAnthony Martial – £250,000-per-weekMo Salah – £220,00-per-weekBen Chilwell – £190,000-per-weekVirgil van Dijk – £180,000-per-week"
  },
  {
    "headline": "NPower batch C employment: How to check deployment status, print out PPA letter *See the link",
    "summarized_story": "The National Social Investment has commenced massive deployment of over 500,000 batch C applicants shortlisted a few months ago.\nThe deployment status is now active and ready for applicants to start printing their deployment letter.\n👉 Once your Dashboard loads fully, click on the “Deployment” tab.\n👉 Click on DOWNLOAD PPA letter to print your posting letter.\nNOTEApplicants are to know that deployment is in batches, more successful applicants will be deployed as the day goes onUpon successful login, click the deployment link on your dashboard to view whether you have been deployed or not"
  },
  {
    "headline": "Stella Oduah dumps PDP, joins APC -NigPilot",
    "summarized_story": "Former Minister of Aviation in the administration of President Goodluck Ebele Jonathan and a serving Senator, Princess Stella Oduah-Ogiemwonyi , has dumped the People’s Democratic Party (PDP) and joined the ruling All Progressives Congress (APC) in Abuja.\nThe APC governorship candidate in the November 2021 election, Senator Andy Uba was at the occasion.\nShe is the latest of high profile members of the former ruling party who joined the APC recently.\n“You will enjoy the privileges enjoyed by all members of the party because you will have a waiver,” Bunu said.\nShe said during the occasion that she joined the APC family as part of the process of the changing political narrative in the South East, and assured that she joined the APC along with her multitude of supporters who have been jubilating in Anambra State."
  },
  {
    "headline": "Digitalization: APC set to go ‘paperless’ – Buni -NigPilot",
    "summarized_story": "The ruling All Progressives Congress, APC, is set for serious digitization and digital transformation of its operations.\nThings are changing and digital technology is becoming a source of inspiration for us to do what we do better.\n” We can use technology to enhance our processes, services and also to deliver our traditional services more efficiently and transparently.\nLikewise, we can use technology to bring new things to our party.\nZainab Marwa, Charles Nkata, Imaan Sulaiman-Ibrahim, OWOLABI Olusegun Awosan, Nasiru Danu, Princess Nse Ekpo and Osayi Ejiga"
  },
  {
    "headline": "Anambra Guber: Collapse your structure for APC, Okechukwu tells APGA -NigPilot",
    "summarized_story": "Therefore, I implore you to kindly consider the fruit in APGA joining APC to win the Anambra governorship.\nIn 2017, President Muhammadu Buhari restored Governor Obiano’s security details on the APC governorship campaign ground.\nIn 2019, Obiano led APGA to reciprocate the grand political gesture of understanding by Mr. President.\n“Gentlemen, would it not make for a greater political impact and success, if APGA consummates what its leaders started right from 2014 by embracing APC in a closer embrace?\nThey should show patriotism and respect for the campaign for Nigeria President of Igbo extraction by joining the mainstream, which APC’s victory in the governorship poll will enhance,” Okechukwu contended."
  },
  {
    "headline": "2023 Presidency: APC should jettison zoning, focus on competence, acceptability – Monidafe -NigPilot",
    "summarized_story": "One of the prominent aspirants for the position of the national chairman of All Progressives Congress, APC, Mr Sylvester Monidafe , has advised his party to put aside the issue of zoning but rather focus on competence, acceptability, and sellability, as criteria to select his flagbearers for the 2023 general elections.\nMonidafe, who gave the advice while speaking with journalists at the national secretariat of APC, said he was aspiring to lead the party because he would bring something unique to the party, one of which he said was his experience of running a party from local government level to national level.\nThe party chieftain noted that the country was on the edge and needed someone with his political capital to save the nation from the precipice, which has to start from reinventing the ruling party."
  },
  {
    "headline": "Nigeria Will Continue To Exist As A Nation – Obasanjo",
    "summarized_story": "﻿Despite calls for secession, former President Olusegun Obasanjo has said that Nigeria will continue to exist as a nation.\nWhile noting that some forces don’t want to see the country’s continued co-existence, Obasanjo said those people would continue to fail.\n“Whatever happens, we will continue to work for the unity, peace, security and progress of this country,” he said.\n“Nigeria will continue to exist because the cost for us for Nigeria not to continue to exist is much more than the cost for us to make Nigeria to continue to exist.\nHe promised to continue to work for the peace and progress of a Nigeria that is united."
  },
  {
    "headline": "Another 32 Bethel Baptist School Students Regain Freedom",
    "summarized_story": "Another 32 students out of the 63 remaining abducted students of Bethel Baptist school in Chikun Local Government area of Kaduna State have regained their freedom.\nAlthough the Kaduna State Government and police authorities are yet to confirm the development, a top official of Baptist School told Channels Television that the students regained their freedom on Friday.\nThe kidnappers had on July 5 attacked the school and took away 121 students from their hostels.\nAt least 90 of the students have now regained their freedom while 31 remain in captivity.\nMost of the victims have since returned after their families paid ransom to the gunmen, but some are still in captivity."
  },
  {
    "headline": "Abducted Zamfara College Students Regain Freedom",
    "summarized_story": "The abducted students of the College Of Agriculture and Animal Science Bakura, Zamfara State, have regained their freedom, 12 days after gunmen whisked them away from the institution.\nAccording to Governor Bello Matawalle, the students were released on Friday through the help of some repentant bandits.\n“Today, based on our dialogue and reconciliation, we used the repentant bandits to secure the release of these students,” he said.\nThey are out day and night to make sure that they convinced those criminals to release those students and their teachers.\nUpon receiving the students on Friday, Governor Matawalle, however, said that no ransom was paid for their release."
  },
  {
    "headline": "PHOTOS: Freed Islamiyya Students Arrive At Niger State House",
    "summarized_story": "Ninety-three students of an Islamic seminary who were recently freed after three months in the den of kidnappers have arrived at the Niger State Government House.\nUpon arrival, they were greeted by their parents and government officials, all cheerful for their safety.\nRead Also: Gunmen Free 93 Islamiyya Students Three Months After AbductionThe gunmen had abducted the students from their school in Rafi Local Government Area of Niger State on May 30.\nA few days later, they demanded a ransom of ₦110 million and threatened to kill the victims but 11 of them were released hours later, according to the Niger State Government.\nThe governor of the North-Central state, Sani Bello had earlier ruled out the option of paying a ransom to the abductors."
  },
  {
    "headline": "Three Killed As Gunmen Attack Zangon Kataf Again",
    "summarized_story": "No fewer than three people have been killed and several others injured in separate attacks by gunmen in Zangon Kataf Local Government Area of Kaduna State.\nThe incidents which occurred on Friday at Machun and Manuka villages followed the killing of five persons in Zangon Kataf earlier in August.\nThe gunmen were said to have invaded the two villages and started shooting sporadically and in the process, killed three residents while several others were injured.\nOn August 8, Channels Television reported that at least five persons were killed in separate attacks by gunmen in Zango Kataf.\nAlso attacked by gunmen was Jankasa General Area Ground, as well as Ungwan Rana in Zonzon District and Ungwan Gaiya Village."
  },
  {
    "headline": "Gov Bello assures Mahundu residents they can now return home",
    "summarized_story": "Niger state governor Abubakar Sani Bello has assured residents of Mahundu community that they will be given adequate security to enable them return home one year after fleeing their village due to bandit attacks."
  },
  {
    "headline": "DPR reopens five filling stations sealed by Lagos govt",
    "summarized_story": "The Department of Petroleum Resources (DPR) has reopened five filling stations shut by the Lagos State Building Control Agency ( LASBCA) in Ajah and Ibeju Lekki axis of the state.\nSpeaking to journalists, Zonal Operations Controller, DPR, Lagos Zone, Mr Ayorinde Cardoso, said the stations were sealed without consultation with the regulatory agency."
  },
  {
    "headline": "We Don’t Want Experience Of Boko Haram In Northwest – Maj. Gen. Uwem",
    "summarized_story": "The Nigerian Army in collaboration with the police force said they are committed to ensuring the northwest zone does not experience the type of insurgency that has raged the north eastern part of the country for yearsThe Force Commander Joint Taskforce Operation Hadarin Daji Northwest zone Major General Uwem Bassey said with the existing collaboration between sister agencies, citizens can now sleep with their two eyes closedThe General officer Commanding eight division Nigerian Army Sokoto who doubles as the Commander joint task force and his entourage were received by a Guard of Honor at the Zamfara state Police CommandThe aim of the visit is to strengthen Interagency collaboration with the police to rid the northwest zone of criminalityOperation Hadarin Daji was established to keep peace in all trouble areas of Katsina, Zamfara, Sokoto and Kebbi statesAdvertisementThe Taskforce Commander Major General Uwem Bassey adds that the four states under his watch will soon experience lasting peaceOn his part, the commissioner of police Zamfara state Command Ayuba Elkanah asured his guests of continued synergy in curtailing the menace of Banditry and other forms of criminalityHe appealed to communities within banditry affected states to continue to collaborate with security operatives by giving them useful and timely information on activities of criminal elementsCP Elkanah further enjoin communities to expose criminals in their domainThe two Senior officers enjoin troops in the four affected states to redouble efforts to bring the activities of bandits and kidnappers to a haltAdvertisementThe General officer Commanding eight division Nigerian Army Sokoto was accompanied by the commandant one Brigade Gusau.\nThe assurances by the senior officers to rid the northwest zone of banditry is coming a few days after the Zamfara state Governor Bello Matawalle called on president Muhammadu Buhari to declare a state of emergency on security in Northern Nigeria."
  },
  {
    "headline": "It’ll Cost Nigeria More to Break up Than to Remain One, Obasanjo Says",
    "summarized_story": "The former president’s declaration is coming amid secession agitations, fueled by perceived injustice and worsening security situation, across the country.\nBut Obasanjo, who was the convener of the programme in honour of Mbang, assured the respected Christian leader that the enemies of Nigeria would not win.\nAnd to assure him that whatever happens, we will continue to work for unity, peace, security and progress of this country.\nWe want to assure you that Nigeria will continue to exist because the cost for Nigeria not to continue to exist is much more than the cost for us to make Nigeria to continue to exist.\nThe former President eulogised Mbang for his steadfastness, which had kept their relationship intact over the years, and described the former President of the Christian Association of Nigeria as a lover of Nigeria."
  },
  {
    "headline": "Mali Releases Ex-Interim President and PM from House Arrest",
    "summarized_story": "Former Malian interim President Bah Ndaw and his prime minister, Moctar Ouane, have been freed from house arrest by the authorities who deposed them in May, a committee monitoring the post-coup transition has said.\nBoth men were appointed as interim civilian leaders after a military coup in August 2020, charged with steering Mali back towards the civilian rule.\nGoita was later declared interim president.\nAides to Ndaw and Ouane had indicated that the two leaders had been kept under house arrest after their removal.\nOn Friday, the al-Qaeda-affiliated Group to Support Islam and Muslims claimed responsibility for an August attack that killed 17 Malian soldiers, according to a SITE Intelligence."
  },
  {
    "headline": "US Braces for Category 4 Hurricane Ida after Cuba Takes Hit",
    "summarized_story": "Hurricane Ida battered Cuba with roof-ripping force on Friday as it churned toward a weekend US landfall along the Louisiana coast, prompting evacuations of flood-prone New Orleans neighborhoods and oil rigs in the Gulf of Mexico.\nAccording to the the US National Hurricane Center (NHC), Ida is now entering the Gulf of Mexico, adding that it is expected to rapidly intensify before reaching the northern Gulf Coast.\nIda, the ninth named storm and fourth hurricane of the 2021 Atlantic hurricane season, may well exceed the strength of Hurricane Laura, the last Category 4 storm to strike Louisiana, by the time it makes landfall, forecasters said.\nA dangerous storm surge was also possible along the Gulf Coast.\nMore heavy rains are likely across Mississippi when Ida moves inland, causing “considerable flash, urban, small stream, and riverine flooding”, the hurricane centre said."
  },
  {
    "headline": "American Forces Keep Up Kabul Airlift Under High Threat Warnings",
    "summarized_story": "The death toll in Thursday’s suicide bombing rose to 169 Afghans, a number that could increase as authorities examine fragmented remains, and 13 U.S. service members.\nU.S. Central Command said American officials believed the militant killed in Saturday’s drone strike had been involved in planning strikes against the United States in Kabul, and that there were no other known casualties.\nThe U.S. said it was the deadliest day for American forces in Afghanistan since 2011.\nAfghans, American citizens and other foreigners were all acutely aware the window was closing to get out via the airlift.\nTheir return to power has terrified many Afghans, who have rushed to flee the country ahead of the American withdrawal."
  },
  {
    "headline": "Nigeria Government Orders Stoppage of Striking Doctors’ Salaries",
    "summarized_story": "Nigeria’s federal government has commenced the implementation of the no work, no pay rule on striking doctors with effect from Monday August 2, 2021.\nResident doctors under the auspices of the National Association of Resident Doctors (NARD) had vowed to sustain the ongoing nationwide industrial action until their demands were met by the federal and state governments.\nThe doctors, who are protesting the alleged non-implementation of the Memorandum of Agreement it reached with government in December 2020, said that the federal government and some states owed their members salary arrears ranging from seven to 19 months.\nThe striking doctors had earlier refused to sign a Memorandum of Understanding brokered by the Minister of Labour and Employment, Chris Ngige and the President of Nigerian Medical Association (NMA), Prof. Innocent Ujah, which gave specific timelines for addressing the doctors’ demands.\n“Consequent on the above, I am directed to inform you to commence the implementation of the no work, no pay, policy on the striking doctors, with effect from Monday August 2, including other health workers that may embark on strike subsequently."
  }
]