[
  {
    "headline": "ASUU strike: Students protest in Lagos, Benin, vow to block N’ Assembly, airports",
    "summarized_story": "The President of UNIBEN’s Students Union Government, Foster Amadin, said at the NUJ secretariat, “We are appealing to whosoever is concerned to help resolve this issue.\nWe have also come to the NUJ secretariat as wise students who know the importance of the media to express our displeasure over the lingering ASUU strike.”Also, students of the University of Lagos, Akoka, staged a protest against the ongoing ASUU strike.\nThe students displayed placards, and banners, calling on the Federal Government to wade into the crisis.\nTheir direct employers are the universities and the Federal Ministry of Education.\nAny further queries on the ASUU strike should go to the Federal Ministry of Education and if possible, the National Universities Commission, who are their direct employers."
  },
  {
    "headline": "Nigeria, WHO launch national diagnostic list",
    "summarized_story": "The World Health Organisation has supported the Federal Government in launching the Nigeria National Essential Diagnostics List.\nThe EDL aims to provide evidence-based guidance to countries to create their own national lists of essential diagnostic tests and tools, anticipating that the EDL would complement the List of Essential Medicines and enhance its impact.\nThe WHO Public Health Emergency Advisor, Dr. Alexander Chimbaru, disclosed that following increased recognition of the importance of diagnostic testing in healthcare, particularly as it plays a major role in achieving Universal Health Coverage, the World Health Organisation developed an Essential Diagnostics List to address the lack of access to tests and testing services in many countries.\nChimbaru further noted the WHO Essential Diagnostic List, which was first published in 2018, was a list of recommended in-vitro diagnostics that should be available at the point of care and is intended as a guidance document for countries to create their own national list based on their local context and needs.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Despite form denial, Jonathan meets Adamu, prepares to run on APC ticket",
    "summarized_story": "Former President Jonathan, who was reported to have rejected a N100 million nomination form procured for him by some Fulani pastoralists, later met behind closed doors in Adamu’s house.\n“These people have been pressurizing Jonathan until the very last minute not to accept to run on the APC ticket no matter how tempting the conditions may be.\nBut the point is that the deadline for picking the form is this week and if he does not accept the form, the window would be closed and the opportunity lost,” one source explained.\nIt will be recalled that following the purchase of the form for Jonathan, his media aide, Ikechukwu Eze, had described the action as insulting and unacceptable to Jonathan, saying that he was not consulted.\nBut a close source confirmed last night that Jonathan was moving ahead with the plan to run on the APC ticket."
  },
  {
    "headline": "Experts call for awareness, early diagnosis of rheumatoid arthritis",
    "summarized_story": "By Chioma ObinnaHealthcare professionals have called for massive awareness and management of rheumatoid arthritis to prevent disease progression, stating that early diagnosis and initiation of effective treatment improve clinical outcomes for patients with the disease.\nRheumatoid arthritis is an autoimmune disorder that affects the small joints of the body.\nHe said adequate treatment is also important to try to prevent or lessen the severity of co-morbidities, particularly cardiovascular disease, a major cause of mortality in rheumatoid arthritis patients.\nSpeaking, a Rheumatologist from the Lagos University Teaching Hospital, LUTH, Dr. Uyiekpan Ima-Edomwonyi, said data has shown that the burden of rheumatoid arthritis would increase in most developing countries like Nigeria.\n“We want to work closely with the healthcare community to ensure early diagnosis, increased patient access and medication adherence."
  },
  {
    "headline": "Hallmark HMO seeks more investment in healthcare systems",
    "summarized_story": "By Gabriel OlawaleThe Chairman of Hallmark Health Services Limited, Mr. Eddie Efekoha has appealed to government and corporate organisations to investment more in strengthening healthcare systems to enable Nigerians have access to quality healthcare services.\n“Currently our National Health Insurance Scheme (NHIS) is mandated at the Federal level to carry out this daunting task.\nWe recognise some of the inefficiencies and inequities in our health systems.\nMamora,represented by the CMD, Federal Medical Centre, Ebute Metta, Dr Ademola Dada, also identified lack of proper coordination between the three tiers of government on health issues as part of the challenges confronting access to quality healthcare system.\nOn her part, the Managing Director and Chief Executive Officer of Hallmark HMO, Mrs. Dotun Adeogun said that they are poised to continue to support the established health systems to make access to healthcare a reality."
  },
  {
    "headline": "Jonathan has not committed himself to 2023 race; buying forms in ex-President’s name, an insult — Aide",
    "summarized_story": "By Idowu BankoleFormer Nigerian president, Doctor Goodluck Jonathan has denied knowledge and authorization of the purchased N100m APC presidential forms, describing it as an insult to his person.\nSpecial Assistant to the ex-President on media, Ikechukwu Eze said, in a terse statement that, while the ex-president appreciates the overwhelming requests by Nigerians to join the 2023 presidential race, Jonathan has not committed himself to this request.\n“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorize it.\n“Buying a presidential aspiration form in the name Dr. Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person.\nRecall Vanguard had reported how Fulani groups and Almajiris sold cows to purchase the N100m APC presidential nomination forms for the ex-President, on Monday."
  },
  {
    "headline": "2023: You won’t regret voting for me — Tinubu",
    "summarized_story": "By Ogalah IbrahimThe National Leader of the All Progressive Congress APC, and 2023 presidential hopeful, Asiwaju Bola Ahmed Tinubu has said that Nigerians would not regret voting for him come 2023, promising to serve the country with all his strength, while ensuring the unity of Nigeria.\nBola Tinubu, who was in Katsina on Monday to canvass for the support of delegates ahead of the forthcoming presidential primary of the APC.\n“I am here to meet you, my brothers and sisters, to beg and secure your support for the primaries.\nIf I become the president, I will take care of all the abandoned projects for the economic development of the country.\nWith these qualities alone, you have our blessings, cooperation and support ahead of the forthcoming National party primaries to make you come out successful and as a gift for Nigerians come 2023."
  },
  {
    "headline": "Speak against killings now – Chidoka to Igbos",
    "summarized_story": "Former Aviation Minister, Osita Chidoka, has expressed sadness over the murder of ‘Army couple‘ in Imo State and urged all Igbo to speak up.\nIn a statement on Monday, Chidoka, who said he watched the video, called the act a sacrilege and desecration of Igboland.\nHe noted that killing a woman whose crime is that she has a job to keep body and soul together “is tragic and unpardonable”.\nChidoka recalled that the Igbos suffered for the kidnap and selling of their people during the slave trade era.\nChidoka said women and disadvantaged groups must be respected, adding that killing unarmed people is a crime against humanity."
  },
  {
    "headline": "Queues return as fuel scarcity hits Kogi",
    "summarized_story": "Fuel scarcity has hit Lokoja and other parts of Kogi State, as motorists now queue for several hours to buy premium motor spirit, popularly called petrol.\nIt was further learnt by our correspondent that the scarcity of fuel in Lokoja and other parts of Kogi State had enabled black marketers to capitalize on the recent developments.\nFurther findings revealed that the regulatory agency in charge of petroleum products in Kogi State has continued to remain silent to checkmate the activities of petroleum marketers who seize every opportunity to extort motorists.\nHer words, “Without mincing words, the agency regulating petroleum in Kogi State has been compromised.\nKogi State has never gotten worse since the present controller of DPR took over the mantle of leadership."
  },
  {
    "headline": "Zamfara residents cry out as bandits take over Tofa community",
    "summarized_story": "Bandits operating in Zamfara State have forced villagers in Tofa community in Magami district of Gusau Local Government Area of Zamfara State to desert their village.\nAccording to them, they have written severally to the state Commissioner for Internal Security and Internal Affairs, DIG Mamman Tsafe, to deploy security operatives to the area but all to no avail.\nTofa community is about 40 kilometres away from Gusau, the Zamfara State capital, located along Dansadau where banditry activities emanated from over a decade ago.\nThe community members lamented that they have been facing serious attacks by the suspected bandits, pointing out that this has forced the residents of the community to desert the community to seek refuge in places that are relatively safe in the state.\nAccording to the residents, the bandits did not allow the farmers to carry out harvest in some farmlands but they took over those farms upon all the ransom being paid to them."
  },
  {
    "headline": "Airline operators accuse NNPC of withholding 25,000MT of Aviation Fuel approved by FG",
    "summarized_story": "Airline Operators of Nigeria, AON, on Monday, accused the management of Nigerian National Petroleum Corporation (NNPC) of withholding 25,000MT of aviation fuel in disregard to the directive issued by President Muhammadu Buhari.\nFemi Gbajabiamila, the airline operators stated that President Buhari directed that aviation fuel should be sold to them at landing rates with a view to ameliorate the losses they incurred over the months.\n“But I said no, that the marketers you are going to give are the same marketers that would handle it for us.\nIn his response, the NNPC Group Managing Director, Mele Kyari said there are considered safety issues involved in releasing aviation fuel directly to operators, or even marketers, saying that not everyone can handle ATK.\nSomebody must handle aviation fuel."
  },
  {
    "headline": "2023: Aisha Yesufu mocks Omokri as Jonathan gets APC presidential form",
    "summarized_story": "Popular socio-political activist, Aisha Yesufu, has mocked Reno Omokri, former media aide to Nigerian ex-president, Goodluck Jonathan.\nDAILY POST had reported that Jonathan on Monday got APC’s N100million presidential nomination form.\nAlthough Jonathan has not confirmed if he will join the 2023 presidential race, Reno Omokri, who is a fierce critic of the APC had denied Jonathan’s plans to dump the Peoples Democratic Party, PDP.\nReacting shortly after the group purchased Jonathan’s presidential nomination form, Aisha Yesufu tweeted, “Where is Reno Omokri @renoomokri?\nPlease assume it is Dr Oby Ezekwesili @obyezeks that has been reported by @BBCAfrica to have purchased APC Presidential form and start tweeting."
  },
  {
    "headline": "Dagogo accuses Rivers police boss of bias",
    "summarized_story": "The embattled member of the House of Representatives, Farah Dagogo, has accused the Rivers State Commissioner of Police, Friday Eboka, of bias following his claims on circumstances that led to his arrest and detention.\nSome of them were saying no Farah, no screening, no Farah, no PDP.\n“The following day, Farah came to the same venue; he was identified and arrested based on what happened the previous day.\nFarah Dagogo is a governorship aspirant and was never at the venue for the screening of National and State Assembly aspirants.\nAgain, Farah Dagogo is not an aspirant for those positions.””Lawal also said Eboka didn’t invite Dagogo, and challenged him to present proof of the invitation."
  },
  {
    "headline": "Why Southeast should produce next president, by Uzodimma",
    "summarized_story": "Why Southeast should produce next president, by UzodimmaImo State Governor Hope Uzodinma yesterday said the Southeast should produce President Muhammadu Buhari’s successor.\nHe said the election of a Southeasterner as president in next year’s poll will foster unity, equity, fairness and justice.\nBut, he cautioned that the presidential candidates for the 2023 election will not run on the platforms of ethnic associations, but on the platforms of political parties.\nHe maintained that the battle for tickets and the general election will be fought within and among political parties, and not tribal organisations.\nHowever, he said “Southeast has a strong hunger to produce the next president,” adding that the parties should zone the tickets to the region."
  },
  {
    "headline": "IPOB to UK: you’ll benefit from Biafra",
    "summarized_story": "The proscribed Indigenous People of Biafra (IPOB) has hailed the British government for clarifying its purported classification of the group as a terrorist organisation.\nThe group, however, called on the government to change its mind on the continuous humiliation of Biafra.\nThe statement reads: “Our attention has been drawn to the inaccurate and fake news purporting that the United Kingdom has classified IPOB as a terrorist organisation.\n“Nigeria has been sponsoring insecurity and banditry in Biafra land, and it continues linking it with IPOB in its desperation to demonise IPOB and ESN operatives, and present us as terrorist organisation that we are not.\n“IPOB has been in existence long before those criminals trying to blackmail the good work of IPOB in London."
  },
  {
    "headline": "UPDATED: Northern group ‘obtains’ APC presidential form for Jonathan",
    "summarized_story": "After months of hide and seek, former President Goodluck Jonathan may have finally joined the All Progressives Congress (APC) presidential race.\nAddressing journalists after picking the form , Abdullahi said: “I represent two of the most vulnerable communities in our country.\n“It was the dream and the vision of President Goodluck Jonathan that if that program had continued it would one day produce from the Almajiri system of education; Doctors, engineers.\nThe nomadic leader said the good work of the former President made them sell their cows to raise the money for the purchase of the forms.\nOn the party membership status of the former President, the Fulani leader said, “Yes President Goodluck Jonathan is a member of APC.”"
  },
  {
    "headline": "BREAKING: Northern group ‘obtains’ APC presidential form for Jonathan",
    "summarized_story": "After months of hide and seek, former President Goodluck Jonathan may have finally joined the All Progressives Congress (APC) presidential race.\nA group of supporters of Fulani extraction and Almajiris led by Ibrahim Abdullahi picked the expression of interest and nomination forms for the former President around 6:30 pm.\nJonathan, who spoke on his entrance into the race when some women and youths stormed his office to persuade him to contest the 2023 presidential election some weeks ago, had said the process of joining was in progress.\nWith his entrance, APC presidential aspirants have risen to 26.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Jonathan joins APC presidential race",
    "summarized_story": "After months of hide and seek, former President Goodluck Jonathan has finally joined the All Progressives Congress (APC) presidential race.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nA group of supporters of Fulani extraction and Almajiris led by Ibrahim Abdullahi picked the expression of interest and nomination forms for the former President around 6:30 pm.\nDo not miss the Vital Information, it goes off in 2 days!\nCLICH HERE to READ ."
  },
  {
    "headline": "Kalu lauds Lawan for joining presidential race, withdraws from contest",
    "summarized_story": "Chief Whip of the Senate, Orji Uzor Kalu, has congratulated Senate President, Ahmad Lawan, for joining the presidential race, while announcing his withdrawal and opting to return to the Senate.\nKalu had consistently said that for equity and justice, the two zones that should be given preference in the 2023 presidential race were South East and North East, which have not produced the President.\nI am most glad because he is from the North East, the only zone alongside South East that is yet to produce President of Nigeria.\nThis is because it would be the closest to the equity, fairness and Justice everyone is talking about.\nHowever, since there is no zoning and the contest is open to all Nigerians, I officially withdraw from presidential contest in 2023."
  },
  {
    "headline": "Road to 2023: Ahead of PDP presidential primaries, ‘I have Plan B and C,’ Bauchi Gov Bala Mohammed,",
    "summarized_story": "“There is nothing wrong with someone having a plan B or plan C In politics, I am a general and I always plan for the best, not only for myself but for people around me.\nHe maintained that the party is responsible for zoning and as members, they are ready to abide by the decision of the party.\n“The party has responsibility for zoning and where ever it is zoned to, we are ready to abide by the decision of the party.\n“The party leaders have the discretion and the right to choose whichever zone they want and we must accept the zone they choose”.\nNotwithstanding, he stated that he is presenting himself before the party elders, members and Nigerians for them to make their decision on who will lead them."
  },
  {
    "headline": "Lawyer sues APC, PDP and INEC over parties’ outrageous nomination fees",
    "summarized_story": "The suit filed on Monday 9th May 2022 at the Federal High Court Abuja is marked as Suit No.\nFHC/ABJ/CS/618/2022, brought under the Fundamental Rights (Enforcement Procedure) Rules, 2009 and pursuant to Article 13 (1) of the African Charter on Human and People’s Rights.\nAnother order compelling the 1st and 2nd respondents to avail any member of their political parties who wish to contest for any elective political office in the forthcoming 2023 general elections or any other elections with their nomination form free of charge.\nAnd for such further order or other orders as the Honourable Court may deem fit to make in the circumstance.\nA9, LFN, 2004, which guarantees the right of every Nigerian to free access to participate directly in the government of the country."
  },
  {
    "headline": "Lawan joins presidential race as reported by Saturday Sun",
    "summarized_story": "As reported by Saturday Sun on April 30, 2022, the Senate President, Dr. Ahmad Lawan, has joined the presidential race on the platform of the All Progressives Congress (APC), purchasing the N100 million expression of interest and nomination forms in Abuja.\nSaturday Sun had reported that Lawan would join the presidential race after the last sallah holiday, having been picked by northern elders to preferred aspirant.\nThe new president they want is Ahmad Lawan, the current president of the Senate of Nigeria,” he said.\nOn why they want the current Senate President to be the president, he said: “We want him to be president because of national stability.\nThe president that we are bringing for the Nigerian people is a Nigerian president, not an Igbo president, not a Fulani president, not a Yoruba president."
  },
  {
    "headline": "Dasuki Formally Hands over Finance Ministry, Extols Tambuwal for Getting World Bank’s $55m Grant for Sokoto",
    "summarized_story": "Former Sokoto State Commissioner for Finance, Hon.\nDasuki who took over the affairs of the Ministry in 2019, had earlier tendered his resignation in March in compliance with the Electoral Act.\nHe recently returned from a foreign trip to formally hand over to the permanent secretary.\nHe said with the reforms initiated and executed, the Finance Ministry was adequately prepared to continue to lead the way in the development agenda of the state government.\nDasuki said those reforms boosted the state’s cash inflow and paved way for the provision of developmental projects across Sokoto."
  },
  {
    "headline": "Fulani Group Picks APC Presidential Nomination Forms for Jonathan",
    "summarized_story": "Adedayo AkinwaleA Fulani group has picked All Progressives Congress expression of interest and nomination forms for former President Goodluck Jonathan.\nJonathan who was elected President on the platform of the Peoples Democratic Party was defeated by President Muhammadu Buhari in 2015.\nThere had been speculations that the former president was considering taking another shot at the presidency but on the plaform of APC, the party which sent him out of Aso Rock seven years ago.\nSee photos of members of the group at the International Conference Centre Abuja, where they picked the forms for JonathanShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Kalu Withdraws from Presidential Race",
    "summarized_story": "Sunday AborisadeThe Chief Whip of the Senate, Orji Uzor Kalu, on Monday, formally withdrew from the race to succeed President Muhammadu Buhari next year.\nKalu, in a statement personally signed by him in Abuja, however declared his support for the candidature of the Senate President, Ahmad Lawan, for the top job.\nThe Senate President had on Monday, received the N100 million All Progressives Congress’ (APC) presidential forms purchased for him by the National Stability Project led by Chief Sam Nkire, who is the chairman of the movement.\n“In the absence of a South-easterner being president of Nigeria in 2023, I have my full support for a North-easterner.\nThis is because it would be the closest to the equity, fairness and justice everyone is talking about."
  },
  {
    "headline": "ASUU Extends Strike by 12 Weeks",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe Academic Staff Union of Universities (ASUU) has again resolved to continue its nationwide strike for another 12 weeks.\nIn a communiqué issued at the end of its National Executive Council (NEC) meeting in Abuja on Sunday, the union stated that: “After extensive deliberations, noting federal government’s failure to live up to its responsibilities and speedily address the issues raised in the 2020 FG-ASUU Memoradum of Action, within the additional eight week roll-over strike period declared on March 14, 2022, NEC resolved that the strike rolled-over for 12 weeks to give government more time to satisfactorily resolve all the outstanding issues.”The communiqué, signed by ASUU President, Prof. Emmanuel Osodeke, said: “The roll-over strike is with effect from 12.01am on Monday, May 9, 2022.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2023: African Leaders Pressure Buhari for AfDB President, Adesina",
    "summarized_story": "A reliable source told THISDAY that leaders in West Africa, including the presidents of Niger and Côte d’Ivoire, might have spoken to Buhari on behalf of the AfDB president.\nThree different groups, Rice Farmers Association of Nigeria, Friends of Emefiele and Emefiele Support Group, had last week, purchased the forms for Emefiele.\n“It is true that the groups that felt that the CBN Governor will do well as the president purchased forms for him but he has not made any declaration.\nHe described Adesina as a man of proven integrity and experience, saying he performed well for Nigeria as Minister for Agriculture.\nWe are calling Adesina because it’s a call to save Nigeria, and I think he is going to accept.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "A Nation Of Accomplices By Modiu Olaguro",
    "summarized_story": "In physics, the plastic point is one wherein an elastic wire would cease to return to its original length upon stretching.\nFrom the north down south, through the trenches of delta, the nation longs for a father.\nThe nation more than ever needs brave men who are certain of their convictions to put forward viable alternatives and defend their arguments with uncommon bravado.\nGoing by the level of rot and the very fact that the nation keeps going adrift, hope appears to have eluded this generation.\nModiu Olaguro can be reached on [email protected]"
  },
  {
    "headline": "2023: Jonathan disowns northern group, says APC form bought without his consent",
    "summarized_story": "Former President Goodluck Jonathan says he has no link to the northern coalition that purchased the presidential nomination and expression of interest forms of the All Progressives Congress (APC) for him.\nEarlier on Monday, the coalition procured the forms for Jonathan from the International Conference Centre in Abuja.\n“It has come to our notice that a group has purportedly purchased Presidential Nomination and Expression of Interest forms of the All Progressives Congress, APC, in the name of former President Dr. Goodluck Ebele Jonathan,” the statement reads.\nAdvertisement“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorise it.\nAdvertisement“Buying a presidential aspiration form in the name of Dr. Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person."
  },
  {
    "headline": "2023: Jonathan disowns northern group, says APC form bought without his consent",
    "summarized_story": "Former President Goodluck Jonathan says he has no link to the northern coalition that purchased the presidential nomination and expression of interest forms of the All Progressives Congress (APC) for him.\nEarlier on Monday, the coalition procured the forms for Jonathan from the International Conference Centre in Abuja.\n“It has come to our notice that a group has purportedly purchased Presidential Nomination and Expression of Interest forms of the All Progressives Congress, APC, in the name of former President Dr. Goodluck Ebele Jonathan,” the statement reads.\nAdvertisement“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorise it.\nAdvertisement“Buying a presidential aspiration form in the name of Dr. Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person."
  },
  {
    "headline": "Reps ask NNPC to provide 6m litres of aviation fuel to airline operators",
    "summarized_story": "The house of representatives has asked the Nigerian National Petroleum Corporation (NNPC) to provide six million litres of aviation fuel to marketers chosen by the airline operators.\nIt was part of the resolutions reached after meeting with the Airline Operators of Nigeria (AON) and other stakeholders on Monday.\nOn Friday, the Airline Operators of Nigeria (AON) announced plans to shut down operations from Monday over the high cost of aviation fuel.\nThe group complained that aviation fuel, also known as Jet A1, has reached an all-time high of N700 per litre.\nSpeaking at the meeting, Allen Onyema, vice-president of AON, said the scarcity can be addressed if airliners are allowed to purchase aviation fuel directly."
  },
  {
    "headline": "Reps ask NNPC to provide 6m litres of aviation fuel to airline operators",
    "summarized_story": "The house of representatives has asked the Nigerian National Petroleum Corporation (NNPC) to provide six million litres of aviation fuel to marketers chosen by the airline operators.\nIt was part of the resolutions reached after meeting with the Airline Operators of Nigeria (AON) and other stakeholders on Monday.\nOn Friday, the Airline Operators of Nigeria (AON) announced plans to shut down operations from Monday over the high cost of aviation fuel.\nThe group complained that aviation fuel, also known as Jet A1, has reached an all-time high of N700 per litre.\nSpeaking at the meeting, Allen Onyema, vice-president of AON, said the scarcity can be addressed if airliners are allowed to purchase aviation fuel directly."
  },
  {
    "headline": "Bakare: N100m APC nomination form fee came from my account... I didn't borrow or beg",
    "summarized_story": "Tunde Bakare, serving overseer of The Citadel Global Community Church, says the N100 million paid for the All Progressives Congress (APC) nomination and expression of interest forms was from his account.\nBakare, who made an official declaration on his presidential bid on Monday, picked the forms on May 5.\n“Talking of the cost, there is a price to pay for everything.\n“By the grace of God, we paid without having to borrow or beg.\nBut whatever was transferred to the party’s account came from my account.”"
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "WhatsApp is adding more features",
    "summarized_story": "He’s expected to use his experience to assist the government in realising its plans to build a mega-city.\nFor more information, click here: Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?\nWhatsApp has some new featuresOn Friday, May 6, 2022, Mark Zuckerberg, Meta’s CEO, announced in a Facebook post the launch of WhatsApp’s Reaction feature.\nPer a WhatsApp blog post, larger groups are being “slowly” rolled out, while emoji reactions and increased file size limits are making their way into the app’s current version.\nYou’ve probably seen the Reaction feature on Slack and Telegram."
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "Fidia ushers in the long-awaited revolution in the creator economy.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nThey also shared a stronger bond – the desire to monetize their creative works without their location being a restriction.\nAllowing creators to support one another is another way to foster relationships among creators, Fidia successfully hacked this with the transfer feature, which is solely for cash transfers between Fidia creators.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Top 3 small-cap Metaverse coins for 2022: Mushe (XMU), Mist (MIST) & Highstreet (HIGH)",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nWith small-cap tokens, investors can sell as soon as the price increases beyond their target to garner a profit or hold onto their investments for the long term.\nWhat’s great about Mushe, MIST, and HIGH is that the tokens can be used in the metaverse.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Over 250 participants for 4th Templars, Patrelli Cricket Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOver 250 participants are expected to feature in the fourth edition of the Templars and Patrelli Secondary School Cricket Competition in Benin.\nTemplars and Patrelli are both law firms located in Lagos, but will individually organize the male and female categories of the event respectively.\nThe Templars tournament will see 11 secondary schools participate in the male event while Patrelli competition, which is focused on promoting and providing equal participation and opportunities for girls in sport, will have eight schools featuring.\nOthers are Odion Isesele, David Abiebhode, Asia Joshua, Selim Salau, Reigneth Osagie among others —who are part of the Edo State Under17 squad.\nThis program is a key aspect of the Templars and Patrelli corporate sustainability and responsibility strategy which focuses on youth empowerment through sports as well as support the youth development initiative of the Edo state government."
  },
  {
    "headline": "PWDs receives training on liquid soap, perfume production, others in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – No fewer than 40 persons living with disabilities in Edo State has benefited from a 2–Day skill acquisition program put together by Network for the Advancement of Persons Living With Visible Disabilities (NAPVID).\nThe training program held between Friday 6th and 7th Saturday May in Benin city is part of the network’s ‘Project HELP’ initiative to empower special persons drawn from across Edo state.\nThe participants were trained in liquid soap, perfume, air freshener, detergent, vaseline and air cream production.\nAccording to the organisers, the training was geared towards empowering persons with disabilities to be self reliant as current economic realities showed paid employment can not sustain households demands.\nA beneficiary, Ucheaga Grace expressed gratitude to the organisers, saying “the training is very educative and encouraging to us”."
  },
  {
    "headline": "Edo charges MSMEs to take advantage of grants to grow their businesses – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged small businesses in the state to take advantage of grants under the Edo-Cares programme, so as to grow their businesses and contribute to the state’s economic development.\nShe noted that the Edo-Cares grant, an emergency state-level intervention programme, is designed to support micro and small enterprises in Edo State affected by the economic crisis caused by the Covid-19 pandemic.\nShe urged business owners to take advantage of the opportunity, noting that the Edo-CARES grant offers businesses the opportunity to build their businesses, pay off business debts, enhance their working environment as well as scale up employment rate in the state.\n“Entrepreneurs in Edo state are encouraged to apply for this opportunity via the website, https://cares.plax.ng/edo.\nInterested business owners can also visit any of Edo Job Centres across the state,” she said."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "Fintech start-up emerges winner of SelectUSA tech pitch competition",
    "summarized_story": "Ifeoma Uddoh, 2021 alumna of the Academy for Women Entrepreneurs, has emerged as the overall winner of the SelectUSA Tech Nigeria Pitch Competition.\nUddoh is founder of Shecluded, a fintech start-up dedicated to bridging financial inclusion gap among women of color.\nThe U.S. Consulate General hosted the SelectUSA Tech Pitch Competition for Nigerian female-led tech startups interested in expanding their business operations into the United States.\nThe Investment Summit connects qualified companies with U.S. economic development organizations to facilitate business investment and job creation.\nThe U.S. government supports a number of programs, including the Academy for Women Entrepreneurs, the TechWomen and TechGirls Programs, and the African Women’s Entrepreneurship Program (AWEP) to support women’s inclusion in society."
  },
  {
    "headline": "BREAKING: Goodluck Jonathan gets APC presidential forms",
    "summarized_story": "A ‘Fulani group’ has purchased the N100 million All Progressives Congress (APC) presidential nomination forms for Goodluck Jonathan, Nigeria’s former president.\nThere have been speculations about the possibility of Jonathan who was president under the People’s Democratic Party party platform from 2010 to 2015 joining the race for president under the APC.\nRecall that on April 22, 2022, protesters stormed the Abuja private office of Jonathan, urging him to declare for 2023 presidential race.\nWe are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.\nReacting, Jonathan said I know you are “here to ask me to declare, I cannot declare because some process are still ongoing."
  },
  {
    "headline": "2023: Ahmad Lawan, Timpre Sylva, Ben Ayade pick N100m APC presidential forms",
    "summarized_story": "Ahmad Lawan, Nigeria’s senate president; Timipre Sylva, minister of state for petroleum and Ben Ayade, governor of Cross River State, on Monday, picked the pick the N100m All Progressives Congress (APC) presidential formsThis comes ahead of Tuesday’s deadline for the sale of nomination and expression of interest forms of the ruling party.\nSam Nkire, an APC chieftain in company of some senators picked the forms for Lawan at the International Conference Center, Abuja, noting that they are supporting him based on national stability.\nThe new president they want is Ahmad Lawan, the current president of the Senate of Nigeria,” he said.\nOn why they want the current Senate President to be the president, he said: “We want him to be president because of national stability.\nThe president that we are bringing for the Nigerian people is a Nigerian president, not an Igbo president, not a Fulani president, not a Yoruba president."
  },
  {
    "headline": "Ukraine: Nigeria targets Europe gas market with Nigeria-Morocco pipelines",
    "summarized_story": "Besides linking the two countries, the 5,660 km (3,517 miles) pipeline is also expected to connect some other African countries to Europe.\nStrategic but lateEnergy experts said the Russia and Ukraine conflict has shown that the conceptualized Nigeria–Morocco Gas Pipeline (NMGP) project could strengthen Nigeria’s economy as many European countries are shying away from Russia’s energy supply.\n“We are already building gas infrastructures such as the Ajaokuta-Kaduna-Kano (AKK) pipeline project, which is expected to take gas to Algeria, and the West Africa Gas Pipeline project designed to take gas to Morocco.”“As you can see we are already building infrastructure that will take gas to Europe.\nThe NMGP project is an offshore and onshore gas pipeline project that aims to transport Nigerian natural gas resources to Morocco via West and North Africa.\nAs a continuation of the existing West Africa Gas Pipeline (WAGP) between Nigeria, Benin, Togo, and Ghana, it is intended to deliver Nigeria’s natural gas resources to 13 countries in West and North Africa."
  },
  {
    "headline": "Sri Lankan Prime Minister Resigns Amid Economic Crisis",
    "summarized_story": "Sri Lanka’s Prime Minister Mahinda Rajapaksa has resigned today amid mass protests at the government’s handling of the economic crisis, officials said.\nThe move came as the island was placed under curfew after violent clashes between Rajapksa supporters and anti-government protesters in Colombo.\nMr Rajapaksa, 76, sent his resignation letter to his younger brother President Gotabaya Rajapaksa, his spokesman said.\nThe island nation is facing its worst economic crisis since gaining independence from Britain in 1948.\nMany Sri Lankans also want President Rajapaksa to go as well."
  },
  {
    "headline": "Customs To Sanction Officers Over Assault On Delta Gov’s Aide",
    "summarized_story": "The Nigeria Customs Service (NCS), on Monday, vowed to sanction officers of the Federal Operations Unit (FOU), Zone C, Owerri, Imo State, for assaulting one of the aides to the governor of Delta state, Samsom Nwachukwu.\nThe statement reads, “the attention of the Nigeria Customs Service, has been drawn to a video making the rounds on social media.\nIn it, one of our officers was recorded assaulting an unarmed civilian.\nThis action took place on the Benin – Agbor expressway on Saturday the 7th of May 2022 at about 5.00 pm.\nWhere they fail to carry out their brief as assigned, appropriate sanctions are applied to enforce discipline."
  },
  {
    "headline": "2023 Presidency: Emefiele Asks Court To Stop His Removal From Office",
    "summarized_story": "The governor of the Central Bank of Nigeria (CBN), Mr Godwin Emefiele, has told Justice Abdul Mohammed of a Federal High Court sitting in Abuja to stop his removal from office.\nIn a motion exparte filed on his behalf by his lawyer, Chief Mike Ozekhome, SAN, the plaintiff joined the Attorney-general of the Federation and Minister of Justice and the chairman, Independent National Electoral Commission, (INEC) as defendants in the matter.\nOzekhome, in a chat with LEADERSHIP before the hearing of the case in court on Monday, said Emefiele did not join the All Progressives Congress (APC) in the matter because he has not told him (counsel) that he is a card-carrying member of any political party yet.\nOzekhome said, ”We have to file a motion exparte, which we will move before the judge this morning.\nThe parties in the motion are the AGF and INEC chairman."
  },
  {
    "headline": "2023 Presidency: Emefiele Asks Court To Stop His Removal From Office",
    "summarized_story": "The governor of the Central Bank of Nigeria (CBN), Mr Godwin Emefiele, has told Justice Abdul Mohammed of a Federal High Court sitting in Abuja to stop his removal from office.\nIn a motion exparte filed on his behalf by his lawyer, Chief Mike Ozekhome, SAN, the plaintiff joined the Attorney-general of the Federation and Minister of Justice and the chairman, Independent National Electoral Commission, (INEC) as defendants in the matter.\nOzekhome, in a chat with LEADERSHIP before the hearing of the case in court on Monday, said Emefiele did not join the All Progressives Congress (APC) in the matter because he has not told him (counsel) that he is a card-carrying member of any political party yet.\nOzekhome said, ”We have to file a motion exparte, which we will move before the judge this morning.\nThe parties in the motion are the AGF and INEC chairman."
  },
  {
    "headline": "Rivers: Detained PDP Guber Aspirant To Remain In Detention Till May 23",
    "summarized_story": "The trial of the detained governorship aspirant on the platform of the Peoples Democratic Party (PDP) in Rivers State and member of the House of Representatives, Hon.\nDagogo, has accused Rivers State governor, Nyesom Ezenwo Wike, of plotting to nail him with falsehood.\nDoctor Farah Dagogo.\nDoctor Farah Dagogo is not a criminal, he has never been charged as one, neither has he been convicted of such an offense.\nDoctor Farah Dagogo had stated his role publicly, the sacrifices and the overtures he rejected.”"
  },
  {
    "headline": "Stephanie Otobo: Apostle Suleman breaks silence on allegations",
    "summarized_story": "The General Overseer, Omega Fire Ministries International, Apostle Johnson Suleman has reacted to fresh sexual allegations against him by Stephanie Otobo.\nSome years back, Otobo had accused Suleman of having sexual intercourse with her, a report Suleman vehemently denied.\nReacting to the trending story on Twitter, Suleman said he tweeted about ‘End ASUU strike’ on Sunday and that on Monday, he was trending.\nApostle Johnson Suleman tried using police to shut me up because I visited Nigeria to do feature Timaya in a song.\n“Some people kept on wondering why I came out exposing Apostle Johnson Suleman, and why I haven’t let go ever since."
  },
  {
    "headline": "Dollar batters Naira again at Exporters window",
    "summarized_story": "By Lydia NgwakweThe Naira on Monday depreciated at the Investors and Exporters window, exchanging at N419 to the dollar, a 0.48 per cent depreciation, weaker than N417 it traded on Friday.\nAn exchange rate of N423.00 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.00.\nA total of 53.15 million dollars was traded in foreign exchange at the official Investors and Exporters window on Monday.\nMeanwhile, Prof. Hassan Oaikhenan of the Department of Economics, University of Benin, has attributed the currency’s loss to the limited supply of the green back.\nHe said, “the depreciation is normal and not unexpected, given the demand pressures for the dollar in relation to the limited supply of the green back."
  },
  {
    "headline": "BREAKING: Fulani Group Buys APC Presidential Form For Goodluck Jonathan",
    "summarized_story": "As the campaign for the 2023 presidential election heats up, a group calling itself the “Fulani group” has spent N100 million on nomination and expression of interest forms for former President Goodluck Jonathan.\nRemember that on April 22, 2022, demonstrators stormed Jonathan’s Abuja private office, pushing him to run for president in 2023.\n“Now, we know better, under Jonathan the minimum wage could buy one or two bags of rice.\nWe are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.\nOthers that have picked under APC, include: the minister of transportation, Rotimi Amaechi, Kogi state governor, Yahaya Bello and others."
  },
  {
    "headline": "BREAKING: Miyetti Allah Purchases APC Presidential Form For Ex-President Jonathan",
    "summarized_story": "Media report has it that members of the Miyetti Allah cattle rearers association of Nigeria have purchased the All Ptogressive Congress (APC) presidential form for former President Goodluck Jonathan.\nThe group, according to DAILY POST purchased the form for the ex-president on Monday.\nRecall that Jonathan, while addressing some youths who stormed his house a few weeks ago, urging him to join the presidential race, said he was not ready.\nAt the moment, it is unclear if Jonathan would accept the form to join the race.\nMore details soon…"
  },
  {
    "headline": "JUST IN: Timipre Sylva, Ben Ayade pick N100m APC presidential forms",
    "summarized_story": "Minister of State for Petroleum, Timipre Sylva and Cross River State Governor, Ben Ayade on Monday obtained their nomination and expression of interest forms in Abuja.\nThis comes ahead of Tuesday’s deadline for the sale of nomination and expression of interest forms for the All Progressives Congress.\nThe International Conference Centre, Abuja, was agog with activities as several aspirants vying for various electoral offices stormed the venue to obtain their forms at the last minute.\nThe Senate President, Ahmad Lawan, also picked his copy of the forms at the venue."
  },
  {
    "headline": "BREAKING: 2023: Orji Kalu Withdraws From Presidential Race, Gives Reason",
    "summarized_story": "Senator Orji Uzor Kalu, the Chief Whip of the House of Senate, has announced his withdrawal from the presidential election in 2023.\nThe former governor of Abia State has announced that he will run for the Abia North Senatorial Zone in the upcoming general elections in 2023.\nKalu called on his supporters across the nation to the Senate President, Senator Ahmad Lawan who joined the presidential race on Monday.\nThe statement reads partly, “Since there is no zoning and the contest is open to all Nigerians , I officially withdraw from presidential contest in 2023.\nI have also picked ticket to run for Abia North Senatorial zone and to complete the good work I started in Abia North ."
  },
  {
    "headline": "NNPC’s non remittance to federation account: JPMorgan delists Nigeria from emerging market sovereign list ￼",
    "summarized_story": "JPMorgan has removed Nigeria from its list of emerging market sovereign recommendations that investors should be ‘overweight’ in, saying Nigeria had not taken advantage of high oil prices, while adding Serbia and Uzbekistan.\n“Nigeria’s fiscal woes amid a worsening global risk backdrop have raised market concerns despite a positive oil environment,” they said.\nEmerging market sovereign debt is at the “mercy” of the Federal Reserve’s interest rate decisions, JPMorgan analysts said in a note on Monday, as the U.S. central bank’s rate raises drain capital from developing markets.\nJPMorgan’s Emerging Markets Bond Index Global Diversified (EMBIGD) index has fallen 16% this year, the analysts said, “with most of the losses having come from rates” and $4 billion in net outflows from emerging markets since mid-April.\nHowever, the analysts said the “front-loaded pain” for emerging market bonds, which they said had begun underperforming in September 2021, was a positive."
  },
  {
    "headline": "Breaking: Senate President, Ahmad Lawan, receives N100m form, joins presidential race",
    "summarized_story": "The widely rumoured Presidential aspiration of the Senate President, Ahmad Lawan, turned to reality Monday when he received the All Progressives Congress ( APC) N100million nomination form from the National Stability Project at the Senate Guest House, Maitama.\nThe group led by Chief Sam Nkire said they bought the form for the Senate President being a stabiliser Nigeria needed at the moment.\nHe said membership of the National Stability Project cuts across the 36 States of the Federation and 774 local government Councils.\nAccepting the offer, the Senate President described the moment as memorable and historic and indeed, a clarion call to serve.\n“Today is a special day with the Clarion call made on me to serve by Nigerians through the movement known as National Stability Project."
  },
  {
    "headline": "[Breaking] 2023 presidency: CBN governor, Emefiele, makes u-turn as court summons INEC, Malami",
    "summarized_story": "“The motion is seeking that the court should grant an order for maintenance of status quo.\nLet my lord not allow anybody to do anything against the interest of my client, Ozekhome prayed the court.\nHe said: “The plaintiff is the current Governor of CBN, he desires to run for the office of the president in the election coming up in February 23, 2023.\nBy the way, this Electoral Act has been struck down by the Justice Evelyn of the Federal High Court sitting in Umuahia.\nAn order is made to serve the court processes on the defendants.”Share this: TwitterFacebook"
  },
  {
    "headline": "Adegbite extols gemstone, Jewellery grandaunts",
    "summarized_story": "Adegbite gave this commendation on Friday, during the graduation ceremony of the first batch of the gemstone and jewelry making trainees of the Abuja Chambers of Commerce and Industry.\nWhile addressing the graduands, the minister charged them to impart the knowledge they have acquired to others in their communities.\nAdegbite further assured them as he disclosed that the second phase of the training was in progress.\nHe commended the doggedness of the 21 participants of the first batch of the training for staying through to the end.\nThe Project Coordinator disclosed that there are plans for advanced training for the 21 successful master training graduands, this, he said would be communicated to them in due course."
  },
  {
    "headline": "NHP Taraba named ‘Muhammadu Buhari’ Housing Estate",
    "summarized_story": "…,To promote decent housing access for the people of Taraba State.\n– Taraba State GovernorBy Chioma NnodimMinister of State for Works and Housing Mr.Mu’azu Jaji Sambo, Executive Governor of Taraba State Darius Dickson, Ishaku, top government officials and local residents in Jauro –Yinu Taraba State converged at the commissioning and handover ceremony of National Housing Programme in Jalingo Taraba State, as Sambo named the National Housing Programme in Jalingo, Taraba Stste Muhammadu Buhari Housing Estate weekend.\nIt is on this note and for his contribution to National Development through the National Housing Programme that I, Mu’azu Jaji Sambo Hon.\nMinister of State, Works and Housing name the National Housing Project site in Jalingo , Taraba State as “ Muhammadu Buhari Housing Estate , Jalingo,” Sambo said.\nThe use of available local building materials in the National Housing Programme has stimulated the economy through the production and use of local materials ."
  },
  {
    "headline": "Customs seize poisonous bags of rice imported from India",
    "summarized_story": "According to acting Controller Ejibunu, “Pursuant to the Federal Government’s policy that encourages local production of rice against the importation of foreign parboiled rice, this Unit had seized 7,259 (of 50 kg each) bags of rice, which is an equivalent of over twelve (12) trucks load.\n“Consequent upon this laboratory analysis on the foreign parboiled rice; as a responsible government agency, we are letting Nigerians know that apart from the negative economic impact of importing foreign rice into the country, some of these imported rice are unhealthy for human consumption.\nThus, we advise consumers to desist from patronizing the federal government banned foreign parboiled rice.\n“We as citizens have a collective responsibility to safeguard our economy and health for the benefit of all.\n“A total of twelve suspects were arrested in connection with some of the seizures; for committing various Customs offences."
  },
  {
    "headline": "33% Pension increase: PHCN retirees excluded by wages commission – PTAD",
    "summarized_story": "“This is because PHCN pensioners were already on a special salary structure before the Pension review for Pensioners who while in service were on one of the Harmonized Salary Structures of the Federal Public Service.\n“It should be noted that PHCN pensioners took the Federal Government to the National Industrial Court (NIC) Abuja on this issue.\nAfter several engagements, President Muhammadu Buhari, approved the implementation of 9.7% increase in the pensions of Ex-PHCN Retirees under the Defined Benefit Scheme (DBS).\nIt is therefore preposterous and uncalled for that this group wants to conveniently forget the amicable agreement reached by all parties and arm-twist the Federal Government to make claims on the 33% pension increment,” PTAD said in a statement it issued on Friday.\nThe pensioners reportedly alleged that PTAD colluded with some “powerful individuals” to deprive them of the 33% pension increment as approved by the federal government in 2010."
  },
  {
    "headline": "PBR Cowpea has revolutionalised Nigeria’s food production – NABDA DG",
    "summarized_story": "By Eunice OrikeAs Nigeria prepares for the 2022 planting season, director-general of the National Biotechnology Development Agency NABDA, Prof. Abdullahi Mustapha, has commended the Pod Borer Resistant PBR, Cowpea for revolutionalising Nigeria’s food production.\nMustapha who spoke during a press conference on the commercialisation of the new variety of cowpea, said that the food crop is revolutionalising Nigeria’s food production with its tremendous yield, quick harvest, non-shattering and good cooking characteristics.\nAnd that if the 3 million hectares, PBR Cowpea is planted on 1million hectares, the savings on the cost of insecticide is N16,200 billion annually.\n“The feat attained with the development and commercialisation of the PBR Cowpea has, again, proven that if determined, Africa has what it takes to solve its challenges.\nSpeaking on the safety of the improved PBR Cowpea, the director-general, National Biosafety Management Agency (NBMA), Dr. Rufus Ebegba, assured Nigerians the crop is safe for both human consumption and the environment."
  },
  {
    "headline": "‘An Insult’: Jonathan Rejects APC Presidential Form",
    "summarized_story": "Former President Goodluck Jonathan has rejected the presidential form of the All Progressives Congress purchased for him on Monday by a group of his supporters from the north.\n“We wish to categorically state that Dr Jonathan was not aware of this bid and did not authorise it,” the statement read in part.\n“Buying a presidential aspiration form in the name Dr Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person.\nSporting fez caps with the inscription ‘run Jonathan run’, members of the coalition said the former president is the most qualified person to succeed President Muhammadu Buhari.\nIn rejecting the forms, Dr Jonathan kept his plans close to his chest."
  },
  {
    "headline": "Reps Secure 6m Litres Of Aviation Fuel For Airlines, Seek Permanent Solution",
    "summarized_story": "The House of Representatives on Monday secured the cooperation of the Nigerian National Petroleum Corporation (NNPC) to make available six million litres of JetA1 (aviation fuel) to aviation fuel marketers chosen by the Airlines Operators of Nigeria (AON).\nREAD ALSO: Airline Operators Suspend Withdrawal Of Services Hours To DeadlineThe AON had threatened to shutdown local airline services on Monday but withdrew the threat on Sunday under pressure from the Federal Government.\nThe airline operators say rising cost of key inputs such as aviation fuel necessitated the intended shutdown.\nThe CBN governor, Godwin Emefiele, who eventually walked into the meeting abput 15 minutes later, gave reasons why he had to be represented before his eventual arrival.\nIn his remarks, Speaker Gbajabiamila said the nation was at a crucial moment as the shutdown by the airline operators amounts to a potential shutting down of the country."
  },
  {
    "headline": "Over 51,000 Repentant Terrorists, Families In Custody – Military",
    "summarized_story": "﻿No fewer than 51,000 repentant terrorists and their families have surrendered to troops serving in various theatres of operation in the North East, the military has said.\nREAD ALSO: UN Chief Visits Borno IDPs, Says Reintegrating Repentant Terrorists Critical For Peace“We get information as quickly as things are happening,” the commander said.\n“What goes on here now is that as soon as any of them is willing to surrender, he reports straight to the closest military location.\nSo, we want to assure members of the communities that they are well secured and that they (repentant terrorists) will not pose any threat to anybody.\nMusa, who revealed that the population of repentant terrorists and their families in the military’s custody was recorded in less than a year, gave an insight into what could have prompted the decision to surrender at this time."
  },
  {
    "headline": "Court Refuses Emefiele’s Request To Restrain INEC, AGF Over Presidential Ambition",
    "summarized_story": "A Federal High Court in Abuja has refused the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele’s request to restrain the Independent National Electoral Commission (INEC), and the Attorney General of the Federation (AGF) Abubakar Malami preventing him from his Presidential Ambition.\nThe CBN Governor on Monday told the Court in Abuja that he can run for the post of the President of the Federal Republic of Nigeria without vacating his position as the CBN Governor.\nThe court in its ruling, however, refused the request and the Judge ordered him (CBN Governor) to put the defendants- INEC and AGF- on notice and also serve court processes on them.\nThe Judge also ordered the defendants to appear before him on May 12 to show cause why the CBN Governor’s request should not be granted.\nEmefiele had asked the court to declare him qualified to contest for the presidential post."
  },
  {
    "headline": "Bamise Ayanwola’s Murder: First Prosecution Witness Testifies, Says BRT Driver Raped Her",
    "summarized_story": "The trial of a Bus Rapid Transit (BRT) driver, Andrew Nice Ominnikoron, has begun at a Lagos High Court sitting at Tafawa Balewa Square, with the testimony of the first prosecution witness, Nneka Maryjane Odezulu.\nThe prosecution swiftly called its first witness, Odezulu who proceeded to narrate to the court how the defendant raped her after tearing her clothes.\nShe said that on November, 25, 2021, after closing from work, around 8pm, which is the time she normally closes, she stood at Alesh Hotel Bus Stop, Ajah, where she saw the BRT bus parked.\nShe said that she approached the driver (the defendant) and asked him if he was going to get to her bus stop in the Jakande area of Lekki.\nHe said I told him that I was going to Jakande that he will drop me at my bus stop."
  },
  {
    "headline": "Delegates recieve Atiku in Ondo, Former VP promises Change -",
    "summarized_story": "The former vice President said it is sad that students have been at home for more than three months.\nHe won the last delegates election to emerge as the Presidential Candidate of the Peoples Democratic Party in 2019.\nAlhaji Atiku Abubakar was Vice President to President Olusegun Obasanjo between 1999-2007 under the Peoples Democratic Party under the administration of Former President Olusegun Obasanjo.\nHe was originally elected Governor of Adamawa State before his nomination as Vice Presidential Candidate by Chief Olusegun Obasanjo in 1999.\nAlhaji Atiku was the Leader of the reputed Strongest Political Group of the over 34 that formed the Peoples Democratic Party, the Peoples Democratic Movement."
  },
  {
    "headline": "Ex-lawmaker, Akindele Adeniyi picks nomination form for Ondo Assembly -",
    "summarized_story": "A former member of the Ondo State House of Assembly, Hon Akindele Adeniyi has obtained nomination and expression of interest forms to represent the people of Akure North state constituency again.\nAdeniyi while addressing his supporters after purchasing the forms at the party secretariat, said he is in the race to bring meaningful development to his people.\nHe expressed optimism that the party leadership would provide a level playing field for all the aspirants in the party.\nAdeniyi who is a former vice chairman in Akure North local government, said he would use his experience in the legislative arm to ensure that Akure North is well represented.\nHis words, ” I am optimistic that our party will provide a level playing field for all of us."
  },
  {
    "headline": "Governor Matawalle, Former Governor Yari, reconcile in Zamfara -",
    "summarized_story": "We have every reason to thank God and believe that the 2023 General Election in Zamfara State is a given for the APC.\nWe thank Mr. President for intervening in the Zamfara crisis and the Governor of Kebbi State who everyday asks me, ‘please go and reconcile with your brother’.\nFor the record, Abdul’aziz doesnt have a second person like me in Zamfara State, he is my friend.\n“We thank God that today we are together and I know many people will not believe.\nImmediate-past Zamfara Governor, Abdulaziz Abubakar Yari:“The closest organs are the teeth and tongue and sometimes they disagree, sometimes they agree."
  },
  {
    "headline": "President of the Senate, Ahmad Lawan, joins APC Presidential Race -",
    "summarized_story": "The President of the Senate Ahmed Lawan is the latest entrant into the race to clinch the presidential ticket of the All Progressives Congress.\nThe 100 million naira nomination and expression of interest forms was purchased on behalf of the Yobe senator by a group of friends led by Sam Nkire who is a member of the national caucus of the party and 15 senators.\nThe presentation of the forms to Senator Ahmed Lawan will put an end to weeks of speculations about his intention to contest the presidential primary of the APC.\nAhmed Lawan has now joined the list of other senators interested in taking a shot at the office of the president in next year’s general election.\nAlready Senator Rochas Okorocha from Imo State, Senator Ibikunle Amosun from Ogun State and Senator Ajayi Borrofice from Ondo state have all expressed their interest to contest for the presidential ticket of the APC."
  },
  {
    "headline": "Nigeria: Group Buys APC Presidential Forms for Ex-President Jonathan",
    "summarized_story": "Former Nigerian President Goodluck Jonathan may be seeking a return to office in 2023 after nomination forms to contest the APC presidential primaries were bought on his behalf by a Northern group.\nThis means that Jonathan may have joined the ruling All Progressives Congress (APC) that defeated him in 2015 after five years in power.\nA group of pastoralists and Almajiris led by Ibrahim Abdullahi picked the expression of interest and nomination forms for the former President.\nThe supporters’ group bought the nomination form on his behalf on Monday, continuing the trend of aspirants using proxies to purchase the form.\nNigeria’s main political parties are expected to hold their primaries later this month to meet the election commission’s dateline of June 3 for the submission of their candidates for the February 2023 election."
  },
  {
    "headline": "Nigeria: FG Says Airlines Agreeing to Constrict Supply is Illegal",
    "summarized_story": "Babatunde Irukera, Executive Vice Chairman and CEO, Federal Competition and Consumer Protection Commission, FCCPC, in an interview with ARISE News, speaks against the aviation sector’s collusion to constrain supply in a bid to protest the hike in jet fuel which is illegal.\nRecall that the Airlines Operators of Nigeria (AON) notified the Federal Government and the general public of its plan to shut down all scheduled services indefinitely effective next Monday, May 9, over unbearable cost of aviation fuel that currently sells at N700 per litre.\nPresident of the AON, Abdulmunaf Yunusa, in an endorsed circular noted that government’s earlier intervention in the aviation fuel crisis had failed to forestall imminent shutdown, with Jet-A1 scaling the N500/litre benchmark to N700.\nYunusa added that no airline could survive with the astronomical increase in aviation fuel and high cost of operations, yet continue to offer subsidised airfares to the travelling public.\nIn light of the aforementioned, Executive Vice Chairman and CEO, Federal Competition and Consumer Protection Commission, FCCPC,Babatunde Irukera, while sympathetic on the plight of the sector, says it’s a violation of competition laws for businesses to come together and agree to Constrict supply, irrespective of circumstance and that is what the FCCPC will check."
  },
  {
    "headline": "Without Stability and Security, Nigeria is Going Nowhere – Robert Clarke",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Court Summons AGF, INEC over Emefiele’s Application for a Restraining Order Ahead of 2023 Elections",
    "summarized_story": "Emefiele had through his counsel, Mike Ozekhome SAN applied for an order of status quo ante bellum to be made against INEC and AGF so that he would not be made to resign from office until 30 days to the general election.\nIn an ex-parte application argued on Monday, Emefiele denied being a political appointee but a public servant not caught by section 84 (12) of the new Electoral Act 2022.\nThe CBN governor asked the court to invoke section 318 of the 1999 Constitution to bar the defendents from asking him to vacate office until 30 days to the February 2023 presidential election.\nHowever in a brief ruling, Justice Ahmed Ramat Mohammed refused to grant the order but instead, ordered Emefiele to put the defendants on notice and also serve court processes on the defendants.\nJustice Mohammed ordered the defendants to appear before him on May 12 and show cause why the request should not be granted."
  },
  {
    "headline": "Controversy Over Emefiele’s Presidential Bid & AFDB President’s Alleged Ambition -Trending With Ojy Okpe",
    "summarized_story": "The Central Bank Of Nigeria Governor, Godwin Emefiele was trending over the weekend, after posting a series of tweets stating that he was humbled by calls for him to run to succeed President Muhammadu Buhari.\nHe denied that he has decided to run for President.\nIn response to the backlash, some Nigerians have accused those against the CBN Governor’s supposed presidential aspiration of double standards for keeping mum after a coalition of 28 groups obtained the N100 million APC presidential forms for the President of the African Development Bank Akinwumi Adesina.\nIn another development, the Independent National Electoral Commission on Sunday dismissed a claim its chairman Mahmood Yakubu, may join the race for president, following Godwin Emefiele’s alleged presidential ambition.\nFinally, a video that has now gone viral on social media shows the moment a customs officer slapped an aide to the Delta State Governor Ifeanyi Okowa."
  }
]