[
  {
    "headline": "Vagina can be surgically-constructed for females born without one –Physician",
    "summarized_story": "Amarachi OkehAn expert says that a female individual who is born without a vagina can have one surgically constructed for her.\nAccording to US-based Centre for Congenital Anomalies of the Reproductive Tract, vaginal agenesis affects one out of 5,000 to 7,000 female infants.\nSometimes, vaginal agenesis is recognised at birth.\n“All [affected] females will either have an absent vagina or an incomplete vaginal canal,” it said.\n“Approximately 12 percent of girls with vaginal agenesis have skeletal abnormalities."
  },
  {
    "headline": "Vagina can be surgically-constructed for females born without one –Physician",
    "summarized_story": "Amarachi OkehAn expert says that a female individual who is born without a vagina can have one surgically constructed for her.\nAccording to US-based Centre for Congenital Anomalies of the Reproductive Tract, vaginal agenesis affects one out of 5,000 to 7,000 female infants.\nSometimes, vaginal agenesis is recognised at birth.\n“All [affected] females will either have an absent vagina or an incomplete vaginal canal,” it said.\n“Approximately 12 percent of girls with vaginal agenesis have skeletal abnormalities."
  },
  {
    "headline": "40 new COVID-19 cases reported across three states, no death",
    "summarized_story": "The Nigeria Centre for Disease Control registered 40 new COVID-19 cases as of July 2, 2021, with no related death in the daily infection chart.\nThe News Agency Of Nigeria reports that the new infections indicate a decline from the 74 cases recorded a day earlier.\nThe public health agency noted that the new coronavirus cases were in three states, which brought the country’s total infections to 167,732.\nThe NCDC added that there was no new death from the disease on Friday, meaning that the total fatality toll remained 2,121.\nIt stated that Lagos State led in Friday’s infection tally with 36 new cases, followed by Rivers with two cases."
  },
  {
    "headline": "40 new COVID-19 cases reported across three states, no death",
    "summarized_story": "The Nigeria Centre for Disease Control registered 40 new COVID-19 cases as of July 2, 2021, with no related death in the daily infection chart.\nThe News Agency Of Nigeria reports that the new infections indicate a decline from the 74 cases recorded a day earlier.\nThe public health agency noted that the new coronavirus cases were in three states, which brought the country’s total infections to 167,732.\nThe NCDC added that there was no new death from the disease on Friday, meaning that the total fatality toll remained 2,121.\nIt stated that Lagos State led in Friday’s infection tally with 36 new cases, followed by Rivers with two cases."
  },
  {
    "headline": "(BREAKING) Yoruba nation rally: Stray bullet kills girl at Ojota (VIDEO)",
    "summarized_story": "One person has been confirmed dead by police stray bullet at the Yoruba nation rally, Ojota, Lagos.\nThe protest, which started with singing and chanting, got rowdy as members of the police force engage in sporadic gunshots and teargas shots.\nThe lifeless body of the unknown girl was crowded by sympathisers at the scene.\nVanguard News Nigeria"
  },
  {
    "headline": "[VIDEO] NO GOING BACK: Yoruba nation agitators chant, as rally gathers momentum at Gani Fawehinmi Park",
    "summarized_story": "It is happening.\nYoruba nation agitators have gathered at Gani Fawehinmi Park in their numbers, singing and chanting freedom song.\nVanguard News Nigeria"
  },
  {
    "headline": "Ijaw youths commend NASS on passage of PIB, rue 3% equity share to host communities",
    "summarized_story": "By Emem Idio – YenagoaIJAW youths under the umbrella of Ijaw Youths Council ,IYC, Worldwide have commended the National Assembly for passing the Petroleum Industrial Bill (PIB), this is just as they rued the ceding of only three percent equity shareholding to the oil and gas producing communities.\nThe IYC president, however, rued a provision of the passed bill that allocated only three per cent profit from oil companies to host communities.\nALSO READ: PIB: Niger Delta leaders, stakeholders differHe said: “This is grossly inadequate.\nPrior to the passage, many stakeholders appealed to the National Assembly to allocate five per cent profit to the host communities.\nHe further appealed to President Muhammadu Buhari to insist on five per cent profit to host communities before signing the bill into law."
  },
  {
    "headline": "AUDIO: Sunday Igboho debunks arrest rumour",
    "summarized_story": "Sunday Igboho has debunked late night rumour on Friday stating that he was arrest at Sat Guru Maharaji area.\nIn the short viral audio message, he thanked his supporters and affirmed that he was “not arrested at Guru, I am in my house in Ibadan.”Vanguard News Nigeria"
  },
  {
    "headline": "PHOTOS: It’s police affair at Allen Avenue as Yoruba Nation rally talks fade",
    "summarized_story": "By Bunmi AzeezJust like Gani Fawehinmi Park, Ojota, another protest flashpoint, Allen Avenue Roundabout, was as peaceful as it can be as road users go about their normal businesses under police watch.\nNo presence of demonstrators have been sighted in major parts of Lagos as at press time.\nVanguard News Nigeria"
  },
  {
    "headline": "ESN commander makes shocking revelations about Kanu, attacks",
    "summarized_story": "Onye Army also said he is happy that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has been arrested while begging the Buhari government for amnesty.\n“…We were not talking to Nnamdi Kanu directly, but we were receiving his instructions from our camp leaders,” Vanguard quoted him as saying.\n“Nnamdi Kanu said we should dismantle all checkpoints and even kill the security agents manning the checkpoints because they were killing Igbo people.\nI believed him and obeyed the order because I had taken an oath to obey Nnamdi Kanu, the supreme leader of IPOB.\nHe had insisted that the ESN was created to defend the South East and South South from killer Fulani herdsmen who attack communities, kill their hosts and destroy farm lands ."
  },
  {
    "headline": "Kaduna: Jubilation as 15 Atyap leaders get bail after three months in detention",
    "summarized_story": "The Atyap community in Kaduna held a grand reception in honour of the 15 leaders granted bail after three months in police custody.\nThe leaders were granted bail on Thursday after the case was mentioned at the Magistrate Court No.\nAccording to the First Information Report (FIR), the 15 Atyap leaders and elders, among them an 84-year-old, were being charged on accusations of criminal breach of trust, negligence and mischief by killing cattle.\nMeanwhile, in gratitude to God Almighty, the Atyap community staged a grand reception to welcome the leaders for going through the tough times for three months without bail.\nThe Representative of the Atyap Chiefdom in Kaduna, Mr. Simon Achi, who spoke at the event, said the leaders went through the excruciating pains for no cause of theirs."
  },
  {
    "headline": "BREAKING: Police disperse Yoruba Nation protesters with tear gas, water cannon in Lagos",
    "summarized_story": "Security operatives have dispersed Yoruba Nation protesters who gathered at the Gani Fawehinmi Park in Ojota, Lagos.\nThe protesters stormed the venue in their numbers as the Commissioner of Police, CP Hakeem Odumosu, was addressing journalists.\nHowever, immediately after Odumosu left, the police cannon trucks sprayed water on the protesters.\nThey also fired tear gas at the crowd.\nThe protesters, who fled the scene in different directions, regrouped at the bridge also at Ojota."
  },
  {
    "headline": "Yoruba Nation protesters plan to forcefully reopen Seme border – Lagos CP",
    "summarized_story": "The Lagos State Commissioner of Police, Hakeem Odumosu, has said the police in the state are aware of plans by Yoruba nation agitators to forcefully reopen Seme border.\nSeme, an international border with Benin Republic, is in the Badagry area of Lagos.\nThe once ever-busy Seme has remained without activities since 2019 when the Federal Government ordered the closure of land borders.\nAddressing newsmen on Saturday, Odumosu said one of the missions of the Yoruba Nation rally scheduled to hold in Lagos today was to “forcefully reopen Seme border like they did in Idiroko recently.”According to Odumosu, the government would not allow another protest that would bring fresh destruction to Lagos State.\nOn May 29, some Yoruba Nation agitators stormed Idiroko in Ipokia Local Government Area of Ogun State to forcefully reopen the international border."
  },
  {
    "headline": "Rivers civil servants reject new contributory healthcare law",
    "summarized_story": "The Rivers State Council of the Nigeria Civil Service Union has rejected the contributory Healthcare Protection bill recently signed into law by Governor Nyesom Wike.\nThe contributory Health Protection Programme law provides a platform for residents and people of the state who want health insurance to participate in the health scheme.\nBut in an interview with DAILYPOST the state chairman of the civil service union, Comrade Chuks Osummah,announced his union’s rejection of the law.\nIn his words “Vehemently the Nigerian Civil Service Union rejected the bill due to the failure of other contributory schemes even before this administration.\nSo if they have gone ahead to sign the contributory health insurance bill I stand to tell you that you Nigeria Civil service Union is not part of it”."
  },
  {
    "headline": "BREAKING: Protests turn rowdy as Yoruba traditionalists storm venue",
    "summarized_story": "By Alao Abiodun and Oamen SamuelThe Yoruba Nation rally in Lagos has turned rowdy as traditionalists dressed in their white attire stormed the venue of the protest.\nThe traditionalists accompanied by other Protesters chanted “Oduduwa Nation now”, “Yoruba Nation Now”ADVERTISEMENTSecurity Operatives teargassed the protesters but the defiant protesters have refused to back down.\nThe traditionalists while speaking to police men urged them to protect them rather than teargass them."
  },
  {
    "headline": "BREAKING: Police disperse Yoruba Nation protesters",
    "summarized_story": "By Alao Abiodun and Oamen SamuelSecurity operatives have dispersed Yourba Nation protesters at Gani Fawehinmi Park, venue of their mega rally.\nThe Nation had reported the protesters stormed the venue in their numbers when Commissioner of Police, CP Hakeem Odumosu was addressing journalists.\nADVERTISEMENTImmediately after Odumosu left, the Police cannon trucks sprayed water on the protesters.\nThey were also tear-gassed at the venue.\nThe protesters, who fled the scene at different directions, went to regroup at the bridge also at Ojota."
  },
  {
    "headline": "JUST IN: Yoruba Nation protesters storm Lagos rally, chant solidarity songs",
    "summarized_story": "By Alao Abiodun and Oamen SamuelYoruba Nation protesters have shown up at the Gani Fawehinmi Park in Ojota, Lagos, The Nation reports.\nThe protesters gathered at the Ojota venue in their numbers when the Commissioner of Police, Lagos State Police Command, CP Hakeem Odumosu was addressing journalists.\nThe protesters lamented the rising insecurity in the southwest, they also decried the attack on Sunday Igboho’s residence.\nADVERTISEMENTWhile raising flags, sharing fliers on the Yoruba Nation, they also chanted “Yoruba Nation Now, No going back”, “Igboho Oosa”, “No retreat, No surrender”Odumosu while addressing Journalists, stated that protesters have the right to protest, but it is not the right time to protest due to the destruction that followed the last #EndSARS protests."
  },
  {
    "headline": "Delta South APC leaders attributes ‘marginalisation’ to disunity",
    "summarized_story": "By Elo Edremoda, WarriLeaders of the All Progressives Congress (APC) in Delta South Senatorial district have attributed perceived marginalisation of the area and its people in development and appointments to disunity.\nADVERTISEMENTSome leaders of the party in the district present are Dr. Alex Ideh, Prof. Bello Orubebe, Ologbotsere of Warri, Chief Ayirimi Emami and the Delta South APC chairman, Tosan Awani.\nHe added that Delta South has been “optimally marginalised” because they “have not shown some kind of binding as a people”.\n“We demand that the chairmanship of the party in the state should be retained in Delta South Senatorial district in the forthcoming state Congress in the interest of equity, fairness and justice.\n“That the three Is of Delta South area constitutes the oil producing area of Delta state."
  },
  {
    "headline": "I withdrew my children from public school because of kidnap threat – El-Rufai",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaKaduna State Governor, Nasir El-Rufai has finally opened up on why temporarily withdrawn his son, Abubakar-Sadiq from Kaduna Capital School, a public school where he was enrolled in 2019.\nHe however said that, the two children who are currently on homeschooling and only going to Capital School to write exams, will return to the fully when security improves.\nAccording to him, “my son and also my daughter are registered in the school, because his (Abubakar-Sadiq) sister also clocked six and we registered her in the school.\nBut we had to temporarily withdraw them for the security of the school because we received a security report that three groups were planning to attack the school and kidnap my son.\n“I don’t think they (kidnappers) would have succeeded because there are enough security in the school to prevent them, but it would expose other pupils of the school to danger."
  },
  {
    "headline": "HAPPENING NOW! Police swoop on Oduduwa Nation agitators",
    "summarized_story": "Security agents have chased away agitators for Yoruba nation who have converge on Ojota in Lagos, for the Lagos mega rally.\nWitnesses told sunnewsonline.com that the agitators comprised Yoruba women and men in white attires, were chased away by personnel of Nigeria Police.\nThe witness said security agents teargassed the agitator in an apparent move to disperse them.\nDetails soon…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Yoruba nation Lagos rally: Yoruba women leading men to Ojota",
    "summarized_story": "From Oluseye Ojo, IbadanThe stage is now set for the commencement of the Yoruba nation mega rally scheduled to hold in Ojota, Lagos, today.\nThe heavy presence of security agencies has not deterred members of the self-determination groups from proceeding with the rally as planned.\nThe latest information from Ilana Omo Oodua (IOO) is that Yoruba women, who are already dressed in white special attires, would be on the front rows, and they would be followed from behind by Yoruba men.\nA source at the venue said: “Our Yoruba women are now leading our men to the Ojota, Lagos venue of the Yoruba Nation Rally.\nNo retreat, no surrender.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Cattle grazing routes: The real story",
    "summarized_story": "There were cattle routes and grazing areas.\nIt was not the first time that the grey issue of cattle grazing routes would seize the momentum in the country, or generate a national furore.\nAccording to the Grazing Reserves Law of 1965, Nigeria has 415 grazing reserves but only about one third of it is functional.\nHe adds that grazing reserves recognized as a state law in the 1999 constitution criminalized open grazing.\nCattle routes reopening in top gearFollowing President Buhari’s directive to reopen the grazing routes, a rash of activities has seized the Ministry of Agriculture and Rural Development and the Ministry of Justice."
  },
  {
    "headline": "I don’t know whether to get married or remain single –Amara Maduka",
    "summarized_story": "She doesn’t know whether to get married or remain single.\nBut then, once she makes up her mind to walk down the aisle, she would rather go for a man clean enough to lick anytime she wants.\n“I like ambitious men.\nI’m very ambitious and I don’t like men who settle for little.\nBut I’m not a hypocrite nor do I pretend because most of these men really live in hell courtesy of their wives."
  },
  {
    "headline": "Nnamdi Kanu: IPOB, family raise fresh alarm",
    "summarized_story": "Meanwhile, the family has raised the alarm that the Federal Government is fabricating lies against the IPOB leader.\nNnamdi Kanu must not die in custody.\nHe remarked: “The FG said they re-arrested Nnamdi Kanu somewhere in East Africa.\nNow, if Nnamdi Kanu is seen with a woman, is that supposed to be an issue?\nHe said: “The question remains: what facts do you have to support your allegation that Nnamdi Kanu travelled to buy arms?"
  },
  {
    "headline": "Shettima Calls for Power Shift to South, Insists on Rotation",
    "summarized_story": "•Maintians there was a gentleman agreement on rotation in APCMichael Olugbode in AbujaFormer Borno State Governor, Senator Kashim Shettima has thrown his weight behind the call for power shift to Southern Nigeria in 2023.\nShettima, who is now a Senator representing Borno Central, made the call for a power shift in Abuja yesterday at the public presentation of a book titled: “Standing for the Truth with Courage”.\nHe stressed: “After power has resided in the North for eight years, the minimum is that there should be a power shift to the South for equity and justice.\n“There’s a gentleman agreement in the APC at its formative stage for power to rotate between the North and the South.\n“The minimum is for a power shift to Southern Nigeria, unless the advocates of power retention have a hidden agenda for the dismemberment of the nation."
  },
  {
    "headline": "Masari: Nigeria Battling with Worst Form of Insecurity",
    "summarized_story": "Francis Sardauna in KatsinaThe Katsina State Governor, Aminu Bello Masari, yesterday lamented the spate of banditry and other nefarious activities afflicting the country, saying the nation is battling with the worst form of insecurity.\nMasari, who spoke in Katsina, during the commissioning and handing over of Kafur Islamic Centre, urged the warring parties to sheathe their swords and work together to avert bloodletting bedeviling the country and for peace and development to thrive.\nHe said: “We are battling with the worse form of insecurity, what brought it?\n; People who were living peacefully before as neighbours and friends, attending the same market, weddings funerals, and naming ceremonies without any conflict.\n“But today, they are killing themselves, stealing their properties, and raping their wives and children."
  },
  {
    "headline": "Again, Southern Govs Meet, Open Grazing, Restructuring to Top Agenda",
    "summarized_story": "At the last meeting, hosted by Governor Ifeanyi Okowa of Delta State and attended by 15 of the 17 southern governors, they arrived at a 12-point resolution, which included the banning of open grazing in all the states.\nThe source said: “The governors are working towards a better Southern Nigeria within the Nigerian nation.\nThe southern governors will be looking at the gains of the last meeting and come up with their next move.\n“You know the southern governors agreed that the progress of the nation requires that urgent and bold steps be taken towards the restructuring of the Nigerian federation leading to the devolution of power.\nDuring the first meeting in Asaba, the southern governors resolved to ban all forms of open grazing in the southern states of the country."
  },
  {
    "headline": "British Govt Evades THISDAY Enquiry on Fresh Passport Issued to Kanu",
    "summarized_story": "THISDAY, in a series of email exchanges with the British High Commission in Abuja, had requested clarifications on how the IPOB leader obtained fresh British passport.\nAre you saying the British government did not assist Mr. Nnamdi Kanu in procuring a new British passport?\nHow could Kanu have acquired another British travel document in Nigeria without processing it at your High Commission?”Jonathan Bacon of the British High Commission replied saying the question refers explicitly to British High Commission and that his response earlier directly addressed this allegation: “We can confirm that the British High Commission in Nigeria did not issue any travel documents for Mr Kanu.\nInstead of facing the Kenyan High Commission in Nigeria to ask some of these questions, you should face your government.\nInstead of facing the Kenyan High Commission in Nigeria to ask some of these questions, you should face your government."
  },
  {
    "headline": "Marafa: Matawalle’s Defection Violates 2019 S’Court Judgement",
    "summarized_story": "Justifying his opposition to Matawalle’s defection, Marafa stated: “The judgment made by the Supreme Court said APC ought not to have participated in the 2019 election.\nNow, I’m asking this question and I want every Nigerian to tell me: Can a man that is non-existent give birth to children?\n“So, any attempt by anybody to say he is the governor of APC, between 2019 and 2023 without reason of death or resignation that could have warranted issues of bye-election, cannot work.\nDoing so is acting against the judgment of the Supreme Court.\nMai Mala Buni, Chairman of its Caretaker Committee doesn’t have the power under the constitution to make such pronouncements,” he said."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "El-Rufai: I withdrew my son from public school because bandits were targeting him",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna state, says he withdrew Abubakar, his son, from a public school because bandits were targeting him for abduction.\nAdvertisementIn September 2019, el-Rufai enrolled Abubakar, who was then six years old, as a primary one pupil of Kaduna Capital school.\nIt was later reported that el-Rufai withdrew his son from the school earlier in the year.\n“My son and my daughter are registered in the school because his sister became six and we had to register her,” el-Rufai said.\nHe added that his son will, however, take his examinations at Kaduna Capital school."
  },
  {
    "headline": "El-Rufai: I withdrew my son from public school because bandits were targeting him",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna state, says he withdrew Abubakar, his son, from a public school because bandits were targeting him for abduction.\nAdvertisementIn September 2019, el-Rufai enrolled Abubakar, who was then six years old, as a primary one pupil of Kaduna Capital school.\nIt was later reported that el-Rufai withdrew his son from the school earlier in the year.\n“My son and my daughter are registered in the school because his sister became six and we had to register her,” el-Rufai said.\nHe added that his son will, however, take his examinations at Kaduna Capital school."
  },
  {
    "headline": "Gunshots, teargas as police disperse Yoruba nation agitators in Lagos",
    "summarized_story": "The police shot into the air and fired teargas as they tried to disperse a crowd of agitators who converged on Ojota area of Lagos for a ‘Yoruba nation’ protest on Saturday.\nAdvertisementThe police also unleashed water cannon on the protesters who were over 50 in number.\nThe agitators held placards, demanding an independent state for the south-west region.\n”No going back; Yoruba nation now,” they shouted.\nSecurity operatives had surrounded Gani Fawehinmi Park, the venue of the protest, to forestall a breakdown of order."
  },
  {
    "headline": "Gunshots, teargas as police disperse Yoruba nation agitators in Lagos",
    "summarized_story": "The police shot into the air and fired teargas as they tried to disperse a crowd of agitators who converged on Ojota area of Lagos for a ‘Yoruba nation’ protest on Saturday.\nAdvertisementThe police also unleashed water cannon on the protesters who were over 50 in number.\nThe agitators held placards, demanding an independent state for the south-west region.\n”No going back; Yoruba nation now,” they shouted.\nSecurity operatives had surrounded Gani Fawehinmi Park, the venue of the protest, to forestall a breakdown of order."
  },
  {
    "headline": "PHOTOS: Army, police take over venue for Yoruba nation rally (updated)",
    "summarized_story": "Security operatives have barricaded Gani Fawehimi Park in Ojota area of Lagos state, the venue for the ‘Yoruba nation’ rally.\nAdvertisement‘Yoruba Nation’ agitators under the aegis of Ilana Omo Oodua said the protest will take place on Saturday despite Thursday’s attack on the home of Sunday Igboho, a youth leader, in Ibadan, Oyo state capital.\nOn Saturday, security operatives including members of the Lagos state police command, the Nigerian Army, and Lagos State Neighborhood Security Council arrived at the protest venue hours before 9:00am — the time the protest was scheduled to commence.\nHakeem Odumosu, the state commissioner of police, arrived at the venue but left shortly without addressing the media.\nAdvertisementHere are some photos:AdvertisementAdvertisementAdvertisementPhotos by Ibrahim Mansur/TheCable"
  },
  {
    "headline": "TeamApt closes undisclosed Series B round to extend its banking services across Africa",
    "summarized_story": "Nigeria-based TeamApt, which offers agent banking services with plans to roll out consumer-focused digital banking features, has raised an undisclosed sum in a Series B round.\nTeamApt’s pivotal business at the moment is Moniepoint, a software solution that powers agent banking in Nigeria.\nBut the agent banking space is thought to include Firstmonie, Paga and OPay, the Opera-backed fintech.\nIn March 2021, TeamApt said it processed over ₦1trillion ($2.4 bn) for the first time.\nWhile Moniepoint will continue to power agent banking, TeamApt plans to build a consumer app side of it for individuals as a digital bank."
  },
  {
    "headline": "Fair Money raises $42 million as it evolves into a digital bank",
    "summarized_story": "It was led by Tiger Global Management with existing investors like DST Partners, Flourish Ventures, Newfund, and Speedinvest participating.\nThe investment comes after FairMoney raised $11 million Series A two years ago and $16 million in total within its first four years.\nFor Tiger Global which led the round, this is its fourth investment in an African startup after iRoko (2013), Takealot (2014) and Flutterwave (2021).\nFrom having a little over 100,000 users in its first year of operation, FairMoney has grown to have 1.3 million unique users who have made more than 6.5 million loan applications.\nFairMoney is not alone in its ambitions to dominate the Neobank scene in Nigeria, Kuda in March raised $25 million."
  },
  {
    "headline": "Faith Keza is leading Irembo to fully digitise Rwanda",
    "summarized_story": "And steering the Irembo ship is Faith Keza.\nFaith is also on the board of the Rwanda National Bank and the Rwanda Development Board.\nSo no, I don’t have great memories.”After a semester at MIT, Faith realized her maths major wasn’t for her.\nBut a lot of plans were stalled and so Faith decided to return on her own to Rwanda and while there, she joined Irembo as CTO.\nWith Faith Keza, Irembo could be at the front of that movement."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Kenyan eCommerce startup, Copia Global, expands to Uganda",
    "summarized_story": "Kenyan eCommerce startup, Copia Global, has announced the expansion of its services to Uganda.\nHaving established its presence in the Kenyan market, where it claims to serve over one million customers, the startup has its sights on Uganda’s growing middle class.\nCopia Global operates a different model from most eCommerce platforms.\nAfter placing their order, the agent sends it to Copia Global, who processes and delivers it within two days when the customer returns to pick it up.\nThis way, they can order goods and have them delivered to people living in rural communities where Copia Global has agents."
  },
  {
    "headline": "Nigerian cleantech startup, OneWattSolar, issues ₦10b bond to deploy solar energy across sub-Saharan Africa",
    "summarized_story": "Announced July 1, 2021, the Green Bond Issuance programme, includes a seven-year Green Sukuk issue of ₦1 billion ($2.4 million).\nThe bond issuance was led by Comercio Partners, Lagos-based investment bank and supported by Nigerian Shari’ah complaint fund manager, Marble Capital Limited.\nInterestingly, this is the first Corporate Green Sukuk in Africa and the first Corporate Green Bond for an off-grid renewable energy project.\nAdeojo says OWS is setting a standard for corporate organisations hoping to get to issue a Green Sukuk Bond.\nThe vision of the renewable energy company is to deploy 14,000 megawatts of off-grid renewable energy across sub-Saharan Africa to decarbonise the region’s energy sector."
  },
  {
    "headline": "There’s no such thing as a bad investment – TEN13’s Stewart Glynn talks startup funding",
    "summarized_story": "However, angel investors and venture capitalists are a similarly courageous group of individuals who are seldom celebrated.\nFor this week’s edition, I talked to Stewart Glynn, a Partner at TEN13, an Australian venture capital firm.\nIn December 2019, after wondering how to institutionalise their investments, Baxter and Glynn decided to start TEN13.\nOn bad investments and common mistakes founders makeFor now, Glynn explains that the goal is to fund ten companies every year.\nKnowing this, I asked Glynn how TEN13 deals with investments that do not go according to plan."
  },
  {
    "headline": "Microblogging and the Nigerian State: Matters Arising",
    "summarized_story": "While governments have been accused of muzzling free speech, social media entrepreneurs commit the same offence with less or no public outrage.\nHowever, Nigerians generally believed that the government responded to Twitter’s decision to delete a tweet by the Nigerian President where he was alleged to have threatened violence against a section of the country.\nThe presumption that social media is a socially and politically neutral platform for societal conversation is false.\nIt is this inherent capacity of social media enterprises to sway collective opinion and subtly affect people’s decisions that make social media institutions as dangerous as they are liberating.\nHowever, governments cannot use this as an excuse to plug the mouths and stop the keyboards of subscribers to social media."
  },
  {
    "headline": "Oil region experts, leaders welcome PIB with cautious optimism",
    "summarized_story": "A source said: “Crude is almost gone, oil companies at global level are transforming to energy companies, fossil oil is gone, gas has about a decade to flourish.\nOr do the gas installations in associated oil wells sufficient to define host communities in the PIB?\nWhy are host communities given three per cent and not a minimum of 15 percent?\nIf the desire for stakeholders in the oil industry is to develop the oil and gas host communities, then the host communities must be given the preference and nurtured into full participation in the value generation and resource management in the oil and gas industry.\nThis is the time for collaborative relationship between host communities and oil companies."
  },
  {
    "headline": "Nigerian stocks lag African peers, but some superstars exist",
    "summarized_story": "Read also: International Breweries declares N 136.8bn revenueChampion BreweriesThe Champion breweries share price came next with 144 percent gain.\nThe insurer’s share price began the year at N0.26 and has surged to N0.61 in the review period.\nThe manufacturer of foam products saw its share price rise to N15.4 per share compared to N7.8 per share at the beginning of the year.\nThe insurer’s share price opened the year at N0.32, surging to N0.60 as of 30 June 2021.\nThe insurance company began the year with a share price of N0.27 and surged to N0.43 per share as at June 30th 2021."
  },
  {
    "headline": "Obaseki urges improved collaboration to strengthen Edo healthcare system for quality service delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased collaboration between the government and all stakeholders in the health sector to redesign and strengthen the state’s healthcare system for quality service delivery to the people.\nObaseki, during a stakeholders’ workshop, at the Government House, Benin City, reassured that his government will sustain reforms in the healthcare system to reposition the state as Nigeria’s medical hub.\nAccording to him, “the current healthcare system that we are operating was put in place about 50 years ago by the then Governor of Bendel State, late Dr. Samuel Ogbemudia.\n“We must redesign our healthcare system.\n“Let us all agree that at the end of today’s workshop, we are all going to move our healthcare system forward."
  },
  {
    "headline": "64th birthday: Obaseki appreciates, lauds Nigerians, Edo people for gifts sent to children with special needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has expressed appreciation to the people of Edo State and Nigerians for birthday felicitations and heeding his appeal for donations to the less-privileged and children with special needs.\nThe governor had, in a statement by his Chief of Staff, Hon.\nIyoha Osaigbovo, said he preferred to mark his 64th birthday in a solemn and reflective mood, urging for donations to orphanages for children with special needs in Benin city, the Edo State capital.\nThe governor expressed appreciation to all those who sent him messages of good wishes, noting that he was overwhelmed with the show of love.\n“I thank Nigerians and particularly the people of Edo State for the felicitations and donations which were given to orphanages particularly to children with special needs,” he noted."
  },
  {
    "headline": "Edo Inland Dry Port: Promoter meets stakeholders, prospective port users, seeks improved collaboration – Nigerian Observer",
    "summarized_story": "The Managing Director of AMES-Edo Inland Container Dry Port, Engr.\nStakeholders at the meeting include Okomu Plc, Manufacturers Association of Nigeria (MAN), Rongtai Industry, ESIPO and Zanithcarex Int’l Limited, among others.\n“It will be a customs port, and a lot of activities at the Lagos Port will be done here at Edo State, yielding huge resources for the state and the federal government.\nBut with the Dry Port, no need to go through the Lagos Port but the Edo Dry Port.\n“The Edo State Government is facilitating the Ossiomo-Power to be connected to the Dry Port for 24/7 electricity supply to reduce cost and ensure that end-users and other stakeholders benefit.”..."
  },
  {
    "headline": "Senate Passes The Petroleum Industry Bill, Approves 3% Allocation to Host Communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The 9th Senate, Thursday, passed the much awaited Petroleum Industry Bill (PIB) with the approval of 3% allocation to host communities.\nThe petroleum industry bill that had become the albatross of successive dispensation has now been passed as a bill.\nDuring a clauce by clause consideration of the Bill, there was still unease over the contentious clause regarding profit sharing for the host communities.\nLawmakers from the South-South, agreed that the fund for host communities should be raised from 2.5 percent to 5 per cent, A request that was immediately turned down by other lawmakers forcing the Senate President to follow the majority vote of 3% allocation to host communities.\nHe also thanked all Nigerians for their patience and support to ensuring the smooth passage of the Bill."
  },
  {
    "headline": "Group asks Nigerian farmers to protect crop biodiversity, boycott GMO seeds",
    "summarized_story": "What are GM crops?\nGenetically modified crops (commonly referred to as GM crops) are plants used in agriculture, whose DNA has been modified using genetic engineering methods.\nFood crops for example can be genetically engineered to be resistant to certain pests, diseases, environmental conditions, reduction of spoilage, chemical treatments (e.g.\n“Today we see increasing pressures for the adoption of genetically modified crops in Africa.\nThe ISAAA report noted that Nigeria, Ethiopia, Malawi, South Africa, Sudan and Swaziland are now the African countries where the planting of Genetically Modified (GM) crops thrives."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Timi Frank Condemns DSS Attack On Igboho’s Residence",
    "summarized_story": "He urged Nigerians to brace up for the worst form of persecution, intimidation, arrests and human rights violations that has become the hallmark of the President Muhammadu Buhari regime in the last six years.\nHe also urged Nigerians to speak up against heinous crimes being meted on citizens like Igboho and Nnamdi Kanu by agents of the Federal Government.\nHe said: “The recent attack on Sunday Igboho’s house in Ibadan by agents of an uncaring government is condemnable, abhorrent, sickening, obnoxious and despicable.\n“The regime is not only against Kanu and Igboho but the entire South.\nFrank urged Nigerians and the international community to be wary of the totalitarian posture of the Buhari administration that now tramples on the inalienable rights of citizens with impunity and glee."
  },
  {
    "headline": "Timi Frank Condemns DSS Attack On Igboho’s Residence",
    "summarized_story": "He urged Nigerians to brace up for the worst form of persecution, intimidation, arrests and human rights violations that has become the hallmark of the President Muhammadu Buhari regime in the last six years.\nHe also urged Nigerians to speak up against heinous crimes being meted on citizens like Igboho and Nnamdi Kanu by agents of the Federal Government.\nHe said: “The recent attack on Sunday Igboho’s house in Ibadan by agents of an uncaring government is condemnable, abhorrent, sickening, obnoxious and despicable.\n“The regime is not only against Kanu and Igboho but the entire South.\nFrank urged Nigerians and the international community to be wary of the totalitarian posture of the Buhari administration that now tramples on the inalienable rights of citizens with impunity and glee."
  },
  {
    "headline": "2021 Access Bank Group CEO Awards Reward Excellence",
    "summarized_story": "The 2021 Access Bank Group CEO Awards held recently to reward individuals who have showed commitment and hard work towards the growth of the Bank.\nThe virtual event themed ‘Building Global Leadership’ provided a platform to celebrate outstanding performance and drive the Bank’s ‘One People, One Culture’ ideology across the Group.\nWith footprints in affiliates spanning the African continent and beyond, the Bank is truly aspiring to becoming Africa’s Gateway to the World by showcasing diversity through its African subsidiaries on a global stage.\nThe CEO Awards, one of the programs under the Bank’s ‘We Clap Initiative’, was designed to support the development of a culture of excellence and motivate employees and teams for superior performance across the Bank.\nWinners were assessed based on their accomplishments, reputation and ability to demonstrate commitment by aligning with the core values of the Bank."
  },
  {
    "headline": "2021 Access Bank Group CEO Awards Reward Excellence",
    "summarized_story": "The 2021 Access Bank Group CEO Awards held recently to reward individuals who have showed commitment and hard work towards the growth of the Bank.\nThe virtual event themed ‘Building Global Leadership’ provided a platform to celebrate outstanding performance and drive the Bank’s ‘One People, One Culture’ ideology across the Group.\nWith footprints in affiliates spanning the African continent and beyond, the Bank is truly aspiring to becoming Africa’s Gateway to the World by showcasing diversity through its African subsidiaries on a global stage.\nThe CEO Awards, one of the programs under the Bank’s ‘We Clap Initiative’, was designed to support the development of a culture of excellence and motivate employees and teams for superior performance across the Bank.\nWinners were assessed based on their accomplishments, reputation and ability to demonstrate commitment by aligning with the core values of the Bank."
  },
  {
    "headline": "Amaechi Seeks Severe Punishment For Rail Vandals",
    "summarized_story": "Following an increase in the vandalism of railway facilities in the country,Minister of Transportation, Rotimi Amaechi, has recommended a charge of manslaughter for the perpetrators.\nHe lamented that railway clips are frequently stolen, causing the country huge amounts of hard currency to replace.\nThe moment it wants to stop, the driver will apply break here and it will take 800 metres to stop.\nBut they move from stealing narrow gauge from Port Harcourt to Maiduguri to stealing narrow gauge from Lagos to Kano.\n“But when they now move to Itakpe-Warri, which is now standard gauge, brand new tracks, then it becomes very dangerous."
  },
  {
    "headline": "Euro 2020: Italy to face Spain in semi-finals",
    "summarized_story": "Italy beat Belgium 2-1 in a pulsating Euro 2020 quarter-final in Munich on Friday to set up a last-four clash with Spain, who needed penalties to get the better of 10-man Switzerland.\nLorenzo Insigne’s brilliant strike proved to be the winner for Italy, who extended their national record unbeaten run to 32 matches.\nRoberto Mancini’s men will face Spain in the first semi-final on Tuesday at Wembley.\nThe players were extraordinary,” Italy coach Mancini told Rai.\n“It is clear that we suffered in the last 10 minutes because we were tired."
  },
  {
    "headline": "Euro 2020: Italy to face Spain in semi-finals",
    "summarized_story": "Italy beat Belgium 2-1 in a pulsating Euro 2020 quarter-final in Munich on Friday to set up a last-four clash with Spain, who needed penalties to get the better of 10-man Switzerland.\nLorenzo Insigne’s brilliant strike proved to be the winner for Italy, who extended their national record unbeaten run to 32 matches.\nRoberto Mancini’s men will face Spain in the first semi-final on Tuesday at Wembley.\nThe players were extraordinary,” Italy coach Mancini told Rai.\n“It is clear that we suffered in the last 10 minutes because we were tired."
  },
  {
    "headline": "Weeping as gunmen kill six in Plateau community",
    "summarized_story": "Gunmen have killed six persons suspected to be herdsmen in Chol community in the Jos South Local Government Area of Plateau State.\nIt was learnt that five cows were also killed during the attack which occurred on Thursday evening.\nThe killings came days after 12 natives were also killed in similar attacks by gunmen suspected to be herdsmen in the neighbouring Kuru community in the council area.\nThe lawmaker representing Jos South in the Plateau State House of Assembly, Fom Gwottson, could not be reached when contacted, but the spokesman for the state Police Command, Ubah Ogaba, confirmed the latest killing to journalists in Jos on Friday.\nOgaba said, “On July 1, 2021, the Plateau State Police Command received a report of an attack at Chol village in the Vwang District of Jos South LGA by yet-to-be identified armed men."
  },
  {
    "headline": "Weeping as gunmen kill six in Plateau community",
    "summarized_story": "Gunmen have killed six persons suspected to be herdsmen in Chol community in the Jos South Local Government Area of Plateau State.\nIt was learnt that five cows were also killed during the attack which occurred on Thursday evening.\nThe killings came days after 12 natives were also killed in similar attacks by gunmen suspected to be herdsmen in the neighbouring Kuru community in the council area.\nThe lawmaker representing Jos South in the Plateau State House of Assembly, Fom Gwottson, could not be reached when contacted, but the spokesman for the state Police Command, Ubah Ogaba, confirmed the latest killing to journalists in Jos on Friday.\nOgaba said, “On July 1, 2021, the Plateau State Police Command received a report of an attack at Chol village in the Vwang District of Jos South LGA by yet-to-be identified armed men."
  },
  {
    "headline": "El-Rufai: 3 kidnapping gangs target my son Abubakar Sadiq",
    "summarized_story": "By AbankulaKaduna State Governor, Nasir El-Rufai has reacted to reports that he quietly withdrew his son, Abubakar-Sadiq from Kaduna Capital School, a public school, less than two years after his enrolment.\nAccording to him security reports available to his government had it that, three bandits groups were planning to abduct his son from the school.\nHe said both for now, write the Capital School exams and will return to school when security improves.\nEl-Rufai said he had to make the decision to withdraw his son and daughter based on the advice of the security agents.\nHe said “both Abubakar Sadiq and Nasrine will go back to the school when there is the confidence that, their attendance will not put the school at risk.”"
  },
  {
    "headline": "Sporadic shooting in Ojota as police disperse Yoruba nation agitators",
    "summarized_story": "By Muhaimin OlowoporokuThe Ojota area of Lagos is currently boiling as police officers have begun to disperse Yoruba nation protesters.\nThe protesters who surfaced around 10:40am gathered at the Gani Fawehinmi Park, Ojota, chanting songs, while also displaying banners.\nAbout 40 minutes after the agitation continued, police officers began spraying water at the protesters while advancing forward.\nHe also noted that the area is currently not safe for movement.\nThe traditionalists accompanied by other Protesters chanted “Oduduwa Nation now”, “Yoruba Nation Now”The traditionalists while speaking to police men urged them to protect them rather than teargas them."
  },
  {
    "headline": "Yoruba Nation agitators surface in Ojota, despite police cordon",
    "summarized_story": "By Muhaimin OlowoporokuScores of protesters have surfaced at the Gani Fawehinmi Park Ojota for the planned Yoruba Nation rally.\nThe protesters surfaced while the Lagos Commissioner of Police, Hakeem Odumosu was addressing journalists on why the protest cannot hold.\nThe protesters are yet to identify with any secessionist group but can be heard shouting ‘we want Yoruba Nation.\n”We are tired of being raped, we are tired of being killed, Give us our Yoruba nation now” the protesters chanted.\nAlso the police did not shoot or tear gas the protesters."
  },
  {
    "headline": "Street Trader Killed As Police Shoot Live Bullets At Yoruba Nation Agitators In Lagos (Photo)",
    "summarized_story": "A street trader around where the rally held by Yoruba Nation agitators has lost her life after being hit by a live bullet.\nThe photo of the lady lifeless body could be seen in a tweet shared by SaharaReporters.\nMore details will be provided later.\nSee the photos below:FLASH: Street Trader Killed As Police Shoot Live Bullets At Yoruba Nation Agitators In Lagos pic.twitter.com/qn74HWFvX2 — Sahara Reporters (@SaharaReporters) July 3, 2021"
  },
  {
    "headline": "BREAKING: Police Fire Shots To Disperse Yoruba Nation Agitators In Lagos",
    "summarized_story": "As the Yoruba nation rally gets underway, police officers present at Gani Fawehinmi Park in Ojota, Lagos, have fired gunshots.\nThis came after Hakeem Odumosu, the Lagos State Commissioner of Police, spoke to journalists at the event and stated that no rally is permitted in Lagos.\nSome Yoruba nation agitators, on the other hand, defied the security forces by distributing posters and flyers announcing their coming and presence.\nShots were fired a few minutes later, and hot water from an armoured tank was used to disperse the crowd.\nPolice officers were seen dragging some of the protestors into an armored tank."
  },
  {
    "headline": "BREAKING: Lagos CP Reveals Why Security Operatives Are At Venue Of Yoruba Nation Rally",
    "summarized_story": "The presence of security officers at the Gani Fawehinmi Park in Ojota, Lagos, according to Lagos State Commissioner of Police, CP Hakeem Odumosu, is the state’s approach of being security-conscious.\nOn Saturday, Odumosu spoke to reporters at Gani Fawehinmi Park, the site of a scheduled gathering by Yoruba Nation agitators.\n“We learnt that some miscreants have perfected plans to seize the opportunity to cause mayhem in the society.\n“Though the organisers of the rally made frantic efforts to say it will go peaceful, you and I know what happened during #EndSARS protests.\nEndSARS started peacefully but up till now, Lagos State has not been able to get out of the destruction that happened during the EndSARS,” he added."
  },
  {
    "headline": "FLASHBACK: ‘I Know Where To Buy Guns And Distribute’ — Sunday Igboho",
    "summarized_story": "A video of Sunday Igboho, a Yoruba nation activist, claiming to know how and where to buy firearms has sparked debate on the internet.\nAccording to the video, he said “we should get donations to buy weapons for those who do not have guns.\nIf they don’t know where to buy guns, I will buy for them.”“Let us buy guns for boys.\nMr Igboho’s media aide, Olayemi Koiki, was contacted by our correspondent to establish where and when Mr Igboho made the remark, but he failed to react.\nThe video went viral just hours after Mr Igboho claimed that the SSS planted ammunition in his home to harass him."
  },
  {
    "headline": "Breaking: Yoruba nation protesters defy Police, DSS, flood Lagos park",
    "summarized_story": "Despite warnings by security agencies, Yoruba Nation protesters are currently at the Gani Fawehinmi Park in Ojota, Lagos.\nThe protesters are gathered at the Ojota venue in large numbers.\nThe protesters lamented the rising insecurity in the southwest, and attack on Sunday Igboho’s residence.\nDetails coming…"
  },
  {
    "headline": "Pictures: Another Nigerian club, Oyah Sports, involved in accident, Players, officials injured",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Heavy flooding sweeps homes away, many missing",
    "summarized_story": "A huge landslide swept away homes and left 19 people missing at a popular resort town in central Japan on Saturday after days of heavy rain, local officials said.\nSo I ran to higher ground,” a leader of a temple near the disaster told public broadcaster NHK.\nThe landslide occurred at around 10:30 am and “several houses were swept away”, an Atami city official said.\nMore than 2,800 homes in the region were without power, according to the Tokyo Electric Power Company (TEPCO).\nShinkansen bullet trains between Tokyo and Osaka were temporarily stopped due to the heavy rain, while other local trains in rain-affected areas were also halted, rail company websites said."
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Despite Heavy Security Presence, Yoruba Nation Protesters Storm Freedom Park",
    "summarized_story": "Despite the heavy presence of armed policemen around Gani Fawehinmi Park, Ojota, Lagos, agitators of the Yoruba nation on Saturday gathered at the park.\nChanting different songs of freedom and flying their flags, the protesters said the nation is bleeding and they need Oodua Nation.\nThe agitators insist that it is time to have a separate nation for the Yoruba ethnic group because they are suffering and are being marginalised.\nThey insist that their rallies are peaceful and had taken place in other southwestern states before Lagos State.\nThe agitators surfaced around 11.20 am when the Commissioner of Police, Hakeem Odumosu, was addressing journalists."
  },
  {
    "headline": "Inside The World Of Nigeria’s ‘Teenage’ TikTok Stars",
    "summarized_story": "According to Statista, TikTok was the ninth most popular social media platform in Nigeria, just behind LinkedIn and Telegram, as of the third quarter of 2020.\n“I started taking TikTok seriously when it became the next big social media platform for business owners,” she said.\nAnd with more than four million followers, he is one of the most popular TikTok creators in Nigeria.\n‘Tik Tok Won’t Wait’Most TikTok videos do not require any fancy production equipment, even for stars; although some go heavy once they can afford it.\nIn Nigeria, it has largely escaped attention as the country tightens control on social media amid an indefinite suspension of Twitter."
  },
  {
    "headline": "Nigerians Not Regretting Our Back-To-The-Land Policy, Buhari Tells Ex-Ethiopian PM",
    "summarized_story": "The focus on agriculture by the current government is paying off handsomely, and Nigerians are not regretting it, President Muhammadu Buhari has said.\nThe President spoke Friday at State House, Abuja, while receiving in audience former Prime Minister of the Federal Democratic Republic of Ethiopia, His Excellency Ato Hailemariam Dessalegn Boshe.\nHe added: “We needed to go back to the land, as petroleum could no longer sustain the country, particularly with fluctuating prices.\nToday, we eat what we grow, and we have stopped the importation of many food products.\nThat is the feedback we get.”The former Prime Minister congratulated President Buhari for achievements Nigeria has attained under him, especially in agriculture, and for successful management of the COVID-19 pandemic."
  },
  {
    "headline": "Nnamdi Kanu’s Arrest: Ortom Challenges FG To Check Activities Of Armed Herders",
    "summarized_story": "Governor Samuel Ortom of Benue State has challenged the Federal Government to also arrest members of armed Fulani groups for carrying out attacks on farming communities in parts of the country.\nOrtom’s comments come a day after Governor Nyesom Wike of Rivers State stated that it is not enough for the Federal Government to arrest Nnamdi Kanu, while leaders of other notorious groups are roaming wild and free.\n“I have said as governor of Rivers State, I do not believe in Kanu’s principles or the way he wants to actualize Biafra.\nI have said that Rivers State is not part of Biafra.\n“And again, do not do it as if all our target is against a certain section of the country because it is not only Nnamdi Kanu we are talking about as regards insecurity in the country."
  },
  {
    "headline": "Lagos Govt Seals Illegal Container Terminal In Ibeshe, Ikorodu",
    "summarized_story": "The Lagos State Government has sealed an illegally operating container terminal in Ibeshe in the Ikorodu axis of the State.\nAccording to a statement signed by the spokesperson, Mukaila Sanusi, the operation was carried out on Friday and led by the Commissioner for Physical Planning and Urban Development, Idris Salako.\nHe said the Lagos State Government had to move swiftly to prevent further nuisance in the built environment of Ibeshe by sealing the unapproved terminal, located beside the Government jetty in the area.\nHe urged anyone interested in the establishment of container terminals and sand mining to seek the approval of the appropriate authorities including the Ministry of Physical Planning and Urban Development, Ministry of Waterfront Infrastructure Development, and Ministry of Energy and Mineral Resources among others.\nThe Commissioner enjoined community leaders and members to maintain the surveillance of their communities and report any untoward Physical development."
  },
  {
    "headline": "Updated: Police disperse agitators at Ojota with water cannon, teargas",
    "summarized_story": "The Police have dispersed Yoruba nation agitators who gathered at the Gani Fawehinmi Park, Ojota, with water cannon and teargas.\nThe Lagos state Police command had on Friday embarked on show of force across state to send signal against the planned rally.\nSpeaking at Ojota, the Lagos Commissioner of Police, Hakeem Odumosu, said the aftermath of the End SARS protest necessitated the need to prevent any rally over fear of being hijacked by the hoodlums."
  },
  {
    "headline": "We can sacrifice anything for good military-civil relations – Nigerian Army",
    "summarized_story": "The Nigerian Army said it is ready to go to any length to maintain good relationship with the civilian populace as they remain committed to the discharge of their mandate of protecting the nation’s territorial integrity.\nGarrison Commander, 8th Division, Nigeria Army Headquarters, Sokoto, Brigadier General Chinedu Ralph Nnebeife stated this when he led officers and soldiers of the division on a sanitation exercise to the host Communities of the Giginya Army Barracks.\nHe said the Nigeria Army cherished it’s relationship with the civilian populace and will do anything to make it cordial and complimentary.\nAdvertisementThe exercise is part of the activities line up to mark this year’s Army Day celebration in Sokoto.\nMotorist and commuters were seen appreciating the gesture of the officers and soldiers of the Nigeria Army while they discharge this corporate social responsibility."
  },
  {
    "headline": "Heavy Security presence at Ojota, Yoruba nation rally campaigners not in sight",
    "summarized_story": "There is heavy security presence at the Gani Fawehinmi Park, Ojota, in the Kosofe Local government area of Lagos state.\nThis is a follow up to the show of force by the Lagos State Police Command on Friday."
  },
  {
    "headline": "Full Throttle: England Boss Southgate Says No Rotation in Euro Quarterfinal with Ukraine",
    "summarized_story": "Gareth Southgate said it would be “an insult to Ukraine” for England to rotate their lineup due to the possibility of four players missing a potential Euro 2020 semifinal.\nHowever, asked by ESPN whether the yellow card situation would affect his team selection against Andriy Shevchenko’s side, Southgate replied:“No.\nI understand that strategically you might like to do that but I can’t think of a country in the world that would do that for a quarterfinal.\nNo, I think we’ve got to focus on tomorrow.\nI think it would be a big error for us to be thinking about anything else and I think it would be an insult to Ukraine as well."
  },
  {
    "headline": "About 200 US Companies Hit By ‘Colossal’ Cyber-attack",
    "summarized_story": "About 200 US businesses have been hit by a “colossal” ransomware attack, according to a cyber-security firm.\nThe cyber-breach emerged on Friday afternoon as companies across the US were clocking off for the long Independence Day weekend.\nKaseya said in its statement that a “small number” of companies had been affected, though Huntress Labs said the number is already about 200 and counting.\n“This is a colossal and devastating supply chain attack,” Huntress Labs’ senior security researcher John Hammond said in an email to Reuters news agency.\nThe group sometimes threatens to post stolen documents on its website – known as the “Happy Blog” – if victims don’t comply with its demands."
  },
  {
    "headline": "Europe in Vaccination Race Against Covid′s Delta Variant",
    "summarized_story": "Countries across Europe are scrambling to accelerate coronavirus vaccinations and outpace the spread of the more infectious delta variant, in a high-stakes race to prevent hospital wards from filling up again with patients fighting for their lives.\nThe risk of infection from the delta variant is “high to very high” for partially or unvaccinated communities, according to the European Centre for Disease Control, which monitors 30 countries on the continent.\nIn the U.K., cases of the delta variant have increased fourfold in less than a month, with confirmed cases Friday up 46% on the previous week.\nFrance lifted the last of its major restrictions Wednesday, allowing unlimited crowds in restaurants, at weddings and most cultural events despite fast-rising cases of the delta variant.\nBut Dr. Hans Kluge, the head of the WHO’s Europe office, cautioned this week that the delta variant is poised to become dominant by August in the 53-country region his office covers."
  },
  {
    "headline": "Southern Nigeria Governors to Meet on Open Grazing and Restructuring Monday in Lagos",
    "summarized_story": "Seventeen governors of Nigeria’s southern states will on Monday converge on Lagos for the second time this year to continue their search for solution to the myriad of problems confronting the country.\nThe source said: “The governors are working towards a better Southern Nigeria within the Nigerian nation.\nThe southern governors will be looking at the gains of the last meeting and come up with their next move.\n“You know the southern governors agreed that the progress of the nation requires that urgent and bold steps be taken towards the restructuring of the Nigerian federation leading to the devolution of power.\nDuring the first meeting in Asaba, the southern governors resolved to ban all forms of open grazing in the southern states of the country."
  },
  {
    "headline": "Indonesia to Get US Vaccine Donations Amid Covid Emergency",
    "summarized_story": "Sullivan said the donation “underscored the United States’ support for the people of Indonesia as they fight a surge in COVID-19 cases”.\nThe two officials also discussed US plans to increase assistance for Indonesia’s broader COVID-19 response efforts, the statement said.\nPenny K Lukito, the chief of Indonesia’s food and drug agency, said earlier on Friday it authorised the Moderna vaccine for emergency use.\nThe company said the vaccine was far more effective in producing antibodies against the Delta variant than it was against the Beta variant first identified in South Africa.\nIndonesia has relied mainly on the vaccine from China’s Sinovac, but has been looking to diversify supply sources."
  }
]