[
  {
    "headline": "Igangan attack: License Amotekun to bear arms, senator urges FG",
    "summarized_story": "Senator Kola Balogun representing Oyo South Senatorial District in the 9th Assembly has appealed to the Federal Government to license the South-West Security Network Agency, also known as Amotekun, to bear arms.\nBalogun also said the attackers had bigger plans but for the intervention of vigilantes and Amotekun personnel.\nThe senator said, “Amotekun is active and Amotekun is working even with the police.\n“So, Amotekun is working and now the South-West governors said they have a joint patrol of Amotekun outfit across the entire South-West.\n“Let me also say that I am aware that the Amotekun personnel have requested that the Inspector-General of Police grant them the license to be well-equipped."
  },
  {
    "headline": "Bury TB Joshua in Arigidi Akoko, Ondo monarch appeals",
    "summarized_story": "The monarch of Arigidi Akoko in Akoko North West Local Government Area of Ondo State, Oba Yisa Olanipekun has appealed to the members of the Synagogue Church of All Nations to allow Pastor Temitope Joshua to be buried in Arigidi, his hometown.\nJoshua who died in Lagos at the age of 57, was being mourned in Arigidi Akoko since the news of his death was broken to the people.\n“Prophet had it in mind that he was coming home, so why would they bury his remains in Lagos?\nSo, they shouldn’t get the whole Akoko angry with them because all the Obas in Akoko have been calling me in respect to that.\nHe had it in mind to complete that project as soon as possible, meaning he wanted to move his church to Arigidi Akoko.”"
  },
  {
    "headline": "PIB to be passed before June ends ― Senate President",
    "summarized_story": "By Obas Esiedesa, AbujaThe Senate President, Ahmad Lawan has disclosed that the Petroleum Industry Bill, PIB, which has been 20 years in making, will be passed before the end of June 2021.\nHe noted that in 2011, it was the same thing and the same result but in 2015, the National Assembly conceived the Bills but the PIB also failed to be enacted.\nThe speed and commitment the National Assembly has shown in working on the PIB and reaching where we are today show that we have chosen the right path.\n“As I speak, our joint committee of both Senate and the House on the PIB are about to conclude writing the report which will be submitted to both chambers of the National Assembly.\nOur expectation is that we will pass the PIB within this month of June by the grace of God”."
  },
  {
    "headline": "Ibarapa Killings: War imminent",
    "summarized_story": "The killings in the early hours of Sunday brought the entire Igangan town and its environs to its kneels with over 50 people, cars burnt and over 20 houses razed.\n“Three days ago,the Director-General of Oyo state Southwest Security Network Amotekun,Gen.\nI want to charge all the governors in the southwest,as well as the traditional rulers to rise to this occasion.\nThe Yoruba generalissimo, however, warned criminal herders to stay away from the region, as the southwest can no longer accommodate killers.\nAdams admitted that information at his disposal indicates that bandits and killer herdsmen have invaded the southwest thus pushing the security outfits to the wall."
  },
  {
    "headline": "Flags lowered at Synagogue Church on TB Joshua’s death",
    "summarized_story": "All the flags adorning the Synagogue Church of All Nations in Lagos have been lowered at half mast as sympathizers throng the church on the news of the death of Prophet TB Joshua, the News Agency of Nigeria (NAN) reports.\nNAN reports that sympathizers and followers of the prophet were seen crying around the church premises.\nREAD ALSO: Buhari mourns Pastor TB JoshuaThe usual church service did not hold in the church.\nSecurity men at the premises prevented worshippers from entering the premises.\nAn eye witness also told NAN that some expatriates who had been in the church for prayers were seen leaving this morning."
  },
  {
    "headline": "Twitter Ban: Nigerians cannot be prosecuted for offence unknown to Constitution — Ajulo",
    "summarized_story": "“Without prejudice to the rationale for the ban of the blogging site, it must be noted that the Nigerian democracy is a constitutional democracy based on the rule of law.\n” The Constitution of a nation is the fons et origo, not only of the jurisprudence but also of the legal system of the nation.\nIn Greek language, it is the alpha and the omega and the barometer with which Government actions are measured.\n“Without prejudice to the rationale for the ban of the blogging site in Nigeria, it is imperative to note that the provisions of Section 36(12) of the 1999 Constitution are clear to the effect no one shall be prosecuted for an offence not known to Law, Ajulo submitted..\n” I have carefully spectated the contents of our various penal laws and nowhere is a Citizen of the Country prohibited from receiving or disseminating information which as a right guaranteed under Section 39 of the Constitution,” Ajulo pointed out."
  },
  {
    "headline": "Farouq inaugurates Governing Council of Senior Citizens Centre",
    "summarized_story": "By Joseph Erunke, ABUJATHE Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq,Monday, inaugurated the Governing Board of the National Senior Citizens Centre.\nResponding on behalf of the board members, the Chairman, AVM Muhammad Muhammad rtd thanked President Muhammadu Buhari and minister Sadiya Umar Farouq for their support, encouragement and confidence reposed in the members.\n“We are exceedingly delighted to be shouldered with the responsibility of ensuring the provision of welfare and recreation for our senior citizens.\nMembers of the Governing council of the National Senior Citizens Centre are as follows;1.\nMuhammed Umar Jega, Dr Ogugua Osi- Ogbu representing Prof Usman Ahmed of the Geriatrics Association of Nigeria, Directors of the Ministry and other distinguished personalities."
  },
  {
    "headline": "Ogun LG polls: OGSIEC directs candidates on how to sign personal data forms",
    "summarized_story": "Following the ongoing nationwide strike embarked upon by the Judicial Staff Union of Nigeria (JUSUN), the Ogun State Independent Electoral Commission (OGSIEC) has directed political parties participating in the July 24 local government elections to make use of Notary Public or the Ministry of Justice in order to sign the Personal Data Forms of their candidates.\nOgun LG polls: PDP kicks as OGSIEC reportedly recognises Kashamu faction“As electoral umpires, we have continued to provide a level playing field for all the political parties and we will not renege in our quest to organize free, fair and credible Local Government elections,” Osibodu said.\nOsibodu said 11 political parties have indicated interest to participate in the elections.\nAccording to him, the list of the 17 registered political parties in the state was obtained from the Independent Electoral Commission (INEC).\nLG polls: OGSIEC denies giving PDP’s forms to Kashamu faction"
  },
  {
    "headline": "CJN warns new FCT Chief Judge",
    "summarized_story": "The Chief Justice of Nigeria, Tanko Muhammad, has warned the new Chief Judge of the Federal Capital Territory (FCT) High Court, Justice Salisu Garba that he will not condone recklessnessThe CJN gave the warning at the swearing-in ceremony of Justice Garba on Monday.\nSenate confirms Justice Abdullahi as FCT High Court Chief JudgeMuhammad told Salisu he is fortunate to be entrusted with the huge responsibility of presiding over the affairs of the FCT Judiciary.\nHe advised the CJ to discharge his duties with utmost sincerity, honesty and transparency.\nThe CJN further counsel Salisu to operate above every sentiment that might play out in the course of his tenure.\nWe will not suspend our strike – JUSUN tells CJN"
  },
  {
    "headline": "Insecurity: Northern elders responsible for Boko Haram, bandits",
    "summarized_story": "The group said it is laughable that the likes of Wamakko could not find solutions to the frightening insecurity challenges in the North for the last 7 years.\nAttacks: Speak up – Wamakko challenges South East leadersOhanaeze recalled that the US embassy had warned that the bandits and killer herdsmen are changing positions to Southern Nigeria to wreak havoc.\n“So they exported violence to the southeast to keep Igbo leaders busy with insecurity challenges and set traps for them (Igbo leaders) to fall in and get arrested.\nSecession: Tinubu, Akande’s meeting capable of dousing tension in Nigeria – Buhari’s ally“Wamakko’s assertion that Igbo leaders are behind the scenes motivating the violence in the southeast, exposed the northern secrets of supporting bandits and Boko Haram for economic and political reasons.\n“The silence of Igbo leaders is golden and will generate confusion in the camps of sponsors of terror in the Southeast.”Easter: Abiodun advises Nigerians on nation’s unity, mourns Odumakin"
  },
  {
    "headline": "Herdsmen killings: I heard everybody talking about Buhari in US White House",
    "summarized_story": "Giwa said on his visit to the White House, he overheard everyone talking about Nigeria and its bad leadership under President Buhari.\nAccording to Giwa, the leaders of All Progressives Congress and President Buhari should cover their faces in shame over the activities of herdsmen in Nigeria.\n“I want president Buhari to sit down and judge himself fairly.\n“The 36 states in Nigeria are now being taken over by Fulani herdsmen.\n“I was in White House recently in the United States, everybody was talking about Nigeria, and President Buhari."
  },
  {
    "headline": "Insecurity: Gov Ortom tasks FG on annual recruitment of police officers",
    "summarized_story": "Benue State Governor, Samuel Ortom, has said if the Federal Government had kept its promise to recruit 10,000 Police Officers yearly, 40,000 officers would have been recruited by now.\nGovernor Ortom who stated this on Monday, at the Benue Peoples House Makurdi while addressing personnel of the disbanded Vigilante Group, said such a number would have contributed significantly in the security architecture of the country.\nGovernor Ortom reasoned that if that policy was carried out faithfully, the question of personnel shortfall in the Police would have been addressed.\nRepresentatives of the three senatorial districts in separate remarks, commended Governor Ortom for the interface with them and pledged their support for the Community Volunteer Guards and the entire security architecture of the State.\nNigeria needs more policemen, soldiers – Islamic group, MURIC"
  },
  {
    "headline": "Violent crimes, secessionist agitations at unacceptable heights – Minister",
    "summarized_story": "Agency ReporterThe Minister of Police Affairs, Alhaji Muhammad Dingyadi, says the rate of violent crimes and secessionist agitations in some parts of the country has attained unacceptable heights.\nHe said that the violent crimes and agitations had snowballed into attacks on security formations and other symbols of authority in the country.\nDingyadi said that the increasingly sophisticated spate of violent crimes, necessitated the deployment of all available security assets, conflicts resolution mechanisms and other peace building measures to enhance internal security arrangements in the country.\n“The retreat will also bring to fore, the state of our border security and implications of poorly policed borders on internal security.\nAccording to him, inter-agency frictions constitute a major threats to internal security and national cohesion."
  },
  {
    "headline": "Buhari appoints two new aides for First Lady",
    "summarized_story": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari has approved the appointment of two new senior aides for the office of the First Lady.\nAlso, the President approved the appointment of the Personal Physician to the First Lady, Dr. Mohammed Kamal Abdurrahman, as Senior Special Assistant to the President on Health and Development Partners in the Office of the First Lady.\nAccording to the statement; “President Muhammadu Buhari has approved the appointment of Dr. Rukayyatu Abdulkareem Gurin as Senior Special Assistant to the President on Administration and Women Affairs in the Office of the First Lady.\n“The President also approved the appointment of Dr. Mohammed Kamal Abdurrahman as Senior Special Assistant to the President on Health and Development Partners in the Office of the First Lady.\n“Dr Abdurrahman will combine his new role with his position as the Personal Physician to the First Lady.”"
  },
  {
    "headline": "Igangan: Alaafin expresses sadness over killings, arson",
    "summarized_story": "By Segun Showunmi, IbadanThe Alaafin of Oyo, Oba Lamidi Adeyemi has expressed sadness over killings of innocent souls and defenseless people of Igangan in the Ibarapa North local government area of Oyo State by suspected bandits.\nRecall that scores of residents of Igangan community were in the early hours of Sunday killed, while several houses including the Palace of Ashi of Igangan was burnt by the unknown bandits.\nA statement signed by the monarch’s Director of Media and Publicity, Bode Durojaiye, also described the burning of the Palace of Ashi of Igangan community as a “taboo”.\nADVERTISEMENTHe lamented that Nigeria’s ethnic, sectional and religious diversities ought to serve as source of national unity, cohesion and integration, but has over the years constituted serious threat to peace, security, and national development.\nThe royal father however urged security agencies to employed native intelligence services in a bid to effectively tackle critical security challenges confronting the country."
  },
  {
    "headline": "IGP suspends issuance of tinted glass permits, spy number plates",
    "summarized_story": "By Gbenga Omokhunu, AbujaThe Inspector-General of Police (IGP) Usman Baba, on Monday, ordered the suspension of issuance of police permits to owners of vehicles with tinted glass nationwide.\nHe also directed that the issuance of spy number plates be put on hold.\nADVERTISEMENTBaba gave the directives at a meeting with top police officers the Nigeria Police Force headquarters in Abuja.\nBaba said the measures are parts of efforts being put in place to curtail the worsening security challenges across the country."
  },
  {
    "headline": "Breaking: FG summons US, UK, EU, other envoys over statements on Twitter ban",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government, has summoned some envoys over their responses to its ban on Twitter’s operations in the country.\nThe Minister of Foreign Affairs, Geoffrey Onyeama, summoned the envoys to a meeting holding later today at the Tafawa Balewa House, Abuja.\nRecall that The United States (US), the United Kingdom (UK), the Delegation of European Union (EU) to Nigeria and the Economic Community of West African States (ECOWAS), the Canadian Government, the Kingdom of Norway, and the Republic of Ireland, in a joint statement at the weekend, expressed disappointment over the ban on Twitter’s operations in Nigeria.\nPrior to the joint statement, the United States Diplomatic Mission to Nigeria, had issued a separate statement where it said the ban on Twitter’s operations in the country was an infringement on the rights of Nigerians to freedom of expression."
  },
  {
    "headline": "DSS storms Adoration Ministry, summons Mbaka to Abuja",
    "summarized_story": "From Jude Chinedu, EnuguThere appears to be more trouble coming the way of the Spiritual Director of Adoration Ministry Enugu, Nigeria (AMEN) Rev.\nEjike Mbaka, as he has been summoned to Abuja for interrogation by operatives of the Department of State Services.\nJust last week, Mbaka returned from a 30-day compulsory prayer retreat imposed on him by the Catholic Bishop of Enugu Diocese, Most Rev.\nThis was followed by a letter from the Bishop which stripped Mbaka of total control of the adoration ministry as it was converted to a Chaplaincy.\n“I got a call on Thursday that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja."
  },
  {
    "headline": "Massacre in Oyo: 45 dead bodies recovered, Oba’s palace, 60 houses burnt, over 160 vehicles destroyed",
    "summarized_story": "From Oluseye Ojo, IbadanBlood flowed freely in Igangan, one of the seven principal towns of Ibarapaland in Oyo State, on Saturday night, as gunmen dispatched over 45 persons to their early graves in the town.\nSalihu was evicted from the town based on allegations of aiding and abeitting killings, kidnapping and destruction of farmland in the area.\nThe bandits, according to sources, were about 50 and they invaded the town on more than 20 motorcycles.\nWe are assembled here.”Police confirm incident, begin investigationThe Oyo State Police Command has confirmed the invasion of Igangan in Ibarapa zone of the state by unknown assailants during which many lives and property were destroyed.\nAlso, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, condemned the and call on residents of Igangan and the entire state to be calm."
  },
  {
    "headline": "Nigeria at crossroads as oil price nears $75 per barrel",
    "summarized_story": "Brent crude, the global oil price benchmark is gradually making a rebound with a barrel of oil likely to hit $75 in the weeks ahead and probably above, a development that signaled a ray of hope for the troubled sector which has battled a low price regime occasioned by the coronavirus pandemic since last year.\nIronically, while other oil producing countries with robust refining capacity are anxious to reap the gains of higher oil prices, Nigeria seems to be fretting because a higher price regime will definitely translate to increased cost of refining and higher fuel subsidy.\nOn the other hand, gains will be reaped for the country as its 2021 oil price projection was based on an estimate of $40 per barrel, indicating a daily gain of $57.6 daily for the country at 1.8 million barrels of oil production per day.\nWhile pump price steadily rose, the face-off between labour and Federal Government kept the latter in a tight corner.\nThe unions had earlier forced the government to reverse the pump price from N168 per litre last year to N162."
  },
  {
    "headline": "T.B Joshua: Buhari, Jonathan, govs, Kalu, others mourn",
    "summarized_story": "Condolence messages have been pouring in following the demise of Prophet TB Joshua.\n“Prophet Joshua was committed to giving and was more often, inexorably imbued with calmness while lifting the downtrodden.\nHe said he was saddened to hear about the death of T.B Joshua, at a young age of 57.\n“TB Joshua was a devout man of God who served God and humanity with relentless passion.\nProphet T.B."
  },
  {
    "headline": "Nigeria in Talks with Twitter, Gives Condition to Lift Ban",
    "summarized_story": "By Michael OlugbodeThe Federal Government has said it is in talks with Twitter over the suspension of the micro-blogging site in Nigeria.\nThe Minister of Foreign Affairs, Geoffrey Onyeama disclosed this Monday at press conference after his meeting with representatives of five foreign missions in Nigeria over their comments on the Twitter ban.\nThe Minister however said that Twitter remains suspended and there was still no date for the lifting of the suspension.\nThe Twitter ban was announced by the Information Minister, Lai Mohammed, Friday, two days after Twitter deleted President Muhammadu Buhari’s tweet posted wherein he threatened to deal with secessionists “in the language they understand”.\nNigerian telecoms operators complied with the government directive on the ban Friday but Nigerians are navigating around the ban using VPNThe U.S. and the European Union had on Saturday expressed concern over Nigeria’s decision to ban Twitter."
  },
  {
    "headline": "Adeboye Speaks on Twitter Ban, Says Tweeting is Human Right",
    "summarized_story": "By Onyebuchi EzeigboThe General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, has said tweeting is in accordance with Article 19 of the United Nations Universal Declaration of Human Rights.\nThe tweets here are in accordance with Article 19 of the United Nations universal declaration of human rights,” Adeboye tweeted on Monday.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted wherein he threatened to deal with secessionists “in the language they understand”.\nNigerian telecoms operators complied with the government directive on the ban Friday but Nigerians are navigating around the ban using VPN.\nThe U.S. and the European Union had on Saturday expressed concern over Nigeria’s decision to ban Twitter."
  },
  {
    "headline": "FG Summons US, UK, Canada, EU Envoys over Comments on Twitter Ban",
    "summarized_story": "By Michael OlugbodeThe Federal Government has summoned the ambassadors of the United States, United Kingdom, Canada and the European Union in Nigeria over their comments on the suspension of microblogging site, Twitter, in Nigeria.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted wherein he threatened to deal with secessionists “in the language they understand”.\nThe ban has attracted widespread condemnations as Nigerians described it as violation of rights of citizens and a prelude to dictatorship.\nMore than 39 million Nigerians have a Twitter account, according to NOI polls, a public opinion and research organization based in Nigeria.\nNigerian telecoms operators complied with the government directive on the ban Friday but Nigerians are navigating around the ban using VPNThe U.S. and the European Union had on Saturday expressed concern over Nigeria’s decision to ban Twitter."
  },
  {
    "headline": "SANs Fault Malami, Say No Legal Basis for Prosecuting Twitter Users",
    "summarized_story": "Chief Godwin Obla (SAN) described the suspension of Twitter as senseless and not legally justiciable because there is no order proscribing Twitter in Nigeria.\nIn effect, the digital world has become the new frontier for both good and evil.\nThis means majority of Nigeria’s one hundred and ninety million citizens are fully connected to this new digital world; especially our youth.\nFrom procurement to payroll to revenue collections, we are using digital platforms to reinforce our objectives of improving efficiency, accountability and transparency in governance.\nAs earlier observed, the digital world is borderless."
  },
  {
    "headline": "Despite Ban, Open Grazing Persists in Southern States",
    "summarized_story": "Onobus said Governor Godwin Obaseki was yet to come up with a bill to legalise open grazing.\nIn Delta State, open grazing persists in the forest, particularly in Ughelli, Abraka, Oghara in Delta South and Central Senatorial zones.\nDespite the anti-open grazing law in Oyo State, herders are still openly grazing their cattle in most areas of the state.\nThe ban on open cattle grazing was yet to be enforced in Imo State.\nEven in the Owerri, the capital city, as well as in other various villages and communities, open grazing still goes on unchecked."
  },
  {
    "headline": "BREAKING: Pastor Adeboye Defies Twitter Ban, Says Action Covered By UN Charter On Human Rights",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God (RCCG), has tweeted despite the ban on microblogging site, Twitter by the Nigerian government.\nAdeboye, who defied the ban on Monday described tweeting as being in accordance with Article 19 of the UN universal declaration of human rights.\nHe tweeted, \"The Redeemed Christian Church of God is domiciled in more than 170 Nations & Territories.\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights.\"\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights."
  },
  {
    "headline": "BREAKING: Pastor Adeboye Defies Twitter Ban, Says Action Covered By UN Charter On Human Rights",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God (RCCG), has tweeted despite the ban on microblogging site, Twitter by the Nigerian government.\nAdeboye, who defied the ban on Monday described tweeting as being in accordance with Article 19 of the UN universal declaration of human rights.\nHe tweeted, \"The Redeemed Christian Church of God is domiciled in more than 170 Nations & Territories.\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights.\"\nThe tweets here are in accordance to Article 19 of the UN universal declaration of Human Rights."
  },
  {
    "headline": "Buhari Is Tired, Abandons Duty At 5pm Daily Even If Nigeria Is On Fire— Presidential Source",
    "summarized_story": "“We were here when Goodluck Jonathan was President; he would work till 11pm daily,” the source told SaharaReporters.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn May 7, 2017, Buhari embarked on a trip to London for another medical vacation.\n“The moment it happened on Friday night, President Buhari was told.\nBut due to dementia, he had forgotten,” the source had said about why Buhari did not visit the school."
  },
  {
    "headline": "Buhari Is Tired, Abandons Duty At 5pm Daily Even If Nigeria Is On Fire— Presidential Source",
    "summarized_story": "“We were here when Goodluck Jonathan was President; he would work till 11pm daily,” the source told SaharaReporters.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn May 7, 2017, Buhari embarked on a trip to London for another medical vacation.\n“The moment it happened on Friday night, President Buhari was told.\nBut due to dementia, he had forgotten,” the source had said about why Buhari did not visit the school."
  },
  {
    "headline": "Buhari Is Tired, Abandons Duty At 5pm Daily Even If Nigeria Is On Fire— Presidential Source",
    "summarized_story": "“We were here when Goodluck Jonathan was President; he would work till 11pm daily,” the source told SaharaReporters.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn May 7, 2017, Buhari embarked on a trip to London for another medical vacation.\n“The moment it happened on Friday night, President Buhari was told.\nBut due to dementia, he had forgotten,” the source had said about why Buhari did not visit the school."
  },
  {
    "headline": "Sunrise Power files $400m lawsuit at ICC as FG reneges on $200m ‘compensation’ to end Mambilla dispute",
    "summarized_story": "Sunrise Power Transmission Company of Nigeria Ltd (SPTCL) has filed a fresh $400 million lawsuit at the ICC International Court of Arbitration, Paris, France, against the Federal Government of Nigeria (FGN).\nAdvertisementA month after the agreement was signed, Buhari said the federal government did not have $200 million to pay Sunrise Power.\nAccording to Adesanya, several letters were written to inform the presidency of the breach, yet Sunrise “was sidelined” in the project by the ministry of power.\nSUNRISE POWER GOES BACK TO ICCOwing to the failure of the federal government to fulfil its financial obligation of $200 million to Sunrise Power, Femi Falana, the company’s counsel, filed a fresh lawsuit at arbitration court on May 11, demanding $400 million.\nAdvertisementFalana stated that the lawsuit was filed under the international court’s expedited procedure rules and should be resolved in six months."
  },
  {
    "headline": "Sunrise Power files $400m lawsuit at ICC as FG reneges on $200m ‘compensation’ to end Mambilla dispute",
    "summarized_story": "Sunrise Power Transmission Company of Nigeria Ltd (SPTCL) has filed a fresh $400 million lawsuit at the ICC International Court of Arbitration, Paris, France, against the Federal Government of Nigeria (FGN).\nAdvertisementA month after the agreement was signed, Buhari said the federal government did not have $200 million to pay Sunrise Power.\nAccording to Adesanya, several letters were written to inform the presidency of the breach, yet Sunrise “was sidelined” in the project by the ministry of power.\nSUNRISE POWER GOES BACK TO ICCOwing to the failure of the federal government to fulfil its financial obligation of $200 million to Sunrise Power, Femi Falana, the company’s counsel, filed a fresh lawsuit at arbitration court on May 11, demanding $400 million.\nAdvertisementFalana stated that the lawsuit was filed under the international court’s expedited procedure rules and should be resolved in six months."
  },
  {
    "headline": "Buhari meets new army chief, offers tips on how to end insecurity",
    "summarized_story": "President Muhammadu Buhari has offered new tips to Faruk Yahaya, the chief of army staff, on how to end insecurity in the country.\nAdvertisementYahaya, a major-general, was recently named the new army chief, following the death of Ibrahim Attahiru who had spent four months in office.\nYahaya, who met with the president formally on Monday, was in the company of Bashir Magashi, minister of defence.\nAddressing journalists after the meeting, Magashi said the president spoke to Yahaya on improving the nation’s security.\nWe assured him that we will do our best to bring an end to the problem of insecurity in this country."
  },
  {
    "headline": "Buhari meets new army chief, offers tips on how to end insecurity",
    "summarized_story": "President Muhammadu Buhari has offered new tips to Faruk Yahaya, the chief of army staff, on how to end insecurity in the country.\nAdvertisementYahaya, a major-general, was recently named the new army chief, following the death of Ibrahim Attahiru who had spent four months in office.\nYahaya, who met with the president formally on Monday, was in the company of Bashir Magashi, minister of defence.\nAddressing journalists after the meeting, Magashi said the president spoke to Yahaya on improving the nation’s security.\nWe assured him that we will do our best to bring an end to the problem of insecurity in this country."
  },
  {
    "headline": "Who offended Buhari? Twitter or Nigerians?",
    "summarized_story": "So, who offended Buhari and who should be writhing from the economic perils of his ban?\nWell, if the government is deploying this as a gambit to asphyxiate dissenting voices on social media it will be a futile performance.\nOnly good governance can silence the noise on social media.\nHowever, there is the pesky issue of hate speech, fake news, misinformation and disinformation on social media — particularly on Twitter and Facebook?\nAdvertisementSome countries like India, even the US and the UK, have set these tech leviathans to task regarding sanitising their social media space."
  },
  {
    "headline": "The best communications managers are empathetic storytellers.",
    "summarized_story": "Moyosola Kara is the director of marketing and communications at Eze Wholesale – a YC-backed startup on a mission to simplify the wholesale electronics trade market.\nI’m bringing Moyosola to Centre Stage because she’s had an unconventional but rewarding career as a marketing and communications specialist.\nHow are you able to marry your introverted personality with your role as a communications executive?\nI did not study marketing or communications (surprise surprise).\nThen I worked in digital marketing, media, marketing, before finally settling down in a communications role at 54gene."
  },
  {
    "headline": "WhatsApp won’t restrict users who don’t agree to its privacy policy",
    "summarized_story": "WhatsApp recently announced that it will not be limiting access to the features of the app for those who reject the new privacy policy and disagree to let it share its data with Facebook and other third-party companies.\nThe initial deadline for the acceptance of its privacy policies was set to February 8, 2021, but after receiving backlash from its global users and dealing with media scrutiny, Facebook decided to extend the deadline to May 15, 2021.\nUsers will be “able to receive calls and notifications” but they “won’t be able to read or send messages” anymore.\nDuring this period, Whatsapp’s policy related to inactive users will apply.\nWhat’s nextAlthough users will no longer lose access to the app if they don’t agree to the new terms of service agreement, users will still get reminded about the new policy if they haven’t accepted it."
  },
  {
    "headline": "South African Mobility startup WhereIsMyTransport raises $14.5million for expansion",
    "summarized_story": "South African Mobility startup WhereIsMyTransport has raised a $14.5 million Series A extension round to continue its expansion across emerging markets.\nFormed in 2016, WhereIsMyTransport is a big data platform that provides sustainable mobility solutions in emerging markets.\nWith this new investment, WhereIsMyTransport plans to continue its expansion across emerging markets, with a launch in Peru planned for later this year.\nMobility in emerging markets via public transportation is often a hassle – it’s inefficient and time-consuming.\nThe successful expansion of WhereIsMyTransport would reduce friction in the movement of people and goods across Africa and other emerging markets."
  },
  {
    "headline": "Viva Technology is back in action!",
    "summarized_story": "Four inspiring days, packed withopportunities for business and with flashes of innovation, to contribute to this long-awaitedmoment of recovery and reconnection.\nInspiring top-level speakersOnce again, major players in technology and business will take the floor this year at VivaTech.\nNew highlights and new initiativesViva Technology has completely redesigned its program in order to respond to the variouschallenges in our societies.\nFinally, the winners of the many other challenges organized by various Viva Technology partnerswill also be announced.\nStarting in 2021, VivaTech will be enriched with a digital platform that will bring together an evenlarger community of innovators."
  },
  {
    "headline": "Club Swan Creates Services To Address Challenges Faced By Nigerian Entrepreneurs",
    "summarized_story": "Abiodun Ajayi – Blockchain and Cryptocurrency StrategistClub Swan, a global lifestyle club designed for cryptocurrency enthusiasts, has launched new services to address challenges faced by Nigerian cryptocurrency entrepreneurs.\nClub Swan provides a reliable bridgeAs mentioned earlier, Club Swan is a global lifestyle concierge membership club designed for cryptocurrency enthusiasts.\nClub Swan created the platform to address the obstacles many legitimate entrepreneurs face when using digital and legacy currencies.\nFor entrepreneurs that travel extensively, Club Swan provides dedicated concierge, travel and lifestyle services for its members.\nTo become a member of Club Swan, go to https://clubswan.com and select the membership tier that suits your needs."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "#TwitterBan: Nigerian TV, radio stations, others can no longer tweet or patronise Twitter",
    "summarized_story": "Nigeria’s broadcast regulator, National Broadcasting Commission (NBC), has ordered all broadcasting stations to deactivate their Twitter handles.\nIn addition, the body further prohibits media platforms from using User Generated Content (UGC) as sources in their reportage.\nThe latest order resulting from the ongoing Twitter suspension in the country since Friday, June 4, 2021, is a way of disincentivising individuals and corporate bodies from patronising Twitter.\nWhile the statement does not clearly state what media platforms are affected by the directive, the NBC Act defines broadcasting stations as entities — like radio, sound, television, cable, or satellite stations — that have received a broadcasting licence after satisfying the regulator’s requirements.\nAdvertisementIf anything, Nigeria has finally joined the list of countries losing millions of dollars to government-led Internet crackdowns annually."
  },
  {
    "headline": "#TwitterBan: Exploring the legal intricacies of Nigeria’s decision",
    "summarized_story": "It had gone the expected legislative route in 2019 with the “social media bill”, which was outrightly rejected by Nigerians.\nHowever, this discourse will analyse the legal issues surrounding the government’s decision.\nOther legal issues which have been raised include the use of videos and pictures gotten from Twitter as evidence in court.\nOrdinarily, Nigeria practises the doctrine of separation of powers which, as Oloyede explains, means the Executive, Judiciary, and Legislature are independent bodies.\nWhile we know the ban is illegal, it is now up to the courts to give a decision."
  },
  {
    "headline": "#TwitterBan: Should Nigerians be worried about VPNs?",
    "summarized_story": "The ICSI research discovered that 72% of the free VPN services analysed embedded third-party tracking tools in their software.\nSome free VPNs conceal information about sharing or selling user data, but others disclose it in their privacy policies.\nTo make revenue, they either sell users’ data to third parties or flood you with ads without your permission.\nWhile paid VPNs have ad-blocking tools, malware protection features, and unlimited bandwidth that secure users’ data, free VPNs have a smaller infrastructure, leading to slower Internet speeds.\nHowever, we know that VPNs are temporary solutions to the Twitter ban, and some free VPNs do not guarantee security and privacy."
  },
  {
    "headline": "Obaseki insists on restructuring of Ambrose Alli varsity to meet global standards, attract foreign partners – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured that his government will ensure the restructuring of the state-owned Ambrose Alli University (AAU) to meet global standards and attract foreign partnership.\nAccording to him, “this is one institution that we are very proud of as Edo people.\nThe institution has an amazing manpower; if you talk about the Law School, at one time, all the prize winners were from AAU.\nAAU is Edo State university; it is not a local university.\nIn his remarks, former Minister of Works, Mr. Mike Onolememen, assured the governor that the entire Esan people are fully in his support."
  },
  {
    "headline": "Obaseki plans new airport in Edo North – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki is in talks with investors, development partners and other stakeholders on the construction of an airport in Edo North Senatorial District to open up the area and rev up economic activities in the state.\nThe governor said: “There are some key projects that we want to implement in Edo North.\nThere are major investors talking to us now and want to come into the state.\n“One of the major things that I want to do is to build an airport.\n“Don’t forget that there are two cement plants in the state, major universities and several other economic opportunities that are involved, and to get people there, we need an airport to make access easy."
  },
  {
    "headline": "Edo begins audit of local govt councils, probes N10bn debt burden – Nigerian Observer",
    "summarized_story": "Obaseki said this during an enlarged meeting with leaders of Edo Central Senatorial District held at Irrua, the administrative headquarters of Esan Central Local Government Area of Edo State.\nHe said: “I am doing an audit of all the local governments.\nWe don’t take money or touch the local government’s money.\nWe are transparent and open as we don’t interfere in the local government’s finances.\n“70 to 80 percent of finance for local governments comes from Abuja and there will be problems if the money stops coming."
  },
  {
    "headline": "EIRS Commends Guinness For Being Tax Compliant – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Internal Revenue Service (EIRS), has commended Guinness Nigeria Brewery Factory, Benin, for it’s tax compliance during a routine tax verification exercise.\nThe EIRS Director, Formal Sector and representative of the Executive Director, Income Taxes, Mrs. Grace Ainabe while interfacing with management of Guinness during the EIRS “Operation Know Your Tax Payers,” tax drive to the brewery stated that the EIRS was out to maintain a robust relationship with its tax payers.\nShe noted that this visitation was not to witch hunt but a routine visitation to build trust and harmony, bring taxpayers/company up to speed with EIRS tax routine as well as engender a good relationship between both establishments.\nAfter an inclusive zoom meeting with it’s partner and head of office to bring it up to speed with EIRS tax routine, Site Manager, Guinness, Mr. Tony Aloze, affirmed that they were bound by the business tenets of transparency, accountability and timeliness which has allowed the company to operate above board to become good corporate citizens."
  },
  {
    "headline": "INEC to publish new polling units next week",
    "summarized_story": "ADVERTISEMENTThe Independent National Electoral Commission (INEC) says it has completed its background processes on the establishment of new polling units in some locations in Nigeria.\nThe step to the expansion of voter access to polling units has been one of the commission’s age-long goals to decongest existing polling units in parts of the country.\nMr Yakubu said the commission would release a full list of new polling units next week.\n“We earlier assured Nigerians that we shall conclude work on the expansion of voter access to polling units and make the new polling units available to citizens ahead of the CVR exercise.\nA comprehensive list of the new polling units will be published next week."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "CBN gas policy holds out promise for domestic market",
    "summarized_story": "We are major resource holders, major exporter of gas, at the same time we struggle on the domestic front with de-industrialization, with unmet domestic gas demand and insufficiency in gas supply to the power sector for power generation,” President of the Nigerian Gas Association (NGA), Mrs Audrey Joe-Ezigbo, once said.\nUnder the NGEP, the CBN is providing N250 billion loan to help stimulate investment in the gas value chain as part of its efforts to stimulate finance to critical sectors of the economy.\nHe urged operators in the gas industry to take advantage of the fund to further expand the sector and increase the penetration of gas consumption.\nMr. Lambert Ojo, a gas processing and evaporative cooling specialist, believes the intervention for local investors in the gas sector would stimulate the economy.\n“We have enough to do in the domestic gas space."
  },
  {
    "headline": "Two shot as protesters block Kebbi governor’s convoy",
    "summarized_story": "Two persons were reportedly shot and injured on Saturday after residents of a community, recently attacked by bandits, blocked the convoy of Governor Atiku Bagudu of Kebbi State while protesting against insecurity in the state.\nThe protest followed the killing of 88 persons by bandits in Danko-Wasagu Local Government Area of the state on Thursday.\nResidents said a vehicle attached to the governor’s convoy was burnt by the protesters after shots fired by security agents to disperse the crowd hit two persons.\nThe governor, following the incidents, urged residents to be optimistic about the security situation in their area.\nWhat is required (is) mutual trust and respect for all,” the governor’s spokesperson, Yahaya Sarki, said in a statement."
  },
  {
    "headline": "Nigerian govt summons US, EU, UK, Canada, Sweden envoys over comments on Twitter ban",
    "summarized_story": "Nigeria’s Federal Government has summoned the ambassadors of the United States, United Kingdom, Canada and the European Union in Nigeria over their comments on the suspension of microblogging site Twitter in Nigeria.\nThe envoys had criticised the government’s decision to ban the social media platform, calling it an abuse of right to freedom of speech.\nThis was disclosed in an invite to journalists by Kimiebi Ebienfa of the Crisis Monitoring and Public Communications Division of the Nigerian Ministry of Foreign Affairs, on Monday.\n“The venue is Minister’s Conference Room, 8th Floor.\nYou are here invited to cover the Meeting."
  },
  {
    "headline": "Nigerian govt orders broadcast stations to go off Twitter",
    "summarized_story": "The National Broadcasting Commission (NBC) has directed all broadcast stations in the country to suspend the patronage of Twitter with immediate effect.\n“In Compliance to the above directive, Broadcasting Stations are hereby advised to de-install Twitter handles and desist from using Twitter as a source (UGC) of information gathering for News and programmes Presentation especially phone-in.\n“Section 2(1) r of the NBC Act entrusts the Commission with responsibility to ensure strict adherence to the national laws, rules and regulations.\nAlso, Section 3.11.2 of the Nigeria Broadcasting Code provides that “the broadcaster shall ensure that law enforcement is upheld at all times in a matter depicting that law and order are socially superior to or more desirable than crime and anarchy.\n“Note that it will be unpatriotic for any broadcaster in Nigeria to continue to patronise the suspended Twitter as a source of its information therefore strict compliance is enjoined.”"
  },
  {
    "headline": "Twitter Ban: MRA, IPC Threaten To Report Nigeria Before AU, UN Bodies",
    "summarized_story": "Arguing that the action is an unjustifiable violation of the rights of all Nigerians to freedom of expression and access to information, while also contravening the relevant instruments of both bodies.\n“The pertinent questions here are: who is the government accusing of using the platform for activities capable of undermining Nigeria’s corporate existence?\nIs it the owners of Twitter that are posting such tweets?\nOr is it all Nigerians who are on Twitter or some of those Nigerians who use Twitter?\nAccording to him, “If some Nigerians on Twitter are using it in a manner that displeases the Government, how is banning Twitter for all Nigerians, in contravention of international norms an appropriate response?"
  },
  {
    "headline": "Twitter Ban: MRA, IPC Threaten To Report Nigeria Before AU, UN Bodies",
    "summarized_story": "Arguing that the action is an unjustifiable violation of the rights of all Nigerians to freedom of expression and access to information, while also contravening the relevant instruments of both bodies.\n“The pertinent questions here are: who is the government accusing of using the platform for activities capable of undermining Nigeria’s corporate existence?\nIs it the owners of Twitter that are posting such tweets?\nOr is it all Nigerians who are on Twitter or some of those Nigerians who use Twitter?\nAccording to him, “If some Nigerians on Twitter are using it in a manner that displeases the Government, how is banning Twitter for all Nigerians, in contravention of international norms an appropriate response?"
  },
  {
    "headline": "TB Joshua Died Exactly 4 Years After Helping Me Out Of Prison – Kemi Olunloyo",
    "summarized_story": "Popular journalist, Dr Kemi Olunloyo, has said that she felt pained over the death of Prophet Temitope Balogun Joshua, popularly known as TB Joshua, saying he was the only preacher who accepted to help negotiate her release from prison seven years ago.\nShe noted that while many pastors were not willing to plead with her accuser, the general overseer of Salvation Ministries, Pastor David Ibiyeomie, TB Joshua did.\nIt is about TB Joshua.\nIt was TB Joshua that made that move to find out what did this woman do and what happened?\n‘’I was told by my mother that TB Joshua called Pastor Ibiyeomie, I don’t know whether they have called and met TB Joshua, I never met him before, I just watched his crusade on television, and when I finally talked with T.B Joshua he told me ‘don’t worry about it, that I don’t need to announce it’."
  },
  {
    "headline": "TB Joshua Died Exactly 4 Years After Helping Me Out Of Prison – Kemi Olunloyo",
    "summarized_story": "Popular journalist, Dr Kemi Olunloyo, has said that she felt pained over the death of Prophet Temitope Balogun Joshua, popularly known as TB Joshua, saying he was the only preacher who accepted to help negotiate her release from prison seven years ago.\nShe noted that while many pastors were not willing to plead with her accuser, the general overseer of Salvation Ministries, Pastor David Ibiyeomie, TB Joshua did.\nIt is about TB Joshua.\nIt was TB Joshua that made that move to find out what did this woman do and what happened?\n‘’I was told by my mother that TB Joshua called Pastor Ibiyeomie, I don’t know whether they have called and met TB Joshua, I never met him before, I just watched his crusade on television, and when I finally talked with T.B Joshua he told me ‘don’t worry about it, that I don’t need to announce it’."
  },
  {
    "headline": "7 Years After Abduction, Federal Govt Commissions Chibok Girls’ School",
    "summarized_story": "Seven years after Boko Haram terrorists abducted over 200 schoolgirls from Chibok Girls’ Secondary School including destroying the school structure, President Muhammadu Buhari on Monday commissioned the newly remodelled school in Chibok local government area of Borno State.\nLEADERSHIP recall that there has been ill-feeling from the Chibok community over the abandonment of the school years after its destruction despite the huge amount said to have been approved for the reconstruction of the school.\nMeanwhile, with the completion of the reconstruction work, the remodelled school has been renamed ‘Government Secondary School Chibok’ as it is now a mix school of boys and girls.\nMrs Tallen said: “We sympathise with the Chibok community.\n“The reconstructed Chibok school have a state-of-the-art classrooms, library and laboratory, computer and ICT center, a sports arena and a clinic."
  },
  {
    "headline": "Anambra Guber: My legacy supeceeds influence of APGA in the state – Aspirant",
    "summarized_story": "By Tom OkpeA governorship aspirant of the All Progressives Congress, (APC) Dr Chidozie Nwankwo in the November 6th state governorship election has stated that his legacy in the state superceeds influence of the ruling party, All Progressives Grand Alliance, (APGA) led Willy Obiano.\nHe also said if given the mandate, there will be a drastic change in the state, saying he will turn the state to an industrial hub in Africa.\nI have always brought change to whatever I do.\n“There have been absolute peace in Anambra state.\n“My reputation in Anambra state, having being the head of the biggest markets in onitsha, which controls all the elites that are decision makers in all the 177 communities."
  },
  {
    "headline": "APC, building infrastructure that drives Nigeria’s growth, prosperity",
    "summarized_story": "By Tom Okpe(APC-LAC) has stated that with more roads and rail lines being built, completed in the country, the All Progressives Congress, (APC) is building infratsructure that will drive Nigerias’ growth and prosperity.\n“His administration has committed more resources to Infrastructure than any other administration since 1999.\n“This week, the President will commission the 156km Lagos-Ibadan Standard Gauge Rail, the first double-track Standard Gauge Rail project in West Africa (and the first Standard Gauge Rail project in Nigeria to be started and completed by the same administration).\n“This landmark commissioning is taking place nine months after the President commissioned the 327km Itakpe-Warri Standard Gauge Rail, completed by his administration 33 years after construction began.\n“The 168km Abuja-Kaduna Rail project, and the 42.5km Abuja Light Rail project, both inherited from previous administrations, were completed in 2016 and 2018 respectively."
  },
  {
    "headline": "Africa not prepared for 3rd wave of COVID-19 outbreak, WHO warn —",
    "summarized_story": "*Says, surge of new cases threatens health facilitiesDoosuur Iwambe,AbujaThe World Health Organisation, WHO has cautioned against an imminent outbreak of a third wave of COVID-19 saying, Africa is not prepared.\nThe WHO Regional Director for Africa, Dr Matshidiso Moeti, gave the warning during the weekly online press conference in Geneva.\n“The threat of a third wave in Africa is real and rising.\nAccording to WHO, Africa has officially registered over 4.8 million COVID-19 cases and 130,000 deaths, representing 2.9 percent of global cases and 3.7 percent of deaths.\nA DRC health ministry official confirmed “the third wave of COVID-19 is already there — it’s the Indian (Delta) and South African (Beta) variants,” adding that this wave was potentially “deadlier” than previous ones."
  },
  {
    "headline": "Vandalized assets in FCT to cost N2.6bn",
    "summarized_story": "Ukpono Ukpong, AbujaThe Minister of the Federal Capital Territory (FCT), Malam Muhammad Bello, says the FCT Administration needs N2.6 billion to replace 25,462 assets vandalised in the territory.\nOthers are; 467 water board inspection chamber covers, 47 fire hydrant covers and 756 telecom duct covers.\nHe said that public assets destruction constitutes a serious health and security challenges in the FCT.\nBello noted that the destruction of water board inspection chamber covers had adverse effect on water supply in the territory.\nAny of the street you notice blackout sometimes and you think it is public blackout, it is not."
  },
  {
    "headline": "Twitter ban: Don’t harass foreign envoys, PDP warns FG, APC",
    "summarized_story": "The party said this after the Federal Government summoned envoys of the United States, the United Kingdom, the European Union, Canada among others.\nThe envoys had stood on the side of Nigerians against the suspension of Twitter in Nigeria by the Federal Government.\n“In fact, the defence of such rights is a fundamental duty which envoys owe their host nations and the international community.\n“The PDP, therefore, cautions that any harassment or assault on foreign envoys places them at great risk as well as pitch our nation against other members of the international community.\n“Already, the PDP is perfecting processes for legal action against the APC-led Federal Government’s suspension of Twitter and the directive to broadcasting stations to pull out of Twitter."
  },
  {
    "headline": "Twitter ban: Don’t harass foreign envoys, PDP warns FG, APC",
    "summarized_story": "The party said this after the Federal Government summoned envoys of the United States, the United Kingdom, the European Union, Canada among others.\nThe envoys had stood on the side of Nigerians against the suspension of Twitter in Nigeria by the Federal Government.\n“In fact, the defence of such rights is a fundamental duty which envoys owe their host nations and the international community.\n“The PDP, therefore, cautions that any harassment or assault on foreign envoys places them at great risk as well as pitch our nation against other members of the international community.\n“Already, the PDP is perfecting processes for legal action against the APC-led Federal Government’s suspension of Twitter and the directive to broadcasting stations to pull out of Twitter."
  },
  {
    "headline": "No going back on full implementation of IRU-V.I master plan –Sanwo-Olu",
    "summarized_story": "By GBENGA ADEOLA…Glamour, Glitz as Clerics, Others Task Oniru on Service, Humility, TransparencyLagos State Governor Mr. Babajide Sanwo-Olu has restated his administration’s commitment to the full implementation of Iru-Victoria Island Lagos Master Plan, saying that the axis is too critical to the economic posterity of the state to be ignored.\nHe added that more infrastructural and economic development had taken place in his kingdom within the first year of his ascendancy.\nHe said that with Oba Lawal, the kingdom would witness more transformation and developments.\nHe said: “I know very well that his wealth of experience will bring about positive economic development into Iruland.\nHe also charged them embrace local and foreign investors to bring about positive development to the kingdom."
  },
  {
    "headline": "No going back on full implementation of IRU-V.I master plan –Sanwo-Olu",
    "summarized_story": "By GBENGA ADEOLA…Glamour, Glitz as Clerics, Others Task Oniru on Service, Humility, TransparencyLagos State Governor Mr. Babajide Sanwo-Olu has restated his administration’s commitment to the full implementation of Iru-Victoria Island Lagos Master Plan, saying that the axis is too critical to the economic posterity of the state to be ignored.\nHe added that more infrastructural and economic development had taken place in his kingdom within the first year of his ascendancy.\nHe said that with Oba Lawal, the kingdom would witness more transformation and developments.\nHe said: “I know very well that his wealth of experience will bring about positive economic development into Iruland.\nHe also charged them embrace local and foreign investors to bring about positive development to the kingdom."
  },
  {
    "headline": "Kumuyi breaks silence on FG’s ban on Twitter in Nigeria",
    "summarized_story": "By Kazeem UgbodagaGeneral Superintendent, Deeper Christian Life Ministry, Pastor William Kumuyi has broken his silence on the ban of Twitter in Nigeria by the Federal Government.\nThe Federal Government on Friday suspended Twitter indefinitely in Nigeria following its deletion of an offensive tweet by President Muhammadu Buhari.\nKumuyi, in a tweet on Monday said his tweets were targetted at over 100 nations where the church has branches.\nThe renowned preacher, however, encrypted his opinion on the Twitter ban by Buhari, by noting that tweeting is in accordance with Article 19 of the United Nations universal declaration of human rights.\nThe tweets here are in accordance with Article 19 of the United Nations universal declaration of human rights,” Adeboye stated on Twitter."
  },
  {
    "headline": "Hyundai launches all-new CRETA vehicle in Nigeria",
    "summarized_story": "By Daniels EkugoHyundai Motor Nigeria has launched its all-new CRETA vehicle in Nigeria with a redesigned and more powerful SUV model set to create unparalleled driving experiences for customers across the region.\nMr Gaurav Vashisht, Head Sales and Marketing at Hyundai Motors Nigeria, said: “Developing high-quality vehicles are at the core of our vision and this is reflected with the all-new Hyundai CRETA model.\nThe Smart stream G1.5 (maximum power of 115ps/6,300rpm and maximum torque of 14.7kgf.m/4,500rpm) and the Kappa 1.4T-GDI (140ps/6,000rpm and 24.7kgf.m/1,500-3,200rpm) are both gasoline engines, providing better fuel economy on the roads.\nOffering more choice is the diesel U2 1.5 VGT (DSL) engine, which has a maximum power of 115ps/4,000rpm and a maximum torque of 25.5kgf.m/1,500-2,750rpm.\nWith the passengers’ safety the utmost priority for Hyundai, the CRETA is safer than before."
  },
  {
    "headline": "NSCDC sends all-female combatants to secure Katsina, FCT schools",
    "summarized_story": "The Nigeria Security and Civil Defence Corps, (NSCDC) has commissioned an all-female combatant squad, as part of its ‘Safe Schools Initiative’.\nIt has consequently announced the first phase of deployment of some of its personnel, to schools in the Federal Capital Territory (FCT) and Katsina state, promising to deploy more to other states.\nNSCDC Commandant General (CG), Dr Ahmed Audi, made this disclosure on Monday, during a special parade, simulation exercise and unveiling of the squad, at the NSCDC Headquarters parade ground in Abuja.\nAccording to the CG, with the recent Government proposed Safe School Initiative, the NSCDC made bold to express readiness to confront kidnapping and banditry activities, within and around school’s environment.\nHe said that the female squad was to complement the efforts of their male counterparts and work together with sister agencies."
  },
  {
    "headline": "FG Didn’t Give Conditions To Lift Twitter Ban – Ministry",
    "summarized_story": "According to the Ministry of Foreign Affairs, the Federal Government has not set any conditions for lifting the ban on Twitter in the country.\n‘Clarification Of Comments By The Honourable Minister Of Foreign Affairs At His Meeting With Envoys’ was the heading of the document.\nOn Saturday, the five entities issued a statement protesting Twitter’s suspension in Nigeria, calling it a breach of the right to free expression.\n“This statement by the Honourable Minister has been quoted out of context.\n“The Ministry wishes to state categorically that the Honourable Minister did not give any conditions regarding lifting the Twitter suspension,” Nwonye said."
  },
  {
    "headline": "Oyo Massacre: Akintoye Says Buhari Govt Backs Fulani Terrorists And Has DeclaredWar Against Yoruba",
    "summarized_story": "“Yoruba land has been surrounded, and we must act now”, the renowned scholar declared, adding that Yoruba people have never been conquered.\nYoruba youths should prepare for “technical, spiritual, and physical warfares,” according to the second republic member of the Senate.\n“The Fulani herdsmen attack must never be allowed to succeed anywhere in Yoruba land again”.\n“The Federal Government of Nigeria has failed woefully to protect the Yoruba people and other indigenous peoples of Nigeria’s South and the Middle Belt against these invading, marauding forces.\n“We call on all Yoruba people to rise up as one to defeat this danger."
  },
  {
    "headline": "More Political Appointees Resign From Gov Ayade’s APC Led Government",
    "summarized_story": "The two stated in their resignation letters to the governor that they had opted to stay with the People Democratic Party (PDP) after careful thought.\nAccording to Mark Obi,“Following recent happenings in the political alignment of the State Governor, I am persuaded to review my involvement in the current administration.\nCecil in her letter said, “Please accept this letter as formal notice of my resignation as the Director-General Urban Renewal Commission (South).\n“After a period of consideration, I have decided to remain with the People’s Democratic (Party (PDP).\nCross River State Scrap Regulatory Agency and then Director-General Urban Renewal Commission (South)."
  },
  {
    "headline": "IGP Alkali Baba Suspends Tinted Windscreen Permits In Nigeria",
    "summarized_story": "The Nigerian Inspector-General of Police, Alkali Baba, has stated that tinted vehicle windscreen permits will be suspended immediately.\nOn Monday, Baba made the news during a meeting with senior police personnel from throughout Nigeria, including commissioners and DIGs.\nWhile making the announcement, the IGP stressed that roadblocks are still illegal in the country, warning that chiefs of commands must implement the prohibition and focus on the road patrol plan as a substitute for roadblocks.\nPresident Muhammadu Buhari named Usman Baba as interim Inspector General of Police on April 6.\nHis confirmation came during a meeting of the Police Council, which was presided over by the President on Friday at the Presidential Villa in Abuja."
  },
  {
    "headline": "Breaking: Gunmen kill 3 as troops repel attack on Kaduna-Zaria highway",
    "summarized_story": "Troops of the 4Demo Nigerian Army on Monday repelled an attack along Kaduna-Zaria highway, Igabi local government area of Kaduna state, even as the fleeing gunmen shot to death two villagers and a traveller.\n“Troops of the 4Demo Battalion, Nigerian Army, have reported to the Kaduna State Government that armed bandits were repelled in some locations along the Kaduna-Zaria highway, in Igabi local government area.\n“The bandits were reportedly sighted moving towards the highway from Sharu village in the Kerawa area.\n“The retreating bandits also raided Mashashiya and Farguza villages, from where they stole some livestock and other valuables.\n“Receiving the reports, Governor Nasir el-Rufai condoled the families of those killed by the retreating bandits, and prayed for the repose of their souls."
  },
  {
    "headline": "Breaking: Days after confirmation, IGP Baba suspends licence for tinted window vehicles",
    "summarized_story": "The Inspector-General of Police Usman Alkali Baba has ordered immediate suspension of tinted vehicle windscreens in Nigeria.\nThe IGP gave the order this on Monday during a meeting with senior police officers drawn from parts of the country.\nThose in attendance at the meeting include Deputy Inspector General of Police (DIGs), Assistant Inspector General of Police (AIGs) and Commissioners of Police (CPs).\nThe IGP insisted that vehicular patrol would remain the only strategic policing means instead of roadblocks.\nHe also spoke on the need for the senior police officers to ensure discipline in their various commands."
  },
  {
    "headline": "Pictures: FG meets US, UK, EU, Canada Envoys over Twitter ban",
    "summarized_story": ""
  },
  {
    "headline": "AuGF seeks independent, protection of audited entity from external influence -NigPilot",
    "summarized_story": "Auditor-General for the Federation AuGF Aghughu Adolphus, has reiterated that the United Nations General Assembly’s resolutions of 2011 and 2014 recognized the fact that the Supreme Audit Institutions can accomplish their tasks objectively and effectively only if they are independent of the audited entity and are protected against outside influence.\nHe made this known during a presentation at the National Public hearing of the Senate Committee on the review of the Constitution of the Federal Republic of 1999 (as amended).\nHe emphasized that strengthening the Supreme Audit Institutions will enable them to promote their public mandate with efficiency, effectiveness, transparency and accountability.\nThe AuGF went ahead to call amendments that will strengthen the Audit Institutions both at the Federal and state levels administratively and financially in terms of independence.\nHe also mentioned that the national public hearing provided another opportunity for citizens to be actively involved by contributing to decisions that will undoubtedly have impacts on their lives."
  },
  {
    "headline": "AuGF seeks independent, protection of audited entity from external influence -NigPilot",
    "summarized_story": "Auditor-General for the Federation AuGF Aghughu Adolphus, has reiterated that the United Nations General Assembly’s resolutions of 2011 and 2014 recognized the fact that the Supreme Audit Institutions can accomplish their tasks objectively and effectively only if they are independent of the audited entity and are protected against outside influence.\nHe made this known during a presentation at the National Public hearing of the Senate Committee on the review of the Constitution of the Federal Republic of 1999 (as amended).\nHe emphasized that strengthening the Supreme Audit Institutions will enable them to promote their public mandate with efficiency, effectiveness, transparency and accountability.\nThe AuGF went ahead to call amendments that will strengthen the Audit Institutions both at the Federal and state levels administratively and financially in terms of independence.\nHe also mentioned that the national public hearing provided another opportunity for citizens to be actively involved by contributing to decisions that will undoubtedly have impacts on their lives."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "IGP Announces Immediate Suspension Of Tinted Vehicle Windscreens",
    "summarized_story": "The Inspector-General of Police Usman Alkali Baba has announced the immediate suspension of tinted vehicle windscreens in Nigeria.\nThe IGP announced this on Monday during a meeting with senior police officers including commissioners and DIGs from across the states.\nREAD ALSO: Twitter Ban: FG Meets Envoys Of Top Diplomatic MissionsThe IGP also spoke concerning the arrest of high-profile criminals.\nTinted Glass LawGeneral Ibrahim Babangida in February 1991 promulgated a decree prohibiting the tinting and use of cars with tinted glasses.\nThe decree is now known as the Motor Vehicles (Prohibition of Tinted Glass) Act, 1991; made up of only six (6) sections."
  },
  {
    "headline": "FG Holds Town Hall Meeting On Protection Of Public Infrastructure",
    "summarized_story": "A town hall meeting on the protection of public infrastructure is currently holding in Abuja, the nation’s capital.\nThe Ministry of Information and Culture had earlier launched the town hall meeting series in Lagos on April 25th, 2016.\nThey include Otedola bridge, Kara bridge, Tamburawa bridge, Obalande bridge among others which according to him costs the government over N4billion to repair.\nMinister of Transportation, Rotimi Amaechi said foreigners also support the destruction of rail lines in Nigeria.\nHe explained how a Chinese was caught in Jos, the Plateau State capital vandalising rail lines alongside some Nigerians."
  },
  {
    "headline": "NBC Directs All Broadcasting Stations To Deactivate Twitter Accounts",
    "summarized_story": "The National Broadcasting Commission (NBC) has directed all broadcasting stations to deactivate their Twitter accounts and suspend the patronage of the microblogging service provider.\nIn the statement signed by Professor Armstrong Idachaba, the NBC noted that the directive is consequent on the suspension of Twitter operations in Nigeria by the Federal Government.\nCiting the persistent use of Twitter for activities that are capable of undermining Nigeria’s corporate existence, the government suspended Twitter operations indefinitely.\nIn line with this, NBC directed all broadcasting stations not to patronize the social networking service and to desist from using the platform as a source of information.\nBelow is a copy of the NBC communique obtained by Channels Television."
  },
  {
    "headline": "PDP Caucus Threatens Legal Action Against FG Over Twitter Ban",
    "summarized_story": "The Peoples Democratic Party (PDP) caucus in the House of Representatives has threatened legal action against the Federal Government over its ban of Twitter operations in Nigeria.\nA statement by the leader of the caucus Kingsley Chinda on Sunday noted that the Nigerian government does not have the power to ban the social media platform, arguing that the action lowers the country’s image in the eyes of other democratic nations.\nREAD ALSO: Twitter Ban: There Is No Constitutional Authority To Support FG’s Peremptory Action – NBAThe caucus faulted the directive to the National Broadcasting Commission to license social media operators in the country, describing it as an attempt to introduce the ‘Social Media Bill’ by mere executive fiat.\nAccording to them, the move is a violation of the doctrine of separation of powers and an erosion of the rule of law.\n“Whilst, these manifestly undemocratic actions of government on its own is grave enough, we fear that it may be a precursor to more ominous actions of blotting out dissenting voices,” the lawmakers explained."
  },
  {
    "headline": "Nigerian Footballer’s Drowning Was An ‘Accident’ – Belarusian Club – Channels Television",
    "summarized_story": "Belarus Premier League side FC Vitebsk have said the drowning of Nigerian footballer Kelvin Odenigbo was an “accident.”The club doctors on Monday explained that following forensic examinations, no violent marks were seen on the 20-year-old’s body.\nREAD ALSO: Tunisia Stand Between Algeria And African Unbeaten RecordThe footballer was found dead after drowning in a lake in Belarus over the weekend.\n“We express our sincere condolences to the family and friends of the football player, as well as to all the fans of the team,” the club said.\nThe Nigerian who played four games this season for the Belarus team also provided one assist for the sixth-placed club.\nHe joined the club from the Nigerian National League team NAF Rockets FC, at the end of last season before sealing a permanent deal for the 11-match-old 2021/22 campaign."
  },
  {
    "headline": "Gov Ortom asks FG to implement policy on yearly recruitment of Police personnel",
    "summarized_story": "Benue State Governor, Samuel Ortom said if the Federal Government had kept its promise to recruit 10,000 Police Officers yearly, 40,000 officers would have been recruited by now.\nGovernor Ortom who stated this in Makurdi while addressing personnel of the disbanded Vigilante Group saying such a number would have contributed significantly in the security architecture of the country.\nGovernor Ortom reasoned that if that policy was carried out faithfully, the question of personnel shortfall in the Police would have been addressed.\nGovernor Ortom stated that the law establishing Community Volunteer Guards would be amended to make provision for a state commander and other leadership structures, stressing that at present, Permanent Secretary Bureau of Internal Affairs heads the steering committee for the formation.\nRepresentatives of the three senatorial districts in separate remarks, commended Governor Ortom for the interface with them and pledged their support for the Community Volunteer Guards and the entire security architecture of the State."
  },
  {
    "headline": "U.S Govt approves new Alzheimer’s treatment despite experts’ concerns",
    "summarized_story": "Despite concerns from independent advisers that the much-debated medication has not been shown to help slow the brain-destroying disease, US government health officials approved the first new medicine for Alzheimer’s disease in nearly 20 years.\nIt is the only drug that US regulators have said can likely treat the underlying disease.\nThe medicine produced by Biogen for individuals with Alzheimer’s disease has been approved by the Food and Drug Administration.\nPhysicians, medical experts, and patient groups are bound to dispute over the decision, which could affect millions of people and their families.\nAdvertisementThe new drug, which Biogen developed with Japan’s Eisai Co, did not reverse mental decline, only slowing it in one study."
  },
  {
    "headline": "Obi Umahi resigns as head of Ebubeagu South East Security Committee",
    "summarized_story": "The chairman of the South East Security Committee, codenamed, Ebubeagu, Major General Obi Abel Umahi (rtd) has resigned his position.\nUmahi tendered his resignation in a letter dated June 4, 2021, entitled: “Resignation as Chairman South east Security Committee – Ebubeagu” and addressed to chairman of the South East Governor’s Forum.\nThe committee was composed of members of SE Security committee, the Attorney generals of the five Southeast states and some prominent Igbo sons and daughters.\nSubsequently, the draft legal framework produced by the 21-man Committee was reviewed by SE Security Committee members and the Attorney Generals of the five Se States to suit South East Ebubeagu Security outfit.\nFrom inception to date, SE Security Committee was never funded at all in any capacity and not even an office space was provided."
  },
  {
    "headline": "Yoruba Nation Agitators Are Foolish, Says Aregbesola – Trending with Ojy Okpe",
    "summarized_story": "The Socio-Economic Rights and Accountability Project sent an Urgent Appeal to the Secretary-General of the Commonwealth, Dame Patricia Scotland to consider recommending the suspension of Nigeria from the commonwealth.\nDespite the directive by the Attorney-General of the Federation and Minister of Justice, Abubakar Malami, to prosecute violators of the Twitter ban in Nigeria, the Governor of Kaduna State Nasir el-Rufai, on Sunday, dared the minister by tweeting barley 24hours after the directive .\nOver the weekend Yoruba nation secessionists, led by Sunday Adeyemo popularly Known as Sunday Igboho trooped out in their numbers for an agitation rally in Ekiti state.\nThe Minister of Interior and former Governor of Osun State Rauf Aregbesola over the weekend condemned Yoruba Nation agitators, describing them as ignorant and foolish for demanding secession.\nAs the drums of war continue to sound despite the interventions of stakeholders who believe that Nigeria might not survive another civil conflagration, a video of former head of state Yakubu Gowon has emerged, in which he spoke about those fanning the embers to be ready to take responsibility."
  },
  {
    "headline": "The Impact Of Twitter Ban On Nigerian Businesses",
    "summarized_story": "Charles Okaformbah, Co-founder and CTO of Blockchain solutions firm Convexity, and Ifeoma Illoh, Business Growth Consultant, spoke to the Global Business Report about the impact of the Twitter ban on Nigerian businesses.\nWhat is the way forward for these businesses?\nWatch this informative video to find out…"
  },
  {
    "headline": "Super Eagles, Indomitable Lions Clash Again in Vienna on Tuesday",
    "summarized_story": "Nigeria and Cameroon will once more battle it out at the Stadion Wiener Neustadt in the second of a two-match friendly programme in the Austrian capital, Vienna.\nThe Super Eagles created chance after chance but failed to get the ball into the net.\nAfter Friday’s game, Rohr told the media: “We missed seven key players due to injuries, so it was not our best team, but it was good to see other players.\n“We took the game seriously because we played against a tough opponent, a big game against a big rival.\nA sense of purpose to win the second game reigns supreme in the Eagles’ Hilton Garden Inn camp in Wiener Neustadt, 46 kilometres outside Vienna."
  },
  {
    "headline": "Mali Coup Leader Goita Sworn in as President",
    "summarized_story": "Leader of Mali’s junta Col Assimi Goïta has officially been sworn in as the troubled country’s interim president and promised “credible, fair and transparent elections” which are expected in February next year, AFP reports.\nOn May 24 Goita dismissed the transitional civilian president and prime minister, which caused former colonial power France to suspend its cooperation with the military.\nBut on Monday, Goita assured Mali would respect its commitments to the international community and expressed his desire to organise “credible, fair, transparent elections within the scheduled deadlines,” that is to say, February 2022.\n“I would like to reassure the sub-regional and regional organizations and the international community in general that Mali will honour all of its commitments for and in the best interests of the nation,” he said after his inauguration as transitional president.\nBut there has been a noticeable rapprochement between the group and the army since the May 24 coup."
  },
  {
    "headline": "Amotekun Is for Border Control, Lagos Focusing on Community Policing: Lagos Governor Sanwo-Olu",
    "summarized_story": "‘It’s Time for State Policing’: Lagos Governor Sanwo-olu on Insecurity, Twitter Ban and Two Years of StewardshipA week ago, Governor Babajide Sanwo-Olu of Lagos State marked his second year in office.\nIn those two years, the governor has been confronted with a mixed bag of issues, especially having to deal with a debilitating pandemic, which threatened to derail his agenda.\nThe challenges notwithstanding, a lot more is expected of Sanwo-Olu as he embarks on the second half of his first term in office.\nThe Lagos governor was on ARISE NEWS’ Morning Show to touch on these issues and many more of national importance,m including insecurity.\nWatch this engaging interview for more…"
  }
]