[
  {
    "headline": "Corps members replace striking doctors in FMC Yola",
    "summarized_story": "Corps members on Thursday replaced the striking doctors in the Federal Medical Centre, Yola, the News Agency of Nigeria reports.\nNAN reports that the National Association of Resident Doctors directed its members across the country to embark on a total strike from Aug. 2.\nA NAN correspondent who monitored some hospitals in Yola reports that Corps members could be seen offering skeletal services to some patients with emergencies.\nThe NYSC doctors and other senior medical officers also attended to patients with emergency cases.\nHe noted that NARD was only one category of medical doctors."
  },
  {
    "headline": "Customs seize N234m contraband goods in Kaduna",
    "summarized_story": "The Customs Strike Force Team Zone ‘B’, Kaduna said it has seized smuggled items within the quarter of the 2021 worth over N234m.\nHe said the Strike Force Team in the zone, within the period under review, arrested two suspects in connection with some of the seizures but granted administrative bail.\nHe said, “I wish to warn smugglers to relocate from the zone or have us to contend with or they should desist and embrace legitimate businesses.\nIf they are allowed, they will run down the economy and return the country to recession.\nThe Nigeria Customs will not allow that to happen.”"
  },
  {
    "headline": "11 hostages escape from Kaduna bandits’ camp, police recue 2",
    "summarized_story": "By Ibrahim Wuyo, KADUNANo fewer than 11 hostages escaped from bandits’ camps on the outskirts of Sabon Birni town, Igabi L0cal Government Area of Kaduna State.\nSamuel Aruwan, Commissioner, Ministry of Internal Security and Home Affairs, Kaduna State, said on Thursday that ongoing security operations in the state dislodged many of the bandits’ camps, which enabled hostages to escape.\nAccording to him, careful checks revealed that the 11 hostages are a mix of those kidnapped from Dumbin Rauga, Zaria council and also along the Kaduna-Zaria Highway.\nBut the bandits reneged on the agreement to release the captives, insisting that two motorcycles must be included in the ransom deal.\nThe governor sent his prayers and best wishes to all the former hostages as they rejoined their families."
  },
  {
    "headline": "Assault: Return to your country, serving, retired envoys tell Indonesian ambassador",
    "summarized_story": "By Elizabeth OsayandeThe Association of Foreign Relations Professionals of Nigeria, AFRPN, yesterday asked the Indonesia Ambassador to Nigeria, Dr. Ural Harahap to return to his country until a satisfactory explanation is given for the assault on Nigerian diplomat, Mohammed Buba in Jakarta, the capital, and steps taken to assuage frayed nerves.\nThe group, which is composed of serving and retired ambassadors, also in a statement, lauded the recall of Nigeria’s Ambassador to Indonesia, Usman Ogah, until the issue was resolved.\nREAD ALSO: FG summons Indonesian ambassador to Nigeria over alleged assault on Nigerian diplomatic agentIn the statement, titled: ‘’Undiplomatic and uncivilized treatment of a Nigerian diplomat in Indonesia,’’ the group called for the sacking of the immigration officials.\nAmb Lawal said the assault on Buba was a violation of Article 29 of the Vienna Convention on Diplomatic Relations, 1961.\n“The AFRPN commends the immediate step taken by our Ministry of Foreign Affairs in summoning the Indonesian ambassador before receiving the full report from its embassy as a first step in the series of reactions reserved for such heinous diplomatic blunder."
  },
  {
    "headline": "FG to reintroduce toll plazas on highways — Fashola",
    "summarized_story": "This is coming 18 years after the administration of President Olusegun Obasanjo dismantled all toll plazas on federal roads across the country in 2003.\nHis words: “The Ministry of Works and housing presented a policy memorandum for the approval of federal roads, bridges, tolling policy, and also a regulation that will provide legal framework for the tolling policy.\nSome of the highlights are that we will adopt an open tolling policy as distinct from a closed tolling policy.\n“The close toll systems means that you will pay tolls over the distance you travel and the size of your vehicle.\n“We concede this as a national policy that’s why we’re making a very general framework."
  },
  {
    "headline": "Life of Activism: Why 15-yr wait for UNILORIN certificate didn’t destroy me — Rasheedat Adesina",
    "summarized_story": "Whenever I had an exam, I would go into the exam hall with the court order.\nI would take out the court order and asked the person to sign that he/she was disobeying the court order.\nLooking at the Student Unions of higher institutions today, can you compare them with the old days?\nStudent Unions of higher institutions today cannot be compared with the past.\nMost student unions today are completely dependent and mere extensions of the school authorities."
  },
  {
    "headline": "Delta APC Coalition passes vote of confidence on Omo-Agege’s leadership",
    "summarized_story": "Omo-AgegeBy Jimitota Onoyume & Chancel SundayThe Delta State Coalition for Ovie Omo-Agege Political Vanguards has passed a vote of confidence on the leadership of the Deputy Senate President, Barr Ovie Omo-Agege, in the state chapter of the All Progressives Congress, APC.\nThe Coalition also distanced itself from the erstwhile state coordinator of the group, Chief Charles Olisa, stressing that he was on his own and his defection to the Peoples Democratic Party, PDP, was unfortunate for him.\nThis was contained in communique issue, yesterday, in Warri, sequel to an emergency meeting convened by the state executive of the Coalition, which was attended by the state APC leaders, elders, stakeholders and members of the Coalition.\nIfeanyi Okowa and the PDP, he has done that on his own peril, and his defection is quite unfortunate for him.\n“The Coalition also used the opportunity to pass a vote of confidence on the leadership qualities of DSP Omo-agege and the Delta APC CECPC under the leadership of Prophet Jones Erhue in position the party for 2023 by conducting a successful state ward congress”."
  },
  {
    "headline": "Education, technology needed to achieve MDG – Analyst",
    "summarized_story": "A social commentator and political analyst, Engr.\nBusuyi Ayowole, has said that for Nigeria to fully achieve the Millennium Development Goals (MDG), there has to be an adoption of a two way approach for massive development in the education and technology sector.\nWhile stressing that technology will enhance local production and block capital flight, Ayowole noted that the country is short of the needed funds to achieve the aims of the MDG.\nAyowole disclosed that Nigeria used to have zealous leaders in government at the start of the millennium as this resulted in debt forgiveness.\nHe also charged Nigerians to stop electing people with nothing to offer into political offices."
  },
  {
    "headline": "Borno EYN demolition: We’re with Jesus – Church members sing as slain member is buried",
    "summarized_story": "The EYN (Ekklesiyar Yan’uwa of Nigeria) has buried Ezekiel Bitrus, the member shot dead during the church demolition by the Borno State Government.\nLast Thursday, the Borno Geographic Information System (BOGIS) pulled down the building with valuables inside.\nBitrus, 29, died after security operatives attached to the agency fired live bullets as worshippers protested the destruction of the EYN branch.\nBOGIS Executive Secretary, Adam Bababe was almost lynched by charged youths who vowed to retaliate the daylight murder.\nI must go, I must go!”On Sunday, EYN congregants and other Christians – in solidarity – observed service and prayers inside rubbles of the demolished church."
  },
  {
    "headline": "Ohanaeze youth, women elections conducted by Obiozor faction illegal – Chidi Ibe",
    "summarized_story": "The apex Igbo socio-cultural group, Ohanaeze Ndigbo, has berated the purported election held for the youth and women wings of the organization by the George Obiozor-led faction.\nThe highest Igbo ethnic body urged the Ndigbo to discounternance the purported exercise that produced the duo as national officers of the youth and women wings.\nChidi Ibe was genuinely and dully elected as President General alongside with officers of the national executives, including the youth and women wings elections that were subsequently conducted”.\nThe Ohanaeze Ndigbo also stressed that it would ensure the application of equity, justice and fairness in her administration and management of the affairs.\nRecall that the youth and women of the Ohanaeze Ndigbo had on 5th and 6th of August, 2021 held its national election at the headquarters in Enugu State."
  },
  {
    "headline": "Rivers: Contender for Choba community’s traditional stool dies on judgment day",
    "summarized_story": "One Samuel Echendu, who was contending for the traditional stool of Choba community in Obio-Akpor Local Government Area of Rivers State with his younger brother and current king, Eze Raymond Echendu, is dead.\nEchendu’s death comes as a High Court sitting in Port Harcourt fixed 20 August for the judgment in a suit he instituted against his younger brother over the rightful person to occupy the traditional stool of Choba community.\nThe matter, which was initially adjourned for judgment yesterday, Wednesday, could not go on as planned.\nEchendu, who died yesterday, had upon installation of his immediate younger brother Eze Raymond as the Paramount ruler of Choba approached the court to nullify the installation and install him as the rightful occupant of the traditional stool in line with Ikwerre culture and tradition.\nA family source, who confirmed the death, said Samuel Echendu was not sick and had prepared to go to court on Wednesday for the judgment when he collapsed and was later confirmed dead by a medical doctor."
  },
  {
    "headline": "Mohammed Fawehinmi: Buhari condoles with late activist’s family",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family of late human rights activist, Mohammed Fawehinmi, over his death.\nDAILY POST had reported that Mohammed, son of late activist, Gani Fawehinmi, died after complaining of difficulty in breathing.\nA statement issued by Buhari’s Special Adviser on Media and Publicity, Femi Adesina, said the deceased did justice to the memory of his late father.\nBuhari also condoled with Ganiat, mother of the deceased, and the entire Fawehinmi family.\nThe statement added that, “His body may have been broken, but his spirit was virile, agile, and he kept the flag of the family flying, doing justice to the memory of his late father.”"
  },
  {
    "headline": "Fawehinmi’s family restricts public from residence",
    "summarized_story": "By Adebisi OnanugaThe family of late Chief Gani Fawehinmi on Thursday restricted members of the public on condolence over the death of his son, Mohammed, from accessing their Ikeja GRA residence.\nAs early as 7.00 am, visitors were stopped from accessing the Fawehinmi’s residence by security men at the entrance of the street.\nOthers, who somehow beat security checks, were stopped from accessing the family house located on Ademola street by a family member.\nA source said visitors were disallowed into the family compound because mother of the deceased, Mrs. Ganiyat Fawehinmi, is yet to be informed of the sad incident.\nAmong those who had registered their condolence are Law lecturer, Faculty of Law, University of Lagos (UNILAG) Akoka, Wahab Shittu and Executive Director, International Press Centre, Lanre Arogundade."
  },
  {
    "headline": "JUST IN: FG to consider lockdown for Delta variant if…",
    "summarized_story": "By Bolaji Ogundele, AbujaThe Federal Government has said total lockdown will be the last resort in its strategy to contain spread of Delta variant of COVID-19.\nAccording to him, countries have become circumspect with imposing total lockdowns as it was seen at the onset of the outbreak.\nHe also revealed apart from the vaccines sourced free of charge, Nigeria has paid for about 30 million doses of Johnson&Johnson doses.\nAccording to him, since the prices of the one-shot vaccine have dropped, the country hopes to purchase about 40 million doses of the vaccines in all.\nEhanire said the 176,000 doses of the Johnson&Johnson doses have already been received while the rest will come in batches."
  },
  {
    "headline": "Baba Dee lambast Sound Sultan’s ‘fake friends’",
    "summarized_story": "By Ekaete BasseyVeteran singer Dare Fasasi aka Baba Dee, has lambasted people who disguised as friends of his late younger brother Sound Sultan.\nBaba Dee, who described many of the late singer’s friends as “fake,” noted they merely used the event of his demise to trend and generate social media content for their selfish purposes.\nADVERTISEMENTIn a recent post shared by Baba Dee, he also revealed the late singer’s so-called friends have not attempted to reach out to his wife since his demise nor they did make out time to attend his memorial service.\nHe wrote: “Fake friends, not a call to his wife, didn’t bother to attend his memorial event on a sit at home Saturday.\n“Posting pictures and videos on social media, your deaths shall also be used to generate social media content.”"
  },
  {
    "headline": "BBNaija Shine Ya Eye: Nini, Tega, Peace, Michael, Liquorose win N500k each",
    "summarized_story": "By Gbenga BadaFive BBNaija Shine Ya Eye housemates, Nini, Tega, Peace, Michael and Liquorose have won N2.5 million as prize money.\nThe housemates won the sum of N500, 000 each after emerging tops in a Guinness Gold challenge during the day.\nThe Head of House, Pere, had read out the information passed across to them from Biggie after the contest held earlier in the day.\nADVERTISEMENTBiggie lauded all the housemates for their creativity and also bringing out their inner expressions during the challenge.\nHousemates have been winning prize money for different sponsored challenge since the commencement of the reality TV show on Saturday, July 24, 2021."
  },
  {
    "headline": "IBB at 80: Abdulsalami, David Mark, Iwuanyanwu, others converge on Abuja",
    "summarized_story": "From Aidoghie Paulinus, AbujaFormer Military Head of State General Abdulsalami Abubakar (retd), former Senate President Senator David Mark, and elder statesman Chief Emmanuel Iwuanyanwu are amongst eminent Nigerians currently meeting in Abuja in commemoration of the 80th birthday anniversary of former Military President General Ibrahim Badamasi Babangida.\nThe event which was organised by the Ibrahim and Maryam Babangida Library and Museum, is titled ‘Ibrahim Badamasi Babangida Legacy Dialogue 2021.\nIn his opening remarks, Chairman of the occasion Chief Raymond Dokpesi dismissed negative attributes by some Nigerians to Babangida’s reputation over the years.\nHe specifically absolved Babangida of the blame of the annulment of the June 12, 1993, presidential election and the alleged missing $12 billion oil windfall while he held away as military head of state.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "FG may lift Twitter suspension soon",
    "summarized_story": "He said the Federal Government’s committee negotiating with Twitter will meet on the agreement soon to make recommendations.\n“The question I think has to do with the status of the conversation between us and the Twitter company.\nWe’ve engaged Twitter, we set up a technical committee to engage Twitter, they set up their own committee too.\nAs of today, we are not aware of any Twitter representative in Nigeria, and we say representative shall be a staff of Twitter so that he can have access to global management of Twitter.\n“We also asked Twitter, in addition to registering the Nigerian company, to register with relevant regulatory authorities like National Information Technology Development Agency, Nigeria Communications Commission and National Broadcasting Commission."
  },
  {
    "headline": "2023: George, Ogunlewe clash over Tinubu",
    "summarized_story": "By Chinelo ObogoFormer minister of works, Adeseye Ogunlewe, has urged the All Progressives Congress (APC) to zone the 2023 presidency to the South West while claiming only former governor of Lagos State, Bola Tinubu can lead the party to victory.\n“We have people who have followed politics for a while, Tinubu and Atiku Abubakar are such persons.\nBut reacting, Olabode George, former national vice chairman of the Peoples Democratic Party (PDP) for South West, said if the former Lagos governor emerges president, he would renounce his citizenship.\n“Ogunlewe was talking about Tinubu emerging president, someone who is the greatest headache of politics in Nigeria today?\n“Ogunlewe had in the past made very vicious comments against Tinubu but because he is now with them, he is praising him."
  },
  {
    "headline": "Shell pays N46bn to Ogoni community in final compensation – The Sun Nigeria",
    "summarized_story": "Ibrahim Buba, then of Port-Harcourt Division of the Federal High Court, in June 2010, gave judgment in favour of the Ogoni people awarding N17 billion as compensation.\nThe court equally granted the Ogoni chiefs a 25-percent interest charge on the principal sum of about N17 billion.\nLucius Nwosu, lead counsel to the Ogoni communities had noted that the judgement sum, with the accrued interests, stood at about N182 billion.\nIt was learnt that the Ogonis waived the interest on the principal amount as concession agreed upon during reconciliation.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Hushpuppi: 31 lawyers volunteer to defend Kyari",
    "summarized_story": "From Okwe Obi, AbujaRespite may have come for suspended Deputy Commissioner of Police, Abba Kyari, as 31 lawyers drawn from the 19 Northern states have volunteered to offer free legal services for him in the United States.\nRecall that a District Court in the United States had ordered the Federal Bureau of Investigation (FBI), to arrest Kyari for allegedly arresting and torturing one Vincent Chibuzor, on the behest of Ramon Abbas popularly known as Hushpuppi, after the latter threatened to expose a $1 million fraud committed against a Qatari businessman.\nHushpuppi is standing trial for money laundering and internet fraud which he has pleaded guilty.\nSalisu said: “In apparent response to recent calls for support for Abba Kyari by the Coalition of Northern Groups (CNG), a group of about 31 young northern Nigerian lawyers has volunteered to render legal services to the embattled Deputy Commissioner of Police.\nThis comprises: ‘The right to an appeal to competent national organs against acts of violating his fundamental rights as recognised and guaranteed by conventions, laws, regulations and customs in force.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Buhari: Nigeria’s $3bn Share of Africa’s $75bn FDI Unacceptable",
    "summarized_story": "Buhari, who spoke at a retreat organised by the Nigeria Extractive Industries Transparency Initiative (NEITI) in Uyo, the Akwa Ibom State capital, described the situation as unacceptable.\nBut in Nigeria, Buhari reaffirmed the country’s commitment to using the Extractive Industries Transparency Initiative (EITI) to implement reforms and enhance revenue growth.\nAccording to the United Nations Conference on Trade and Development (UNCTAD) 2020 World Investment Report, FDI flows to Nigeria showed a 48.5 per cent decrease compared to the previous year.\nBuhari stated, “The board of NEITI must articulate a new approach and seek productive collaborations, where necessary, to make Nigeria investment destination and dramatically increase the quantum of investments to the country.\nMeanwhile, Biden’s aides are pressuring OPEC and its allies to increase oil output to tackle rising petrol prices, which they see as threating global economic recovery."
  },
  {
    "headline": "Your Opinions on Supreme Court Judgment, Malicious, Self-serving, Buni Tells Keyamo, Others",
    "summarized_story": "But Buni, while inaugurating Appeal Committees on the recently-conducted Ward Congresses yesterday in Abuja, said, the comments from some persons, who should have known better was just to play on the gullibility of the public.\n“The majority judgment of the Supreme Court has strengthened the position of the CECPC and our Chairman.\n“However, it is expected that where ever and whenever there’s a competition, of course, there is bound to be contestations.\nThe chairman noted that the actions of the members in this regard would help engender cohesion, build trust and confidence in this all-important exercise.\nHe maintained that the committee has been entrusted with one of the most solemn obligations of citizenship, which was to help deepen democratisation processes and strengthen the polity."
  },
  {
    "headline": "FG Set to Reintroduce Tollgates on Highways 18 Years After",
    "summarized_story": "The planned reintroduction of tollgates comes 18 years after the administration of former President Olusegun Obasanjo dismantled all toll plazas on federal roads throughout the country in 2003.\nHe explained, “The Ministry of Works and Housing presented a policy memorandum for the approval of federal roads, bridges, tolling policy, and also a regulation that will provide legal framework for the tolling policy.\n“Some of the highlights are that we will adopt an open tolling policy, as distinct from a closed tolling policy.\nThe difference is that only open tolling policy, which is what we were used to, you pay at a barrier over a fixed or predetermined distance.\n“The closed toll system means that you will pay tolls over the distance you travel and the size of your vehicle."
  },
  {
    "headline": "Osinbajo: Great Nations Too Face Security, Economic Challenges",
    "summarized_story": "This, he claimed was especially so in countries, “where you have a multi-racial, multi-religious setup, and the greatest nations in the world are multi-racial, multi-religious, and multi-ethnic.\nI believe very strongly that the greatness of nations, wherever those nations may be, have always been on account of leaders, who thought it fit to build those nations on the basis of unity and tolerance.\nShe added that increased military presence was also required in Igabi, Chikun, Giwa and Kajuru Local Government Area of the state.\nShe applauded the leadership of the Operation Safe Haven in trying to secure the Southern part of the state.\n“I would like to particularly appreciate His Excellency, the Governor, Nasir El-Rufai, for all the support we enjoy from him and from the Government of Kaduna State."
  },
  {
    "headline": "12 Years after Fawehinmi’s Death, his Son, Mohammed Dies of Covid-19",
    "summarized_story": "Segun James and Wale IgbintadeTwelve years after a legal luminary of global reckoning, Chief Gani Fawehinmi passed, his scion, Mohammed, died last night of complications from Covid-19.\nAlthough some other sources claimed Mohammed died of an undisclosed ailment at a private hospital in Lagos, THISDAY however confirmed he died of complications arising from Covid-19.\nIn a statement, the junior minister lamented: “My brother, friend and son of my late boss, Mohammed Fawehinmi, is gone.\nAlso, The Centre for Human and Socioeconomic Rights, said demise of Mohammed Fawehinmi, was a terrible loss.\nAccording to him, the death of Mohammed Fawehinmi, implies that Gani Fawehinmi’s household may be finally missed in the activism circle."
  },
  {
    "headline": "\"The Bags Belong To The Governor\"—Power-Drunk Bayelsa State Governor, Douye Diri, Aides Breach Airport Security Procedure, Refuse To Be Screened To Board Flight",
    "summarized_story": "The Governor of Bayelsa State, Douye Diri, on Wednesday, violated the airport security procedures, particularly at airport security checkpoints at the Terminal 2 of the Murtala Muhammed Domestic Airport in Lagos.\nEyewitnesses told SaharaReporters that the governor and his aides treated the airport security rules and procedures with disdain.\nIt’s insane, this can only happen in Nigeria.”This is not the first time powerful Nigerians, especially politicians, would refuse to follow security procedures at airports in Nigeria.\nIn 2017, SaharaReporters exposed how a former aviation minister, Femi Fani-Kayode, constantly breached airport security procedures.\nSee Also Sahara Reporters Former Aviation Minister Femi Fani-Kayode ‘Constantly’ Breaching Airport Security Procedures - Sources"
  },
  {
    "headline": "\"The Bags Belong To The Governor\"—Power-Drunk Bayelsa State Governor, Douye Diri, Aides Breach Airport Security Procedure, Refuse To Be Screened To Board Flight",
    "summarized_story": "The Governor of Bayelsa State, Douye Diri, on Wednesday, violated the airport security procedures, particularly at airport security checkpoints at the Terminal 2 of the Murtala Muhammed Domestic Airport in Lagos.\nEyewitnesses told SaharaReporters that the governor and his aides treated the airport security rules and procedures with disdain.\nIt’s insane, this can only happen in Nigeria.”This is not the first time powerful Nigerians, especially politicians, would refuse to follow security procedures at airports in Nigeria.\nIn 2017, SaharaReporters exposed how a former aviation minister, Femi Fani-Kayode, constantly breached airport security procedures.\nSee Also Sahara Reporters Former Aviation Minister Femi Fani-Kayode ‘Constantly’ Breaching Airport Security Procedures - Sources"
  },
  {
    "headline": "\"The Bags Belong To The Governor\"—Power-Drunk Bayelsa State Governor, Douye Diri, Aides Breach Airport Security Procedure, Refuse To Be Screened To Board Flight",
    "summarized_story": "The Governor of Bayelsa State, Douye Diri, on Wednesday, violated the airport security procedures, particularly at airport security checkpoints at the Terminal 2 of the Murtala Muhammed Domestic Airport in Lagos.\nEyewitnesses told SaharaReporters that the governor and his aides treated the airport security rules and procedures with disdain.\nIt’s insane, this can only happen in Nigeria.”This is not the first time powerful Nigerians, especially politicians, would refuse to follow security procedures at airports in Nigeria.\nIn 2017, SaharaReporters exposed how a former aviation minister, Femi Fani-Kayode, constantly breached airport security procedures.\nSee Also Sahara Reporters Former Aviation Minister Femi Fani-Kayode ‘Constantly’ Breaching Airport Security Procedures - Sources"
  },
  {
    "headline": "BREAKING: Gani Fawehinmi’s First Son, Mohammed Is Dead",
    "summarized_story": "Mohammed Fawehinmi, the first child of the late legal luminary, Chief Gani Fawehinmi, is dead.\nThough details of his death are still sketchy, SaharaReporters gathered that Mohammed died on Wednesday in an undisclosed hospital after complaining of difficulty in breathing.\nMohammed was a graduate of Business Administration at the University of Lagos.\nHe obtained an LLB degree from the University of Buckingham, England, and was called to the Nigerian Bar in 1998.\nUntil his death, he was the head, Mohammed Fawehinmi’s Chambers; Director, Nigerian Law Publications Limited; Director, Books Industries Nigeria Limited, and Director, Gani Fawehinmi Library & Gallery Limited."
  },
  {
    "headline": "BREAKING: Gani Fawehinmi’s First Son, Mohammed Is Dead",
    "summarized_story": "Mohammed Fawehinmi, the first child of the late legal luminary, Chief Gani Fawehinmi, is dead.\nThough details of his death are still sketchy, SaharaReporters gathered that Mohammed died on Wednesday in an undisclosed hospital after complaining of difficulty in breathing.\nMohammed was a graduate of Business Administration at the University of Lagos.\nHe obtained an LLB degree from the University of Buckingham, England, and was called to the Nigerian Bar in 1998.\nUntil his death, he was the head, Mohammed Fawehinmi’s Chambers; Director, Nigerian Law Publications Limited; Director, Books Industries Nigeria Limited, and Director, Gani Fawehinmi Library & Gallery Limited."
  },
  {
    "headline": "EXTRA: Businessman sentenced to 30 months in jail for calling Fintiri ‘father of thieves’",
    "summarized_story": "A Yola chief magistrate court has sentenced Ali Yakubu Numan, a businessman, to two and a half years in prison for calling Ahmadu Umaru Fintiri, Adamawa governor (pictured), “father of all thieves”.\nAdvertisementThe businessman, who described Fintiri as “a thief and father of thieves”, was remanded in prison custody following his arraignment on defamation charges by the attorney-general of Adamawa state.\nIn the publications, he described Fintiri as a thief and father of all thieves in Nigeria who stole noodles, spaghetti and billions of naira from the state coffers.\nNuman was sentenced to a two-year jail term with an option of N50,000 fine for using abusive language against Fintiri.\nHe was also sentenced to six-month imprisonment without the option of a fine for disturbance of public peace."
  },
  {
    "headline": "EXTRA: Businessman sentenced to 30 months in jail for calling Fintiri ‘father of thieves’",
    "summarized_story": "A Yola chief magistrate court has sentenced Ali Yakubu Numan, a businessman, to two and a half years in prison for calling Ahmadu Umaru Fintiri, Adamawa governor (pictured), “father of all thieves”.\nAdvertisementThe businessman, who described Fintiri as “a thief and father of thieves”, was remanded in prison custody following his arraignment on defamation charges by the attorney-general of Adamawa state.\nIn the publications, he described Fintiri as a thief and father of all thieves in Nigeria who stole noodles, spaghetti and billions of naira from the state coffers.\nNuman was sentenced to a two-year jail term with an option of N50,000 fine for using abusive language against Fintiri.\nHe was also sentenced to six-month imprisonment without the option of a fine for disturbance of public peace."
  },
  {
    "headline": "Oshiomhole doesn't want to return as APC chairman, says aide",
    "summarized_story": "Victor Oshioke, an aide to Adams Oshiomhole, former national chairman of the All Progressives Congress (APC), says his principal is not planning to lead the ruling party again.\nAdvertisementOshioke said this in reaction to the report that the former governor of Edo state is making a comeback as the APC national chairman.\nThe APC national working committee (NWC) led by Oshiomhole was dissolved by the party’s national executive committee (NEC) in June 2020 following a protracted leadership crisis.\nMinister of State for Labour and Employment, and others were plotting to bring back Comrade Adams Oshiomhole as national chairman of the APC.\n“Keyamo also offered legal advice on the legality of the NEC that was convened for the dissolution of the Oshiomhole led National Working Committee of APC and emergence of the Governor Mai-Mala Buni led Caretaker Committee."
  },
  {
    "headline": "Oshiomhole doesn't want to return as APC chairman, says aide",
    "summarized_story": "Victor Oshioke, an aide to Adams Oshiomhole, former national chairman of the All Progressives Congress (APC), says his principal is not planning to lead the ruling party again.\nAdvertisementOshioke said this in reaction to the report that the former governor of Edo state is making a comeback as the APC national chairman.\nThe APC national working committee (NWC) led by Oshiomhole was dissolved by the party’s national executive committee (NEC) in June 2020 following a protracted leadership crisis.\nMinister of State for Labour and Employment, and others were plotting to bring back Comrade Adams Oshiomhole as national chairman of the APC.\n“Keyamo also offered legal advice on the legality of the NEC that was convened for the dissolution of the Oshiomhole led National Working Committee of APC and emergence of the Governor Mai-Mala Buni led Caretaker Committee."
  },
  {
    "headline": "'It's an obnoxious practice' -- Enugu traditional rulers' council outlaws girl-child marriage",
    "summarized_story": "The Enugu state traditional rulers’ council has outlawed girl-child marriage and other forms of gender-based harmful practices in the state.\nAdvertisementA communique signed by Lawrence Agubuzu, chairman of the council, said the council is committed to the abolition of the obnoxious practice of sacrificing the girl child to shrines.\nAgubuzu said the council condemned all forms of violence against women and the girl child and is committed to their empowerment in the state.\nAdvertisementHe said the council is committed to the abrogation of harmful traditional widowhood practices, including disinheritance of widows.\n“Subsequently, we will have an Enugu state that is free from all forms of violence against women and girl child,” Agubuzu said."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "Impressive H1 result shows cinemas rebound",
    "summarized_story": "With a total movie ticket sales of N959.9 million (almost N1bn) from half year of 2021, the Nigerian movie sector is fast recovering from the impact of the coronavirus pandemic that grounded the sector from March ending till September 2020.\nThe 2021 half year result, which is over N500 million less than the N1.5 billion…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos to create N5.2trn electricity market from gutting dirty generators",
    "summarized_story": "If residents of Lagos State are provided reliable grid power, they would save over N5.2 trillion currently spent generating 15,000mw of power through dirty generators, an incentive spurring the state government’s independent power market dream.\nOlalere Odusote, Lagos commissioner for energy and mineral resources, in a public consultation forum held virtually on Wednesday, said fresh…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s supermarkets record first decline in five years",
    "summarized_story": "Nigeria’s supermarkets record first decline in five yearsFor the first time in five years, Nigeria’s modern retail trade market declined by 5.4 percent to $25.2 billion in 2020 from $26.7 billion in 2019, as shown by new data from Euromonitor International, a provider of strategic market research.\nThe modern retail trade involves a more planned and organised approach to distribution and logistics…"
  },
  {
    "headline": "Artiste, OneofAfrica urges fellow artistes to see Police as partners in Nigeria project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – A United States of America based Nigerian artiste, Ogbonna Nnamdi Emmanuel, yesterday, urged fellow artistes to see the Nigerian Police as co-partners in progress in the development of the country rather than seen them as their archenemies.\nHe made the call when he played host to the Edo State Police Command, Benin City to notify them of his proposed musical tour and masking of his face.\nNnamdi, whose stage name is OneofAfrica and record label, Donedealinternational, said most Nigerians artistes see and believe that the police are their enemies who they must avoid by all means possible.\n“So, I am just trying to express my views in my generation of how I see life and how i understand situations”, he said.\nDike, while speaking on the proposed musical tour, asked him to apply to the command when it is time for it."
  },
  {
    "headline": "CBN releases guidelines for regulation, supervision of CGCs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Central Bank of Nigeria (CBN) on Tuesday released guidelines for registration and supervision of Credit Guarantee Companies (CGCs) in Nigeria.\nThe guidelines are contained in a circular by Ibrahim Tukur, CBN’s Director, Financial Policy and Regulation Department, addressed to Commercial Banks, Other Financial Institutions and Stakeholders in the Financial Services Industry.\nTukur said that the guidelines were in furtherance of effort to improve lending for Micro, Small and Medium Enterprises (MSMEs).\n“An exposure draft of the guidelines is hereby issued for comments and observations.\nHe urged stakeholders to send their comments and observations on the guidelines within three weeks."
  },
  {
    "headline": "FG spends N8m in daily feeding of pupils in Enugu State – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestENUGU – The Federal Government, on Tuesday, said it spends about N7,998,270 in daily feeding of a total of 114,261 pupils in public primary schools within Enugu State.\nFarouq, represented by Ms Adanne Wadibia-Anyanwu, Team Lead, Enugu State Monitoring and Enumeration of the programme, said that the government had engaged 1,532 cooks who supply the daily meals to the pupils in the state.\nShe noted that the programme has greatly impacted pupils in classes between primary 1 and primary 3 in 799 public schools within the 17 council areas of the state.\n“The current enumeration and bio-data capturing is a building block towards the expansion of the programme to include more pupils and schools in the state.\nThe ministry monitoring and enumerating team later went to a primary school complex within Idaw River area in Enugu South Local Government with five primary schools."
  },
  {
    "headline": "IPOB chief priest in Imo, recover arms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOWERRI – Police command in Imo says it has arrested a native doctor, Ikechukwu Umaefulam, suspected to be the chief priest of the proscribed Indigenous People of Biafra (IPOB).\n“Sequel to the ceaseless raids on the proscribed IPOB/ESN camps and the successful neutralisation and decimation of the terror groups in the state, the command has arrested the chief priest of the terror group.\n“On 4/8/2021 at about 1820 hours, while interrogating suspects arrested from Okporo, Orlu LGA, one of the suspects revealed that they now patronise spiritual homes before attacking police stations.\n“The suspect led the ever active Imo command’s tactical team to the home of one Ikechukwu Umaefulem, the Chief Priest and Spiritual leader of Life Sabbath Synagogue Amii, Akabo in Ikeduru LGA.\n“When his spiritual home and premises was searched, police recovered one pump action gun with five rounds of live ammunition,” he said."
  },
  {
    "headline": "Senate queries PPPRA for failing to recover N1.6 billion overpaid to oil marketers",
    "summarized_story": "Although the state oil company, NNPC, is now the main importer of petrol in Nigeria, oil marketers used to import petroleum products with their funds and recover their money afterwards, through the PPPRA.\nBut in 2015 the oil marketers recovered N1.6 billion more than was required, the audit report noted.\nPREMIUM TIMES reported how seven MDAs including the Ministries of Information, Police and Health, refused to appear before the Senate Committee.\n“The practice has been that Oil Marketers will pay for the product and later recover their money from the federal government (through PPPRA).\nIn the case under review, the Oil Marketers over recovered what was due to them by N1,596,803,859.97 and that amounted to over payment to the marketers."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun Commissioner, Oyebamiji celebrates Alapomu @58, says he is a blessing to his kingdom",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Commissioner for Finance, Mr Bola Oyebamiji has felicitated with the Alapomu of Apomu kingdom, Oba Kayode Adenekan Afolabi as the royal father marks his 58th birthday anniversary, describing him as a blessing to Apomu kingdom.\nOyebamiji said the respected royal father has graciously used his resources and networks to enhance the lot of his people and bring colour to his exalted royal office.\nThe statement reads, “On behalf of myself and my family I congratulate our dear king, the Alapomu of Apomu kingdom, Oba Kayode Adenekan Afolabi on his 58th birthday anniversary.\nThe Alapomu’s contribution to the growth of Apomu kingdom and the entire state is remarkable and impressive.\n“Alapomu has been a blessing to Apomu, and his reign has witnessed unprecedented development across the nooks and crannies of the ancient town."
  },
  {
    "headline": "Nigeria’s fed. govt. approves $2.5m, N498.2m for 4 power projects",
    "summarized_story": "Nigeria’s Federal Executive Council has approved the sum of $2,541,689 and N498,230,281 for four projects in the Ministry of Power.\nThe Minister said: “The Federal Ministry of Power also received the blessing of the Federal Executive Council by giving four approvals for our contracts.\nSince the ratification of the Paris Agreement on Climate Change in 2016 and even before then, government has put in a number of interventions to deal with the issue of climate change.\nYou see, climate change did not just start in 2016.\n2016 happened to be just like the culmination of the problem that showed and there’s need for an immediate action on climate change."
  },
  {
    "headline": "Nigeria records highest cases of Covid-19 tally in six months, as concerns over Delta variant mount",
    "summarized_story": "Nigeria is now averaging over 700 cases of Covid-19 according to Nigeria Center for Disease Control (NCDC).\nThis is as states across the country struggle to curb the spread of COVID-19 Delta variant.\nAccording to report, owing to a sudden surge, driven by the highly transmissible Delta variant, the country’s average daily COVID-19 cases showed that Wednesday’s increase was the highest since February.\nAnambra and Bayelsa recorded 2 cases each and Plateau-1, while three states, Kano, Nasarawa and Sokoto, reported zero cases, NCDC said.\nThe agency reported that vaccination was also providing better protection, than natural immunity, for adults previously infected with COVID-19, from getting re-infected."
  },
  {
    "headline": "Enugu traditional rulers outlaws girl child marriage, gender based violence",
    "summarized_story": "The Enugu State Traditional Rulers Council has outlawed girl-child marriage and other forms of gender-based harmful practices in the state.\nThe conference was organised in partnership with the Ford Foundation with support from Enugu State Ministries of Gender Affairs, Chieftaincy Matters and Justice and the 50/50 Action Women of the state, NAN reported.\nAgubuzu said the council condemned all forms of violence against women and girl child and was committed to their empowerment in the state.\nHe further said the council was committed to the abrogation of harmful traditional widowhood practices, including disinheritance of widows.\n“Subsequently, we will have an Enugu State that is free from all forms of violence against women and girl child,” Agubuzu said"
  },
  {
    "headline": "IYD 2021: Young Innovative Thinkers Will Lead Next Generation – Gov Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello, has opined that young individuals who would take to innovative thinking would fill leadership space in areas of economy, politics, finance and other spheres in the next generation.\nGovernor Bello also admonished Nigerian youths to carry out valid and accurate research to proffer innovative and localised solutions to the nation’s challenges as against divisive criticisms.\nHe added that rising concerns of food insecurity in the country was largely because there were largely subsistence farming practices over modernised ways while many youths remained focused on other ventures other than agriculture.\nThe governor maintained that youths remained critical stakeholders in ensuring the planet’s healthiness and as a nation, the youths have now realised their roles in nation-building, hence the continued clamour for a power shift to the younger generation.\nWhile congratulating youths across the country on this year’s celebration of International Youth Day, he added that subsequent years would enlist more youths in positions of impact."
  },
  {
    "headline": "IYD 2021: Young Innovative Thinkers Will Lead Next Generation – Gov Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello, has opined that young individuals who would take to innovative thinking would fill leadership space in areas of economy, politics, finance and other spheres in the next generation.\nGovernor Bello also admonished Nigerian youths to carry out valid and accurate research to proffer innovative and localised solutions to the nation’s challenges as against divisive criticisms.\nHe added that rising concerns of food insecurity in the country was largely because there were largely subsistence farming practices over modernised ways while many youths remained focused on other ventures other than agriculture.\nThe governor maintained that youths remained critical stakeholders in ensuring the planet’s healthiness and as a nation, the youths have now realised their roles in nation-building, hence the continued clamour for a power shift to the younger generation.\nWhile congratulating youths across the country on this year’s celebration of International Youth Day, he added that subsequent years would enlist more youths in positions of impact."
  },
  {
    "headline": "APC Legacy Group Commends Buhari Over Feat In Water Sector",
    "summarized_story": "A support group of the All Progressives Congress (APC) known as APC Legacy Awareness and Campaign has commended President Muhammadu Buhari-led administration over its achievements in the water sector.\nIt stated that these projects were part of dozens of projects inherited by the Buhari-led administration in the water sector; many of which had been abandoned prior to 2015.\nAPC-LAC stressed that the current administration has developed a Water Sector Roadmap (2016 — 2030), that is providing inspiration and guidance for the unprecedented work in infrastructure delivery and sector reform.\nLukman, the group reported that a technical audit in 2016 identified 116 inherited projects for priority completion which included 37 Dams and Reservoirs, 41 Water Supply Projects, 38 Irrigation and Drainage Projects.\nIt added that another eight (8) dam projects, eight (8) hydropower projects, sixteen (16) irrigation projects, and eleven (11) Water Supply Projects are scheduled for completion by 2023."
  },
  {
    "headline": "APC Legacy Group Commends Buhari Over Feat In Water Sector",
    "summarized_story": "A support group of the All Progressives Congress (APC) known as APC Legacy Awareness and Campaign has commended President Muhammadu Buhari-led administration over its achievements in the water sector.\nIt stated that these projects were part of dozens of projects inherited by the Buhari-led administration in the water sector; many of which had been abandoned prior to 2015.\nAPC-LAC stressed that the current administration has developed a Water Sector Roadmap (2016 — 2030), that is providing inspiration and guidance for the unprecedented work in infrastructure delivery and sector reform.\nLukman, the group reported that a technical audit in 2016 identified 116 inherited projects for priority completion which included 37 Dams and Reservoirs, 41 Water Supply Projects, 38 Irrigation and Drainage Projects.\nIt added that another eight (8) dam projects, eight (8) hydropower projects, sixteen (16) irrigation projects, and eleven (11) Water Supply Projects are scheduled for completion by 2023."
  },
  {
    "headline": "LASG Has Not Taken Over Lekki Concession Company, Says Omotoso",
    "summarized_story": "Lagos State government has debunked claims in some media reports that it has taken over Lekki Concession Company, describing the information as untrue.\nThe state government in a statement issued by its commissioner for Information and Strategy, Mr. Gbenga Omotoso, noted that reports that the Lagos State House of Assembly had granted the state government the go-ahead to take over the Lekki Concession Company (LCC) were wrong.\n“Lekki Concession Company Limited (“LCC”) is a Special Purpose Vehicle set up specifically to execute the Eti-Osa/Lekki-Epe Toll Road Concession Project.\n“The Lekki Toll Road Concession was conceptualized as a Public-Private Partnership (PPP) scheme, and uses the Build-Operate-Transfer (BOT) model of Infrastructure delivery.\nThe Concession is for 30 years, following which the assets will be transferred to the Lagos State Government."
  },
  {
    "headline": "BBNaija S6: Fans enraged as Pere removes Whitemoney from kitchen for one week",
    "summarized_story": "Pere, the third Head of House for Big Brother Naija Shine Ya Eye season, has removed Whitemoney from the kitchen for a week and the latter’s fans are enraged.\nCalling together the housemates on Wednesday evening, Pere declared that he was removing Whitemoney from kitchen duty.\nCommending Whitemoney for his hardwork, he further said he was against the idea of someone holding the “kitchen monopoly” during the show.\nIn reaction to the HOH’s decision, Whitemoney’s fans took to social media express their displeasure.\nIf he thinks that’s WM’s strategy, it’s a nice move on a game level but this won’t stop WM from wining the show.” @ManlikeIcey tweeted."
  },
  {
    "headline": "BBNaija S6: Fans enraged as Pere removes Whitemoney from kitchen for one week",
    "summarized_story": "Pere, the third Head of House for Big Brother Naija Shine Ya Eye season, has removed Whitemoney from the kitchen for a week and the latter’s fans are enraged.\nCalling together the housemates on Wednesday evening, Pere declared that he was removing Whitemoney from kitchen duty.\nCommending Whitemoney for his hardwork, he further said he was against the idea of someone holding the “kitchen monopoly” during the show.\nIn reaction to the HOH’s decision, Whitemoney’s fans took to social media express their displeasure.\nIf he thinks that’s WM’s strategy, it’s a nice move on a game level but this won’t stop WM from wining the show.” @ManlikeIcey tweeted."
  },
  {
    "headline": "COVID-19: Nigeria records highest cases tally in six months amid delta variant worries",
    "summarized_story": "As states across the country struggle to curb the spread of COVID-19 Delta variant, the nation is now averaging more than 700 new cases, says the Nigeria Center for Disease Control.\nThe News Agency Of Nigeria reports that owing to a sudden surge, driven by the highly transmissible Delta variant, the country’s average daily COVID-19 cases showed that Wednesday’s increase was the highest since February.\nAnambra and Bayelsa recorded 2 cases each and Plateau-1, while three states, Kano, Nasarawa and Sokoto, reported zero cases, NCDC said.\nOne new death was also recorded on Wednesday, bringing the nation’s fatality count, since the start of the pandemic, to 2,195.\nThe agency reported that vaccination was also providing better protection, than natural immunity, for adults previously infected with COVID-19, from getting re-infected."
  },
  {
    "headline": "COVID-19: Nigeria records highest cases tally in six months amid delta variant worries",
    "summarized_story": "As states across the country struggle to curb the spread of COVID-19 Delta variant, the nation is now averaging more than 700 new cases, says the Nigeria Center for Disease Control.\nThe News Agency Of Nigeria reports that owing to a sudden surge, driven by the highly transmissible Delta variant, the country’s average daily COVID-19 cases showed that Wednesday’s increase was the highest since February.\nAnambra and Bayelsa recorded 2 cases each and Plateau-1, while three states, Kano, Nasarawa and Sokoto, reported zero cases, NCDC said.\nOne new death was also recorded on Wednesday, bringing the nation’s fatality count, since the start of the pandemic, to 2,195.\nThe agency reported that vaccination was also providing better protection, than natural immunity, for adults previously infected with COVID-19, from getting re-infected."
  },
  {
    "headline": "Hushpuppi: 31 northern lawyers volunteer to defend Kyari",
    "summarized_story": "Thirty-one lawyers have thrown their weight behind Abba Kyari, the former commander of the Inspector-General of Police Intelligence Response Team.\nThe lawyers on Wednesday volunteered to render free legal services to Kyari currently facing allegations of corruption levelled against him by the Federal Bureau of Investigation in the United States.\nThe spokesperson of the lawyers, Sunusi Bappah Salisu, in a statement said they volunteered to render free legal services for the preservation of Kyari’s fundamental rights.\nHe said the lawyers, who were drawn across all the 19 northern states and religions, also responded to the calls for support for Kyari by the Coalition of Northern Groups.\nHe added that the lawyers would critically review the procedures adopted by the FBI to get the US Court to indict Kyari on allegations of involvement in charges filed against a suspected fraudster, Ramon Abbas aka Hushpuppi."
  },
  {
    "headline": "Road accidents claim 23 lives in Delta – FRSC",
    "summarized_story": "The Federal Road Safety Corps (FRSC), said no fewer than 23 persons died in 40 road traffic crashes between May and July in Delta.\nMr Patrick Okoyeocha, the FRSC Sector Commander in the state told the News Agency of Nigeria (NAN) on Thursday in Asaba that 293 persons were involved in the crashes.\nAccording to Okoyeocha, 270 out of the 293 persons sustained varying degrees of injuries from the crashes.\nHe identified speeding as one of the major causes of road accidents in the state.\n“The command has fought and is fighting relentlessly against reckless driving in the state to prevent loss of lives."
  },
  {
    "headline": "Indonesia Defends Assault As Recalled Envoy, Diplomat Arrive Today",
    "summarized_story": "Usman Ogar, the Nigerian High Commissioner to Indonesia, and Abdulrrahman Ibrahim, a diplomat who was assaulted by immigration agents in the Southeast Asian country, will arrive today.\nIbrahim was assaulted in a car by some Indonesian immigration authorities in Jakarta, according to the PUNCH.\nRecall that the minister summoned Harahap on Monday in connection with the assassination of a Nigerian diplomat in Jakarta.\nHe stated “By that time, they met with Mr Ibrahim, and politely requested him to show his travel document.\nMr Ibrahim elbowed the immigration officer, Mr Laode Hauzan Baidi, who was sitting next to him until Mr Laode’s lip was bleeding."
  },
  {
    "headline": "BREAKING: Missing Ijebu-Ode Community Chief Imam Found Dead Inside Car",
    "summarized_story": "Sheikh Mushafau Bakare, a prominent Islamic cleric and Chief Imam of the Atiba community in Ijebu-Ode, Ogun State, has been found dead after being kidnapped by unknown gunmen.\nBakare’s relatives and close associates had earlier raised the alarm that he had been kidnapped on Wednesday night.\nHis deceased body, on the other hand, was discovered inside his freshly purchased Toyota Highlander in the early hours of Thursday in the Ikangba region of Ogun State’s Odogbolu Local Government Area.\nHis lifeless body was recovered by police officials connected to the Obalende Divisional Police Office in Ijebu Ode, according to reports.\nAccording to Islamic customs, the priest will be laid to rest in the community on Thursday."
  },
  {
    "headline": "FG Announces New Rates For Toll gates Across Nigeria",
    "summarized_story": "The Federal Roads and Bridges Tolling Policy and Regulations have been adopted by the federal government.\nThe endorsement signals the reintroduction of toll gates on federal roads across Nigeria.\nFirst: cars, second: SUVs, third: private buses, fourth: commercial buses, fifth: luxury buses and trucks.\nCars will pay N200; SUVs and Jeeps N300; private buses N300; commercial buses N150; luxury buses and trucks N500.\nThe toll collection will commence once the roads are motorable and will affect only federal dual carriage roads."
  },
  {
    "headline": "Delta Governor, Okowa Shielding His Aide Standing Trial For Murder, Kidnapping, Arson—Group Cries Out",
    "summarized_story": "Conscience Of Delta (CD), a Delta-based human rights organization, has chastised the state governor, Ifeanyi Okowa, for retaining his Special Assistant (SA) on Security Matters, Sunday Okoro, who is accused of many murders, arson, and kidnapping.\nHe is being remanded in a correctional centre in Abuja, awaiting trial.\nMeanwhile, the group, Conscience Of Delta (CD) has condemned the governor’s attitude to the matter.\nIt accused the governor of retaining a “dreaded criminal who has over four unresolved murder cases hanging on his neck as special assistant on security matters”.\nIt said “Okoro is being reminded in a correctional centre, awaiting his trial."
  },
  {
    "headline": "APC: 15 states petition Buni c’ttee over ward congresses, 12 yet to submit reports",
    "summarized_story": "About 15 state chapters of the All Progressives Congress (APC) have petitioned the national secretariat of the ruling party to protest the outcome of the recently conducted ward congresses across the country.\nBlueprint correspondent also gathered that election committees sent to 12 states to conduct the said ward congresses were yet to submit reports of the exercise to the party’s national secretariat.\nBlueprint gathered Wednesday that 15 states, including different factions from Osun, Ekiti, Enugu, Akwa Ibom, Kwara, Niger, Kano among others, had submitted petitions to protest the outcome of the ward congresses.\nMinister of State for Labour and Employment and others were plotting to bring back Comrade Adams Oshiomhole as national chairman of the APC.\n“This is an opportunity to further reaffirm Comrade Adams Oshiomhole’s loyalty to the APC under the able leadership of His Excellency, Governor Mai-Mala Buni."
  },
  {
    "headline": "Cholera spreads, kills 393 in Kano, Katsina, Sokoto, Kebbi, others, many hospitalised",
    "summarized_story": "The cholera outbreak in some states across Nigeria has continued to spread, killing some 393 persons and leaving thousands hospitalised.\nThe affected states are Katsina, Gombe, Kano, Kebbi, Sokoto , and ZamfaraKatsinaIn Katsina state for instance, the state government confirmed the death of 75 people in different parts of the state within the period of five days.\nHe said a total of 1,534 cases were recorded across 25 out of the 34 local government areas of the state.\nThe state commissioner for health, Dr Habu Dahiru, stated this in Gombe while briefing journalists on the update of the cholera outbreak in the state.\nPremium Times reported how the cholera outbreak is spreading in Nigeria with states in the North-west region recording high casualties."
  },
  {
    "headline": "Breaking: FG reveals when ban on Twitter ‘ll be lifted in Nigeria",
    "summarized_story": "Nigerians will soom return to micro blogging platform, Twitter, after the federal government assured that the ban on the social media operations will soon be lifted.\nMinister of Information and Culture, Alhaji Lai Mohammed, gave this the assurance after the week’s virtual Federal Executive Council (FEC) meeting presided over by Vice President Yemi Osinbajo (SAN) at the Presidential Villa, Abuja.\nThe Minister said most of the conditions given to Twitter operations have been accepted.\nHe said the areas still pending such as Twitter setting up an office and having a Twitter staff of management cadre that will serve as the country representative, were being discussed.\nDetails loading…"
  },
  {
    "headline": "FCTA gets $15m COVID-19 intervention funds from FG -NigPilot",
    "summarized_story": "According to him, a significant reopening of the economy has been for several months, but the recovery from last year’s forced contraction and economic difficulties continues.\n“The FCTA is especially eager to support the acceleration and expansion of this recovery to help businesses regain markets, income, and confidence.\nThe effect of the COVID-19 pandemic on the global economy arising from the global lockdown and its severe negative impact on livelihood and food cannot be overemphasized.\n“Result area three, to facilitating recovery of SMEs through grants, under this, a total number of 612 business will benefit directly, while over 10,000 people will benefit indirectly.\nThat it would also support the FCCU in ensuring the prompt release of funds from the treasury for FCT CARES activities of delivery units and FCCU."
  },
  {
    "headline": "FCTA gets $15m COVID-19 intervention funds from FG -NigPilot",
    "summarized_story": "According to him, a significant reopening of the economy has been for several months, but the recovery from last year’s forced contraction and economic difficulties continues.\n“The FCTA is especially eager to support the acceleration and expansion of this recovery to help businesses regain markets, income, and confidence.\nThe effect of the COVID-19 pandemic on the global economy arising from the global lockdown and its severe negative impact on livelihood and food cannot be overemphasized.\n“Result area three, to facilitating recovery of SMEs through grants, under this, a total number of 612 business will benefit directly, while over 10,000 people will benefit indirectly.\nThat it would also support the FCCU in ensuring the prompt release of funds from the treasury for FCT CARES activities of delivery units and FCCU."
  },
  {
    "headline": "School Feeding: Pupils’ biometric data capture’ll boost enrolment in Nigeria – Minister -NigPilot",
    "summarized_story": "Federal Government has said pupils’ biometric data capture would assist to enhance school feeding programmes and increase enrolment figures in the country.\nThe Minister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Umar-Faruq stated this at Gurungawa Primary School, Kano, on Tuesday, while flagging off the School Feeding Enumeration exercise.\nAccording to her, the government initiated what is called National Social Investment Programme, N-SIP, which has four components to achieve the set goal.\nShe said the four components were the N-Power, Conditional Cash Transfer, CCT, Government Enterprise and Empowerment Programme and the National Home Grown School Feeding Programme.\nIn his remarks, the state programme manager, Alhaji Abdullahi Yau commended the minister for initiating the exercise with a view to having accurate data of the beneficiaries."
  },
  {
    "headline": "School Feeding: Pupils’ biometric data capture’ll boost enrolment in Nigeria – Minister -NigPilot",
    "summarized_story": "Federal Government has said pupils’ biometric data capture would assist to enhance school feeding programmes and increase enrolment figures in the country.\nThe Minister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Umar-Faruq stated this at Gurungawa Primary School, Kano, on Tuesday, while flagging off the School Feeding Enumeration exercise.\nAccording to her, the government initiated what is called National Social Investment Programme, N-SIP, which has four components to achieve the set goal.\nShe said the four components were the N-Power, Conditional Cash Transfer, CCT, Government Enterprise and Empowerment Programme and the National Home Grown School Feeding Programme.\nIn his remarks, the state programme manager, Alhaji Abdullahi Yau commended the minister for initiating the exercise with a view to having accurate data of the beneficiaries."
  },
  {
    "headline": "Minister cautions NHGSFP food vendors against sanitation in Jigawa",
    "summarized_story": "Minister of Humanitarian Affairs, Disasters Management and Social Development, Sadiya Umar Farouq has cautioned food vendors against a lackadaisical attitude towards sanitation in communities identified with cholera outbreaks.\nFarouq was specifically speaking to food vendors serving under the National Homegrown Feeding Programme, NHGSFP, at the flag-off of the NHGSFP’s enumeration at Fagoji LIP Primary School in Dutse, Jigawa State, on Tuesday.\nAccording to her, they are in Jigawa for the flag-off of the enumeration of the NHGSFP beneficiaries across the participating states.\n“As we may be aware, the National Homegrown Feeding is funded by the federal government, but implementation is by the state government.\nThe minister, therefore, called on parents, school headmaster, cooks, community leaders to support the federal government efforts for the benefit of the pupils who are eligible for the free meals."
  },
  {
    "headline": "FG Rules Out Another COVID-19 Lockdown Amid Rising Cases",
    "summarized_story": "The Federal Government on Thursday said it was not considering a lockdown despite rising cases of COVID-19 infections across the country.\nSpeaking at the weekly ministerial briefing organized at the State House in Abuja, Minister of Health, Dr Osagie Ehanire, said the number of cases were not threatening enough, yet, for a lockdown to be considered.\nOn Wednesday Nigeria had recorded 790 cases of new COVID-19 infections, according to the Nigeria Centre for Disease Control.\nThe figure was the highest in about six months.\nA recent surge in infections has been partly attributed to the Delta variant, which is believed to be more contagious and deadlier."
  },
  {
    "headline": "Indonesia Formally Apologises To Nigeria Over Manhandling Of Diplomat",
    "summarized_story": "Indonesia has formally apologised over the manhandling of a Nigerian diplomat in the South-East Asia country.\nA viral of video of Mr. Mohammed Buba, an accredited Nigerian diplomat, being rough-handled by Indonesian immigration officials, had surfaced online earlier, prompting Nigeria to threaten to review its relationship with the country.\n“The Ministry of Foreign Affairs regrets the incident on August 7th,” Indonesian Foreign Ministry spokesperson Teuku Faizasyah said, the Associated Press reported on Thursday.\nThe viral video of the event shows at least three men in a vehicle assaulting the Mr Buba, ignoring his screams of pain.\n“The unfortunate incident is against international law and the Vienna Conventions governing Diplomatic and Consular Relations between states,” the Foreign Ministry said in a statement on Monday."
  },
  {
    "headline": "COVID-19: Nigeria Records 790 Cases, Highest In Six Months",
    "summarized_story": "Nigeria has recorded 790 cases of COVID-19 pandemic with one death, the highest in six months.\nThis is according to the Nigeria Centre for Disease Control (NCDC).\nLagos, the epicenter of the outbreak, took the lead with 574 cases, followed by Rivers (83) and Ondo (38).\n[READ ALSO] COVID-19: Nigeria Records 610 New Cases, Two DeathsTill date, a total of 179,908 cases have been confirmed in the country, 166,203 patients have been discharged and 2,195 deaths recorded in 36 states, including the Federal Capital Territory.\nCurrently, over 200 million cases of the virus have been confirmed with a death toll pegged at four million worldwide."
  },
  {
    "headline": "Nigerians To Pay N500, N200 As FG Reintroduces Toll Fees",
    "summarized_story": "﻿The Federal Government is reintroducing a toll collection system on some selected dual motorways across the country, but this time with a new open road policy.\nAn open road policy means that the collection of tolls on roads will be without the use of toll booths – an all-electronic tolling or cashless tolling system.\nIn the past, Nigeria had used the closed toll system in which drivers pay and collect a ticket at the toll gate before a barrier is lifted for the vehicle to exit.\nHe emphasized that the system will not kick off immediately, and added the government consulted widely with public and private sector stakeholders before agreeing to reintroduce toll on federal carriageways.\nThe decision to reintroduce tolling comes almost two decades after the Olusegun Obasanjo’s administration dismantled all toll gates on federal highways across the country."
  },
  {
    "headline": "After One Year, Kaduna Assembly Lifts Suspension Of Former Deputy Speaker",
    "summarized_story": "After one year, the Kaduna State House of Assembly has lifted the suspension of its former Deputy Speaker and member representing Basawa constituency, Honourable Muktar Isa-Hazo.\nIsa-Hazo, and another former Deputy Speaker Nuhu Goroh- Shadalafiya of Kagarko Constituency as well as two other members, Yusuf Dahiru of Makera constituency and Salisu Isa representing Magajin Gari constituency, were suspended from all legislative activities of the House on August 11, 2020.\nThey were suspended for anti-legislative activities including causing disaffection among members and denigrating the office of the Deputy Speaker.\nThe decision to recall the former Deputy Speaker follows a motion moved by Ahmad Muhammad, a member representing the Zaria Kewaye constituency during the plenary on Wednesday.\nMuhammad told the lawmakers that the suspended former Deputy Speaker showed remorse over his conduct and has been pleading publicly on several occasions for forgiveness."
  },
  {
    "headline": "Harvest of talents as National U-12/U-15 Handball tourney enters day 4",
    "summarized_story": "Head of Technical committee of the present National U-12/U15 Handball Championship in Sokoto, Ferdinand Imama, believes the Championship has provided the Federation with an outlet to uncover excellent potential.\nThis was stated by Mr. Imana while speaking to journalists at the Championship’s Giginya memorial stadium.\nAccording to him, a number of talents have been discovered, and the bulk of them will be called up for national age grade assignments when the need arises.\nAdvertisementHe claimed that the Sokoto 2021 championship has given Nigerian kids an opportunity to express their talents rather than loitering on the streets and causing a nuisance in society.\nSokoto state teams are winning all four categories of the U-15 boys and girls, as well as the U-12 boys and girls, in round robin competitions."
  },
  {
    "headline": "Troops rescue two kidnap victims in Kaduna, 11 other hostages escape from bandit camps",
    "summarized_story": "Troops of Operation Safe Haven currently carrying out operations against bandits in Kaduna state have rescued two kidnap victims in Kirti village in Jema’a and Mariri village in Lere local government areas.\nOne of them was abandoned by the bandits in Goza, Mariri village on siting the troops.\nThe rescued victims have been reunited with their families.\nHe also commended the swift response of the troops to rescue the kidnapped citizens in Jema’a and Lere LGAs.\nThe Governor sent his prayers and best wishes to all the former hostages as they rejoined their families."
  },
  {
    "headline": "Governor Ugwuanyi inaugurates reconstituted Enugu State Judicial Service Commission",
    "summarized_story": "Governor of Enugu State Ifeanyi Ugwuanyi, inaugurated the newly reconstructed Enugu State Judicial Service Commission on Wednesday, after swearing in members Barr.\nUgwuanyi launched the State Judicial Service Commission at the EXCO Chamber, Government House, Enugu, stating that the exercise was in accordance with the relevant sections of the 1999 Constitution of the Federal Republic of Nigeria (as amended) as well as the Enugu State Judicial Service Commission Law Cap.\n60, Revised Laws of Enugu State 2004.\nAccording to the governor, the Commission is chaired by the State Chief Judge, Hon.\nJustice Priscilla Ngozi Emehelu, and members include the State Attorney-General, Chief Miletus Eze, and the President of the State Customary Court of Appeal, Hon."
  },
  {
    "headline": "Australia: Canberra Enters Snap Lockdown as Sydney Tightens Covid Curbs",
    "summarized_story": "Australia’s capital Canberra has announced a snap one-week lockdown after reporting its first locally acquired case of COVID-19 in more than a year.\nThe restrictions, which will take effect on Thursday evening, come as Australia battles to control the highly infectious Delta strain of the coronavirus.\nMore than 10 million people in the country’s biggest cities, Melbourne and Sydney, are already under hard lockdowns.\nOn Thursday, NSW reported 345 new locally acquired cases, most of them in Sydney, up from 344 a day earlier.\nAuthorities on Wednesday extended the lockdown in Melbourne for a further seven days until August 19."
  },
  {
    "headline": "Canada Violating international Law By Selling Arms to Saudis: Report",
    "summarized_story": "Canada is violating international law by selling weapons to Saudi Arabia, according to a new report by rights groups Amnesty International Canada and Project Ploughshares, which are urging Ottawa to suspend all arms exports to Riyadh.\nReleased on Wednesday, the report, titled ‘No Credible Evidence’: Canada’s Flawed Analysis of Arms Exports to Saudi Arabia, accuses Prime Minister Justin Trudeau’s government of violating the Arms Trade Treaty (ATT), an international agreement that Canada became a party to in 2019.\n“It has been established through investigations and expert reports that Canadian weapons exports to [Saudi Arabia] are contrary to Canada’s legal obligations under the ATT,” the report reads.\nCanadian weapons exports to Saudi Arabia totalled $1.05bn ($1.31bn Canadian) in 2020, according to government figures.\nThat was second only to the US and accounted for 67 percent of Canada’s total non-US arms exports."
  },
  {
    "headline": "WHO to Trial Malaria, Arthritis Drugs as Covid Treatments",
    "summarized_story": "The World Health Organization (WHO) will test three new drugs as potential treatments for people in hospital with severe COVID-19 as it expands its global trial to 52 countries.\nArtesunate is currently used for severe malaria, imatinib for certain cancers, and infliximab for diseases of the immune system such as Crohn’s disease and rheumatoid arthritis.\n“Finding more effective and accessible therapeutics for COVID-19 patients remains a critical need, and WHO is proud to lead this global effort,” WHO Director-General Tedros Adhanom Ghebreyesus said in a statement.\nThe WHO has so far recommended only two treatments for COVID-19 – interleukin-6 receptor blockers, recommended last month, and corticosteroids.\nIn the Solidarity trial, it will be administered intravenously for seven days, using the standard dose recommended for the treatment of severe malaria, the WHO said."
  },
  {
    "headline": "President Lungu Aims to Fend off Perennial Rival Hichilema as Zambia Votes in Tense Polls",
    "summarized_story": "Rising living costs have eroded the incumbent’s support base, surveys suggest, and the election could be even tighter than 2016 polls when Hichilema lost by about 100,000 votes.\nUPND supporters are keeping a low profile in Lusaka, a Lungu stronghold, for fear of being attacked by PF counterparts.\nLungu is confident of securing half a million votes more than Hichilema because “people now know me”.\n“We need a leadership that can put in place some planning to rebuild the economy,” Hichilema said.\nSo too is debt restructuring seen as an early test of a new global plan to ease poor countries’ debt burdens."
  },
  {
    "headline": "Eight Feared Dead as Tourist Helicopter with 16 Crashes into Russian Lake",
    "summarized_story": "A tourist helicopter with 16 people on board has crashed into a lake in Russia’s Far East, officials say.\nThere were eight known survivors, Russian media quoted emergencies ministry officials as saying.\nThirteen tourists, including a child, and three crew were on board when the Mi-8 crashed and sank in the Kuril Lake on the Kamchatka Peninsula.\nThe helicopter belonging to the Vityaz-Aero company is reportedly lying at a depth of 100 metres (330 feet) in the lake.\nThe Mi-8 – a medium twin-turbine helicopter – was carrying tourists from Moscow and St Petersburg, Russia’s news agency RIA reported."
  }
]