[
  {
    "headline": "Antibiotics abuse in children could affect brain development, researchers warn",
    "summarized_story": "Angela OnwuzooResearchers have warned that exposure to antibiotics early in life could alter human brain development in areas responsible for cognitive and emotional functions.\nPenicillin and related medicines (like ampicillin and amoxicillin) are the most widely used antibiotics in children worldwide.\nLead author and Director of the Center for Advanced Biotechnology and Medicine at Rutgers, Martin Blaser, said, “Our previous work has shown that exposing young animals to antibiotics changes their metabolism and immunity.\nThe physician says that maternal health experts discourage the use of antibiotics in pregnancy because not all of them are safe.\nOthers can cause jaundice, brain damage and also affect the skin.”The gynaecologist also noted that antibiotics can cause miscarriages."
  },
  {
    "headline": "Antibiotics abuse in children could affect brain development, researchers warn",
    "summarized_story": "Angela OnwuzooResearchers have warned that exposure to antibiotics early in life could alter human brain development in areas responsible for cognitive and emotional functions.\nPenicillin and related medicines (like ampicillin and amoxicillin) are the most widely used antibiotics in children worldwide.\nLead author and Director of the Center for Advanced Biotechnology and Medicine at Rutgers, Martin Blaser, said, “Our previous work has shown that exposing young animals to antibiotics changes their metabolism and immunity.\nThe physician says that maternal health experts discourage the use of antibiotics in pregnancy because not all of them are safe.\nOthers can cause jaundice, brain damage and also affect the skin.”The gynaecologist also noted that antibiotics can cause miscarriages."
  },
  {
    "headline": "COVID-19 decreasing life expectancy, CDC report reveals",
    "summarized_story": "Yusuff MoshoodA new report by the Centers for Disease Control and Prevention has revealed that the COVID-19 pandemic has greatly contributed to a decrease in life expectancy.\nAccording to the report, life expectancy in the US fell by a year and a half in 2020, mostly a result of the COVID-19 pandemic.\nThe report also revealed that in 2020 men had a life expectancy of 74.5 years compared to 76.3 in 2019.\nFor women, life expectancy in 2020 was 80.2 down, from 81.4 in 2019.\n“The difference in life expectancy between the sexes was 5.7 years in 2020, increasing from 5.1 in 2019,” the report said."
  },
  {
    "headline": "COVID-19 decreasing life expectancy, CDC report reveals",
    "summarized_story": "Yusuff MoshoodA new report by the Centers for Disease Control and Prevention has revealed that the COVID-19 pandemic has greatly contributed to a decrease in life expectancy.\nAccording to the report, life expectancy in the US fell by a year and a half in 2020, mostly a result of the COVID-19 pandemic.\nThe report also revealed that in 2020 men had a life expectancy of 74.5 years compared to 76.3 in 2019.\nFor women, life expectancy in 2020 was 80.2 down, from 81.4 in 2019.\n“The difference in life expectancy between the sexes was 5.7 years in 2020, increasing from 5.1 in 2019,” the report said."
  },
  {
    "headline": "Breaking: Yoruba agitators storm Ibadan to protest against Igboho’s arrest",
    "summarized_story": "By Adeola BadruAgitators for the secessionist of Yorubaland are set to protest the detention of one of the arrowheads of the movement, Chief Sunday Adeyemo, popularly known as Sunday Igboho on Wednesday.\nDisclosing this via his Facebook account Igboho’s spokesman, Olayomi Koiki, said the protest was one of the conditions given for his release, urging his loyalists to converge on Igboho’s Soka Ibadan residence for the demonstration.\nThe statement reads: “Emergency, emergency, emergency, emergency, please we beg all agitators to converge at Chief Sunday Igboho’s house for a peaceful demonstration to show the world the kind of person he is as one of the conditions given for his release, please let’s all be at his house in Soka, Ibadan before 12 o clock today.\nYoruba nation now now now!”Recall that Igboho was arrested at the Cadjèhoun Airport in Cotonou, Benin Republic on Monday night by security operatives in the West African country and consequently detained.\nMeanwhile, the Nigerian government had since been pushing for his extradition to Abuja but many individuals and groups have kicked against this move."
  },
  {
    "headline": "NDLEA bursts Female drug gang, arrests lady with multiple identities for trafficking 296,000 tabs of illicit drugs",
    "summarized_story": "**Seizes 465kg of skunk in Ondo.\nTheir vehicle coming from Onitsha, Anambra State was intercepted along Makurdi – Alliade road while heading to Gombe State via Makurdi.\nCuriously, the two interstate drug traffickers have rebuffed efforts to take pictures with the exhibits without wearing their hijab.\nThe illicit substance was said to have been bought from one Joseph in Ago-Akure, Akure North LGA and being conveyed to the buyer, a certain Egbonwon at Ijagba village in Ose LGA.\nWhile wishing them and their colleagues in other Commands across Nigeria a happy Sallah celebration, he charged them to remain vigilant at all times."
  },
  {
    "headline": "Extended family system in Igbo land has great advantages, but is it sustainable?",
    "summarized_story": "Despite what Ndigbo see as a lot of advantages of the extended family system, however with the steady dwindling Nigeria economy, many now doubt the sustainable of the system.\nOne of the advantages of an extended family system is the kind of security it offers to the members of that family.\nThe extended family system in Igbo land comes to great play when a man dies leaving the children with no inheritance or support.\n“Extending assistance to the family, extended family members and even others in the society is very much encouraged and it attracts divine blessings.\nExtended family system is in line with the Igbo policy of being your brother’s keeper.”In his contribution, the Traditional Prime Minister of Ibeku ancient kingdom, Chief Uche Akwukwuegbu (BAWAS), said that the extended family system in Igbo should be discarded."
  },
  {
    "headline": "Kidnappers abduct 38-year-old man in Jigawa, demand N60m",
    "summarized_story": "The Police in Jigawa said kidnappers have abducted a 38-year-old man in Kiyawa Local Government Area of the state.\nThe Police Public Relations Officer (PPRO), Jigawa Police Command, ASP Lawan Shiisu, confirmed the incident to newsmen in Dutse on Wednesday.\nShiisu said the suspects allegedly abducted the victim identified as Lawan Zakar at his residence at Dankoli quarters, on July 17.\nThe PPRO added that the suspects, who used a car, later took the victim away.\nAccording to him, efforts were on top gear to rescue the victim, as well as arrest the suspects."
  },
  {
    "headline": "Respect Sunday Igboho’s rights, treat him with decorum— Fani-Kayode warns Beniniose govt",
    "summarized_story": "Recall Vanguard had reported that Sunday Igboho was arrested at the Cotonou airport trying to flee to Germany.\nFani-Kayode noted that Sunday Igboho detention in Cotonou will be monitored with serious concern and keen interest.\nThose rights are protected under international laws and protocols, including the African Charter on Human and Peoples’ Rights to which the Benin Republic is a signatory.\nIgboho must not be denied access to his doctors and lawyers and he must not be tortured, brutalised, humiliated or treated with contempt.\nThe whole world is watching and we shall continue to monitor the events with concern and keen interest."
  },
  {
    "headline": "Preaching not enough, help rescue 348 abducted students – Bamgbose to Kumuyi, Adeboye, others",
    "summarized_story": "Speaking with DAILY POST on Wednesday, Bamgbose said, “It is evident from the news about the abducted 121 students of the Bethel Baptist Church, Kaduna, that the students will soon regain their freedom.\n“I will therefore urge Pastor Kumuyi, Pastor Adeboye, Pastor Oyedepo, and other prominent men of God in Nigeria to rise to the occasion and come to the rescue of these students.\nIf any of them could contribute to the Federal Government during the COVID-19 saga, why won’t they do the same to rescue these students?\n“It will be an appeal fund to rescue the abducted students.\nTogether we can make Nigeria a better place to live.”Deeper Life Pastor, Kumuyi warns against calls for Nigeria’s breakup"
  },
  {
    "headline": "Oyetola congratulates Akeredolu on 65th birthday",
    "summarized_story": "Governor Gboyega Oyetola of Osun State has congratulated his counterpart, Arakunrin Rotimi Akeredolu of Ondo State on his 65th birthday anniversary.\nHe described Akeredolu, who is the Chairman of the Southern Governors’ Forum, as a selfless leader and patriotic Nigerian who is strongly committed to the peace, unity and development of the country.\nThe Osun Governor also hailed Akeredolu for offering quality leadership for the Southern Governors’ Forum.\nOyetola also lauded the Ondo governor’s commitment to improving the state of infrastructure, social services, human and capital development in the State, noting that his sterling performance and achievements have endeared him to Ondo people.\n“On behalf of my family, government and people of Osun, I congratulate my brother and friend, His Excellency, Governor Rotimi Akeredolu on the occasion of his 65th birthday."
  },
  {
    "headline": "Tension in Taraba as Emir gives herders 30-day ultimatum to vacate forests",
    "summarized_story": "There has been palpable fear in some parts of Taraba State as Emir of Muri Empire, Abbas Tafida, issued a 30-day ultimatum to herdsmen in the state to vacate the forest.\nThe Emir, who gave the ultimatum on Tuesday after Eid prayers, stated that the headers have been terrorizing residents of the state.\nHe lamented that the herders who were received into the state, are now kidnapping, killing and raping his subjects.\n“Because of this unending menace, every Fulani herdsman in this state has been given 30 days ultimatum to vacate the forests.\nResidents of the state are predominantly farmers who have clashed with herders several times over destruction of crops."
  },
  {
    "headline": "Fayemi inaugurates 260,000 capacity first private cemetery in Ekiti",
    "summarized_story": "The Governor of Ekiti State, Dr. Kayode Fayemi, yesterday inaugurated the 260,000 capacity first private cemetery in the state, saying the concept will avert environmental hazards and safeguard the health of the citizens.\nThe Governor said: “With this investment by a private body, Ekiti is no longer a rural setting.\n“This is a public-private initiative, but will be driven largely by the private owners.\nFayemi assured that every step will be taken to support business owners in Ekiti through the relevant legal framework and giving of tax waiver.\nAbiodun Aluko, said the concept of a private cemetery is universal, owing to growing population and Ekiti should not be exempted from the emerging global civilisation ."
  },
  {
    "headline": "Respect Sunday Igboho’s rights – Fani-Kayode tells Benin Republic govt",
    "summarized_story": "A former aviation minister, Femi Fani-Kayode, has urged the Benin Republic government to accord Sunday Adeyemo aka Sunday Igboho the respect he deserves.\nRecall that the freedom fighter was arrested at an airport in Cotonou, Benin Republic, on Monday night.\nThe Oduduwa Republic agitator was said to have been arrested by Beninoise authorities while on his way to Germany.\n”I call on the authorities in Cotonou to respect the civil liberties & rights of Chief Sunday Adeyemo (Sunday Igboho) & I call on them to treat him with respect & decorum.\nThose rights are protected under international laws & protocols, including the African Charter on Human and Peoples’ Rights to which the Benin Republic is a signatory."
  },
  {
    "headline": "2023: APC will pick consensus presidential candidate soon – Scribe",
    "summarized_story": "Agency ReporterThe All Progressives Congress (APC) has said that at the appropriate time it will come up with a consensus and agreeable presidential candidate that will fly its flag in 2023.\nSen. John Akpanudoehede, National Secretary, APC Caretaker and Extra-ordinary Convention Planning Committee (CECPC), stated this in a statement issued on Tuesday in Abuja.\nThe statement was in reaction to the Peoples Democratic Party (PDP) recent allegation that President Muhammadu Buhari had a self-succession plan.\nADVERTISEMENTThe APC scribe, however, stressed that the party would not allow individual ambitions to derail the Buhari administration, ahead of the 2023 presidential poll.\nHe said unlike the opposition PDP, the APC was a disciplined party, noting that the former was just been haunted by its past."
  },
  {
    "headline": "BREAKING: Brisbane wins bid to host 2032 Olympic",
    "summarized_story": "Agency ReporterBrisbane will host the 2032 Olympic Games, the International Olympic Committee has confirmed, making Australia only the second country in the world—after the U.S.—to host the Summer Olympics in three different cities.\n“This is a very proud day for Australia, make no mistake,” the Australian Olympic Committee president and IOC vice-president John Coates said.\nBrisbane 2032 is genuinely committed to serving the ideals of the Olympic movement.\nADVERTISEMENT“The Olympic Games in Brisbane will be in the most diligent, grateful and enthusiastic hands.\n“My government is proud to be supporting this opportunity for Brisbane and southeast Queensland,” Australian Prime Minister Scott Morrison said as he appeared via video conference."
  },
  {
    "headline": "VIDEO: Ex-BBNaija housemate Nengi acquires new Range",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "Ex-militants decry exclusion in Amnesty communications c’ttee",
    "summarized_story": "By Elo Edremoda, WarriA group of Urhobo/Isoko ex-militants in the Niger Delta have decried their exclusion from appointment into the inaugurated Committee on Strategic Communications of the Presidential Amnesty Programme (PAP).\nof “sidelining” them and urged him to appoint one of their own into the 10-member committee.\nDikio, shouldn’t forget we are his subjects, captured in the Presidential Amnesty Programme that are entitled to every entitlement of the programme.\nADVERTISEMENTA novel committee on Strategic Communications was constituted and inaugurated by the PAP administrator in Port Harcourt, Rivers State in May, with a mandate to be a “think tank and change agents” of the PAP.\nThe committee was established at the backdrop of a workshop on Strategic Communications organised for selected ex-agitators earlier in March."
  },
  {
    "headline": "Mother of Bayelsa SSG abducted in Yenagoa",
    "summarized_story": "From Femi Folaranmi, YenagoaMrs Betinah Okunwa Benson, the mother of Secretary to the Bayelsa State Government, Hon Friday Konbowei Benson, has reportedly been kidnapped.\nAccording to reports, the 86-year woman was reported to have been kidnapped by gunmen from her residence at the old Assembly quarters, Azikoro road in Yenagoa, Bayelsa State capital.\nA family source, who confirmed the development, said the family has been thrown into confusion over the sad incident.\nThe Old Assembly quarters which housed members of the state House of Assembly was sold to them after the construction of the new quarters.\nBenson, who was Speaker of the Bayelsa State House of Assembly between 2012 and 2019, had relocated his mother from his village, Korokorosei in the Southern Ijaw in Bayelsa State on Jan 14, 2013, after she was kidnapped by ten gunmen."
  },
  {
    "headline": "Nigerians leverage N50bn NEPC facility to boost non-oil exports",
    "summarized_story": "From Uche Usim, AbujaNigerians are leveraging the recently launched Economic Community of West African States (ECOWAS) Trade Promotion Organizations (TPOs) to draw from the N50 billion Export Expansion Facility Programme (EEFP) aimed at increasing the volume of non-oil trade within the region.\nThe EEFP is expected to significantly raise the volume of non-oil exports in the country, and it’s a spin-off of the zero oil plan developed by Awolowo and approved by the President.\nThe EEFP, in line with the Federal Government’s Economic Sustainability Plan (ESP), is focused on cushioning the effects of the COVID-19 pandemic on non-oil export businesses, thereby safeguarding jobs and creating new ones.\nEarlier last March, the Minister of Industry, Trade and Investment (MITI), Otunba Niyi Adebayo, officially flagged off the EEFP and also launched the first online Grant Management Portal (GMP) for non-oil exports.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Lawyers set to stop Sunday Igboho, wife’s extradition",
    "summarized_story": "Meanwhile, a lawyer based in Texas, United States of America, Leesi Ebenezer Olarewaju, has ruled out the possibility of his repatriation.\nHe said: “Sunday Adeyemo can only be returned back to Nigeria if only he is found to have broken any law in Benin Republic.\nSunday Igboho, as we know, did not break any law in Benin.\n“The Extradition Treaty of 1984 between Togo, Nigeria, Ghana and Republic of Benin excluded political fugitives.\n•Juju has failed, Joe Igbokwe tauntsHowever, Joe Igbokwe, chieftain of the All Progressives Congress (APC), yesterday mocked Igboho."
  },
  {
    "headline": "Forget about winning 2023 elections, Presidency tells PDP",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has told the main opposition Peoples Democratic Party (PDP) to forget about winning the 2023 general elections because the masses adore President Muhammadu Buhari and would never abandon the All Progressive Congress (APC) in the next poll.\nSenior Special Assistant to President on Media and Publicity, Garba Shehu, who stated this after observing the Eid-kabir prayers in Daura, Katsina State, described Buhari as an obstacle to PDP and other parties nursing the hope of taking over the presidency in the 2023 poll.\nAgain he constitutes a political obstacle they cannot dismantle come 2023.\nWe believe the PDP and other opposition parties are nursing false hopes of taking power comes 2023.\n“The masses will never abandon President Buhari’s leadership and the APC."
  },
  {
    "headline": "We won’t allow intruders hijack APGA –Ezeonwuka, Anigbogu",
    "summarized_story": "A member of the Board of Trustees of the All Progressive Grand Congress (APGA), Chief Rommy Ezeonwuka, has said that the leadership of the party would not allow intruders to hijack its primary election.\nThe party, in its primary election, has nominated Prof Chukwuma Soludo as its candidate for the election; but some people wanted to hijack it through the backdoor.\nTherefore, the party cannot allow intruders coming through the window to take over the party.\nIn a separate interview, former zonal Chairman of APGA, Anambra South, Chief Titus Anigbogu, also called on politicians to play the game by the rule.\nPoliticians, who are afraid to approach the electorate, are the people who want to hijack the process through the backdoor."
  },
  {
    "headline": "Buhari: News of Downed Fighter Jet Devastating, But Relieved Pilot Survived",
    "summarized_story": "The pilot had finished a raid against kidnappers, when he came under intense fire, the Air Force spokesman, Air Commodore Edward Gabkwet, said in a statement on Monday.\n“I was shocked by the devastating news of the air crash but felt much relieved, following the successful ejection by the pilot and his eventual rescue.\nMay the injured pilot recover at the earliest time,” President Buhari was quoted as saying.\nThe Chief of Defence Staff, Gen. Lucky Irabor, had immediately commended the pilot for his bravery.\nSpokesman of the Nigerian Air Force, Air Commodore Edward Gabkwet confirmed the pilot’s testimony."
  },
  {
    "headline": "NESO: Nigeria Generates Only 15.6% of National Electricity Requirement",
    "summarized_story": "As NERC updates list of meter providersEmmanuel AddehThe Nigeria Electricity System Operator (NESO) has revealed that at its peak, Nigeria’s power sector was only able to generate about 15.6 per cent of the total projected national daily requirement of 28.880 megawatts.\nNESO, a semi-autonomous arm under the Transmission Company of Nigeria (TCN) is responsible for operating the transmission system in a safe and reliable manner.\nSimilarly, on July 16, peak generation was 4042.4MW, while lowest generation was 2907MW, being one of the worst days during the week, the lowest voltage recorded was 300kv.\nIt was 4598.6MW for peak generation on July 13, and 3310.5MW was its lowest generation.\nAlso, the data showed that on July 18th, peak generation was 4915.8MW, lowest generation was 3.413.3MW, while total generation capacity stood at 7652.6mw."
  },
  {
    "headline": "THISDAY Group Announces New Executive Appointments",
    "summarized_story": "Also, the Deputy Editor of THISDAY, Mr. Davidson Iriekpen, has been appointed Editor of THISDAY, the Sunday Newspaper, while the Editor of the Saturday Newspaper, Mr. Yemi Adebowale was reappointed on same position by the board.\nSimilarly, Mr. Olawale Olaleye, who was the Deputy Editor of the Sunday Newspaper was promoted to the position of Deputy Editor of THISDAY, just as the Group Business Editor, Mr. Obinna Chima was also promoted to the position of the Deputy Editor of THISDAY.\nThe Capital Market Editor, Mr. Goddy Egene was also promoted to the position of Group News Editor, while the Maritime Editor, Mr. Eromosele Abiodun is the new Group Business Editor.\nChima joined THISDAY in 2010 as a Business Correspondent and was appointed Group Business Editor in 2018.\nHe had held the positions of Judicial Editor, Editor, House of Representatives as well as covered the Presidential Villa, Abuja from where he was posted to the Saturday Desk as News Editor, before the current promotion."
  },
  {
    "headline": "Irabor Hails Pilot of Downed Fighter Plane for His Bravery, Gallantry",
    "summarized_story": "Irabor, who met the pilot in company with the Chief of the Air Staff, Air Marshal Oladayo Amao, before proceeding to a meeting with military veterans in the North-west, commended the pilot for the gallantry and bravery he demonstrated in the fight against banditry.\nEarlier, the NAF had announced the crashing of a fighter jet in Zamfara State while returning from an interdiction mission.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Before proceeding for the security parley, the CDS, Gen Irabor, in company of the Chief of the Air Staff, Air Marshal Oladayo Amao, met with Flight Lieutenant Abayomi Dairo, the NAF Alpha jet pilot, who survived the air crash yesterday.\n“The CDS commended the fighter pilot for his gallantry and bravery, which he demonstrated in the fight against banditry."
  },
  {
    "headline": "NAF Fighter Jet Crashes in Zamfara, Pilot Survives",
    "summarized_story": "Kingsley Nwezeh in AbujaA Nigerian Air Force fighter jet crashed on Sunday in Zamfara State while returning from an interdiction mission.\nA statement issued by the Spokesman of the Nigerian Air Force, Air Commodore Edward Gabkwet, said the aircraft came under enemy fire, forcing the pilot, Flt.\nIt said the crash occured on July 18, 2021 at 12.45pm while the Alpha Jet Aircraft was returning from a successful air interdiction mission between the boundaries of Zamfara and Kaduna State.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Accordingly, NAF Intelligence Surveillance Reconnaissance 0(ISR) platforms and helicopter gunships provided close air support to NAF."
  },
  {
    "headline": "BREAKING: Protest Rocks Ibadan Over Sunday Igboho’s Detention In Benin Republic",
    "summarized_story": "The Yoruba Nation agitators will stage a protest in Ibadan, Oyo State by 12pm today, Wednesday, to demand the release of Yoruba nation activist, Sunday Adeyemo, aka Sunday Igboho, who was arrested by security operatives and detained in Benin Republic.\nA terse statement by Igboho’s spokesperson, Olayomi Koiki, confirmed today’s protest, saying all supporters of the activist were enjoined to participate.\nYoruba Nation now now now,” Koiki said.\nKoiki had earlier said the Federal Government could not intimidate those agitating for the self-determination of the Yoruba Nation.\nSee Also Breaking News EXCLUSIVE: Yoruba Freedom Fighter, Sunday Igboho Arrested in CotonouHe made these known in a Facebook Live video on Wednesday morning as his principal spends the second night in a police cell in Cotonou, Benin Republic."
  },
  {
    "headline": "BREAKING: Protest Rocks Ibadan Over Sunday Igboho’s Detention In Benin Republic",
    "summarized_story": "The Yoruba Nation agitators will stage a protest in Ibadan, Oyo State by 12pm today, Wednesday, to demand the release of Yoruba nation activist, Sunday Adeyemo, aka Sunday Igboho, who was arrested by security operatives and detained in Benin Republic.\nA terse statement by Igboho’s spokesperson, Olayomi Koiki, confirmed today’s protest, saying all supporters of the activist were enjoined to participate.\nYoruba Nation now now now,” Koiki said.\nKoiki had earlier said the Federal Government could not intimidate those agitating for the self-determination of the Yoruba Nation.\nSee Also Breaking News EXCLUSIVE: Yoruba Freedom Fighter, Sunday Igboho Arrested in CotonouHe made these known in a Facebook Live video on Wednesday morning as his principal spends the second night in a police cell in Cotonou, Benin Republic."
  },
  {
    "headline": "BREAKING: Protest Rocks Ibadan Over Sunday Igboho’s Detention In Benin Republic",
    "summarized_story": "The Yoruba Nation agitators will stage a protest in Ibadan, Oyo State by 12pm today, Wednesday, to demand the release of Yoruba nation activist, Sunday Adeyemo, aka Sunday Igboho, who was arrested by security operatives and detained in Benin Republic.\nA terse statement by Igboho’s spokesperson, Olayomi Koiki, confirmed today’s protest, saying all supporters of the activist were enjoined to participate.\nYoruba Nation now now now,” Koiki said.\nKoiki had earlier said the Federal Government could not intimidate those agitating for the self-determination of the Yoruba Nation.\nSee Also Breaking News EXCLUSIVE: Yoruba Freedom Fighter, Sunday Igboho Arrested in CotonouHe made these known in a Facebook Live video on Wednesday morning as his principal spends the second night in a police cell in Cotonou, Benin Republic."
  },
  {
    "headline": "Nigeria's National Female Football Team In Faraway Austria Preparing For Wasteful Self-serving Aisha Buhari Tournament",
    "summarized_story": "Nigeria's national female football team, Super Falcons are on a wasteful trip to Vienna, Austria to train for a self-serving tournament to honour the African country's first lady, Aisha Buhari.\nThe team is in Austria for an 8-day training camp as part of preparations for some upcoming games, most notably the Aisha Buhari Invitational Women’s Football Tournament.\nAfrica’s powerhouses in women's football, namely Cameroon, Ghana, South Africa, Mali, and Morocco have confirmed their participation in the maiden invitational football festival said to be aimed at uplifting the cause of the girl-child in the continent.\nThe six-nation football tournament is billed to hold in Lagos from September 14 to 20, 2021, when some kidnapped schoolgirls are still likely to be in the den of bandits and insurgents.\nOrganisers of the Aisha Buhari Invitational Women’s Football Tournament have also confirmed that FIFA President, Gianni Infantino; CAF President, Dr. Patrice Motsepe; FIFA General-Secretary, Fatma Samoura, and other world football dignitaries will be in Lagos for the tournament."
  },
  {
    "headline": "Nigeria's National Female Football Team In Faraway Austria Preparing For Wasteful Self-serving Aisha Buhari Tournament",
    "summarized_story": "Nigeria's national female football team, Super Falcons are on a wasteful trip to Vienna, Austria to train for a self-serving tournament to honour the African country's first lady, Aisha Buhari.\nThe team is in Austria for an 8-day training camp as part of preparations for some upcoming games, most notably the Aisha Buhari Invitational Women’s Football Tournament.\nAfrica’s powerhouses in women's football, namely Cameroon, Ghana, South Africa, Mali, and Morocco have confirmed their participation in the maiden invitational football festival said to be aimed at uplifting the cause of the girl-child in the continent.\nThe six-nation football tournament is billed to hold in Lagos from September 14 to 20, 2021, when some kidnapped schoolgirls are still likely to be in the den of bandits and insurgents.\nOrganisers of the Aisha Buhari Invitational Women’s Football Tournament have also confirmed that FIFA President, Gianni Infantino; CAF President, Dr. Patrice Motsepe; FIFA General-Secretary, Fatma Samoura, and other world football dignitaries will be in Lagos for the tournament."
  },
  {
    "headline": "Gunmen abduct mother of Bayelsa SSG",
    "summarized_story": "Betinah Benson, mother of Kombowei Benson, secretary to Bayelsa state government, has been reportedly abducted by gunmen.\nAdvertisementBetinah was said to have been abducted on Tuesday night in Yenagoa, Bayelsa state capital.\nThe abductors were said to be in military fatigues.\nButswat Asinim, police public relations officer (PPRO) in Bayelsa state, has been contacted for comments.\nAdvertisementMore to follow…"
  },
  {
    "headline": "Gunmen abduct mother of Bayelsa SSG",
    "summarized_story": "Betinah Benson, mother of Kombowei Benson, secretary to Bayelsa state government, has been reportedly abducted by gunmen.\nAdvertisementBetinah was said to have been abducted on Tuesday night in Yenagoa, Bayelsa state capital.\nThe abductors were said to be in military fatigues.\nButswat Asinim, police public relations officer (PPRO) in Bayelsa state, has been contacted for comments.\nAdvertisementMore to follow…"
  },
  {
    "headline": "INVESTIGATION: Rivers residents 'dying slowly' as illegal oil refining worsens soot pollution",
    "summarized_story": "According to the US Environmental Protection Agency (EPA), soot is one of the deadliest forms of air pollution.\nOrji Sunday, a former resident of Port Harcourt, told TheCable that soot pollution informed his decision to relocate from the city in November 2020.\nAccording to Oguchi, the ease at which people carry out the illegal activities and the attendant profit remain a motivating factor for many residents.\nAccording to the World Bank gas flaring tracker report released in April, Nigeria is among the top seven gas flaring countries in the world for the last mine years.\nWhen contacted, Idris Musa, director-general of NOSDRA, confirmed TheCable’s findings that oil companies still flare indiscriminately and that illegal oil bunkers and artisanal refiners are operating unchecked in Rivers."
  },
  {
    "headline": "INVESTIGATION: Rivers residents 'dying slowly' as illegal oil refining worsens soot pollution",
    "summarized_story": "According to the US Environmental Protection Agency (EPA), soot is one of the deadliest forms of air pollution.\nOrji Sunday, a former resident of Port Harcourt, told TheCable that soot pollution informed his decision to relocate from the city in November 2020.\nAccording to Oguchi, the ease at which people carry out the illegal activities and the attendant profit remain a motivating factor for many residents.\nAccording to the World Bank gas flaring tracker report released in April, Nigeria is among the top seven gas flaring countries in the world for the last mine years.\nWhen contacted, Idris Musa, director-general of NOSDRA, confirmed TheCable’s findings that oil companies still flare indiscriminately and that illegal oil bunkers and artisanal refiners are operating unchecked in Rivers."
  },
  {
    "headline": "UK asks Nigeria to explain how Nnamdi Kanu was arrested",
    "summarized_story": "The United Kingdom says it is seeking clarification from Nigeria on the circumstances surrounding the arrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nAlthough the federal government did not state where Kanu was arrested, Kingsley Kanu, Kanu’s brother alleged that the separatist leader was arrested in Kenya and “handed over to Nigerian authorities who then flew him to Nigeria”.\nThe Kenya government, however, denied the claim that Kanu was arrested and extradited from the country to Nigeria.\nAdvertisementAccording to Reuters, Tariq Ahmad, junior minister at Britain’s foreign office, says the UK wants Nigeria to explain how Kanu was arrested.\nFor almost four years after he fled the country, the separatist leader piloted the affairs of IPOB from abroad."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Google partners Maliyo Games to train 500 African mobile game developers",
    "summarized_story": "Share this article:As Google’s interest in Africa’s tech talent pool deepens, the tech giant has partnered with Nigerian-founded game development studio, Maliyo Games, to open applications for a mobile game developer training program.\nAccording to the founder, this is one of the qualities that attracted Google to the project, aside from the fact that Maliyo Games has published some Africa-themed games on the Google Play Store.\nIn addition to that, Google will also provide support for app store success, which includes successful publishing of content on Google Play Store.\nMaliyo Games’ fitAs is typical of content from many indigenous companies, Maliyo Games studio ensures that its content reflects the African scene.\nIn his opinion, in the past 9 years of running Maliyo Games, opportunities that exist now are thinning out the effects of these challenges."
  },
  {
    "headline": "Nigeria’s Startup Bill, Kenya’s Zoom tax, Zimbabwe’s securities law",
    "summarized_story": "Share this article:Good day,What’s on the menu:Updates on Nigeria’s Startup BillKenya’s Zoom taxZimbabwe’s securities lawThe latest on Nigeria’s Startup BillIn May, we brought you news about a Startup Bill for Nigeria.\nSince the 90s, when the first tech companies were founded, Nigeria’s tech ecosystem has progressed.\nEvents like this have made it important for founders to interact with the government, hence, the Startup Bill.\nShould plans for the bill go as planned, it could unlock a lot of value for Nigeria’s tech ecosystem.\nKenyans to pay VAT for using Zoom<em>Photo Credit: <a href=”https://www.linkedin.com/in/morgan-mbabazi-001a331a/” target=”_blank” rel=”noopener”>Morgan Mbabazi</a> (National Media Group).</em>Starting August 2021, Kenyans will begin paying Value Added Tax (VAT) for using video conferencing platform, Zoom."
  },
  {
    "headline": "How Agritech startup, Releaf, wants to change the face of food processing in Africa",
    "summarized_story": "Share this article:The dominance of Nigeria’s palm oil industry during the 1960s is often repeated when tales of the country’s glory days are told.\nIn 1965, several countries in Africa, Southeast Asia, and Latin America received nearly $2 billion from the World Bank for the oil palm industry.\nIt is in this market that agritech startup, Releaf, is looking to make its mark.\nWhile doing this, the founders realised that food factories could not get enough high-quality raw materials to operate their factories at maximum capacity.\nWith the help of Kraken, Releaf is gunning for a portion of the global $61 billion palm oil market."
  },
  {
    "headline": "Nigeria may be left out as the world pumps more oil",
    "summarized_story": "Nigeria may be left out as the world pumps more oilFaced with teething technical and operational issues, which are being exacerbated by the recent rise in pipeline leaks and sabotage, Nigeria may miss out on an opportunity to improve its earnings despite a current quest by some major oil producers to supply more crude oil.\nThis week, member countries of the oil cartel, Organisation of…"
  },
  {
    "headline": "Explainer: What OPEC’s new agreement means for Nigeria",
    "summarized_story": "Explainer: What OPEC’s new agreement means for NigeriaThe world’s biggest oil-producing group has agreed to increase oil production in the coming months, a decision that comes with huge implications for Africa’s biggest oil producer.\nThe group, the Organisation of Oil Exporting Countries (OPEC) and its allies like Russia, agreed to add another 400,000 barrels per day (bpd) on a monthly basis beginning…"
  },
  {
    "headline": "US forces almost accidentally invaded Nigeria under Trump, book claims",
    "summarized_story": "In the ensuing confusion, Patel reportedly “assured” senior officials involved in the process that Nigeria’s government had been notified.\nAmerican forces had come very close to a technical invasion of a foreign country,” wrote the authors.\nI Alone Can Fix It: Donald J. Trump’s Catastrophic Final Year was released on July 20, published by Bloomsbury.\nThe 31 Oct. mission was successful, leading to the deaths of numerous militants, according to the book, while Walton’s rescue was reported by news outlets last year.\n“Big win for our very elite U.S. Special Forces today,” Trump tweeted at the time of Walton’s rescue last year."
  },
  {
    "headline": "Electoral Reform Bill: When Posterity Will Judge – Nigerian Observer",
    "summarized_story": "But some senators notably those of the People’s Democratic Party (PDP) disagreed, throwing the Senate into a rowdy session.\nRecall also that ballot snatching has been a worrisome phenomenon to electoral process in Nigeria for as long election itself.\nThough one wonders why the president himself has three times declined to assent the electoral reform bill which among others will render ballot box snatchers incapacitated to a very great extent.\nThis becomes a matter of grave concern as the hope of a credible elections lies in the independence of the unbiased electoral umpire.\nBut it is rather paradoxical that the party which promised Nigerians change is in practice, curiosily averse to progressive change."
  },
  {
    "headline": "Eid-el-Kabir: Edo govt urges caution, compliance to protocols amid third wave of COVID-19 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents to celebrate the Eid-el-Kabir festivities with caution and adhere to preventive protocols against the spread of coronavirus (COVID-19), in the wake of the third wave of COVID-19 infections across the country.\nThe Edo State Deputy Governor and Chairman, Technical Committee on COVID-19, Rt.\nShaibu, represented by the Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, urged residents to be cautious amid the festivities to prevent the highly transmissible Delta variant of COVID-19 from gaining entrance into the state.\nThe Deputy Governor noted: “On behalf of the Edo State Government, I want to once more congratulate our Muslim brothers and sisters on this auspicious occasion of the Eid-el-Kabir celebration.\n“As we go about with the celebrations, we must bear in mind that the COVID-19 pandemic is not yet over."
  },
  {
    "headline": "Eid-el-Kabir: Obaseki felicitates with Muslim faithful, charges on unity, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has felicitated with Muslim faithful on the Eid-el-Kabir celebration, urging them to continue to imbibe the spirit of love, tolerance and sacrifice as exemplified by the Holy Prophet Muhammad.\nThe governor, in a statement, charged Muslims to use the period to deepen their relationship with Allah and pray for unity, peace and development of the state and Nigeria.\nObaseki noted: “On behalf of the Government and people of Edo State, I felicitate with Muslim faithful on the occasion of Eid-el-Kabir.\n“This year’s Eid-el-Kabir presents yet another opportunity for our Muslim brothers and sisters to deepen their relationship with Allah.\n“As we celebrate this auspicious occasion, I call for dedication to the virtues of love, oneness, patriotism, tolerance and unity for the desired development in the state and Nigeria.”..."
  },
  {
    "headline": "Edo residents applaud Vigilante network on improved security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Residents in Edo have commended the Edo State Vigilante and Security Network for working assiduously to provide security across the state in collaboration with other security agencies in the state.\nA cross-section of residents across the state, who spoke to journalists, said the formation and deployment of the vigilante teams across communities in the state have improved surveillance and intelligence gathering in the state.\nAccording to him, “A unique feature of the vigilante network is the fact that members of the community are co-opted into the scheme and made responsible to work with other agencies to secure their neighborhood.\nHe said: “A lot of people are now more interested in what happens around them because they are co-opted into the vigilante network.\nThis generally improves the security in the area.”The Obaseki-led administration set up the security network in the aftermath of the #ENDSARS protest last year to boost security and community policing in the state."
  },
  {
    "headline": "Civil servant seeks help to raise N7 million for kidney transplant",
    "summarized_story": "In 2017, Jubril Adebowale,a civil servant attached to the Chief Press Secretary of Lagos State woke up with Critical Kidney Disease (CKD).\nMr Adebowale joined the civil service in 1997 during the administration of former Governor Mohammed Buba Marwa.\nUpon arriving the hospital in Abuja, Mr Adebowale was however unstable “as his blood pressure was unstable.”His Sp02 (oxygen saturation) was less than 75%, instead of 92 to 98%.\nThe transplant bill, howeverrr, rose to N15 million ($30,060.12) and Mr Adebowale has since not been able to complete the balance of N7 million ($13,822).\nSupportMr Adebowale’s family seeks support from Nigerians to donate N7 million to complete his needed transplant."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "C & I Leasing lists N10bn bond on NGX",
    "summarized_story": "Adebayo ObajemuC & I Leasing has listed on the Nigerian Exchange (NGX) N10 billion seven years 15.5 per cent Senior Secured Fixed Rate Bonds due in 2028 under its N20 billion bond issuance programme.\nA total of 10 million units of the bond were listed at par value of N1,000.\nThe maturity date for the seven-year bond, which was issued on June 3, 2021 is June 3, 2028"
  },
  {
    "headline": "CBN schedules MPC meeting for July 26",
    "summarized_story": "Adebayo ObajemuThe Central Bank of Nigeria in a circular on its official website has announced that the 280th meeting of the Monetary Policy Committee (MPC) is scheduled to hold on Monday, July 26 and Tuesday, July 27, 2021.\nThe Apex bank in the last meeting retained the MPR at 11.5% and other parameters were also retained.\nLiquidity ratio was retained at 30 percent and cash reserve ratio (CRR) at 27.5 percent.\nThe committee had earlier in September 2020 agreed to reduce the benchmark interest rate to 11.5 percent from 12.5 percent.\nThe outcome of the scheduled MPC meeting next week would greatly determine the direction of our economy."
  },
  {
    "headline": "FCMB appoints Oluwatoyin Olaiya as Executive Director",
    "summarized_story": "Adebayo ObajemuThe Board of Directors of First City Monument Bank Limited has announced the appointment of Oluwatoyin Olaiya as Executive Director, following the approval of the Central Bank of Nigeria.\nOluwatoyin Olaiya is a finance and risk management professional with over 30 years’ experience.\nPrior to her appointment, she was the Chief Risk Officer/Divisional Head Risk Management, FCMB, overseeing Enterprise Risk Management, Risk Policy, Credit Administration, Credit Underwriting and Monitoring.\nShe started her career as an auditor with KPMG, from where she moved to various roles in domestic operations, internal audit, business development, financial control, compliance and enterprise risk management in the banking industry.\nShe joined FCMB in 2016 from Sterling Bank, where she was the Acting Chief Risk Officer."
  },
  {
    "headline": "Igboho’s lawyer says he is chained like an animal in Cotonou, refutes release rumours",
    "summarized_story": "“The source told me that they are under instruction by an order from the above that Igboho should be chained like an animal waiting to be slaughtered.\nHe told me that Igboho was tightly chained to the floor and he is in serious pains.\n“The Nigerian authorities and security operatives that arrested him would be approaching the court for an extradition order to bring Sunday Igboho back to Nigeria.\n“But it is not likely that the extradition order being sought for would sail through.\n“The Extradition Treaty of 1984 between Togo, Nigeria, Ghana and Republic of Benin excluded political fugitives."
  },
  {
    "headline": "Sallah: Malaysian Group Donates 100 Cows, 50 Goats To Borno IDPs, Widows",
    "summarized_story": "A Malaysian Islamic group, Yayasan Budi Ihsan, has donated 100 cows and 50 goats to the internally displaced persons (IDPs) in 13 camps in Maiduguri, Borno State.\nThe beneficiaries also included host communities of the IDPs camps, widows and orphans.\nUmar said the latest donation is the second time in Nigeria the Malaysian Group would be donating to the less-privileged.\nHe said: “Initially, last year, we did the same thing but the number of cows slaughtered were just nine.\nSo, they have given us a total number of 100 cows and 50 goats."
  },
  {
    "headline": "Sallah: Malaysian Group Donates 100 Cows, 50 Goats To Borno IDPs, Widows",
    "summarized_story": "A Malaysian Islamic group, Yayasan Budi Ihsan, has donated 100 cows and 50 goats to the internally displaced persons (IDPs) in 13 camps in Maiduguri, Borno State.\nThe beneficiaries also included host communities of the IDPs camps, widows and orphans.\nUmar said the latest donation is the second time in Nigeria the Malaysian Group would be donating to the less-privileged.\nHe said: “Initially, last year, we did the same thing but the number of cows slaughtered were just nine.\nSo, they have given us a total number of 100 cows and 50 goats."
  },
  {
    "headline": "Sallah: Ganduje Frees 136 Inmates From Kano Correctional Centres",
    "summarized_story": "Kano State governor, Dr. Abdullahi Umar Ganduje, has effected the release of 136 inmates from different Kano Correctional Centres, urging them to be people of good character when they are finally reintegrated into the society.\nThe governor spoke when he visited Goron Dutse Medium Correctional Centre as part of his Sallah visits during the Eid-el-Kabir festival on Tuesday.\nADVERTISEMENTIn his remarks, the Controller of Kano Correctional Centres, Sulaiman T. Sulaiman, commended the governor for his humaneness while relating with the inmates.\nAccording to him, “His Excellency Governor Abdullahi Umar Ganduje of Kano state was here during the Eid-Fitr period, just in the last 70 days, and he released some inmates.\nThey are 136.”The Controller, therefore, appreciated Governor Ganduje’s magnanimous intervention in order to make the Eid-el-Kabir celebration joyful among the inmates, for providing the Correctional Centres with cattle and rams."
  },
  {
    "headline": "Sallah: Ganduje Frees 136 Inmates From Kano Correctional Centres",
    "summarized_story": "Kano State governor, Dr. Abdullahi Umar Ganduje, has effected the release of 136 inmates from different Kano Correctional Centres, urging them to be people of good character when they are finally reintegrated into the society.\nThe governor spoke when he visited Goron Dutse Medium Correctional Centre as part of his Sallah visits during the Eid-el-Kabir festival on Tuesday.\nADVERTISEMENTIn his remarks, the Controller of Kano Correctional Centres, Sulaiman T. Sulaiman, commended the governor for his humaneness while relating with the inmates.\nAccording to him, “His Excellency Governor Abdullahi Umar Ganduje of Kano state was here during the Eid-Fitr period, just in the last 70 days, and he released some inmates.\nThey are 136.”The Controller, therefore, appreciated Governor Ganduje’s magnanimous intervention in order to make the Eid-el-Kabir celebration joyful among the inmates, for providing the Correctional Centres with cattle and rams."
  },
  {
    "headline": "Lawyers Lament Non-payment Of Judgement Debts By Federal Govt",
    "summarized_story": "Lawyers who have won various litigations against the federal government agencies have cried out over non-payment of judgment debts incurred by the government.\n“However, the PMB administration since 2015 have not complied in settling and paying for judgement debts owed by federal government of Nigeria to its citizens, organisations and business entities in Nigeria.\n“The debts are judgements which emanated from the Federal High Court of Nigeria.\n“These judgement debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice.\n“We are, therefore, using the mass media as empowered by Section 22 of the 1999 constitution of the Federal Republic of Nigeria to cry out for justice over the non-payment of the judgement debts by the federal government."
  },
  {
    "headline": "Heartland FC GM, Nwachukwu hails Uzodinma",
    "summarized_story": "… As Governor clears outstanding salariesBy EPHRAIM NWOSUGeneral Manager of Heartland FC, Promise Nwachukwu has showered encomiums on Imo State Governor, Senator Hope Uzodinma following the payment of players’ salaries.\nAfter several months of endless wait, the Imo State Government last week paid three months salaries (March, April and May) to Heartland FC players and backroom staff.\n“I sincerely express my gratitude to the Executive Governor of Imo State, His Exellency Senator Hope Uzodinma for paying three months salaries to the players and overwhelming passion he has shown for the club,” an elated Nwachukwu eulogized.\nHe is taking his time to clean up the mess in order to ensure we end the campaign on a good note.\n“The boys are fired up and I want to assure the football loving people of Imo State that we will not let them down."
  },
  {
    "headline": "Heartland FC GM, Nwachukwu hails Uzodinma",
    "summarized_story": "… As Governor clears outstanding salariesBy EPHRAIM NWOSUGeneral Manager of Heartland FC, Promise Nwachukwu has showered encomiums on Imo State Governor, Senator Hope Uzodinma following the payment of players’ salaries.\nAfter several months of endless wait, the Imo State Government last week paid three months salaries (March, April and May) to Heartland FC players and backroom staff.\n“I sincerely express my gratitude to the Executive Governor of Imo State, His Exellency Senator Hope Uzodinma for paying three months salaries to the players and overwhelming passion he has shown for the club,” an elated Nwachukwu eulogized.\nHe is taking his time to clean up the mess in order to ensure we end the campaign on a good note.\n“The boys are fired up and I want to assure the football loving people of Imo State that we will not let them down."
  },
  {
    "headline": "FirstBank Celebrates 2021 Corporate Responsibility and Sustainability Week, Calls for All to Adopt Kindness as a Way of Life",
    "summarized_story": "This is probably the backdrop to the theme “Kindness…a Way of Life”, which FirstBank has chosen for commemoration of its 2021 Corporate Responsibility and Sustainability Week (CR&S Week).\nOne of the main highlights of the first CR&S Week was the SPARK Initiative.\nIn 2019, the CR&S Week held from 1 – 6 July 2019 with the theme “Ripples of Kindness: Putting You First”.\nThe year’s CR&S Week focused mainly on the SPARK initiative, which had gained so much traction since its humble beginnings in 2017.\nNo CR&S Week could take place in 2020 because of the COVID-19 pandemic and its associated restrictions on public gatherings and visits."
  },
  {
    "headline": "FirstBank Celebrates 2021 Corporate Responsibility and Sustainability Week, Calls for All to Adopt Kindness as a Way of Life",
    "summarized_story": "This is probably the backdrop to the theme “Kindness…a Way of Life”, which FirstBank has chosen for commemoration of its 2021 Corporate Responsibility and Sustainability Week (CR&S Week).\nOne of the main highlights of the first CR&S Week was the SPARK Initiative.\nIn 2019, the CR&S Week held from 1 – 6 July 2019 with the theme “Ripples of Kindness: Putting You First”.\nThe year’s CR&S Week focused mainly on the SPARK initiative, which had gained so much traction since its humble beginnings in 2017.\nNo CR&S Week could take place in 2020 because of the COVID-19 pandemic and its associated restrictions on public gatherings and visits."
  },
  {
    "headline": "Nigeria records sharp jump in COVID-19 cases",
    "summarized_story": "Nigeria has announced 206 new COVID-19 infections, increasing the caseload to 169,884.\nThe figure represents a significant jump, compared with the 146 cases logged on Monday.\nNigeria Centre for Disease Control (NCDC) reported no new COVID-19 related death.\nThe death toll stood at 2,128.\n“Today’s report includes zero cases from Plateau, Sokoto, Kano, Oyo, Ondo, Osun, Nasarawa and Kaduna States,” NCDC said."
  },
  {
    "headline": "IPOB sacks Simon Ekpa from Radio Biafra",
    "summarized_story": "By Funmilola OlukomaiyaThe Indigenous People of Biafra (IPOB), has explained why Simon Ekpa may no longer continue as a broadcaster on Radio Biafra.\nEkpa was engaged as a broadcaster on Radio Biafra shortly after Nnamdi Kanu, leader of IPOB was rearrested.\nOur leader Mazi Nnamdi Kanu gave the directive while in detention but Mazi Simon Ekpa has refused to follow the principles.\n“Mazi Simon Ekpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra.\n“While Mazi Simon Ekpa has the right to make his broadcasts on Facebook and other platforms of his choice, he may no longer broadcast on Radio Biafra as one of the official broadcasters.”"
  },
  {
    "headline": "ICYMI: Britain queries Buhari’s govt on Nnamdi Kanu’s abduction",
    "summarized_story": "By Agency ReportBritain has asked Nigeria to explain where and how its citizen, Nnamdi Kanu, leader of the Indigenous People of Biafra was kidnapped.\nThe diplomatic query followed the statement by Kanu’s lawyer that the IPOB leader was detained and mistreated in Kenya before being sent back to Nigeria.\n“We are seeking clarification from the Nigerian government about the circumstances of the arrest and detention of Nnamdi Kanu,” said Tariq Ahmad, a junior minister at Britain’s Foreign Office.\nKanu was said to be travelling on UK passport when he was abducted in Kenya and tortured for eight days.\nThe Nigerian authorities have refused to say where Kanu was arrested, while Kenya’s ambassador to Nigeria has denied his country was involved."
  },
  {
    "headline": "Nigeria’s Problems Are Spiritual, Buhari Can’t Tackle Them – Cleric",
    "summarized_story": "Seun Adeoye, the Lead Bishop of the Worldwide Anglican Church in Nigeria and Spokesman of the World Bishops Council, Africa Chapter, stated Nigeria’s crisis is spiritual, and President Muhammadu Buhari lacks the spiritual capacity to address it.\nPresident Buhari’s spiritual level cannot meet Nigeria’s troubles, according to the presiding Bishop of Sufficient Grace Truth Christian Church, Okinni, Osun State, who preached from 1 Samuel Chapter 5 of the Bible.\nIn his vision, the clergyman, who claims to have been in God’s presence for the last 82 days, saw Nigeria blazing in battles against demons from the domain of darkness.\nAccording to the bishop, Nigeria has a weak leadership that has been swamped by these forces.\n“I am a man of prayers, God had told me to be before him for 100 days, today marks 82 days."
  },
  {
    "headline": "IPOB Sacks Simon Ekpa As Radio Biafra Broadcaster, Gives Reasons",
    "summarized_story": "On Wednesday, the Indigenous People of Biafra, IPOB, revealed why Simon Ekpa may no longer be a Radio Biafra broadcaster.\nAccording to IPOB, Ekpa has refused to observe the norms of operation in Radio Biafra, necessitating the termination of his services.\nEkpa was hired as one of Radio Biafra’s broadcasters shortly after IPOB leader Nnamdi Kanu was arrested.\nOur leader Mazi Nnamdi Kanu gave the directive while in detention but Mazi Simon Ekpa has refused to follow the principles.\n“Mazi Simon Ekpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra."
  },
  {
    "headline": "Grant Sunday Igboho Amnesty – Rasheed Ladoja Tells Buhari",
    "summarized_story": "A former governor of Oyo State, Rasheed Ladoja has urged the Nigerian government to grant self-acclaimed Yoruba freedom fighter, Sunday Adeniyi Adeyemo, popularly known as Sunday Igboho and leader of the outlawed Indigenous People of Biafra (IPOB), Nnamdi Kanu amnesty.\nLadoja cautioned that more of Igboho and Kanu will spring up if the Muhammadu Buhari administration do not handle their matter with wisdom.\nLadoja said: “Federal government has declared amnesty for Boko Haram, they should also declared amnesty for Igboho and the IPOB leader.\n“Just like Kanu, to some people, Sunday Igboho has also become a leader, people are agitating for what they believe in.\n“Sunday Igboho was created in the context of killings in Ibarapa axis of Oyo State."
  },
  {
    "headline": "BREAKING: Protest Rocks Ibadan Over Sunday Igboho’s Detention In Benin Republic",
    "summarized_story": "Yoruba Nation agitators will stage a protest in Ibadan, Oyo State, at 12 p.m. today, Wednesday, to demand the release of Sunday Adeyemo, aka Sunday Igboho, a Yoruba nation activist who was arrested and detained in Benin Republic by security operatives.\nLast week, the agitators protested the raid on Igboho’s home by Department of State Services operatives and demanded the release of the 12 aides detained in Igboho’s home.\nA terse statement by Igboho’s spokesperson, Olayomi Koiki, confirmed today’s protest, saying all supporters of the activist were enjoined to participate.\nYoruba Nation now now now,” Koiki said.\nKoiki had earlier said the Federal Government could not intimidate those agitating for the self-determination of the Yoruba Nation."
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "Farouq Preaches peace at Eid-Elkabir -NigPilot",
    "summarized_story": "A statement, signed by the Special Adviser on Media to the minister, Nneka lkem Anibeze, Farouq called for prayers to unite the country and reduce humanitarian crises including internal displacement, refugees, hunger, killings, and terrorism.\nWhile felicitating with the Muslim faithful, she preached love for one another, sacrifice for the nation, peace, love, and kindness as advocated by the Prophet Muhammed“Let us continue to pray for the unity of the country especially the vulnerable among us.\nMay Allah grants us peace as we celebrate Eid and may we witness more celebrations as a united nation”, Umar Farouq said.\nThe Minister said a peaceful Nigeria will reduce the number of displaced and vulnerable people in the country.\n“If we spend less on IDPs and victims of communal clashes, cattle rustlings or banditry, the government can channel such funds to other capital projects.”She promised that the government will continue to do everything within its power to ensure a country that all Nigerians will be proud of."
  },
  {
    "headline": "FG flags off construction of Kaduna Kano segment of Lagos-Kano Railway -NigPilot",
    "summarized_story": "Federal Government has flagged off the construction of the Kaduna-Kano segment of the Lagos-Kano railway modernization project.\nHe said, “This project is crucial to the establishment of a supply chain in railway transport within its corridor, Kano – Kaduna – Abuja, as it links the major commercial cities of Kano and Kaduna to the Federal Capital Territory, Abuja”.\nHe said “The scope of the railway project involves a 203km double track standard gauge railway from Kano to Kaduna.\nThis railway line will present an opportunity for Nigerians to traverse between Abuja and Kano via Kaduna with relative ease”.\nThe Kaduna – Kano railway project is to link the Lagos – Ibadan Railway project via Abuja, Minna, Ilorin, Oshogbo, Ibadan to Lagos on one end, and Maradi, Niger Republic on the other."
  },
  {
    "headline": "100 Kidnapped Victims Rescued In Zamfara After 42 Days In Captivity",
    "summarized_story": "The police command in Zamfara State says security operatives have rescued 100 abducted persons from bandits at Kabaro forest.\nThe victims, mostly women, and children were kidnapped on June 8 by bandits and taken to Kabaro village in Maru Local Government Area of the state.\n﻿He added that all the victims were from Manawa village of Maru Local Government Area of the state.\n“It could be recalled that on 8th June 2021, some recalcitrant bandits stormed Manawa village, and abducted 100 villagers, including nursing mothers, males, and children.\nThe Commissioner of Police, Hussaini Rabiu, warned the recalcitrant bandits to renounce criminalities and embrace peace or face the full wrath of the law."
  },
  {
    "headline": "My Client Is Being Tortured In Cotonou, Igboho’s Lead Counsel Cries Out",
    "summarized_story": "Igboho was arrested on Monday by the security forces at an airport in Cotonou while trying to flee to Germany.\nThere were speculations that Igboho had been released by security operatives in the neighbouring West African nation, however, the counsel said his client was still in custody.\n“But it is not likely that the extradition order being sought for would sail through.\n“Like I said in a press release earlier today, even his arrest by security operatives was against the political nature of his offense.\nAfunanya said when the security operatives approached the house, they were attacked by nine of Igboho’s boys who engaged them in a gun duel but were subsequently overpowered."
  },
  {
    "headline": "President Buhari Urges More Nigerians To Embrace Farming",
    "summarized_story": "President Muhammadu Buhari has urged more Nigerians to embrace farming, saying he was surprised to hear that only 2.5 per cent of arable lands in the country is being cultivated.\nThe President said this while addressing journalists at his residence on Tuesday in Daura, the Katsina State capital, after the Eid-el-Kabir prayers.\nThe President mandated security outfits to be more relentless in maintaining peace in the country, and ensure a more harmonious relationship with communities so that they can glean intelligence.\n“Since the President came into power we have seen some positive changes in the country,” the Emir said.\n“May God continue to strengthen the President with good health and courage to bring peace to the country."
  },
  {
    "headline": "Taraba Emir Gives Herders 30-Day Ultimatum To Vacate Forests",
    "summarized_story": "The Emir of Muri Empire in Taraba State, Abbas Tafida has issued a 30-day ultimatum to herders terrorizing residents of the state to vacate forests within the state or be forced to do so.\nHe claimed that Fulani herders are responsible for perpetrating crimes in the state and should therefore vacate forests in the state within 30 days or be forced out.\nThe Emir who spoke in the Hausa language urged the leadership of Fulani Herdsmen to fish out the bad eggs among them.\n“Because of this unending menace, every Fulani herdsman in this state have been given thirty days ultimatum to vacate the forests.\nTaraba State located in the Northeast region of Nigeria is faced with heinous crimes ranging from kidnapping to bandit attacks."
  },
  {
    "headline": "‘We’Ve Done It, Brisbane!’: Australian City Awarded 2032 Olympics",
    "summarized_story": "Brisbane was awarded the 2032 Olympics on Wednesday, triggering wild celebrations and fireworks as it became the third Australian city to host the Summer Games after Melbourne and Sydney.\nNever in my lifetime did I think that this was going to happen,” said Queensland state premier Anna Palaszczuk.\nRhys Cush, 24, one of those in the masked-up crowd, said he hoped to work at the 2032 Olympics and also attend as a spectator.\n“I’m super excited about having the Olympics coming here.”Lauren Granger, 42, said she hoped the 2032 Olympics would recreate the buzz of Sydney’s successful 2000 Games.\nVenues will be spread across Brisbane and nearby towns in Queensland state, including the Gold Coast which hosted the 2018 Commonwealth Games."
  },
  {
    "headline": "Eid-el Kabir: NASFAT congratulates Muslims, enjoins all Nigerians to embrace peace",
    "summarized_story": "Nasiru lahil Li Fatih society NASFAT, a faith-based organization, has joined Nigerians and other Muslims around the world in celebrating Eid-ul-Kabir.\nOlaniyi Yusuf, congratulated all Muslims and thanks Allah for allowing them to witness this year’s Eid.\nHe stated that this time period has been described as the best of days in Allah’s eyes.\n“There are no days on which righteous deeds are more beloved to Allah than these ten days,” our Prophet Muhammad (saw) said.\nIn his message, NASFAT Chief Missioner, Imam Abdul Azeez Onike said the deen of Islam attaches importance to safety of lives and properties."
  },
  {
    "headline": "NDLEA arrests lady with multiple identities for trafficking 296,000 tabs of illicit drugs",
    "summarized_story": "The agency said the vehicle, which was traveling from Onitsha, Anambra state, was stopped along the Makurdi – Alliade road on its way to Gombe State via Makurdi.\nAdvertisementA search of their car turned up 43 kilos of Diazepam and 33 kilograms of Exol-5, both weighing 76 kilograms and containing a total of 296,000 tablets wrapped in four huge ‘Ghana must go’ bags.\nCuriously, the two interstate drug traffickers have rebuffed efforts to take pictures with the exhibits without wearing their hijab.\nThe illicit substance was said to have been bought from one Joseph in Ago-Akure, Akure North LGA and being conveyed to the buyer, a certain Egbonwon at Ijagba village in Ose LGA.\nWhile wishing them and their colleagues in other Commands across Nigeria a happy sallah celebration, he charged them to remain vigilant at all times."
  },
  {
    "headline": "APC, Ondo State Chapter celebrates Governor Akeredolu at 65",
    "summarized_story": "The Ondo State chapter of the All Progressives Congress (APC), has described Governor Oluwarotimi Odunayo Akeredolu as a catalyst for development and uncommon transformation as he marks his 65th birthday.\nAde Adetimehin, in a statement signed by APC State Publicity Secretary, Alex Kalejaye said the magical wand of the Governor has helped to carve a niche for the Sunshine State in the comity of States.\nHighlighting the bold and giant strides of the Governor for the betterment of the state since assumption of office, Mr. Adetimehin submitted that Akeredolu deserves accolades from every residents of the State on the occasion of his 65th birthday.\nHe also rejoiced with the First Lady, Arabinrin Betty Ayanwu-Akeredolu on her 68th birthday and hailed her drive at championing the cause of women and empowering them through her pet projects.\n“On behalf of the State chapter of APC, he celebrates the APC leader and Governor, and the First Lady, Arabinrin Ayanwu-Akeredolu, as they celebrate their memorable birthdays.”"
  },
  {
    "headline": "MVP Giannis Antetokounmpo’s 50 Points Leads Bucks to First NBA Title in 50 Years",
    "summarized_story": "Giannis Antetokounmpo had the Larry O’Brien Trophy in one arm, the NBA Finals MVP trophy in the other and there was a cigar on the table in front of him.\nAntetokounmpo finished with 35.2 points, 13.2 rebounds and 5.0 assists per game while shooting 61.8%, the first player in finals history to reach those numbers.\nChris Paul scored 26 points to end his first NBA Finals appearance in his 16th season.\nThe Bucks traded for Jrue Holiday before this season and even though they weren’t quite as strong in the regular season, they were finally NBA Finals ready.\n… Milwaukee’s only other NBA Finals appearance was a loss in 1974."
  },
  {
    "headline": "WHO Chief Backs Tokyo Olympics Days Before Opening Ceremony",
    "summarized_story": "Tedros Adhanom Ghebreyesus, the head of the World Health Organization (WHO), has thrown his weight behind the pandemic-delayed Tokyo Olympics, even as a surge in the Delta variant drives a resurgence of COVID-19 around the world and the event faces continued opposition just days before the opening ceremony.\nBut rising cases around the world and in Japan, have undermined public confidence, increasing opposition to the event going ahead.\nTokyo recorded 1,387 new cases on Tuesday, bringing its total since the pandemic started to more than 840,000 cases.\nThe WHO chief said the ” mark of success” was not zero cases but that cases were identified, isolated, traced and cared for.\nSome 79 cases have been reported in connection with the event so far, according to official figures, with the opening ceremony due to take place on Friday."
  },
  {
    "headline": "Covid: Anger as Half of Australians in Lockdown Again",
    "summarized_story": "More than 13 million Australians – about half the population – are in lockdown after a third state imposed restrictions to curb a Delta outbreak.\nSouth Australia, home to 1.7 million people, joined Victoria and parts of New South Wales in lockdown on Tuesday.\nAnger in Australia is growing over the lockdown strategy, with the two biggest cities Sydney and Melbourne facing uncertainty over when they will open.\nDespite entering lockdown late last month, Sydney reported 110 new cases on Wednesday, taking its current outbreak to more than 1,300 cases.\nMany Australians have compared their situation to re-openings happening in the UK and the US, placing pressure on the federal government."
  },
  {
    "headline": "France Rolls out Covid Health Pass as Cases Soar",
    "summarized_story": "A new Covid health pass has come into effect in France amid a surge of new infections.\nFrom Wednesday, people need proof of vaccination, a negative test or recent recovery from Covid to enter most museums and cinemas.\nThis was compared to fewer than 7,000 cases a day last week, a surge of 150%, as the highly contagious Delta variant spreads throughout the country.\nPresident Emmanuel Macron announced the plans for a health pass earlier this month, as well as compulsory vaccination for all health workers by September.\nThis so-called Health Pass is the government’s answer to infection rates that are rising faster than France has ever seen in this pandemic."
  },
  {
    "headline": "Thousands Evacuated as Deadly Floods Hit China",
    "summarized_story": "Massive floods in central China caused by record-breaking rainfall have left 12 dead and more than 100,000 people evacuated from their homes.\nMore than a dozen cities in Henan province, including its provincial capital Zhengzhou, are affected.\nHenan province, home to about 94 million people, has issued its highest level of weather warning.\nBy Tuesday night, Zhengzhou and other places in Henan province saw widespread flooding.\nHenan has experienced “rare and severe rainfall” since Saturday, China’s meteorological authority said on Wednesday."
  }
]