[
  {
    "headline": "Malaysia’s PM loses parliamentary majority, offers to resign Monday",
    "summarized_story": "Prime Minister Muhyiddin Yassin has faced mounting pressure to step aside after losing his parliamentary majority, and over his administration’s handling of a worsening coronavirus outbreak.\n'”Muhyiddin told the meeting it would be up to the king — who has publicly criticised his government — to accept his resignation or not, the minister added.\nMalaysia’s constitutional monarch formally appoints the candidate whom he believes commands majority support in parliament as premier.\nRead AlsoBut, with no clear successor as prime minister, there are likely to be days of political horse-trading ahead as MPs seek to form a workable coalition.\nThis includes former prime minister Najib Razak, who was convicted and sentenced to 12 years in jail last year over the multi-billion-dollar 1MDB scandal."
  },
  {
    "headline": "Zambia’s Lungu urged to concede as opposition leads in crunch vote",
    "summarized_story": "An alliance of Zambia’s main opposition parties on Sunday called on President Edgar Lungu to concede as early election results showed their candidate leading the tightly-fought poll.\nResults from around 40 of the constituencies that have so far reported place the veteran 59-year-old opposition leader Hakainde Hichilema, ahead of Lungu, who is 64.\nHakainde, who leads the largest opposition United Party for National Development (UPND), enjoyed the backing of 10 opposition parties at the Thursday polling under the banner of the UPND Alliance.\nRead Also Zambian presidential election: Opposition leader Hichilema takes early leadThe opposition scoffed at Lungu’s “unsubstantiated” claims.\nMilupi fell short of claiming victory for the opposition, but urged Zambians to prepare for Hichilema’s inauguration."
  },
  {
    "headline": "With ‘Spot On album, Da Video’ Femi Solar reaches new heights",
    "summarized_story": "By Ayo OnikoyiThings have continued to look up for Jasa gospel and juju singer, Femi Oladele, famously known as Femi Solar who has taken his music game to new heights with the release of his much-talked about album, Spot On and Da Video.\nThose who have been following the trajectory of Solar’s rise have been saying he is fast emerging into a force that could not be ignored by music lovers within and outside the juju circles.\nHis fans have described him as one artiste who is currently pushing a unique brand of juju music, a development which the singer believes to be a big moment in his life.\nDespite the challenges of 2020 occasioned by the Covid-19 pandemic, which forced him to push the release of the album and music concert to this year, Solar has been gaining lots of attention all over the world with awards and recognitions also trailing his music career.\nVanguard News Nigeria"
  },
  {
    "headline": "Photos: Mr Raw survives auto crash in Abuja",
    "summarized_story": "By Nwafor SundayVeteran Igbo rapper, Okechukwu Edwards Ukeje, aka Mr Raw, has reportedly survived a ghastly motor accident in Abuja.\nDisclosing this on his Instagram page @talk2raw, the rapper asked Nigerians to thank God for his life, noting that a driver rammed into his vehicle in Abuja.\nI was involved in a ghastly motor accident early this morning at abuja (before Bannex junction)….I was unconcious when I was pulled out of the red car after a another driver rammed into our car.\nI passed out twice but i am stable now and responding to treatment.\nThe driver is receiving treatment as well."
  },
  {
    "headline": "ACF, Northern Speakers mourn Ahmed Joda, ex-’Super Perm Sec’",
    "summarized_story": "The latest tributes came from Arewa Consultative Forum (ACF), Nigeria Communications Commission (NCC) and Northern Speakers Forum.\nPatriot, great public servant — ACFIn its message, ACF said Joda was an honest, but firm public servant.\nAccording to him, “In 1967, Joda was appointed a Federal Permanent Secretary from the Northern Regional Service.\n“The late Ahmed Joda was a calm and honest, soft spoken but firm public servant.\n“He was indeed a rare gem and will be missed not just by those whose paths had cross his, but our dear country Nigeria."
  },
  {
    "headline": "Redirect N4.8bn to monitor WhatsApp calls to pay doctors’ salaries, SERAP tells Buhari",
    "summarized_story": "Additionally, the lack of any safeguards against discriminatory decision-making, and access to an effective remedy shows the grave threats it poses to constitutionally and internationally recognized human rights.”“We would be grateful if the recommended measures are taken within seven days of the receipt and/or publication of this letter.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel your government to comply with our request in the public interest.”“SERAP is concerned that the proposed spending to monitor WhatsApp messages, phone calls, and text messages of Nigerians and other people is inconsistent and incompatible with the Nigerian Constitution and the country’s international human rights obligations.”“Specifically, Section 37 of the Nigerian Constitution, and Article 17 of the International Covenant on Civil and Political Rights, to which the country is a state party, provide for the right to freedom from arbitrary or unlawful interference with privacy and correspondence, communications and private data.”“Section 39 of the Nigerian Constitution and Article 19 of the Covenant also protect everyone’s right to hold opinions without interference and to seek, receive and impart information and ideas of all kinds, regardless of frontiers and through any media.”READ ALSO: SERAP seeks probe of N881bn spending by 367 MDAs without appropriation“SERAP wishes to stress your government’s obligations under article 9 of the African Charter on Human and Peoples’ Rights, and article 13 of the UN Convention against Corruption both of which Nigeria has ratified.”“Similarly, the UN General Assembly has condemned unlawful or arbitrary surveillance and interception of communications as ‘highly intrusive acts’ that interfere with fundamental human rights (see General Assembly resolutions 68/167 and 71/199).”“SERAP is concerned that the powers to conduct arbitrary, abusive or unlawful surveillance of communications may also be used to target political figures and activists, journalists and others in the discharge of their lawful activities, especially given the growing repression of civic space, suspension of Twitter, and attacks on freedom of expression and media freedom in the country.”“Privacy and expression are intertwined in the digital age, with online privacy serving as a gateway to secure exercise of the freedom of opinion and expression.\nTherefore, targets of surveillance would suffer interference with their rights to privacy and freedom of opinion and expression whether the effort to monitor is successful or not.”“Interference with privacy through targeted surveillance is designed to repress the exercise of the right to freedom of expression.”“Surveillance of journalists, activists, opposition figures, critics and others simply exercising their right to freedom of expression – would lead to violations of other human rights such as the rights to liberty and freedom from torture and other ill-treatment.”“Targeted surveillance creates incentives for self-censorship and directly undermines the ability of journalists and human rights defenders to conduct investigations and build and maintain relationships with sources of information.”“SERAP is concerned about the failure by your government to resolve the strike by the National Association of Resident Doctors (NARD) over pay, insurance benefits and poor facilities, and its effects on poor Nigerians, especially as the country faces a third wave of coronavirus.”“According to our information, in July, 2021, you reportedly signed the 2021 supplementary appropriation bill of N983 billion into law.\nOf the amount, N4.8bn (N4,870,350,000) was allocated to the National Intelligence Agency (NIA) to monitor WhatsApp messages, phone calls, and text messages of Nigerians and other people.”“Of the figure, N1.93 billion was earmarked for ‘WhatsApp Intercept Solution’ and N2.93 billion for ‘Thuraya Interception Solution’ – a communications system used for monitoring voice calls or call-related information, SMS, data traffic, among others.”The letter was copied to Mr Abukabar Malami, SAN, Attorney General of the Federation and Minister of Justice; and Mrs Zainab Ahmed Minister of Finance, Budget and National Planning.\nVanguard News Nigeria"
  },
  {
    "headline": "Plateau killings unsettle Ondo",
    "summarized_story": "Reason: The victims were said to be natives of Ondo travelling through Plateau.\nCase of mistaken identityA statement by Akeredolu’s Chief Press Secretary, Richard Olatunde, in Akure, Ondo State capital, said the attack was “a case of mistaken identity”.\nThe statement read: “Ondo State Governor, Arakunrin Oluwarotimi Akeredolu, SAN, just a few hours ago, received the unfortunate report of the Plateau State tragedy where some people believed to be indigenes of Ondo State were attacked.\n“The Governor says from report he received from his brother Governor in Plateau, the incident was a case of mistaken identity.\n“I have spoken with my brother Governor in Plateau, and he has assured me that the situation is under control."
  },
  {
    "headline": "I’ve never benefited from any political era in my life – Bishop Oyedepo",
    "summarized_story": "President and founder of Living Faith Church Worldwide, Bishop David Oyedepo has denied benefiting from any government in Nigeria since he was born on September 27, 1954.\nThe African richest pastor made the assertion on Sunday during a sermon at the church’s headquarters in Ota, Ogun State.\nAccording to him, he saw trouble befalling the nation by President Muhammadu Buhari’s administration.\nI saw trouble, I saw Nigeria under stress.\n“I am a zero beneficiary of any political era in my life."
  },
  {
    "headline": "BREAKING: Lalong imposes 24-hour curfew on Jos North over Rukuba killings",
    "summarized_story": "Barely hours after the imposition of a dusk to dawn curfew in Jos North, Bassa and Jos South LGAs, Government Simon Lalong has further imposed a 24 hour curfew in Jos North LGA where the skirmishes took place on Saturday that claimed many lives and left several injured.\nThe Governor also said the 24 hour curfew imposed on Jos North Local Government is indefinite.\n“Hours after announcing a dusk to dawn curfew in three Local Government Areas of Jos North, Jos South and Bassa, Plateau State Governor Simon Bako Lalong has directed the imposition of a 24-hour curfew in Jos North to contain further security threats.\n“From 2pm of today, Sunday 15th August 2021, a 24-hour curfew will come into effect in Jos North Local Government Area,” it read.\nThe Governor further stated that, “the 24 hour curfew in Jos North Local Government will remain in force until further notice.”"
  },
  {
    "headline": "FG flies ISIS fighters’ family members, others to Nigeria",
    "summarized_story": "The Federal Government of Nigeria has repatriated 22 family members of slain Islamic State (ISIS) fighters.\nThe relatives, flown to the nation’s capital, Abuja, were among the 101 stranded Nigerians in Libya.\nThose brought back were received by officials of Foreign Affairs Ministry, NIDCOM, Nigeria Centre for Disease Control (NCDC), National Drug Law Enforcement Agency (NDLEA).\n“The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children,” Balogun said.\nAt the weekend, Katsina Governor, Aminu Bello hinted that the Islamic State West Africa Province (ISWAP) is trying to establish bases in the North-West."
  },
  {
    "headline": "Islamic group accuses Christian militia of carrying out Plateau killings, slams Lalong",
    "summarized_story": "The Muslim Rights Concern (MURIC) has called for the immediate rounding up of all members of the alleged Christian militia that reportedly killed 22 unarmed Muslim travellers in Rukuba, Jos, Plateau State, on Saturday.\n“Twenty two (22) unarmed Muslim travellers were brutally killed by a Christian militia group at Rukuba, Jos, Plateau State, today, Saturday, 14th August, 2021,” MURIC claimed.\nMURIC, therefore condemned the massacre, describing it as barbaric, and demanded the rounding up of all members of the Irigwe Christian militia.\n“We reject the crocodile tears and lies of Governors Lalong of Jos and Akeredolu of Ondo State who claimed that the attack was a case of mistaken identity.\n“How can anybody say Muslims from Ikare in Ondo State were killed in such a large number due to ‘mistaken identity’?"
  },
  {
    "headline": "Gov Ortom tasks Benue residents on investment in agriculture",
    "summarized_story": "Governor Samuel Ortom on Saturday charged Benue people to take advantage of the investment opportunities in Agriculture to improve their individual and state economy.\nHe spoke yesterday at the Redeemed Christian Church of God, RCCG, Gboko road while presenting a paper on “Agriculture: Untapped Business Potentials,” during the Men’s Fellowship Convention 2021.\nThe Governor stated that the agricultural value chain could be harnessed for serious investment, stressing that the agricultural potentials in Benue are enormous.\nAccording to the Governor, upon creation, God gave man agriculture as evident in the garden of Eden, where Adam was asked to take charge.\nDuring the event, Governor Ortom joined the pastors and congregation in cutting the convention cake."
  },
  {
    "headline": "BBNaija Shine Ya Eye: I’m not mentally compatible with Sammie, says Angel",
    "summarized_story": "On Saturday night after the party, BBNaija Shine Ya Eye housemates Angel and Sammie had a long talk over the future of their relationship.\nThe heart -to- heart conversation had the two housemates talking about not being compatible and trying to work things out between them.\nADVERTISEMENTAngel told Sammie that she’s not mentally compatible with Sammie, which is why she feels she doesn’t want to take their relationship to the next stage.\nThough Sammie feels otherwise, Angel said she doesn’t want to be in any toxic relationship and would like to see as things grow between them while the remained friends only.\nThe two ended up sleeping on Angel’s bed."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Jackie B confronts Michael over Angel",
    "summarized_story": "BBNaija Shine Ya Eye housemate, Jackie B has confronted her man Michael over Angel.\nOn Saturday afternoon, Michael pulled Angel to give him a head massage in the presence of Jackie B.ADVERTISEMENTJackie B, in turn, asked Angel why she’s rubbing Michael’s head to which she pointed at Michael.\nAfter the Saturday night party, Jackie B had gone to change when she found Peace embroiled with Michael and rubbing her head.\nDuring their discussion, Jackie expressed her slight jealousy which she termed embarrassment.\nMichael sees otherwise saying Jackie B has a pre-imposed conclusions about him and other female housemates when he has identified with her as his woman."
  },
  {
    "headline": "BBNaija Shine Ya Eye: I can’t see Emmanuel get evicted – Liquorose",
    "summarized_story": "BBNaija housemate, Liquorose has said she doesn’t care how it would happen but she can’t take Emmanuel’s eviction.\nLiquorose said she’s already used to Emmanuel and seeing him leave today would hurt her.\n“You can’t come into my life, mess up shit and leave.\nADVERTISEMENTEmmanuel, however, told her to remain focused on the goal which is winning the N90 million ultimate prize.\nHe said: “Stay focused and win the money, you are a born winner.”Emmanuel, Arin, Nini, Tega and Saskay are up for eviction and at least one of them would be leaving the BBNaija Shine Ya Eye house on Sunday."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Boma tells Queen not to cage him",
    "summarized_story": "BBNaija Shine Ya Eye housemate Boma has warned Queen to stop caging him.\nHe complained he does not appreciate how Queen dragged him away from dancing with other girls at the Friday party.\n“I have to tell you now don’t pull me off from other girls when I’m dancing we are not in a relationship.\nIn her defence, Queen said Boma embarrassed her with his words and actions in front of other girls.\nADVERTISEMENTThe ex-beauty queen said she merely pulled Boma away playfully and wasn’t as serious as he’s making it seem."
  },
  {
    "headline": "Agitations: CAN urges FG to dialogue with Kanu, Igboho",
    "summarized_story": "This was contained in a communiqué of the association after its state executive meeting held yesterday at Emmanuel Anglican Church, Onitsha, Anambra State.\nThe body insisted that dialogue was the best approach towards unity and justice.\nCAN frowned at the activities of the security agents, who it said, always mount roadblocks, extorting money through intimidation of the populace.\nAbraham Nwali of Ebonyi State branch on his emergence as the new SoutheEast zonal chairman of the CAN.\nCAN urged the youths not to allow themselves to be used as political thugs during the campaigns and called on eligible voters to ensure that they obtained their voters cards."
  },
  {
    "headline": "UN September protest: Yoruba nation, Biafra agitators flee Nigeria",
    "summarized_story": "So, their next plan is to embark on massive crackdown of other known figures within the groups.\n“It has now dawned on them that the proponents of Oodua Nation and Biafra really mean business because of the way these groups have carried on with their demand for freedom despite the clampdown on the leaders of the groups,” the source said.\nRather, it stated that NINAS was currently perfecting plan to stage a ‘One Million March’ during the 76th Session of the United Nations General Assembly billed for 14 to 21 September 14 to 21.\n“The planned march shall be historic and epoch-making.\nWe want the whole world to see the level of injustice, oppression and intimidation currently going on in Nigeria."
  },
  {
    "headline": "22 killed, 14 injured as hoodlums clash in Jos",
    "summarized_story": "From Gyang Bere, JosThe Plateau State Police Command has confirmed the death of 22 persons following the violent clash that took place yesterday between hoodlums along Rukub Road in Jos North Local Government Area of Plateau State.\nThe Commissioner of Police, Edward Egbuka in a press statement in Jos said 14 persons were inflicted with injuries, currently receiving treatment in different medical facilities in the state.\n“Unfortunately, 22 persons were killed and 14 injured in the attack.\nHe urged the public to remain calm and to furnish the police with useful information that would aid the investigation.\nMeanwhile, troops of Operation Safe Haven (OPSH) have arrested 12 suspected persons in connection with the fresh violence that erupted at Angwan Rukuba road in Jos North Local Government Area of the state."
  },
  {
    "headline": "2023: APC scared of coming of a third force",
    "summarized_story": "He expressed apprehension on other critical national issues, including PIB, e-transmission of election results, restructuring, among others.\nIn 2014, the Scots had a referendum to remain within the UK or become independent of the UK.\nAn idea becomes a material force, beyond individuals, when objective conditions make the idea to grip the mind of wide layers of the society.\nWithout electronic transmission of election results, Nigeria is doomed under the APC as the pilot of Nigeria.\nSome people have argued that Nigeria no longer need restructuring when there is a rotation principle in the system…?"
  },
  {
    "headline": "I don’t know what I have that attracts men – Queen Fazzima, actress",
    "summarized_story": "You have a sexy shape, but if I may ask, is it natural or artificial?\nWith this your sexy shape, how do you handle your male fans?\nBut I don’t know what they see in me that attracts them.\nBut seriously, I don’t know, na man fit talk am.\nTell us what most people don’t know about you?"
  },
  {
    "headline": "22 family members of dead ISIS fighters repatriated to Nigeria",
    "summarized_story": "The federal government has announced that 22 family members of slain Islamic state of Iraq and Syria (ISIS) fighters have been repatriated to Abuja.\nAdvertisementAccording to a statement by Abdur-Rahman Balogun, spokesman of the Nigerians in Diaspora Commission (NIDCOM), they were among 101 stranded Nigerians repatriated from Libya.\n“The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children,” the statement reads.\nHe was killed in October 2011 after being captured by rebels during Libya’s civil war.\nISIS fighters are also scattered across the country."
  },
  {
    "headline": "22 family members of dead ISIS fighters repatriated to Nigeria",
    "summarized_story": "The federal government has announced that 22 family members of slain Islamic state of Iraq and Syria (ISIS) fighters have been repatriated to Abuja.\nAdvertisementAccording to a statement by Abdur-Rahman Balogun, spokesman of the Nigerians in Diaspora Commission (NIDCOM), they were among 101 stranded Nigerians repatriated from Libya.\n“The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children,” the statement reads.\nHe was killed in October 2011 after being captured by rebels during Libya’s civil war.\nISIS fighters are also scattered across the country."
  },
  {
    "headline": "Masari: Every state can sustain itself -- Nigeria shouldn't depend on oil",
    "summarized_story": "Aminu Masari, governor of Katsina, says every state in the country has the potential of sustaining itself.\nAdvertisementIn an interview with NAN, Masari said states should look inwards to see the resources they have rather than depend on the crude oil earnings of the country.\nThe governor said if the country depends solely on oil, “there will be a total collapse of the institutions”.\nAdvertisement“The summary of what I am saying is that every single state of the federation has advantage or comparative advantage in terms of what it can develop to sustain itself, especially in the area of agriculture.\n“Let me give you a simple example, I may be wrong but as the governor of Katsina State I should not be earning as much as the governor of Lagos,” he said."
  },
  {
    "headline": "Masari: Every state can sustain itself -- Nigeria shouldn't depend on oil",
    "summarized_story": "Aminu Masari, governor of Katsina, says every state in the country has the potential of sustaining itself.\nAdvertisementIn an interview with NAN, Masari said states should look inwards to see the resources they have rather than depend on the crude oil earnings of the country.\nThe governor said if the country depends solely on oil, “there will be a total collapse of the institutions”.\nAdvertisement“The summary of what I am saying is that every single state of the federation has advantage or comparative advantage in terms of what it can develop to sustain itself, especially in the area of agriculture.\n“Let me give you a simple example, I may be wrong but as the governor of Katsina State I should not be earning as much as the governor of Lagos,” he said."
  },
  {
    "headline": "INTERVIEW: I allowed Teachers Naija clash with BBNaija for comparison, says convener",
    "summarized_story": "The second edition of Teachers Naija, a Nigerian reality TV show, has continued to attract attention since it kicked off on August 3 with 20 housemates battling for its N37 million grand prize.\nThe second season was originally billed for 2020 but it could not hold as planned due to the coronavirus pandemic.\nAdvertisementEnuagwuna Ubaka, the show’s convener, had earlier told TheCable Lifestyle that the essence of the reality TV show is to reward teachers as the profession has been looked down on for so long.\nWith eight housemates already evicted from the house as of Thursday, 12 teachers are now left to compete for the ultimate prize.\nWhat sets the teachers’ reality show apart from other reality shows?"
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "2023: Who will rebuild Nigeria?",
    "summarized_story": "Nigeria today has become a laughing stock in the comity of nations, even on the African continent where it claims to be the giant.\nEven an unborn baby can sense that all is not well with Nigeria.\nIn the last few months, some leading politicians have declared their interest in the presidential race in Nigeria.\nPerhaps, the first was former, Zamfara State governor, Sanni Yerima, Kingsley Moghalu, a former deputy governor of the Central Bank of Nigeria (CBN) and Sam Ohuabunwa, president of the Pharmaceutical Society of Nigeria (PSN).\nIn the last one week there have been mixed reactions across Nigeria on the former military ruler’s comments and what should form the yardstick for anyone to emerge Nigeria’s president in 2023."
  },
  {
    "headline": "Love, money, celebs and sports top Nigerians Google search in 15years",
    "summarized_story": "These were the two most searched questions in Nigeria over the last 15 years as Google Trends turned 15.\nGoogle trends, the search tool providing insights into what netizens are searching for at any given moment, which turned 15 this week, has offered insights into search patterns over the years.\nFrom entertainment to sports and culinary concerns including dieting, Nigerians have turned to the search engine to meet their information needs.\nGoogle Search trends information is gleaned from data based on what Nigerians have been searching for.\nFrom the international scene, the likes of Cardi B and Kanye West also commanded a lot of interest from Nigerians."
  },
  {
    "headline": "Wellness: A day at the Dew centre in Lagos",
    "summarized_story": "Wellness has always been an important part of my work-life balance, so I was excited to discover wellness at the Dew Centre which is located on 31 Adebayo Doherty Streetin the upscale neighbourhood of Lekki Lagos.\nThe Dew Wellness CentreThe Dew Centre is the brainchild of notable interior designer and wellness advocate, Omon Anenih-Mordi and Africa’s first design consultancy, boutique hotel and wellness centre.\nThe Dew centre is the first of its kind in Africa, mixing elements of design, education and wellness.\nThe Dew Centre offers the possibility to become a plant mom or dad.\nWe left the DEW centre feeling excited, rejuvenated and relaxed."
  },
  {
    "headline": "Edo Polytechnic sets for Tech, Innovation Day in Sept – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, is set to organise a Technology and Innovation Day, to exhibit novel innovative tools and equipment developed by students, lecturers, artisans, entrepreneurs and other critical technology stakeholders in Edo State.\nRector of the polytechnic, Prof. Abiodun Falodun, in a chat with journalists, said the event will hold from September 21 to 23, 2021, noting that it is an initiative of the institution to provide a platform to showcase innovative and entrepreneurial output from the school and its host community.\nHe said the exhibition is themed, ‘Repositioning the Nigerian Ecosystem for Excellence and Innovation in Technological and Technopreneurial Advancements’, while the guest speaker at the event is the Director-General (DG) of the National Space Research and Development Agency (NASRDA), Dr. Halilu Shaba.\nAccording to the rector, “The event will feature exhibitions by industries, staff, students, entrepreneurs, Small and Medium Enterprises (SMEs), artisans, government and Non-Governmental Organisations (NGOs), and awards will be presented to different categories of winners.”Some of the equipment that will be on display include fabricated yam pounding machines, waste to wealth plastic recycling equipment and software applications, among others.\nProf. Falodun said the event is aligned with the Governor Godwin Obaseki-led administration’s mandate for institutions of higher learning in the state to deploy technology in solving society’s problems."
  },
  {
    "headline": "Obaseki mourns death of former First Lady, Hadiza Shagari – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of former First Lady, Hajiya Hadiza Shehu Shagari, widow of late President Shehu Shagari.\nIn a statement, the governor described the death of Hajiya Hadiza Shagari as painful, noting that she was gracious and dutiful in the discharge of her role.\nAccording to him, “I am saddened by the news of the death of former First Lady, Hajiya Hadiza Shehu Shagari, widow of late President Shehu Shagari.\n“On behalf of the Government and people of Edo State, I commiserate with Rt.\nAminu Waziri Tambuwal, the Governor of Sokoto State, the entire Shagari Family as well as friends and associates of the family and pray that God will grant us all the fortitude to bear this irreparable loss.”..."
  },
  {
    "headline": "Passenger Train Crushes Mother, Child To Death In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Tragedy struck today as passenger train, plying the Itakpe – Warri railway on Thursday, crushed a mother and her child to death in Orhuwhorun community, Udu Council area of Delta state.\nThe Nigerian Observer gathered that the incident occurred at about 3:40pm in the Aragba area of the community.\nAccording to reports, the woman, a moi-moi seller and her teenage daughter, were walking on the rail tracks when the unfortunate incident happened.\nWhile the mother was ran over by the train, the daughter appeared to have been knocked off the rail tracks, where her body laid.\nIt was gathered that the train was bound for the Ujevwu Train Station in Udu and scheduled to return to Itakpe in Kogi state this evening."
  },
  {
    "headline": "Obaseki expresses satisfaction with ongoing overhaul of state-owned varsity, praises special intervention team – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, said his government remains committed to restructuring the state-owned Ambrose Alli University to meet global standards, expressing satisfaction with the progress of the ongoing overhaul of the institution by the Special Intervention Team.\nObaseki, who received an updated report from the chairman of the team, Mr. Andrew Olotu, at the Government House in Benin City, said the government will continue to support the committee to realize its mission.\nAccording to him, “We are going to provide you with the key infrastructure needed to build a world-class university, so that we achieve our goal of using technology to change the future of the school.\nWhatever support you want us to give you, we will give you; the feedback I get is that sanity is returning back to the university.\nIzekor further said the team had put measures in place to activate a profound re-engineering academic programme, noting that the institution can generate funds to sustain its operations."
  },
  {
    "headline": "Plateau Killings: NSCIA warns against reprisals, says eight people still missing",
    "summarized_story": "ADVERTISEMENTThe Nigeria Supreme Council of Islamic Affairs (NSCIA) has condemned the killing of 23 travellers in Jos North Local Government Area of Plateau State.\nIn a statement on Sunday, the NSCIA, led by the Sultan of Sokoto, Saad Abubakar, warned against reprisals and called for calm.\nThe Nigerian Supreme Council for Islamic Affairs (NSCIA) under the leadership of its President-General and Sultan of Sokoto, His Eminence, Alh.\nThe Council is monitoring the investigation and would ensure that justice is done.\nThe Council commiserates with all Muslims, particularly Sheikh Dahiru Bauchi, the host of the religious event from which the victims were returning."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Plateau gov orders 24-hour curfew as tension mounts over killing of 23 travellers",
    "summarized_story": "Few hours after announcing a dusk-to-dawn curfew in three local government areas of Jos North, Jos South and Bassa, Plateau State governor, Simon Bako Lalong has directed the imposition of a 24-hour curfew in Jos North to contain further security threats.\nThis comes after travellers were yesterday ambushed and about 23 killed by suspected Irigwe youth in apparent retaliatory attack.\nThe state governor, Rotimi Akeredolu, had yesterday, condemned the attack in a statement.\nThe killing follows months of repeated clashes between rigwe youth and Fulani herders who had reportedly sustained attacks in the area for periods.\nThis is as the Inspector-General of Police (IGP) Usman Baba, on Sunday ordered the immediate deployment of Police Intervention Team to Plateau State to carry out an on-the-spot assessment."
  },
  {
    "headline": "Eight more die from Covid-19 as Nigeria records 665 new cases",
    "summarized_story": "Eight more Nigerians died on Saturday from Covid-19, as the country recorded recorded 665 fresh cases of the virus across 12 states and the Federal Capital Territory (FCT).\nThe update by the NCDC indicated that more than half of the new cases reported on Saturday in Nigeria were recorded in Lagos State.\nWith 369 cases out of the 665 infections, Lagos State has remained Nigeria’s coronavirus pandemic epicentre.\nEdo and Delta states also reported 21 and seven new Infections respectively while Ekiti State registered 15 and its nearby Ondo State reported 13.\nMeanwhile, the NCDC said about 166,826 of the over 181,000 total infections in Nigeria have recovered after treatment"
  },
  {
    "headline": "At least 304 dead as 7.2-magnitude earthquake hits Haiti",
    "summarized_story": "Not less than 304 people are reported dead following a massive 7.2-magnitude earthquake that struck Haiti on Saturday morning.\nNow, 11 years after the devastating 2010 earthquake, Haitians are again dealing with crushed bodies, collapsed buildings and overwhelmed hospitals.\nHaiti became a center for charities and nongovernmental organizations in the aftermath of the 2010 earthquake.\nWe lived [through] the 2010 earthquake and all I could do was run.\nThe 2010 earthquake in Haiti killed more than 200,000 people and caused extensive damage to infrastructure and the economy."
  },
  {
    "headline": "First Bank deepens financial inclusion with N100b facility",
    "summarized_story": "Barely a year after the launch of the Firstmonie Agents Credit scheme, First Bank, announced last week that it has economically empowered its Firstmonie Agents with the sum of N100 billion.\nFor a bank which prides itself as the nation’s financial inclusion services provider and has pursued the financial inclusion drive of the Central Bank of Nigeria (CBN) and the federal government with vigour, this may be another exciting way of matching words with action.\nAccording to World Bank, financial inclusion means that individuals and businesses have access to useful and affordable financial products and services that meet their needs – transactions, payments, savings, credit and insurance – delivered in a responsible and sustainable way.\nWorld Bank also notes that access to a transaction account is a first step toward broader financial inclusion since it allows people to store, send and receive money.\nA few years ago, the CBN set a target of 80 percent financial inclusion by 2020."
  },
  {
    "headline": "Many Feared Dead As Bus Plunges Into Pit In Ebonyi",
    "summarized_story": "An unspecified number of passengers were feared dead as a vehicle they were travelling in skidded of the road and plunged into an excavation pit in Ebonyi State on Saturday.\nThe pit is said to be about 32 feet deep.\nThe accident, which occurred around 1:30pm, happened along Abakaliki-Ikwo expressway at Enyigba-Izzi community in Abakaliki local government area.\nADVERTISEMENTMen of the Nigeria Police Force (NPF) and the Federal Road Safety Corps (FRSC) were already on ground to ensure the availability of security and management of traffic as of the time of this reporting.\nMeanwhile, local divers involved in the rescue operation confirmed that the vehicle involved is a shuttle bus."
  },
  {
    "headline": "Many Feared Dead As Bus Plunges Into Pit In Ebonyi",
    "summarized_story": "An unspecified number of passengers were feared dead as a vehicle they were travelling in skidded of the road and plunged into an excavation pit in Ebonyi State on Saturday.\nThe pit is said to be about 32 feet deep.\nThe accident, which occurred around 1:30pm, happened along Abakaliki-Ikwo expressway at Enyigba-Izzi community in Abakaliki local government area.\nADVERTISEMENTMen of the Nigeria Police Force (NPF) and the Federal Road Safety Corps (FRSC) were already on ground to ensure the availability of security and management of traffic as of the time of this reporting.\nMeanwhile, local divers involved in the rescue operation confirmed that the vehicle involved is a shuttle bus."
  },
  {
    "headline": "ECOWAS Quest For Energy Efficiency Amid Challenges",
    "summarized_story": "The meeting emphasized on innovation, active involvement of the private sector and citizen participation, as a critical factor for achieving efficiency in the energy sector, which can only be achieved through effective policies.\nAccording to the Speaker “Even more important was the disclosure of the opportunities that energy efficiency provides and how investments in energy provide relatively quick returns with a high degree of certainty.\n“Perhaps, in an effort to manage the Energy sector, Governments can be the effective regulators, while the private sector addresses issues relating to access and provide technical and operational capacity.\nLet us look ahead into the future and build a high-end and prudent platform for regional energy development,” Tunis said.\nIt therefore calls for more robust financing without which the objective of energy efficiency may remain a mere dream."
  },
  {
    "headline": "ECOWAS Quest For Energy Efficiency Amid Challenges",
    "summarized_story": "The meeting emphasized on innovation, active involvement of the private sector and citizen participation, as a critical factor for achieving efficiency in the energy sector, which can only be achieved through effective policies.\nAccording to the Speaker “Even more important was the disclosure of the opportunities that energy efficiency provides and how investments in energy provide relatively quick returns with a high degree of certainty.\n“Perhaps, in an effort to manage the Energy sector, Governments can be the effective regulators, while the private sector addresses issues relating to access and provide technical and operational capacity.\nLet us look ahead into the future and build a high-end and prudent platform for regional energy development,” Tunis said.\nIt therefore calls for more robust financing without which the objective of energy efficiency may remain a mere dream."
  },
  {
    "headline": "Teenager In Hospital After Being Hit By Stray Bullet",
    "summarized_story": "A teenage girl in Akwa Ibom State has been hospitalised after being fatally injured by stray bullets allegedly fired by an official of the Nigeria Security and Civil Defense Corps (NSCDC), at a wedding ceremony.\nThe victim, Veronica Kufre, who is said to have attended the ceremony in Uyo, the state capital at the weekend, was hit by stray bullet of a NSCDC official.\nIt was gathered that while the victim was being rushed to the hospital, angry youths of the area were said to have mobilised in a mob action against the security officials but they were rescued by some police operatives who drove in with their van to whisk the two officers away.\nHowever, the 15-year-old has been admitted at the intensive care unit of the Life Care Clinic, Udosen Uko Street, Uyo after three hospitals were said to have declined admitting her, due to the critical nature of her case.\nSpokesman of the NSCDC, Mr Ukeme Umana, could not be reached for his reaction as his phone was switched-off, but the state police public relations officer (PPRO), Superintendent of Police Odiko MacDon, said the command was yet to receive the report."
  },
  {
    "headline": "Baptist school students: Agonised mother suffers swollen heart as bandits insist on fresh N80m ransom",
    "summarized_story": "The parents were also said to be speaking with the bandits who reportedly insisted on collecting the N80m ransom.\nHe said, “If Nigerians have forgotten our 80 children, those who have forgotten them are not fair to us.\n“We as their parents and the church and Christians in Kaduna State have not forgotten them.\nHe added, “We are communicating with the bandits, the bandits are actually talking.\nMeanwhile, the Kaduna State Police Command has confirmed eight farmers were killed when bandits invaded Buruku and Udawa villages in Chikun Local Government Area."
  },
  {
    "headline": "Baptist school students: Agonised mother suffers swollen heart as bandits insist on fresh N80m ransom",
    "summarized_story": "The parents were also said to be speaking with the bandits who reportedly insisted on collecting the N80m ransom.\nHe said, “If Nigerians have forgotten our 80 children, those who have forgotten them are not fair to us.\n“We as their parents and the church and Christians in Kaduna State have not forgotten them.\nHe added, “We are communicating with the bandits, the bandits are actually talking.\nMeanwhile, the Kaduna State Police Command has confirmed eight farmers were killed when bandits invaded Buruku and Udawa villages in Chikun Local Government Area."
  },
  {
    "headline": "Fresh attack: Police confirm killing of eight Kaduna farmers",
    "summarized_story": "Some bandits have reportedly invaded Buruku and Udawa villages in Chikun Local Government Area of Kaduna State, killing eight farmers.\nAccording to the spokesman, there was an attack on the two communities, adding that “we are yet to get details of the attacks.”“There were attacks on farmers in Buruku and Udawa communities.\nWhile saying that five of the farmers were killed at Buruku area along the dreaded Birinin Gwari – Kaduna highway, three of the farmers were killed by bandits at Udawa village.\nThe source called on the government to come to their rescue as they were being overwhelmed by bandits’ attacks on a daily basis.\n“We can no longer go to the farm as the bandits attack at will,” he added."
  },
  {
    "headline": "Fresh attack: Police confirm killing of eight Kaduna farmers",
    "summarized_story": "Some bandits have reportedly invaded Buruku and Udawa villages in Chikun Local Government Area of Kaduna State, killing eight farmers.\nAccording to the spokesman, there was an attack on the two communities, adding that “we are yet to get details of the attacks.”“There were attacks on farmers in Buruku and Udawa communities.\nWhile saying that five of the farmers were killed at Buruku area along the dreaded Birinin Gwari – Kaduna highway, three of the farmers were killed by bandits at Udawa village.\nThe source called on the government to come to their rescue as they were being overwhelmed by bandits’ attacks on a daily basis.\n“We can no longer go to the farm as the bandits attack at will,” he added."
  },
  {
    "headline": "Italy-bound drug trafficker Nnadi busted with 100 wraps of heroin at Lagos Airport",
    "summarized_story": "An Italy-bound drug trafficker, Mrs. Nnadi Nora Chinyere has been arrested at the Murtala Mohammed International Airport, MMIA, Ikeja, Lagos, with 100 wraps of heroin and two parcels of same substance.\nShe was arrested by operatives of the National Drug Law Enforcement Agency, NDLEA at the airport at the departure hall.\nHe said Nnadi was arrested on Tuesday, 3rd August, 2021, during an outward clearance of passengers on Qatar Airways flight to Florentine, Italy.\nHe said further investigation revealed the consignment contained 66.600kg of cannabis sativa; 1.600kg heroinand 1.450kg of cocaine with a combined weight of 69.65kilograms, all concealed inside cosmetics.\nHe explained that when the export package was opened and examined, 2.3kg of cocaine and 23.5kg of compressed cannabis were discovered inside."
  },
  {
    "headline": "Gov. Masari reveals retirement plans",
    "summarized_story": "Aminu Masari of Katsina state said he will retire home to rest, after the completion of his current second and last tenure.\nMasari stated this while fielding questions at a News Agency of Nigeria (NAN) Forum in Katsina, on Sunday.\nHe recalled that he contested for the House of Representatives and won, pointing out that he even emerged as the Speaker of the House of Representatives, while at the National Assembly.\n” I was at one time, the Vice Chairman of my party, the All Progressives Change (APC) in the North-West geo-political zone.\n“I have paid my dues, it is better for me to stay at home and rest, after my tenure,”"
  },
  {
    "headline": "TB Joshua: Chris Okotie Needs A Dirty Slap To Correct His Senses – Odumeje (Video)",
    "summarized_story": "Prophet Odumeje, the founder of Onitsha’s Mountain of Holy Ghost Intervention Ministry, has slammed Reverend Chris Okotie for claiming that Late Prophet TB Joshua was a wizard, magician, and false prophet.\nOn June 6, 2021, TB Joshua, the founder of the Synagogue Church of All Nations (SCOAN), died.\nIn a video shared online, Chris Okotie, the senior pastor of the Household of God Church International Ministries, described TB Joshua as a deceptive magician who carried the Bible around.\nOkotie also alleged that Joshua fulfilled a biblical pattern of “Bar-Jesus”, a false prophet who equated himself with Jesus.\nHe also alleged that the late pastor deceptively targeted people in the society with philanthropy to model himself after biblical patterns and induce support."
  },
  {
    "headline": "Nigeria Going Back To 1980 – Sanusi",
    "summarized_story": "Muhammad Sanusi, a former Governor of the Central Bank of Nigeria (CBN), has claimed that the country’s 35 years of growth have been erased.\nSanusi said this during a colloquium to commemorate his 60th birthday on Saturday.\nThe former Emir of Kano claimed he had paid the price for speaking out about socio-economic and security issues.\nSanusi also claimed if things don’t change soon, Nigeria will get to a point where the average citizen’s income will be similar to that of 1980.\nAt this rate, in the next two years, in terms of purchasing power parity, the average income of a Nigerian would have gone back to what it was in 1980 under Shehu Shagari."
  },
  {
    "headline": "Pay Striking Doctors N4.8bn Allocated For WhatsApp Monitoring – SERAP Tells President Buhari",
    "summarized_story": "President Muhammadu Buhari has been requested by the Socio-Economic Rights and Accountability Project (SERAP) to allocate the projected N4.87 billion for WhatsApp monitoring to striking resident doctors.\nIn July, the President signed the 2021 supplementary appropriation bill of N983billion into law.\nA little over N4.87billion was allocated to the National Intelligence Agency (NIA) to monitor WhatsApp messages, phone calls, and text messages of Nigerians.\nSERAP told the President to send to the National Assembly a fresh supplementary appropriation bill, which reflects the redirected budget, for approval.\nSERAP demanded its request be granted within seven days and that failure to comply will lead to legal actions against the Buhari administration."
  },
  {
    "headline": "Son Of Buhari’s Admin Officer, Abubakar Maikano Kidnapped By Bandits",
    "summarized_story": "The son of Alhaji Abubakar Maikano, President Muhammadu Buhari’s top adviser and Administrative Officer, has been kidnapped by bandits.\nThe news comes nearly four months after unknown guys broke into Maikano’s official house inside the Presidential Villa.\nAccording to reports, Sanusi Maikano was kidnapped on Saturday around 8:30 pm barely a few minutes after he returned from his farmhouse.\nThe armed bandits, numbering about eight, trailed Sanusi from his farmhouse to his residence, a security official said.\nThey quickly released the boy and took away Sanusi,” the security source who spoke on condition of anonymity, said."
  },
  {
    "headline": "Breaking: Lalong imposes curfew on Jos as travellers suffer attack",
    "summarized_story": "Governor Simon Lalong, has imposed 6pm to 6am curfew on Bassa, Jos North and Jos South Local Government Areas (LGAs) of Plateau state.\nLalong in a statement he personally issued, Saturday night, said the decision was reached after he was briefed by heads of security agencies.\n“The reports indicate that 23 of those attacked lost their lives while 23 persons sustained injuries and are currently receiving treatment.\n“The curfew shall remain in place subject to further review by the State Security Council,” Lalong said.\nLalong said asked the people to continue to be vigilant and be security conscious and do everything possible to sustain peace and security of the state."
  },
  {
    "headline": "Breaking: In Gwoza, Zulum receives another Chibok schoolgirl with kids (Pictures)",
    "summarized_story": "Borno state Governor, Babagana Umara Zulum, on Saturday in Gwoza, received another Chibok girl who was rescued by the 26 Task Force Brigade, Gwoza.\nAccording to the official Facebook handler of the governor: “The schoolgirl, Hassana Adamu, alongside her two children, was handed over to Governor Zulum by the Commander, 26 Taskforce Brigade, Brigadier General DR Dantani.\n“Zulum was in Gwoza from there he moved to Bama, undertaking humanitarian activities.\nHe has just returned from northern Borno where he spent five days for humanitarian interventions.”Hassana was one of over 200 schoolgirls abducted at a government secondary school in Chibok on April 14, 2014, by Boko Haram insurgents.\nRuth Ngladar Pogu and a man said to be her husband had presented themselves to the Nigerian Army on July 28, 2021, at a location in Bama."
  },
  {
    "headline": "Breaking: 25 killed, many injured as unknown gunmen attack travellers in Jos",
    "summarized_story": "At least 25 travellers, out of 90 from Ondo and Ekiti states, were allegedly intercepted by Irigwe youths, along Rukuba road, off Gada-biyu, in Jos North Local Government Arae (LGA) of Plateau State.\nIbrahim said their five 18-seater buses were coming back from Bauchi state after attending an event to celebrate the Islamic new year in Bauchi, at Sheikh Dahiru Usman Bauchi, Mosque.\nThe Plateau state police Spokesman ASP, Ubah Ogaba, has confirmed the incident.\n“They were intercepted along Rukuba road, off Gada-biyu, in Jos, while on their way back to their respective states.\nThe governor however commended security agencies for their immediate response leading to the arrest of some suspects and the restoration of calm to the area."
  },
  {
    "headline": "Crown University Int’l Chartered partners KASU to boost education -NigPilot",
    "summarized_story": "Chartered Inc. Santa Cruz, Argentina with Partners constituent campuses and associates worldwide and Kaduna State University, Kaduna, Kaduna State , is meant to empower both institutions for better education.\nVice-Chancellor, Crown University Intl.\n“There shall be reciprocal/dual certifications and top-up degree arrangements between Kaduna State University on undergraduate and graduate programs on a credit transfer-based criterion established by Kaduna State University, Kaduna, Kaduna State, Nigeria.\n“Crown University Intl Chartered Inc. shall pay any tuition charged by Kaduna State University, Kaduna, Kaduna State, Nigeria per student for all applicable Degrees.\nTransfer students must submit their Transcripts from former Institutions to Kaduna State University, Kaduna, Kaduna State, Nigeria,” added Aremu."
  },
  {
    "headline": "Unlawful Detention: Army GOC Dares Court, Refuses to released Gov. Ugwuanyi’s Aide",
    "summarized_story": "Seven days after a Federal High Court ordered the Nigerian Army to release unconditionally a Nigerian citizen, the Senior Special Assistant (SSA) on Security matters to the Enugu State Governor, Tochukwu Cornelius Okeke, the Nigerian Army has refused to obey the orders.\nOkeke is alleged to be kept in detention under the instructions of the General officer commanding ( GOC) 82 Mechanised Division Enugu, Major General.\nTaoreek Lagbaja, as the Nigerian Army had earlier failed to produce him in court before the court ordered his release.\nThe respondents were equally ordered to appear and show cause why the applicant should not be granted bail or be released unconditionally from custody.\nJustice Mohammed has however directed the applicant to serve all the processes relating to the case on the respondents."
  },
  {
    "headline": "American university confers honors on Nigerian Prof, Aremu -NigPilot",
    "summarized_story": "The Noble International University has conferred an honorary Professor Emeritus on UNESCO Laureate Prof Sir Bashiru Aremu, with an award of “Most Academy Excellent World Acclaimed Distinguished Professor Emeritus” on merit.\nHe was also ranked as a Top-up Certificate with a world-acclaimed certificate of recognition for achievements.\nReacting to the award presentation, Aremu, thanked the institution’s authorities for finding him worthy of being honored.\n“I feel highly honored to be decorated with such an award of that magnitude by an institution of learning in the mode of Noble International University,” Aremu stated.\nNoble International University has agreements for joint education and exchange with international universities, and also trains them to become the best environmental and social citizens."
  },
  {
    "headline": "Allegation of Col Sakaba’s assassination is baseless, unfounded -NigPilot",
    "summarized_story": "The Nigerian Army said that the uncomplimentary comments credited to Mrs. Oluwaseun Sakaba, the widow of late Col Ibrahim Sakaba that whose late husband was assassinated to cover up corruption are unfounded and baseless claims devoid of any fact.\nMrs. Oluwaseun Sakaba, alleged that the late senior officer was assassinated for refusing to loot funds meant for fighting the Boko Haram Insurgency.\nThe late senior officer’s widow was quoted to have made several uncomplimentary comments about the institution of the Nigerian Army (NA), making reference to unfounded and baseless claims devoid of any fact.\nCol Sakaba was a respected senior officer who gave his all in the defense of the freedom we all enjoy today.\n“All entitlements meant to be paid by the NA have been paid to the NOK through Mrs. Oluwaseun Sakaba."
  },
  {
    "headline": "Plateau Attack: Gov Lalong Imposes Curfew On Three LGAs",
    "summarized_story": "Plateau State Governor Simon Lalong has imposed a curfew on Jos North, Bassa and Jos South Local Government Areas following Saturday’s attack on Rukuba Road in Jos North Local Government Area of the state.\nTwenty-three people – who were travelling from Bauchi en-route Jos to Ikare in Ondo State – were killed in the incident.\nThe governor, in a statement he signed on Saturday, said the curfew became necessary to avoid an escalation of tension in the affected areas.\nHe explained that the curfew shall remain in place subject to further review by the State Security Council.\nGovernor Rotimi Akeredolu on his part appealed to residents of the state not to take laws into their hands following the attack on indigenes of the state."
  },
  {
    "headline": "Presidency Condemns ‘Brazen’ Attack On Travellers In Plateau",
    "summarized_story": "The Presidency has condemned an attack on travellers along Rukuba road in Jos North Local Government Area of Plateau state on Saturday morning.\nIn a statement signed by presidential spokesperson Garba Shehu, the Presidency described the attack as “brazen and wickedly”.\nSome 25 persons were confirmed killed and 14 injured in the attack, Channels Television reported earlier.\nREAD ALSO: 25 Killed In Plateau AttackThe victims were attacked while travelling from Bauchi en-route Jos to Ikare in Ondo state.\nMeanwhile, President Muhammadu Buhari has ordered security agencies to fish out the perpetrators."
  },
  {
    "headline": "Nigerian Army Hands Over Another Chibok Schoolgirl To Zulum",
    "summarized_story": "Borno State Governor, Babagana Zulum, on Saturday in Gwoza, received another Chibok schoolgirl who presented herself to the Nigerian Army.\nThe schoolgirl, Hassana Adamu, alongside her two children, was handed over to Governor Zulum by the Commander, 26 Taskforce Brigade, Brigadier General DR Dantani.\nShe is the second Chibok schoolgirl to be received by the Borno State Government within two weeks.\nAnother Chibok schoolgirl, Ruth Ngladar Pogu and a man said to be her husband, had presented themselves to the Nigerian Army on July 28 at a location in Bama.\n“As a father of all sons and daughters of Borno, I haven’t lost hope that our remaining Chibok schoolgirls and other abducted persons will be safely recovered,” the Governor said."
  },
  {
    "headline": "25 Killed In Plateau Attack",
    "summarized_story": "Twenty-Five persons were confirmed killed and 23 injured along Rukuba Road in Jos North Local Government Area of Plateau state on Saturday morning.\nThe victims were attacked while travelling from Bauchi en-route Jos to Ikare in Ondo state.\nPlateau State Governor Simon Lalong has reacted to the incident in a statement signed by spokesperson Simon Makut.\nThe statement added that the Governor has also directed security agencies to swiftly identify and arrest perpetrators.\nThe spokesperson of Operation Safe Haven, a military task force set up to maintain peace in Plateau State, Major Ishaku Takwa, said 12 persons have been arrested in connection with the incident, while normalcy has been restored in the area."
  },
  {
    "headline": "Nine Killed As Bandits Attack Sokoto Villages",
    "summarized_story": "Bandits have killed nine persons in an attack on Bejingo, Dantudu, and Tulutu villages in Birjin ward, Goronyo Local Government Area of Sokoto State.\nAn anonymous source in the local government told Channels Television that the assailants attacked the villages on Saturday, raiding houses.\nSokoto, a state in Nigeria’s north-western region, has had its fair share of banditry and kidnapping for ransom.\nLate last month, bandits killed two people and abducted over 60 travellers along the Sokoto-Gusau highway.\nIn May, gunmen also killed 12 people in Illella Amarawa, Illela Local Government Area of the state."
  },
  {
    "headline": "NDLEA: Germany to set up dog training facility for detection of narcotics",
    "summarized_story": "The German government aims to construct a “world-class drug detection dog training facility” for the National Drug Law Enforcement Agency (NDLEA), this is according to Buba Marwa, chairman of the NDLEA.\nThe NDLEA chairman disclosed this when Jan Ritterhoff, liaison officer at the German embassy in Nigeria, paid him a visit, stating that the “€2 million” training center will help the NDLEA’s operations.\nMarwa said drug trafficking is a complicated and dynamic crime that requires the agency to stay one step ahead of drug gangs.\nMarwa said that with the assistance of the narcotic detection dogs, a total of over 26 major arrests and seizures of narcotic narcotics including Cocaine, Heroin, Methamphetamine, Ephedrine, and Cannabis with a combined weight of over 17.932 metric tons were made”.\nAdvertisementIn his reaction, Ritterhoff praised Marwa for reforming the agency and thanked the NDLEA president for approving the proposal so quickly."
  },
  {
    "headline": "Governor Ugwuanyi empowers Udi/ Ezeagu youths, women at UEPA ward executives inauguration",
    "summarized_story": "Enugu State Governor Ifeanyi Ugwuanyi has stated that women must be empowered in order for them to feel a sense of belonging as important contributors to the growth of society.\nGovernor Ugwuanyi praised the Udi/Ezeagu Progressive Alliance (UEPA) for galvanizing youths in Udi and Ezeagu local government areas and empowering them for socio-economic and political emancipation during the ward executives inauguration/empowerment programme organized by the group, led by Ozo Onyebuchi Ani, in support of his peaceful administration in Enugu State.\nUgwuanyi in attendance, saw the empowerment of 20 members of the organization with N50,000 each.\nGovernor Ugwuanyi praised the gesture and emphasized the importance of the group including women from Udi and Ezeagu LGAs in the empowerment initiative so that they can benefit appropriately.\nDr. Uzor praised the leadership and members of UEPA for electing him as their patron and urged them to continue to support Gov."
  },
  {
    "headline": "Nine killed as bandits attack Goronyo LG, Sokoto",
    "summarized_story": "Bandits have killed nine persons in Bejingo, Dantudu and Tulutu, all in Birjin ward of Goronyo local government area, Sokoto state.\nSources in the local government said the bandits attacked the villages and raided houses, killing nine persons in the process and injuring several others.\nThe bandits also rustled an unknown number of animals, including sheep, goats, and calves, according to sources.\nAccording to reports from the area, the bandits killed eight men and one woman in three villages.\nAdvertisementThe state police have yet to confirm the attack, citing a command spokesman who stated that they have yet to be briefed on the incident."
  },
  {
    "headline": "Taliban Fighters Enter Kabul from ‘All Sides’ But Have No Plans to Take City ‘By Force’",
    "summarized_story": "The Taliban has entered the Afghan capital Kabul from all sides, the Afghan interior ministry said on Sunday.\nThe Taliban said it has no plans to take the Afghan capital “by force”.\nThe armed group issued the statement as its fighters moved to the outskirts of Kabul.\n“The Islamic Emirate instructs all its forces to stand at the gates of Kabul, not to try to enter the city,” a spokesman for the Taliban tweeted, although some residents reported fighters peacefully entered some outer suburbs.\nThe speed of the Taliban offensive has shocked many and raised questions about why Afghan forces crumbled despite years of US training and billions of dollars spent."
  },
  {
    "headline": "Taliban Control All Key Afghan Cities Except Kabul",
    "summarized_story": "The Taliban have moved closer to retaking full control of Afghanistan, with the capital Kabul now the only major city left in government hands.\nOn Sunday the militants took control of Jalalabad, a key eastern city, without a fight.\nReports on Sunday morning said the Taliban overran the city, the capital of Nangarhar province, without a shot being fired.\n“Allowing passage to the Taliban was the only way to save civilian lives.”Journalist Tariq Ghazniwal tweeted images purportedly showing the provincial governor handing over control to the Taliban.\n“God forbid we will see war in Kabul,” city resident Sayed Akbar, 53, told the New York Times."
  },
  {
    "headline": "Ivory Coast Records First Case of Ebola in 25 years",
    "summarized_story": "Ivory Coast has recorded its first case of the Ebola hemorrhagic virus in 25 years, according to the country’s health minister.\nIn a separate statement, the World Health Organization (WHO) said the case was Ivory Coast’s first Ebola infection since 1994.\nGuinea – site of the 2014-2016 Ebola outbreak, the deadliest on record – experienced a four-month Ebola outbreak earlier this year that was declared over on June 19.\nThe WHO said there was no indication the current case in Ivory Coast is linked to the outbreak in Guinea earlier this year.\nThe WHO said it was helping to coordinate a cross-border response, which included transferring 5,000 doses of the Ebola vaccine from Guinea to Ivory Coast."
  },
  {
    "headline": "Over 300 Dead After Haiti Struck by Deadly 7.2-Magnitude Earthquake",
    "summarized_story": "A powerful earthquake has struck the Caribbean nation of Haiti, killing at least 304 people and injuring more than 1,800.\nHaiti is still recovering from a devastating 2010 earthquake.\nArchdeacon Abiade Lozama, head of an Episcopal church in Les Cayes, told the New York Times: “The streets are filled with screaming.\nWe lived [through] the 2010 earthquake and all I could do was run.\nThe 2010 earthquake in Haiti killed more than 200,000 people and caused extensive damage to infrastructure and the economy."
  },
  {
    "headline": "President Lungu Claims Zambia Election Was Not Free and Fair",
    "summarized_story": "Early results show President Edgar Lungu trailing his main opponent, businessman Hakainde “HH” Hichilema.\nThe president said election officials from his party Patriotic Front had been chased from polling stations, leaving votes unprotected.\nViolence had broken out in Southern province, North Western province and Western Province, the president’s statement said.\nMr Lungu referenced the killing of a Patriotic Front chairman in North Western province and of another young party activist in clashes earlier this month.\nHowever, the announcement was halted after some party election officials criticised the commission for trying to declare results that hadn’t yet been verified."
  }
]