[
  {
    "headline": "WHO puts Nigeria’s external health aid at $1.1bn",
    "summarized_story": "The World Health Organisation has said Nigeria and four other countries rely heavily on external aids in matters concerning health expenditures globally.\nThis is as the global health body added that over half of Nigeria’s spending on immunisation were funded by external donors.\nThe WHO, in its 2021 report on global expenditure on health which covered the past two decades, said global spending on health doubled in real terms.\n“Nigeria was the largest recipient, with health aid totalling $1.1bn, or 6.5% of global external health aid.\n“Unsurprisingly, low-income countries relied more heavily on external aid to fund spending on immunisation."
  },
  {
    "headline": "Firm sensitises drivers to alcohol misuse",
    "summarized_story": "Pernod Ricard Nigeria has embarked on campaign tagged ‘Safe Roads’ aimed at sensitising commercial drivers to drinking and driving.\nAccording to a statement on Wednesday by Damilola Olujide, the campaign is part of the organisation’s sustainability and responsibility roadmap under its responsible hosting pillar, which aims at fighting alcohol misuse in the society.\nThe campaign, which is targeted at commercial drivers, was introduced on December 2, 2012, with a sensitisation seminar at the Ojota New Garage bus park in Lagos.\nThe statement read, “The campaign launch saw representatives of Pernod Ricard Nigeria sensitise commercial drivers on the dangers of drinking and driving, especially as more people commute intra/interstate for the festive season.\n“The drivers were also educated on the factors that affect how alcohol is processed in the body, the amount of alcohol in popular drinks, and the time it takes for the body to process a unit of alcohol."
  },
  {
    "headline": "Diezani: EFCC uncovers additional $72.87m in Bank",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), said it has has uncovered additional $72.87 million linked to former petroleum minister Diezani Allison-Madueke.\nUwujaren who said that the money was lodged in the coffers of the bank, added that Okonkwo’s arrest was part of ongoing investigations on the former minister.\nAccording to him, Okonkwo, who is currently the Chairman of First Bank Holding, alongside others, had earlier been grilled over $153 million and $115 million by the commission.\n“While all the $153 million were recovered by the EFCC, the cases involving $115 million, as it relates with the Independent National Electoral Commission (INEC) bribery matter, are in various courts.\n“Okonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabout of the new $72.87 million, ” he added."
  },
  {
    "headline": "CP orders full-scale investigation over the killing of Kaduna lawmaker",
    "summarized_story": "The Commissioner of Police (CP), Kaduna State Command ,Mr Mudassiru Abdullahi has ordered full scale investigation over the killing of a lawmaker in Kaduna.\n“The body was thereafter evacuated to to Hajiya Gambo Sawaba Hospital for autopsy.\nHe said, preliminary investigation reveals the Identity of the deceased as one Hon.\nRilwanu Aminu Gadaga, a member of Kaduna State House of Assembly representing Giwa west constituency.\n“The CP is equally, using this moment to condole with the immediate family of the deceased, the government and people of Kaduna State over this irreparable loss.”Jalige said."
  },
  {
    "headline": "ASUU slams Labour Minister, Ngige over claims of N52.1b given to union",
    "summarized_story": "Dr. Chris Ngige, the Minister of Labour and EmploymentBy Bashir BelloThe Academic Staff Union of Universities, ASUU has slammed the Minister of Labour and Employment, Chris Ngige over claims that the Federal Government had released N52.12 billion to the union, describing the claims as not only misleading but also deceptive.\nThe Kano Zonal Coordinator of the union, Comrade Abdulkadir Muhammad who stated this while addressing a press briefing on Wednesday described the claims as that aimed at smearing the image of the union.\n“This is deceptive, misleading and aimed at smearing the image of our Union and members in the public eye.\nThe Zonal Coordinator also frown at the growing insecurity in the country noting that the nation is suffering and paying back on the issue of security because government didn’t accord education top priority.\n“It also frowns at the government’s unjustifiable attempt to increase tax and remove fuel subsidy which will make life more unbearable to Nigerians,” the Zonal Coordinator, Muhammad however stated."
  },
  {
    "headline": "Police arrest 305 suspected bandits, kidnappers, rescue 168 victims in Kaduna",
    "summarized_story": "The Police Command in Kaduna State, says it’s operative have arrested 305 suspects for banditry, armed robbery and kidnapping between January and November 2021.\nA statement by the command said 242 of those arrested are being prosecuted by various courts within the state.\nThe statement was issued by the Command Public Relations Officer, ASP Mohammed Jalige, on Wednesday in Kaduna.\nJalige said command has been unrelenting in its determination to rid the state of banditry, armed robbery, kidnapping and other crimes.\nHe urged residents of the state to promptly report any suspicious activity within their locality to the nearest police station."
  },
  {
    "headline": "Delta environment favourable for investment – Okowa",
    "summarized_story": "Delta Governor, Senator Dr. Ifeanyi Okowa (3rd left); his Deputy, Barr.\nOkowa made this known at the inauguration of Sleek 101.9 FM Radio Station at Boji-Boji Owa, Ika North East Local Government Area of the state.\n“Having a radio station in our land is obviously a plus to us as a people and God who enabled you to establish the radio station will empower you to establish the television station.\nEarlier, Melekwe had commended the governor for providing the enabling environment for businesses to thrive in the state.\nHe said that Sleek 101.9 FM was the first radio station in Ika area and the only radio house outside Asaba in Delta North."
  },
  {
    "headline": "Invaders of Justice Mary Odili’s house get N5m bail each",
    "summarized_story": "Each of the 12 defendant was considered for bail in the sum of N5M each with two sureties each in the like sum.\nOne of the two sureties must be a responsible citizen and have a property in Abuja worth not below N5M .\nIn separate rulings on the ball for the defendants filed by their respective lawyers, Justice Maha held that the defendants placed sufficient materials before the court to warrant their being admitted to bail.\nPending the perfection of thei bail conditions, Justice Maha ordered that they be remanded at Kuje Correctional Centre (prison) in Abuja.\nJustice Maha fixed January 17th."
  },
  {
    "headline": "Why National Assembly may not pass 2022 budget as promised",
    "summarized_story": "But the Senate failed to pass the budget yesterday, Tuesday, December 14 as promised.\nWhen asked if the Senate would still pass the 2022 budget this week as promised, Senator Barau Jibrin, Chairman of Senate Committee on Appropriation, said only the Senate President could give official statement on that.\nI don’t have the authority, the Senate President will be the one to tell you that”, Senator Jibrin said, Wednesday afternoon.\nMeanwhile, the Senate today interfaced with the Independent National Electoral Commission (INEC) and the National Population Commission (NPC), over complaints of insufficient budget estimates.\n“We had interaction with INEC and National Population Commission in respect of complaints we had from different quarters about insufficient funds that have been provided for them in the 2022 appropriation bill."
  },
  {
    "headline": "Traditional doctor raises alarm over threat to life, fingers prominent Akwa Ibom politician",
    "summarized_story": "A traditional doctor in Akwa Ibom State, Okuku Utom Ekpat, has raised the alarm over what he described as a “persistent” threat to his life in the state.\nGiving a background of the matter, the lawyer said “My client is a responsible citizen living in Ikot Abia-Idem village in Ikot Ekpene.\nHe is not from there but he resides there, and that is where he is doing his trade ( Traditional Doctor).\nHe asked the traditional doctor to go and answer his case with the police rather than going about telling people that he is chasing after him.\nAccording to him, “I don’t have a land issue with any traditional doctor."
  },
  {
    "headline": "192 people die from COVID-19 in Oyo",
    "summarized_story": "Oyo State Government on Wednesday said that no fewer than 192 people have died as a result of Coronavirus also known as COVID-19 in the state.\nOlaoye, while speaking, explained that the state recorded 8 new cases of COVID-19 on Tuesday.\nOlaoye, while speaking on the prevalence, fatality and incidence rates of COVID-19, insisted that the state has recorded 8,794 confirmed cases of COVID-19, while 8,577 have recovered.\n“We have 8,794 confirmed cases of COVID-19, we have 25 active cases and 8,577 have recovered.\n“As part of the work to support COVID hesitancy in Oyo State, the Breakthrough Action-Nigeria, Risk Communication and Community Engagement (RCCE) team and the Oyo State Government is holding this Media Orientation meeting with media partners across Radio, Print, TV and bloggers."
  },
  {
    "headline": "Senate approves N633.39bn for NCC, N8.8bn for USPF in 2022 budget",
    "summarized_story": "The Senate has approved the budget of N633,393,283,000 for the Nigerian Communications Commission, NCC for the 2022 fiscal year.\nSimilarly, the upper legislative chamber approved N8,824,847,408 as 2022 budget for the Universal Service Provision Fund, USPF.\nThe chairman added that others include: sundry income – N5 million, federal government intervention for broadband infrastructure – N41.6 billion and transfer from reserve – N1 billion.\nIn a related development, the Senate also approved the sum of N8,824,847,408 as 2022 budget for the Universal Service Provision Fund.\nSenator Tinubu, in a second presentation, said out of the sum approved, N1,923,760,092 was for recurrent expenditure; N357,959,020 for capital expenditure; and N6,543,128,296 for projects and programmes."
  },
  {
    "headline": "How Tinubu and I came to trust each other, by Akande",
    "summarized_story": "How Tinubu and I came to trust each other, by AkandeA former All Progressives Congress (APC) National Chairman Chief Bisi Akande has explained the reasons behind his smooth relationship with ex-Lagos State Governor Asiwaju Bola Tinubu.\nAkande, in his book, ‘My Participation’, said he and Tinubu used to argue over political discretions.\nHe added that Tinubu trivially assumed that the political culture of Lagos could work in the rest of the Southwest.\nThe ex-Osun governor said Tinubu always “absorbed my angry political tantrums as old-fashioned and with jocular snubs”.\nAnd we came, at last, to trust each other absolutely,” he wrote."
  },
  {
    "headline": "‘I was bowled over by Awolowo’s sense of humour’",
    "summarized_story": "He said he was bowled by Awolowo’s sense of humour, and mesmerised by his fatherly gesticulations in explaining difficult issues.\n“They went to Chief Awolowo with Chief Fasanmi as guide and mentor.\n“I was bowled by his sense of humour and truly mesmerised by his fatherly gesticulations in explaining difficult issues.\n“We, in the union, agreed in principle, to prefer Awolowo’s politics to any other.\n“Shortly after our visit to him, Chief Awolowo, accompanied by Chief Fasanmi, Chief Michael Omisade and Chief S.M."
  },
  {
    "headline": "‘My wife’s death left me emotionally empty’",
    "summarized_story": "Former All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the death of his wife, Mowumi, left him emotionally empty.\nIn his book, ‘My Participations’, he said despite the care from his children and friends, he has not been able to get over his wife’s death.\n“Sometimes I move round my room in lonely soliloquy with the imaginary sentiment that my wife would suddenly answer me.\nHe added that the way his children celebrate their mother makes death inviting to him.\n“And I have been praying to die such a painless death and for my funeral to be as glorious as that of my wife,” he wrote."
  },
  {
    "headline": "‘Friends used my home for romantic escapades’",
    "summarized_story": "As a young man, friends used the home of former All Progressives Congress (APC) National Chairman Chief Bisi Akande for romantic escapades.\nHe said though he was earning a good salary at the British Petroleum Marketing Company in Lagos, he was always broke because he roamed about, drank with friends and spent beyond his means.\nIt took his marriage to Mowumi on December 26, 1966 for his life to change.\nHe met Mowumi in Ila-Orangun on a day a policeman was threatening to pounce on her.\n- Advertisement -“It appeared to me however that marriage made me so responsible that friends who used to use my apartment for their romantic escapades stopped and began to treat our home with respect."
  },
  {
    "headline": "'Soyinka told me to prepare for war on my autobiography'",
    "summarized_story": "Nobel Laureate Prof. Wole Soyinka foretold the controversies being generated by ‘My Participation’, the autobiography of ex-Osun State Governor Chief Bisi Akande.\nHe also said President Muhammadu Buhari reneged on his promise to make Tinubu his running mate in 2015.\nThey told us they needed to hold a meeting and take a decision.\n“Nyako of Adamawa told us at a stage that he would leave them behind and join us on his own.\n“When we got to Kano House, the New-PDP leaders had prepared a document listing conditions under which they would accept to join us."
  },
  {
    "headline": "Don’t set Nigeria on fire, FG warns Obasanjo, critics",
    "summarized_story": "On Monday, Obasanjo, at a retreat on inclusive security in Abuja, organised by the Global Peace Foundation and Vision Africa, said: “President Buhari has done his best.\nMohammed, said: “The polity has recently been awash with heightened commentary on the security situation in the country.\n“President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nPresident Buhari continues to do much more to keep Nigerians safe.\nPresident Buhari is leaving a legacy of security, infrastructural development, economic prosperity and social cohesion for Nigeria."
  },
  {
    "headline": "Tension as bandits kill Kaduna lawmaker",
    "summarized_story": "From Sola Ojo, KadunaThere was palpable tension among the residents of Kaduna and motorists plying Kaduna-Zaria Highway over Monday night’s deadly attack that left four people, including the lawmaker representing Giwa West and Chairman House Committee on Local Government in the Kaduna State House of Assembly, Rilwanu Aminu Gadagau, dead.\nKaduna-Abuja highway, Kaduna-Birni Gwari road, Kaduna-Zaria road and Kaduna-Kachia road have all had their fair shares of the nefarious activities of bandits, who have been responsible for the killing, maiming, raping and kidnapping of scores of residents and travellers.\nUnlike Kaduna-Abuja road, where there is rail transport alternative, motorists plying other roads that connect Kaduna town are on their own.\nHonourable Gadagau was a young and dynamic lawmaker, who had a passion for his constituency, state and Nigeria.\nHe said: “I’m deeply shocked at the gruesome murder of a young and dynamic member of the Kaduna State House of Assembly, Rilwanu Gadagau, by terrorists on the Kaduna-Zaria expressway."
  },
  {
    "headline": "FEC approves 20% salary increase for Nigeria Police – The Sun Nigeria",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMinister of Police Affairs, Maigari Dingyadi, disclosed this at the end of the week’s virtual FEC meeting, presided over by President Muhammadu Buhari in Abuja.\nThe minister said N13.128 billion was approved for outstanding death benefits for 5,472 police personnel.\nFEC also has approved a bill known as Nigeria Start-Up Bill, for onward transmission to the National Assembly for passage into law.\nHe said: “The first one is on the Nigeria Startup Bill, which is exciting news to our innovators all over the country, particularly those who are working within the tech industry."
  },
  {
    "headline": "Ghana’s strict COVID-19 testing not meant to harass Nigerians – Envoy – The Sun Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGhana’s High Commissioner to Nigeria, Ambassador Rashid Bawa, has assured that the required Coronavirus (COVID-19) testing procedures for travellers to the West African country were not meant to harass and embarrass Nigerians.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHis visit followed the alleged maltreatment of a Nigerian who tested negative to COVID-19 in Dubai only to test positive on arrival in Ghana.\nThe envoy pointed out that while the COVID-19 Polymerase Chain Reaction (PCR) test was mandatory, Ghana would not maliciously produce COVID-19 positive test results for visitors, especially Nigerian visitors.\nDabiri-Erewa, in her response, agreed with the Ghanaian envoy that although the COVID-19 test was a necessary requirement for visitors to Ghana, Ghanaian authorities “must ensure that visitors are treated with dignity, fairly, and humanely.”Latest Jobs in Nigeria (Graduates/Non-graduates)."
  },
  {
    "headline": "Police arrest 26 as Hisbah, youths clash in Kano",
    "summarized_story": "From Desmond Mgboh, KanoNo fewer than 26 suspects have been arrested by the police following a violent confrontation between youths and officials of Kano State Islamic Police, otherwise known as Hisbah guards.\nDaily Sun gathered that some people were injured and rushed to the hospital, while residents simply fled the streets during the clash last night.\nEyewitness told Daily Sun that the angry youth barricaded the streets, especially around Ballat Hughes Street, and made bonfires, adding that a vehicle belonging to the Hisbah guards was vandalised.\nHe added that they arrested 26 miscreants, while adding that the case has been transferred to their headquarters for discreet investigation.\nHe further appealed to the people to be law abiding and support security agencies in maintaining the prevailing peace in the state."
  },
  {
    "headline": "EFCC Uncovers Additional $72.8m Linked to Alison-Madueke, Arrests Ex-Bank MD",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Economic and Financial Crimes Commission (EFCC), has arrested a former Managing Director of Fidelity Bank Plc, Nnamdi Okonkwo, allegedly over an additional $72, 870,000 million found in the coffers of the bank which was uncovered in its ongoing investigations of the former Minister of Petroleum Resources, Diezani Alison-Madueke.\nAn official of the commission told THISDAY that Okonkwo, who is now the Chairman of First Bank Holdings, and others, were earlier grilled over a sum of $153million and $115million by the commission.\nThe EFCC official said while all the $153 million were recovered by the EFCC, the cases involving $115million, as it relates to the Independent National Electoral Commission bribery matter were in various courts.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8m, the official added.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Inflation Drops to 15.40%",
    "summarized_story": "James Emejo in AbujaThe Consumer Price Index, (CPI) which measures inflation dropped to 15.40 per cent (year-on-year) in November compared to 15.99 per cent in the preceding month, the National Bureau of Statistics (NBS) stated Wednesday.\nThis is 0.51 percentage points higher than the 14.89 per cent recorded in November 2020.\nFood inflation moderated to 17.21 per cent in compared to 18.30 per cent in November 2020.\nThis was up by 0.46 per cent when compared with 0.80 percent recorded in October 2021.\nThe average 12-month annual rate of change of the index was 12.96 per cent for the twelve-month period ending November 2021."
  },
  {
    "headline": "FEC Approves Pay Rise for Police",
    "summarized_story": "Deji Elumoye in AbujaThe Federal Executive Council (FEC), has approved a ‘peculiar allowance’ for the Nigeria Police increasing an average policeman’s take-home pay by 20 per cent.\nMinister of Police Affairs, Alhaji Maigari Dingyadi, who disclosed this to newsmen Wednesday at the State House, Abuja after the week’s virtual FEC meeting, presided over by President Muhammadu Buhari, said Council also approved the review of police duty tour allowance to six percent, as well as the release of N1.2 billion for the payment of uninsured benefits.\nThe Minister added that FEC further gave approval for the release of N1.2bn for the payment of outstanding allowances.\nAccording to him, the approvals were in line with President Buhari’s promise to enhance police personnel pay as demanded by #EndSARS protesters in October, 2020.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Bandits Kill Kaduna Lawmaker",
    "summarized_story": "By John Shiklam in KadunaA member of the Kaduna State House of Assembly, Rilwanu Gadagau, and one other person have been killed by bandits along the Kaduna-Zaria highway.\nThe Clerk of the Kaduna State House of Assembly, Bello Zubairu, confirmed the incident to journalists on Wednesday in Kaduna.\nSpokesman of the Kaduna state police command, Mohammad Jalige, did not respond to telephone calls when contacted.\nHonourable Gadagau was a young and dynamic lawmaker, who had a passion for his constituency, state, and Nigeria.\nThe speaker expressed condolences with the families of the lawmaker and others who were killed during the attack."
  },
  {
    "headline": "15 Suspects Arrive Court for Arraignment over Invasion of Justice Odili’s House",
    "summarized_story": "Alex Enumah in AbujaThe Nigerian Police on Wednesday brought 15 persons suspected to have participated in the invasion of the Abuja residence of the Supreme Court Justice, Mary Odili.\nThe 15 were part of 22 arrested and paraded on November 11 by the Police at its headquarters in Abuja.\nThey were brought into the court around 1.45pm by the personnel of the Federal Investigation Bureau, Special Tactical Squard (STS) and the police.\nHowever, following public outcry, the police had swung into action and arrested 22 persons out of which 15 have been brought to court for arraignment.\nAmong the 15 is a female, although her identity cannot be ascertained as at the time of this report."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Uncovers Fresh $72.8Million Linked To Ex-Minister, Diezani In Fidelity Bank, Detains First Bank Holdings MD, Okonkwo",
    "summarized_story": "Okonkwo was arrested over an additional $72,870,000 still in the coffers of the bank, which is allegedly part of the proceeds of corruption linked to Diezani.\nInformation obtained by SaharaReporters from EFCC on Wednesday revealed that Okonkwo and one Charles Onyedibe are currently being detained by the anti-graft agency.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8 million, SaharaReporters also learnt on Wednesday from the commission.\nThe Appeal Court held that there was no substance in Diezani's bid to overturn a lower court's order.\nThe appellate court gave its judgment in an appeal filed by Diezani marked as Appeal - No CA/L/1263/19 between Diezani Alison-Madueke and the EFCC."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Uncovers Fresh $72.8Million Linked To Ex-Minister, Diezani In Fidelity Bank, Detains First Bank Holdings MD, Okonkwo",
    "summarized_story": "Okonkwo was arrested over an additional $72,870,000 still in the coffers of the bank, which is allegedly part of the proceeds of corruption linked to Diezani.\nInformation obtained by SaharaReporters from EFCC on Wednesday revealed that Okonkwo and one Charles Onyedibe are currently being detained by the anti-graft agency.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8 million, SaharaReporters also learnt on Wednesday from the commission.\nThe Appeal Court held that there was no substance in Diezani's bid to overturn a lower court's order.\nThe appellate court gave its judgment in an appeal filed by Diezani marked as Appeal - No CA/L/1263/19 between Diezani Alison-Madueke and the EFCC."
  },
  {
    "headline": "UPDATED: How Buhari Appointed His In-law, Emir Of Bichi’s Ex-Girlfriend, Others With Questionable Characters As Electoral Commissioners",
    "summarized_story": "The nominees are Mallam Mohammed Haruna (Niger State) North Central - National Commissioner; Mrs May Agbamuche-Mbu - Delta State, National Commissioner, South-South; Okeagu Kenneth Nnamdi - Abia State, South-East National Commissioner, Maj. Gen. A.B.\nProf. Rada H. Gumus - Bayelsa State, South-South, National Commissioner, Mr. Sam Olumeku - Ondo State, South-West, National Commissioner and Olaniyi Olaleye Ijalaye - Ondo State, South-West, Resident Electoral Commissioner.\nFor instance, May Agbamuche-Mbu, re-appointed as a National Commissioner, is a former girlfriend of the Emir of Bichi, Nasiru Ado-Bayero, sources told SaharaReporters on Tuesday.\nAgbamuche, a former girlfriend to Emir of Bichi, who is the father-in-law of Buhari’s daughter, has been reappointed by Buhari as INEC Commissioner.\n“National Commissioner, Festus Okoye was also reappointed; this is a former activist who is now corrupted to the bone."
  },
  {
    "headline": "UPDATED: How Buhari Appointed His In-law, Emir Of Bichi’s Ex-Girlfriend, Others With Questionable Characters As Electoral Commissioners",
    "summarized_story": "The nominees are Mallam Mohammed Haruna (Niger State) North Central - National Commissioner; Mrs May Agbamuche-Mbu - Delta State, National Commissioner, South-South; Okeagu Kenneth Nnamdi - Abia State, South-East National Commissioner, Maj. Gen. A.B.\nProf. Rada H. Gumus - Bayelsa State, South-South, National Commissioner, Mr. Sam Olumeku - Ondo State, South-West, National Commissioner and Olaniyi Olaleye Ijalaye - Ondo State, South-West, Resident Electoral Commissioner.\nFor instance, May Agbamuche-Mbu, re-appointed as a National Commissioner, is a former girlfriend of the Emir of Bichi, Nasiru Ado-Bayero, sources told SaharaReporters on Tuesday.\nAgbamuche, a former girlfriend to Emir of Bichi, who is the father-in-law of Buhari’s daughter, has been reappointed by Buhari as INEC Commissioner.\n“National Commissioner, Festus Okoye was also reappointed; this is a former activist who is now corrupted to the bone."
  },
  {
    "headline": "UPDATED: How Buhari Appointed His In-law, Emir Of Bichi’s Ex-Girlfriend, Others With Questionable Characters As Electoral Commissioners",
    "summarized_story": "The nominees are Mallam Mohammed Haruna (Niger State) North Central - National Commissioner; Mrs May Agbamuche-Mbu - Delta State, National Commissioner, South-South; Okeagu Kenneth Nnamdi - Abia State, South-East National Commissioner, Maj. Gen. A.B.\nProf. Rada H. Gumus - Bayelsa State, South-South, National Commissioner, Mr. Sam Olumeku - Ondo State, South-West, National Commissioner and Olaniyi Olaleye Ijalaye - Ondo State, South-West, Resident Electoral Commissioner.\nFor instance, May Agbamuche-Mbu, re-appointed as a National Commissioner, is a former girlfriend of the Emir of Bichi, Nasiru Ado-Bayero, sources told SaharaReporters on Tuesday.\nAgbamuche, a former girlfriend to Emir of Bichi, who is the father-in-law of Buhari’s daughter, has been reappointed by Buhari as INEC Commissioner.\n“National Commissioner, Festus Okoye was also reappointed; this is a former activist who is now corrupted to the bone."
  },
  {
    "headline": "FEC okays startup bill 'to provide enabling environment' for entrepreneurs",
    "summarized_story": "The federal executive council (FEC) has approved the Nigeria startup bill to provide a conducive environment for entrepreneurs.\nPantami said that the bill was crafted to provide an enabling environment for business startups to thrive.\nAdvertisement“The first one is on the Nigeria startup bill, which is exciting news to our innovators all over the country, particularly those who are working within the tech industry,” he said.\n“By this, the Nigeria startup bill has replaced our national digital innovation entrepreneurship and startup policy.\nAdvertisement“The bill also addresses startup leveling process, where a startup is going to be labeled."
  },
  {
    "headline": "FEC okays startup bill 'to provide enabling environment' for entrepreneurs",
    "summarized_story": "The federal executive council (FEC) has approved the Nigeria startup bill to provide a conducive environment for entrepreneurs.\nPantami said that the bill was crafted to provide an enabling environment for business startups to thrive.\nAdvertisement“The first one is on the Nigeria startup bill, which is exciting news to our innovators all over the country, particularly those who are working within the tech industry,” he said.\n“By this, the Nigeria startup bill has replaced our national digital innovation entrepreneurship and startup policy.\nAdvertisement“The bill also addresses startup leveling process, where a startup is going to be labeled."
  },
  {
    "headline": "EFCC: We've uncovered fresh $72.8m linked to Diezani",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has discovered a fresh sum of $72.87 million allegedly linked to Diezani Alison-Madueke, a former minister of petroleum resources.\nAdvertisementThe development was contained in a statement issued by the anti-graft agency on Wednesday.\nShe has, however, denied the allegation, while the Economic and Financial Crimes Commission (EFCC) has since commenced a process to extradite her.\nThe federal government had gained forfeiture of Diezani’s properties located in Banana Island Foreshore Estate, Ikoyi, Lagos, including 18 flats and six penthouses.\nAdvertisementMeanwhile, a screening process for independent valuers expected to manage the sale of the assets permanently forfeited by Alison-Madueke has been initiated by the federal government."
  },
  {
    "headline": "EFCC: We've uncovered fresh $72.8m linked to Diezani",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has discovered a fresh sum of $72.87 million allegedly linked to Diezani Alison-Madueke, a former minister of petroleum resources.\nAdvertisementThe development was contained in a statement issued by the anti-graft agency on Wednesday.\nShe has, however, denied the allegation, while the Economic and Financial Crimes Commission (EFCC) has since commenced a process to extradite her.\nThe federal government had gained forfeiture of Diezani’s properties located in Banana Island Foreshore Estate, Ikoyi, Lagos, including 18 flats and six penthouses.\nAdvertisementMeanwhile, a screening process for independent valuers expected to manage the sale of the assets permanently forfeited by Alison-Madueke has been initiated by the federal government."
  },
  {
    "headline": "DOCUMENT: How Lagos court refused to nullify Ikoyi registry weddings",
    "summarized_story": "A federal high court sitting in Lagos, on December 8, did not grant an order nullifying all weddings conducted by the Ikoyi marriage registry.\nAdvertisementThis is according to a certified true copy of the judgment seen by TheCable on Wednesday.\nAdvertisementThe development had sparked reactions, with several media reports claiming that the court nullified all weddings conducted by the Ikoyi marriage registry.\nAdvertisementGiving judgment, the court restrained the ministry of interior from “further contracting marriages within the plaintiff’s local government council areas except marriages conducted in the marriage registries of Ikoyi, Lagos and the Federal Capital Territory, Abuja”.\nThe court, however, refused to grant the two reliefs which sought to annul the weddings conducted by the Ikoyi registry dating back to 2004."
  },
  {
    "headline": "Edukoya raises $3.5m to provide quality secondary school education online",
    "summarized_story": "Edukoya, an African-focused online learning platform that empowers learners and their parents to access high-quality education, has raised $3.5 million in a pre-seed round led by Target Global.\nGet the best African tech newsletters in your inboxSpecifically, the platform is built to target Nigerian secondary school learners.\nThe seven-month-old startup says it offers a free, supplementary learning platform, as well as subscription packages with premium features, focused on K-12 learning and exam preparation.\nThe platform operates a 100% online model, which promotes self-paced learning that allows learners to save time and money.\nEdukoya app“Our vision at Edukoya is to redefine online education for the next generation of Africans."
  },
  {
    "headline": "1da Banton’s “No Wahala” blew up on Tik Tok. Now he knows its power",
    "summarized_story": "“When I recorded ‘No Wahala’, that was how I was feeling, so I put it into music.\nSo, I’m glad we achieved that.”Born and raised in Port-Harcourt, 1da Banton, dropped his debut single in 2015.\n“My TikTok video on the ‘No Wahala’ challenge gave me my highest views and engagement on TikTok.\nI didn’t expect it,” said Yewande Daranijo, an aspiring actress whose first viral TikTok video has over 300,000 views through this challenge.\n1da Banton recalled that at the time his song was blowing up in France, he wasn’t a regular user of Tik Tok and was still finding his way around the app."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Omicron: Event planners, attendees face fresh struggles on Lagos restrictions",
    "summarized_story": "The test is expected to be done either at an event venue or in selected private laboratories 24 hours before an event, a move considered an unrealistic expectation.\nEvent organisers are required to request rapid tests at event sites through an application on the Lagos State Safety Commission website: www.lasgsafetyreg.com.\nPeople expressing symptoms of COVID-19 in Lagos are often referred from state-run hospitals to private laboratories to pay out-of-pocket for tests.\nInformation required on the event safety clearance form provided on the website of the safety commission covers mainly event name, type, start date, end date, start time, end time, name and address of event venue, estimated guests, venue capacity, social centre number of event venue and available parking.\n“Once you have failed to be guided by the Lagos State Infectious Disease regulation of 2020, we will kick in terms of enforcement,” he said."
  },
  {
    "headline": "Lawyer in Ecobank’s tango with Honeywell, Ogunba got back rank of SAN in 2018",
    "summarized_story": "Kunle Ogunba, counsel to Ecobank in the dispute between it and Honeywell had his rank of senior advocate of Nigeria (SAN) restored in 2018 after a review of his case by the Legal Practitioners Committee which had earlier indicted him for misconduct as reported by BusinessDay on December 20, 2021.\nOn January 11, 2018, the Legal Practitioners Privileges Committee (LPPC) sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of SAN and all other privileges attached to the rank.\nHowever, BusinessDay is now in receipt of a September 20, 2018 letter by the LPPC titled, “Kunle Ogunba SAN: Notice of restoration of the award of the rank of Senior Advocate of Nigeria on your person with all its privileges” and in which the restoration of the rank was conveyed.\nAccording to Hadizatu Uwani Mustapha, chief registrar of the Supreme Court and secretary of the LPPC, “further to your letter of September 11, 2018, in which you presented to the Legal Practitioners’ Privileges Committee attached documents in compliance to the conditions laid down in paragraph 27 of legal practitioners privileges committee guidelines 2018.\nAs set out above, Mr. Ogunba on behalf of Ecobank deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.”"
  },
  {
    "headline": "Resilient Africa plans sale of malls on fading buying power",
    "summarized_story": "The three malls the company plans to sell are Asaba, Delta and Owerri, which were developed as part of the company’s retail space development strategy in Nigeria.\nThey are to be sold to Shoprite Holdings Limited, South Africa.\nSo far, Resilient Africa’s Nigerian portfolio covers up to 30,015 square metres of lettable retail space in the three malls.\nThose operations are held through a 60.94 percent interest in two South African incorporated companies, Resilient Africa and Resilient Africa Managers, in partnership with Shoprite Holdings Limited,” Dolapo Omidire, founder/ CEO, Estate Intel, explained to BusinessDay.\nBefore now, analysts had been upbeat with optimism on foreign interest in the Nigerian market."
  },
  {
    "headline": "Counter-Terrorism: NAF ‘wings’ 4 pilots, 12 UAV operators – Nigerian Observer",
    "summarized_story": "“In the area of pilot training, 11 student pilots are currently undergoing training in South Africa, while three are undergoing Alpha Jet conversion in Egypt.\nHe added that 12 student pilots were undergoing Basic Transport Training, 32 undergoing Ab-Initio Flying Training and eight undergoing Instructor Training at 401 Flying Training School, Kaduna.\n“Special arrangements are also currently being made to upgrade UAV training facilities to enhance the operational capacity of UAV operators in anticipation of increased tempo of air operations with the recently acquired UAVs.\n“I most sincerely express profound gratitude and appreciation to CAS, whose leadership has created the enabling environment for timely turn out of pilots and UAV operators in the NAF.\n“To the pilots and UAV operators, tomorrow brings a new journey, but today marks the end of a chapter in your career as you have become qualified pilots and UAV operators.”..."
  },
  {
    "headline": "We Are In The Business Of Driving Human Progress – Chevron – Nigerian Observer",
    "summarized_story": "Represented by the Area Manager, PGPA ,(Field Operations) ,CNL, Mr. Sam Daibo, Brikinn said, Chevron had over the years, worked and demonstrated ethical, environmentally responsible, safe, and respectful business practices.\n“Everywhere we work, we demonstrate ethical, environmentally responsibile safe and respectful business practices.As we would say, we are in the business of driving human progress.\n“Our primary contributions is by safely developing and delivering affordable and reliable energy that is necessary for social and economic progress.\n“It is important to note that community development can only be sustained in atmosphere of peace that is conducive for business activities”, Brikinn said.\nConstruction of Gbokoda community Cottage hospital, Construction of Bateren Community health Center, among others in Education, Health Care, well as Human Capital development."
  },
  {
    "headline": "Obaseki: Only PDP can save Nigeria from current socio-economic woes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has declared that only the Peoples Democratic Party (PDP) can rescue Nigeria and place it on the path of economic prosperity and sustainable development.\nAccording to him, “If Nigeria is going to be salvaged, PDP has to step into the throne to salvage this country politically.\nThe stakes are too high; we cannot allow Nigeria to continue the way it is going.\n“Our great party must come to the rescue and take over the reins of power in this country.\nAddressing members of the delegation, Obaseki stated, “The decision is of the majority of our people, which is the way we will go."
  },
  {
    "headline": "Obaseki inaugurates 12-man road safety advisory council – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has inaugurated a 12-man Edo State Road Safety Advisory Council, charged with the responsibility of coordinating the state’s road safety targets and driving the implementation of the road safety sector strategic plan.\nWhile inaugurating the council, Obaseki said, “The responsibilities of this council is to help coordinate our road safety targets and to drive implementation of the road safety sector strategy plan.\n“We believe that as an advisory council, you are going to help in building the agencies to implement programmes that are in the sector’s strategic plan.\nWe have to enforce road safety regulations.”He continued: “We are going to make sure that the mobile courts work with the designs of our roads so that we can have rest areas.\nGovernor for this opportunity and assure him of our unalloyed commitment to making sure that the purpose for which this advisory council was established is actualized.”..."
  },
  {
    "headline": "Former Anambra governor, Emeka Ezeife loses wife, Njideka",
    "summarized_story": "Wife of a former governor of Anambra State, Chief Emeka Ezeife, Njideka has died.\nMrs. Ezeife died after a brief illness in the United States of America, according to a statement signed by the Secretary of the Igbo Elders Council, Professor Charles Nwekeaku on Wednesday.\n“Mrs Ezeife, who was scheduled to return to Nigeria on December 13, 2021, suddenly became sick a day before her trip and couldn’t make it.\n”May God grant her soul a perfect peace, as well as His Excellency, Dr Ezeife and other members of his family the fortitude to bear her irreparable loss.\n“Our members are enjoined to commiserate with the Ezeife family and remember them in prayers.”Reacting to the death, Ohanaeze Ndigbo said it received with heavy shock the news on the unfortunate passage of the former first lady."
  },
  {
    "headline": "Care People Foundation holds carnival, gives scholarships, gifts to people with disabilities, orphans",
    "summarized_story": "The event was put together by the Care People Foundation at its Orphanage and Motherless Babies Home along Ibadan – Lagos Expressway, Ibadan, the capital of Oyo State.\nThe carnival which featured music performances by various orphanage homes and schools for people with disabilities, was organised by the Care People Foundation to make the under privileged feel the aura of the Yuletide.\nThe foundation also in conjunction with Animasahun Foundation, Canada gave out N1 million scholarship awards to 15 indigent students from tertiary institutions in Nigeria.\ngovernment can do better.”Speaking on the effort of the foundation to help the less privileged, Tioluwani said “At our foundation, impacting lives is a golden assignment that must be done.\nShe expressed her joy that the foundation every year makes orphans, people with disabilities and other less privileged to feel the Yuletide celebration."
  },
  {
    "headline": "Senate approves Buhari’s $5.8bn 2018 -2020 external borrowing request",
    "summarized_story": "The Nigerian Senate on Wednesday approved the sum of $5,803,364,553.50 USD and a grant component of N10 million USD under the 2018-2020 External Borrowing (Rolling) plan.\nThe approval followed the consideration of a report by the Committee on Local and Foreign Debts, a statement from Dr. Ezrel Tabiowo, Media aide to Senate president said.\nHe recalled that President Buhari in a communication dated May 6, 2021, had requested the Senate to consider and approve the Federal Government 2018-2020 External Borrowing (Rolling) plan.\nIn accordance with the recommendation of the Committee, the Senate at Plenary in November 2021 approved the sum as financing for projects as recommended by the panel.\nHe explained that the request for the approval of $5.8 billion USD was part of the mandate of the Committee in respect of the 2018-2020 External Borrowing (Rolling) plan."
  },
  {
    "headline": "CBN Set To Tighten Monetary Policy in 2022",
    "summarized_story": "Tighter policy in developed economies certainly remains one of the biggest risks to the outlook for emerging markets.\nLooking beyond monetary policy, other themes that are likely to impact Nigeria’s growth revolves around oil prices and the Omicron menace.\nOil prices recently secured their biggest weekly gain since August despite ongoing uncertainty revolving around the Omicron variant.\nWith the Omicron variant threatening global demand and OPEC+ moving ahead with its planned January oil output rise of 400,000 bpd, oil remains vulnerable to downside losses.\nGiven how a handsome chunk of Nigeria’s export earnings and government revenues are sourced from oil sales, falling oil prices could threaten the country’s economic outlook."
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nADVERTISEMENTThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nADVERTISEMENTThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "At Sam Nda-Isaiah’s First Memorial: Call For Assent To Electoral Bill Resonates",
    "summarized_story": "The necessity for the president to give assent to the Electoral Act Amendment Bill was highlighted again at First Memorial Lecture to honour the late founding chairman of LEADERSHIP Group Ltd, Sam Nda-Isaiah.\nKuru, in his tribute during the lecture to honour Sam Nda-Isaiah, said he had never come across such a passionate person like Sam.\nThe late Sam Nda-Isaiah will be happy that he is remembered by those he called friends.\n“Over the course of his life, Sam ventured into diverse fields for as wide as his imaginations could take him.\nShe said that she was sure there are only a few Nigerians with the kind of energy the late Sam Nda-Isaiah had."
  },
  {
    "headline": "Abandoned responsibility: Again, baby mama rubbishes Ubi Frankling over child support",
    "summarized_story": "Sandra Iheuwa, the mother of Ubi Franklin’s daughter has called out the music producer over child support, warning him against posting their daughter on social media.\nIn a lengthy post on Instagram, the 35-year-old accused the father of her child of neglecting his financial responsibilities towards their daughter.\nThe woman further threatened legal actions against Franklin over child support saying she would not allow him take the credit for raising their daughter.\n“I will not allow anyone take the glory for after I have finished raising my daughter especially with no help from the sperm donor.\nDon’t try me, I will take it there legally and your US visa will be revoked,” she wrote in parts."
  },
  {
    "headline": "Abandoned responsibility: Again, baby mama rubbishes Ubi Frankling over child support",
    "summarized_story": "Sandra Iheuwa, the mother of Ubi Franklin’s daughter has called out the music producer over child support, warning him against posting their daughter on social media.\nIn a lengthy post on Instagram, the 35-year-old accused the father of her child of neglecting his financial responsibilities towards their daughter.\nThe woman further threatened legal actions against Franklin over child support saying she would not allow him take the credit for raising their daughter.\n“I will not allow anyone take the glory for after I have finished raising my daughter especially with no help from the sperm donor.\nDon’t try me, I will take it there legally and your US visa will be revoked,” she wrote in parts."
  },
  {
    "headline": "Greedy Abia man arrested for abduction, murder of his wife",
    "summarized_story": "The suspects arrested are; Irem Ifeanyi Mbah, Igwe Anya Chima, Okorie Okam and Emeh Kalu – the husband of the deceased and the principal suspect.\nThe suspects are within the age bracket of 25 – 40yrs and all native of Nguzu Edda village in Afikpo South Local Council Area of Ebonyi State.\nInvestigations into the death of the victim follow complaint received from the people of Ngugworo community, Ebonyi State, a border town to Abia State where the victim resided, when the decomposing body of the late Mrs Kalu was discovered in their community.\nThe discrete investigations carried out by the Police team led to the arrest of the four suspects.\nEfforts are being intensified to arrest other suspects and persons indicted in the matter with a view to concluding the investigations."
  },
  {
    "headline": "Greedy Abia man arrested for abduction, murder of his wife",
    "summarized_story": "The suspects arrested are; Irem Ifeanyi Mbah, Igwe Anya Chima, Okorie Okam and Emeh Kalu – the husband of the deceased and the principal suspect.\nThe suspects are within the age bracket of 25 – 40yrs and all native of Nguzu Edda village in Afikpo South Local Council Area of Ebonyi State.\nInvestigations into the death of the victim follow complaint received from the people of Ngugworo community, Ebonyi State, a border town to Abia State where the victim resided, when the decomposing body of the late Mrs Kalu was discovered in their community.\nThe discrete investigations carried out by the Police team led to the arrest of the four suspects.\nEfforts are being intensified to arrest other suspects and persons indicted in the matter with a view to concluding the investigations."
  },
  {
    "headline": "Buhari gets go ahead to borrow $5.8bn",
    "summarized_story": "The Senate on Wednesday approved the sum of $5,803,364,553.50 USD and a grant component of N10 million USD under the 2018-2020 External Borrowing (Rolling) plan.\nThe approval followed the consideration of a report by the Committee on Local and Foreign Debts.\nHe recalled that President Buhari in a communication dated May 6, 2021, had requested the Senate to consider and approve the Federal Government 2018-2020 External Borrowing (Rolling) plan.\nIn accordance with the recommendation of the Committee, the Senate at Plenary in November 2021 approved the sum as financing for projects as recommended by the panel.\nHe explained that the request for the approval of $5.8 billion USD was part of the mandate of the Committee in respect of the 2018-2020 External Borrowing (Rolling) plan."
  },
  {
    "headline": "No survivor as Florida-bound plane crashes",
    "summarized_story": "The plane was trying to make an emergency landing, when it burst into flames on landing.\nDiario Libre reports the flight manifest said there were three crew members and six passengers in the plane.\nLocal journalist Anibelca Rosario posted on Twitter: “The nine occupants (2 crew members and 7 passengers) of the plane crashed on the runway of #AILA have died.\nPeace to their souls.”She later identified the occupants in another tweet:“Fatal plane crash victims #aila: Debbie Von Marie Jiménez,José Ángel Hernández Kellyan Hernández, Jayden Hernández.\n“Crew members: Luis Tancredi (pilot) Víctor Herrera (co-pilot), Verónica Estrella (purser)”."
  },
  {
    "headline": "Pictures: NGO empowers 30 IDP women with funds for business",
    "summarized_story": "Brainy Age initiative, a women and children based Non Governmental Organisation (NGO) has provided financial support to 30 indigent women to enable them do businesses and take care of themselves and children.\n“This year we choose to enlighten them on Gender Based Violence (GBV) which is a global thing.\nWe have come to empower the children with books, and the women with loans for business,” she said.\nWe were able to ascertain those who really needs funds and so we have solicited for funds for them and today we are supporting them financially based on needs assessment,” she added.\n“Gender Based Violence is a menace and is quite endemic in our country for generations ."
  },
  {
    "headline": "CNL: Splashing $1bn on Nigerian suppliers, service providers in ten years",
    "summarized_story": "Benjamin Umuteme writes on how Chevron Nigerian Limited has impacted Nigeria’s economy since its operation in teh country.\nDecember 1, 2021, Chevron Nigeria Limited (“CNL”), operator of the joint venture with the Nigerian National Petroleum Company Limited, (“NNPC”) – “NNPC/CNL JV” – marked 60 years of its operations in Nigeria.\nBeyond its core oil and gas business, Chevron has made significant contributions to the socio-economic development of Nigeria for six decades.\nRecognitionIn February 2018, at the Nigerian International Petroleum Summit (“NIPS”) in Abuja, CNL received an industry award as the highest contributor of domestic gas in Nigeria.\nFor the last 10 years, CNL has spent an estimated annual average of $1 billion on Nigerian suppliers and service providers."
  },
  {
    "headline": "Breaking: Another traditional ruler kidnapped in Imo",
    "summarized_story": "There are indications that another monarch has been kidnapped in Imo state.\nThis time around, the traditional ruler of Umuezeala-Ama Autonomous Community in Ehime Mbano local government area, Eze Aloysius Igwe, was whisked away from his community on Wednesday.\nBlueprint gathered that the Eze Aloysius was abducted around the market square of his community.\nKidnapping of monarchs have been the target of unknown gunmen in recent times within the state.\nDetails loading…"
  },
  {
    "headline": "Court Grants N5m Bail To 12 Suspects Over Seige On Justice Odili’s Residence",
    "summarized_story": "Justice Nkoenye Maha of the Federal High Court in Abuja has granted bail to 12 accused persons involved in the siege on Justice Mary Odili’s residence.\nThe bail was granted on Wednesday evening in the sum of N5 million each with two sureties in like sum.\nRead Also: EFCC Uncovers Additional $72.8m Linked To DiezaniThey are all to be remanded at the Kuje correctional center, including those who were granted bail, pending the perfection of their bail applications.\nThe Police had arraigned 15 out of the 22 suspects alleged to have laid siege on the residence of the Supreme Court Justice.\nJustice Odili’s home was invaded on October 29, with the said panel claiming it had a search warrant from Chief Magistrate Emmanuel Iyanna."
  },
  {
    "headline": "EFCC Uncovers Additional $72.8m Linked To Diezani",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has uncovered an additional $72, 870,000 million linked to the former Minister of Petroleum Resources, Diezani Alison-Madueke.\nThe sum was said to have been discovered in an account domiciled in Fidelity Bank Plc.\nConsequently, a former Managing Director of the bank, Nnamdi Okonkwo, has been arrested.\nWhile all the $153 million was recovered by the EFCC, the cases involving $115million, as it relates with the Independent National Electoral Commission, INEC, bribery matter, are in various courts.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8m."
  },
  {
    "headline": "FEC Approves 20% Salary Increase For Police Personnel",
    "summarized_story": "The Federal Executive Council (FEC) has approved the review and upgrade of salaries of police personnel by 20 per cent.\nThe Minister of Police Affairs, Maigari Dingyadi, said this on Wednesday after the Federal Executive Council meeting which was chaired by President Muhammadu Buhari, at the newly renovated council chambers.\nFEC also approved the release of N13.1 billion for payment of outstanding death benefits of 5,472 personnel for the uninsured period of 2013 to August 2021.\nIn addition, the council approved a tax waiver in the sum of N18.6 billion for junior officers of the police to increase the take home pay effective from October 2021.\nAccording to her, the outcome will first require the executive to pass a supplementary budget to parliament."
  },
  {
    "headline": "Bandits Kill Kaduna Lawmaker, Abduct Travellers On Kaduna-Zaria Highway",
    "summarized_story": "Bandits have killed a member of the Kaduna State House of Assembly, Rilwanu Gadagau, along the Kaduna-Zaria Highway.\nHe was reported to have been killed on Monday night by bandits who attacked travellers along the road.\nHe revealed that Gadagau’s body was found near Mawai, a village just about 13 kilometres from the Kaduna State capital.\nHe was said to be among over 30 travellers abducted by the bandits who laid a siege on the road.\nConfirming the incident, the Speaker of the Assembly, Yusuf Zailani, described the death of the lawmaker as devastating."
  },
  {
    "headline": "Arsenal Move To Fourth On EPL Table After Beating West Ham",
    "summarized_story": "Arsenal moved to fourth on the Premier League table after defeating West Ham United on Wednesday.\nArsenal are now one point above fifth-placed West Ham after a second successive victory eased the drama surrounding Mikel Arteta’s decision to strip Gabon forward Aubameyang of the club captaincy.\nIt is a remarkable reversal of fortune after Arsenal lost their opening three league games for the first time in 67 years.\nIt was the third Premier League game to be postponed due to Covid in four days as the new Omicron variant causes havoc in England’s top-flight.\nThe Premier League announced a record 42 positive tests across two testing cycles last week."
  },
  {
    "headline": "Nollywood Star, Kabiru Fubara, dies months after surviving cancer -",
    "summarized_story": "Nollywood Star, Karibi Fubura has died months after surviving cancer.\nA family member of Nollywood actor, Karibi Fubara, announced his death nineteen months after he survived surgery on his kidney.\nThe post was met with tributes from several Nollywood actors and actresses including, Rita Dominic, Funke Akindele, Kate Henshaw, Sharon Ooja, among others.\nThe “God calling” actor married popular Nollywood fashion entrepreneur, Yolanda Okereke in 2019.\nUntil his death, Fubara was a Nollywood actor who rose to prominence after starring in Before 30, God Calling, Quam’s Money, Castle and Castle, Royal Hibiscus Hotel, Smart Money Woman, and MMM."
  },
  {
    "headline": "Gov. Dapo Abiodun mourns Olowu of Owu, Olusanya Dosunmu -",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has expressed shock at the transition of the Olowu of Owu Kingdom, Oba Olusanya Dosunmu, Amororo II.\nIn a condolence message issued on by his behalf on Tuesday by his Chief Press Secretary, Kunle Somorin in Abeokuta, Gov.\nAbiodun described the Oba Dosunmu as “a quintessential monarch, a man of peace and a passionate supporter of development.”While condoling with the monarch’s immediate family and the people of Owu, the governor said they should take solace in the lasting impact he had on his domain.\nHe prayed that “God Almighty grants Kabiyesi’s soul eternal repose and the people he left behind the fortitude to bear this loss”, the statement surmised."
  },
  {
    "headline": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest",
    "summarized_story": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest"
  },
  {
    "headline": "2022 Budget: Assembly passes N188.4bn for Sokoto State",
    "summarized_story": "The Sokoto State House of Assembly has passed the the state 2022 budget of N188.4 billion following the adoption of the report of the House Committee on Finance and Appropriation at the plenary sitting of the Assembly.\nThe budget, tagged, “Budget of accomplishments and sustainable development”, is lower than the 2021 budget of N205,016,512,295.41 by N16,587,016,447.78, consisting both the Recurrent and Capital Expenditures approved by the Assembly.\nPresenting the report, Chairman of the Committee Malami Basakkwace (PDP- Sokoto South II) explained that the committee did not add or subtract from the figures presented by the governor.\nHe said, based on genuine request by sub-committees, the committee moved resources inwards to accommodate some important demands and interest of our the people of the state.\nMr. Basakkwace said the committee recommended that all sources of funding identified in the budget should be maintained and their conditions adhere to."
  },
  {
    "headline": "Canada Advises Against International Travel Amid Omicron Threat",
    "summarized_story": "“I say very clearly: Now is not the time to travel,” Health Minister Jean-Yves Duclos told a news conference, adding it is clear there is community transmission of Omicron in Canada.\nDuclos said the government is sending millions more COVID-19 vaccine doses and rapid tests to the 10 provinces.\n“As we combat the spread of the highly contagious Omicron variant, nothing matters more than getting these booster doses into people’s arms,” Ontario Premier Doug Ford said on Wednesday.\nCanada already has travel bans on 10 African countries because of concerns about the new variant.\nPeter Juni, director of Ontario’s COVID-19 science advisory table, urged people to take precautions, get vaccinated and not take Omicron lightly."
  },
  {
    "headline": "Barcelona Striker Aguero Retires at 33 Due to Heart Condition",
    "summarized_story": "Aguero, 33, was taken to hospital on Oct. 30 after experiencing chest pain and breathing difficulties in Barcelona’s 1-1 draw with Alaves.\nIt’s a very hard moment but I’m at peace with the decision I made,” Aguero told a gathering at the Camp Nou.\n“So I started to process it, that I could never play professional football again.\n“I’m positive about it… That I can live my life happy after professional football, that nothing more serious happened.\nAguero scored only one goal for Barcelona which came in a 2-1 home defeat by Real Madrid."
  },
  {
    "headline": "Apple Delays Return to Office Indefinitely",
    "summarized_story": "Apple Inc is delaying its return to office plans indefinitely, Bloomberg News reported, while the company said it has temporarily closed three stores in the U.S. and Canada after a rise in COVID-19 cases and exposures among the stores’ employees.\nThe company’s employees were previously set to return to offices on February 1, according to the report, citing a memo sent by Chief Executive Officer Tim Cook.\nGrowing worries over the rapidly spreading Omicron coronavirus variant have derailed several companies’ plans for a return to normalcy.\nread moreAll the employees at the three stores will be tested before the stores are reopened, the company said.\nThrough the pandemic, Apple has closed some stores for short periods of time around the world as coronavirus-related lockdowns were brought in and lifted."
  },
  {
    "headline": "Seven-Time Formula One Champion Hamilton Receives Knighthood",
    "summarized_story": "Britain’s seven-time Formula One champion Lewis Hamilton received a knighthood for services to motorsport on Wednesday, days after losing out on what would have been a record eighth title in the last lap of the Abu Dhabi Grand Prix.\nHamilton holds the record for most race wins with 103, and is tied with Germany’s Michael Schumacher on seven drivers’ championships.\n“Congratulations to 7x F1 World Champion and equality advocate Lewis Hamilton on receiving knighthood today,” American tennis great Billie Jean King tweeted.\nHamilton holds the record for most race wins with 103, and is tied with Germany’s Michael Schumacher on seven drivers’ championships.\nHamilton holds the record for most race wins with 103, and is tied with Germany’s Michael Schumacher on seven drivers’ championships."
  },
  {
    "headline": "Derek Chauvin Pleads Guilty to Violating George Floyd’s Rights",
    "summarized_story": "A state judge had already sentenced Chauvin to 22-1/2 years in prison in June after a jury convicted him for the 2020 murder of Floyd, and he has since been held in solitary confinement in a maximum-security Minnesota prison.\nIn Minnesota, prisoners are eligible for supervised release after completing two thirds of their sentence.\nChauvin, who is white, was seen in videos recorded by horrified onlookers kneeling on the handcuffed Floyd’s neck for more than nine minutes in a brutal arrest on a Minneapolis street corner on May 25, 2020.\nThe killing ignited one of the largest protest movements ever seen in the United States.\nChauvin’s April conviction in state court on charges of unintentional second-degree murder, third-degree murder and manslaughter was seen by many as a landmark rebuke of the disproportionate use of police force against Black Americans."
  }
]