[
  {
    "headline": "Peter Obi’s ex-aide emerges LP factional presidential candidate",
    "summarized_story": "A faction of the Labour Party led by its former Deputy National Chairman, Callistus Okafor, on Wednesday elected Chief Digar Ezenwafor as its presidential candidate for the 2023 general elections.\nEzenwafor, immediate past Senior Special Assistant to Ex-Governor Willy Obiano of Anambra State on Politics and Strategy, emerged as the LP faction’s candidate at a national convention held in the Garki area of Abuja.\nHe is also said to have worked with a factional presidential candidate of the party, Peter Obi, as his Chief of Protocol during his first term as governor of Anambra State.\nEzenwafor told the party’s delegates that he was on a rescue mission to Nigeria.\nOkafor said his position and actions were based on the need to ensure justice, fairness and equity stressing that he had nothing against Obi, who had been presented by the other faction as its presidential candidate."
  },
  {
    "headline": "Nigerian-American surgeon jailed 27 years for fraud",
    "summarized_story": "Justice Abdulazeez Anka of a Federal High Court in Ikoyi, Lagos State, has sentenced a Nigerian-American-trained surgeon, John Nweke, to 27 years imprisonment for fraudulently obtaining goods from Konga Online Shopping Limited.\nHe said, “They were charged under the Advance Fee Fraud and other Fraud Related Offences Act, No.\nHowever, on February 4, 2022, the Court of Appeal, Lagos, upheld the arguments of the Police Special Fraud Unit, dismissed the said appeal and affirmed the conviction and sentence of the appellant,” he said.\nHe stated that the company was convicted and sentenced to a winding-up while all its assets were forfeited to the Federal Government, as restitution.\nOn February 18, 2022, the Court of Appeal, Lagos, upheld Police Special Fraud Unit arguments against the appeal, dismissed the same and unanimously affirmed the conviction and sentence of the appellant.”Copyright PUNCH."
  },
  {
    "headline": "Just In: Adebayo wins SDP Presidential Primaries",
    "summarized_story": "By Dirisu YakubuABUJA- Lagos-based businessman, Adewole Adebayo, Wednesday night, clinched the Presidential ticket of the Social Democratic Party, SDP, ahead of the 2023 general elections.\nIn a keenly contested election that drew delegates to the International Conference Centre, Abuja, Adebayo scored 1, 546 votes to heat Kadijah Okunnu-Lamidi who managed a total of 83 votes.\nIn his acceptance speech, Adebayo promised to run an all-inclusive government, and attract the best brains in various spheres of human endeavours to make the country great again.\nAccording to him, SDP remains the only democratic alternative left for Nigerians “who are tired of the broken promises made by the Peoples Democratic Party, PDP, and the All Progressives Congress, APC.\nThe exercise which lasted for over eight hours was monitored by the Independent National Electoral Commission, INEC, a delegation led by a national commissioner, publicity and voter education, Barr."
  },
  {
    "headline": "Omo- Agege congratulates Tinubu over APC presidential ticket",
    "summarized_story": "Deputy Senate President, Senator Ovie Omo-Agege has congratulated Asiwaju Bola Tinubu, the newly-elected presidential candidate of the All Progressives Congress (APC).\nOmo-Agege, the standard-bearer of APC in the 2023 governorship election in Delta State, expressed optimism that Tinibu would emerge victorious in next year’s presidential election.\nWhile calling on Tinubu to be magnanimous in victory, Omo-Agege stressed the need for all presidential aspirants to join hands with the APC Presidential candidate and the party in ensuring victory.\n“Not everyone gave APC a chance to conduct a free, fair, credible presidential primary.\nThe Deputy Senate President called on Nigerians to support Tinubu and other APC candidates at all levels in the forthcoming polls."
  },
  {
    "headline": "APC CONVENTION: Mayor of Urhoboland congratulates victorious Tinubu, urges party cohesion",
    "summarized_story": "Akpodoro described Asiwaju as an agent of change and accelerated development and that there’s no doubt that he would exit the country as President from it current challenges bothering on security and education.\n“The APC should build a formidable force against the opposition so that it would emerge victorious at the general elections in 2023.\nTinubu worked hard to achieve success and its a victory for all.\nParty faithful should close ranks to defeat the opposition and we hope they listen.\nI commend Governors Nasir el-Rufai, Babagana Zulum, Abdullahi Umar Ganduje, former Governor Kashim Shettima and other governors, who refused to stand the truth on its head,” the Urhoboland Mayor concluded."
  },
  {
    "headline": "Katsina: Police present N53.9m cheque to families of deceased officers",
    "summarized_story": "By Ogalah IbrahimThe Katsina State Police Command on Wednesday presented over N53.9 million cheque (N53, 971,661.59) to the next of kin and families of police officers, who died while in active service.\nThe state’s Commissioner of Police, CP Idrisu Dabban presented the cheques on behalf of the Inspector General of Police, IGP Alkali Baba Usman on Wednesday.at the state force headquarter.\nThe cheque issued to the representatives of the 25 families of the deceased police officers is part of the IGP’s Family Welfare Insurance scheme.\nThe Commissioner of Police, while presenting the cheques, applauded the efforts of the Inspector-General of Police, for improving the welfare of the officers and men of the Nigeria Police Force, urging the beneficiaries to put the money into good use for their families sake.\nSpeaking on behalf of the families of the deceased, deceased, Al’amin Nuradeen, thanked the Inspector-General of Police for the welfare package, promising that it will be usedhud to use the money judiciously."
  },
  {
    "headline": "We ’ll support you to victory, Yahaya Bello assures Tinubu",
    "summarized_story": "Governor Yahaya Bello of Kogi StateBy Olasunkanmi AkoniOne of the Presidential aspirants and Kogi State Governor, Yahaya Bello has assured National Leader of the All Progressives Congress and former Governor of Lagos State, Asiwaju Bola Tinubu, of needed support to ensure the victory of the flagbearer and the ruling party in the 2023 presidential election.\nBello, one of the leading contestants gave the assurance in his congratulatory message to Tinubu on his emergence as the presidential candidate of the APC for the 2023 general election.\nTinubu emerged the presidential candidate of the party after polling 1,271 votes in the primary election of the ruling party, held at the Eagle Square, Abuja on Tuesday.\nThe Director, Media and Publicity of the Yahaya Bello Presidential Campaign Organisation, Yemi Kolapo, said the Kogi Governor had accepted the outcome of the primaries and would give the needed support to ensure the victory, even as he described the election as “peaceful.”"
  },
  {
    "headline": "Police arrest ministry staff, others after attempt to defraud Nigerian govt of $2bn",
    "summarized_story": "The Public Relations Officer, SP Chidi Nwabuzor told reporters that they attempted to defraud the government of $2billion.\nNwabuzor said the arrest followed complaint received by the crack team of the command on April 25, 2022.\nThe petition was written by High Chief Richard David, a representative of Okpella community in Etsako Central Local Government Area.\nOn July 14, 2021, the suspects told the complainant and his kinsmen that they had secured a contract from the Federal Government.\nBut during investigation, the police uncovered the fact through the confession of a staff of the Federal Ministry of Special Duties and Intergovernmental Affairs."
  },
  {
    "headline": "Owo massacre: South West doctors seek arrest of assailants, urge members to assist victims",
    "summarized_story": "Medical doctors in the South West geopolitical zone have demanded the immediate arrest of the gunmen, who massacred many worshippers at the St. Francis Catholic Church, Owo, Ondo State on Sunday.\nWhile condemning the attack on the church, the medical personnel begged their members in Ondo and neighbouring states to provide the needed health care services for injured victims of the attack.\nSaying they received the news of the Owo massacre with great shock, the Doctors called on the government and the security apparatus to swing into action and fish out “these unscrupulous elements” in our community.\n“We wish the families of the deceased the fortitude to bear the irreparable loss and speedy recovery to the injured.\n“We call on our members in Ondo and neighbouring states to continue to provide the needed health care service,” it said."
  },
  {
    "headline": "Security: Keke, Okada riders regulate operations in Enugu council areas",
    "summarized_story": "In their determined efforts to assist the Enugu State government and security agencies to decisively address the security challenges in Igbo-Eze North and Igbo-Eze South local government areas of the state, the Tricycle (Keke) and Motorcycle (Okada) Riders Associations in the two council areas have resolved that their members should stop operating from 6pm to 6am, daily in the affected two LGAs.\nThe two associations also directed all Keke and Okada operators to withdraw their services in Aguibeje and Iyionu communities in Igbo Eze North LGA till further notice.\nThe resolutions were taken during an emergency meeting of the Executives and Members of Keke and Okada riders associations in Igbo- Eze North and Igbo-Eze South LGAs, yesterday.\nThe decisions were disclosed in a statement jointly signed by the Enugu State Chairman of Association of Tricycle Riders, Comrade Benjamin Ikah, and the four Chairmen of Tricycle Riders and Motorcycle Associations in Igbo-Eze North and Igbo-Eze South LGAs, Comrade Solomon Ejiofor Ali, Izuchukwu Onah, Samuel Eze and Fidelis Onah, respectively.\nThe associations requested all the security agencies in the state “to enforce these resolutions” and went further to enjoin their members in the affected LGAs and communities to comply strictly with the resolutions, forthwith."
  },
  {
    "headline": "Owo massacre: Women perform rituals, place curses on attackers [Photos]",
    "summarized_story": "Following the killing of worshippers by gunmen at Saint Francis Catholic Church last Sunday in Owo, headquarters of Owo Local Government Area of Ondo State, women in the town on Wednesday protested against the attack.\nThe women in their numbers who trooped for the protest also placed curses on the gunmen who carried out the attacks.\nDuring the protest, the women visited the seven traditional sites in the town where they performed rituals and placed curses on the attackers.\nThe women also visited the Church where the worshippers were killed to commiserate with the priest, stressing that the perpetrators will not go unpunished for defiling God’s house.\nThe monarch appealed to the women to keep their wards from criminal acts and to stay away from violence."
  },
  {
    "headline": "Fake news capable of threatening Nigeria’s existence – Clergyman",
    "summarized_story": "The General Overseer of Faith Foundation Ministry International, Pastor Yarima El- Samaila has decried the growing level of fake news in the country, saying it poses a great threat to the peace and corporate existence of Nigeria.\nHe also warned politicians to desist from spreading fake news about their perceived opponents, adding that Nigerians cannot be swayed or deceived by fake news and propaganda used to smear the name of opponents.\nSamaila explained that the growing level of fake news in the country is not only worrisome but capable of creating panic and disunity among Nigerians.\nHe also appealed to politicians and also the media not to overheat the polity as such an open display of propaganda will not strengthen the country’s growing democracy.\n“We should strive to promote issues and proffer solutions aimed at bailing our nation from factors which threaten peace and stability of our beloved country”."
  },
  {
    "headline": "Banks, firms in N11b deals at Nigerian Exchange",
    "summarized_story": "By Taofik Salako, Deputy Group Business EditorSeveral insider deals worth about N11 billion have been recorded at the Nigerian Exchange (NGX), highlighting active influential transactions by directors and senior management of quoted companies.\nThe insider share transactions involved significant shareholders and directors of FBN Holdings, FCMB Group, Nestle Nigeria, Guaranty Trust Holding Company and United Capital.\nThe total transaction value for the deals was about N10.71 billion, according to calculation by The Nation.\nRead Also: CBN establishes Banks Neutral Cash HubsThe reports showed that Nestle S.A, the majority foreign shareholder in Nestle Nigeria Plc, has been buying retail minority shares through secondary market transactions.\nUnited Capital has also reported insider shares purchase by senior management staff and their relative."
  },
  {
    "headline": "Governors, Lawan, Atiku, Kwankwaso, Uba, others salute Tinubu",
    "summarized_story": "He added in the statement titled: “Felicitation,” that the outcome of the primary had proved the popularity of the former Lagos State governor amongst APC members.\nSpeaker Gbajabiamila described Tinubu as a dogged democrat who has the quality to lead APC to victory next year.\nI congratulate Asiwaju Tinubu for the well-deserved victory and the leadership of the party as well as the convention committee members for a great job.\nHe expressed confidence in the capacity and competence of Tinubu to deliver victory for the APC next year.\nTinubu will lead APC to victory, says AbdulRazaqIn his congratulatory message, AbdulRazaq noted that Tinubu deserved his victory."
  },
  {
    "headline": "UPDATED: Tinubu wins APC presidential ticket",
    "summarized_story": "By Jide Orintunsin, Tony Akowe and Nicholas Kanu, AbujaThe National Leader of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has clinched the presidential ticket of the ruling party for the 2023 general elections.\nFormer Imo Governor Senator Rochas Okorocha, Pastor Tunde Bakare, Tein Jack-Rich and Chief Ikeobasi Mokelu had no vote.\nFormer Minister of Niger Delta Development, Senator Godswill Akpabio led the pack of the seven aspirants that stepped down for Asiwaju.\nOthers were Ekiti Governor Kayode Fayemi; Jigawa Governor Abubakar Badaru; former Imo Governor Senator Ibikunle Amosun, former Speaker of the House of Representatives, Dimeji Bankole and Senator Ajayi Boroffice.\nFormer Senate President, Senator Ken Nnamani had withdrawn from the race before the convention."
  },
  {
    "headline": "BREAKING: Tinubu scores highest votes at APC presidential primary",
    "summarized_story": "National Leader of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has scored the highest votes at the ongoing presidential primary of the party in Abuja.\nHe polled 1, 271 votes to defeat others after collation and counting of the accreditation votes at the primary.\nOthers scored:David Umahi- 38Tunde Bakare-0Ahmed Rufai Sani-4Rotimi Amaechi- 316Emeka Nwajuba-1Rochas Okorocha-0Yahaya Bello-47Tien Jack Rich-0Ogbonnaya Onu-1Lawan-152Ben Ayade-37Yemi Osinbajo – 235Ikeobasi Mokelu: 0"
  },
  {
    "headline": "I'm most qualified of all candidates, says Amaechi",
    "summarized_story": "Immediate Past Minister of Transportation Rotimi Amaechi has claimed he is the most qualified aspirant to fly the flag of the All Progressives Congress (APC) in the 2023 elections.\nI was elected Speaker of the Rivers State House of Assembly and I served for two terms.\nWhile serving as a speaker, I was the Chairman of the State Speakers of Nigeria twice.\n“Your Excellency, by your grace and the Grace of God, you appointed the Ministry for Transportation; again, I served twice.\nYour Excellency, you appointed me the Director General of your campaign, and again I served twice."
  },
  {
    "headline": "Labour reports Nigeria’s alleged anti workers’ stance against ASUU to ILO",
    "summarized_story": "From Bimbola Oyesola, Geneva, SwitzerlandOrganised Labour in Nigeria, yesterday, officially reported the Federal Government’s anti-workers activities against the Academic Staff Union of Universities (ASUU) to the International Labour Organisation (ILO).\nPresident of the Nigeria Labour Congress (NLC), Ayuba Wabba, who addressed the plenary of the 110th Session of the International Labour Conference (ILC) in Geneva, Switzerland complained about the growing resistance to workers freedom.\n“In Nigeria, workers in our universities, both academic and non-academic have been on strike for more than two months because of non-implementation of collective bargaining agreement.\nAlso for us as a labour centre, strike is always the last option when other avenues have failed.\nAccording to him, this tripartite structure has completed the process of reviewing of the nation’s five Labour laws."
  },
  {
    "headline": "WASSCE 2022: WAEC expresses concern over activities of rogue website",
    "summarized_story": "By Gabriel DikeThe West African Examinations Council (WAEC), yesterday, expressed concern over the activities of rogue website operators in the ongoing May/June 2022 West African Senior School Certificate Examination (WASSCE).\nThe council in a statement signed by its acting Public Affairs Officer, Mrs. Moyosola Adeyegbe, condemned candidates and parents for patronising rogue website operators.\nAdeyegbe drew the attention of stakeholders and the public to the unwholesome activities perpetrated by unscrupulous elements in the conduct of the 2022 WASSCE.\nUnfortunately, some candidates have fallen prey to the ‘trash’ being served on these rogue platforms.\nThe council appeals to all concerned to disregard these rogue website operators and their various platforms and join WAEC in the fight against examination malpractice."
  },
  {
    "headline": "UBA redeems USD500m 5-year Eurobond",
    "summarized_story": "The United Bank for Africa (UBA) on Wednesday, redeemed its debut $500 million 5-year Eurobond notes with the maturity date of June 8, 2022.\nAs part of UBA’s liability management strategies, In November 2021, the bank repurchased $310.9 million of the notes through a cash tender offer.\nUpon maturity of the Eurobond, the outstanding portion of $189.1 million and the coupon of $7.3 million were redeemed by the bank.\n“The development is a testament to UBA’s robust and prudent liquidity management strategies, coupled with a very strong and diversified asset and liability management process.\nThis, in spite of macroeconomic headwinds underpinned by FX illiquidity, double-digit inflation and currency devaluation,” said Kennedy Uzoka, GMD/CEO of UBA."
  },
  {
    "headline": "INEC solicits Air Force support for Ekiti, Osun elections",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) has solicited the support of the Air Force in the delivery of election materials for Ekiti and Osun states governorship elections.\nIts chairman, Mahmood Yakubu, made the plea during a courtesy call on the Chief of Nigerian Air Force at the headquarters in Abuja, yesterday.\nHe also thanked the Air Force for the neutrality of their personnel whenever called upon to assist in the conduct of elections.\nHowever, the Ekiti State governorship election is holding in the next 10 days on Saturday 18th June 2022 while the Osun governorship election holds in 38 days on Saturday 16th July 2022.\n“It is obvious that in handling such a huge national assignment, the Commission cannot do it alone."
  },
  {
    "headline": "Kajuru attack: Death toll rises to 32",
    "summarized_story": "From Noah Ebije, KadunaFollowing attack allegedly by terrorists penultimate Sunday on communities of Ungwan Gamu, Dogon Noma, Ungwan Sarki and Maikori villages near Maro in Kajuru local government area of Kaduna State, the death toll on Wednesday rose to 32.\nEarlier reports on Sunday said 25 persons were killed by terrorists who stormed the communities in broad daylight.\nHowever, a statement on Wednesday by the National President of Adara Development Association (ADA), Mr. Awemi Dio Maisamari said,“The death toll this morning (Wednesday) is 32 as villagers comb sorrounding bushes for more corpses.\n“The attack started around 12noon and lasted until around 6pm unchallenged by the state.\nAs a result of the attack, 25 persons, mostly men were killed."
  },
  {
    "headline": "Breaking: Tinubu is APC’s Presidential Candidate",
    "summarized_story": "Former Governor of Lagos State, Asiwaju Bola Ahmed Tinubu, has emerged as the presidential candidate of the ruling All Progressives Congress in the 2023 general election.Tinubu polled 1,271 votes to defeat his closest rival former Transport Minister Rotimi Amaechi.\nwho polled 316 votes.Vice President Yemi Osinbajo came third with 235 votes.The Senate President, Ahmad Lawan, scored 152 votes while Governor Ben Ayade of Cross River, Governor Yahaya Bello of Kogi, Governor David Umahi of Ebonyi, former Minister Ogbonaya Onu, Senator Sani Yerima, former Minister Emeka Nwajiuba scored 37, 47, 38, 1, 4 and 1 votes respectively.Pastor Tunde Bakare, Mr. Tein Jack Rich, Mr. Ikeobasi Mokelu, Mr Nicholas Nwagbo and former Govenor Rochas Okorocha scored no vote.The presidential primary which began on Tuesday was concluded on Wednesday with the declaration of Tinubu as the winner.Tinubu’s victory was preceded by the decision of some of the aspirants to step down for him before the commencement of voting.Those, who stepped down for Tinubu were former Minister for Niger Delta Affairs, Senator Godswill Akpabio; former governor of Ogun State, Senator Ibikunle Amosun; Ekiti State Governor, Dr. Kayode Fayemi; Governor of Jigawa State, Abubakar Badaru; former Speaker of House of Representatives, Hon.\nDimeji Bankole; Senator Ajayi Boroffice and the only female aspirant, Uju Ohanenye.Tinubu’s emergence as the ruling party’s candidate has now set the ground for a fierce contest in 2023 between him and candidate of the major opposition party, PDP’s Atiku Abubakar, and candidates of other parties.\nMore details shortly…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2022 APC Presidential Primary Result",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "At APC Convention, THISDAY Projects Tinubu Winner",
    "summarized_story": "According to exit polls, Tinubu is likely to win most North-west, most South-west, some North-central and doing well in other places.\nBut President Muhammadu Buhari, who spoke before voting commenced, enjoined the delegates to vote the candidate with the best chance of emerging victorious at the general election.\nHis words: ”As we go into the presidential primary, I urge all to keep to the same spirit.\nPeter said, “Although the TCA is not biased towards any presidential aspirant contesting to be the presidential flag bearer of the All Progressives Congress (APC).\nWe, however, owe it to the party and party members to guide them in terms of direction ahead of the National Convention."
  },
  {
    "headline": "UN to Nigeria: Bring Perpetrators of Owo Catholic Church Attack to Justice",
    "summarized_story": "A statement from the UN secretary-general quoted him as condemning attacks on places of worship as abhorrent, while urging the Nigerian authorities to spare no effort in bringing the perpetrators of the Owo attack to justice.\nUK Parliament Debates Massacre, Decries Rising Insecurity in NigeriaThe UK Parliament considered the bloody attack in Owo a matter of urgent international importance.\nThe High Commission in Nigeria has also expressed our condolences to the governor of Ondo State and offered our support.\nWe will remain available for any additional support as Ondo State might require to deal with this difficult situation.\n“We commiserate with the families of the victims, the Olowo of Owo, Ondo State government, and the entire Nigerians on the demise of these worshippers and citizens of our nation."
  },
  {
    "headline": "Live Updates: APC Presidential Primary 2022",
    "summarized_story": "Osinbajo spoke ahead of the voting by delegates at the Presidential Primary holding at the Eagles Square in Abuja.\n9:23PMTinubu: I’m the Man the Moment Calls ForAdedayo AkinwaleAll Progressives Congress (APC) presidential aspirant, Senator Bola Tinubu, has said that the ruling party must emerge from the convention as a unified party.\n7:41PMAPC Primary: Delegates Seek Free, Fair, Credible PollDelegates at the All Progressives Congress (APC) primary for the presidential election Tuesday called on the party to provide a level playing field for all aspirants.\n“I am also here to support my party APC and by God’s grace in 2023 APC will win the general election.\n(NAN)7:40PMAisha Buhari, Osinbajo, Lawan ArriveDeji Elumoye in Abuja-First Lady, Aisha Buhari Arrived APC Convention Ground at 7.15pm-Senate President and APC presidential aspirant, Dr Ahmad Lawan, arrived and moved round the stands waving to delegates at 7.20pm- Vice President and APC presidential aspirant, Prof Yemi Osinbajo, arrived at 7.25pm and also moved round to greet delegates."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "Corruption Allegations Against Tinubu Linger As 70-year-old Ex-Lagos Governor Becomes Ruling APC Presidential Candidate",
    "summarized_story": "Former Rivers State Governor, Rotimi Amaechi trailed with 316 votes, while Vice President Yemi Osinbajo garnered 235 votes.\nThe United States of America, by its attorney, Michael J. Shepard, United States Attorney for Northern District of Illinois, for its verified complaint of forfeiture, stated that “Beginning as early as 1998, Adegboyega Mueez Akande, with others operated an organisation which distributed white heroin, a controlled substance under Title 21 of the United States Code.\nOther fronts used by Tinubu, according to the former Alpha Beta boss, are Olumide Ogunmola and Tunde Badejo.\nHe also revealed how Tinubu used the Osun State governor, Adegboyega Oyetola, as a front for the establishment of the firm.\nHowever, both Tinubu and Alpha Beta denied the allegations."
  },
  {
    "headline": "APC Presidential Ticket: Tinubu Scores 1271, Amaechi, 316, Osinbajo 235, Other Scores By Aspirants",
    "summarized_story": "A former Lagos State Governor, Bola Tinubu, has won the All Progressives Congress Presidential Primary elections.\nTinubu polled 1271 votes to beat his major opponents, former minister and former Rivers State Governor, Rotimi Amaechi who polled 316 while Vice President, Yemi Osinbajo, had 235 votes.\nSenate President, Ahmed Lawani polled 152 votes and Kogi State Governor, Yahaya Bello polled 47 votes.\nGovernor David Umahi of Ebonyi State polled 38 votes while his Cross River counterpart, Ben Ayade polled 37 votes.\nFormer Imo State Governor, Rochas Okorocha also got no votes."
  },
  {
    "headline": "APC Presidential Ticket: Tinubu Scores 1271, Amaechi, 316, Osinbajo 235, Other Scores By Aspirants",
    "summarized_story": "A former Lagos State Governor, Bola Tinubu, has won the All Progressives Congress Presidential Primary elections.\nTinubu polled 1271 votes to beat his major opponents, former minister and former Rivers State Governor, Rotimi Amaechi who polled 316 while Vice President, Yemi Osinbajo, had 235 votes.\nSenate President, Ahmed Lawani polled 152 votes and Kogi State Governor, Yahaya Bello polled 47 votes.\nGovernor David Umahi of Ebonyi State polled 38 votes while his Cross River counterpart, Ben Ayade polled 37 votes.\nFormer Imo State Governor, Rochas Okorocha also got no votes."
  },
  {
    "headline": "London-based Management Consultant, Ogbodo Wins AAC Enugu Gov Ticket",
    "summarized_story": "A London-based Strategy & Management Consultant, Mr. Ray Ogbodo, Wednesday, emerged the winner in the governorship primary of the African Action Congress (AAC) ahead of the Enugu State 2023 governorship election.\nOgbodo was declared the winner of the election after scoring a total of 45 votes.\nHe said, \"Mr Ray Kene Ogbodo having scored the highest number of votes cast during the election, I, Lawrence Eziachi, AAC Enugu State Governorship Primary Election Committee Chairman, hereby declared him the winner of the AAC governorship ticket and he is hereby returned elected.\"\nHe described his major concern as the development of Enugu State and repositioning the state on the part of growth.\nOn health, Mr. Ogbodo promised to offer free medical care to citizens and ensure that people have a decent life as promised."
  },
  {
    "headline": "Marwa to NYSC: Make drug test compulsory for corps members",
    "summarized_story": "Mohamed Buba Marwa, chairman of the National Drug Law Enforcement Agency (NDLEA), says drug tests should be made compulsory for corps members across the country.\nAdvertisementMarwa spoke when he hosted Mohammed Fadah, the new director-general of the National Youth Service Corps (NYSC), and his team at the NDLEA headquarters in Abuja on Wednesday.\nAccording to him, making drug tests compulsory at the various NYSC orientation camps in the country would help boost ongoing efforts to tackle the menace of drug abuse.\n“There is the need for drug tests for our youth corps members as they report at the orientation camps.\nOnce they know there’ll be drug tests at the camps, they will abstain from it."
  },
  {
    "headline": "Keren Akpagher: Anti-rape group threatens to sue Gbaja over ‘delayed’ public hearing",
    "summarized_story": "An anti-rape coalition is threatening to sue Femi Gbajabiamilla, speaker of the house of representatives, over the delay in commencing the public hearing on the Keren Akpagher case.\nThe lower legislative chamber, in December 2021, also set up a panel for an investigative public hearing on the case.\nMen Against Rape Foundation (MARF), the non-profit organisation backing the bereaved family’s quest for justice, has served a pre-suit notice on Gbajabiamilla for not complying with the house’s resolution on a public hearing.\nMARF questioned what it described as a “disturbing and suspicious reluctance” of the house of representatives to enforce its own resolution to commence an investigative public hearing 180 days after opting to do so.\nAdvertisement“If they don’t awaken to their responsibility and duty, we shall file an action to seek an order of mandamus to compel them to conduct the investigative public hearing”, Ughegbe stated."
  },
  {
    "headline": "Teacher arrested in Lagos for ‘raping’ 16-year-old student",
    "summarized_story": "The police in Lagos have detained a school teacher over the alleged rape of a 16-year-old student.\nIt said the teacher, who coaches the student after school, was said to have had sex with the victim in February 2022.\nThe agency said the joint task force implementing the Lagos state child protection policy had visited the school.\n“The after-school lessons on the school premises were cancelled and the defendant moved the venue for the lessons to his relative’s home.\n“DSVA uses this medium to reiterate the state government’s zero-tolerance of all forms of child abuse,” the agency added."
  },
  {
    "headline": "‘Condom infection’: Court rejects FCT school’s request to halt probe of pupil’s death",
    "summarized_story": "An Abuja court has struck out an application by Premiere Academy Lugbe seeking to stop a probe of the circumstances that led to the alleged rape and death of Keren Akphagher, one of its students.\nA report issued to the family by Queen’s Hospital Abuja stated that decomposed condom particles and dead sperm were found in the girl’s vagina.\nThe house of representatives had also directed that a DNA test be conducted on the male staff at Keren’s school so as to fish out the culprit.\nAfter Keren’s death, Vivien Akphagher, her mother, had lodged a complaint at the Federal Competition and Consumer Protection Commission (FCCPC).\nBut on Friday, the Abuja federal high court struck the request to halt FCCPC’s investigation into the case."
  },
  {
    "headline": "Chaney Jones dispels Kanye West split rumour with ‘I love you, baby’ post",
    "summarized_story": "Kanye West, the US rapper, and Chaney Jones, his model partner, are reported to have broken up.\nWhile the rapper, who turned 45th on June 8, is yet to react to the rumours of their split, Jones appeared to have dismissed them.\nAdvertisementCelebrating Kanye’s birthday, Jones shared a TikTok montage of herself and the rapper on Instagram.\n“Happy birthday baby 🖤 I love youuuuu.”The rapper’s relationship with Jones became public in February — at about the same time he and Julia Fox, his former girlfriend, broke up.\nBeyond being a model, Jones doubles as a student and entrepreneur."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kenya wants to introduce a 20% tax for digital lenders",
    "summarized_story": "The Kenyan government has announced plans to introduce a 20% excise tax on all fees charged by all digital lenders.\nLike many other countries on and off the continent, Kenya’s digital lending space is rapidly growing.\nAt least 13% of Kenya’s population of 53.7 million people have taken digital loans from more than 120 digital lenders operating in the country.\nThe approval also subjected digital lenders to the Data Protection Act, which prevents them from violating users’ privacy through debt-shaming.\nThe proposed 20% tax could have unintended effects on the millions of Kenyans who use digital loan apps."
  },
  {
    "headline": "iOS 16, New MacBooks, Apple Pay later and other announcements at WWDC 2022",
    "summarized_story": "With iOS 16, Apple is ending software support for the devices released before the iPhone 8 (2017), which includes the iPhone 6S, iPhone 6S Plus, iPhone SE 2016, iPhone 7, and iPhone 7 Plus.\niOS 16 allows for more Lockscreen customization such as color and font changes, as well as support for widgets.\nUsers can choose which photos to share based on a certain start date, or via share photos face detection.\nApple Pay LaterSource: AppleBuy now, pay later services have been on the rise and Apple has decided it wants a part of the $22.86 billion market.\nThe company announced Apple Pay Later, a new feature for Apple Pay to let users pay for purchases in 4 installments over time without interest or any fees."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Tinubu wins APC presidential ticket",
    "summarized_story": "Bola Tinubu, emerged presidential candidate of the ruling party Wednesday after a night of politicking ahead of the February 2023 general elections.\nTinubu, a former governor of Lagos State and national leader of the APC contested against 22 others at the Ragle Square in the central business district of Abuja.\nHowever, the narrative changed last weekend when the Governors of the APC decided to zone the presidential ticket to Southern Nigeria, a decision which came amid debates in recent times on whose region the party’s presidential ticket should be zone to.\nTinubu is a Muslim who got married to Oluremi Tinubu, who is the current senator representing Lagos Central Senatorial District.\nHe is blessed with four children namely JideTinubu (now late), Oluwaseyi Tinubu, Folashade Tinubu (Iyaloja general), and Abibat Tinubu."
  },
  {
    "headline": "Tinubu wins APC presidential ticket",
    "summarized_story": "Bola Tinubu, emerged presidential candidate of the ruling party Wednesday after a night of politicking ahead of the February 2023 general elections.\nTinubu, a former governor of Lagos State and national leader of the APC contested against 22 others at the Ragle Square in the central business district of Abuja.\nHowever, the narrative changed last weekend when the Governors of the APC decided to zone the presidential ticket to Southern Nigeria, a decision which came amid debates in recent times on whose region the party’s presidential ticket should be zone to.\nTinubu is a Muslim who got married to Oluremi Tinubu, who is the current senator representing Lagos Central Senatorial District.\nHe is blessed with four children namely JideTinubu (now late), Oluwaseyi Tinubu, Folashade Tinubu (Iyaloja general), and Abibat Tinubu."
  },
  {
    "headline": "Gbajabiamila, Wase congratulate Tinubu for emerging APC presidential flagbearer",
    "summarized_story": "Femi Gbajabiamila, Speaker of the House of Representatives has congratulated Bola Tinubu for clinching the presidential ticket of the All Progressives Congress (APC) for 2023 general elections.\n“This is a victory for APC, a victory for its members and indeed a victory for Nigeria and its democracy,” Gbajabiamila said.\nThe speaker urged other aspirants at the just concluded primary to join hands and support the party’s presidential candidate.\nHe commended the aspirants for their conduct before, during and after the APC presidential primary.\nSimilarly, Ahmed Idris-Wase, Deputy Speaker of the House congratulated Tinubu on his emergence as the Presidential candidate of the APC."
  },
  {
    "headline": "Edo Police foil theft of N3.9trillion water pipes, arrest 8 impostors – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Operatives of the Edo State Police Command have foiled attempt to steal N3.9 trillion worth of pipes meant for Okpella water project in Etsako East Local Government Area of Edo State.\nThe Public Relations Officer for Edo State Police Command SP Chidi Nwanbuzor disclosed this while briefing journalists in Benin City, last Tuesday.\nTwo soft copies of the alleged forged documents made available to The OBSERVER newspaper have The Presidency letter head with reference numbers SGF/GSO/VOL III/163 and SGF/GSO/VOL III/172 dated February 24, 2022 and March 31, 2022, respectively.\nThe alleged forged documents stated.\nOne of the suspects, Salisu Alhaji Umar narrated how he forged documents in Abuja office and handed them over to Ibrahim Mohammed after he was appreciated with N500,000.00."
  },
  {
    "headline": "Ikpe Traditional Tittles Dispute And Oba of Benin Resolutions – Nigerian Observer",
    "summarized_story": "This is even as it was strange to the people the three positions (Enogie, Okao and Ohen) as there has never been any of these position or title in Ikpe Village.\nThis spanked up wide jubilations amongst the residents and indigenes of Ikpe Village right inside the palace of the revered Benin Monarch.\nThis traditional dispute has been on for a long time until recently when our great Oba resolved the dispute amicably.\n“We don’t indulge in any land grabbing or CDA activities in Ikpe Village.\n“Mind you, the decision to know and have all our boundaries demarcated was a collectively taken by the Odionwere, elders and the people."
  },
  {
    "headline": "Edo kicks off ‘Operation Plan Edo’ in Oghogobi Community on Thursday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Commissioner for Physical Planning, Urban and Regional Development, Isoken Omo, has said the Operation Plan Edo (OPE) team will begin operations in Oghogobi Community, Benin City, on Thursday.\nAccording to her, “We are extending the OPE project to Oghogobi community after an impressive exercise in Amagba, Ugbor and Ekai communities.\n“For the exercise, we need landlords in Oghogobi Community to present themselves for recertification and confirmation of their building plans and other approvals in line with extant laws in the state.\n“We plead for the cooperation of the residents as our officials visit their premises to check for their documents and serve notices.\nTheir support is necessary for a seamless exercise.”“The OPE is intended to ensure that buildings and developments across the state adhere to government regulations in line with the Edo Regional Development Plan and Benin Urban Master Plan,” the commissioner added."
  },
  {
    "headline": "Shaibu Gives Medical Assistance to Ailing Akoko-Edo lndegene – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.\nComrade Philip Shaibu,in his usual compassion to the needy,has offered medical assistance to Salami Abdulraman, an indigent, critically-ill indegene of Ikpeshi Community in Akoko-Edo Local Government Area of Edo State.\nSuccour came the way of the 17 years – old, when the Deputy Governor paid a condolence visit to a bereaved family in the neighborhood.\nThe boy’s mother who could not hide her feelings, bursted into tears in appreciation to the Deputy Governor for his kind gesture.\nAs at press time, the young Salami was being attended to by the medical team and he is responding positively to treatment."
  },
  {
    "headline": "Labour Party Crisis: Another faction elects Ezenwafor as candidate, after Peter Obi’s emergence",
    "summarized_story": "Jude Ezenwafor, a former chairman of the Labour Party (LP) in Anambra state, has been declared winner of a presidential primary organised by a faction of the party.\nThe development comes days after Peter Obi, former governor of Anambra, was elected as presidential candidate of the party at a primary organised in Delta state by the Julius Abure-led faction of the party.\nLabour Party will win the general election.\nOn his part, Okafor, factional chairman of the party, described the candidate as “a man of integrity”.\n“Having met all the requirements of the party, we hereby affirm you to be the presidential candidate of the Labour Party come 2023,” he said."
  },
  {
    "headline": "Why I didn’t attend APC Convention, By Emeka Nwajiuba",
    "summarized_story": "I am issuing this statement after a careful review of our campaign for the presidential ticket of the APC.\nFirst, I thank our Almighty God, creator, and giver of all things, for the gift of everything we are or have.\nI thank my Family, who have endured my incessant derision of their preference for a less public and risky, lifestyle.\nFollowing the failure of all these entreaties, it became clear that the convention was headed away from these lofty ideals I subscribe to and will still pursue.\nThese ideals reflected in what some of the southeast aspirants who choose to attend referred to in their pleas for Justice, or need to constitutionally require it, in the face of the absence of conscience."
  },
  {
    "headline": "JUST IN: Alex Otti clinches Labour Party governorship ticket in Abia",
    "summarized_story": "Dr. Alex Otti, ace economist and chieftain of the Labour Party in Abia State, has cliched the governorship ticket of the party.\nOtti, former bank CEO, polled a total number 454 votes to emerge unopposed during the governorship primary election of the party in Umuahia the state capital on Wednesday.\nIn his acceptance speech Otti, said that he was prepared to move Abia state from the era of bad governance to an era of prosperity.\nWe are the party the majority of people who deserves good leadership in the state are looking for.\n“The symbol of our party is human beings, I therefore urge to join me as we work hard to win the 2023 governorship election and make life easier for our people."
  },
  {
    "headline": "Kwankwaso emerges presidential candidate of NNPP",
    "summarized_story": "A former governor of Kano State, Rabiu Kwankwaso, has emerged as the presidential aspirant of the New Nigeria Peoples Party at the party’s presidential primary election on Wednesday.\nThe NNPP is currently holding its presidential primary election in the Velodrome of the Moshood Abiola Stadium, Abuja.\nKwankwaso emerged as the NNPP’s standard bearer after delegates made their choice known by voice vote.\nThe former governor who addressed party faithful after being declared candidate, noted that “NNPP stands for unity, peace and progress of the country”Flanked by Ibrahim Shekarau, also a former governor of Kano, Kwankwaso expressed confidence that the NNPP would win the 2023 presidential election.\nDetails later…"
  },
  {
    "headline": "Atiku, PDP governors meet behind closed doors after Tinubu’s victory",
    "summarized_story": "Alhaji Atiku Abubakar, the presidential candidate of the Peoples Democratic Party (PDP) for the 2023 general election, is currently holding a crucial meeting with governors of the party in Abuja.\nIt is understood that the choice of the running mate to Atiku Abubakar will top the agenda of the meeting.\nSome of the governors at the meeting were Bayelsa Governor, Douyi Diri, Bauchi Governor, Bala Muhammed, Rivers Nyesom Wike, and that of Benue, Samuel Ortom.\nOthers are Sokoto state Governor Aminu Tambuwal and his Oyo state counterpart Seyi Makinde.\nAtiku had taken to his twitter account to a announce that PDP governors visited him, while expressing optimism that the party will be united going into 2023."
  },
  {
    "headline": "2023: With Tinubu’s Emergence, Atiku Is Now ‘President In Waiting’ – Mahmood",
    "summarized_story": "The director-general of PDP New Generation, a Peoples Democratic Party (PDP) support group, Audu Mahmood, said that with the emergence of the Asiwaju Bola Ahmed Tinubu as the All Progressives Congress (APC) presidential candidate for the 2023 elections, his counterpart in the PDP, Atiku Abubakar, is now “President in waiting”.\n“Atiku Abubakar is a renowned transformational leader and a unifying force, needed at this trying moment of our nation-state.\n“It is public knowledge that Nigerians have decided to send APC packing and this is the signal for their farewell, with the emergence of Bola Tinubu.\n“The masses will remember that Nigeria is steeped in failure at every turn, courtesy of the ruining APC,” he said.\n“These, and many more demeaning statistics are the dividends of democracy from the ruining APC."
  },
  {
    "headline": "2023: With Tinubu’s Emergence, Atiku Is Now ‘President In Waiting’ – Mahmood",
    "summarized_story": "The director-general of PDP New Generation, a Peoples Democratic Party (PDP) support group, Audu Mahmood, said that with the emergence of the Asiwaju Bola Ahmed Tinubu as the All Progressives Congress (APC) presidential candidate for the 2023 elections, his counterpart in the PDP, Atiku Abubakar, is now “President in waiting”.\n“Atiku Abubakar is a renowned transformational leader and a unifying force, needed at this trying moment of our nation-state.\n“It is public knowledge that Nigerians have decided to send APC packing and this is the signal for their farewell, with the emergence of Bola Tinubu.\n“The masses will remember that Nigeria is steeped in failure at every turn, courtesy of the ruining APC,” he said.\n“These, and many more demeaning statistics are the dividends of democracy from the ruining APC."
  },
  {
    "headline": "Adamu To Tinubu: Your Victory Was Sterling, Confirms APC’s National Outlook",
    "summarized_story": "National chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, has congratulated the winner of the party’s presidential ticket for 2023 election, Asiwaju Bola Ahmed Tinubu, saying the latter recorded a victory, which confirmed APC’s nationalistic outlook.\nLEADERSHIP reports that Tinubu polled 1,271 votes at the just-concluded APC special national convention, where the presidential primary held, to defeat 22 other aspirants.\n“Your victory has vindicated our party’s nationalistic outlook and patriotic posture as the Party of choice for every Nigerian.\nI am pleased that the Party spoke with one voice when the delegates voted overwhelmingly to nominate you as our presidential candidate.\n“It is my sincere hope and prayer that our collaborative efforts between the Party’s National Secretariat and your Presidential campaign team will proceed with the shared expectations of victory at the 2023 general elections, by the grace of God,” Adamu wrote."
  },
  {
    "headline": "Adamu To Tinubu: Your Victory Was Sterling, Confirms APC’s National Outlook",
    "summarized_story": "National chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, has congratulated the winner of the party’s presidential ticket for 2023 election, Asiwaju Bola Ahmed Tinubu, saying the latter recorded a victory, which confirmed APC’s nationalistic outlook.\nLEADERSHIP reports that Tinubu polled 1,271 votes at the just-concluded APC special national convention, where the presidential primary held, to defeat 22 other aspirants.\n“Your victory has vindicated our party’s nationalistic outlook and patriotic posture as the Party of choice for every Nigerian.\nI am pleased that the Party spoke with one voice when the delegates voted overwhelmingly to nominate you as our presidential candidate.\n“It is my sincere hope and prayer that our collaborative efforts between the Party’s National Secretariat and your Presidential campaign team will proceed with the shared expectations of victory at the 2023 general elections, by the grace of God,” Adamu wrote."
  },
  {
    "headline": "2023: Ex-Minister, Nwajiuba, Accuses APC Of Dumping Consensus",
    "summarized_story": "Former Minister of State for Education and one of the presidential aspirants on the platform of the All Progressives Congress (APC), Mr Chukwuemeka Nwajiuba, has blamed his absence at the convention on abandonment of consensus approach in picking the party’s flag bearer for 2023.\nHe expressed disappointment that after he and almost all other aspirants agreed to a consensus approach to the selection of a presidential candidate, the party succumbed to handing over the party’s ticket to the highest bidder.\nADVERTISEMENTNwajiuba was conspicuously absent at the Eagle Square, Abuja, venue of the convention.\nAccording to him, he and other aspirants from the South East had expected the APC to extend the power shift not just to the South but specifically to the South East in the interest of equity, fairness and justice.\n“I choose to take the tedious path of following the law, meeting requirements and staying disciplined, in other to sell a paradigm of same."
  },
  {
    "headline": "Buhari: APC must unite behind Tinubu to achieve victory in 2023",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari has congratulated Asiwaju Bola Tinubu, the APC Presidential Flagbearer in the 2023 elections.\n“In this way, the APC will remain the party that can best deliver on the priorities of the Nigerian people.\n“We strongly believe that Bola Ahmed Tinubu will safeguard and improve on this democratic achievement and legacy.\n”He is the right candidate for Nigeria’s aspiration because he is the APC’s candidate and under the continued stewardship of our party.\n“I also thank the delegates for making the right decision leading to the emergence of our candidate, Asiwaju Bola Ahmed Tinubu.”"
  },
  {
    "headline": "Edo govt. suspends union activities in state-owned higher institutions",
    "summarized_story": "By Jethro IbilekeThe Edo State Government has suspended forthwith, all union activities across all state-owned tertiary institutions in the state.\n“Unions affected include ASUU, Non-Academic Staff Union of Educational and Associated Institutions (NASU), Senior Staff Association of Nigeria Universities (SSANU), Academic Staff Union of Polytechnics (ASUP), Non-Academic Staff Union of Polytechnics and all allied unions operating across all state-owned tertiary institutions.\n“By this notice, academic activities are to resume in all state-owned institutions and all cadre of staff are directed to report lo their duty posts immediately.\n“Students across all state-owned tertiary institutions are expected to resume for lectures as necessary measures have been taken to ensure resumption of academic and non-academic activities.\n“In Kogi State, there is no staff union and their academic calendar runs to favour the students; a four-year course is a four-year course."
  },
  {
    "headline": "How Bloc Votes From Northwest, Southwest Delegates Helped Tinubu Defeat Amaechi, Osibajo, Others",
    "summarized_story": "The overwhelming votes from the Northwest and Southwest delegates gave Asiwaju Bola Ahmed Tinubu the numbers to defeat Vice President Yemi Osinbajo, Rotimi Amaechi and others at the just concluded presidential primaries of the All Progressives Congress (APC), in Abuja.\nNews Direct learnt that 558 delegates from the Northwest gave bloc votes to Tinubu, just like their 411 counterparts from the Southwest.\nGoing by the regional and state allotment of APC delegates, it became clear that Northwest and Southwest geopolitical zones hold the decider, which they did by voting Tinubu.\nBelow Is The List Of Delegates On A Regional Basis:North-West: 558Kano – 132Katsina – 102Jigawa – 81Kaduna – 69Sokoto – 69Kebbi – 63Zamfara – 42.\nSouth-West: 411Oyo – 99Osun – 90Ogun – 60Lagos – 60Ondo – 54Ekiti – 48South-South: 372Akwa Ibom – 93Delta – 75Rivers – 69Edo – 57Cross River – 54Bayelsa – 24North-Central: 360Niger – 75Benue – 66Kogi – 63Plateau – 51Kwara – 48Nasarawa – 39Abuja – 18North-East: 336Borno – 81Adamawa – 63Bauchi – 60Yobe – 51Taraba – 48Gombe – 33South-East: 285Imo – 81Anambra – 63Abia – 51Enugu – 51Ebonyi – 39"
  },
  {
    "headline": "BREAKING: Atiku In Closed-Door Meeting With PDP Governors To Discuss Running Mate, Others After Tinubu Clinched APC Presidential Ticket",
    "summarized_story": "BREAKING: Atiku In Closed-Door Meeting With PDP Governors To Discuss Running Mate, Others After Tinubu Clinched APC Presidential TicketFormer vice president and presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar is currently having a closed-door meeting with governors of the party in Abuja.\nSources close to the governor of Adamawa State, Ahmadu Umaru Fintiri, told SaharaReporters that the critical stakeholders meeting would likely come up with a running mate for Abubakar.\n“I guess a running mate would top the agenda.\nHe further hinted that the constitution of the Atiku Presidential Campaign Council was also in the offing.\nOthers are Sokoto State Governor, Aminu Tambuwal and his Oyo State counterpart, Seyi Makinde."
  },
  {
    "headline": "BREAKING: Kwankwaso Emerges as NNPP Presidential Candidate",
    "summarized_story": "Former Kano State Governor, Rabi’u Musa Kwankwaso has been declared the presidential candidate of the opposition party, New Nigeria Peoples Party (NNPP).\nRecall that the pioneer National Chairman of the NNPP, Boniface Aniegbonam, had said that Kwankwaso was the party’s only presidential candidate for the 2023 general elections at a press conference in Lagos last Friday.\nKwankwaso was the Governor of Kano State from 1999 to 2003 and 2011 to 2015.\nAfter he lost his re-election in 2003, he was appointed the first Minister of Defence of the Fourth Republic with no prior military background from 2003 to 2007, under the administration of former President Olusegun Obasanjo.\nHe was later elected to the Senate in 2015, serving one term under the platform of the All Progressives Congress (APC), representing Kano Central Senatorial District."
  },
  {
    "headline": "I Didn’t Expect To Win — Tinubu",
    "summarized_story": "Bola Tinubu, the All Progressives Congress’ presidential candidate, has urged his opponents to join him in defeating the Peoples Democratic Party in the February 2023 presidential election.\nThis was said by Tinubu during his winning address at Eagle Square, where the APC primary was held.\nTinubu congratulated his supporters and delegates, emphasizing that he had no ill will toward anyone who did not vote for him.\nThey are the agent of poverty, terror and lying.”He said, “Those who didn’t support me have nothing to fear.\nI didn’t expect to win but I won."
  },
  {
    "headline": "#Live: Tinubu leads Amaechi, Osinbajo, others with wide margin in APC presidential primaries *See results",
    "summarized_story": "Former governor of Lagos state Asiwaju Ahmed Tinubu is leading comfortably as vote count continues in the ongoing All Progressives Congress (APC) presidential primary election at Eagles square Abuja.\nAs at 11:50am, available result (not yet announced by the party’s electoral committee), Tinubu polled 1070 votes, followed by former Transport Minister Rotimi Amaechi 238.\nVice President Yemi Osinbajo who had stormed out of the venue has 177, Senate President Ahmad Lwan 102, Kogi state governor Yahaya Bello 25, his Ebonyi state counterpart Dave Umahi 20, Cross River state governor Ben Ayade 21, Ahmed Sani 2, Sani Yerima .\nVotes were still being counted as at the time of filling this report.\nShare this: TwitterFacebook"
  },
  {
    "headline": "#Live: Watch as APC presidential primary enters day 2 (VIDEO)",
    "summarized_story": "The ruling All Progressives Congress (APC) presidential primary election delegates have cast their votes, as party faithful across borders await results.\nWatch video below.\nShare this: TwitterFacebook"
  },
  {
    "headline": "FirstMobile App: Promoting safe, convenient mobile banking experience",
    "summarized_story": "First Bank of Nigeria Limited has continued to upgrade its FirstMobile App, its industry-leading mobile banking application.\nFirstBank’s FirstMobile ApplicationFirstMobile banking App is another version of the First Bank internet banking accessible by customers with smart devices like smart phone.\nFeaturesThe bank also announced the upgrade of its mobile banking application with new and improved features to promote safe and convenient Mobile Banking experience for customers.\nGlobal recognitionFirstMobile, the First Bank mobile banking application, has retained its leading position in the industry.\nThe bank won the 2020 Best Mobile Banking App award in the Global Finance Best Digital Bank Awards 2020."
  },
  {
    "headline": "NMGS carries out investigations into gas emission, flare at Emene Enugu",
    "summarized_story": "By Palma IleyeNigerian Mining and Geosciences Society, NMGS, has said that its team of professionals have carried out an investigation into the gas emission and flare encountered during the drilling of a water borehole at Caritas University Amorji Nike, Emene Enugu, Enugu State.\nHe pointed out that the initial speculation that the flare was methane gas from fracking of the mature and fractured Nkporo/Enugu Formation is discountenanced due to the sustained flare that has maintained its intensity for over 7 days.\n“Drilling a relief well to kill the pressure and kill the flare may not be feasible because the subsurface geology and structure of the area are not understood.\n“Professional bodies like the NMGS with highly experienced and well-trained geoscientists should be involved in efforts by agencies of government and other organizations to find solutions to this hazard and further investigate the gas resources of the area.\n“If the gas resource in the area is found to be substantial, the federal government and Enugu State Government should develop a framework to harness the gas resources to enhance industrialization and job creation for the benefit of the state and the nation,” he continued."
  },
  {
    "headline": "Nigeria spent $13m on bitumen importation in 2020- NMCO",
    "summarized_story": "By Palma IleyeDirector General Nigeria Mining Cadastral Office, NMCO, Engr Simon Obadiah Nkom has said that Nigeria spent $13 million on bitumen importaton in 2020.\n“This shows that there will be rise in the value of bitumen market by 2027 which is why Nigeria should look into bitumen exploration that will bring development to the country.\nNkom stressed that Nigeria was ranked 6th in global bitumen deposit as demand for the mineral in Nigeria is high due to high road construction.\nMeanwhile, the total value of capital importation into Nigeria in Q1 2022 stood at US$1,573.14 million from US$2,187.63 million in the preceding quarter, the National Bureau of Statistics has said.\nWhen compared to the corresponding quarter of 2021, capital importation decreased by 17.46 per cent from US$1,905.89 million."
  },
  {
    "headline": "Quality geoscience data brought more investors into the mining sector- Garba",
    "summarized_story": "By Palma IleyeDirector General, Nigerian Geological Survey Agency, NGSA, Dr Abdulrazaq Garba, has said that there has been an influx of investors because of the quality of geoscience data the agency had generated.\n“Another advantage of Nigeria lithium is hard rock lithium found and that is what investors are looking out for worldwide.\nNIMEP is a hallmark project that provides reliable geo-sciences information needed by investors to make the right mining investment decisions in Nigeria.\nGarba said that many companies both local and international investors are interested in the data set generated.\nGarba said that the government had invested funds in generating Geoscience data for those minerals to enable investors have adequate knowledge about them."
  },
  {
    "headline": "Nigeria records N1.2trn in trade surplus in Q1 2022",
    "summarized_story": "Latest data released by the National Bureau of Statistics (NBS) has shown that Nigeria recorded N1.2 trillion trade surplus in the first three months of 2022.\nThe data is contained in report by the NBS titled: ‘Foreign trade in goods statistics (Q1 2022)’.\nIn the first quarter of 2022, Nigeria’s total trade stood at N13 trillion, this was higher than the value recorded in the fourth quarter of 2021 (N11.7 trillion) and the value recorded in the corresponding period of 2021, which stood at N7.86 trillion.\n“Total Exports were N7.1 trillion of which re-exports stood at N115.80 billion, while total imports stood at N5.90 trillion,” the report reads.\nMeanwhile, most goods were exported to India (1.18 trillion), Spain (N677.69 billion), the Netherlands (N660.59 billion), Indonesia (N474.41 billion), and the United States (N372.73 billion)."
  },
  {
    "headline": "NCAA gives Nigeria Air its Transport License",
    "summarized_story": "By Naomi DouglasCivil Aviation Authority NCAA, on Monday, presented the Air Transport License ATL to the interim management of Nigeria Air.\nThe new national airline is expected to provide scheduled and non-scheduled services.\nNigeria Air Limited, the country’s proposed national carrier had in April 2022 applied to the NCAA for a license to operate scheduled and non-scheduled passenger and cargo service.\nIt wrote: “Presentation of Airline Transport Licence ATL to Interim Board of Nigeria Air.\nNigeria Air is here and is going to provide quality service to Nigerians."
  },
  {
    "headline": "APC Must Unite Behind Tinubu – Buhari",
    "summarized_story": "President Muhammadu Buhari on Wednesday asked the All Progressives Congress to unite behind its presidential flagbearer in the 2023 elections, Bola Ahmed Tinubu.\n“In this way, the APC will remain the party that can best deliver on the priorities of the Nigerian people.\n“We strongly believe that Bola Ahmed Tinubu will safeguard and improve on this democratic achievement and legacy.\nHe is the right candidate for Nigeria’s aspiration because he is the APC’s candidate and under the continued stewardship of our party.\n“I also thank the delegates for making the right decision leading to the emergence of our candidate, Asiwaju Bola Ahmed Tinubu.”"
  },
  {
    "headline": "Tinubu Beats Osinbajo, Amaechi, 11 Others To Win APC Presidential Primary",
    "summarized_story": "Former Lagos State Governor, Bola Ahmed Tinubu, took a major step toward his ambition of becoming Nigeria’s President by winning the All Progressives Congress’ presidential primary at a special convention held in Eagle Square, Abuja.\nOsinbajo, Lawan, and Governor Yahaya Bello of Kogi State came behind the duo with 235, 152, and 47 votes respectively.\nRather than solicit votes for himself, he endorsed Tinubu and appealed to delegates to vote for the APC chieftain.\nBut I have stepped down for Bola Ahmed Tinubu.\nI am stepping down for Bola Ahmed Tinubu."
  },
  {
    "headline": "Atiku Meets PDP Governors After Tinubu’s Emergence As APC Presidential Candidate",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar on Wednesday met with governors of the main opposition party in Abuja.\nThis is coming shortly after the emergence of former Lagos State Governor, Bola Tinubu as the presidential candidate of the ruling All Progressives Congress (APC) in the 2023 general elections.\nIt is the first time Abubakar will be meeting with the PDP Governors’ Forum after the party’s presidential primary.\nAfter the meeting ended, the PDP presidential candidate declined to speak to journalists about the outcome of the meeting.\nMeanwhile, the PDP governors have resumed their meetings behind closed doors."
  },
  {
    "headline": "2023: Ado-Ibrahim Emerges YPP Presidential Candidate",
    "summarized_story": "﻿Mr Malik Ado-Ibrahim has emerged as the 2023 presidential candidate of the Young Progressives Party (YPP).\nHe polled 66 votes to beat his rival, Ruby Isaac-Chinenye at the party’s presidential primary in Abuja.\nIn his acceptance speech, he promised to address the country’s security challenges, create jobs and revamp the economy if elected to office in 2023.\nREAD ALSO: PDP Says Tinubu Is No Match For Atiku“We have minds that are young,” Ado-Ibrahim said.\nWe will show you how to be progressive, how to use technology to make this country better."
  },
  {
    "headline": "Labour Party Faction Elects Ezenwafor As Presidential Flagbearer",
    "summarized_story": "The crisis rocking Labour party appears to be festering as a faction of the party led by Mr Calistus Okafor has held its National Convention to elect Ambassador Jude Ezenwafor as its presidential flagbearer.\nIn his acceptance speech, the presidential candidate of the Okafor-led faction pledged to rescue Nigeria.\nLabour party is going for a rescue mission,” Ezenwafor said.\nWith the deadline set by the Independent National Electoral Commission for the election of presidential candidates looming, the Labour party appears divided on who will be the party’s flagbearer.\nMr Peter Obi is the candidate of the INEC-recognised Julius Abure-led faction."
  },
  {
    "headline": "2023: Lawan, Gbajabiamila, Atiku, others congratulate Asiwaju on victory as APC flagbearer",
    "summarized_story": "Messages of congratulations have been pouring in for the All Progressives Congress Presidential candidate Asiwaju Bola Tinubu.\nThe Senate President, Ahmad Lawan, who was also a candidate, congratulated Asiwaju Tinubu.\nHe said “Your victory has assured the party of victory in the 2023 presidential election”.\nThe Speaker of the House of Representatives, Femi Gbajabiamila, joined other well-wishers in congratulating Asiwaju Bola Ahmed Tinubu on securing the All Progressives Congress presidential ticket for next year’s general elections.\nGovernor of Kano state, Abdullahi Ganduje also congratulated Asiwaju Bola Ahmed Tinubu on his victory in the All Progressives Congress presidential primary election."
  },
  {
    "headline": "Full text: Asiwaju's speech at the APC Special Presidential Convention",
    "summarized_story": "Because of your democratic exertion, this convention shall be recorded as a shining moment in the evolution of our party and the life of our nation.\nAnd I humbly accept the nomination of this convention to be the presidential candidate of our enlightened, humanitarian and great party, the All Progressives Congress.\nI must say a special word of thanks to the seven aspirants [Alhaji Badaru Abubakar; Sen.; Ibikunle Amosun; Sen. Ajayi Borrofice; Rt.\nOur better, more progressive vision of Nigeria shall secure a better society for all Nigerians.\nLet nothing stand in the way of our achieving a more just society and a greater Nigeria.https://www.tvcnews.tv/2022/06/ganduje-congratulates-asiwaju-as-apc-flagbearer-commends-other-aspirants-for-sportsmanship/God bless the APC."
  },
  {
    "headline": "Ganduje congratulates Asiwaju as APC Flagbearer, commends other aspirants for Sportsmanship",
    "summarized_story": "Kano state governor, Abdullahi Ganduje has congratulated Asiwaju Bola Ahmed Tinubu on his victory at the All Progressives Congress presidential primary election.\nIn a congratulatory message he personally signed, the governor said the emergence of Tinubu as flagbearer of the APC in the 2023 general election would be a victory for the Nigeria project.\nHe said the Jagaban has the capacity to provide the needed leadership that would consolidate and continue to ensuring the country’s democratic gains.\nHe also called on Tinubu as party leader to bring his political and socio-economic experience to bear on party leadership and members to close ranks and work for its victory in the forthcoming election.\nGanduje equally charged all party members to remain United and focused as the party march with Nigerians to victory in 2023."
  },
  {
    "headline": "Gov Bello congratulates Tinubu over APC Presidential primary victory",
    "summarized_story": "Governor of Niger state and Chairman of the North Central States Governors Forum (NCSGF), has congratulated Ahmed Bola Tinubu, the former Lagos State Governor, on his election as the All Progressives Congress (APC) Presidential Standard Bearer.\nTinubu, the APC’s National Leader, was elected at the party’s recently concluded Special National Convention, which was held on Tuesday, June 7, 2022, at Eagle Square in Abuja.\nIn a congratulatory message, the Governor said Tinubu’s selection over other qualified candidates reflects the party’s teeming delegates across the country.\nGovernor Sani Bello urged fellow presidential aspirants, leaders, stakeholders, and APC members to rally behind the party’s standard bearer and work tirelessly to return the party to power at all levels in the 2023 general elections.\nHe expressed gratitude to President Muhammadu Buhari for ensuring that the APC Presidential primary election became a source of consensus rather than division stressing that his guidance has been inspirational to the party."
  },
  {
    "headline": "Nigeria: Tinubu Wins APC Presidential Ticket for 2023 Election with 1,271 Votes; Ameachi 316, Osinbajo 235",
    "summarized_story": "Former Lagos Governor Asiwaju Bola Ahmed Tinubu has emerged the flag bearer of Nigeria’s governing party, the All Progressives Congress.\nTinubu received votes from the party delegates in the indirect election held at the Eagle Square in Abuja.\nThe presidential primary went to a vote after efforts by the party heirachy to select a consensus candidate failed, despite negotiations on different levels.\nTinubu and the APC will have Atiku Abubakar ofthe People’s Democratic Party to contend with in next Februasy’s general elections.\nFULL RESULTSRESULTS OF APC PRESIDENTIAL PRIMARYBola Ahmed Tinubu – 1,271Rotimi Amaechi – 316Yemi Osinbajo – 235Ahmad Lawan – 152Yahaya Bello – 47Dave Umahi – 38Ben Ayade – 37Senator Rufai Sani Yerima – 4Ogbonnaya Onu – 1Emeka Nwajiuba – 1Rochas Okorocha – 0Tein Jack-Rich – 0Tunde Bakare – 0Ikeobasi Mokelu – 0Voided votes: 13TOTAL: 2,115Details Later…"
  },
  {
    "headline": "After Fayemi, Akpabio, Amosun, 4 Others Step Down, Tinubu Projected to Win APC Presidential Ticket – Arise News",
    "summarized_story": "According to exit polls, Tinubu is likely to win most votes in the North-west, South-west, some North-central and doing well in other places.\nHis words: ”As we go into the presidential primary, I urge all to keep to the same spirit.\nTo ensure a hitch-free presidential primary, please, let us work collectively in the interest of our great party and our great country,” he said.\nPeter said, “Although the TCA is not biased towards any presidential aspirant contesting to be the presidential flag bearer of the All Progressives Congress (APC).\nWe, however, owe it to the party and party members to guide them in terms of direction ahead of the National Convention."
  },
  {
    "headline": "Nigeria, Others Losing $95bn in Productivity Due to Unsafe Food Intake",
    "summarized_story": "“Unsafe food hinders development especially on low and middle Income economies which lose around $95 billion in productivity associated with illness, disability and premature death suffered by workers,” he said.\nSpeaking on the diseases resulting from in-take of contaminated food, Ehanire said over 200 diseases were caused by unsafe food consumption.\n“Unsafe food causes one in every six deaths from diarrhea, a major killer of children of the age group,” he said.\nHe said the World Food Safety Day provided an opportunity to raise awareness about the dangers of unsafe food, government, producers, handlers and consumers having a role to play in making food safe.\nShe added that they should support policy measures and legal frameworks to strengthen the national food safety system and ensure it complies with food safety standards and regulations."
  },
  {
    "headline": "UN Secretary-General Calls on Nigerian Government to Bring Perpetrators of Owo Attack to Justice",
    "summarized_story": "The Secretary-General of the United Nations, António Guterres has condemned Sunday attack of St. Francis Catholic Church in Owo, Ondo State where over 50 persons were reported to have been killed, calling on the Nigerian government to bring the perpetrators to justice.\nA statement by his spokesperson, Stéphane Dujarric read that the Secretary General condemned the heinous attack.\nDujarric said the Secretary-General emphasized that attacks on places of worship are abhorrent, while urgingthe Nigerian authorities to spare no effort in bringing the perpetrators to justice.\nAccording to her, the Secretary-General extended his heartfelt condolences to the families of the victims and wishes a speedy recovery to the injured, and also expressed his sympathies to, and solidarity with, the Government and people of Nigeria."
  },
  {
    "headline": "APC Presidential Ticket: Fayemi, Amosun, Akpabio Step Down for Bola Tinubu",
    "summarized_story": "Governors’ Chairman and Ekiti State Governor Kayode Fayemi, former Governor of Ogun State Senator Ibikunle Amosun, and former Governor of Akwa Ibom, Senator Godswill Akpabio have all stepped down their ambition for former Lagos State Governor, Asiwaju Bola Tinubu.\nThey all urged their supporters to vote for Tinubu ahead of delegates voting.\nDetails Later."
  }
]