[
  {
    "headline": "Ogun community fumes over monarch’s land grabber appellation",
    "summarized_story": "The Iraniken community members in the Sagamu Local Government Area of Ogun State has warned the Ewusi of Makun community, Oba Timothy Akinsanya, to stop accusing their monarch, the Oniranikin of Iraniken, Oba Adewale Adeniji, of being a land grabber.\nThere is a six-month old dispute between Makun and Iraniken communities over a family’s disputed land at Oke-rala village via Simawa in the Sagamu LGA.\nThe Aremo-Oba-elect of the Iraniken community, Bolanle Akinyemi, during a press briefing on Saturday disclosed that the disputed land belonged to the Oso-Edu family, to which Oba Adeniji belongs.\nThe court has proclaimed that the land belongs to the family of Oba Oniraniken.\nThe land is a family land not a communal land."
  },
  {
    "headline": "South-East ready to beg for presidency – Ayim, Ezeife",
    "summarized_story": "A former Secretary to the Government of the Federation, Anyim Pius Anyim, and Chukwuemeka Ezeife, an ex- governor of Anambra State, has said that the South-East was ready to beg in order to clinch the presidential seat in 2023.\nAccording to the News Agency of Nigeria, Anyim said it was neither a right nor was it legal for the southeast to demand presidency.\nHe said, “Is it right for the South-East to produce the next president?\nCorroborating Ayim, Ezeife said that one of the ways to get into power was for the South-Easterners to beg every other region for the presidential seat for 2023.\nEzeife stated, “So I found Hausa, Yoruba, Igbo and other groups in this place talking about the need for federal character."
  },
  {
    "headline": "60% of Nigeria’s valuable forest lost, rest under threat – National Park Boss",
    "summarized_story": "The Conservator-General, National Park Service, Dr Ibrahim Goni, says 60 per cent of the country’s valuable forest estate has been lost to degradation and most of those left, are currently under threat.\nHe regretted that the South-East is only the geo-political zone in the country without a National Park.\nResponding, Enang called for the establishment of more National Parks in the Niger Delta to further the development of the region.\nHe also promised to liaise with the governments of Ebonyi, Abia, Imo and Enugu States to facilitate the establishment of National Parks in the zone.\nHe thanked the Conservator-General for the visit and expressed the willingness of his office to partner with the National Park Service to protect these resources in the Niger Delta region."
  },
  {
    "headline": "Emmanuel Dennis denies reports saying he won’t play for Super Eagles at 2022 African Cup of Nations tournament",
    "summarized_story": "Emmanuel Dennis,Red-hot Watford striker, Emmanuel Bonaventure Dennis, has come out to swiftly deny media reports quoting him to have said that he would shun any invitation to play fot Nigeria at the prestigious African Cup of Nations tournament, kicking off next month in Cameroon.\nIt is a fabrication of the website and it ks totally untrue”, said Emmanuel Dennis, who is in the running for a call-up to the Super Eagles squad fot next month’s African Cup pf Nations tournament in Cameroon.\nMeanwhile, Watford manager, Claudio Ranieri, has hailed Emmanuel Dennis, saying the Nigerian goal poacher is a very fantastic finisher.\nEmmanuel Dennis who has been in chart-bursting form this season after teaming up with the English Premier League club, scoring his sixth goal in 13 league matches in the Hornets’ 2-1 loss to Chelsea last Wednesday.\nEmmanuel Dennis netted two goals and two assists in his last three games in the league in November."
  },
  {
    "headline": "Omicron: UK adds Nigeria to red list",
    "summarized_story": "By Chioma ObinnaAs the Omicron variant spread across countries, the United Kingdom on Saturday added Nigeria to its red list category even as it tightens travel restrictions in a bid to reduce the spread of the COVID-19 virus.\nAccording to UK government’s travel advisory, from 0400 on Monday 6 December, Nigeria will be added to the red list for entering England.\nREAD ALSO:Nigeria on the path to becoming Africa’s leading industrial, trading nation – BuhariThis means Nigerians who do not have UK citizenship or residence permit can no longer travel to the country until the advisory is revised.\nThe rule applies to even fully vaccinated persons.\nNigeria reported its first number of cases of the Omicron virus on Wednesday."
  },
  {
    "headline": "Sports Minister excited as FG takes over refurbished MKO Abiola Stadium",
    "summarized_story": "According to him, the MKO Abiola stadium was renovated under the Adopt-a-Pitch Initiative which aims at exploring private partnerships to enhance the development of sports facilities.\nIt is a national stadium.\nOur expectations without an iota of doubt is that the national teams will play at the national stadium.\nAliko Dangote for opening his doors to us, and accepting to adopt the Moshood Abiola Stadium when we came up with our ‘Adopt-a-Pitch’ proposal.\nHe assured that the company will also ensure the regular maintenance of the MKO Abiola National Stadium for maximum efficiency."
  },
  {
    "headline": "Troops ward off terrorists’ attack on Maiduguri – Army",
    "summarized_story": "Troops of Operation Hadin Kai (OPHK) on Saturday repelled an attack by suspected Boko Haram and Islamic State of West Africa Province (ISWAP) terrorists in the outskirt of Maiduguri Metropolitan Council.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, in a statement on Saturday, said the terrorists made futile attempts to maintain potency with explosions at Gomari community and 1,000 Housing Estate.\nNwachukwu said that the terrorists also fired shots into the communities, causing some level of damage and apprehension in residential areas.\nAccording to him, ground troops, in conjunction with the Air Component of OPHK, responded swiftly and dominated the area with ground and air interdictions that successfully neutralised the threats and infiltration attempt by the terrorists.\n“The general public are urged not to panic as troops are on ground and aggressively dominating the city to effectively take out any perceived threat."
  },
  {
    "headline": "170 domestic animals rescued as bandits clash in Kaduna",
    "summarized_story": "SP Isah in the statement said the clash led to the death of one of the bandits kingpin, Tashi Alhaji Musa, and nine others.\nThe two bandits leaders involved in the face off, Kabiru Master and Tashi Alhaji Musa and said to be from Dage village in Dutsinma LGA of Katsina State.\nThe domestic animals recovered by the police were traced to their village, Dage, after some of the bandits who survived the clash decided to return home with them.\nBoth leaders are indigenes of Dage village, Dutsinma LGA of Katsina State.\n“Consequently, the Command swang into action and raided their respective houses at Dage village, Dutsinma LGA."
  },
  {
    "headline": "COVID-19 Omicron: UK govt puts Nigeria on red list, bans foreign travellers",
    "summarized_story": "The UK Government has said Nigeria will be added to the countries on its red list.\nThis is due to the discovery of COVID-19 Omicron cases linked to Nigeria.\nThe decision was announced in a tweet by the UK on Saturday.\nAccording to the new protocol, non-UK and non-Irish citizens who are travelling in from Nigeria will not be allowed entry into the UK.\nAlthough the ban is described as temporary, the UK said the new protocol does not apply to persons “staying airside and only transiting through”."
  },
  {
    "headline": "Free water technology training: South East participants thank Fordmarx, Enugu govt",
    "summarized_story": "The free training tagged: “Train the Trainer/Capacity Building Programme on Sustainable Water Technology” was flagged off by Governor Ifeanyi Ugwuanyi of Enugu State on November 23, 2021 at The Base Event Centre, Enugu.\n“It is a very good initiative for Enugu State Government to partner a big company like Fordmarx to train us.\nAnother participant, Osita Ogwacha from Imo State equally appreciated Enugu State Governor, Rt.\n“I have learnt a lot through this training and I am grateful to Fordmarx Nigeria Limited for orgainsing this programme.\nI must applaud the Enugu State government because this is a wonderful project."
  },
  {
    "headline": "Bola Babalakin: Buhari reacts to death of former Supreme Court Justice",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family of former Supreme Court Judge, Bolarinwa Babalakin, who passed on Saturday at the age of 94.\nThis was disclosed in a statement by Garba Shehu, the Senior Special Assistant to the President on Media and Publicity, on Saturday.\nBuhari notes that the late Justice Babalakin, long after his retirement, continued to give wise counsel to the Muslim community, especially the Muslim Ummah of Southwest Nigeria (MUSWEN) where he was a former President.\nThe President prays that Almighty Allah will reward his good deeds with Aljannah.\nDAILY POST reports that the deceased was survived by many children and grandchildren, among whom are; Dr Bolanle Babalakin (SAN), Chairman, Bi-Courtney Aviation Services Ltd and Architect Tayo Babalakin, among others."
  },
  {
    "headline": "Gunmen block Kontagora-Minna road, kidnap travellers",
    "summarized_story": "Over one hundred vehicles and thousands of motorists were said to have been stranded in Yakila and Garun Gabas near Kundu in Rafi Local Government Area on Saturday as gunmen took over the Kontagora-Minna road of Niger State.\nThe armed bandits in their number, DAILY POST gathered, blocked both motorists and travellers along the road in an operation that lasted for about an hour.\nIt was learnt that while the operation lasted, there was no security presence close to rescue the situation, thereby leaving the travellers in panic.\n“We were strand for some hours as the bandits took their time to operate.\nWe are praying to God to help Niger and Nigeria to bring this situation to an end,” the source lamented."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "70m active mobile line owners have no bank accounts – eTranzact",
    "summarized_story": "About 70 million active mobile line owners in Nigeria do not have bank accounts, the Chief Executive Officer of eTranzact International Plc., Mr Niyi Toluwalope, has said.\nThe eTranzact boss said that 150 million of Nigeria’s 200 million population owned mobile phone lines, 110 million owned 150 million mobile phone lines but only about 40 million had active Bank Verification Numbers (BVN).\n“We can directly expand the current digital savings and investments offerings to leverage the capital market for increased returns,” he said.\nHe added that for financial inclusion to thrive, the sector would need collaboration of players in the private and public sectors.\nThe workshop was sponsored by Flour Mills of Nigeria, United Bank for Africa, Access Bank, Zenith Bank, NGX, FMDQ and SEC, among other organisations."
  },
  {
    "headline": "Ex-Chief of Army Staff Inuwa Wushishi is dead",
    "summarized_story": "A Former Chief of Army Staff, General Mohammed Inuwa Wushishi, is dead.\nGeneral Wushishi was born in 1940 in Wushishi, Headquarters of Wushishi Local Government Area of Niger State.\nWushishi joined the army on 21 April 1961, and attended the Nigerian Military Training College, Kaduna and then the Mons Officer Cadet School, Aldershot in the United Kingdom.\nHe was appointed Deputy Commandant, Army School of Infantry in July 1975.\nHe was Chief of Army Staff (COAS) from October 1981 to October 1983 during the Shehu Shagari administration."
  },
  {
    "headline": "Secession ‘ll duplicate Nigeria’s challenges – Fayemi",
    "summarized_story": "Secession would not end Nigeria’s problems, Ekiti State Governor, Fayemi Kayode, has said.\nFayemi made the remark on Saturday in his keynote address at the 21st Anniversary celebration of Mambayya House in Kano.\nRather than end the challenged bedeviling the country, the governor said secession would but duplicate them.\nIf we break up a hundred places, the problems will be replicated a hundred times,” he said.\n- Advertisement -Fayemi noted that South Sudan fought with Sudan for almost half a century to gain independence, but went back later to fight itself."
  },
  {
    "headline": "20,314 victims of sexual violence report to SARC centres",
    "summarized_story": "About 20,090 victims of sexual related violence have so far reported to the different Sexual Assault Referral Centres (SARCs) in the country.\nOf the figure, the number of cases for 2019 increased by 5,670.\nAlso, the sexual assault registry established by the Federal Government has so far uploaded 573 cases into the database.\nOf the number, 78 convictions have been recorded with 320 cases pending in court and 173 are still under investigation.\nIncluded are, spousal/partner battery, harmful traditional practices, harmful substance attack, administering substance with intent, political violence, violence by state actors, incest and indecent exposure."
  },
  {
    "headline": "Bandits free abducted 61 Baptists, nine others in Kaduna",
    "summarized_story": "From Sola Ojo, KadunaThe remaining 61 members of Emmanuel Baptist Church, Kakau Daji, Chikun local government area of Kaduna State and nine other persons have been freed by their abductors suspected to be bandits terrorising the state.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nTwo people were left dead, three survived bullets injuries when the armed bandits stormed their place of worship in their numbers in October this year.\nChairman, Christian Association of Nigeria, Kaduna State branch, Reverend Joseph Hayab, who confirmed their release to this correspondent however lamented that another Baptist pastor’s wife was kidnapped elsewhere at about the same time these people were released on Friday.\nHe also decried continuous withhold of the remaining three students of the Bethel Baptist High School, Damishi, Kaduna."
  },
  {
    "headline": "2023: S’West APC govs begin consultations",
    "summarized_story": "We are talking about South West.\nWe are here for one agenda, which is we want Yoruba to be president of Nigeria in 2023.\nIn the last eight years, APC has been in the saddle and we are looking for a better leadership and we hope, we know and we pray that APC from South West will provide that better leadership.\nThat is why we try to ensure that it is not negotiable, as far as we are concerned, that presidency comes to the South West.\nIt was agreed at the end of the meeting that the gathering would be rotated among the six states in the South West."
  },
  {
    "headline": "How to secure Kanu’s freedom-Ahamba",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMouma maintained that political solution remains the best option in solving the Kanu issue.\n“The AGF is sadly out of his depth in political maneuvers and goes from one blunder to another.\nIt is unlikely his advice will hold sway on a political solution.\nInsisting on political solution as the best option to solve the festering problem in the South-East, he demanded the unconditional release of Kanu, Yoruba Nation activist, Sunday Igboho and other political prisoners."
  },
  {
    "headline": "It’s wrong to politicise Bayelsa oil spillage – Yusuf, Arewa youth leader",
    "summarized_story": "The firm, he said, “has since mobilised to ground zero and has fully deployed measures to contain the leak including an effective fast-track spill recovery programme.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nDespite efforts by Aiteo to professionally contain the spill in Nembe, some see this incident as an opportunity to attack the company.\nSome interests are even, curiously, putting out old spill videos to create a negative false impression of the extent incident.\nLatest Jobs in Nigeria (Graduates/Non-graduates)."
  },
  {
    "headline": "Omicron variant: FG releases new Int’l travel guidelines",
    "summarized_story": "The full statement reads: Revised International Travel Protocol.\n“The Presidential Steering Committee on COVID-19 has reviewed the International Travel Protocol of 22nd October 2021.\nCOVID-19 PCR test to be done within 48hrs before departure; 2.\nPost-arrival Day 2 COVID-19 PCR test; 3.\nDay 7 post-arrival exit PCR test (for unvaccinated and partially vaccinated individuals) “Out-bound Passengers: All out-bound Passengers are required to provide either of the following documentation; 1."
  },
  {
    "headline": "BREAKING: Omicron: UK Adds Nigeria To Red List, Travellers To Take Pre-departure COVID-19 Test",
    "summarized_story": "Nigeria has been added by the United Kingdom to a red list over Omicron, a variant of Coronavirus.\nThe UK made the announcement on Saturday in a bid to tackle the spread of the virus.\nFile photoFollowing the latest development, all international arrivals to the UK will now be required to take pre-departure COVID-19 tests, the Health Secretary, Sajid Javid, said on Saturday.\n“Nigeria is second only to South Africa for cases linked to Omicron,\" he said.\n\"We want to remove them as soon as we possibly can,\" he added, saying that \"vaccines remain our first line of defence\"."
  },
  {
    "headline": "BREAKING: Omicron: UK Adds Nigeria To Red List, Travellers To Take Pre-departure COVID-19 Test",
    "summarized_story": "Nigeria has been added by the United Kingdom to a red list over Omicron, a variant of Coronavirus.\nThe UK made the announcement on Saturday in a bid to tackle the spread of the virus.\nFile photoFollowing the latest development, all international arrivals to the UK will now be required to take pre-departure COVID-19 tests, the Health Secretary, Sajid Javid, said on Saturday.\n“Nigeria is second only to South Africa for cases linked to Omicron,\" he said.\n\"We want to remove them as soon as we possibly can,\" he added, saying that \"vaccines remain our first line of defence\"."
  },
  {
    "headline": "EXCLUSIVE: Director-General Of National Broadcasting Corporation, Ilelah, In Alleged Multi-Billion Naira Contracts’ Scandal",
    "summarized_story": "Some workers of the National Broadcasting Corporation have accused the Director-General of the agency, Balarabe Shehu Ilelah, of nepotism and marginalisation.\nThey accused Ilelah of engaging in illegal award of contracts to friends, family members and cronies in violation of procurement laws.\nAccording to the workers, Ilelah has abused all known procurement regulations in the agency.\nHe stated that a clique at the commission set traps for the Director-General through the indiscriminate award of contracts.\nThey give wrong advice to the DG and show him how to shortchange the system through the award of contracts."
  },
  {
    "headline": "EXCLUSIVE: Director-General Of National Broadcasting Corporation, Ilelah, In Alleged Multi-Billion Naira Contracts’ Scandal",
    "summarized_story": "Some workers of the National Broadcasting Corporation have accused the Director-General of the agency, Balarabe Shehu Ilelah, of nepotism and marginalisation.\nThey accused Ilelah of engaging in illegal award of contracts to friends, family members and cronies in violation of procurement laws.\nAccording to the workers, Ilelah has abused all known procurement regulations in the agency.\nHe stated that a clique at the commission set traps for the Director-General through the indiscriminate award of contracts.\nThey give wrong advice to the DG and show him how to shortchange the system through the award of contracts."
  },
  {
    "headline": "Governor Zulum Urges Military To Be More Proactive During Visit To Borno Rocket Attack Victims",
    "summarized_story": "Borno State governor, Babagana Zulum, has called on the military to step up their operations to tackle the activities of terrorists in the city.\nSpeaking during the visit, Zulum noted that the insurgents came close to Maiduguri before firing the explosives.\nHe said, “It seems the insurgents came very close to the town, the military has to wake up and ensure adequate surveillance.\n“We have to fortify Maiduguri town, we have to ensure adequate patrols on a daily basis to avert future attacks.\n\"I will constitute a small committee to ascertain the level of the damage and advise government on how to avert future occurrence,\" Zulum said."
  },
  {
    "headline": "A yellow bus ride and musings on 2023",
    "summarized_story": "AdvertisementThen an idea struck me: take a yellow bus!\nThe last time I rode in a yellow bus was in August 1999.\nThat was the month I got my first car, an official property that effectively created a wedge between the good old yellow bus and myself.\nEventually, the yellow bus filled up and the conductor took his seat.\nBut, unfortunately, my yellow bus colleagues are more likely to be excited by ethnic, religious and partisan emotions."
  },
  {
    "headline": "A yellow bus ride and musings on 2023",
    "summarized_story": "AdvertisementThen an idea struck me: take a yellow bus!\nThe last time I rode in a yellow bus was in August 1999.\nThat was the month I got my first car, an official property that effectively created a wedge between the good old yellow bus and myself.\nEventually, the yellow bus filled up and the conductor took his seat.\nBut, unfortunately, my yellow bus colleagues are more likely to be excited by ethnic, religious and partisan emotions."
  },
  {
    "headline": "Fayemi: Why secessionist groups should embrace dialogue to keep Nigeria united",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, has called on secessionist groups in the country to embrace dialogue in the interest of keeping the country united.\nAdvertisementFayemi said this on Saturday at a public lecture to mark the 21st anniversary of the Aminu Kano Centre for Democratic Studies.\nHe said splitting the country into independent nations is not the solution to the challenges, adding that secessionist groups should be summoned for dialogue and convinced to drop their agitations.\nCountries like United States of America and former Soviet Union were united and that is the basis of their strength and weapon towards its continuous socio-economic development and advancement,” he said.\nAdvertisementAccording to Fayemi, breaking the country up into segments will result in crisis."
  },
  {
    "headline": "Fayemi: Why secessionist groups should embrace dialogue to keep Nigeria united",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, has called on secessionist groups in the country to embrace dialogue in the interest of keeping the country united.\nAdvertisementFayemi said this on Saturday at a public lecture to mark the 21st anniversary of the Aminu Kano Centre for Democratic Studies.\nHe said splitting the country into independent nations is not the solution to the challenges, adding that secessionist groups should be summoned for dialogue and convinced to drop their agitations.\nCountries like United States of America and former Soviet Union were united and that is the basis of their strength and weapon towards its continuous socio-economic development and advancement,” he said.\nAdvertisementAccording to Fayemi, breaking the country up into segments will result in crisis."
  },
  {
    "headline": "COVID: UK bans foreign travellers from Nigeria over Omicron concerns",
    "summarized_story": "The United Kingdom says Nigeria will be added to the countries on its red list as a result of the discovery of COVID Omicron cases linked to Nigeria.\nFollowing the discovery, a number of countries banned travel from countries in southern Africa.\n“Over the recent days, we have learned of a significant number of growing cases linked to travel with Nigeria.\nNigeria narrows second only to South Africa in terms of cases linked to Omicron,” he said.\nThis will mean that only UK residents or citizens of the UK can enter the UK from Nigeria from that point onwards, and they would have to quarantine in one of the relevant hotels."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "Nigeria’s Payourse secures $600k pre-seed to accelerate crypto adoption across Africa",
    "summarized_story": "But as good as this may sound, navigating through most of the available crypto products still feels like Chinese arithmetic to many Africans.\nAnd this experience is shutting out a large number of Africans from the crypto economy, thereby hindering even wider adoption.\nOne of them, Payourse, a Lagos-based blockchain startup that builds user-friendly products and tools to accelerate the adoption of crypto in Africa, has secured a $600,000 pre-seed investment to scale its products, hire more talent and expand into new markets.\nBut because of its seamless experience, Coinprofile began to gain traction among crypto users.\nUnlike other companies that charge fees on every transaction, Coinprofile doesn’t charge users on a transaction."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Payourse’s $600k pre-seed, Herconomy’s 24hr funding and Octamile’s $500k pre-seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Payourse’s $600k pre-seed$600k pre-seed by HerconomyWorld AIDS DayOctamile’s $500k pre-seedOfferZen’s $5.1m Series APayourse’s $600k pre-seedL-R Payourse Co-founders, Bashir Aminuy and John Anisere.\nAdvertisementFive years later, Payourse — the brainchild of Aminu, Hakeem Oyewole, and John Anisere — has announced the raise of a $600k pre-seed to build the next crypto powerhouse.\nYou can read it here: Nigeria-based blockchain startup, Payourse raises $600k pre-seed to build a Web3 powerhouseHerconomy bags $600k pre-seedHerconomy TeamHerconomy is a startup that empowers women by offering them capacity building, jobs, networking, and financial services.\nOn Wednesday, December 1, 2021, the startup announced a $600,000 pre-seed raise, led by members of the Herconomy community.\nOctamile raises $500k pre-seedOctamile Founder, Gbenro DaraOctamile, an African insurtech startup, has closed a $500,000 pre-seed round to simplify access to insurance for Africans."
  },
  {
    "headline": "Nigeria-based blockchain startup, Payourse raises $600k pre-seed to build a Web3 powerhouse",
    "summarized_story": "AdvertisementInterestingly, Aminu tells Techpoint Africa that they never actually reached out to investors.\nThe first day we had a call with Michael, he wanted to invest.” The same story with Flori Ventures, Aminu says.\nMeet Payourse @payourse.\nWell, Aminu tells Techpoint that they earn an average of 1.5 – 2% and sometimes even as much as 10% per transaction.\nWhen a business wants to develop crypto products for the African market or wants to integrate crypto into what they already have, we are the go-to."
  },
  {
    "headline": "UK adds Nigeria to its travel red list",
    "summarized_story": "Nigeria will be added from Monday to the red list of countries from where people arriving must quarantine in a hotel for 10 days, Sajid Javid, UK Secretary of State for Health said on Saturday, as the UK government tightens requirements to come into force from Tuesday.\nTravellers heading to the UK will now have to take a Covid test before their departure in an effort to limit the spread of the virus, UK government said.\nCurrently, people only need to self-isolate until they test negative within two days of arriving.\nOmicron UK’s red listHe said: “Over the recent days we have learnt of a significant number of growing cases linked to travel with Nigeria.\nThese tightened rules against Nigeria are seen as part of the hysteria towards Africa."
  },
  {
    "headline": "Nigeria to begin rollout of COVID-19 booster shots December 10",
    "summarized_story": "Nigeria will begin the much-awaited administration of COVID-19 vaccine booster shots December 10 as Africa’s most populous nation moves to speed up one of the continent’s slowest vaccine rollout exercise ahead of a likely fourth wave.\nRead Also: Nigeria considers offering covid booster jabs in bid to beat virusIn a statement released Friday, Faisal Shuaib, the executive director, NPHCDA said the eligibility criteria for taking the booster dose includes being age 18 and above.\nHe urged all Nigerians to take advantage of the opportunity offered by the Federal Government of Nigeria.\nSome 6,887,362 eligible Nigerians, representing 6.2 percent of the population, have received their first doses of the vaccine, according to the NPHCDA.\nMeanwhile, 3,720,695 Nigerians, representing 3.3 percent of the population, have been fully vaccinated as of December 2."
  },
  {
    "headline": "Why Nigeria will struggle to meet OPEC’s production quota",
    "summarized_story": "“Some Nigeria assets may be under-invested, resulting in potential upside opportunities”.\n“Despite the profitability of their Nigeria assets, the IOCs are under increased pressure to accelerate their energy transition and divest non-core assets,” Wood & Mackenzie said.\n“Many indigenous operators are sitting on significant resources, with opportunities to grow production with access to capital investment,” Wood & Mackenzie added.\n“Nigeria’s oil production is currently struggling at levels never seen before, but the regulators are ignoring the problem and disguising under OPEC’s quota,” Charles Akinbobola, energy analyst at Lagos-based Sofidam Capital, says.\nAlso, a new wave of security threats in Nigeria has emerged that could further dent Nigeria’s production."
  },
  {
    "headline": "Okowa, Group Demand Justice For Slain 12-Year-Old -Dowen College Student – Nigerian Observer",
    "summarized_story": "As we continue to watch this case closely, we extend our prayers and support to the Oromoni family.\nEbilade Ekerefe National Spokesman, Ijaw Youth Council and made available to newsmen in Warri, the group said,“We watched with awe and shock the reported circumstances surrounding the death of a 12-year-old student of Dowen College in Lagos, Sylvester Oromoni Jnr.\n“The supposed injuries from the beatings led to his death, according to a Twitter user with the handle@perrisonoromoni, the boy’s cousin.\n“Late Sylvester Oromoni Jnr is a son of Ijaw land from Ogbeh-Ijoh area of Warri South-West Local Government of Delta State.\nThis story if true amounts to organizing a party around the corpse of the late Sylvester Oromoni."
  },
  {
    "headline": "Edo Tech Park: EdoJobs, Decagon opens application for ‘onramp’ programme extension – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Skills Development Agency, in partnership with Decagon, has urged Edo indigenes to apply for the two-week ‘onramp’ programme to prepare youths for placement in the state’s elite software engineering and leadership training institute, the Edo Tech Park.\nManaging Director of Edo State Skills Development Agency (EdoJobs), Mrs. Ukinebo Dare, urged indigenes of the state to take advantage of the opportunity to become world-class developers at no up-front cost.\nShe said the two weeks training programme will begin on Monday, December 6, 2021, noting that upon successful completion of the two weeks programme, the successful candidates are guaranteed a slot into squad 10 of the Edo Tech Park Programme, alongside other selected candidates.\nShe added that the plan is to produce at least 15,000 world-class software engineers in the state within the next five years at the park.\nThe Managing Director noted that Decagon, which is the partner of the state government on the Edo Tech Park project, will screen and shortlist successful candidates to qualify for the six-month Edo Tech Park programme, which comes with job placement opportunities with companies in Africa, US and Europe."
  },
  {
    "headline": "Obaseki commiserates with former governor, Lucky Igbinedion, over death of mother – Nigerian Observer",
    "summarized_story": "Obaseki commiserates with former governor, Lucky Igbinedion, over death of motherShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commiserated with the former Governor of Edo State, Dr. Chief Lucky Igbinedion, over the death of his mother, Mrs. Maria Oredola Igbinedion.\nIn a statement, Obaseki said, Mrs. Maria Oredola Igbinedion would be remembered for her wise counsel, charming character and love for God.\nHe said, “I am saddened by the sad news of the passing of your dearly beloved mother, Mrs. Maria Oredola Igbinedion.\n“She was a great mother, a loving wife and a conscientious community leader.\n___________________________________________________________________________________________________________________Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo will domesticate disability law in 2022 – Gov Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After years of relentless advocacy for a disability law in Edo State, governor Godwin Obaseki has assured members of the disability community in the state that his administration will domesticate the law next year.\nOmosah expressed appreciation to governor Obaseki for his commitments to disability inclusion in the state despite the absence of a legal framework.\nOjugo stressed that, the disability law was “long overdue” for domestication, hence the governor should make it a reality as “Edo state state is the heartbeat” of Nigeria.\nOther speakers include the President of Nigerian Bar Association (NBA), Olumide Akpata, who was represented by Kunle Edun.\nThe discussants were governor Obaseki, Austine Osakue, Ekaete Umoh, and Larry Ofulue."
  },
  {
    "headline": "Akin Ogunbiyi receives OAU’s Distinguished Alumni Award",
    "summarized_story": "By Sunday Oguntuyi, OsogboIn celebration of the 60th anniversary of Obafemi Awolowo University, the institution’s echelons on Saturday conferred distinguished alumni award on Dr Akin Ogunbiyi and 59 other outstanding alumni of the University.\nPresenting the award, Professor Wale Omole, a former Vice-Chancellor of the University stressed that Dr Ogunbiyi richly deserved the award being an outstanding alumnus, good ambassador and avid supporter of Great Ife and partner in better education for all.\nThe celebration, together with formal launching of Great Ife Advancement Foundation, was held at Marriot Hotel in Lagos State.\nDr Ogunbiyi in his usual philanthropic gesture donated 10 million naira to the University foundation.\n“Akin is an Associate Member of the Chartered Insurance Institute of the London and a Fellow of the Chartered Insurance Institute of Nigeria (FCIIN)."
  },
  {
    "headline": "Nigeria’s pro-democracy activists have surrendered to fascist, anti democratic forces – ADF",
    "summarized_story": "The ADF in a statement signed by its president, Professor Uzodinma Nwala and its spokesperson, Chief Abia Onyike, titled: “Where are Nigeria’s Democracy Activists?\nAccording to the foundation, “The 1990s witnessed the re-awakening of popular democratic forces in Nigeria.\nWhere are the pro-democracy activists?\n“Tragically, as these ugly events unfolded, the pro-democracy activists felt ignorant and unperturbed as their beloved regime opened NIGERIA’S borders to irredentist foreign Fulani militants and Jihadists.\n“What lesson does this reality pose for the immediate future of Nigeria’s democratic evolution?"
  },
  {
    "headline": "Osun Senator, Oriolowo trains over 200 youths, women on entrepreneurship",
    "summarized_story": "The training was on Business Development for Youths and Women” and “Presentation of Cash Grants to Co-operative Society for Widows” in the Senatorial district.\nSpeaking at the programme, Senator Oriolowo said the gesture was borne out of his passion to develop his constituents to be self reliance as promised during his campaign.\nOriolowo said the empowerment programmes are birthed out of commitment and services to humanity.\nOriolowo also enjoined the widows who were beneficiaries of the basic business empowerment to use the token given to them to boost their medium scale businesses.\n“Senator Adelere Oriolowo’s empowerment programmes are recurrent."
  },
  {
    "headline": "Armed herdsmen destroy IYM founder, Elliot Uko’s farm in Enugu",
    "summarized_story": "Armed herders on Friday, invaded the farm of Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement (IYM) at Nike, Enugu State, destroying crops, killing chicken in what seemed to be a premeditated attack.\nThe herders, witnesses said, broke into the fenced settlement which houses crops and poultry farms, killed some chickens and led cows to eat up vegetables before leaving.\nNarrating the incident to our correspondent who contacted him on Friday evening, Uko said the herders ruined everything on the farm before leaving in the morning hours of the day.\nAccording him, “Armed Fulani herdsmen deliberately breached my fence by breaking down the wall, led their cattle right into my poultry Farm, violated my Farm, and destroyed all they could.\n“My Farm, established 2009, twelve years ago, is located at Ugwuomu Nike."
  },
  {
    "headline": "BREAKING: UK Bans Foreign Travellers From Nigeria Over Omicron Concerns",
    "summarized_story": "The United Kingdom has said Nigeria will be added to the countries on its red list as a result of the discovery of COVID-19 Omicron cases linked to it.\nFollowing the discovery, a number of countries banned travel from countries in southern Africa.\n“Over the recent days, we have learned of a significant number of growing cases linked to travel with Nigeria.\nNigeria narrows second only to South Africa in terms of cases linked to Omicron,” he said.\nThis will mean that only UK residents or citizens of the UK can enter the UK from Nigeria from that point onwards, and they would have to quarantine in one of the relevant hotels."
  },
  {
    "headline": "BREAKING: UK Bans Foreign Travellers From Nigeria Over Omicron Concerns",
    "summarized_story": "The United Kingdom has said Nigeria will be added to the countries on its red list as a result of the discovery of COVID-19 Omicron cases linked to it.\nFollowing the discovery, a number of countries banned travel from countries in southern Africa.\n“Over the recent days, we have learned of a significant number of growing cases linked to travel with Nigeria.\nNigeria narrows second only to South Africa in terms of cases linked to Omicron,” he said.\nThis will mean that only UK residents or citizens of the UK can enter the UK from Nigeria from that point onwards, and they would have to quarantine in one of the relevant hotels."
  },
  {
    "headline": "Ex-Army Chief, Gen Wushishi, Dies At 81",
    "summarized_story": "A former Chief of Army Staff, General Muhammadu Inuwa Wushishi, has passed away, aged 81.\nThe governor in a statement by his chief press secretary, Mary Noel Berje, said the government of Niger State and indeed the people of the state were pained by the death of the former Army chief.\nLate General Wushishi was born on the January 1, 1940 in Wushishi town of Wushishi local government area of Niger State, and was the Chief of Army Staff during Late Shehu Shagari administration uptill 1984.\nHe is survived by his wife, Kande Muhammadu Wushishi and seven children including the former Commissioner of Investment in Niger State, Hon.\nKabiru Muhammadu Wushishi."
  },
  {
    "headline": "Ex-Army Chief, Gen Wushishi, Dies At 81",
    "summarized_story": "A former Chief of Army Staff, General Muhammadu Inuwa Wushishi, has passed away, aged 81.\nThe governor in a statement by his chief press secretary, Mary Noel Berje, said the government of Niger State and indeed the people of the state were pained by the death of the former Army chief.\nLate General Wushishi was born on the January 1, 1940 in Wushishi town of Wushishi local government area of Niger State, and was the Chief of Army Staff during Late Shehu Shagari administration uptill 1984.\nHe is survived by his wife, Kande Muhammadu Wushishi and seven children including the former Commissioner of Investment in Niger State, Hon.\nKabiru Muhammadu Wushishi."
  },
  {
    "headline": "Insecurity: Osinbajo Calls For Use Of Artificial Intelligence",
    "summarized_story": "The vice president, Prof. Yemi Osinbajo (SAN), said the time has come for the adoption of artificial intelligence by the military, security, and intelligence agencies to tackle the current security challenges bedevilling the country.\nSpeaking at the graduation ceremony for Executive Intelligence Management Course (EIMC 14) at the National Institute for Security Studies (NISS) in Abuja, the vice president enjoined participants drawn from Nigeria, the Gambia, Ghana, and Liberia, to apply the knowledge obtained during the 10-month programme, to tackle the myriad of security challenges across the West African sub-region.\nThis is even as the spokesperson of the Department of State Security Services, Dr. Peter Afunanya, joined 65 other participants to bag the EIMC 14 prestigious fellow of security institute (fsi) award.\nAccording to the vice president, “We cannot police the country with human security alone; we must leverage technology.\n“Security and intelligence agencies must adopt artificial intelligence, and must be proactive, not reactive, in dealing with issues of insecurity in the country.”Earlier, the director-general, State Security Service, Yusuf Bichi, urged the graduands to be strategic in their approach to tackling insecurity."
  },
  {
    "headline": "Dowen College death: IYC demands justice for Sylvester Oromoni",
    "summarized_story": "The umbrella body of Ijaw youths worldwide, the Ijaw Youth Council (IYC), has expressed dismay over the reported circumstances surrounding the death of a 12-year-old student of Dowen College in Lagos, Sylvester Oromoni Jnr.\nEkerefe demanded justice for the deceased student, saying that the supposed injuries fromthe beatings led to his death, according to a Twitter.\n–“Late Sylvester Oromoni Jnr is a son of Ijaw land from Ogbeh-Ijoh area of Warri South-West Local Government of Delta State.\nThe circumstances that led to his death are indeed irksome to all Nigerians of good conscience who have displayed tremendous solidarity in the condemnation of evil.\nThis story if true amounts to organizing a party around the corpse of the late Sylvester Oromoni."
  },
  {
    "headline": "Dowen College death: IYC demands justice for Sylvester Oromoni",
    "summarized_story": "The umbrella body of Ijaw youths worldwide, the Ijaw Youth Council (IYC), has expressed dismay over the reported circumstances surrounding the death of a 12-year-old student of Dowen College in Lagos, Sylvester Oromoni Jnr.\nEkerefe demanded justice for the deceased student, saying that the supposed injuries fromthe beatings led to his death, according to a Twitter.\n–“Late Sylvester Oromoni Jnr is a son of Ijaw land from Ogbeh-Ijoh area of Warri South-West Local Government of Delta State.\nThe circumstances that led to his death are indeed irksome to all Nigerians of good conscience who have displayed tremendous solidarity in the condemnation of evil.\nThis story if true amounts to organizing a party around the corpse of the late Sylvester Oromoni."
  },
  {
    "headline": "Wike offers N50m, automatic job to disabled PhD graduate",
    "summarized_story": "Rivers Governor Nyesom Wike has honoured a student living with disability, James E. Daniel, with N50million and automatic job at the Rivers State University (RSU) for bagging a Doctor of Philosophy (PhD) degree.\nWike announced Daniel’s N50m reward and automatic appointment as a lecturer of the university during the 33rd convocation of the Rivers State University, Port Harcourt on Saturday.\nThe governor directed the Governing Council and managements of state universities to sanitise their internal academic systems.\nWike said from inception, the Rivers State University had been in the forefront of providing tertiary education and training to people of the state.\nThe Chancellor and the Emir of Lafia, His Royal Majesty, Dauda Sidi Bage, noted that university education was indispensable to national development."
  },
  {
    "headline": "Wike offers N50m, automatic job to disabled PhD graduate",
    "summarized_story": "Rivers Governor Nyesom Wike has honoured a student living with disability, James E. Daniel, with N50million and automatic job at the Rivers State University (RSU) for bagging a Doctor of Philosophy (PhD) degree.\nWike announced Daniel’s N50m reward and automatic appointment as a lecturer of the university during the 33rd convocation of the Rivers State University, Port Harcourt on Saturday.\nThe governor directed the Governing Council and managements of state universities to sanitise their internal academic systems.\nWike said from inception, the Rivers State University had been in the forefront of providing tertiary education and training to people of the state.\nThe Chancellor and the Emir of Lafia, His Royal Majesty, Dauda Sidi Bage, noted that university education was indispensable to national development."
  },
  {
    "headline": "Omicron: Nigeria joins South Africa, 9 others on UK red list",
    "summarized_story": "Nigeria will be added to Britain’s travel “red list” at 0400 GMT on Monday.\nThe health ministry said the vast majority of cases in Britain have clear links to overseas travel from Nigeria and South Africa.\nJavid said that Nigeria is second only to South Africa in terms of linked cases to Omicron.\n“Over the recent days we have learnt of a significant number of growing cases linked to travel with Nigeria.\nThe UK Health Security Agency (UKHSA) said that the total number of confirmed Omicron cases had risen to 160."
  },
  {
    "headline": "Lagos Police probe death of Oromoni Dowen College student",
    "summarized_story": "By Mateen Badru/LagosThe Lagos State Police Command on Saturday said investigation into the death of Sylvester Oromoni, a 12 year-old student of Dowen College, Lekki, is ongoing.\nCSP Adekunle Ajisebutu, said that although no formal report had been made to the command, the Commissioner of Police, Hakeem Odumosu, has ordered the investigation of the death.\n“The Lagos State Police Command is not unaware of the reported death of one Sylvester Oromoni, a 12-year-old student of Dowen College, Lekki, Lagos, which is currently going viral on the social media.\nHowever, Dowen College, in a statement, denied all allegations, stating that Oromoni only complained of body pains from playing football.\nWhile Dowen College shut the school for 2 days, the Lagos State Ministry of Education ordered the school shut indefinitely, pending the outcome of investigation into the Oromoni’s death."
  },
  {
    "headline": "[JUST IN] Itunu Babalola: Nigerian Lady Who Died In Ivory Coast Prison Buried In Oyo",
    "summarized_story": "Itunu Babalola, the Nigerian lady who died in prison in Côte D’Ivoire after she was wrongly jailed, has been buried in Ibadan, Oyo State.\nBabalola reportedly died on November 14 and Nigerians had taken to social media to express deep anger over the death of Babalola.\nAccording to reports, 21-year-old Babalola from Oyo State was a trader based in Bondoukou, Cote d’Ivoire.\nHe reportedly offered her a settlement worth roughly N100,000 to drop the case, an amount lesser than the N300,000 worth of stolen effects.\nIn defence, Dabiri-Erewa, blamed Babalola, saying she reported her plight late to the Nigerian Commission in Ivory Coast after she had spent two years in jail."
  },
  {
    "headline": "BREAKING: Explosions Rock Maiduguri Metropolis, As Terrorists Attack Borno Capital",
    "summarized_story": "At least four distinct explosions were heard early Saturday morning in Maiduguri, Borno State, in the villages of Gomari district and 1000 housing estates.\nTerrorists are suspected of masterminding the explosions, which fired rockets in several directions while troops and an airforce task team engaged them in an attempt to repel the onslaught.\nThe explosions began early, according to eyewitnesses, with the first two happening at Gomari airport and the third erupting in a structure near the Hajj Transit Camp, where repentant Boko Haram fighters are being housed.\nSpeaking to one of the victims who was among those killed, Mallam Kulima said he owes it all to God to thank him for preserving his and his family’s life, as no one was killed."
  },
  {
    "headline": "How My Son Sylvester Oromoni Was Tortured Before He Died – Father Explained (Video)",
    "summarized_story": "Mr. Oromoni, the late Sylvester Oromoni’s father, has described how his son was abused by fellow classmates, resulting in his death.\nSylvester was a student at Dowen College in Lekki, Lagos, and lived at the school hostel when he died.\nDowen College blamed his death on injuries suffered while playing football.\nFollowing public outcry, the school announced that it would temporarily shut its doors and reopen next week as exams are scheduled to start soon.\nBut the Lagos State Government has ordered the school to be shut down until the education ministry and relevant authorities conclude a probe into Oromoni Jnr’s death."
  },
  {
    "headline": "BREAKING: Soldiers Battle Boko Haram Terrorists in Borno Town, Malam Fatori",
    "summarized_story": "The border town headquarters of the Abadam Local Government Area, Malam Fatori, is under siege by boko Haram terrorists.\nMalam-Fatori is one of the two LGAs without human activities where Governor Zulum had insisted on returning displaced persons by December 31.\nThere were 500 mobile police personnel deployed to clear the town in preparation for the return of 1,000 refugees from Niger republic.\nThe mobile Police crack team have since abandoned the town and returned to Maiduguri while the military personnel are still there.\nReports reaching The PUNCH in Maiduguri indicated the terrorists are engaging the army formation in Malam-Fatori Friday evening."
  },
  {
    "headline": "Breaking: West ham stun Chelsea in Premier League clash",
    "summarized_story": "Chelsea FC are facing possible displacement off the top of Premier League table after they succumbed to West ham defeat a while ago on Saturday.\nWest ham had the day afterall with a 3-2 victory at home.\nDetails coming…"
  },
  {
    "headline": "Pictures: Dangote hands rehabilitated Moshood Abiola stadium pitch, digital score board to FG",
    "summarized_story": "The Federal Ministry of Youth and Sports Development on Friday formally received the rehabilitated Moshood Abiola stadium pitch and digital score-boards from the Dangote Industries Group (DIG) after years of neglect.\nThe revival of the pitch was made possible under the “Adopt-a-pitch” initiative of the incumbent Minister, Sunday Dare.\nThe Permanent Secretary of the Ministry, Ismaila Abubakar, lauded Dangote group for believing in the vision of the Minister vis-a-vis examplifying a Public-Private Partnership (PPP) that works.\nHe charged the Dangote group to consider extending the period of maintenance beyond two years, stating that after expending $1 million to renovate the facility, long-term maintenance was paramount.\n“We thank Alhaji Aliko Dangote for opening his doors to us, and accepting to adopt the Moshood Abiola Stadium when we came up with our ‘Adopt-a-Pitch’ proposal."
  },
  {
    "headline": "From bandits to terrorists: Will status change end insecurity?",
    "summarized_story": "“Commercial, educational, and farming activities in the North-west and North-central have been disrupted as a result of the groups’ activities,” the federal government noted.\nGumi in a statement by his media aide, Tukur Mamu, said declaring the herdsmen bandits as terrorists is a decision taken for political expediency.\n“Will bandits become terrorists because they have been categorised as terrorists?\nFighting terrorists and fighting bandits who have been declared terrorists at the same time will further complicate the war against terrorism.\n“It is easy to change labels, and tag bandits as terrorists."
  },
  {
    "headline": "UK Adds Nigeria To Red List Over Omicron Fears",
    "summarized_story": "﻿The United Kingdom has added Nigeria to its red list category as it tightens travel restrictions in an effort to limit the spread of the COVID-19 variant, Omicron.\n“From 0400 on Monday 6 December, Nigeria will be added to the red list for entering England,” the UK government’s travel advisory on Nigeria said.\nREAD ALSO: No Reports Of Deaths From Omicron Variant Yet, Says WHOThe rule applies to even fully vaccinated persons.\n“Over the recent days we have learnt of a significant number of growing cases linked to travel with Nigeria,” UK Health Secretary Sajid Javid said, as reported by the BBC on Saturday.\n“There are 27 cases already in England and that’s growing and Nigeria now is second only to South Africa in terms of linked cases to Omicron.”Nigeria first reported cases of the Omicron variant on Wednesday."
  },
  {
    "headline": "Army Says ‘No Cause For Alarm’ As Explosions Rock Maiduguri",
    "summarized_story": "﻿The army on Saturday said there was no need to panic after explosions rocked some communities in Maiduguri, the Borno State capital.\nREAD ALSO: Army Deploys 62 Soldiers To Mali“This unfortunate incident has caused some level of damage and apprehension in residential areas.\nIn February, at least 17 people were killed and 43 others injured when ISWAP fighters fired multiple rockets on Maiduguri.\nOver 40,000 people have been killed since the Boko Haram insurgency began 12 years ago and more than two million are displaced from their homes.\n“We have to fortify Maiduguri town, we have to ensure adequate patrols on a daily basis to avert future attacks."
  },
  {
    "headline": "Bandits Free 65 Kidnapped Baptist Church Members, Others In Kaduna",
    "summarized_story": "﻿About 65 members of the Baptist church and others who were kidnapped by bandits in Kaduna state have been freed by their abductors.\nThe victims were kidnapped by bandits on October 31 when they invaded the Emmanuel Baptist Church, Kakau Daji in the Chikun Local Government Area of Kaduna State.\nREAD ALSO: Explosion Rocks Residential Area In MaiduguriOn Saturday, the victims including women, men and children were brought to the Albarkar Baptist Church in the Kaduna state capital after their release and were reunited with their families.\nMeanwhile, the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the victims were handed over to the state government by the military for an onward reunion with their families.\nHe also said that the victims, upon their release, were taken to the hospital by the military for a post-trauma evaluation."
  },
  {
    "headline": "We Are Determined To Investigate Death Of Dowen College Student – Delta Govt",
    "summarized_story": "﻿The Delta State Government has vowed to investigate the controversial death of Dowen College student, Sylvester Oromoni Jnr.\nIn a statement on Saturday, Governor Okowa said he was fully in support of the Lagos State Government’s decision to launch an investigation into the death of Sylvester, who is also a native of Warri South LGA in Delta State.\nRead Also: Lagos Govt Orders Indefinite Closure Of Dowen College“Last night, I spoke to Mr. Sylvester Oromoni, the father of late Sylvester Oromoni Jr., the Dowen College student who unfortunately died under very controversial and unclear circumstances.\n“During the call, I expressed my agreement with the decision of the Lagos State government to launch an investigation into the death of Sylvester, a native of Warri South LGA in Delta State.\nHowever, Dowen College in a statement expressed surprise at the allegation, insisting his injuries were sustained while playing football."
  },
  {
    "headline": "PHOTOS: Many Travellers Stranded As Bandits Block Road In Niger",
    "summarized_story": "An unspecified number of armed bandits on Saturday blocked the Kontagora-Minna Road in Niger State, causing gridlock in the area.\nThis left many vehicles and travellers stranded around the Yakila and Garun Gabas areas near Kundu in Rafi Local Government Area of the state.\nSources told Channels Television that the blockage of the road lasted about one hour and there were no security personnel to clear the road in the area at the time.\nDespite this, the bandits reportedly abducted an undisclosed number of persons and moved them to an unknown destination.\nBut witnesses said a team of security operatives later arrived at the scene to clear the road in a bid to ensure it was safe for travellers and motorists."
  },
  {
    "headline": "Low turnout as Ekiti residents vote to elect Council chairmen, Councillors -",
    "summarized_story": "There was low turn-out of voters today at the Local Government Elections held in Ekiti State to determine which party will Pilot the affairs of the 16 LGA, and 20 LCDAs for the next two years.\nTVc monitored the Election around the State and reports that asides the fact that Vehicular Movement was restricted, the Voting Exercise was largely PeacefulIn most Polling units visited ,voters didn’t turn up until 10am, and before 12pm,the exercise has been concluded as party agents were nowhere to be found in most of the Wards and Units.\nThe Creation of 20 LCDAs had generated Controversies of its own in the last few months, and it is yet to be seen how the meagre resources available to Ekiti State will be able to take care of 36 Local Councils altogether."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "Niger Gov signs 2021 revised budget into law",
    "summarized_story": "Niger State governor, Abubakar Sani Bello has assented into law the State “Budget Revision law, 2021”.\nThe Governor signed the law at the Government House, Minna.\nSpeaking to newsmen, the Permanent Secretary, Niger State Planning Commission, Hajiya Ramatu Umar explained that the 2021 budget was reviewed downward following the significant reduction in the inflow of revenue to the state.\nThe Permanent Secretary disclosed that the revised budget allocated N72.5 billion for recurrent expenditure while the sum of 77.3 billion is for capital expenditure bringing the total of the revised 2021 budget to N149.9 billion.\nIn the revised budget, Economic Sector has the highest allocation with N54.7 billion, N14.8 billion is to Social Sector, N7.2 billion was allocated to Administrative Sector while Law and Justice got N580 Million."
  },
  {
    "headline": "Nigeria’s Best Designers on Show in Dubai",
    "summarized_story": ""
  },
  {
    "headline": "Buhari Tasks World Leaders on Covid Partnership at Dubai Expo",
    "summarized_story": "With the global surge in COVID-19 and its new Omicron variant, President Muhammadu Buhari on Friday emphasised the urgent need for world leaders to work together and reinforce partnerships to limit the catastrophic consequences of the pandemic.\nBuhari, while addressing the global audience at Dubai Expo 2020, said: “The concerted efforts by world leaders, working together, enabled us to limit the catastrophic consequences of this pandemic.\nHe described Dubai Expo 2020 as the single most important global event of its kind to take place in the Middle East, Africa and the South East Asian regions in recent years.\n“We are proud to be a part of this dynamic evolution of pragmatic partnerships that are both creative and innovative for the progress of the country,” the President said.\nCharles Ajunwa in Lagos, Deji Elumoye, Onyebuchi Ezigbo and Olawale Ajimotokan in Abuja"
  },
  {
    "headline": "Omicron: Nigeria Refuses to Restrict Inbound Travellers, Approves Booster Doses",
    "summarized_story": "Notwithstanding the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, Nigeria’s federal government on Friday unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nThe Nigeria Centre for Disease Control (NCDC) later announced on Wednesday that three cases of Omicron had been detected in the country.\nThe federal government also formally endorsed the administration of booster dose of the COVID19 vaccine for Nigerians.\nHe also said that the time interval of two months or more after receiving the Johnson and Johnson vaccine should be observed before taking the booster dose.\nAccording to the DG, NPHCDA, Faisal Shuaib, a COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the federal government."
  },
  {
    "headline": "New Online Archive for Benin Bronzes to Go Live at End of 2022",
    "summarized_story": "An online archive bringing together information on thousands of Benin Bronze artefacts in museums around the world is expected to go live at the end of next year, one of the organisers said on Friday.\nThe Benin Bronzes, which are mostly in Europe, were stolen from Nigeria’s Benin City during colonialism and are among Africa’s most significant heritage objects.\n“It will be a major source for research and knowledge about Benin art and cultural history relating to this art.”In October the University of Aberdeen and Cambridge University’s Jesus College returned two Benin Bronzes to Nigeria.\nThe returns were seen as likely to increase pressure on the British Museum in London, which holds by far the largest and most significant collection of Benin Bronzes.\n“We are looking at having new museums in Benin City of international standard that will house these artefacts,” he said."
  },
  {
    "headline": "Trump Faces Flurry of Investigations Beyond January 6 Probe",
    "summarized_story": "Trump has long dismissed the investigations as nothing more than a politically motivated “witch hunt” that began with the probe into Russian meddling in the 2016 election.\nGEORGIAIn Atlanta, Fulton County District Attorney Fani Willis opened an investigation in January into possible attempts to interfere with the administration of the state’s 2020 election, which Trump narrowly lost.\nIf Trump were to be charged, it would be a low-level misdemeanor, with a maximum sentence of six months in jail.\nTrump is also facing a defamation case brought by columnist E. Jean Carroll, who says Trump raped her in the mid-1990s in an upscale Manhattan department store.\nSeparately, Trump’s estranged niece, Mary Trump, has sued him and other family members, accusing them of defrauding her of millions of dollars of inheritance money."
  }
]