[
  {
    "headline": "Police intercept N10m hard drugs, reject N.5m bribe",
    "summarized_story": "THE Lagos State Police Command has confirmed the arrest of four suspects over alleged possession of illicit drugs said to be worth N10m in the Mile 2 area of the state.\nConfirming the development in a statement on Sunday, the state Police Public Relations Officer, Benjamin Hundeyin, said the suspects were arrested by operatives of the Rapid Response Squad.\nHe said, “Operatives of the Rapid Response Squad in the early hours of Sunday, April 3, 2022 intercepted a busload of illicit drugs at the Mile 2 area of Lagos State.\n“Preliminary investigations revealed that the drugs which were loaded in a bus with the number plate AGL 205 YD belonged to one Alhaji, better known as General in Mushin.\n“Other arrested members of the gang include Ojukwu Omanogho, 36, and Hope Jumbo, 40."
  },
  {
    "headline": "Soun: Family opposes Ghandi, alleges AfDB director excluded, demands fresh selection",
    "summarized_story": "Akano said the governor should order that a fresh selection should be done and should ensure that the law is strictly followed to avoid rancour.\nHe said, “Dr Oyebode Oyetunde is a prince from the Ile Aremo which is a ruling family in the Laoye Ruling House.\nBut he was prevented from contesting despite that it is the turn of Ile Aremo to produce the next Soun of Ogbomoso.\nHe added, “The Redeemed Christian of God Pastor, Ghandi, is not even from Ile Aremo whose turn it is to produce the next Soun.\n“If the candidate is not suitable, they send back to the family to produce another candidate and so on until a suitable candidate is produced."
  },
  {
    "headline": "Nigerians not safe on road, train, airport – Obasanjo",
    "summarized_story": "By Nwafor SundayFormer president Olusegun Obasanjo, has said that no place in Nigeria is safe.\nObasanjo said this while reacting to the attack on Abuja-Kaduna train that killed eight persons and injure many.\nAccording to him: “So, if anybody comes to say I want to see you, I want to talk to you, I will say ‘you’re welcome’.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation.\n“I believe that all right-thinking Nigerians must know that we have a situation that has overwhelmed the present administration, but we should not allow that situation to overwhelm Nigeria.”"
  },
  {
    "headline": "Grammys: Nigerians react as Angelique Kidjo beats Wizkid, Femi Kuti, Made Kuti in Global Music Album category",
    "summarized_story": "By Precious ChukwudiBeninise singer and songwriter, Angelique Kidjo’s ‘Mother Nature’ has won in the Best Global Music album category at the 2022 Grammys awards.\nThis win is the Beninese singer’s fifth of her career.\nShe was nominated alongside Wizkid, Femi Kuti, Made Kuti.\nDuring her speech, Angelique, who has won the Grammy four times, said it is a big win for Africa.\nBut Nigerians are not taking it lightly, as they feel no one else can win in a category Angelique Kidjo is nominated."
  },
  {
    "headline": "Train attack: NRC confirms 14 more safe passengers on board",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has confirmed the safety of 14 more passengers on board the attacked Abuja-Kaduna train on March 28, bringing the total safe passengers to 186.\nThe NRC’s Managing Director, Mr Fidet Okhiria, confirmed this in a statement he issued on Sunday.\nAlso Read:Kaduna train attack: If our soldiers fail, I swear, I’ll hire foreign mercenaries – El-Rufai”Of the 362 validated passengers on board the attacked AK9 train service on March 28, 186 persons on the manifest are confirmed to be safe and at their various homes (additional 14 persons confirmed safe today),” Okhiria said.\nHe said: ”This brings the total number of recovered Coaches and safely moved to NRC Stations to be seven.\n”The NRC will continue to update the general public of developments to prevent misleading information and falsehood,” the NRC boss added."
  },
  {
    "headline": "DataPro launches AI app, Tigran to boost access to credit nationwide",
    "summarized_story": "By Tunde OsoDataPro, a technology-driven credit rating agency (CRA), has launched an artificial intelligence (AI) tool called ‘Tigran’ to boost access to credit in Nigeria.\nThe product was launched in Lagos on Thursday in partnership with Modefinance International, a subsidiary of Modefinance Group.\nSpeaking at the launching, Abimbola Adeseyoju, Managing Director, DataPro, said ‘Tigran’ will deliver debt capacity simulation, probability of default modelling, and expected credit loss modelling.\nAdeseyoju said the application is ideal for the financial sector, fintechs, manufacturing companies, and others seeking to digitalise and automate their credit risk evaluation processes.\nOladele Adeoye, Chief Rating Officer, DataPro, stressed the significance of innovation in credit rating."
  },
  {
    "headline": "Omofemi: Showcasing A Woman’s Worth in Spain",
    "summarized_story": "By Osa Mbonu-Amadi,Arts EditorThe exceptional talents of Oluwole Omofemi, the Ibadan-brought up visual artists whose signature is painting African women with afro hairstyle, has taken him to faraway Barcelona, Spain, where Sorella Acosta’s Out of Africa Contemporary Arts Gallery is showing his works titled ‘A Woman’s Worth’.\nAccording to Raphael Dapaah, Art writer & Art Consultant OOA Gallery, Born in 1988, Omofemi hails from the inner streets of South Ibadan, Nigeria.\nHis humble beginnings and steep ascent to the pinnacle of the contemporary African art scene is nothing short of inspirational.\nIf you want great, then be great,” Omofemi says.\nThe art exhibition spans from April-May, 2022."
  },
  {
    "headline": "2023: Northerners rooting for South-South president – Group",
    "summarized_story": "Ahead of the 2023 general elections, results from a survey across Nigeria by political pressure groups have indicated a preference for the Southern part of the country to succeed President Buhari.\nThe survey by the Inter-Party Presidential Consensus Forum (IPCF) also said the Northern region is rooting for a Southern candidate as Nigeria’s next president.\nThe group has now called on the 17 Southern States to adopt a consensus Presidential candidate ahead of the 2023 elections.\nIt called on politicians of northern extraction to, in the interest of national peace, justice, equity and fairness, resist the lure of contesting the 2023 Presidential election and allow the South to produce the next President, after the eight years tenure of President Muhammadu Buhari.\n“Interestingly, results from the Northern states show that voters from that region preferred a President from the Southern part of the country to succeed President Buhari.”The IPCF informed that it would soon commence a nationwide consensus tour ahead of primaries by political parties."
  },
  {
    "headline": "Bedridden ex-police corporal cries for help over eviction plan by FG [PHOTOS]",
    "summarized_story": "He suffered a spinal cord injury and had one of his legs amputated due to the accident.\nI was mobilized to the Nigeria Mobile Force, Akure, in 1993.\nThe police did not help me pay even a single kobo of my medical fees.\nI paid with what little money I had and with the help of my family.\n“Due to my condition, if I’m evicted from this house, I’ll have nowhere to go."
  },
  {
    "headline": "Ondo: Akeredolu bans NURTW over crisis, sets up park management",
    "summarized_story": "The National Union of Road Transport Workers (NURTW) has had its activities banned by the Ondo State Government, alleging a “prolonged crisis” within the union.\nFollowing the suspension, a park management committee was constituted to oversee all of the state’s motor parks.\nJacob Adebo also known as ‘Idajo’ (Chairman), Festus Obasooto (Vice Chairman), and Bayode Gbenga (Vice Chairman) were appointed to the park management committee (Secretary).\nSome NURTW members in the state had previously protested against what they described as the state government’s meddling in the activities of the union’s state council.\nThe union, on the other hand, recommended the state government to let the union’s Constitution, which mandated elections, run its course."
  },
  {
    "headline": "2023: It’s missile – Shehu Sani on Pastor Adeboye saying election may not hold",
    "summarized_story": "Shehu Sani, a former Kaduna Central Senator, has reacted to Pastor Enoch Adeboye of the Redeemed Christian Church of God, RCCG’s remark regarding the 2023 elections.\nSani described Pastor Adeboye’s remark as a missile.\nAdeboye had said he is still in doubt as to whether the general elections would hold in 2023.\nas he is fondly called said God has not revealed to him if elections would hold in 2023.\nReacting, Sani tweeted: “When I saw the missiles I thought it was from Bishop Kukah or Father Mbaka then I found out it’s from Pastor Adeboye."
  },
  {
    "headline": "Akwa Ibom: Construction workers intensify call on Gov Emmanuel to clear debt",
    "summarized_story": "construction workers with Quemecs Nigeria Limited, the original contractors of the Ring road 2 project, in Uyo,Akwa Ibom State have renewed their call on governor Udom Emmanuel, to pay the outstanding balance owed the company to enable it pay them their entitlements.\nThis is the second time the workers called on the governor to intervene following the revocation of the initial contract with the mother contractor, Quemecs Nigeria.\nHe said, ”the truth is that we owed the indigenes, subcontractors and suppliers huge amounts of money.\nThey have been writing to us but the issue is that we have not been paid the money by the state government.\n“The work from three years ago was about 70% done until Covid-19 came and the government did not pay and since then we’ve been expecting payment."
  },
  {
    "headline": "Nine key questions Pastor Adeboye posed to Fed Govt",
    "summarized_story": "Adeboye, during his sermon titled: ‘Waiting without wasting,’ at RCCG National Headquarters, Ebute-Metta Lagos, expressed concerns over worsening affairs in security, economy and leadership.\nIn his sermon, he dropped nine posers around oil and gas, the state of the economy and the incessant attacks of terrorists on Kaduna State.\n“More than 80 per cent of all the oil we are producing has been stolen.\n80 per cent of what should have been the income of a Nation, is going to the hands of some people, that’s a lot of money!\nQuestion 4. Who are the foreign nations buying this stolen oil?"
  },
  {
    "headline": "BREAKING (Grammys 2022) : Wizkid, Femi Kuti, son lose to Angelique Kidjo",
    "summarized_story": "Wizkid, Femi Kuti and Made Kuti have lost out of the race to win a Grammy at the 64th edition at the MGM Arena, Las Vegas.\nAt a televised event, Wizkid, Femi Kuti, and Made Kuti lost out in the two categories, Best Global Music Performance and Best Global Music Album.\nWhile the Nigerian music stars lost to Arooj Aftab for her single ‘Mohabbat’ in the Best Global Music Performance, Angelique Kidjo won the Best Global Music Album.\nDuring her acceptance speech, Kidjo appreciated young Africans that have continued to collaborate with her to promote the continent to the world.\nIn 2021, Wizkid got his first Grammy award for a feature on Beyonce’s song, ‘Brown Skin Girl,’ while Burna Boy won the Best Global Music Album category after losing out in 2020."
  },
  {
    "headline": "M.I Abaga announces engagement to Eniola Mafe",
    "summarized_story": "Popular rapper Jude Abaga aka M.I Abaga has announced his engagement to Eniola Mafe after sparking dating rumours in February.\nEniola Mafe is a strategist and international development leader with the World Economic Forum.\nM.I Abaga shared the announcement alongside a one-minute long video of how they met in December 2020 through co-founder and President of the Chocolate City Entertainment, Audu Maikori.\nRead Also: M.I Abaga dedicates new song to women, hints on new albumThe video also included pictures and highlights of their conversations.\nM.I Abaga tweeted: “So..Wanted to share that I’ve gotten engaged to @EniolaMafe“I’m generally very private with things like this but I wanted to share my joy with you guys."
  },
  {
    "headline": "BREAKING: Gunmen kill three FRSC officials in Anambra",
    "summarized_story": "Gunmen have killed three officials of the Federal Road Safety Commission (FRSC) in Anambra State.\nThe hoodlums burnt a section of Nnewi South local government area,ukpor in the State on Thursday, killing a security guard.\nRead Also: FRSC officer crushed to death in OndoOn Friday, another set of gunmen stormed Amichi in Nnewi South, burnt police station and killed unspecified number of policemen.\nThe killed FRSC officials were said to be in the duty posts when the attack occurred.\nAnambra FRSC spokesperson Margret Enabe, told The Nation, the report was still sketchy for her to confirm the incident."
  },
  {
    "headline": "JUST IN: Gunmen kill 10, injure 19 in fresh Plateau attack",
    "summarized_story": "JUST IN: Gunmen kill 10, injure 19 in fresh Plateau attackGunmen have reportedly killed no fewer than 10 persons in Chando Zerreci village in Bassa Local Government council of Plateau State.\nThe Nation gathered that 19 persons sustained injuries during the attack.\nEyewitness said the gunmen suspected to be herdsmen launched the attack during the annual Irigwe ritual festival ‘Zerreci’ celebrated to usher in the rainy farming season.\nThe National Publicity Secretary of Irigwe Youth Movement Comrade Lawrence Zongo confirmed the attack in a statement on Sunday in Jos.\nThe statement reads: The National Leadership of Irigwe Youth Movement(IYM) condemned the attack of the Irigwe people on her annual ritual festival ‘Zerreci’ the festival that will usher them into the rainy farming season."
  },
  {
    "headline": "Kalu urges APC to reveal zoning formula, cede presidential ticket to South East",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Uzor Kalu, has called on the All Progressives Congress (APC) National Working Committee (NWC) to reveal its 2023 zoning formula.\n“As the presidential primary election approaches, the issue of zoning is once again central and, as usual, contentious.\nI shall be running for the office of the president if the party zones it to the South East.\nOn the unity of the country, Kalu encouraged Nigerians to do away with tribalism and all factors that prevent achieving national unity.\nHe said though Nigeria was experiencing serious security challenges and threat to national unity, citizens should understand that component units were made to stay together as a society."
  },
  {
    "headline": "Buhari’s performance: PDP governors delusional, covering up serial failures –Presidency",
    "summarized_story": "Become a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe governors reached the conclusion at the end of a recent PDP-Governors’ Forum meeting in Aba, Abia State.\n“We cannot ignore how PDP politicians sought – and continue to seek – to inflame ethnic and religious tensions by refusing to even proffer a solution to the herder-farmer clashes which became most prevalent under their misrule.\n“We will always know how PDP politicians raided the NNPC, consistently failed to pay into the Federation Account and, in the last year of PDP misrule, $20 billion dollars was simply found ‘missing’.\n“Who can believe a word these people say, as they looked outwardly stylish but harrowed by power-sharing and other troubles inwardly?"
  },
  {
    "headline": "Invade Ogun mosque, abduct Police Inspector, 2 others – The Sun Nigeria",
    "summarized_story": "From Laide Raheem, AbeokutaGunmen have invaded a mosque at Soyoye, Rounder Area of Abeokuta, where they kidnapped an Inspector of Police and two other worshippers.\nThe police officer, Inspector Kamarudeen Bello, was kidnapped in the mosque last Sunday around 8p.m, while praying.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIt was learnt that the cop is attached to one of the divisional police headquarters in Abeokuta, the Ogun capital.\nBello, whose wife gave birth four days before the incident, is reportedly the Imam of the mosque."
  },
  {
    "headline": "Cultists, bandits on rampage in FCT",
    "summarized_story": "From Fred Itua, AbujaVillages and towns in the Federal Capital Territory (FCT), have come under intense attacks from cultists, bandits and other hoodlums in the last few weeks, forcing residents to flee their homes.\nThere is another group of young boys who are said to be cultists and who have reportedly held residents hostage.\n“They then came through the Green estate gate, which they overpowered the guard at the gate and entered the street.\nLet’s urgently do something about it.”Another resident in the area said: “I witnessed it as I was driving in around 8.00pm.\nWhile invaded the area around 2am, they operated unchallenged for over an hour having already wounded the local vigilance team."
  },
  {
    "headline": "Buhari govt overwhelmed by insecurity – Obasanjo",
    "summarized_story": "Nigeria’s former President, Chief Olusegun Obasanjo has said that the government of President Muhammadu Buhari has been overwhelmed by insecurity.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nHe called for concerted efforts to stem the tide of insecurity in Nigeria, regretting that the Buhari administration had been overwhelmed by the situation.\nSmall Manhood & P.E 7days Solution... Click Here For Details .\nHe suggested that “all right-thinking Nigerians must know that we have a situation that has overwhelmed the present administration,” warning, however, that “we should not allow that situation to overwhelm Nigeria.”"
  },
  {
    "headline": "Obasanjo: Security Challenges Have Overwhelmed Buhari’s Govt, Nigerians No Longer Safe Anywhere",
    "summarized_story": "James Sowole in AbeokutaFormer President Olusegun Obasanjo has said security challenges have overwhelmed the government of President Muhammadu Buhari.\nObasanjo said the development had shown that Nigerians were not safe anywhere – in vehicles, on the train or on aircraft.\nThe former president said the present regime had been overwhelmed by the situation, but Nigerians must not allow the situation to overwhelm the country.\nHe however, cautioned Nigerians not to allow themselves to be overwhelmed by the security challenges.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation."
  },
  {
    "headline": "Volunteers Behind Emefile’s Branded Campaign Materials, Support Group Clarifies",
    "summarized_story": "*insists blackmail won’t discourage CBN Gov’s well-wishersSunday Aborisade, AbujaThe Emefiele Support Group (ESG) has raised the alarm over an alleged media plot to smear Mr. Godwin Emefiele and his office as the Governor of Central Bank of Nigeria.\nThe ESG said at a news conference in Abuja on Sunday that there were plans to blackmail Emefiele based on the independent activities of support groups which are calling on him to join the race for the 2023 Presidential election.\nThe group’s Director of Communications, Ms. Benigna Ejimba, clarified that all Emefiele’s support groups were running on voluntary donations and self-raised funds to promote the call for the CBN boss to run for the highest position in the country.\n“For clarification, we are proud and bold to say that all Emefiele support groups run on voluntary contributions from eminent members of the various support groups who are desirous of a better nation for us all.\n“Please note that these young and determined Nigerians cannot and will not be blackmailed into abandoning our commitment to a people’s agenda to convince Dr. Emefiele to step out to continue to consolidate and expand President Muhammadu Buhari’s legacies."
  },
  {
    "headline": "Train Attack: NRC Confirms Safety of 170 Passengers",
    "summarized_story": "• As 21 are reported missing by relativesKasim Sumaina in AbujaThe Nigerian Railway Corporation (NRC), Saturday confirmed the safety of 170 passengers, even as it said that 21 passengers were still reported missing by the relatives who made calls to the corporation.\n“This update has become absolutely necessary so as to prevent the circulation of falsehood or misleading information to the general public.\n“Thus, the total seat capacity of the train is 840 seats.\nYou may also recall that the train manifest contained 362 validated passengers aboard the train.”The NRC boss hinted that the corporation, in continuation of its concerted effort through repeated calls, has been able to confirm the safety of “170 passengers, while 21 passengers are reported missing by the relatives who made calls to us,” Okhiria said.\n“In practical terms, a high powered restoration team, led by directors have been working round the clock to re-rail the coaches affected by the bomb blast."
  },
  {
    "headline": "Amaechi Joins Presidential Race",
    "summarized_story": "Minister of Transport, Mr Rotimi Amaechi, has joined the 2023 presidential race, THISDAY can reveal.\nWhile Amaechi has yet to make a formal declaration of his presidential bid, THISDAY at the weekend sighted a brochure prepared to sell his candidacy to Nigerians.\nIn line with the power zoning arrangement, agreed among political leaders since 1999, which rotates power between North and South, the presidential ticket of the ruling APC will move to South, as President Buhari who is serving his second term hails from the North.\nThe whole of Page Three of the brochure has the name of the minister boldly printed and translated into English as follows: Chibuike – God is Strength; Rotimi – Stand by Me; and Amaechi – Who Knows Tomorrow.\nThe brochure also has infographics of his achievements as Rivers governor and as transport minister ."
  },
  {
    "headline": "Buhari Meets El-Rufa’i over Kaduna Train Attack",
    "summarized_story": "Nasir El-Rufai of Kaduna State on Friday in Abuja updated President Muhammadu Buhari on security developments in his state following the Monday night’s terror attack on Abuja-Kaduna bound train.\nAccording to him, security agencies have been making frantic efforts to rescue victims of Monday night’s attack on a Kaduna bound train, from the hands of their abductors.\nEl-Rufa’i, who spoke in Hausa language, disclosed that the attack on the train was carried out by Boko Haram iinsurgents in collaboration with some bandits operating in Kaduna, Zamfara, Niger, Sokoto and Kebbi States.\nNAN recalls that the Kaduna-bound train, which left Abuja at 6 p.m. on Monday, was attacked by suspected terrorists at about 7.45 p.m., just about 15 minutes’ drive before Kaduna.\nEight persons had been officially confirmed dead, 46 hospitalised and several others kidnapped following the attack."
  },
  {
    "headline": "BREAKING: Dowen College Parents Demand Change Of School Management, Hostel Teachers, Organise Candlelight For Late Sylvester",
    "summarized_story": "“As parents of Dowen college students, we are still in shock and could not come to terms with this incident and the accounts so far provided by the school,students, and the media.\n“We therefore earnesly ask for a resolution that will bring some relief to the bereaved family, other parents, students of Dowen College and the public.\nDetails of which are as follow: Wednesday, December 8, 6pm; Dowen College.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students of Dowen College.\nThe Management of Dowen College in a statement had claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "BREAKING: Dowen College Parents Demand Change Of School Management, Hostel Teachers, Organise Candlelight For Late Sylvester",
    "summarized_story": "“As parents of Dowen college students, we are still in shock and could not come to terms with this incident and the accounts so far provided by the school,students, and the media.\n“We therefore earnesly ask for a resolution that will bring some relief to the bereaved family, other parents, students of Dowen College and the public.\nDetails of which are as follow: Wednesday, December 8, 6pm; Dowen College.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students of Dowen College.\nThe Management of Dowen College in a statement had claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "EXCLUSIVE: Buhari Government Plans To Convert Civil Servants To Teachers Despite Millions Of Unemployed Nigerian Graduates",
    "summarized_story": "The Muhammadu Buhari-led Federal Government has announced a new directive aimed at converting civil servants on levels 8 to 13 literally to the education sector to teach at the Federal Unity Colleges.\nA circular to implement this, obtained by SaharaReporters, is coming despite the teeming population of unemployed Nigerian graduates in the country who are qualified.\nTeacherAccording to the National Bureau of Statistics, the rate of unemployment in Nigeria rose to 33.3% in the last quarter of 2020 with many still unemployed and underemployed.\nIn the circular from the Office of the Head of Service of the Federation and dated July 23, the Federal Government urged interested staff members in the federal civil service to apply for positions in the education sector.\n“Be computer literate and prepared to undergo training that will qualify them to be registered with the Teacher Regulation Council of Nigeria; be willing to be posted to Federal Unity Colleges to teach; have up to 10 years remaining in the service.”There are 104 Federal Unity Colleges in the country and there has been dearth of teachers in the schools and other public schools in the country as the government refused to employ qualified hands into the sector."
  },
  {
    "headline": "EXCLUSIVE: Buhari Government Plans To Convert Civil Servants To Teachers Despite Millions Of Unemployed Nigerian Graduates",
    "summarized_story": "The Muhammadu Buhari-led Federal Government has announced a new directive aimed at converting civil servants on levels 8 to 13 literally to the education sector to teach at the Federal Unity Colleges.\nA circular to implement this, obtained by SaharaReporters, is coming despite the teeming population of unemployed Nigerian graduates in the country who are qualified.\nTeacherAccording to the National Bureau of Statistics, the rate of unemployment in Nigeria rose to 33.3% in the last quarter of 2020 with many still unemployed and underemployed.\nIn the circular from the Office of the Head of Service of the Federation and dated July 23, the Federal Government urged interested staff members in the federal civil service to apply for positions in the education sector.\n“Be computer literate and prepared to undergo training that will qualify them to be registered with the Teacher Regulation Council of Nigeria; be willing to be posted to Federal Unity Colleges to teach; have up to 10 years remaining in the service.”There are 104 Federal Unity Colleges in the country and there has been dearth of teachers in the schools and other public schools in the country as the government refused to employ qualified hands into the sector."
  },
  {
    "headline": "School Notebooks: N998 Million Oyo Government Project Exposes Contract Inflation, Jobs Awarded To Companies 2 Months After Registration",
    "summarized_story": "The contract, awarded in three batches, is to supply customised notebooks to secondary schools in the state.\nThe third set awarded in December 2020 at N446.370 million was for the supply of 212,505 copies of 60 leaves’ notebooks.\nThe December 2020 contract raises concerns as to why it will cost N446.370 million to supply 212,505 copies of 60 leaves notebooks.\nBy this budget, each copy of the 60 leaves notebook cost the state N2,100 to print.\nChecks by Dataphyte show that a non-customised 60 leaves notebook in Mokola, Ibadan, costs one hundred naira (N100)."
  },
  {
    "headline": "Kaduna train attack: Missing passengers now 22, phone numbers of 51 unreachable",
    "summarized_story": "The Nigerian Railway Corporation (NRC) says 22 passengers are missing following the recent attack on the Abuja-Kaduna train.\nGiving an update in a statement issued on Sunday, Fidet Okhiria, NRC managing director, said “51 phone numbers on the manifest are either switched off or not reachable since Tuesday morning”.\nAdvertisementHe said 35 phone numbers “are ringing but no response from the other end” while 60 phone numbers, when called, are said to be non-existent.\n“Two coaches earlier re-railed were safely moved to Rigasa Station.\nThis brings the total number of recovered coaches and safely moved to NRC stations to 7,” he said."
  },
  {
    "headline": "Kaduna train attack: Missing passengers now 22, phone numbers of 51 unreachable",
    "summarized_story": "The Nigerian Railway Corporation (NRC) says 22 passengers are missing following the recent attack on the Abuja-Kaduna train.\nGiving an update in a statement issued on Sunday, Fidet Okhiria, NRC managing director, said “51 phone numbers on the manifest are either switched off or not reachable since Tuesday morning”.\nAdvertisementHe said 35 phone numbers “are ringing but no response from the other end” while 60 phone numbers, when called, are said to be non-existent.\n“Two coaches earlier re-railed were safely moved to Rigasa Station.\nThis brings the total number of recovered coaches and safely moved to NRC stations to 7,” he said."
  },
  {
    "headline": "'Give us your guns' — Soludo offers amnesty to agitators in Anambra",
    "summarized_story": "Charles Soludo, governor of Anambra, says his administration has offered “amnesty” to agitators in the state.\nOver the past year, the south-east, including Anambra, has witnessed a spate of violent attacks with security operatives bearing the major brunt of the onslaught.\nOn Sunday, gunmen attacked a patrol team of the Federal Road Safety Corps (FRSC) in Anambra, which led to the death of two operatives.\nSpeaking on the development, Soludo said his administration is ready to rehabilitate and offer skill acquisition training to those willing to surrender.\n“We are taking it very seriously with an open manner to engage everyone and believing that everyone has some contribution to make."
  },
  {
    "headline": "'Give us your guns' — Soludo offers amnesty to agitators in Anambra",
    "summarized_story": "Charles Soludo, governor of Anambra, says his administration has offered “amnesty” to agitators in the state.\nOver the past year, the south-east, including Anambra, has witnessed a spate of violent attacks with security operatives bearing the major brunt of the onslaught.\nOn Sunday, gunmen attacked a patrol team of the Federal Road Safety Corps (FRSC) in Anambra, which led to the death of two operatives.\nSpeaking on the development, Soludo said his administration is ready to rehabilitate and offer skill acquisition training to those willing to surrender.\n“We are taking it very seriously with an open manner to engage everyone and believing that everyone has some contribution to make."
  },
  {
    "headline": "Mercenaries: ACF warns against 'fire brigade approach' in war against terrorism",
    "summarized_story": "The Arewa Consultative Forum (ACF) has cautioned against the importation of foreign mercenaries to fight terrorists in Nigeria.\nThe forum said this in reaction to comments made by Nasir El-Rufai, governor of Kaduna, after the attack on the Abuja-Kaduna train.\nReacting in a statement on Sunday, the ACF warned that “inviting mercenaries to fight our cause must be treated with utmost caution”.\nAdvertisementMurtala Aliyu, the forum’s secretary-general, said although the frustration of state governors is understandable, any form of fire brigade approach should be avoided.\n“The new dimension of the terror attacks, in the country, both on human and infrastructure calls for total war."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "Two years on, what has #YouTubeBlack Voices done for African creators?",
    "summarized_story": "While YouTube aims to provide a platform for creators globally to explore their creativity, in 2020, it shined a special focus on Africa when it launched the #YouTubeBlack Voices Fund.\nAdetula’s biggest takeaway from the Fund is the opportunity to network with and form relationships with over 135 other top creators around the world.\nThe Fund’s inaugural cohort last year featured a Creator Class of 20 content creators, from Nigeria, South Africa, and Kenya.\nStill, in South Africa, 25 channels have over 1 million subscribers, an increase of over 30%, year over year.\nOver 65% of watch time on content produced by channels in South Africa comes from outside of South Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "NowNow reaffirms commitment to driving financial inclusion in Nigeria",
    "summarized_story": "The company has built an ecosystem that digitises payments and creates access to financial services for Agents, Consumers and Businesses.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos.\nLekan Akinjide, the Partnership Director of NowNow Digital Services, said, “We are a leading fintech and financial services enabler.\nNowNow offers more than financial inclusion; we want to educate Nigerians about Financial services by teaching them how to manage their money to help them achieve financial independence.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis; Head of Marketing & Communications, NowNow, Tasyana Bouran; and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos."
  },
  {
    "headline": "Fantasy sports in Africa: Can $3m funding make it popular?",
    "summarized_story": "The love for the game is now shared with the passion for fantasy football or football betting.\nWhile fantasy sports in Africa might be a fantasy (pun intended), compared to sports betting, it is big in other regions.\nAdvertisementInstead of betting on real-life football teams, fantasy football involves gambling on virtual teams created by the player-manager.\nSome other European leagues have a fantasy version of their leagues, with the Fantasy Liga and Fantasy Bundesliga owned by the Spanish and German leagues, respectively.\nAccording to football magazine FourFourTwo, FPL has eight million players globally who compete to be the Jose Mourinho of fantasy football."
  },
  {
    "headline": "Grocery shopping with the community",
    "summarized_story": "AdvertisementThere were appearances from countries like Sudan, Namibia, and Uganda, and we discussed all that on the Techpoint Africa podcast.\nHowever, Kenyan startup, Tushop, uses community group buying to help Kenyans save on food.\nSomeone — usually called a community leader — aggregates orders from individuals who live close to each other.\nIt is then relayed to the vendor, farmer, or distributor, after which it is delivered to the community leader.\nLast week on the Techpoint Africa Podcast, we spoke about white founders in Kenya, so it’s interesting to see a black female founder from Kenya today."
  },
  {
    "headline": "How dollar spend limit on naira cards affects manufacturers",
    "summarized_story": "The new limit placed on bank customers’ dollar spending through their naira-denominated cards is taking a toll on manufacturers in Nigeria, BusinessDay has learnt.\nSome banks recently announced the reduction of the monthly spending limit on the naira debit cards to $20 from $100, while some temporarily suspended the usage of the cards for international transactions.\nRead also: From $4,000 to zero: Banks cut dollar spend on naira cardMore banks are notifying their customers of the downward review of the monthly spending limit on naira-denominated cards.\n“Also, international ATM withdrawals will not be allowed with our naira cards at this time.\nIn April 2015, the spending limit on naira-denominated cards for international transactions was $50,000 per person per annum or $4,166.7 per month."
  },
  {
    "headline": "Five themes that shaped Nigeria’s inflation in Q1",
    "summarized_story": "The rise in Nigeria’s inflation rate in the first quarter of 2022 was mainly shaped by the impact of the Russia-Ukraine crisis, and there may be yet more pain to come for households and businesses in the country.\nDriven by soaring energy and food prices, February’s price growth (inflation) outstripped the expectations of analysts as it came in at 15.70 percent against the 15.60 percent witnessed in January.\nWith the benefit of hindsight, BusinessDay highlights five themes that shaped inflation in the first quarter.\nThis is the highest core inflation rate recorded since April 2017, largely attributed to the significant increase in price of petroleum products.\nThe scary detail about these statistics is that the last time Nigeria witnessed a core inflation increase of this magnitude was the year Nigeria was battling recession and was also the year Nigeria witnessed its highest inflation rate in the last decade."
  },
  {
    "headline": "Second Niger Bridge gulps N157bn",
    "summarized_story": "The federal government through its Presidential Infrastructure Development Fund (PIDF) managed by the Nigeria Sovereign Investment Authority (NSIA) says it has so far spent some N157bn on the Second Niger Bridge which is now confirmed will be ready for opening by October this year.\nThe visit came barely three weeks after Ibrahim Gambari, chief of staff to the president equally toured the construction site to ascertain the extent of work on that bridge.\nRead also: Second Niger bridge to be ready by April – FG“I have come to see where this money is going.\nRead also: Second Niger Bridge: Enhancing social integration and regional connectivityCommenting on the project, Farouk Gumel expressed the board’s satisfaction with the quality and pace of work.\n“Undoubtedly, the 2nd Niger Bridge is a vital piece of national infrastructure."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo partners GIZ, Swiss agency on 3 job centre projects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has entered into partnership with the Deutsche Gesellschaft Für Internationale Zusammenarbeit (GIZ) and Swiss Agency for Development Corporation (SDC) on the establishment of three jobcentres across the state.\nThe new job centres are to be established across the three senatorial districts of the state, including Uromi, Esan North West Local Government Area (LGA); Auchi in Etsako West LGA, and Usen in Ovia South East LGA.\n“We launched the existing centres in September 2021, at the Edo Innovation Hub, at Wire Road and Edo Production Centre at Sapele Road.\nDare noted: “Solving the issue of unskilled graduates, unemployment and under-employment in one swoop, since 2017, EdoJobs has recruited workers for over 200 firms within and outside the state.\n“With a mission to provide a highly skilled workforce in Edo State, EdoJobs has also birthed other initiatives."
  },
  {
    "headline": "Obaseki recommits to free, credible LG polls, harps on responsibility, accountability in politics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has pledged to work with the electoral body and all other relevant stakeholders to ensure that the forthcoming local government election in the state is free, fair and credible.\nObaseki gave the assurance when he received the executive members of the Edo State chapter of the Inter-Party Advisory Council of Nigeria (IPAC) who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha said the country is in tough and perilous times, charging government officials on the need to be responsible and accountable to the people.\nHe noted, “With the local government elections soon approaching, we need to sit and brainstorm on how to ensure that the election is free, fair and credible.\nWe thank you for your courage as we assure you of this administration’s open-door policy.”Earlier, the Chairman of Edo IPAC, Hon."
  },
  {
    "headline": "PDP playing politics of hate, division, looted $20bn from NNPC – Presidency",
    "summarized_story": "Nigeria’s presidency has accused the country’s main opposition party, the People’s Democratic Party (PDP) of playing politics of hate and division, just as it alleged that the party looted $20bn from the NNPC.\n“We cannot ignore how PDP politicians sought—and continue to seek—to inflame ethnic and religious tensions by refusing to even proffer a solution to the herder-farmer clashes which became most prevalent under their misrule.\nWho can believe a word these people say, as they looked outwardly stylish but harrowed by power-sharing and other troubles inwardly?\n“These people, who play politics of division and hate, create communal disturbances, need to change.\nCheck the facts and leave the politics: What does the country get with this kind of gimmick?"
  },
  {
    "headline": "‘I’m not backing any candidate in 2023, don’t distract me’ – Pastor Adeboye",
    "summarized_story": "Pastor Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), has asked members of his church not to distract his attention with the politics of 2023, as according to him, he has no candidate.\n“I understand that some people have been writing all manners of articles about instructions that have been passed to all members of the Redeemed Christian Church of God,” Pastor Adeboye said.\n“Let me make it loud and clear and please I want you to listen with anointed ears and anointed hearts, Pastor Adeboye is not and will never be a politician.\nI have never been, I will never be, that is not my calling, I am called to be a pastor.\nThat is what God called me to be, that is why you don’t have me carrying a very big title."
  },
  {
    "headline": "Buhari is the best president in Nigeria’s history – Gov Masari",
    "summarized_story": "Governor of Katsina State, Aminu Bello Masari, has said that since the amalgamation of Nigeria in 1914, the country has never had a better government and President like Muhammad Buhari.\nSpeaking on the programme, the governor said, “Therefore, with this initiative which no administration has ever thought of, the President needs more commendation and support to achieve the purpose of the programme.\n“I wish to inform you that I am totally in support of this call for the president to make it law before the end of his tenure.\nBy doing such, it will continue to reduce the challenges Nigerians are facing.\nMasari assured the beneficiaries of the programme that their message will get to President Buhari and the national assembly."
  },
  {
    "headline": "Adeboye: I don’t know if there will be election in 2023, but don’t say I said there will be no election",
    "summarized_story": "He noted that that God spoke to him about the 2019 elections more than a year to the election but the case has not been so with the 2023 election.\n“As of now, as I am standing before you, I still don’t know whether or not there would be an election next year.\nDon’t say that Pastor Adeboye said there would be no election next year; that’s not what I said.\n“How come you don’t know?\n“I don’t know yet."
  },
  {
    "headline": "Again, IED Kills 3 Soldiers In Kaduna",
    "summarized_story": "Atleast three soldiers have been killed when terrorists suspected to be bandits planted an Improvised Explossive Device (IED) off the Abuja-Kaduna Expressway on Saturday.\nThe troops deployed at Gwagwa village were going for an operation when their vehicle stepped on IED planted by the terrorists.\nThis comes barely a week after terrorists ambushed troops along Abuja-Kaduna Expressway and killed seven soldiers.\nAs at press time, the Director, Defence Information, Major General Jimmy Akpor, did not respond to enquiries by our correspondent.\nAlso, the Director, Defence Media Operations, Major General Benard Onyeuko, did not respond to messages to confirm or refute the story."
  },
  {
    "headline": "Insecurity: IGP Leads Patrol On Abuja-Kaduna Expressway",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, on Saturday, led policemen on patrol on the entire 163km-stretch of the Abuja-Kaduna expressway for hands-on assessment of the security challenges and to personally supervise the operational deployment of officers drawn from the Police tactical squads to ensure the safety of travellers along the route.\nForce PRO, CSP Olumuyiwa Adejobi, said in the course of the patrol, the IGP mapped out some salient and strategic points along the expressway, which were immediately fortified with the deployment of operatives drawn from the Police Mobile Force (PMF), Counter Terrorism Unit (CTU), Special Forces (SF), Intelligence Response Team (IRT), the Special Tactical Squad (STS), as well as airwing operatives in charge of unmanned aerial vehicles of the Nigeria Police Force.\nThe IGP, during the patrol, equally visited personnel of the Armed Forces and Police deployed at Rijana to secure technical crew of the Nigeria Railway Corporation (NRC) undertaking repair works at the damaged train coaches and rail line in the axis, to boost their morale and assess the state of their post.\nThe Police spokesperson also said the inspector-general of Police assured that with the strategic and operational deployment of officers along the route, normalcy would once again be restored while he tasked members of the public on active intelligence sharing with law enforcement agencies for effective policing of all spaces.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Insecurity: IGP Leads Patrol On Abuja-Kaduna Expressway",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, on Saturday, led policemen on patrol on the entire 163km-stretch of the Abuja-Kaduna expressway for hands-on assessment of the security challenges and to personally supervise the operational deployment of officers drawn from the Police tactical squads to ensure the safety of travellers along the route.\nForce PRO, CSP Olumuyiwa Adejobi, said in the course of the patrol, the IGP mapped out some salient and strategic points along the expressway, which were immediately fortified with the deployment of operatives drawn from the Police Mobile Force (PMF), Counter Terrorism Unit (CTU), Special Forces (SF), Intelligence Response Team (IRT), the Special Tactical Squad (STS), as well as airwing operatives in charge of unmanned aerial vehicles of the Nigeria Police Force.\nThe IGP, during the patrol, equally visited personnel of the Armed Forces and Police deployed at Rijana to secure technical crew of the Nigeria Railway Corporation (NRC) undertaking repair works at the damaged train coaches and rail line in the axis, to boost their morale and assess the state of their post.\nThe Police spokesperson also said the inspector-general of Police assured that with the strategic and operational deployment of officers along the route, normalcy would once again be restored while he tasked members of the public on active intelligence sharing with law enforcement agencies for effective policing of all spaces.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Dankwambo Returns To Gombe 3 Years After",
    "summarized_story": "The immediate-past governor of Gombe State, Ibrahim Hassan Dankwambo, on Saturday, returned to the state after three years he had stayed away.\nDankwambo, who arrived at Gombe, the state capital around 2pm, was received by his teeming supporters, chieftains and members of the Peoples Democratic Party (PDP) in the state, who accompanied him from airport to the party’s state secretariat.\nThe former governor while appreciating the party faithful, who trooped out to receive him, donated a cash sum of N6million to party officials in the 11 local government areas of the state.\nLater in an interview with journalists, Dankwambo said he would spend some days in the state to interact with his people, assess the performance of the state government in the areas of security, projects and human development and thereafter express his views.\nADVERTISEMENTOur correspondent reports that there were speculations across the state that the former governor is going to vie for the Senatorial seat of Gombe North in 2023, the position he contested and lost to the incumbent Senator Sa’idu Alkali in the last 2019 polls."
  },
  {
    "headline": "Dankwambo Returns To Gombe 3 Years After",
    "summarized_story": "The immediate-past governor of Gombe State, Ibrahim Hassan Dankwambo, on Saturday, returned to the state after three years he had stayed away.\nDankwambo, who arrived at Gombe, the state capital around 2pm, was received by his teeming supporters, chieftains and members of the Peoples Democratic Party (PDP) in the state, who accompanied him from airport to the party’s state secretariat.\nThe former governor while appreciating the party faithful, who trooped out to receive him, donated a cash sum of N6million to party officials in the 11 local government areas of the state.\nLater in an interview with journalists, Dankwambo said he would spend some days in the state to interact with his people, assess the performance of the state government in the areas of security, projects and human development and thereafter express his views.\nADVERTISEMENTOur correspondent reports that there were speculations across the state that the former governor is going to vie for the Senatorial seat of Gombe North in 2023, the position he contested and lost to the incumbent Senator Sa’idu Alkali in the last 2019 polls."
  },
  {
    "headline": "10 shot dead, 19 injured as gunmen invade cultural festival in Plateau",
    "summarized_story": "By Polycarp AutaGunmen have killed 10 people and injured 19 others during a cultural festival in Chando Zerreci community in Irigwe Chiefdom of Bassa Local Government Area of Plateau State.\nMr Lawrence Zango, the National Publicity Secretary, Irigwe Youth Movement, disclosed this in a statement on Sunday in Jos.\nZango said that the criminals launched the attack on Saturday night during the annual ritual festival of ‘Zerreci’, which usually ushers them into the new farming season.\nZongo, who condemned and described that act as ”sad and unfortunate”, added that the injured are currently receiving treatment at Enos Hospital Miango.\n”Government must take more concrete steps to protect lives and property across Iregwe chiefdom and neighbouring communities,” he said."
  },
  {
    "headline": "Gunmen kill 2, kidnap 3 in Lagos community",
    "summarized_story": "By Deborah AkpedeThere was confusion between Friday and Sunday in Ayobo Housing Scheme Extension, Oshin area of Ayobo-Ipaja in Lagos State, as some gunmen invaded the area, allegedly kidnapped three persons and killed two others.\nThe News Agency of Nigeria (NAN) reports that some yet-to-be- identified gunmen on Friday allegedly kidnapped two married women before a repeat of the same incident on Sunday in the area.\nHe said that the gunmen came through the boundary between Lagos State and Ogun and escaped with their victims inside a boat.\n“We can no longer sleep and close our eyes as our lives are not safe.”He said that the parents of the two women allegedly kidnapped on Friday were currently receiving treatment at the hospital.\nAs at the time of filling this report, the Police Public Relations Officer, Lagos State Command, SP Benjamin Hundeyin, was yet to respond to calls and text messages sent to his cell phones."
  },
  {
    "headline": "BREAKING: IPOB cancels ‘sit at home’ in Southeast",
    "summarized_story": "Indigenous Peoples of Biafra (IPOB) has abrogated its sit-at-home directive in southeast Nigeria, saying the development is to embrace peace negotiations organised by the Anambra government.\nNAN reports that the decision was disclosed by the Chairman, Anambra Traditional Rulers Council, Igwe Nnaemeka Achebe, during a one-day peacebuilding and security meeting held in Awka on Saturday.\nHe said that the state government has set April 4 for prayers aimed at seeking God’s face to restore lasting peace in Anambra and South East as a whole.\n“Igboland has lost so much in the economic and social development of the zone and we are tired of the situation and want peace,” the traditional ruler said.\nThe speakers include Mr Uche Okafor, Anambra Speaker, who assured that the legislators would partner with the state government to enthrone lasting peace and economic development of the state and the zone."
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has officially joined the 2023 Presidential race.\nBello officially declared his decision to run for the Presidency on Saturday in Abuja.\nHis declaration lays to rest speculations surrounding him running for the Presidency in 2023.\nSpeaking, Zwingina described the Presidential aspirant as a detribalized Nigerian, who governs Kogi with appointees from other states.\nStressing that Nigeria needs Bello as a President, Zwingina noted that the “governor uprooted insecurity from Kogi, the state would have been a breeding ground for kidnapping and banditry, but for his leadership skills.”"
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has declared his candidacy for President in 2023.\nOn Saturday in Abuja, Bello formally announced his intention to run for President.\nHis announcement puts an end to rumors about him running for President in 2023.\nZwingina branded the Presidential candidate as a detribalized Nigerian who leads Kogi with appointees from other states, according to him.\nZwingina emphasized the importance of Bello as President, noting that the “governor removed instability from Kogi, the state would have been a breeding ground for kidnapping and banditry if it hadn’t been for his leadership qualities.”"
  },
  {
    "headline": "Ilesa COE Upgrade: PDP Has Lost Touch With Reality – Oyetola’s Spokesman",
    "summarized_story": "Spokesman to Governor Adegboyega Oyetola of Osun, Ismail Omipidan, has said the PDP has lost touch with reality, forgetting that the Governor has, in the last three years, always thought through his administration’s programmes and policies.\nHe was reacting to the claim by a faction of the Peoples Democratic Party, PDP, in Osun, that the Ilesa College of Education upgrade to a full-fledged University by the State Government was a deceit.\n“It is unfortunate that the PDP has decided to play politics with important issues.\n“Governor Oyetola has in the last three years plus fulfilled every promise he made.\nIjesa people know Oyetola; they know he is a man of impeccable character, whose word you can always take to the bank and you will return smiling,” Omipidan added."
  },
  {
    "headline": "Grammys 2022: 3 Nigerian artists lose out",
    "summarized_story": "One time Grammy winner, Wizkid, Femi Kuti and son Made Kuti, have lost out to win the 64th Grammy award in Las Vegas.\nAll the Nigerian stars missed out in two categories, Best Global Music Performance and Best Global Music Album, while the Beninese singer-songwriter, and actress, Angelique Kidjo, emerges the winner of the Global Music Performance in her hit song ‘Mohabbat‘In 2021, Wizkid got his first Grammy award for a feature on Beyonce’s song, ‘Brown Skin Girl,’ while Burna Boy won the Best Global Music Album category after losing out in 2020."
  },
  {
    "headline": "Train attack: 170 passengers safe, 21 still missing, 7 coaches recovered – NRC",
    "summarized_story": "The Nigerian Railway Corporation (NRC) Sunday confirmed the safety of 170 passengers aboard the Abuja-Kaduna train attacked by terrorists last Monday.\nThe corporation also said seven coaches were recovered while efforts were on towards restoring normalcy in its services to the teeming customers.\n“We did also state that 170 of the passengers on board the train are safe while 21 other passengers are reported missing.\nThis brings the total coaches so far re-railed to 7, but only 5 successfully moved to the stations.\nAliyu said: “The new dimension of the terror attacks, in the country, both on human and infrastructure calls for total war."
  },
  {
    "headline": "Breaking: Again, gunmen invade Anambra, kill FRSC officials on duty",
    "summarized_story": "Unknown gunmen on Sunday afternoon attacked and reportedly killed officials of the Federal Road Safety Commission (FRSC) who were on duty post in Anambra state.\nBlueprint gathered that the incident occurred along Igbokwu-Ezinifite-Uga link road located around Aguata local government area.\nFew days ago, hoodlums invaded Nnewi South local government headquarters, set it ablaze and killed a security guard.\nAbout 48 hours later, same gunmen attacked a police divisional headquarters in Amichi and reportedly killed Policemen on duty.\nFRSC authority is yet to speak on the latest incident till the time of filling this story."
  },
  {
    "headline": "Hello world! – Nigerian Pilot News",
    "summarized_story": "Hello world!\nWelcome to WordPress.\nThis is your first post.\nEdit or delete it, then start writing!"
  },
  {
    "headline": "Kaduna Train Attack: 21 Passengers Still Missing – NRC",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has said 21 passengers are still unaccounted for following the attack on an Abuja-Kaduna-bound train about a week ago.\nThis is according to a statement issued on Sunday by the Managing Director of the NRC, Fidet Okhiria.\nRELATEDAbuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – AmaechiKaduna Train Attack Questions Our Collective Ability To Govern – Nigerian GovernorsKaduna Train Attack: FG To Begin Repair Works, Recruit Locals For Security“From the last press release, we confirmed that 4 No.\nCoaches (SP 00004, SP 00009, SP00012, and SP000I3) out of the 11 No.\nWe did also state that 170 of the passengers on-board the train are safe while 21 passengers are reported missing,” the statement read."
  },
  {
    "headline": "Oil Theft: Nigeria Might Be Sliding Into Bankruptcy – Pastor Adeboye",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, has rued oil theft in the country, warning that Nigeria might go bankrupt if the trend is not checked.\n‘Daddy Adeboye,’ as he is fondly called, said this in a sermon to his congregation during a thanksgiving service on Sunday.\nAccording to him, over 90 per cent of Nigeria’s revenue from crude oil sales is used to furnish interest accruing on debt.\nPastor Adeboye, however, clarified that his position “has nothing to do with partisan politics,” maintaining that he is not interested in the political party members of his church belong to.\n“Don’t say that Pastor Adeboye said there would be no election next year; that’s not what I said."
  },
  {
    "headline": "9.5 Million Tramadol Tablets Worth N5bn Seized At Lagos Airport, Abuja, Edo",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has seized at least 9.5 million tablets of pharmaceutical opioids: Tramadol and Exol 5 worth over N5 billion at the Murtala Muhammed International Airport (MMIA), Ikeja Lagos, the Federal Capital Territory, Abuja and Edo State.\nThis was disclosed in a statement issued by the Director, Media & Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi on Sunday.\nAt the Port Harcourt International Airport, PHIA, a Brazilian returnee Nnanna Anayo Michael, was arrested during the inward screening of passengers on board Qatar Airline flight QR1433 from Doha to Port Harcourt on Tuesday, 29th March.\nDuring a preliminary interview, Nnanna said he departed Sao Paulo, Brazil on Sunday midnight en route Qatar to Port Harcourt.\nHe claimed an unidentified person in Sao Paulo gave him six-bed sheets in which the drug was concealed to deliver to another unidentified person at Port Harcourt International Airport, Omagwa."
  },
  {
    "headline": "Nigerians Are Not Safe On Trains, Roads And At Airports, Obasanjo Laments",
    "summarized_story": "﻿Former President Olusegun Obasanjo has lamented that the security challenges in the country are becoming more overwhelming as Nigerians are no longer safe on roads, in trains or at airports.\n“A situation where we are not safe on the roads, in the train, we are not safe at the airport then what is remaining?” he asked.\nThe Abuja-Kaduna train is very popular as it had been considered a safer transportation option compared to the roads which were notorious for terrorist attacks.\nDays prior to the train attack, terrorists had also attacked the Kaduna International Airport.\n“The situation we’re in, in the country today, is not a situation where one man will say yes, I have a solution."
  },
  {
    "headline": "2023: Buhari Has Laid A Foundation I Can Build Upon – Yahaya Bello",
    "summarized_story": "Governor Yahaya Bello has hailed President Muhammadu Buhari for his infrastructure drive and efforts at tackling insecurity.\nThe Kogi State leader says he will build on such a legacy if elected as Nigeria’s president.\nHe accused the leading opposition Peoples Democratic Party (PDP) of failure to build infrastructure in the country.\n“Today, I am running to build on the successes of President Muhammadu Buhari because of his performance,” the governor said during the current affairs show.\n“In 2015, I dare not because there was no foundation whatsoever to build upon."
  },
  {
    "headline": "APC Leadership has not been fair to Zamfara",
    "summarized_story": "Senator Kabiru Marafa says the All Progressives Congress has not been fair and just to the people of Zamfara StateHe says he and other party chieftains in the state are among the founding fathers of the APC but the party under the Mai Mala Buni led administration was not fair to them.\nSenator Kabiru Marafa stated this while speaking to Newsmen in Gusau, the Zamfara State CapitalThe former two term red Chamber lawmaker adds that he and former Abdul’azeez Yari remain in the APC to prove that they are card carrying and duly registered members of the party as against the stories making the round that they are notSenator Marafa further says if the people of Zamfara State decided not to continue to support the ruling APC is vase in the fact that they were not treated fairlyOver Seven hundred and fifty thousand APC Members according to him were registered before the registration was cancelled"
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "Babangida pledges support for PDP consensus arrangement",
    "summarized_story": "Former Military President, Ibrahim Badamasi Babangida has met with some aspirants contesting for the office of the president on the platform of the Peoples’ Democratic Party (PDP) for the forthcoming general.\nWhile briefing Journalists on Thursday after a closed door meeting with the three PDP Presidential aspirants for 2023 elections, former Senate President, Dr. Abubakar Bukola Saraki, Governor Aminu Waziri Tambuwal of Sokoto State and Bauchi State Governor, Senator Bala Mohammed.\nSpeaking on behalf of other Aspirants, Senator Abubakar Bukola Saraki said the visit to the former General Babangida was to seek his advice and guidance on the way to go and to achieve the planned consensus in the PDP."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "Shanghai Orders Covid Tests for All 26 Million Residents",
    "summarized_story": "Shanghai on Sunday ordered its 26 million residents to undergo two more rounds of tests for COVID-19 as public anger grows over how authorities in China’s most populous city are tackling a record coronavirus surge.\nResidents should self-test on Sunday using antigen kits and report any positive results, Shanghai government officials told a news conference, while a nucleic acid test would be conducted citywide on Monday.\nShanghai on Sunday reported 7,788 daily locally transmitted asymptomatic cases, up from 6,501 the day before, while symptomatic cases rose to 438 from 260.\nThe city accounted for the bulk of mainland China’s 11,781 daily locally transmitted asymptomatic cases and nearly one-third of its 1,506 symptomatic cases.\nread moreSome have also demanded clarity over the testing regime, after a recorded phone call, reportedly between a Shanghai health official and a resident, was widely shared on Chinese social media."
  },
  {
    "headline": "Russian Missiles Hit Ukraine’s Strategic Port Odessa",
    "summarized_story": "Air strikes rocked Ukraine’s strategic Black Sea – Air strikes rocked Ukraine’s strategic Black Sea port of Odessa early Sunday, AFP reporters said, but there were no casualties, according to the army.\nAt least three huge columns of black smoke and flames rose into the sky over an industrial zone.\nThe rocket attacks came as Russian forces and appeared to be withdrawing from the country’s north after Kyiv warned that Moscow was trying to consolidate troops in the south.\nOn Friday, Ukraine’s President Volodymyr Zelensky warned Russia was consolidating and preparing “powerful strikes” in the south, joining a chorus of Western assessments that Moscow’s troops were regrouping.\nOdessa, a historic city of around one million people, is Ukraine’s largest Black Sea port and has escaped the worst of the fighting."
  },
  {
    "headline": "Nigeria will Continue to Explore Fossil Fuels, Deputy Oli Minister Sylva Says",
    "summarized_story": "Nigeria’s Minister of State, Petroleum Resources, Mr Timipre Sylva, has said that despite the global opposition to the exploitation of hydrocarbons, the country will not jettison her God-given resources.\nThe minister warned that the risk of limited international financing could even jeopardise Nigeria’s energy transition and roadmap to attaining net-zero as government and corporate bodies continue to discourage investment in fossil fuels.\nRelatedStories No Content AvailableThe minister stated that adequate financial resources and effective policies designed to encourage investments in the oil and gas industry in Nigeria were required to enable the country to meet the increasing energy demand.\n“Oil will also continue to be much needed, especially for the development of our lagging petrochemical industry.\n“That notwithstanding, Nigeria still aims at reducing greenhouse gas emissions by 20 per cent by 2030 through anti-gas flaring regulations and working closely with oil and gas companies,” the minister said."
  },
  {
    "headline": "Nigeria Scraps Post-Arrival PCR Covid Test for Fully Vaccinated Travellers",
    "summarized_story": "Nigeria’s federal government has scrapped post-arrival PCR COVID tests for fully vaccinated travellers entering Nigeria.\nIn-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights.”“Fully vaccinated passengers arriving Nigeria will not also be required to carry out post-arrival PCR test or a rapid antigen test upon arriving Nigeria.\n“Travellers must bring along an electronic or hard copy of their negative COVID-19 PCR test for presentation at the departure airport and upon arrival in Nigeria.\n“On arrival in Nigeria, unvaccinated or partially vaccinated travellers are to show up at the laboratory/sample collection centres chosen by them while filling the NITP on the 2nd and 7th day of arrival.\n“Samples will be taken, and a COVID-19 PCR test done."
  },
  {
    "headline": "Soyinka: Omisore’s Election as APC National Secretary Has Crippled Probe of Bola Ige’s Murder",
    "summarized_story": "After his impeachment, Omisore was arrested and detained over Ige’s murder but he repeatedly denied any involvement.\nOmisore, a former senator, was adopted as the APC National Secretary at the party’s last national convention in Abuja.\n“That the prime suspect was privileged in some improper ways went beyond mere allegation.\nHe lamented that barely three months had passed since the 20th anniversary of Ige’s murder – an occasion, which according to him, was used to remind the president of a subsisting election pledge.\nEventually,” Soyinka said in his statement doubting the president’s pledge to resolve Ige’s murder."
  }
]