[
  {
    "headline": "NJC appoints nine Heads of Court, 54 judges for 16 states, bars erring judges from promotion",
    "summarized_story": "The National Judicial Council has appointed nine Heads of Court and 54 judges for 16 states.\nHis Lordship is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\nHe is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\nHe is also to receive warning letter to be circumspect in granting such Exparte Orders in the future.\nJustices S. A. Omonua and O. S. Uwuigbe of the Edo State High Court; Hon Justices M. A. Pindiga and Beatrice L. Iliya of the High Court of Gombe State; Hon."
  },
  {
    "headline": "Obiano mourns as ex-Gov Ezeife loses wife",
    "summarized_story": "The Anambra State government led by Governor Willie Obiano has commiserated with former governor Chukwuemeka Ezeife over the death of his wife, Mrs Njideka Ezeife, which occurred three days ago.\nMrs Ezeife was the Anambra State First Lady from January 1992, to November 1993, when the husband was the state governor.\nHer husband was the first elected Anambra State governor following the creation of the state on August 27, 1991, by the military regime.\nAdinuba noted that Mrs Ezeife would be remembered also for her role in making the Ezeife administration adhere strictly to prudent financial management and laying the foundation for the subsequent development of the state.\n“Far from bemoaning their fate,” stated Adinuba, “Mrs Ezeife and the family accepted their new condition with philosophical equanimity."
  },
  {
    "headline": "How I built my Lekki house ― Ayo Adebanjo",
    "summarized_story": "Tasks EFCC to verify his claimBy Dapo AkinrefonChief Ayo AdebanjoLeader of the pan-Yoruba socio-political organisation, Afenifere, Pa Ayo Adebanjo, on Thursday, faulted former Interim National Chairman of the All Progressives Congress, APC, Chief Bisi Akande that Asiwaju Bola Tinubu built his Lekki house.\nAkande, in his autobiography, titled: ‘My participations’ alleged that Adebanjo pestered National Leader of the APC, Asiwaju Bola Tinubu to build him a house in Lekki.\nBut I owe a duty to myself and to put the record straight for posterity about the big lie that Bola Tinubu built my house in Lekki for me.\nI then took a loan from GTBank to complete the house in Lekki where I am living now.\nThe contractor who built my Lekki house is Engr."
  },
  {
    "headline": "Otedola: I have no interest in holding any board position in FBN Holdings, First Bank",
    "summarized_story": "Femi OtedolaThe Chairman of Geregu Energy Group and billionaire businessman, Mr Femi Otedola has debunked speculations that he his interested in holding any board position in FBN Holdings, First Bank or any of their subsidiaries.\nIn a brief chat with Mr Otedola was asked about his next steps after becoming the single largest shareholder of FBNHOLDINGS.\nMy interest, contrary to speculations is not to become chairman of the bank or its Holdco.\nOtedola praised the financial institution, saying “being the single largest shareholder doesn’t mean I must necessarily hold a position in the bank.\nMarket analyst speculate that Otedola must have pumped a whopping 45 billion Naira to attain this dominant position."
  },
  {
    "headline": "[EXPLAINER] Marriage registry controversy: What the court actually said",
    "summarized_story": "By Innocent AnabaThe Federal High Court in Lagos has not barred the Federal Government-owned Marriage Registries of Ikoyi, Lagos and the Federal Capital Territory Abuja from further contracting marriages under the Marriage Act, 2004.\nHe granted the prayer to the extent that there shall be no Federal Marriage Registry in the Marriage Districts (Local Government Councils) save Ikoyi and Abuja Federal Marriage Registry which predate the 1999 Constitution.\nM6 Laws of the Federation of Nigeria (LFN), 2004 within the Plaintiffs’ Local Government Councils Area.\nM6 Laws of the Federation of Nigeria (LFN), 2004 within the Plaintiffs’ Local Government Councils Area.\nM6 Laws of the Federation of Nigeria (LFN), 2004 within the Plaintiffs’ Local Government Councils Area."
  },
  {
    "headline": "Karibi Fubara: Nollywood loses another actor",
    "summarized_story": "By Emmanuel OkogbaNollywood actor, Karibi Fubara has passed on according to a tweet by a family member, Ayayi Fubara Eneli on Wednesday.\n“My brother, Karibi Fubara, has joined the ancestral realm.\nKaribi who was part of the series, Smart Money Woman – a girl’s journey to financial freedom also starred in other notable movies like God Calling, Castle and Castle, Royal Hibiscus Hotel and Quam’s Money.\nHe was diagnosed with a large mid-stage kidney tumor/cancer in 2020 and had been in Dubai receiving treatment.\n🕊🕊🕊”Karibi was married to fashion entrepreneur, Yolanda Okereke."
  },
  {
    "headline": "Holding Charge practice must stop — Lawyers",
    "summarized_story": "“However, it looks like the old form of Holding Charge is gradually giving way to a new practice flowing from recent Criminal Justice legislations.\n“There is a new dimension to Holding Charge following the enactment of the Administration of Criminal Justice Act, ACJA, and the Administration of Criminal Justice Laws in the states.\n“ACJA has annihilated Holding Charge and every Magistrate Court now has the power to grant bail even in capital offence cases, where the evidence clearly shows that the charge is frivolous.\nThe continued indulgence in Holding charge reflects the lawlessness around us.\nErring magistrates should be punished— AdegborioyeAdenrele Adegborioye, said: “Holding charge is illegal and unconstitutional."
  },
  {
    "headline": "NJC bars judges from promotion over issuance of conflicting ex-parte orders",
    "summarized_story": "The affected judges are said to have granted conflicting ex-parte orders in matters with the same parties and subject matters.\nHe was also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\nHe is also to receive a warning letter to be circumspect in granting such Exparte Orders in the future.\nJustices S. A. Omonua and O. S. Uwuigbe of the Edo State High Court, Hon Justices M. A. Pindiga and Beatrice L. Iliya of the High Court of Gombe State, Hon.\nJustice A. K. Fowe, High Court, Ekiti State, Hon."
  },
  {
    "headline": "Council polls: Kogi govt fraudulent – Activist, Miliki",
    "summarized_story": "A popular activist, Comrade Idris Miliki, has accused the Kogi State Government of fraudulent activity for not releasing the local government election result one year after it was conducted.\nDAILY POST recalls that the Kogi State council election was conducted on 12th December 2020.\n“One year after the purported kangaroo Local Government election was conducted in Kogi State, we are yet to have access to the election result.\nWhat is still keeping them from releasing the council result?\nHe admonished Governor Yahaya Bello to mandate the Kogi State Independent Electoral Commission (KOSIEC) to release the result without further delay."
  },
  {
    "headline": "Akeredolu vows to fish out killers of Ondo high chief",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State has vowed to fish out the killers of a High Chief in Owo town, headquarters of Owo Local Government Area of Ondo State.\nWhile commiserating with the Olowo of Owo, Oba Ajibade Ogunoye, over the killing of one of his High Chiefs, Chief Elewere Tunde Ilori, Akeredolu maintained that the perpetrators will be brought to book.\nChief Ilori was killed on Wednesday evening by gunmen while on his way from where he had gone to resolve a land issue.\nLucky Aiyedatiwa, who led the government delegation to the palace of Oba Ogunoye in Owo town.\nAccording to the governor, no stone will be left unturned in ensuring that the culprits are apprehended."
  },
  {
    "headline": "Banditry: Zamfara group cries to President Buhari for help",
    "summarized_story": "More than a hundred houses have been invaded by bandits within a month.\nThere’s no day bandits would not attack either the road, towns or both with no resistance from security personnel.\nThey are now the unofficial custodians of this road,” the letter explained.\n“Within a month, bandits have killed tens of people and kidnapped hundreds along Moriki – Shinkafi road.\nIt said that the health system of the entire Moriki town has collapsed as the General hospital has been deserted by the people, stressing that relatives of patients evacuated them for security reasons."
  },
  {
    "headline": "ASUU denies receiving N52.12bn, accuses FG of misleading Nigerians",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) yesterday denied receiving the sum of N52.12 billion as claimed by the Federal Government.\nThe Minister of Labour and Employment, Chris Ngige, recently declared that the government has released the sum to ASUU as part of the cumulatively earned allowance owed to the union.\nProfessor Abdulkadir who described the claim as “deceptive, misleading and aimed at smearing the image of our Union and members in the public eye”, insisted ASUU will not be submissive to mischievous attempts orchestrated by the government.\n“For the record, the N30billion out of which N20billion was released for revitalization was given to university managements to address infrastructural decay on our campuses; no single kobo was given to any member of ASUU (out of this).\n“It is also pertinent for the public to note that even the N22.17billion EAA that was paid, only 75 per cent was due to our members while the remaining 25 per cent was given to other sister unions."
  },
  {
    "headline": "How Tinubu and I came to trust each other, by Akande",
    "summarized_story": "How Tinubu and I came to trust each other, by AkandeA former All Progressives Congress (APC) National Chairman Chief Bisi Akande has explained the reasons behind his smooth relationship with ex-Lagos State Governor Asiwaju Bola Tinubu.\nAkande, in his book, ‘My Participation’, said he and Tinubu used to argue over political discretions.\nHe added that Tinubu trivially assumed that the political culture of Lagos could work in the rest of the Southwest.\nThe ex-Osun governor said Tinubu always “absorbed my angry political tantrums as old-fashioned and with jocular snubs”.\nAnd we came, at last, to trust each other absolutely,” he wrote."
  },
  {
    "headline": "‘I was bowled over by Awolowo’s sense of humour’",
    "summarized_story": "He said he was bowled by Awolowo’s sense of humour, and mesmerised by his fatherly gesticulations in explaining difficult issues.\n“They went to Chief Awolowo with Chief Fasanmi as guide and mentor.\n“I was bowled by his sense of humour and truly mesmerised by his fatherly gesticulations in explaining difficult issues.\n“We, in the union, agreed in principle, to prefer Awolowo’s politics to any other.\n“Shortly after our visit to him, Chief Awolowo, accompanied by Chief Fasanmi, Chief Michael Omisade and Chief S.M."
  },
  {
    "headline": "‘My wife’s death left me emotionally empty’",
    "summarized_story": "Former All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the death of his wife, Mowumi, left him emotionally empty.\nIn his book, ‘My Participations’, he said despite the care from his children and friends, he has not been able to get over his wife’s death.\n“Sometimes I move round my room in lonely soliloquy with the imaginary sentiment that my wife would suddenly answer me.\nHe added that the way his children celebrate their mother makes death inviting to him.\n“And I have been praying to die such a painless death and for my funeral to be as glorious as that of my wife,” he wrote."
  },
  {
    "headline": "‘Friends used my home for romantic escapades’",
    "summarized_story": "As a young man, friends used the home of former All Progressives Congress (APC) National Chairman Chief Bisi Akande for romantic escapades.\nHe said though he was earning a good salary at the British Petroleum Marketing Company in Lagos, he was always broke because he roamed about, drank with friends and spent beyond his means.\nIt took his marriage to Mowumi on December 26, 1966 for his life to change.\nHe met Mowumi in Ila-Orangun on a day a policeman was threatening to pounce on her.\n- Advertisement -“It appeared to me however that marriage made me so responsible that friends who used to use my apartment for their romantic escapades stopped and began to treat our home with respect."
  },
  {
    "headline": "Presidency knocks Obasanjo, others over attacks on Buhari",
    "summarized_story": "- Advertisement -Ex-President Obasanjo had on Monday claimed that President Buhari has nothing more to offer the nation.\nObasanjo said: “President Buhari has done his best.\n“ President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nHe added:” President Buhari is leaving a legacy of security, infrastructural development, economic prosperity and social cohesion for Nigeria.\n“Gentlemen, President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country."
  },
  {
    "headline": "Breaking: Glamour as APC chairmanship aspirants clash in Abuja",
    "summarized_story": "The Adetokumbo Ademola Crescent, Wuse 11, FCT Abuja, venue of the public annual lecture, involving the entire All Progressives Congress (APC) National Chairmanship aspirants, was full of glitz and glamour in the early hours of Thursday.\nSupporters of the aspirants numbering hundreds converged at the entrance of the Rockview Hotel, grounding vehicular and human movement with their drumming and dancing.\nWielding posters of the various aspirants with various inscriptions projecting them, the supporters had a fun-filled day.\nThe annual lecture was organised by the APC Press Corps which had the topic: “APC beyond 2023-the tasks ahead: The role of stakeholders, was used as an intellectual ground for the aspirants for the position of the chairmanship of the party."
  },
  {
    "headline": "Don’t set Nigeria on fire, FG warns Obasanjo, critics",
    "summarized_story": "On Monday, Obasanjo, at a retreat on inclusive security in Abuja, organised by the Global Peace Foundation and Vision Africa, said: “President Buhari has done his best.\nMohammed, said: “The polity has recently been awash with heightened commentary on the security situation in the country.\n“President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nPresident Buhari continues to do much more to keep Nigerians safe.\nPresident Buhari is leaving a legacy of security, infrastructural development, economic prosperity and social cohesion for Nigeria."
  },
  {
    "headline": "Tension as bandits kill Kaduna lawmaker",
    "summarized_story": "From Sola Ojo, KadunaThere was palpable tension among the residents of Kaduna and motorists plying Kaduna-Zaria Highway over Monday night’s deadly attack that left four people, including the lawmaker representing Giwa West and Chairman House Committee on Local Government in the Kaduna State House of Assembly, Rilwanu Aminu Gadagau, dead.\nKaduna-Abuja highway, Kaduna-Birni Gwari road, Kaduna-Zaria road and Kaduna-Kachia road have all had their fair shares of the nefarious activities of bandits, who have been responsible for the killing, maiming, raping and kidnapping of scores of residents and travellers.\nUnlike Kaduna-Abuja road, where there is rail transport alternative, motorists plying other roads that connect Kaduna town are on their own.\nHonourable Gadagau was a young and dynamic lawmaker, who had a passion for his constituency, state and Nigeria.\nHe said: “I’m deeply shocked at the gruesome murder of a young and dynamic member of the Kaduna State House of Assembly, Rilwanu Gadagau, by terrorists on the Kaduna-Zaria expressway."
  },
  {
    "headline": "FEC approves 20% salary increase for Nigeria Police",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC) has approved a ‘peculiar allowance’ for the Nigeria Police Force, increasing the policeman’s take-home pay by 20 percent, as part of the government’s reformation plans for the force.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMinister of Police Affairs, Maigari Dingyadi, disclosed this at the end of the week’s virtual FEC meeting, presided over by President Muhammadu Buhari in Abuja.\nFEC also has approved a bill known as Nigeria Start-Up Bill, for onward transmission to the National Assembly for passage into law.\nHe said: “The first one is on the Nigeria Startup Bill, which is exciting news to our innovators all over the country, particularly those who are working within the tech industry."
  },
  {
    "headline": "Ghana’s strict COVID-19 testing not meant to harass Nigerians – Envoy",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGhana’s High Commissioner to Nigeria, Ambassador Rashid Bawa, has assured that the required Coronavirus (COVID-19) testing procedures for travellers to the West African country were not meant to harass and embarrass Nigerians.\nHe gave the assurance when he visited the Chairman/CEO, Nigerians in Diaspora Commission (NiDCOM), Mrs Abike Dabiri-Erewa, in Abuja.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHis visit followed the alleged maltreatment of a Nigerian who tested negative to COVID-19 in Dubai only to test positive on arrival in Ghana.\nThe envoy pointed out that while the COVID-19 Polymerase Chain Reaction (PCR) test was mandatory, Ghana would not maliciously produce COVID-19 positive test results for visitors, especially Nigerian visitors."
  },
  {
    "headline": "Adebanjo Fights Back, Debunks Akande’s Claim Tinubu Built Lekki House for Him",
    "summarized_story": "Akande had in his book titled ‘My Participation’ launched last Thursday, claimed that Adebanjo brought pressure on Tinubu to build the Lekki home for him.\n“The house was commissioned in 1972 by Chief Obafemi Awolowo.\n“It was later occupied by one of the wives Chief Pius Akinyelure, who often visit his wife there in company of Senator Bola Tinubu.\n“I then took a loan from GTBank to complete the house in Lekki where I am living now*.\n“The contractor who built my Lekki house is Engr."
  },
  {
    "headline": "To Boost Morale, FG Increases Police Salary By 20% Effective January 2022",
    "summarized_story": "Dingyadi said FEC also approved a review and upgrading of the take home pay of police personnel in Nigeria.\nThis will come out to about ten billion and thirty million naira with effect from 2022.\nMost importantly, government also approved payment of about 20 per cent of CONPOST, it is peculiar allowances to boost morale, and take home pay of the Nigeria Police.\n“This 20 per cent is percentage of the total salary, known as peculiar allowance.\nAhmed assured that the police salary increase would come into effect once the supplementary budget was approved by the legislative arm."
  },
  {
    "headline": "Electoral Bill: Three Days to Go, Buhari Keeps Nigerians in Suspense",
    "summarized_story": "Timothy Golu, has expressed optimism that Buhari would sign the bill eventually.\nBut the presidency and the National Assembly had quickly come out to dismiss it as untrue.\n“I mean, it belies logic that the president would write to the National Assembly after they had proceeded on recess.\n“I don’t think the president will be ready to be embarrassed by the National Assembly at that level.\nThose who do not want it know, those who didn’t want it know what they did to get to the National Assembly,” Golu further stated."
  },
  {
    "headline": "Otedola: I Have No Interest in Holding Any Board Position in FBN Holdings, First Bank",
    "summarized_story": "Dike OnwuamaezeThe Chairman of Geregu Energy Group and billionaire businessman, Mr. Femi Otedola has debunked speculations that he is interested in holding any board position in FBN Holdings, First Bank or any of their subsidiaries.\nIn a brief chat with THISDAY at the ExecuJet Private terminal in Lagos yesterday, Otedola was asked about his next steps after becoming the single largest shareholder of FBNHoldings.\nHe smiled and said he did not acquire the bank’s shares because he wanted to be chairman of the bank.\nMy interest, contrary to speculations is not to become chairman of the bank or its holding company (Holdco).\nOtedola praised the financial institution, saying “being the single largest shareholder doesn’t mean I must necessarily hold a position in the bank."
  },
  {
    "headline": "Bankers’ Committee Pledges to Prioritise Infrastructure Financing in 2022",
    "summarized_story": "The CBN Governor, Mr. Godwin Emefiele disclosed this yesterday at the closing ceremony the 12th Annual Bankers’ Committee retreat.\nHe also added that the CBN and Bankers Committee through Infrastructure Company Limited (InfraCo) would facilitate an initial funding of N170 billion for the Lagos- Ibadan expressway, Abuja-Kano Road and the second Niger bridge which would be tolled.\nHe said: “In 2022, the Bankers Committee will be focusing on supporting the CBN and the federal government in developing the infrastructure of the country, reducing the level of infrastructure deficit of the country; realising that there is increasing limited fiscal space to fund capital projects.\nThe entire scope of those three projects I’m told is slightly above N1 trillion but the numbers are being worked on.\nThis is a brilliant alternative financing methodology that has been brought up and we seek to really look into this."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Again Presidency Confirms SaharaReporters’ Story, Says Junketing Buhari Will Leave For Turkey Thursday",
    "summarized_story": "President Muhammadu Buhari will today, Thursday leave Abuja for Istanbul, Turkey to attend the third Turkey-Africa Partnership Summit.\nSee Also Politics Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura“There is another trip to Turkey this December; all teams going with the President have already submitted their passports for visa processing,” a presidential source had told SaharaReporters.\nThe Nigerian President has been junketing across the world in the last three months.\nThen on Sunday, October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office.\nSee Also Exclusive EXCLUSIVE: Junketing Nigerian President, Buhari To Embark On Another Trip To TurkeyThe President, however, on Tuesday, November 2 secretly abandoned the conference and travelled to London for a medical checkup."
  },
  {
    "headline": "Again Presidency Confirms SaharaReporters’ Story, Says Junketing Buhari Will Leave For Turkey Thursday",
    "summarized_story": "President Muhammadu Buhari will today, Thursday leave Abuja for Istanbul, Turkey to attend the third Turkey-Africa Partnership Summit.\nSee Also Politics Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura“There is another trip to Turkey this December; all teams going with the President have already submitted their passports for visa processing,” a presidential source had told SaharaReporters.\nThe Nigerian President has been junketing across the world in the last three months.\nThen on Sunday, October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office.\nSee Also Exclusive EXCLUSIVE: Junketing Nigerian President, Buhari To Embark On Another Trip To TurkeyThe President, however, on Tuesday, November 2 secretly abandoned the conference and travelled to London for a medical checkup."
  },
  {
    "headline": "Report: 322 police officers, 642 soldiers -- how security operatives were killed in one year",
    "summarized_story": "AdvertisementThe report released by the research and intelligence firm on Thursday examined combatant attacks in the period of Q4 2020 and Q3 2021.\nTo curb the violent attacks, the country’s military is currently carrying out operations in many parts of the country, especially in the northern part of the country.\nIn the report, 642 personnel of the Nigerian military and 322 police officers were killed in the period under review.\nAdvertisementOperatives of other security agencies were also killed in attacks — 11 personnel of the Nigeria Security and Civil Defence Corps (NSCDC) and five personnel of the Nigeria Customs Service were affected.\nThe report also stated that 973 members of Boko Haram and 290 cultists were killed in combatant attacks."
  },
  {
    "headline": "Report: 322 police officers, 642 soldiers -- how security operatives were killed in one year",
    "summarized_story": "AdvertisementThe report released by the research and intelligence firm on Thursday examined combatant attacks in the period of Q4 2020 and Q3 2021.\nTo curb the violent attacks, the country’s military is currently carrying out operations in many parts of the country, especially in the northern part of the country.\nIn the report, 642 personnel of the Nigerian military and 322 police officers were killed in the period under review.\nAdvertisementOperatives of other security agencies were also killed in attacks — 11 personnel of the Nigeria Security and Civil Defence Corps (NSCDC) and five personnel of the Nigeria Customs Service were affected.\nThe report also stated that 973 members of Boko Haram and 290 cultists were killed in combatant attacks."
  },
  {
    "headline": "Know Your Rights: You can sue if ATM fails to dispense cash despite being debited",
    "summarized_story": "But did you know that you can take legal action if you are debited and the machine fails to dispense cash and the amount is not reversed?\nAggrieved by the incident, he approached the high court in Plateau state to seek redress, with Ecobank and UBA as respondents.\nAt the high court, Jwan’s case was dismissed over his inability to properly discharge the burden of proof placed on him.\nTHE LEGAL PRECEDENTThe decision of the high court did not go down well with Jwan who subsequently proceeded to the appeal court.\nAdvertisementThe appeal court ruled in favour of the appellant and awarded him the sum of N500,000 as damages."
  },
  {
    "headline": "Know Your Rights: You can sue if ATM fails to dispense cash despite being debited",
    "summarized_story": "But did you know that you can take legal action if you are debited and the machine fails to dispense cash and the amount is not reversed?\nAggrieved by the incident, he approached the high court in Plateau state to seek redress, with Ecobank and UBA as respondents.\nAt the high court, Jwan’s case was dismissed over his inability to properly discharge the burden of proof placed on him.\nTHE LEGAL PRECEDENTThe decision of the high court did not go down well with Jwan who subsequently proceeded to the appeal court.\nAdvertisementThe appeal court ruled in favour of the appellant and awarded him the sum of N500,000 as damages."
  },
  {
    "headline": "Tambuwal to FG: Recruit special forces to fight bandits",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto, has asked the federal government to recruit special forces to fight bandits in their enclaves in the forest.\nAdvertisementAccording to NAN, Tambuwal spoke on Wednesday when he received a delegation of the North-west Governors’ Forum led by Aminu Masari, governor of Katsina.\nTambuwal said the special forces will complement the efforts of security personnel in tackling banditry.\n“The recruited persons shall serve as special forces equipped with right skills and modern firearms to confront bandits since the locals know the terrains.\nIt is no longer a blame game, rather we shall shun political differences to support authorities on containing the situation.”"
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "The Nigeria Startup Bill has been approved by the FEC",
    "summarized_story": "The Nigeria Startup Bill (NSB) is a step closer to getting enacted into law as it has now been approved by the Federal Executive Council (FEC).\nThe approval was made on December 15, and now, the Presidency will submit the bill to the National Assembly for consideration.\nThere will also be incentives to attract local and foreign investors to the Nigerian startup community.\nThe bill is the result of a collaborative effort between the Presidency, the Federal Ministry of Communications and Digital Economy, the Nigerian Export and Promotion Council and wider government bodies.\nGoogle Nigeria and the UK overnment, through the West Africa Research and Innovation Hub and the UK-Nigeria Tech Hub, are also backing the bill."
  },
  {
    "headline": "Edukoya raises $3.5m to provide quality secondary school education online",
    "summarized_story": "Edukoya, an African-focused online learning platform that empowers learners and their parents to access high-quality education, has raised $3.5 million in a pre-seed round led by Target Global.\nGet the best African tech newsletters in your inboxSpecifically, the platform is built to target Nigerian secondary school learners.\nThe seven-month-old startup says it offers a free, supplementary learning platform, as well as subscription packages with premium features, focused on K-12 learning and exam preparation.\nThe platform operates a 100% online model, which promotes self-paced learning that allows learners to save time and money.\nEdukoya app“Our vision at Edukoya is to redefine online education for the next generation of Africans."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Entering the metaverse, Edukoya’s $3.5m pre-seed and a Wowzi funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Entering the metaverseEdukoya’s $3.5m pre-seedWowzi’s fundingEntering the metaverseThe metaverse has been making the headlines in the last few weeks.\nGo deeper: Nestcoin’s new product, Metaverse Magna, wants to help Africans earn by playing games in the metaverseEdukoya’s $3.5m pre-seedAfrican edtech startups seem to be on a roll.\nTo get a glimpse of what it could look like, check out Ogheneruemu’s article: Technology, funding, learning models: What is the next frontier for edtech startups in Africa?\nSource: TechCrunchWowzi, a Kenyan startup that connects social media users to businesses, has bagged $3.2 million in funding.\nPer TechCrunch, the funding combines a $2 million seed round led by 4DX Ventures and a $1.2 million pre-seed round."
  },
  {
    "headline": "Nestcoin’s new product, Metaverse Magna, wants to help Africans earn by playing games in the metaverse",
    "summarized_story": "On November 29, 2021, BusinessToday.in reported that Canadian investment firm, Tokens.com, spent $2.5 million on a virtual land in the metaverse.\nNestcoin’s new product, Metaverse Magna (MVM), is creating a path for Africans that’ll ease them into the metaverse through games.\nBut in the metaverse, gaming is done a bit differently.\nAxie Infinity is, to date, the most established metaverse gaming platform.\nUnlike regular games, Axie Infinity exists on a blockchain which means you buy and sell characters, upgrades, and power-ups with cryptocurrencies."
  },
  {
    "headline": "Engage launches Paystack integration to help merchants with customer messaging",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Easily connect Paystack account through webhook or Zapier.\nThe integration makes it possible for Paystack merchants to connect their customer billing events to Engage and use that to send personalised emails and SMS to their customers.\nThe Paystack integration is already available on the Engage dashboard and is free to use for all users.\nAuthor Brand Press This Brand Press article wasn't written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Policies deter FG’s call for gas investments",
    "summarized_story": "“We need to collaborate across a broad spectrum and dimensions that is government industry, academia and professional associations like the Nigeria Gas Association.\nAn indication of the government resolve is the passage of the Petroleum Industry Act, which prescribes terms for gas and provides incentives for investors, Sylva said.\n“The gas supply industry must be anchored on a willing-seller willing-buyer framework to unlock further investments in gas exploration and delivery infrastructure.\nPartnerships with International Oil Companies have led to poor fiscal terms for oil in deep onshore basins before they were reviewed and have precipitated the absence of gas terms after over half a century of oil and gas production.\n“For instance, in the current PIA, gas incentives rely heavily on the amount of liquids than gas thus making non-associated gas reserves, that are low in liquids, ie."
  },
  {
    "headline": "Omicron: Event planners, attendees face fresh struggles on Lagos restrictions",
    "summarized_story": "The test is expected to be done either at an event venue or in selected private laboratories 24 hours before an event, a move considered an unrealistic expectation.\nEvent organisers are required to request rapid tests at event sites through an application on the Lagos State Safety Commission website: www.lasgsafetyreg.com.\nPeople expressing symptoms of COVID-19 in Lagos are often referred from state-run hospitals to private laboratories to pay out-of-pocket for tests.\nInformation required on the event safety clearance form provided on the website of the safety commission covers mainly event name, type, start date, end date, start time, end time, name and address of event venue, estimated guests, venue capacity, social centre number of event venue and available parking.\n“Once you have failed to be guided by the Lagos State Infectious Disease regulation of 2020, we will kick in terms of enforcement,” he said."
  },
  {
    "headline": "Lawyer in Ecobank’s tango with Honeywell, Ogunba got back rank of SAN in 2018",
    "summarized_story": "Kunle Ogunba, counsel to Ecobank in the dispute between it and Honeywell had his rank of senior advocate of Nigeria (SAN) restored in 2018 after a review of his case by the Legal Practitioners Committee which had earlier indicted him for misconduct as reported by BusinessDay on December 20, 2021.\nOn January 11, 2018, the Legal Practitioners Privileges Committee (LPPC) sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of SAN and all other privileges attached to the rank.\nHowever, BusinessDay is now in receipt of a September 20, 2018 letter by the LPPC titled, “Kunle Ogunba SAN: Notice of restoration of the award of the rank of Senior Advocate of Nigeria on your person with all its privileges” and in which the restoration of the rank was conveyed.\nAccording to Hadizatu Uwani Mustapha, chief registrar of the Supreme Court and secretary of the LPPC, “further to your letter of September 11, 2018, in which you presented to the Legal Practitioners’ Privileges Committee attached documents in compliance to the conditions laid down in paragraph 27 of legal practitioners privileges committee guidelines 2018.\nAs set out above, Mr. Ogunba on behalf of Ecobank deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.”"
  },
  {
    "headline": "Counter-Terrorism: NAF ‘wings’ 4 pilots, 12 UAV operators – Nigerian Observer",
    "summarized_story": "“In the area of pilot training, 11 student pilots are currently undergoing training in South Africa, while three are undergoing Alpha Jet conversion in Egypt.\nHe added that 12 student pilots were undergoing Basic Transport Training, 32 undergoing Ab-Initio Flying Training and eight undergoing Instructor Training at 401 Flying Training School, Kaduna.\n“Special arrangements are also currently being made to upgrade UAV training facilities to enhance the operational capacity of UAV operators in anticipation of increased tempo of air operations with the recently acquired UAVs.\n“I most sincerely express profound gratitude and appreciation to CAS, whose leadership has created the enabling environment for timely turn out of pilots and UAV operators in the NAF.\n“To the pilots and UAV operators, tomorrow brings a new journey, but today marks the end of a chapter in your career as you have become qualified pilots and UAV operators.”..."
  },
  {
    "headline": "We Are In The Business Of Driving Human Progress – Chevron – Nigerian Observer",
    "summarized_story": "Represented by the Area Manager, PGPA ,(Field Operations) ,CNL, Mr. Sam Daibo, Brikinn said, Chevron had over the years, worked and demonstrated ethical, environmentally responsible, safe, and respectful business practices.\n“Everywhere we work, we demonstrate ethical, environmentally responsibile safe and respectful business practices.As we would say, we are in the business of driving human progress.\n“Our primary contributions is by safely developing and delivering affordable and reliable energy that is necessary for social and economic progress.\n“It is important to note that community development can only be sustained in atmosphere of peace that is conducive for business activities”, Brikinn said.\nConstruction of Gbokoda community Cottage hospital, Construction of Bateren Community health Center, among others in Education, Health Care, well as Human Capital development."
  },
  {
    "headline": "Obaseki: Only PDP can save Nigeria from current socio-economic woes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has declared that only the Peoples Democratic Party (PDP) can rescue Nigeria and place it on the path of economic prosperity and sustainable development.\nAccording to him, “If Nigeria is going to be salvaged, PDP has to step into the throne to salvage this country politically.\nThe stakes are too high; we cannot allow Nigeria to continue the way it is going.\n“Our great party must come to the rescue and take over the reins of power in this country.\nAddressing members of the delegation, Obaseki stated, “The decision is of the majority of our people, which is the way we will go."
  },
  {
    "headline": "Obaseki inaugurates 12-man road safety advisory council – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has inaugurated a 12-man Edo State Road Safety Advisory Council, charged with the responsibility of coordinating the state’s road safety targets and driving the implementation of the road safety sector strategic plan.\nWhile inaugurating the council, Obaseki said, “The responsibilities of this council is to help coordinate our road safety targets and to drive implementation of the road safety sector strategy plan.\n“We believe that as an advisory council, you are going to help in building the agencies to implement programmes that are in the sector’s strategic plan.\nWe have to enforce road safety regulations.”He continued: “We are going to make sure that the mobile courts work with the designs of our roads so that we can have rest areas.\nGovernor for this opportunity and assure him of our unalloyed commitment to making sure that the purpose for which this advisory council was established is actualized.”..."
  },
  {
    "headline": "#EndSARS: Nigerian police officers get 20% salary increase",
    "summarized_story": "The federal executive council (FEC) has approved a 20 percent salary increase for officers of the Nigeria Police Force (NPF), to be paid from January 2022.\nDingyadi said the approval is a follow-up to President Buhari’s promise to enhance police personnel pay as demanded by #EndSARS protesters.\nThe minister said the sum of N13.128 billion was approved for outstanding death benefits for 5,472 police personnel.\nHe also announced a tax waiver of N18.6 billion for personnel between grade levels one and 14.\n“You recall that in October 2020 this country was rocked with EndSARS protests and the president addressed the nation appealing for calm."
  },
  {
    "headline": "Adebanjo sets record straight, carpets Akande over claim Tinubu built his Lekki house",
    "summarized_story": "Akande had in the book alleged that Tinubu, former Lagos State governor and leader of the All Progressive Congress (APC) built Adebanjo’s house in Lekki.\n“But since Bola Tinubu himself was present at the presentation I expect him within a few days to refute such a malicious falsehood about me emanating from his Man Friday.\nBut I owe a duty to myself and to put the record straight for posterity about the big lie that Bola Tinubu built my house in Lekki for me.\n“The contractor who built my Lekki house is Engr.\n“I hereby challenge Chief Bisi Akande to clear the air by disclosing the source of financing these properties as I have done above."
  },
  {
    "headline": "Nigeria, others to receive $93bn package to combat Covid-19 impact",
    "summarized_story": "The World Bank has said the International Development Association (IDA) will receive a $93 billion replenishment package to help low-income countries, including Nigeria, deal with the COVID-19 crisis and build a greener, more resilient, and inclusive future.\nAccording to the post, $23.5 billion in contributions from 48 high and middle-income nations, as well as capital market financing, repayments, and World Bank contributions, make up the financing.\nAbout a third of IDA countries are facing a looming food crisis.\nIDA will also deepen support to countries to better prepare for future crises, including pandemics, financial shocks, and natural hazards.\nWhile IDA20 will support countries globally, resources are increasingly benefiting Africa, which will receive about 70% of the funding,” the World Bank said."
  },
  {
    "headline": "CBN to toll roads to repay loans",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN) has said most of the roads constructed in the country will be tolled to repay the loans used to fund them.\nMr. Godwin Emefiele, Governor of the Central Bank, said this on Wednesday while answering questions after the two-day retreat of the Bankers’ Committee in Lagos.\nAccording to him, “Most of those roads will be tolled and we know that in many other countries in the world, roads are tolled because those projects are commercially viable.\nHe said the banking sector intended to help the government and the private sector to raise finance without necessarily encumbering the balance sheet of the Federal Government, Punch reported.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Omicron: UK Removes Nigeria, 10 Others From Travel Red List",
    "summarized_story": "LEADERSHIP had earlier reported that the red list was to be rescinded just two weeks after it was introduced, following intense pressures from Nigerian travelers and the Nigerian government, which threatened retaliation.\nThe red list forced thousands into hotel quarantine at a cost of £2,285 per person for 10 days.\n“On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nMeanwhile, the United Arab Emirates (UAE) has conceded seven slots to Air Peace to end the diplomatic row with Nigeria."
  },
  {
    "headline": "Commendations as Sanwo-Olu commissions 744 homes in Lagos community",
    "summarized_story": "The 744 home units in LagosHOMS Sangotedo Housing Scheme (Phase 1), which is the largest housing scheme to be completed by the present administration comprises 62 blocks of 12 homes each made up of a total of 248 one-bedroom, 248 two-bedrooms and 248 three bedrooms apartments.\nThe Governor also disclosed that Lagos State Government is set to implement the enforcement of a monthly tenancy on property occupancy from next year.\nHe said: “We are at an advanced stage at enacting what we call the Lagos monthly tenancy agreement scheme.\nMoruf Akinderu-Fatai said the continuous provision of decent homes for the residents of Lagos State has become a hallmark of distinction of the present administration led by Governor Babajide Sanwo Olu.\n“Within the past 26 months, in line with its pledge and mandate, the State Government has delivered 14 housing schemes in various parts of the State."
  },
  {
    "headline": "Commendations as Sanwo-Olu commissions 744 homes in Lagos community",
    "summarized_story": "The 744 home units in LagosHOMS Sangotedo Housing Scheme (Phase 1), which is the largest housing scheme to be completed by the present administration comprises 62 blocks of 12 homes each made up of a total of 248 one-bedroom, 248 two-bedrooms and 248 three bedrooms apartments.\nThe Governor also disclosed that Lagos State Government is set to implement the enforcement of a monthly tenancy on property occupancy from next year.\nHe said: “We are at an advanced stage at enacting what we call the Lagos monthly tenancy agreement scheme.\nMoruf Akinderu-Fatai said the continuous provision of decent homes for the residents of Lagos State has become a hallmark of distinction of the present administration led by Governor Babajide Sanwo Olu.\n“Within the past 26 months, in line with its pledge and mandate, the State Government has delivered 14 housing schemes in various parts of the State."
  },
  {
    "headline": "Adebanjo to EFCC: Probe Tinubu, Akande’s sources of wealth",
    "summarized_story": "After the book presentation, Tinubu said I should not go and that he would like to see me.\n‘Papa, you can see that this document is old, Tinubu said as he handed over a big envelope to Ajayi.\nBut I owe a duty to myself and to put the record straight for posterity about the big lie that Bola Tinubu built my house in Lekki for me.\nIt was later occupied by one of the wives Chief Pius Akinyelure, who often visit his wife there in company of Senator Bola Tinubu.\n“The contractor who built my Lekki house is Engr."
  },
  {
    "headline": "Adebanjo to EFCC: Probe Tinubu, Akande’s sources of wealth",
    "summarized_story": "After the book presentation, Tinubu said I should not go and that he would like to see me.\n‘Papa, you can see that this document is old, Tinubu said as he handed over a big envelope to Ajayi.\nBut I owe a duty to myself and to put the record straight for posterity about the big lie that Bola Tinubu built my house in Lekki for me.\nIt was later occupied by one of the wives Chief Pius Akinyelure, who often visit his wife there in company of Senator Bola Tinubu.\n“The contractor who built my Lekki house is Engr."
  },
  {
    "headline": "Adebanjo throws own bombshell: Tinubu, Osun contractor built homes for Akande",
    "summarized_story": "Chief Ayo Adebanjo Leader of Pan Yoruba group, Afenifere has thrown a bombshell of his own against his traducer, Chief Bisi Akande, a former political soul mate.\nIn a statement Thursday, Adebanjo confidently invited the EFCC to probe the financing of his house in Lekki, Tinubu’s wealth and the financing of Bisi Akande’s homes in Ibadan, Lagos, UK and his hometown of Ila Orangun.\nThe nonagenarian alleged that Chief Bisi Akande’s building at Ila-Orangun and some other properties he has in Lagos and abroad were financed by Bola Tinubu.\n“His house in Ibadan was also alleged to have been built by the contractor that built the secretariat in Oshogbo, when he was the Governor of Osun State.\n“He should also authorise the EFCC to verify such details as I have done above,” Adebanjo said."
  },
  {
    "headline": "AfDB to train herdsmen, others on ranching",
    "summarized_story": "By Ifeanyi NwokoThe African Development Bank (AfDB) is to train herdsmen and other Nigerians on livestock farming and ranching in the first phase of the initiative to create Special Agro-industrial Processing Zones (SAPZs).\nAfDB said the bank and partner institutions plan to raise $520 million for the implementation of Phase 1 of the project.\nProf. Banji Oyelaran-Oyeyinka, Special Adviser on Industrialisation to the President of the AfDB on Thursday said that livestock farming was one of the areas selected by the states.\nThe selected states include: Cross River State – cocoa, rice and cassava; FCT – beef and dairy livestock; Imo State – beef and dairy livestock; Kaduna State – tomato, maize and ginger; Kano State – rice, tomato, groundnuts and sesame oil; Kwara State – livestock; Ogun State – cassava, rice, poultry and fisheries and Oyo State – cassava, soybean, rice.\n“So we are hoping that the processing zone will also create the special livestock zone, including ranching and whenever you see livestock at the heart of it, then you see people making feed stock, veterinary services."
  },
  {
    "headline": "Breaking: Popular Balogun Lagos market set ablaze, goods destroyed",
    "summarized_story": "A popular market located in Balogun, Lagos state has been consumed in fire between Wednesday night and Thursday morning.\nWhile the fire raged, goods worth millions of naira were burnt down few days to Christmas, traders who turned out for usual business on Thursday lamented.\nThey said the cause of the fire unknown to many was yet to be ascertained.\nOfficials of Lagos state government are yet to speak on the latest development, Blueprint reports.\nDetails loading…"
  },
  {
    "headline": "Breaking: Farida Abubakar sworn-in as first female NUJ chair in Kaduna (PICTURES)",
    "summarized_story": "History has been recorded in Kaduna Council of the NIgeria Union of Journalists (NUJ) as the first female chairman has been sworn-in.\nThe Credentials Committee Chairman, Evangelist Mordecai Ibrahim, said she emerged unopposed, following the disqualification of her only opponent Asmau Yawo Halilu.\nHe commended the Mordecai Ibrahim-led credentials committee for being thorough and adhering to the NUJ constitution.\nSubsequently, the outgoing chairman handed all documents of the council to new chairman, Farida.\nOutgoing executive present at the swearing-in include, Adamu Yusuf (Chairman), Femi Adi (Secretary) and Mohammed Sabiu (Vice Chairman)."
  },
  {
    "headline": "Buhari providing quality leadership amidst rising insecurity – FG",
    "summarized_story": "Speaking at a media parley Wednesday in Abuja, the minister who acknowledged banditry and kidnapping posed a great challenge in the nation’s fight against insecurity, however, said the Buhari administration was providing quality leadership to halt the menace.\nPresident Buhari has done his best.\n“The President has also continued to work with our neighbouring countries and indeed our Western partners to tackle insecurity, especially terrorism.\n“Gentlemen, President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nPresident Buhari continues to do much more to keep Nigerians safe."
  },
  {
    "headline": "Buhari, Wife, Ministers To Depart Abuja For Turkey",
    "summarized_story": "President Muhammadu Buhari is set to leave Abuja for Istanbul, Turkey on Thursday where he will attend the third Turkey-Africa Partnership Summit.\nThis is according to a statement signed by presidential spokesperson Garba Shehu.\nThe summit, to be hosted by Turkish President, Recep Tayyip Erdogan, is themed ‘‘Enhanced Partnership for Common Development and Prosperity’’ and the agenda includes reviewing the cooperation between African countries and Turkey since the last summit in 2014.\n“The third Turkey-Africa Partnership Summit is coming on the heels of President Erdogan’s recent State Visit to Nigeria during which several agreements in the fields of energy, defence industry, mining and hydrocarbons were signed to expand existing bilateral ties,” Shehu’s statement said.\n“It is expected that the Summit would provide guidelines and direction for cooperation with African countries for the next five years."
  },
  {
    "headline": "Senate Postpones Passage Of 2022 Budget",
    "summarized_story": "The Senate has shifted the date for the passage of the 2022 budget until next Tuesday, December 21.\nSenate President, Ahmad Lawan announced this during the plenary on Wednesday.\nThe upper chamber had said it would pass the 2022 budget on Wednesday, but it appears the delay in capturing the financial requirements of the Independent National Electoral Commission (INEC) and the National Population Commission (NPC) in the 2022 budget may be responsible for the failure of the senate to pass the budget yesterday.\nPresident Muhammadu Buhari had on October 7 presented the 2022 Appropriation Bill for an aggregate of N16.39 trillion to the joint session of the National Assembly.\nThe President described the 2022 Appropriation as the Budget of Economic Growth and Sustainability."
  },
  {
    "headline": "Court Grants N5m Bail To 12 Suspects Over Seige On Justice Odili’s Residence",
    "summarized_story": "Justice Nkoenye Maha of the Federal High Court in Abuja has granted bail to 12 accused persons involved in the siege on Justice Mary Odili’s residence.\nThe bail was granted on Wednesday evening in the sum of N5 million each with two sureties in like sum.\nRead Also: EFCC Uncovers Additional $72.8m Linked To DiezaniThey are all to be remanded at the Kuje correctional center, including those who were granted bail, pending the perfection of their bail applications.\nThe Police had arraigned 15 out of the 22 suspects alleged to have laid siege on the residence of the Supreme Court Justice.\nJustice Odili’s home was invaded on October 29, with the said panel claiming it had a search warrant from Chief Magistrate Emmanuel Iyanna."
  },
  {
    "headline": "EFCC Uncovers Additional $72.8m Linked To Diezani",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has uncovered an additional $72, 870,000 million linked to the former Minister of Petroleum Resources, Diezani Alison-Madueke.\nThe sum was said to have been discovered in an account domiciled in Fidelity Bank Plc.\nConsequently, a former Managing Director of the bank, Nnamdi Okonkwo, has been arrested.\nWhile all the $153 million was recovered by the EFCC, the cases involving $115million, as it relates with the Independent National Electoral Commission, INEC, bribery matter, are in various courts.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8m."
  },
  {
    "headline": "Banditry: Tambuwal Asks FG To Create Special Forces",
    "summarized_story": "Sokoto State Governor Aminu Tambuwal has urged the Federal Government to consider the option of creating a Special Forces to tackle banditry.\nGovernor Tambuwal said the Special Forces should comprise locals of the affected communities because they have rich knowledge of the areas.\nHave special forces for all these areas and states affected with banditry?\nIn his address, Katsina State Governor Masari expressed his condolences to Sokoto State on the recent attacks by bandits.\nSokoto State Police Commissioner, Kamaludeen Okunola described the incident as unfortunate."
  },
  {
    "headline": "Nollywood Star, Kabiru Fubara, dies months after surviving cancer -",
    "summarized_story": "Nollywood Star, Karibi Fubura has died months after surviving cancer.\nA family member of Nollywood actor, Karibi Fubara, announced his death nineteen months after he survived surgery on his kidney.\nThe post was met with tributes from several Nollywood actors and actresses including, Rita Dominic, Funke Akindele, Kate Henshaw, Sharon Ooja, among others.\nThe “God calling” actor married popular Nollywood fashion entrepreneur, Yolanda Okereke in 2019.\nUntil his death, Fubara was a Nollywood actor who rose to prominence after starring in Before 30, God Calling, Quam’s Money, Castle and Castle, Royal Hibiscus Hotel, Smart Money Woman, and MMM."
  },
  {
    "headline": "Gov. Dapo Abiodun mourns Olowu of Owu, Olusanya Dosunmu -",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has expressed shock at the transition of the Olowu of Owu Kingdom, Oba Olusanya Dosunmu, Amororo II.\nIn a condolence message issued on by his behalf on Tuesday by his Chief Press Secretary, Kunle Somorin in Abeokuta, Gov.\nAbiodun described the Oba Dosunmu as “a quintessential monarch, a man of peace and a passionate supporter of development.”While condoling with the monarch’s immediate family and the people of Owu, the governor said they should take solace in the lasting impact he had on his domain.\nHe prayed that “God Almighty grants Kabiyesi’s soul eternal repose and the people he left behind the fortitude to bear this loss”, the statement surmised."
  },
  {
    "headline": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest",
    "summarized_story": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest"
  },
  {
    "headline": "2022 Budget: Assembly passes N188.4bn for Sokoto State",
    "summarized_story": "The Sokoto State House of Assembly has passed the the state 2022 budget of N188.4 billion following the adoption of the report of the House Committee on Finance and Appropriation at the plenary sitting of the Assembly.\nThe budget, tagged, “Budget of accomplishments and sustainable development”, is lower than the 2021 budget of N205,016,512,295.41 by N16,587,016,447.78, consisting both the Recurrent and Capital Expenditures approved by the Assembly.\nPresenting the report, Chairman of the Committee Malami Basakkwace (PDP- Sokoto South II) explained that the committee did not add or subtract from the figures presented by the governor.\nHe said, based on genuine request by sub-committees, the committee moved resources inwards to accommodate some important demands and interest of our the people of the state.\nMr. Basakkwace said the committee recommended that all sources of funding identified in the budget should be maintained and their conditions adhere to."
  },
  {
    "headline": "Millions at Risk as Super Typhoon Rai Slams into Philippines",
    "summarized_story": "The Philippine’s weather bureau, PAGASA, said Typhoon Rai made its first landfall in Surigao del Norte’s Siargao Island at 05:30 GMT.\nThe Joint Typhoon Warning Center (JTWC) of the US Navy has declared Rai as a super typhoon.\n“Filipinos are tough but this Super Typhoon is a bitter blow for millions of people who are still recovering from devastating storms, floods and COVID-19 in the past year,” said Richard Gordon, chairman of the Philippine Red Cross.\nA COVID-19 vaccination drive has also been suspended in some parts of the country due to the typhoon.\nEastern Samar and Leyte provinces were among those hardest hit by the 2013 super typhoon Haiyan, which left thousands dead."
  },
  {
    "headline": "Three Days to Deadline, Buhari Keeps Nigerians in Suspense Over Electoral Bill",
    "summarized_story": "Timothy Golu, has expressed optimism that Buhari would sign the bill eventually.\nBut the presidency and the National Assembly had quickly come out to dismiss it as untrue.\n“I mean, it belies logic that the president would write to the National Assembly after they had proceeded on recess.\n“I don’t think the president will be ready to be embarrassed by the National Assembly at that level.\nThose who do not want it know, those who didn’t want it know what they did to get to the National Assembly,” Golu further stated."
  },
  {
    "headline": "Nigeria Boosts Police Morale with 20% Salary Increase",
    "summarized_story": "In a morale-boosting effort, Nigeria’s Federal Executive Council (FEC) on Wednesday approved a new welfare package, including a 20 per cent increase in allowances, for personnel of the Nigeria Police.\nDingyadi said FEC also approved a review and upgrading of the take home pay of police personnel in Nigeria.\nThis will come out to about ten billion and thirty million naira with effect from 2022.\nMost importantly, government also approved payment of about 20 per cent of CONPOST, it is peculiar allowances to boost morale, and take home pay of the Nigeria Police.\nAhmed assured that the police salary increase would come into effect once the supplementary budget was approved by the legislative arm."
  },
  {
    "headline": "Nigerian Magnate Otedola Says ‘No Interest’ in Holding Any Board Position in FBN Holdings, First Bank",
    "summarized_story": "The Chairman of Geregu Energy Group and billionaire businessman, Mr. Femi Otedola has debunked speculations that he is interested in holding any board position in FBN Holdings, First Bank or any of their subsidiaries.\nIn a brief chat with THISDAY at the ExecuJet Private terminal in Lagos on Wednesday, Otedola was asked about his next steps after becoming the single largest shareholder of FBNHoldings.\nHe smiled and said he did not acquire the bank’s shares because he wanted to be chairman of the bank.\nMy interest, contrary to speculations is not to become chairman of the bank or its holding company (Holdco).\nOtedola praised the financial institution, saying “being the single largest shareholder doesn’t mean I must necessarily hold a position in the bank."
  },
  {
    "headline": "Nigeria: EFCC Says It Has Uncovered Additional $72.8m Traced to Ex-Oil Minister Diezani – Arise News",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has arrested a former Managing Director of Fidelity Bank Plc, Nnamdi Okonkwo, allegedly over an additional $72,870,000 million found in the coffers of the bank.\nTHISDAY gathered that Okonkwo, who is Group Managing Director of FBN Holdings Plc and others, were earlier grilled over a sum of $153 million and $115 million by the commission.\nWhile all the $153 million were recovered by the EFCC, the cases involving $115 million, as it relates to the Independent National Electoral Commission bribery matter are in various courts.\nOkonkwo and Charles Onyedibe are currently being detained by the EFCC over the whereabouts of the new $72.8m.\nKingsley Nwezeh in Abuja"
  }
]