[
  {
    "headline": "Twitter ban: Ozekhome asks JUSUN to call off strike",
    "summarized_story": "Ozekhome made this call in a press statement titled ‘The Twitter ban, prosecution, more prisons and the link with the JUSUN strike.’He said although he had supported the strike action by JUSUN from the beginning, the unyielding stance of the government seems to be encouraging the strike.\nHe said, “From day one, I had whole-heartedly supported the JUSUN strike by Judicial workers.\nThen, they suddenly realise that the doors to the courts are firmly shut, and put under lock and key by JUSUN workers.\n“Meanwhile, the same courts being protected, are busy every day, delivering judgments (physical and virtual), on matters already pending before the JUSUN strike commenced.\nOzekhome explained that his new position on the JUSUN strike was due to the events that have unfolded in the last two weeks."
  },
  {
    "headline": "TB Joshua’s wife speaks on husband’s death",
    "summarized_story": "Evelyn Joshua, wife of the founder of Synagogue Church of All Nations, Temitope Balogun Joshua, has broken the silence since the news of her husband’s death made rounds.\nEvelyn took to social media to express ocean-deep emotions over the loss of her husband.\nAmid the ban by the Federal Government on the usage of popular microblogging platform, Twitter, in Nigeria, Evelyn took to her official Twitter handle, @Mama_Evelyn, and wrote a short message.\nWe are with you in spirit mama as we mourn with you.”Similarly, @NNonvo, said, “Ma’am, condolences to you and your family.\nWherever he went, you went and gave love and hope to the downtrodden of this world."
  },
  {
    "headline": "Welcome back! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "You have successfully logged out! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "Our children exhibit abnormal behavior – Afaka Parents cry out",
    "summarized_story": "…Demand compensationBy Ibrahim HassanWuyoParents of the abducted students of Federal College of Forestry Mechanization, Afaka, Kaduna, who were released by their abductors, have said that most of the students have been exhibiting some abnormal psychological behaviours due to lack of proper medical checkup and trauma counselling necessary for their rehabilitation.\nThe parents therefore, demanded for immediate compensation from the Federal Ministry of Environment and the Institute to enable them treat their children of their trauma.\nThe patents, in a statement signed by Abdullahi Usman, Chairman of the Forum, alleged that the Ministry and the Institute were insensitive to their children’s plight and indifferent to their trauma.\nWe will go to every extent, using every legal instrument available to us, bona fide and law-abiding citizens of this country, to get what we believe our children deserve to facilitate their return to normal life.”“We now deem it legitimately and legally fit to demand what we believe should be given to us for the proper rehabilitation of our children,” they said.\nVanguard News Nigeria"
  },
  {
    "headline": "EFCC reveals Bawa’s Facebook account, warns impostors",
    "summarized_story": "A statement by the Spokesman for the EFCC, Mr. Wilson Uwujaren, said the authentic account belonging to the EFCC chairman is: @AbdulRasheed Bawa, which is the only facebook account that Bawa has.\n(EFCC CHAIRMAN) Public group, EFCC-BOSS Abdulrasheed, bawa 1, @abdulrasheed bawa, @Abdulrasheed Yahaya Bawa and @ Abdulrasheed Bawa, which cyber criminals have been parading as belonging to the EFCC chairman and using same to deceive unsuspeting members of the public.\n“The impostors behind the fake accounts are bent on deceiving unsuspecting Nigerians into believing that they are genuine Facebook accounts of the EFCC boss.\n“To foreclose further cloning of Bawa’s Facebook account, the Commission is constrained to make public, the personal Facebook account of the EFCC chair.\n“Bawa has one Facebook account which is, @AbdulRasheed Bawa."
  },
  {
    "headline": "Igangan fresh attack: APC carpets Makinde over insecurity",
    "summarized_story": "Says killing is a reflection of gov’s audio governanceBy Adeola BadruThe All Progressives Congress, APC in Oyo State, has described the killing of not more than 20 residents of Igangan in Ibarapaland by some suspected Fulani hardsmen, as one mayhem too many, berating the state government of failing to nip the festering challenges of insecurity in the bud.\nThe party, in a statement on Sunday, issued by its caretaker Publicity Secretary, Dr. Abdul-Azeez Olatunde, queried the essence of the monthly security vote being collected by the governor, which APC said, Makinde could not channel towards securing the lives and property of residents and indigenes of Ibarapaland effectively.\nThe statement added: “For how long should Gov Seyi Makinde continue his buck passing?”“What is the essence of the monthly security vote our governor collects if it could not be channeled towards securing the lives and property of the residents and indigenes of Oyo State?”“Obviously and certainly, the current situation of Oyo State was not what was the government of Engr Seyi Makind and PDP took over from APC government of Sen Abiola Ajimobi in 2019.”“APC Oyo State won’t stop to advise the Government of Engr Seyi Makimde Governor of Oyo State to be proactive and stop playing lip service and politicking with the security issues of Oyo State.”“The excuse of general security issues has been with us in Nigeria since 2009 even before the tenure of the then ACN Government led by Sen Abiola Ajimobi took over the mantle of governance in 2011, but despite that secured Oyo State people’s lives and property which was the major reason Sen Abiola Ajimobi was the first Governor of Oyo State to be appreciated with appreciation awards right, left and center after his tenure.”“Retrospectively, all governments would always have it’s own challenges but failure to nip the festering challenges in the bud is what differentiate failed government as being witnessed in Oyo State under Engr Seyi Makinde from what obtained under APC government of Sen Abiola Ajimobi whose number one achievement for its 8 years tenure was security of lives and property.”“Whenever PDP government is shown its failed score card on security, they would always pass the buck by deflecting away with excuse as if it requires rocket science formulae to secure lives and property.”“Finally, we urge Gov Seyi Makinde to call a security summit in order to find lasting solutions to the security challenges facing us in Oyo State and forget the rhetorics of having Amotekun and Operation Burst that have shown to be ineffective so far because it is obvious that there are security lapses all over Oyo State, at least the governor recently admitted the carnage that occurred in Eruwa, Ibarapa East during the OYSIEC LG election of Saturday May 22, 2021.”“Imagine the palace of Asigangan of Igangan, many innocent lives and properties like houses and fuel filling stations and even a lot of ancient archival property lost in one fell swoop.”“For how long shall we continue to mourn the loss of innocent lives that is avoidable,” APC lamented.\nVanguard News Nigeria"
  },
  {
    "headline": "Insecurity: Niger govt directs churches, mosques to hold special prayers",
    "summarized_story": "The Niger State government has directed mosques and churches to conduct special prayers for God’s Devine intervention in the fight against insecurity in the state.\nThe state in recent times has grappled with the rising cases of banditry, kidnapping, other forms of crimes and criminal elements.\n“The security forces are doing a great job which only God can reward them, and we are urging those saddled with the responsibility of taking care of them to give them their dues.\nThey deserve prayers and support of all.”Rev.\nThe special prayer is expected to be replicated in all the eight Emirates of the state."
  },
  {
    "headline": "TB Joshua served God, humanity with passion",
    "summarized_story": "Former Nigerian President, Dr. Goodluck Ebele Jonathan on Sunday, expressed shock over the death of the founder of Synagogue Church of All Nations (SCOAN), Prophet Temitope Balogun Joshua also known as TB Joshua.\nHe said the renowned Prophet, prior to his death, served God and humanity with passion noting that many Nigerians and people from other parts of the world have been blessed by his ministry.\nHe said, “TB Joshua was a devout man of God who served God and humanity with relentless passion.\nHe was a man of sound doctrine, meek and faithful to his call and passion of reconciling men to God and offering hope to humanity.\n“As a Christian leader, TB Joshua and his Ministry exemplified Christ in faith, love and charity; positively impacting the lives of many Nigerians, Africans and millions of people across the world."
  },
  {
    "headline": "Alleged threat of war: Buhari, politicians worsening insecurity in Nigeria",
    "summarized_story": "The World Igbo Peoples Assembly (WIPAS), a socio-cultural organization, has accused President Muhammadu Buhari, politicians and elites of being behind the insecurity in Nigeria.\nThe group said the President by his body language and actions have refused to address the nation and unite the fractures.\nThe Igbo Assembly spoke in reaction to the alleged threat of war in the southeast by President Buhari.\nDAILY POST recall that President Muhammadu Buhari had vowed to clamp down on those destroying government facilities in the Southeast.\nThe World Igbo Peoples Assembly accused some northern individuals of sponsoring protest against the Igbos with naked propaganda that northerners are being killed in the southeast."
  },
  {
    "headline": "Cross River University explains genesis of recent crisis",
    "summarized_story": "The media team of the University of Cross River State has explained how the University was overrun by cultists.\nDescribing the killing of a student by hoodlums as unfortunate, the University said the deceased was being a good samaritan.\nThe deceased student was reportedly trying to recover a phone from some thieves who had snatched it from a girl.\n”Consequently, the University sympathize with friends and family of the deceased student and pray that God grants them the fortitude to bear this weighty loss.\n“Therefore, on behalf of the university’s management, we appeal to everyone to remain calm as we all await a smooth and rapid return to normalcy in Calabar campus” the media team stated."
  },
  {
    "headline": "Group alleges killing of IPOB lawyer’s aide by govt forces as police deny involvement",
    "summarized_story": "‘My life is in danger’ – IPOB lawyer, Ifeanyi Ejiofor alleges invasion by security operativesThey had invaded and laid siege on the same at about 2.30 am and left around past 4 am.\nThe invading security operatives jumped the perimeter fence of the compound after cutting its security cable and shot in different directions.\n“The respected human rights lawyer was unable to be tracked and abducted or instantly shot dead because he was hiding somewhere in his house.\n“However, the invading government security operatives did not spare the life of the lawyer’s Personal Assistant, Samuel Uzo Okoro (Biggy) who was shot and killed inside the compound.\nOur job is to protect lives and not to take lives.”Group demands prosecution of Islamic leaders over alleged forceful conversion of abducted girls"
  },
  {
    "headline": "Prince Harry, Meghan welcome baby girl",
    "summarized_story": "The Duke and Duchess of Sussex have announced the birth of their second child, a baby girl.\nBoth mother and child are healthy and well, Prince Harry and Meghan said in a statement.\nThe couple said they named their second child Lilibet after the Royal Family’s nickname for the Queen, the baby’s great-grandmother.\nPrince Harry and Meghan met on a blind date and married in May 2018 in a ceremony at Windsor Castle.\nMeghan’s friend, Misan Harriman, who took black-and-white photographs of the couple for their pregnancy announcement, tweeted his congratulations: “Lilibet has arrived!"
  },
  {
    "headline": "N-Power begins enrollment for Batch C applicants",
    "summarized_story": "By Faith Yahaya, AbujaThe Ministry of Humanitarian Affairs, Disaster Management and Social Development has announced the next step for the N-power Batch C Stream One applicants.\nThe Permanent Secretary, Bashir Alkali, in a statement on Sunday said the ministry has commenced the next stage of enrollment with the verification of email addresses by applicants.\nAlkali called on shortlisted applicants to check their respective email addresses for confirmation and further information.\nADVERTISEMENTHe further directed applicants to log into www.nasims.gov.ng to enrol their biometric data.\nHe also advised applicants to contact NPower helplines at 018888340 or 018888189 or email for support at [email protected] for other enquiries."
  },
  {
    "headline": "T.B Joshua will be missed for spiritual, philanthropic contributions – Buhari",
    "summarized_story": "By Bolaji Ogundele, AbujaThe deceased Founder of The Synagogue, Church of All Nations (SCOAN), Prophet Temitope Balogun, also known as T.B.\nJoshua, would be missed for his spiritual and philanthropic contributions, President Muhammadu Buhari has noted.\nThe statement reads: “President Muhammadu Buhari commiserates with the family and members of The Synagogue, Church of All Nations (SCOAN) on the passing of their father and founder, Pastor Temitope Balogun, popularly known as TB Joshua.\nADVERTISEMENT“The President notes that the renowned televangelist will be missed by his followers all over the world not only for his spiritual contributions, but for touching many lives through philanthropic gestures.\n“President Buhari urges Pastor Joshua’s followers to take solace in the knowledge that life is not measured and defined by chronological longevity but by enduring legacies and lives touched positively."
  },
  {
    "headline": "Police kill alleged IPOB lead executioner, five others",
    "summarized_story": "By Precious IgbonwelunduThe police have identified one of the six men killed during an attempted attack on Imo Command as Joseph Uka Nnachi alias Dragon.\nHe is alleged to be killer-squad commander of the Indigenous People of Biafra (IPOB)/Eastern Security Network (ESN).\nIt was also alleged that four AK47 rifles were recovered from the deceased, said to have been conveyed in a bus for the operation before they were repelled.\nRead Also: Police arrest 10 IPOB membersSyndicating images of the deceased with rifles on their chests, the police alleged that the other five suspects killed alongside Dragon were his key men.\n“All the charms the notorious killer Joseph Uka Nnachi aka Dragon, native of Ebonyi State and his group were using which they so much believed in have failed them once more,” said the police."
  },
  {
    "headline": "Kalu condoles with the Synagogue Congregation over Pastor T. B Joshua’s death",
    "summarized_story": "Lamenting the demise of the renowned preacher and evangelist, Kalu stressed that Pastor Joshua was popular beyond the shores of Nigeria, adding that the deceased will be greatly missed by his followers.\nHe said, “I mourn the demise of Pastor Temitope Balogun Joshua, Founder of The Synagogue Church of All Nations (SCOAN).\n” Pastor Joshua was simple, kind-hearted, generous and easy going.\n“However, the congregation should take solace in the fact that the late clergyman contributed immensely to the growth of the Synagogue church and the larger community by touching lives positively.\n“The late Pastor Joshua will be remembered as a notable spiritual leader with passion for empowering the poor and vulnerable in the society."
  },
  {
    "headline": "What TB Joshua told us before his death-Members",
    "summarized_story": "Some members of the Synagogue Church of All Nations (SCOAN), Lagos, have said that their late prophet, TB Joshua, might have got a premonition about his death when he told them that he was not going to celebrate his birthday this year, which would have been June 12.\nAtah Benjamin said: “When he said it, many of us thought he meant not throwing a party to mark his birthday.\nIt is now clear that the man of God saw his death coming.\nAnother member Ola Opeyemi said: “There is no way God couldn’t have revealed this to His servant.\n“I will miss him, the church and the world will surely miss him.”"
  },
  {
    "headline": "Prophet Joshua’s last moment, how he died",
    "summarized_story": "By Chika Abanobi, Gabriel Dike and Steve AgbotaMembers of the Synagogue Church of all Nation, gathered this morning in front of the church reliving the last moment of the tele-evangelist and how he died.\nHis words: “After the programme he met with some senior church members.\n“The wife discovered he had died and called senior members of the church to break the news.”At the church many members were seen crying while many did not believe he was death.\nJoshua knew he will die soon and had prepared for the journey.\nAccording to him, “Pastor Joshua knew he will die and has put his house in order and very few that had spiritual eye knew he would die.”"
  },
  {
    "headline": "US, UK, EU, others express disappointment over Nigeria’s ban on Twitter operations",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States (US), the United Kingdom (UK), the European Union (EU), the Canadian Government, the Kingdom of Norway and the Republic of Ireland have expressed disappointment over the ban on Twitter operations in Nigeria.\n‘We strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nBanning systems of expression is not the answer.\nThe US, UK, EU, the Canadian Government, the Kingdom of Norway and the Republic of Ireland further said the path to a more secured Nigeria lied in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n‘As Nigeria’s partners, we stand ready to assist in achieving these goals,’ the statement added."
  },
  {
    "headline": "I’m old for marriage, but my mind tells me I’m broke –Ahneeka, ex-BBNaija housemate",
    "summarized_story": "I am the host of Jollof TV show produced by Zikel Cosmetics.\nAs much as everyone is telling me how old I am (for marriage), my thought is telling me how broke I am.\nAs much as the government and other people owe you things, don’t bank on that.\nAs a young person, half of what you see on social media is fake.\nIf you are a person of faith, don’t forget that and when you get there, don’t forget that faith too."
  },
  {
    "headline": "Breaking: T.B. Joshua is Dead",
    "summarized_story": "By Vanessa ObiohaThe founder of Synagogue Church of All Nations (SCOAN), Temitope Balogun Joshua popularly known as T.B.\nJoshua has died.\nThe post read: God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nThis is what he was born for, lived for and died for.”The statement also disclosed that the prophet spoke to partners on Saturday before his death.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”His last words according to the church was ‘Watch and Pray’."
  },
  {
    "headline": "Twitter Ban: The World Reacts as Presidency Justifies Suspension",
    "summarized_story": "On the contrary, the All Progressives Congress (APC) has called on Nigerians to defend the country’s sovereignty by supporting the federal government’s Twitter suspension, saying it was in national interest.\nHe said: “The temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThe opposition stated that the APC-led federal government should also realise that the suspension of Twitter, in addition to its unconstitutionality, only suspended Twitter operations and not the use of Twitter by Nigerians.\nTwitter Suspension Is an Overreaction, Says NPANThe Newspaper Proprietors’ Association of Nigeria (NPAN) has condemned the suspension of the operation of microblogging and social networking service, Twitter, in the country, describing it as “wrong and an overreaction”.\nTwitter made the vow in reaction to the indefinite suspension slammed on it by the Nigerian Government."
  },
  {
    "headline": "2023: Why Matawalle May Not Defect to APC for Now",
    "summarized_story": "The state was considered an APC state and it was therefore to ensure his reelection in 2023 that Matawelle was being poached to defect to the APC.\nWill he subdue his ambition that caused his initial political feud with former governor Yari or will he go back to the senate?\nIf he decides to go to the Senate, what will happen to the current senator that is from the PDP?”, the PDP source stated.\nYari, Zamfara’s immediate past governor is plotting to become the national chairman of the APC, and has been at daggers-drawn with Matawalle, who became an unexpected beneficiary of the APC crisis in the 2019 primaries in the state.\n“This is part of the reasons APC is delaying their convocation of the national convention of the APC."
  },
  {
    "headline": "Makinde: I Won’t Comply With S’Court Judgement on Sacked LG Chairs",
    "summarized_story": "The Supreme Court, last month, overturned Makinde’s sack of the council chairpersons in the state.\nThe officials, drawn from the 33 local government areas (LGAs) and 35 local council development areas (LCDAs) and their councillors, were members of the ruling All Progressives Congress (APC).\nBut the court appeared to favour Makinde by noting that the tenures of the sacked council chairmen and councilors had expired.\nSpeaking to THISDAY at the Government House, Ibadan, Makinde said, “The Constitution of Nigeria recognises 33 local government areas and 351 wards in Oyo State.\nThe previous administration created local development areas and increased the number to 68."
  },
  {
    "headline": "Twitter Ban Regressive, Overreaction, Says NPAN",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Newspaper Proprietors’ Association of Nigeria (NPAN) has condemned the suspension of the operation microblogging and social networking service, Twitter, in the country by the Federal Government as “wrong and an overreaction”.\nNPAN made the denunciation Saturday in a statement signed by its President Kabiru A. Yusuf.\nThe statement warned that the action by the federal government after Twitter deleted a tweet by President Muhammadu Buhari to separatist agitators, would not win Nigeria friends.\n“Twitter is a global platform for public communication that has expanded the frontiers of Free Speech and Press Freedom.\nBanning Twitter is regressive and should be rescinded in favour of dialogue.” NPAN warned."
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "Popular Nigerian Televangelist Pastor TB Joshua Is Dead",
    "summarized_story": "The Founder of the Synagogue, Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, is dead.\nJoshua reportedly died on Saturday night in Lagos after concluding a programme at his church.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended."
  },
  {
    "headline": "Popular Nigerian Televangelist Pastor TB Joshua Is Dead",
    "summarized_story": "The Founder of the Synagogue, Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, is dead.\nJoshua reportedly died on Saturday night in Lagos after concluding a programme at his church.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended."
  },
  {
    "headline": "Defend Protesters Arrested By Buhari's Government During June 12 Mega Rally, Political Movement Tells Lawyers",
    "summarized_story": "The People's Alternative Political Movement (PAPM) has urged lawyers in each state of the federation to defend protesters who may be arrested on June 12, 2021.\nForces behind the new movement (PAPM) are drawn from trade unions, civil society, students, farmers and peasants from across the 36 states.\nJune 12 Protest has been trending major social media platforms with many organisations, groups and human rights activists calling on Nigerians to join the mass movement in the country.\nThe President Muhammadu Buhari-led regime has a penchant for arresting and torturing peaceful protesters, denying them of their rights.\nNigeria’s June 12 Democracy Day is a public holiday set aside to commemorate the restoration of democracy in the country."
  },
  {
    "headline": "ICYMI: Three out of 99 bodies examined after #EndSARS protests were from Lekki, says pathologist",
    "summarized_story": "John Obafunwa, consultant pathologist to the Lagos state government, says out of a total of 99 bodies examined for autopsy after the #EndSARS protests, three were from Lekki.\nAdvertisementSpeaking at the hearing of the judicial panel established to investigate the invasion by soldiers against protesters, Obafunwa said 99 bodies were received for autopsy between October 20 and 24.\nHe said out of the 99 bodies received, three were brought in from Lekki.\nObafunwa said the remaining bodies were received from other parts of the state including Surulere, Ikorodu, Ajah, Fagba, among others.\nOn the precise date and time when the bodies were received, the pathologist said he would have to confirm from his records."
  },
  {
    "headline": "ICYMI: Three out of 99 bodies examined after #EndSARS protests were from Lekki, says pathologist",
    "summarized_story": "John Obafunwa, consultant pathologist to the Lagos state government, says out of a total of 99 bodies examined for autopsy after the #EndSARS protests, three were from Lekki.\nAdvertisementSpeaking at the hearing of the judicial panel established to investigate the invasion by soldiers against protesters, Obafunwa said 99 bodies were received for autopsy between October 20 and 24.\nHe said out of the 99 bodies received, three were brought in from Lekki.\nObafunwa said the remaining bodies were received from other parts of the state including Surulere, Ikorodu, Ajah, Fagba, among others.\nOn the precise date and time when the bodies were received, the pathologist said he would have to confirm from his records."
  },
  {
    "headline": "Kelvin Odenigbo, Nigerian footballer, drowns in Belarus lake",
    "summarized_story": "Kelvin Odenigbo, the Nigerian footballer who plied his trade for FC Vitebsk in Belarus, has been found dead after drowning in a lake.\nAdvertisementThe Belarusian Premier League club confirmed the demise of the 20-year-old striker in a statement on its website.\nIn the statement, the club said Odenigbo drowned and his corpse was found on Saturday by the lake Beloye, a tourist destination in the Vitebsk region.\n“We express our sincere condolences to the family and friends of the football player.\nThe football club Vitebsk reports that on June 5, 2021, on the lake Beloye, in the area of the tourist base Verasy, OSVOD employees found the drowned Kelvin Odenigbo,” the statement read."
  },
  {
    "headline": "Kelvin Odenigbo, Nigerian footballer, drowns in Belarus lake",
    "summarized_story": "Kelvin Odenigbo, the Nigerian footballer who plied his trade for FC Vitebsk in Belarus, has been found dead after drowning in a lake.\nAdvertisementThe Belarusian Premier League club confirmed the demise of the 20-year-old striker in a statement on its website.\nIn the statement, the club said Odenigbo drowned and his corpse was found on Saturday by the lake Beloye, a tourist destination in the Vitebsk region.\n“We express our sincere condolences to the family and friends of the football player.\nThe football club Vitebsk reports that on June 5, 2021, on the lake Beloye, in the area of the tourist base Verasy, OSVOD employees found the drowned Kelvin Odenigbo,” the statement read."
  },
  {
    "headline": "OBITUARY: TB Joshua, the controversial pastor adored by many presidents and politicians",
    "summarized_story": "AdvertisementIn a recent video, Joshua was seen explaining that it would not be easy for him to celebrate his coming birthday owing to the pandemic.\nHe had an interesting childhood, earning the name “small pastor” in primary school because of how much he loved the Bible.\nJoshua later explained that he meant Clinton was going to win by ‘popular vote’.\nA Forbes blogger estimated that Joshua spent $20 million on education, healthcare and rehabilitation programmes for former Niger Delta militants.\nIn 2009, Joshua started a football club, My people FC, as part of efforts to help the youth."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "WHY AGRO-CROWDFUNDING PLATFORM FARM SPONSOR IS RESCHEDULING SHORT-TERM PAYMENTS DESPITE INSURED OPERATIONS",
    "summarized_story": "The past few days has been quite a challenge as the company has been facing some difficulties which has destabilized our crowd funding operations.\nWe are taking appropriate measures to see that all funds collected from every sponsor will be paid back accordingly.\n• 128,000 birds per week state of the art hatchery.\nOur mid term strategy is through equity investment from institutional investors and we are willing to relinquish 30-50% of directors shares in the company.\nOur long term strategy would be direct revenue from the business, hence the 18-24 months."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "4 ways Nigeria’s Twitter ban could affect businesses",
    "summarized_story": "He also disclosed the government’s directive to the National Broadcasting Commission (NBC) to start licensing all over-the-top (OTT) and social media operations.\nThe Twitter ban could also affect the country’s economy.\nThese are all activities that a social media ban would hinder.\n— Mazi Juls (@AAjulibe) June 5, 2021While these businesses would find ways to innovate around the ban, their users may not.\nThere are no assurances that a ban on other social media platforms would not follow."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "Nigerian Banks FX trade turnover declines by 14.49%",
    "summarized_story": "The foreign exchange (FX) trade turnover between Nigerian banks in the Spot, Forwards and Futures markets for the week-ended June 4, 2021, declined by 14.49 percent to $1,069.71 million from $1,250.97 million reported for the week-ended May 28, 2021, according to FMDQ.\nThe week-on-week (WoW) decrease in turnover was driven by the 24.75% ($222.62 million)…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "Dangote’s granulated fertilizer plant to start selling products on Monday The chairman, Dangote Group, has announced that Dangote Industries Limited’s $2.5 billion three million metric tonnes granulated fertilizer plant will commence the sale of fertiliser on Monday 7th June 2021.\nRead Also: Emefiele says Nigeria to save $3bn annually from Dangote refinery This was disclosed by…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Synagogue founder, TB Joshua, dies at 57 church says",
    "summarized_story": "The founder and head pastor of Synagogue church died on Saturday, aged 57.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it.”“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\n“The Synagogue Church Of All Nations and Emmanuel TV Family appreciate your love, prayers and concern at this time and request a time of privacy for the family.\n“Here are Prophet TB Joshua’s last words: ‘Watch and pray’.”He was said to have had stroke two months ago and was flown by air ambulance to Turkey for treatment, TheCable understands."
  },
  {
    "headline": "No plan to retrench, sack workers in Edo, Obaseki reassures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that there are no plans to either sack or retrench workers in the state, noting that ongoing reforms in the state’s civil and public service are aimed at improving productivity and service delivery to Edo people.\n“We are not going to retrench workers or sack anyone, but you must follow the new trends and conform to the new rules and if you can’t cope, you should move out from the service yourself.\nAnyone who flaunts the rule will get an automatic query and after three queries such a person leaves the system.\nAs the governor of the state, no file stays in my office beyond 48 hours,” Obaseki noted.\nOn his part, Edo State Head of Service and Chairman, Transition Committee Chairman, Barr."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "Insecurity: 201 killed, 137 abducted in violent attacks across Nigeria last week",
    "summarized_story": "Over 200 people were killed in violent attacks across Nigeria last week, as the insecurity across the country continues despite the efforts of security agencies.\nAlso, no fewer than 137 people were abducted across the country last week.\nAlso on Sunday, armed bandits abducted many pupils of an Islamic school in Tegina, a densely populated town in Rafi Local Government Area of Niger State.\nThe gunmen abducted a staff member who was on duty.\nAlso, the police said 88 people were killed on Thursday by bandits in attacks on some communities in Danko-Wasagu Local Government Area of Kebbi State."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "It Will Take Nigeria 50 Years To Recover From Another Civil War – Aregbesola",
    "summarized_story": "By Sunday Oguntuyi, OsogboNigeria’s Minister of Interior, Ogbeni Rauf Aregbesola, has said that it would take 50 years for Nigeria to recover from another civil war.\nThe Minister stated this on Saturday in Ilesa during his 64th birthday celebration and presentation of a book titled “The Rauf I Know,” written by a journalist, Mr Dayo Olanipekun.\nMr Olanipekun covered him as state house correspondent for the Broadcasting Corporation of Osun State (OSBC) during his two terms as governor.\n“It will take Nigeria 50 years to recover from civil war.\nAccording to Dosumu, Aregbesola has always been committed to all the activities of Awolowo Foundation, describing him as an exemplary leader."
  },
  {
    "headline": "World Environment Day: FG expresses concern about deforestation",
    "summarized_story": "The federal government through the Minister of Environment, Dr Mohammad Mahmood, who gave the warning, expressed concern over the level of deforestation in the country.\nDr Mahmood spoke at the 2021 World Environment Day with the theme “Ecosystem Restoration-Resource Relation with Nature”, organised by the Federal Ministry of Environment in conjunction with the Osun State Ministry of Environment and Sanitation held at De-distinguish Event Centre, Osogbo.\nHe added that the human interaction with the environment coupled with impacts of climate change have further enhance exerted pressure on the environment, including the marine ecosystem.\n“Man’s interaction with nature, coupled with the challenges and impacts of Climate Change, have grossly exacerbated the deleterious state of the environment.\nThe federal government, according to the Minister is working to ensure that the environment is efficiently protected for the sake of humanity."
  },
  {
    "headline": "Why I am promoting the I-Africa Cloud School project – Modupe Adeyinka-Oni",
    "summarized_story": "Renowned educationist and Proprietress of Standard Bearers School, Lekki, Lagos, Mrs. Modupe Adeyinka-Oni has said that the need to bridge the yawning educational standards gap within the society is the principal reason behind why she is promoting the I-Africa Cloud School Project alongside her partners.\nAs she explained, the big idea behind the project is to tap from within one pool to benefit the other pool.\nA former long-time player within the prestigious Corona Schools team, she is one who is generally always in search of value.\nGetting value, adding value and sharing value is first nature for her.\nNow her sights are set on improving overall capacity in the educational system."
  },
  {
    "headline": "Prophet T.B. Joshua dies, aged 57",
    "summarized_story": "OBINNA EZUGWUProphet Temitope Balogun Joshua, founder of the Synagogue Church of All Nations, is dead, aged 57.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.”"
  },
  {
    "headline": "COVID-19: UNILORIN Gets Molecular Laboratory",
    "summarized_story": "The University of Ilorin has flagged off its ultra-modern Molecular Diagnostic and Research Laboratory for the diagnosis of COVID-19 and the surveillance of other infectious diseases like poliomyelitis, Lassa Fever and other viral haemorrhagic fevers.\nThe project was sponsored by the Tertiary Education Trust Fund (TETFund).\nA statement by the director of Corporate Affairs, University of Ilorin, Mr. Kunle Akogun, disclosed that the laboratory, which was commissioned last weekend by TETFund’s Executive Secretary, Prof. Suleman Elias Bogoro, has already obtained the Nigeria Centre for Disease Control’s (NCDC) certification as a public health laboratory.\nHe added that the College of Health Sciences has some of the best medical personnel that consistently produce problem-solving researches.\nBogoro further disclosed that TETFund was working to curb medical tourism by providing infrastructure and research facilities to discourage Nigerians from going abroad where those facilities are available."
  },
  {
    "headline": "TB Joshua: Akoko Monarch Wants Cause Of Death Known",
    "summarized_story": "Following the sudden death of Pastor Temitope Balogun Joshua, the traditional ruler of his hometown, His Royal Majesty, Oba Yisa Olanipekun, the Zaki of Arigidi Akoko in Ondo State, has demanded that his body be preserved intact until arrangements are made to examine and determine the cause of his death.\nAccording to him, the shocking event was reported to have occurred on Saturday, June 5, following a prayer and worship session at his church.\nThe monarch further stated that, “His body is believed to have been deposited in a morgue somewhere around the church.\nA delegation from SCOAN is presently headed for Arigidi to make an announcement and submit a factual report of the devastating incidence.\nThe traditional ruler, however, commiserated with “the President, the Governor of Ondo State, my beloved people of Arigidi and the people of Nigeria in general for the loss of our illustrious son."
  },
  {
    "headline": "Wamakko Calls On Igbo Leaders To Halt Killings In South-East",
    "summarized_story": "A former Sokoto State governor, Senator Aliyu Magatakarda Wamakko, has urged Igbo leaders to converge and work out ways on ending the ongoing killings in the South-Eastern part of the country.\nAlthough he admitted that killings and other forms of criminalities have became a daily vice in all parts of the country, he stated that Igbo leaders are not doing enough to end the carnage in the zone.\nHe stated that through all these, as individual leaders and collectively, “we have maintained a studied silence by avoiding anything that will further rock the boat.\nHe however regrettably, “our friends and compatriots, leaders of Igbo extraction, have remained dead silent in the face of increasing assault and effort by their own people to stock a nationwide mayhem.\nSilence is no longer acceptable in the face of this clear danger and threat against the country”."
  },
  {
    "headline": "Injuries Hit Eagles Camp As Troost-Ekong, Collins Out Of Cameroon Friendly",
    "summarized_story": "William Troost-Ekong and Jamilu Coliins have been ruled out Tuesday’s friendly against the Indomitable Lions of Cameroon.\nThe duo picked up injuries against same opponent on Friday and will play no part in the next game at the Stadion Weiner Neustadt.\nTroost-Ekong was replaced by Valentine Ozorwanfor late in the game after picking up an injury, while Collins stayed on for the entire duration of the game.\n“It’s a difficult situation to have a defence (for the second game),” admitted the Eagles coach.\nThe Indomitable Lions defeated the Super Eagles 1-0 in the first friendly on Friday night."
  },
  {
    "headline": "Nigeria’s Rising Gymnast, Obiefuna Eyes Biles Record",
    "summarized_story": "Second-ranked best Nigerian gymnast, Munachi Obiefuna has said she wants to equal American artistic gymnast, Simone Biles who is the world’s third most decorated gymnast.\nObiefuna, who won two silver and a bronze at the 2020 National Sports Festival, while speaking to LEADERSHIP sports said she has what it takes to conquer the world.\nCombining both is easy because I allocate time to my studies and time for gymnastics training.\nThe sports have not been looked into and for Young gymnast like me who will be ready for next Olympics so I need adequate support to achieve my dreams” she added.\nMeanwhile, Chinwe Obiefuna, the mother and manager of Munachi encouraged parents to allow their children to engage in gymnastics at a very tender age."
  },
  {
    "headline": "Breaking: Meghan Markle and Prince Harry welcomes Baby Girl, who will be named Diana",
    "summarized_story": "Princess Meghan and Prince Harry have given birth to their first girl child, she will be named Diana Lilibet after her great-grandmother.\nAfter the Queen’s family nickname, Lilibet Diana Mountbatten-Windsor will be known to as Lili for short.\nREAD ALSO: Ex-President Jonathan mourns Prophet T.B.\nJoshuaShe was born at Santa Barbara Cottage Hospital in California on Friday, June 4th, at 11:40 a.m., weighing 7 pounds and 11 ounces.\nIn a statement, Meghan and Harry’s press secretary said that ‘both mother and child are healthy and well, and settling in at home’."
  },
  {
    "headline": "Anambra Guber: APC is popular in South/E, State will support us – Muoghalu",
    "summarized_story": "By Tom OkpeA major contender in the forth coming Anambra State Governorship election under the All Progressives Congress, (APC), Dr George Muoghalu has revealed that the party is popular in the South East, so, will enjoy tremendous support in the state governorship race.\nThe state governorship election is slated for November 6th, 2021.\nHe also said with the good will yhe region has enjoyed from the present administration, Anambra people will not forsake him.\n“Why wont they support us,” he queried, “when people keep saying APC is not popular in Anambra, in 2017, election we came second.\n“That is why we need all to join hands with the party by ensuring that Anambra State join the Progressives, come Nov. 6, at the forth coming state Governorship election.”"
  },
  {
    "headline": "ONSA directs dismantling of illegal security outfits — Daily Times Nigeria",
    "summarized_story": "The Office of the National Security Adviser has directed the immediate dismantling of all illegal security outfits being used to extort, harass and intimidate Nigerians across the country.\nIt also cautioned individuals, organisations and foreign partners particularly on the activities of a security outfit known as “NATFORCE”.\nAccording to the statement, ONSA has observed with concern the proliferation of illegal security outfits in the country.\n“These illegal outfits have been masquerading and acting as part of the Nigerian security architecture while extorting, harassing and intimidating Nigerians.\nONSA said that Nigeria had initiated the process for the full implementation of Article 24 of the ECOWAS Convention on small arms and light weapons following the setting up of NCCSALW on May 3."
  },
  {
    "headline": "Ex-President Jonathan mourns Prophet T.B. Joshua — Daily Times Nigeria",
    "summarized_story": "Former President Goodluck Jonathan has expressed sadness over the death of Prophet Temitope Joshua, the Founder and the Spiritual leader of the Synagogue Church of All Nations (SCoAN), popularly known as TB Joshua.\nHe said that he was saddened to hear about the death of T.B Joshua, at a young age of 57.\n“TB Joshua was a devout man of God who served God and humanity with relentless passion.\n“As a Christian leader, TB Joshua and his ministry exemplified Christ in faith, love and charity; positively impacting the lives of many Nigerians, Africans and millions of people across the world.\nThe former president also prayed God to grant millions of Joshua’s followers across the world the strength to cope with his exit."
  },
  {
    "headline": "Again, gunmen set police station, patrol vehicle ablaze in Delta",
    "summarized_story": "UNIDENTIFIED gunmen, today, attacked and set the Ashaka police station, Ndokwa East Local Government Area, Delta State, and a patrol vehicle ablaze.\nIt was gathered that the gunmen stormed the police stations in the early hours of today through the Ase Creek with four-speed boats.\nA source who craved anonymity said the gunmen set two buildings ablaze in the police state and a patrol vehicle before escaping through the creek.\n“Unprovoked attacks on the police will not deter the police from providing the needed security in any community in Delta state.\n“In the same vein, on 5/6/21 at about 2130hours, the men of Delta state command while on stop and search duty along Patani-Bayelsa road intercepted ASienna bus with Reg."
  },
  {
    "headline": "Again, gunmen set police station, patrol vehicle ablaze in Delta",
    "summarized_story": "UNIDENTIFIED gunmen, today, attacked and set the Ashaka police station, Ndokwa East Local Government Area, Delta State, and a patrol vehicle ablaze.\nIt was gathered that the gunmen stormed the police stations in the early hours of today through the Ase Creek with four-speed boats.\nA source who craved anonymity said the gunmen set two buildings ablaze in the police state and a patrol vehicle before escaping through the creek.\n“Unprovoked attacks on the police will not deter the police from providing the needed security in any community in Delta state.\n“In the same vein, on 5/6/21 at about 2130hours, the men of Delta state command while on stop and search duty along Patani-Bayelsa road intercepted ASienna bus with Reg."
  },
  {
    "headline": "Anxiety as soldiers, police, DSS invade IPOB lawyer’s Anambra home",
    "summarized_story": "It was gathered that the operatives surrounded the secessionist group’s lawyer’s family house around 2.30am.\nA source who claimed to have reached the lawyer said distressed voices were heard complaining about manhandling by the operatives.\nThe source said, “We managed to reach Barr Ifeanyi Ejiofor on phone and he confirmed the attack, saying that soldiers, joined by Police and DSS operatives are shooting in different directions and are about breaking into his main compound.\nBarr Ejiofor is doing his job as a lawyer.\n“If Barr Ifeanyi Ejiofor is legitimately wanted for any crime, due processes must be followed to the letter."
  },
  {
    "headline": "Tears as 17 die in Kano road crash",
    "summarized_story": "No fewer than 17 young men have been confirmed dead as a result of a fatal motor accident along the Kano-Zaria highway over the weekend.\nSources said the victims lost their lives while returning to Kano from a wedding ceremony of a mutual friend in Zaria on Saturday.\nResidents of Sani Mainagge quarters, Gwale local government area of Kano metropolis where the victims hailed from were thrown into a state of mourning due to the ugly incident.\n“I am therefore, on behalf of the government and people of Kano state, commiserating with their families, people of Sani Mainagge, Gwale local government, friends and well wishers.\nThe corpses of the victims have since been buried according to the Islamic rites and amidst tears by mourners."
  },
  {
    "headline": "Buhari breaks silence on TB Joshua’s death: ‘His legacies will endure’",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari has broken silence on the death of founder, Synagogue Church of All Nations (SCOAN), Prophet T.B.\nJoshua died late Saturday at the age of 57 years.\nReacting to his death, Buhari commiserated with the family and members of SCOAN on the passing of their father and founder, Pastor Temitope Balogun, popularly known as TB Joshua.\nBuhari urged Pastor Joshua‘s followers to take solace in the knowledge that life is not measured and defined by chronological longevity but by enduring legacies and lives touched positively.\nHe also condoled with the government and people of Ondo State and prayed that God Almighty will accept the soul of the departed pastor."
  },
  {
    "headline": "‘How TB Joshua became pastor, built Synagogue Church’",
    "summarized_story": "Salami Amusa, a close friend of Prophet Temitope Balogun Joshua, founder of Synagogue Church of All Nations has revealed the humble beginning of the pastor and the establishment of the church in 1987.\n“When Temitope wanted to start a business, I personally told him to go somewhere to do a lesson for people there.\nWhen we were leaving, Tope asked me if I believed the pastor and I said yes, he is a great pastor.\n“When Tope started, we both came together to buy this place where this church is built from the Baale of Adekunjo and late Alhaji Abanise, the Olori Ebi of Egbeland.\nAmusa further described Joshua’s death as “shocking and unbelievable”, adding that he rushed to the church to confirmed the news."
  },
  {
    "headline": "Sanwo-Olu, Emmanuel hit Deeper Life headquarters for Kumuyi at 80",
    "summarized_story": "By Kazeem UgbodagaLagos State Governor, Babajide Sanwo-Olu and his counterpart, Udom Emmanuel of Akwa Ibom State on Sunday made surprise visit at the Deeper Life Bible Church headquarters, Gbagada to honour the General Superintendent of the church, Pastor William Kumuyi as he clocks 80 years.\nIn their individual remarks, the governors appreciated Kumuyi and all members of the church for the opportunity given them to worship with the church.\nSpeaking, Sanwo-Olu expressed gratitude to God for the strength and continued grace He has granted Pastor Kumuyi, as he reached the age of 80.\nHe said that it was the fervent prayer of the likes of Pastor Kumuyi that had so sustained Nigeria that all the counsels of the enemy to destroy the country have always come to naught.\nAccording to him, “Moses started ministry at the age of 80 years of age and went on to 120 years."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Killed In Imo Gun Fight",
    "summarized_story": "Unknown gunmen attempted to attack the Imo State Police Command’s headquarters in Owerri, the state capital, again on Sunday.\nAs the criminals circled the state capital, churchgoers and other citizens fled, according to NEWS DIRECT.\nBala Elkana, a police public relations officer, verified in a statement that no cops were injured in the battle.\n“They arrived in a white Hummer Bus, where five hoodlums were slain and others were injured after a firefight.\nElkana continued, “The Hummer bus was discovered with four Ak47 rifles stolen from the police during a recent attack on its station.”To apprehend the fleeing hoodlums, security personnel have been dispatched."
  },
  {
    "headline": "Synagogue Church Headquarters In Lagos Sealed Off After TB Joshua’s Death",
    "summarized_story": "The headquarters of the Synagogue, Church of All Nations in Ikotun-Egbe, Lagos state has been sealed off.\nThis followed the death of the church’s founder, Temitope Joshua, popularly known as Prophet TB Joshua.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nPictures seen by SaharaReporters on Sunday morning showed that entrances into the church have been sealed off.\nThousands of sympathisers also thronged the church, in disbelief over the Prophet’s death."
  },
  {
    "headline": "BREAKING: Igangan Boils As Herdmen Kill 20, Palace, Petrol Station Burnt In Oyo",
    "summarized_story": "More than 20 people have been allegedly killed in Igangan, one of the towns in Ibarapa North local government, as gunmen opened fire last night.\nThis is coming few days after the chairman Oyo State Security Network codenamed Amotekun Corps, General Kunle Togun (rtd) alleged that foreign Fulanis have encamped the entire Southwest region and may strike if nothing is done urgently.\n“It is a problem that has been existing even before we came into government, and one of the promises I made then was to tackle security challenges.\nAnd the question to take home is – can anybody here imagine Oyo State without Amotekun?\nYes, there may still be few areas we need to improve on but we all should work together with Amotekun."
  },
  {
    "headline": "REVEALED: How Prophet T.B Joshua Died On His Way To Hospital",
    "summarized_story": "According to NEWS DIRECT, the Founder of the Synagogue Church of All Nations, Temitope Joshua, also known as Prophet TB Joshua, died on his way to the hospital.\nOn his way to the hospital, he passed away “NEWS DIRECT was told by a source.\nHis 58th birthday, which is six days away, was being planned.\nAlthough the cause of his death was not immediately revealed, insiders told NEWS DIRECT that he had been sick for two days.\nHis body is thought to have been deposited in the Lagos General Hospital in Isolo."
  },
  {
    "headline": "Pictures: Mourners gather, mourn late Prophet T.B Joshua, church cordoned off",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Watch Prophet TB Joshua’s statement on his June 12 Birthday before death",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Prophet TB Joshua’s last moments before death",
    "summarized_story": ""
  },
  {
    "headline": "Groups advocate cancer teachings in school curriculum -NigPilot",
    "summarized_story": "International nongovernmental organizations, NGOs, the OCI Foundation, and the Nigeria Cancer Society, NCS have advocated the introduction of anti-breast and Anti-cervical cancer teachings into the curriculum of all senior secondary schools in Nigeria.\nSpecifically, the two organizations are collaborating to reduce the impact of cancer in the country through the Arm Our Youths, ArOY Health campaign which was started in 2019 and meant to cover all the states of the federation by 2025.\nThe decision was reached after a virtual meeting and award ceremony, organized by the Nigerian Medical Students Association, NIMSA, and sponsored by the President, OCI Foundation, Professor Chris Ifediora, who is also a Family Physician, Fellow of the Royal Australian College of General Practitioners.\nSpeaking at the meeting, the President, Nigeria Cancer Society, NCS, Dr. Adamu Al-Hassan disclosed that the group would also partner the First Ladies Against Cancer, FLAC with a view to addressing cancer related issues in Nigeria, especially through the health campaign.\nAccording to him, the virtual meeting is being worked out where all the first ladies involved, can participate in."
  },
  {
    "headline": "NSA orders for the dismantling of Illegal security outfits -NigPilot",
    "summarized_story": "The Office of the National Security Adviser has ordered the immediate dismantling of all illegal security outfits in the country.\nHead, Strategic Communication,Office of the National Security Adviser, Mr. Zakari Usman conveyed this order in a statement in Abuja.\nThe statement reads: “The Office of the National Security Adviser has observed with concern the proliferation of illegal security outfits in the country.\n“These illegal outfits have been masquerading and acting as part of the Nigerian security architecture while extorting, harassing and intimidating Nigerians.\n“One of such groups is NATFORCE which seeks to combat illegal importation of Arms, Ammunition, Light Weapons, Chemical Weapons and Pipeline Vandalism and has been involved in mounting of illegal roadblocks, conducting illegal searches, seizures and recruitment."
  },
  {
    "headline": "Anambra guber: I’ll emerge APC consensus candidate if any, Moghalu boasts",
    "summarized_story": "Prominent contender in the November 6 governorship election in Anambra State, Chief George Moghalu, has expressed confidence he’ll emerge as the preferred All Progressives Congress, APC, candidate should the party go for consensus.\nThere is presently no sign of the party adopting the consensus option but Moghalu remains upbeat there is possibility of discussion in that direction.\n“Since Consensus is not the only option, it is either direct primary, indirect primary or consensus.\n“I’m coming to the business with experience, with knowledge, with capacity, with integrity, with courage and determination to win the election.\nUdoedehe maintained that the party has no anointed candidate and it is ready to work with who ever emerge at the primary."
  },
  {
    "headline": "FG suspension of Twitter operations violates rights of citizens -NigPilot",
    "summarized_story": "Digital Rights Advocay Group under the aegis of Paradigm Initiative has said that the Federal Government’s (FG), s uspension of Twitter operations in Nigeria violates the rights of citizens.\nAccording to the statement, “The Federal Government of Nigeria announced its suspension of Twitter operations, that the application can be used as a platform for activities capable of undermining Nigeria’s corporate existence.\n“Many Nigerians read the announcement of the ban on Twitter as a reflection of the importance of the platform and other digital (social media) platforms to Nigerians in accessing information and disseminating the same.\n“A 2016 United Nations resolution affirms that the rights that citizens have offline must apply online.\nWe urge the Nigerian authorities to respect and enforce citizens’ fundamental rights as provided for by the Nigerian constitution and International human rights treaties that Nigeria is a party to”."
  },
  {
    "headline": "Prophet TB Joshua Dies At 57",
    "summarized_story": "Popular Nigerian prophet and televangelist TB Joshua has died.\nThe founder of the Synagogue Church Of All Nations (SCOAN) was 57 at the time of his death.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "20 Killed In Car Crash Along Kaduna-Kano Highway",
    "summarized_story": "No fewer than 20 people have lost their lives in an accident along the Kaduna-Kano road.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, confirmed this in a statement issued on Sunday.\nAccording to Aruwan, the bus was Kano-bound, while the SUV was headed for Zaria.\nEye-witness reports also confirmed that the crash was a head-on collision between the two vehicles, due to bad driving at a diversion point on the highway.\nGovernor Nasir El-Rufai who was saddened by the incident prayed for the repose of the souls of the deceased and also wished the injured quick recovery."
  },
  {
    "headline": "Security Agents Repel Attack On Police HQ, Kill Five Gunmen",
    "summarized_story": "Four other gunmen were also killed by the security operatives.\nIn a statement issued by the Public Relations Officer of the Imo Police Command, Bala Elkana, the security operatives who repelled the attack comprised of men of the Army, Police Special Forces, and other supporting security agencies.\n“He confirmed that Dragon is the leader of the gang in Imo State reporting to their supreme leader Nnamdi Kanu.\nOther exhibits recovered from the gang are Assualt (AR) Rifle breach N0: 03018058; Assualt (AR) Rifle breach N0: 070007055; Assualt (AR) Rifle breach N0: 5801297; six locally fabricated Explosive Devices; Police beret cap; 7 AK47 Magazines fully loaded; one military cap; one military cardigan (Polo); one silver-coloured minibus with Reg N0: WAM-8673 B ABD and one Hummer Bus with Reg N0: KED-382 X laden with Explosive Devices.\n“So, the people who threatened me that they will make Imo ungovernable before Imo becomes ungovernable, they will be ungovernable themselves.”"
  },
  {
    "headline": "Many Reported Dead As Gunmen Invade Igangan Community",
    "summarized_story": "Many have been reported killed with houses and vehicles burnt during an attack within Igangan community in Ibarapa Area of Oyo State.\nAlthough the police are yet to confirm the number of deaths, a command spokesman, Wale Osifeso, said the assailants attacked the area last night with guns and other dangerous weapons but a combined team of the police, hunters, and vigilantes were able to beat back the criminal elements.\nOyo Tension: Houses, Vehicles Burnt, Policeman Injured In IganganOyo Tension: Culprits Behind Violence In Igangan Will Be Brought To Justice – PoliceOsifeso further states that the situation is being closely monitored and a comprehensive investigation is ongoing to apprehend the perpetrators.\nThis attack is coming days after Governor Seyi Makinde visited the area and held a town hall meeting with the community.\nIbarapa has been under the spotlight recently over clashes erupting intermittently between farmers and herders, resulting in deaths and injuries."
  },
  {
    "headline": "TB Joshua Will Be Missed For His Spiritual Contributions, Philanthropic Gestures – Buhari",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family and members of The Synagogue, Church of All Nations (SCOAN) on the passing of their father and founder, Pastor Temitope Balogun, popularly known as TB Joshua.\nIn a statement signed by the Special Adviser on Media and Publicity to the President, Femi Adesina, President Buhari noted that the renowned televangelist will be missed by his followers all over the world not only for his spiritual contributions but for touching many lives through his philanthropic gestures.\nRead Also: Prophet TB Joshua Dies At 57President Buhari also condoled with the government and people of Ondo State and prays that God Almighty will accept the soul of the departed pastor.\nThe founder of the Synagogue Church Of All Nations was 57 at the time of his death.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will."
  },
  {
    "headline": "President Buhari mourns T.B Joshua, says he will be greatly missed all over the world",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family and members of The Synagogue, Church of All Nations (SCOAN) on the passing of their father and founder, Pastor Temitope Balogun, popularly known as TB Joshua.\nIn a statement released by Special Adviser to the President, Femi Adesina, Buhari noted that the renowned televangelist will be missed by his followers all over the world not only for his spiritual contributions, but for touching many lives through philanthropic gestures.\nPresident Buhari urged Pastor Joshua’s followers to take solace in the knowledge that life is not measured and defined by chronological longevity but by enduring legacies and lives touched positively.\nHe also condoles with the government and people of Ondo State and prayed that God Almighty will accept the soul of the departed pastor."
  },
  {
    "headline": "Buhari, Osinbajo, Tinubu, others to speak at Book launch titled “APC’s Litmus Tests”",
    "summarized_story": "President Muhammadu Buhari, Vice President Yemi Osibanjo, Mr Bola Ahmed Tinubu, and other leaders of the All Progressives Congress, APC, are to speak at the public launch of a book titled “APC’s Litmus Tests,” written by Mr Salihu Lukman, Director-General of the Progressive Governors Forum.\nThis was contained in a press statement signed by APC’s former National Publicity Secretary, Mr Lanre Issa-Onilu on behalf of the Organising Committee.\nThe book, according to the statement, will help the APC strengthen its democratic credentials by promoting political stability, best practices, and good governance in Nigeria.\nAdvertisement“There is no better time to put this book together as APC grapples with the nitty-gritty of formative challenges.\nIts main agenda is to assist APC leaders and, indeed, all stakeholders in negotiating the next bend,” the statement read."
  },
  {
    "headline": "Mixed reactions as Church members, sympathisers mourn T.B Joshua",
    "summarized_story": "Hours after news broke that popular clergyman and founder of the Synagogue Church of All Nations (SCOAN), Temitope Joshua is dead, members of his church are yet to come to terms with the news.\nHundreds of sympathisers, some church members and other acquaintances thronged the area.\nThough there are conflicting reports on how he died, TVC news gathered that the popular clergyman had taken a break at about 2am, during a church service that started at 6pm on Saturday.\nBorn on June 12, 1963, Prophet TB Joshua, he had released a video few days ahead his 58th birthday.\nThe church also released a communique earlier announcing news of his death."
  },
  {
    "headline": "Nigeria: Despite Intelligence Reports, Bandits on Motorbikes ‘Kill at Least 20’ in Southwest Oyo State",
    "summarized_story": "At least 20 people have been allegedly killed in Igangan, one of the towns in Ibarapa North local government area of Oyo State, southwest Nigeria, as unknown gunmen Saturday night opened fire on the community.\nThis is coming few days after the Chairman of Oyo State Security Network codenamed, Amotekun Corps, General Kunle Togun (rtd), alleged that foreign Fulanis have encamped the entire Southwest region and may strike if nothing is done urgently.\nAccording to him, ”People had barely retired to bed when they said they sighted motorcycles entering the town.\nHe said: “I have received the shocking news of the attacks on residents of Igangan, Ibarapaland, in the early hours of this morning.\nI urge residents to remain calm as security operatives are now in control of the situation.”Kemi Olaitan in Ibadan"
  },
  {
    "headline": "Meghan Gives Birth to Baby Girl Called Lilibet",
    "summarized_story": "Meghan, Britain’s Duchess of Sussex has given birth to her second child, a baby girl, who she and husband Prince Harry have named after Queen Elizabeth and his late mother Princess DianaLilibet ‘Lili’ Diana Mountbatten-Windsor was born on Friday at the Santa Barbara Cottage Hospital in California, with Harry in attendance.\n“On June 4th, we were blessed with the arrival of our daughter, Lili.\nShe is more than we could have ever imagined, and we remain grateful for the love and prayers we’ve felt from across the globe,” Harry and Meghan said in a statement.\n“Thank you for your continued kindness and support during this very special time for our family.”Their press secretary said both mother and baby were doing well and were back at home.\nTheir first child, Archie, was born in 2019."
  },
  {
    "headline": "Nigeria: Police Foil Attack on Imo Station, Kill Five Suspected Seperatists",
    "summarized_story": "Bala Elkana, the Imo state police public relations officer in a statement released on Sunday said another suspect was arrested and presently aiding investigation.\n“One suspect Stanley Osinachi, 30 years old of Achi/Mberi , Mbaitoli Local Government Area of Imo State was arrested and presently aiding investigation.\n“He confirmed that Dragon is the leader of the gang in Imo State reporting to their supreme leader Nnamdi Kanu.\n“Four AK 47 Rifles with 2000 rounds of live ammunition and large number of explosives were recovered from the scene.\nHe also appreciated the synergy amongst the security forces especially the Armed Forces and the DSS whom he said constantly feeds the joint operation with credible intelligence while the Military has consistently provided defence and outer cover to the Police."
  },
  {
    "headline": "Banning Twitter Embarrasses Nigeria Government: Omojuwa",
    "summarized_story": "There has been outrage by Nigerians over the ban on Twitter imposed by the Federal Government, with many condemning the decision and asking the government to rescind its decision.\nPolitical commentator Japhet Omojuwa was on ARISE NEWS’ Morning Show to weigh in on the ban and it’s effect on the polity.\nWatch the interview"
  },
  {
    "headline": "Nothing Good Can Come Out of Twitter Ban, Government Should Reverse It Now: Omojuwa",
    "summarized_story": "There has been outrage by Nigerians over the ban on twitter imposed by the Federal Government, with many condemning the decision and asking the government to rescind its decision.\nPolitical commentator Japhet Omojuwa was on ARISE NEWS’ Morning Show to weigh in on the ban and it’s effect on the polity.\nWatch the video"
  }
]