[
  {
    "headline": "Popular security analyst, Ona Ekhomu, is dead",
    "summarized_story": "Popular private security expert, Dr Ona Ekhomu, is dead.\nEkhomu died Monday night after he took ill some weeks ago at the age of 66.\nBorn in March 1955, Ekhomu was the Chairman, Transworld Security Systems and a founding member of the American Society for Industry Security (ASIS) International in Nigeria.\nPresident Pittsburgh Trading Company, 1986, Trans-World Consultant, Inc., Pittsburgh, since 1978, Trans-World Security Company, Pittsburgh, since 1984.\nHe held several leadership positions in the private security sector both in Nigeria and Africa."
  },
  {
    "headline": "Viral video: Indonesia apologises over assault on Nigerian diplomat",
    "summarized_story": "The Indonesia Ambassador to Nigeria has apologised over an assault on a Nigerian diplomat by immigration officers in Indonesia.\n“Concerning the manhandling and arrest of a Nigerian Diplomatic Agent in front of his official quarters on 7 August 2021.\n“The Nigerian Government has complained strongly to the Government of Indonesia, and the Ambassador of Indonesia to Nigeria was summoned by the Nigerian Minister of Foreign Affairs.\n“The Nigerian Government has sent an official protest to the Government of Indonesia.\n“The Ambassador of Nigeria to Indonesia has confirmed that the immigration officials involved had since come to the Nigerian Embassy to apologize to the Ambassador and the diplomat concerned.”"
  },
  {
    "headline": "Steer clear of alleged support for Igboho, Yoruba group tells Obasanjo",
    "summarized_story": "“The Nigerian history, in its present form has recorded the Yoruba nation as the greatest beneficiaries of Nigeria’s unity since independence.\nIronically former President Olusegun Obasanjo is a Yoruba man who has benefited the most from whatever gains Nigeria made of her unity.\nWhat dues were deserving of the Yoruba nation that Obasanjo could not make up during his time as Head of State and President?\nWe call on former President Olusegun Obasanjo to utilize his international privileges to champion the unity of this country.\n“It is perhaps too late for any individual in the echelon of former President Olusegun Obasanjo to contemplate a divided Nigeria at this moment."
  },
  {
    "headline": "Nigeria, Vietnam ties: Osinbajo seeks improved collaboration",
    "summarized_story": "Vice President Professor Yemi OsinbajoWith the opportunities existing in agriculture & technology in Nigeria and Vietnam, both countries will benefit from effective collaboration in these sectors and thereby deepen their friendly relationships.\nProf. Osinbajo made this assertion on Monday at the Presidential Villa during a courtesy visit by the Ambassador of the Socialist Republic of Vietnam to Nigeria, Luong Quoe.\nThere was also talk about cashew processing and rice growing and rice processing where Vietnam has shown great innovation and great success.\nI think that we should look for opportunities where young people in Nigeria and Vietnam can interact especially in technology and share ideas, innovation, and their different attainments.\nAlso present at the meeting were the Minister for Foreign Affairs, Mr. Geoffrey Onyeama, and other top government officials."
  },
  {
    "headline": "Rapid Response Squad arrest 2 daredevil robbers terrorizing Lagos",
    "summarized_story": "By Esther OnyegbulaOperatives of the Lagos State Rapid Response Squad (RRS), have arrested two armed robbers in the early hours of 9 August along Akowonjo Road, Alimosho.\nUpon interrogation, they were found to be notorious criminals perpetrating series of robberies across different locations in Lagos.\nThey both confessed to being members of ‘Aye Confraternity’.\nMeanwhile, the Commander of the Lagos State Rapid Response Squad (RRS) CSP Olayinka Egbeyemi has ordered the transfer of the suspects to the Lagos State Command for discreet investigation in line with the directive of the Lagos State Commissioner of Police Hakeem Odumosu.\nVanguard News Nigeria"
  },
  {
    "headline": "Akwa Ibom declares emergency on education sector, provides 28000 desks to schools",
    "summarized_story": "By Harris Emanuel, UyoAkwa Ibom state government has said that it has dedicated all inter-ministerial direct labor projects to the education sector to address infrastructure deficits in public schools.\nEmemobong explained that the only means to handle cases of lack of amenities in public schools was to use inter-ministerial direct labour to intervened and fix infrastructure in public schools.\nRecently, 28,000 desks were sent to public schools.\n” The age of perpetrators of cultism in public schools is a major challenge in fighting cultism in schools.\n” We would also activate juvenile homes and moral rebirth as well placing spies in public schools to check who introduce cultism and isolate those who caused this cultism in our public schools,” he said."
  },
  {
    "headline": "Barca lawyers set to block Messi’s PSG move",
    "summarized_story": "Barcelona lawyers are sensationally trying to block Lionel Messi’s transfer to Paris Saint-Germain in a dramatic twist.\nPSG are reported to have offered a two-year contract to Messi and the six-time Ballon d’Or winner reportedly agreeing terms with the French giants.\nBarca lawyers have filed a complaint to the European Court of Appeal, claiming PSG should be stopped in their tracks to sign the Argentine based on financial data.\n“PSG’s ratios in terms of ‘Financial Fair Play’ are worse than those of FC Barcelona.\n“It is inconceivable that the ‘Financial Fair Play’ serves to aggravate the drifts of football-business, the instrumentalization of football by sovereign powers, and the distortion of competitions.”Vanguard News Nigeria"
  },
  {
    "headline": "Sunday Igboho: Benin Republic stopped plane Buhari govt sent to pick agitator – Falana alleges",
    "summarized_story": "Femi Falana, an activist lawyer, has disclosed that the Benin Republic government refused to put freedom fighter, Sunday Igboho, on a waiting plane after his arrest in the French-speaking country in July.\nFalana said the Nigerian government told their Benin Republic counterpart to repatriate Igboho, after his arrest.\nHe noted that the Benin Republic, however, informed the Muhammadu Buhari-led government to understand that obeying the law is sacrosanct to them.\nAccording to Falana: “The Nigerian government asked the Benin Republic government to repatriate Sunday Igboho.\nThe Yoruba nation agitator fled Nigeria to the Benin Republic after he was declared wanted by the Department of State Services, DSS."
  },
  {
    "headline": "Embrace fishery, livestock production to fight poverty – Bauchi govt tells women farmers",
    "summarized_story": "Women farmers in Bauchi State have been urged to explore other areas of agriculture like fishery and livestock production to fight poverty and tackle food insecurity instead of total concentration on crops production.\nThe advice was given by the acting permanent secretary in the Bauchi State Ministry of Agriculture, Barrister Saratu Jibrin, while receiving women farmers, under the aegis of Public Finance on Agriculture (PFA) Committee in her office.\nJibrin submitted that some cultural practices might prevent women from going to farm, adding that such women could engage in livestock and fishery within their households.\nBut rearing of domestic animals and fishery can conveniently be undertaken by such women within their households, Jibrin said.\nShe then reminded the state government of its pledge to employ extension workers and also fulfil its promise to train women farmers in various aspects of agriculture, including livestock production."
  },
  {
    "headline": "Kidnappers demand N500 million ransom to release Niger State Commissioner of Information",
    "summarized_story": "The abductors of Commissioner of Information and Strategy in Niger State, Idris Sani Mohammed, have contacted his immediate family demanding N500 million ransom before his release.\nA source said the abductors have relocated outside the shores of Niger State with their whereabouts unknown.\nThe Commissioner is the second high profile politician to fall into the trap of abductors within twenty-four hours in the state.\nOn Saturday, the zonal chairman of the governing All Progressives Congress in zone C of the state, Aminu Bobi was taken captive by armed gunmen at a village in Mariga.\nReports said unknown gunmen suspected to be armed bandits, at the weekend, also abducted Aminu Bobi who was supervising work on his farmland."
  },
  {
    "headline": "Resident Doctors threaten to continue strike as govt stalls dialogue",
    "summarized_story": "The House of Representatives’ intervention into the ongoing strike by the National Association of Resident Doctors has stalled.\nThe meeting, organised by the House Committee on Health Services was going fine until the issue of allowances was raised.\nThe Minister of Health (State), Olorunbe Mamora said the issue of allowances is still in court, hence the government cannot give commitment.\nExpressing anger, NARD’s President, Uyilawa Okhuaihesuyi issued a threat, warning that the union will not call off the strike if the government continues to frustrate dialogue using the court case.\nIt would be recalled that the doctors embarked on strike on the 2nd of August, over issues of Resident Doctors Training areas, minimum wage regularization and others."
  },
  {
    "headline": "50% of Nigerian children not registered at birth, govt cannot plan for them – UNICEF decries",
    "summarized_story": "UNICEF says Africa has the lowest birth registration rate in the world, resulting in poor planning for children.\n“As Nigeria joins the rest of the world in commemorating Civil Registration and Vital Statistics Day today, it is addressing structural, normative and operational challenges to birth registration.\n“Birth registration is a one-off event that gives every child a unique identity which will give them better access to vital services like health, education, and social protection.\nWhile submitting that every child has a right to a name, nationality and legal identity, UNICEF said working together with stakeholders, Nigeria had to meet its Sustainable Development Goal (SDG) obligation to provide legal identity for all, including through birth registration.\nIt noted that the indicator for the target is the proportion of children under the age of five whose births have been registered with a civil authority by age."
  },
  {
    "headline": "Social media reacts as Davido’s cousin B-Red says he suffered growing up",
    "summarized_story": "By Ekaete BasseyDavido’s cousin Adebayo Adeleke aka B-Red has stirred massive reactions among social media users following his revelation he suffered despite having a billionaire uncle and millionaire dad.\nAccording to the HKN Singer and songwriter, he suffered but his life has changed.\nAll the show money, all the balling over the years, God, I’m grateful.\nCheck the meaning of suffering and leave us alone.”ebeekaboere wrote: “Suffering is relative oh!\nThis suffering thing get level abeg.”nene_george stated: “Shatappppp there!"
  },
  {
    "headline": "Nigerian Tunji Balogun is new CEO of Def Jam Records",
    "summarized_story": "By Ekaete BasseyMusic executive and former VP of A&R for RCA, Tunji Balogun has joined Def Jam Records as the new CEO.\nTunji Balogun replaces Eminem’s longtime manager, Paul Rosenberg as CEO of Def Jam, ending a 6-year term at RCA.\nAlong with Courtney Stewart, Jon Tanners and Jared Sherman, Tunji Balogun founded Keep Cool Records in 2018, a joint venture with RCA.\nFounded 35 years ago, Def Jam is home to Justin Bieber, Jay-Z, Rihanna, Kanye West, Big Sean, YG, Alessia Cara and Logic, among other artists.\nBalogun’s hiring comes on the heels of Def Jam naming promotion veteran Nicki Farag executive vice president and general manager."
  },
  {
    "headline": "Anxiety as Akpabio receives forensic audit report",
    "summarized_story": "By Okodili Ndidi, AbujaThe long-awaited forensic audit report of the Niger Delta Development Commission (NDDC) has been submitted, triggering fear about the future of the interventionist agency.\nThe Presidency had rebuffed calls for the scrapping of the Commission or constituting a substantive Board until the result of the forensic audit is submitted.\nADVERTISEMENTIn the interim report of the forensic audit, 12,128 abandoned projects that could not be traced to any contractor were uncovered.\nNiger Delta Affairs Minister Godswill Akpabio, moments after receiving the audit report, assured that President Muhamamadu Buhari will act swiftly on the document.\nThis is coming few days after expiration of the July ending dateline earlier announced by the Minister for the submission of the forensic report."
  },
  {
    "headline": "Nigeria, Vietnam ties: Osinbajo seeks improved collaborations",
    "summarized_story": "Our ReporterVice President Yemi Osinbajo has stated Nigeria and Vietnam stand to benefit from effective collaboration in agriculture and technology to deepen their friendly relationships.\nHe spoke on Monday at the Presidential Villa during a courtesy visit by Ambassador of the Socialist Republic of Vietnam to Nigeria, Luong Quoe.\nThere was also talk about cashew processing and rice growing and rice processing where Vietnam has shown great innovation and great success.\nThe Vice President also noted other areas of collaboration between Nigeria and Vietnam would be in the interaction of young people actively engaged within the technology space in both countries.\n“I think that we should look for opportunities where young people in Nigeria and Vietnam can interact especially in technology and share ideas, innovation, and their different attainments."
  },
  {
    "headline": "Police occupation heightens tension in APC secretariat",
    "summarized_story": "From Romanus Ugwu, AbujaThe national leadership of the All Progressives Congress (APC) has defended its decision to mobilise police to the secretariat, confirming that it was based on security report available to it.\nAPC headquarters wore a semblance of a battlefield in the early hours of yesterday, as policemen, loaded in over five vans took over the party secretariat.\nReacting to the situation, the National Secretary APC Caretaker/Extraordinary Convention Planning Committee, Senator John James Akpanudoedehe, said the party’s leadership acted based on security report.\nHe said there was nothing to be worried about the development meant to strengthen security at the party’s secretariat.\nWe cannot embarrass the president, we cannot embarrass the government of APC and we cannot embarrass ourselves,” the party scribe said."
  },
  {
    "headline": "PDP crisis: Confusion as 9 NWC members hold parallel meeting, advise Secondus to quit",
    "summarized_story": "There are 19 NWC members, comprising 12 national officers, and six national vice chairmen in charge of the six geo-political zones.\nHowever, the PDP National Legal Adviser, Emmanuel Enoidem, described the meeting as a nullity as it is only the national chairman or two-third of NWC members that can convene a meeting of the party organ.\nOthers who attended the meeting were Senator Umar Ibrahim Tsauri, national secretary; Abdulahi Maibasira, national financial secretary and Chief Theophilus Dakas, national vice chairman (North Central).\nThe aggrieved NWC members resolved to forward their resolution to the PDP Governors Forum, the BoT and other organs of the party.\nThis is as members of the PDP caucus in the House of Representatives have disagreed over calls for the resignation the party’s national chairman, Uche Secondus."
  },
  {
    "headline": "6 killed as IPOB sit-at-home grounds South East",
    "summarized_story": "Banks and markets such as Ekeoha Market (Shopping Centre), Ariaria international Market, Ahia Ohuru (Ngwa Road Market), Cemetery/Eziukwu Road Market, and others were shut down.\nHowever, government establishments like University of Nigeria Nsukka, Nsukka council secretariat, some primary and secondary schools were opened.\nThe ever-busy Enugu Road Nsukka by Nsukka known for traffic gridlock witnessed free with scanty flow of vehicular and human movement.\nIn Abakaliki, all the transport companies located along Afikpo road opened for businesses but there were no passengers.\nAlso, some shops opened for businesses in the capital city with free human and vehicular movements though not as it used to be on a normal day."
  },
  {
    "headline": "DSS asks court to nullify bail granted Igboho’s associates",
    "summarized_story": "Justice Obiora Egwuatu had, last Wednesday, granted bail to the 12 detainees who had spent five weeks in the custody of the DSS.\nThey were arrested on July 1, 2021, at Igboho’s Ibadan residence raided by DSS operatives around 1am.\nBut, in a fresh motion marked FHC/ABJ/CS/647/2021 and filed on Monday, the Department of State Security Service (DSS), specifically urged the court to set aside the bail granted to Amudat Babatunde, Abideen Shittu, Jamiu Oyetunji, and Bamidele Sunday.\nIt is laughable and turned logic upside down that after over a month in the DSS custody, the DSS still needs more days to punish them.\nOne of the sureties, the court held, must be an employee of the federal government on grade level 12 and above."
  },
  {
    "headline": "Okorocha forfeits properties to Imo govt",
    "summarized_story": "The judge further ruled that all properties contained in pages 226 to 272 of the Imo State Government White Paper gazette on recovery of lands and properties belonging to Imo State be recovered.\nFormer governor Emeka Ihedioha had established a judicial panel of inquiry on lands allocation and administration by previous administrations in the State.\nThe current Hope Uzodimma administration, which inherited the report of the panel, had embarked on recovery of government properties in Okorocha’s custody, based on the white paper, which emanated from a Judicial Panel of Inquiry on Recovery of Imo State government assets and properties.\nJustice Njemanze maintained that the white paper gazette by the Imo state government remains a legal binding document.\nMeanwhile, counsel to Okorocha, Oba Maduabuchi, has expressed surprise over the judgement, describing it as unfortunate."
  },
  {
    "headline": "Messi Agrees to Join PSG on Two-year Contract",
    "summarized_story": "Lionel Messi has agreed to join Paris Saint-Germain on a two-year contract.\nThe six-time Ballon d’Or winner had two other options after leaving Barcelona last week, but has chosen to move to the French club on a deal worth £25m per year after tax.\nMessi was set to extend his 21-year stay at Barcelona by signing a new five-year deal this summer.\nHowever, the club announced on Thursday that “financial and structural obstacles” meant the deal could not be completed, meaning Messi left as a free agent.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "PDP Govs, Secondus Reach Deal, Convention May be Brought Forward",
    "summarized_story": "Abaribe and Elumelu denied reports that PDP members in the House had passed a resolution that Secondus should resign.\n“I can confirm to you that I will not resign”, Secondus told reporters as he made to leave the venue.\nAlthough a deal to bring the convention backward had been struck, it was not clear if it included the eligibility of Secondus to contest.\n“In attendance were Deputy National Chairman (North), Senator Suleiman Nazif; National Secretary, Senator Umar Ibrahim Tsauri; National Auditor, Mai Adamu Mustapha; National Financial Secretary, Abdulahi Maibasira; National Youth Leader, Hon.\n“Happily, the national chairman, Prince Uche Secondus, has issued a statement a short while ago that he will not resign."
  },
  {
    "headline": "CBN: Digital Currency Would Be Critical National Infrastructure",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN) has said its proposed digital currency, known as e-Naira, will be treated as a critical national infrastructure to protect it from operational and cyber-security risks.\nThe digital currency regime would also introduce a new range of banking services and integration with new systems, providing new possibilities for the payment architecture.\nEmefiele said if “you have some naira in your account and you choose to convert part of your naira into a digital wallet by way of a digital currency, we will support that.\nOf course, when this starts, the CBN will move some of the balances of banks with CBN to those banks in digital currency.\n“Therefore, e-Naira, which will represent the digital equivalent of cash, will be used as the fiat currency to effect transactions,” he stated."
  },
  {
    "headline": "Rivers Govt, Not FG Should Collect VAT, Related Taxes, Court Rules",
    "summarized_story": "FHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant).\n“The court noted that the application is like asking the Federal High Court to transfer the entire case to the Court of Appeal.\nDonald Chika Denwigwe, SAN, lead counsel to Government of Rivers State and Ken C.O.\nNjemanze, SAN, briefing journalists after the Federal High Court in Port Harcourt on Monday declared FIRS collection of Value Added Tax in Rivers State unconstitutional.\n“So, in other words, the issue of Value Added Tax (VAT) in the territory of Rivers State and Personal Income Tax should be reserved for the government of Rivers State.”Counsel to FIRS, O.C."
  },
  {
    "headline": "Breaking: NNPC Promotes, Redeploys Top Management Officials",
    "summarized_story": "In a statement last night, the management of the corporation announced the promotion and redeployment of some staff to fill key vacant positions, including Mr. Billy Okoye, who has now been appointed the new Group Executive Director, Ventures & Business Development.\nThe statement signed by the outgoing Group General Manager, Group Public Affairs Division, of the corporation, Dr. Kennie Obateru, stated that Mrs. Aisha Ahmadu-Katagum, has been promoted to the position of Group Executive Director, Corporate Services.\nIt noted that until their new appointments, Okoye and Ahmadu-Katagum were Group General Managers, Crude Oil Marketing Division (COMD) and Supply Chain Management Division in the corporation, respectively.\nIn addition, a former Chief Operating Officer, Business and Ventures Development, Mr. Adeyemi Adetunji, becomes the Group Executive Director, Downstream, while a former Chief Operating Officer, Corporate Services, Mr. Mohammed Ahmed, becomes the Group Executive Director, Gas and Power.\nMuhammad is likely to now exit the office of the Minister of State, Petroleum Resources, Mr Timipre Sylva, where he was Special Adviser on Media before now."
  },
  {
    "headline": "Again, Buhari Calls UK Police On Nigerians, Protesters Lay 14-Day Siege To Embassy",
    "summarized_story": "SaharaReporters obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\nWATCH: Used To Oppressing Protesters, Nigeriaâ\u0080\u0099s Tyrannical President @MBuhari Again Calls UK Police On #BuhariMustGo Demonstrators Laying Siege On Residence https://t.co/OB3yf2v7VD pic.twitter.com/XPU7ah2Z6F — Sahara Reporters (@SaharaReporters) August 10, 2021“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London.\n“They insisted that President Buhari must go as he had failed.\nThey have laid siege on the embassy for 14 days – since Buhari left for the UK without handing over to Vice President Yemi Osinbajo.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there."
  },
  {
    "headline": "Again, Buhari Calls UK Police On Nigerians, Protesters Lay 14-Day Siege To Embassy",
    "summarized_story": "SaharaReporters obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\nWATCH: Used To Oppressing Protesters, Nigeriaâ\u0080\u0099s Tyrannical President @MBuhari Again Calls UK Police On #BuhariMustGo Demonstrators Laying Siege On Residence https://t.co/OB3yf2v7VD pic.twitter.com/XPU7ah2Z6F — Sahara Reporters (@SaharaReporters) August 10, 2021“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London.\n“They insisted that President Buhari must go as he had failed.\nThey have laid siege on the embassy for 14 days – since Buhari left for the UK without handing over to Vice President Yemi Osinbajo.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "Amnesty: Over 112 people killed in Plateau, Kaduna in one month",
    "summarized_story": "Amnesty International says the failure of Nigerian authorities to protect lives and properties has enabled the bloody attacks in some communities in Plateau and Kaduna states.\nThe organisation said despite signs of retaliatory attacks, not enough was done to avert the bloodshed, thereby fuelling the ongoing circle of violence.\nAdvertisement“At least 112 people were killed, 160 abducted and thousands displaced in communities in Kaduna and Plateau states from July to 5 August 2021,” the statement reads.\n“Villagers from farming communities, informed Amnesty International that, innocent people and communities that know nothing about the attacks are sometimes targeted for reprisal.\nAdvertisementOver the past few weeks, some communities in Kaduna and Plateau have witnessed a surge in the killings and destruction of properties."
  },
  {
    "headline": "Amnesty: Over 112 people killed in Plateau, Kaduna in one month",
    "summarized_story": "Amnesty International says the failure of Nigerian authorities to protect lives and properties has enabled the bloody attacks in some communities in Plateau and Kaduna states.\nThe organisation said despite signs of retaliatory attacks, not enough was done to avert the bloodshed, thereby fuelling the ongoing circle of violence.\nAdvertisement“At least 112 people were killed, 160 abducted and thousands displaced in communities in Kaduna and Plateau states from July to 5 August 2021,” the statement reads.\n“Villagers from farming communities, informed Amnesty International that, innocent people and communities that know nothing about the attacks are sometimes targeted for reprisal.\nAdvertisementOver the past few weeks, some communities in Kaduna and Plateau have witnessed a surge in the killings and destruction of properties."
  },
  {
    "headline": "FG writes Indonesia, protests manhandling, arrest of Nigerian diplomatic agent",
    "summarized_story": "Geoffrey Onyeama, minister of foreign affairs, has summoned Usra Harahap, the Indonesian ambassador to Nigeria, over the alleged assault on a Nigerian diplomatic agent in Jarkarta, Indonesia.\nThe diplomatic agent, identified as Ibrahim, was reportedly accosted by the Indonesian police when he went to a supermarket.\nAdvertisementThe foreign affairs minister said the incident is against international law and the Vienna Conventions governing diplomatic and consular relations between states.\n“Concerning the manhandling and arrest of a Nigerian Diplomatic Agent in front of his official quarters on 7 August 2021.\nAdvertisement“The Nigerian Government has complained strongly to the Government of Indonesia, and the Ambassador of Indonesia to Nigeria was summoned by the Nigerian Minister of Foreign Affairs."
  },
  {
    "headline": "FG writes Indonesia, protests manhandling, arrest of Nigerian diplomatic agent",
    "summarized_story": "Geoffrey Onyeama, minister of foreign affairs, has summoned Usra Harahap, the Indonesian ambassador to Nigeria, over the alleged assault on a Nigerian diplomatic agent in Jarkarta, Indonesia.\nThe diplomatic agent, identified as Ibrahim, was reportedly accosted by the Indonesian police when he went to a supermarket.\nAdvertisementThe foreign affairs minister said the incident is against international law and the Vienna Conventions governing diplomatic and consular relations between states.\n“Concerning the manhandling and arrest of a Nigerian Diplomatic Agent in front of his official quarters on 7 August 2021.\nAdvertisement“The Nigerian Government has complained strongly to the Government of Indonesia, and the Ambassador of Indonesia to Nigeria was summoned by the Nigerian Minister of Foreign Affairs."
  },
  {
    "headline": "'We're pampering insurgents' -- reactions to photos of army donating food items to 'repentant' Boko Haram leaders",
    "summarized_story": "The Nigerian Twittersphere is abuzz over photos which show the army donating food items to surrendered Boko Haram commanders.\nAdvertisementThe Boko Haram commanders had surrendered to troops in Operation Hadin Kai.\nIn a statement on Monday, Onyema Nwachukwu, army spokesperson, shared photos of the Boko Haram commanders, saying Musa Adamu, a chief bomb expert of the insurgents, was one of those who surrendered.\nBut young Nigeria youth protesting on the street for a better country is seen as a threat that deserve to rot in jail or shot at.\n#BETTERNIGERIA https://t.co/n5ThNFcw0O — E A S Y🚶🏾 (@AASamuel321) August 10, 2021AdvertisementThis is disheartening 😔 https://t.co/3yO5Girrt2 — Adedayo Adesuyi (@AdesuyiAdedayo) August 10, 2021Surrendered Boko Haram commanders carrying placards pleading forgiveness."
  },
  {
    "headline": "Chaka partners with TradingView to help clients better invest in global markets",
    "summarized_story": "Chaka has teamed up with TradingView, a leading online charting platform used by investors, to help its clients better spot and evaluate investment opportunities in global markets.\nUsing TradingView, traders follow investment assets, find trading ideas, chat with other investors, spot trends in global markets, assess opportunities, and place trades directly on charts.\nProfessional traders and investment enthusiasts across Africa that use Chaka can now access the wide trading community on TradingView with their brokerage accounts.\nClients that access TradingView through Chaka will pay fees as low as 0.69%, under the company’s dynamic fee system that helps investors preserve their capital.\nFor now, Chaka users can only access TradingView by invite, which they can request here."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "How South African API edtech startup, FoondaMate, is helping students study with WhatsApp",
    "summarized_story": "According to a social media report (PDF) by Global Wellbeing Index (GWI), 96% of South African Internet users use WhatsApp.\nResponding to the growing number of users, Dacod Magagula (CEO) and Tao Boyle (COO) founded FoondaMate, a WhatsApp API.\n“So, we developed a method for students to study online using WhatsApp,” Magagula adds.\nConsidering the cost of traditional educational materials like textbooks and group tutoring in South Africa, FoondaMate helps save costs by offering those services on WhatsApp.\nFrom South Africa to the WorldLike the Kenyan edtech startup, M-Lugha, helping Kenyans learn in their native language, FoondaMate engages its users in their indigenous languages."
  },
  {
    "headline": "Nigerian eCommerce startup, Omnibiz, secures $3m seed to expand across West Africa",
    "summarized_story": "Share this article:Nigeria-based Business to Business (B2B) eCommerce startup, Omnibiz has announced securing $3million in a seed round.\nIt plans to expand into other cities in West Africa and participate in Seed Stars’ accelerator program.\nLed by V&R Africa, Timon Capital and Tangerine Insurance, this seed round also saw investments from Launch Africa, Sunu Capital, Musha Ventures, Rising Tide Africa, and LoftyInc.\nOmnibiz is not Rustagi’s first attempt at building a business in Africa, having previously founded VConnect, which allowed people to find local professionals.\nThat was our specialisation, but our business model didn’t work."
  },
  {
    "headline": "Chekkit’s $500k pre-seed, tapping global stock markets, Moove’s $23m Series A",
    "summarized_story": "Moove’s $23m Series AChekkit raises $500k pre-seed to combat fake consumer drugs and goodsChekkit TeamChekkit, a Nigeria-based anti-counterfeiting startup, has announced a $500k pre-seed.\nNigerian deep tech startup, RxAll is looking to squash the $30 billion global fake drug industryBefore this funding, Chekkit relied on grants.\nTapping global investment currentsPartnershipWhat does a partnership between a Nigeria-based investment-tech startup and a global investment social network platform spell for investors?\nWith this partnership, Chaka is now a local, licenced broker with the TradingView investment platform.\nRecall that Chaka is also the first digital investment platform to secure Nigeria’s new digital sub-broker licence."
  },
  {
    "headline": "Gapiona Flood Project: Edo NEWMAP flays fake viral video, says govt committed to tackling erosion problems – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State-Nigerian Erosion and Watershed Management Project has condemned a viral video of a protest by some persons purported to be living around the project catchment area of Gapiona, noting that claims in the said video were falsely represented.\n“The project is by the Edo State Government and not a World Bank project as erroneously conveyed in the said video.\nFurthermore, the Gapiona flood Project was initiated at the instance of the State Government and not the other way.\nResidents in Gapiona area have lived with the erosion problem for over 20 years, this has led to many residents fleeing their homes while majority of the access roads linking the area has been rendered impassable.\n“NEWMAP’s intervention in the area has brought succor to residents in the sections where work has been completed."
  },
  {
    "headline": "‘Repent Or Relocate’ New DPO Warns Criminals In Warri – Nigerian Observer",
    "summarized_story": "CSP Onana Omar Ari , disclosed this while on a courtesy visit to the Nigerian Union of Journalists(NUJ) Warri Correspondents’ Chapel.\nHe warned criminals gaining more grounds to relocate from the division or repent in their own interest.\n“My message to these criminal elements is that, they should repent or relocate, because we are not here to play”.\nAddressing Journalists at NUJ Secretariat in Warri, CP Ari stated that, the police could not single-handedly fight and win the war against criminals without the active support of the public.\n“Collaboration of members of the public with the police in the fight against these monsters causing havoc in the society is highly imperative to burst the rings of the criminals,” he said."
  },
  {
    "headline": "Edo govt begins training for state’s information officers, media practitioners, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced a month-long training for Information Officers, Media Practitioners and Public Relations Officers under the employment of the state government.\nThe training, aimed at upskilling the workers and equipping them with modern communication skills and tools, is part of ongoing efforts by the Governor Godwin Obaseki-led government to renew the state’s communication ethos through the establishment of the Edo Communication Organization (ECO).\nDeclaring the workshop open at the John Odigie-Oyegun Training Centre in Benin City, the Edo State Head of Service, Anthony Okungbowa Esq., said the workshop will further enhance the workers’ skills thereby ensuring improved productivity and optimal service delivery to Edo people.\nAccording to him, “the training programme is timely as it will enable participants to enhance their skills and knowledge, thereby ensuring they function effectively.”He noted that the Obaseki-led government is committed to the training and retraining of every Edo worker, adding, “Effective communication is a veritable tool in the implementation of government policies and programmes, which is a necessity in the realization of Governor Godwin Obaseki’s vision of making Edo great again.”The training is organized by the Edo State Government, in collaboration with the Tonnie Iredia Centre for Media Advocacy (TICMA).\nResource persons like Professor Tonnie Iredia, who is the Chairman Board of Trustees of TICMA and other prominent professionals in academics, communication, advertising and Public Relations will be tutoring the participants during the one month period, to raise the standard of communication practice in Edo State."
  },
  {
    "headline": "Edo Sexual Assault Referral Centre assures justice for victims of rape, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The newly appointed Coordinator of the Edo State Sexual Assault Referral Centre, Dr. Georgina Eromosele, has promised to ensure justice for the victims of rape and other gender-based violence in the state.\nEromosele, who spoke to journalists in Benin City, called for the support of residents to tackle sexual and gender-based violence including rape and domestic violence, in line with the vision of Governor Godwin Obaseki and his wife, Mrs Betsy Obaseki.\nThe new coordinator for the centre, which is named after the late teenage victim of rape, Vivian Ogu, is a graduate of the Obafemi Awolowo University, Ile-Ife (OAU) medical school, with a Masters degree in Public Health from the Ladoke Akintola University, Ogbomosho, and was most recently a Senior Medical Officer at Central Hospital, Benin City.\nEromosele, who earlier served as Head of the District Hospital, Ekiadolor, is a Member of the Medical and Dental Council of Nigeria, and was Secretary-General, Association of Resident Doctors, Edo State HMB chapter, before her appointment.\nAccording to her, “the Vivian Centre is one of a kind in the country and is well positioned to serve as a safe environment where survivors are given all the required care and support they need, including medical examination, screening and preventive treatment for Human Immunodeficiency Virus (HIV) and other sexually transmitted infections.”..."
  },
  {
    "headline": "Tokyo Olympics: The Good, the bad and the ugly for Team Nigeria",
    "summarized_story": "There was wild jubilation 57 years ago when Nigeria took part in the 1964 Olympic Games held in Tokyo, Japan.\nAnother African country, Kenya, was on par with Nigeria in the 35th position, having also won a solitary bronze medal.\nGreat OptimismThough the build-up to the Tokyo Olympics had its flaws, there was great optimism and rightly so, going by the performances of the country’s best athletes across the globe.\nIt was understandable that many tipped athletics and wrestling to be the joker for Nigeria in Tokyo.\nGlory momentsWhile many Nigerians may think there is nothing worth celebrating from the Tokyo Olympics, that actually is not the case."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Court declared collection of value added tax by federal government illegal",
    "summarized_story": "A Federal High Court sitting in Port Harcourt, Rivers State, has declared the collection of Value Added Tax (VAT) and Personal Income Tax by the Nigerian federal government as illegal and unconstitutional.\nThe suit (FHC/PH/CS/149/2020) between the Attorney-General for Rivers State and Federal Inland Revenue Service (FIRS) as the first defendant and the Attorney General of the federation, Abubakar Malami, as the second defendant.\nThe court decided in favour of the Rivers State as the rightful arm to receive personal income tax and VAT originating from the state.\nPam issued an order of perpetual injunction limiting FIRS and the AGF from coercing residents of Rivers State to pay VAT and personal income tax to FIRS.\nThe judge dismissed the defendant’s plea for the case to be transferred to the Court of Appeal for interpretation"
  },
  {
    "headline": "Nigerian security expert, Ona Ekhomu is dead",
    "summarized_story": "A Nigerian security experts and Chairman of Transworld Security Systems Chief, Dr Ona Ekhomu, is dead.\nUntil his death, he was a global leader in industrial security and a founding member of Association of Industrial Security and Safety Operators of Nigeria (AISSON) International in Nigeria.\nThe renowned security expert, who was born on March 26, 1955, in Irrua, Edo State, was the first chartered security professional in West Africa."
  },
  {
    "headline": "Lionel Messi to Join PSG for $41 Million a Year",
    "summarized_story": "Argentine superstar, Lionel Messi has finalized agreement on his Paris Saint-Germain contract and flew to France on Tuesday to complete the move that confirms the end of a career-long association with Barcelona.\nMessi is set to earn around 35 million euros ($41 million) net annually, the person said.\nMessi’s father and agent, Jorge, also confirmed Messi was moving to PSG in a brief exchange with reporters at Josep Tarradellas Barcelona-El Prat Airport on Tuesday.\nWhile PSG had to pay 222 million euros (then $261 million) to sign Neymar from Barcelona in 2017, there was no transfer fee for Messi.\nThe Catalan club had hoped to keep Messi, who agreed to a pay cut but it still wouldn’t have complied with the Spanish league’s financial regulations."
  },
  {
    "headline": "Buhari after Nnamdi Kanu, Igboho, but spares Fulani militia – Ortom",
    "summarized_story": "Ortom thus, challenged the Buhari government to go after bandits and Fulani militiamen killing, raping and kidnapping people all over the country with the same gusto it used to pursue separatists.\n“Today, bandits, Fulani militia are terrorising the entire country, the country is in disarray and these Fulani militia have come out with video clips and they have identified where they are.\nIt was amazing that a top government official comes out to say that the Fulani militias are invisible.\nWhy is the government not going after these Fulani militias and bandits that are terrorising the entire country and terrorising my state?\n“Just two days ago, two humanitarian workers were gunned down in my own village by these Fulani militias and their phones taken away."
  },
  {
    "headline": "Enugu APC Executives ‘Sack’ Nwoye As Party Chairman",
    "summarized_story": "Members of State Executive Committee (SEC) of the All Progressives Congress (APC) in Enugu State have passed a vote of no confidence on state’s party chairman, Dr. Ben Nwoye, accusing him of insurbodination to statutory authorities and attempt to balkanise the state chapter of the party.\nConsequently, they appointed in his stead, Prince Chikwado Chukwunta Nnaji, the state vice chairman as the acting chairman of the APC in Enugu State.\nADVERTISEMENTThese were part of the resolutions of the committee contained in a communique signed by 42 members of the State Executive Committee on Tuesday.\nThe committee further accused Nwoye of gross misconduct, disregard to party’s constitution and congress guidelines as spelt out by the Caretaker And Extraordinary Convention Planning Committee (CECPC) of the party.\nSpeaking to journalists at a press conference, the acting state vice chairman, Prince Gilbert C. Chukwunta, in company of other party executives including state secretary, Chief Robert Eze; state woman leader, Hon Mrs Oby Nwofor; state youth leader, Joshua Mamah, and the state financial secretary, Dr. Mrs. Amaka Adonu, stated that the exco members had come together to rescue the party from its looming dismemberment should Nwoye remain as chairman."
  },
  {
    "headline": "Enugu APC Executives ‘Sack’ Nwoye As Party Chairman",
    "summarized_story": "Members of State Executive Committee (SEC) of the All Progressives Congress (APC) in Enugu State have passed a vote of no confidence on state’s party chairman, Dr. Ben Nwoye, accusing him of insurbodination to statutory authorities and attempt to balkanise the state chapter of the party.\nConsequently, they appointed in his stead, Prince Chikwado Chukwunta Nnaji, the state vice chairman as the acting chairman of the APC in Enugu State.\nADVERTISEMENTThese were part of the resolutions of the committee contained in a communique signed by 42 members of the State Executive Committee on Tuesday.\nThe committee further accused Nwoye of gross misconduct, disregard to party’s constitution and congress guidelines as spelt out by the Caretaker And Extraordinary Convention Planning Committee (CECPC) of the party.\nSpeaking to journalists at a press conference, the acting state vice chairman, Prince Gilbert C. Chukwunta, in company of other party executives including state secretary, Chief Robert Eze; state woman leader, Hon Mrs Oby Nwofor; state youth leader, Joshua Mamah, and the state financial secretary, Dr. Mrs. Amaka Adonu, stated that the exco members had come together to rescue the party from its looming dismemberment should Nwoye remain as chairman."
  },
  {
    "headline": "COVID-19: Nigeria To Receive 176,000 Doses Of J&J Vaccine Wednesday",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) has said that Nigeria is expecting 176,000 doses of Johnson&Johnson (J&J) COVID-19 vaccine on Wednesday.\nHe also said that the country is expected to receive 700,000 doses of AstraZeneca COVID-19 vaccine to enable those who have received their first jab to get the second jab.\nADVERTISEMENT“J&J COVID-19 vaccine is expected in two days time (Wednesday).\n“We expect to get 700,000 doses of the AstraZeneca vaccine to make sure that those who got the first dose will get the second dose,” he explained.\nShuaib also disclosed that the second phase of COVID-19 vaccination roll-out would begin on Monday next week."
  },
  {
    "headline": "COVID-19: Nigeria To Receive 176,000 Doses Of J&J Vaccine Wednesday",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) has said that Nigeria is expecting 176,000 doses of Johnson&Johnson (J&J) COVID-19 vaccine on Wednesday.\nHe also said that the country is expected to receive 700,000 doses of AstraZeneca COVID-19 vaccine to enable those who have received their first jab to get the second jab.\nADVERTISEMENT“J&J COVID-19 vaccine is expected in two days time (Wednesday).\n“We expect to get 700,000 doses of the AstraZeneca vaccine to make sure that those who got the first dose will get the second dose,” he explained.\nShuaib also disclosed that the second phase of COVID-19 vaccination roll-out would begin on Monday next week."
  },
  {
    "headline": "Striking Resident Doctors Defy FG’s Resumption Order",
    "summarized_story": "Nigerian Association of Resident Doctors (NARD) has said the ongoing nationwide strike by its members will continue even if the government decides to implement its “no work, no pay” threat till their demands are met.\nNARD president, Dr Uyilawa Okhuaihesuyi, told LEADERSHIP last night that unless they get a satisfactory response from the government, the strike will continue despite the threat.\nHe said, “We will continue with the strike.\nWe are happy with the threat because it shows that we are doing something good.”ADVERTISEMENTThe doctors embarked on an indefinite strike on August 2, 113 days after it suspended the last strike.\nMeanwhile, the minister of state for labour and employment, Festus Keyamo, has urged the government to live up to its responsibilities, saying agreements with workers should be respected."
  },
  {
    "headline": "Drama as monarch withdraws Okorocha’s chieftaincy title",
    "summarized_story": "The first class monarch had few weeks ago named Okorocha the Otunba Asoludero of Iselu kingdom through a letter signed by the monarch.\nOkorocha had also accepted the chieftaincy title and a September 19, 2021 date had been set for the installation ceremony.\nBut, Oba Akinyemi on Monday in another letter addresses to the senator explained that the chieftaincy title was withdrawn in the interest of peace and harmony.\nIt was further gathered that the monarch was asked to withdraw the chieftaincy title and cancel the proposed ceremony.\nHe said, “It is left to him, I don’t know because he was the one that chose to give a chieftaincy title and he wrote me."
  },
  {
    "headline": "Drama as monarch withdraws Okorocha’s chieftaincy title",
    "summarized_story": "The first class monarch had few weeks ago named Okorocha the Otunba Asoludero of Iselu kingdom through a letter signed by the monarch.\nOkorocha had also accepted the chieftaincy title and a September 19, 2021 date had been set for the installation ceremony.\nBut, Oba Akinyemi on Monday in another letter addresses to the senator explained that the chieftaincy title was withdrawn in the interest of peace and harmony.\nIt was further gathered that the monarch was asked to withdraw the chieftaincy title and cancel the proposed ceremony.\nHe said, “It is left to him, I don’t know because he was the one that chose to give a chieftaincy title and he wrote me."
  },
  {
    "headline": "Sit-at-home: Eight killed as IPOB’s protest turns bloody",
    "summarized_story": "Gunmen, who went on a shooting spree in Anambra, attacked a police Area Command in Nnewi axis of the state.\nIt was terrible; these guys (hoodlums) came in seven vehicles.\n“There were speculations that the hoodlums came for reprisal following the early morning killing of two persons by unidentified soldiers (joint patrol team) in Nnewi.\nA source said the car was abandoned when the occupant saw that the hoodlums were advancing towards his direction.\nAn elderly man, Pa Johnson, whose house is opposite the scene, told The PUNCH that the incident happened around 4:30am."
  },
  {
    "headline": "Sit-at-home: Eight killed as IPOB’s protest turns bloody",
    "summarized_story": "Gunmen, who went on a shooting spree in Anambra, attacked a police Area Command in Nnewi axis of the state.\nIt was terrible; these guys (hoodlums) came in seven vehicles.\n“There were speculations that the hoodlums came for reprisal following the early morning killing of two persons by unidentified soldiers (joint patrol team) in Nnewi.\nA source said the car was abandoned when the occupant saw that the hoodlums were advancing towards his direction.\nAn elderly man, Pa Johnson, whose house is opposite the scene, told The PUNCH that the incident happened around 4:30am."
  },
  {
    "headline": "Nnamdi Kanu de facto governor-general of South eastern states [Photos]",
    "summarized_story": "By AbankulaThe people of Southeastern states of Nigeria ignored their governors Monday and complied with the order of Nnamdi Kanu’s Indigenous People of Biafra to sit at home.\nIt was to demand for the release of IPOB leader Nnamdi Kanu, from DSS detention.\nWhat this clearly shows is that the average south easterner has bought into the separatist campaign of IPOB, led by Nnamdi Kanu.\nThe average person listens more to Kanu, than Governors Obiano, Ugwuanyi, Uzodimma, Umahi and Ikpeazu.\nThe governors or Governor-General Nnamdi Kanu?"
  },
  {
    "headline": "Court strikes out Contempt of Court suit against Lekki Gardens MD Nyong",
    "summarized_story": "The presiding judge, Nicholas Oweibo also struck out the entire suit filed by the Registered Trustees of Osborne and Foreshore Residents Association,OSFRA for being abuse of court processes and lack of juridisction.\nJoined as co-respondent in the suit alongside Lekki Gardens Limited and others, was National Environmental Standard and Regulations Enforcement Agency (NESREA).\nIn striking out the Residents Association’s suit, Justice Oweibo agreed with the Lekki Gardens Limited and others that the plaintiff concealed material facts, saying that ‘though, apart from the first defendant, NESREA, other parties and facts in the suit before his court are the same as the suit filed before a Lagos High Court by Lekki Gardens Limited.\n“Looking at the circumstances of the fact that there is nothing different between the suit filed before this court and the one before a Lagos High Court, than first defendant, this suit is an abuse of court process.\n“The suit is accordingly struck out and cost of N50, 000, is hereby awarded against the Plaintiff,” the judge said."
  },
  {
    "headline": "Resident Doctors Threaten To Continue Strike As Govt Stalls Dialogue",
    "summarized_story": "The intervention of the House of Representatives in the continuing strike by the National Association of Resident Doctors has come to a halt.\nThe discussion, which was hosted by the House Committee on Health Services, was going well until the topic of allowances came up.\nThe Minister of Health (State), Olorunbe Mamora said the issue of allowances is still in court, hence the government cannot give commitment.\nExpressing anger, NARD’s President, Uyilawa Okhuaihesuyi issued a threat, warning that the union will not call off the strike if the government continues to frustrate dialogue using the court case.\nIt would be recalled that the doctors embarked on strike on the 2nd of August, over issues of Resident Doctors Training areas, minimum wage regularization and others."
  },
  {
    "headline": "Reno Omokri Reacts To Photos Of Surrendered Boko Haram Members Seeking Forgiveness From Nigerians",
    "summarized_story": "Reno Omokri has reacted to photographs of surrendered Boko Haram members pleading with Nigerians for forgiveness.\nThe Nigerian Army released photos of the surrendered sect members carrying placards with the inscription “Nigerians Please Forgive Us” on Monday, August 9.\nReno reacted to the photos on his Instagram page, writing:”The Buhari administration shared photos of so called repentant Boko Haram terrorists and asked Nigerians to forgive them.\nDoes it make sense to ask Nigerians to forgive people who have killed innocent Nigerians when the Buhari government wants to prosecute Sunday Igboho for protecting the same innocent Nigerians?\nIn fact, I doubt that that sign was written by these mostly illiterate Boko Haramists."
  },
  {
    "headline": "Hushpuppi: Suspended DCP Abba Kyari Appears Fourth Time Before Inspector-General’s Panel",
    "summarized_story": "Abba Kyari, the suspended Deputy Commissioner of Police and former Commander of the Police Intelligence Response Team, was reportedly quizzed for four hours by the Inspector General of Police’s investigative panel for his ties with Ramon Abbas nicknamed Hushpuppi, an admitted fraudster.\nThe Special Investigation Panel, led by Deputy Inspector General of Police in charge of Force Criminal Investigations Department, Joseph Egbunike, interrogated the suspects at FCID’s Area 10 headquarters in Garki, Abuja, according to Vanguard.\nIt was the fourth time Kyari would appear before the committee.\nBefore Monday’s interrogation, Kyari had appeared before the SIP on three occasions and had continued to insist on his innocence, saying he did nothing wrong.\nNEWS DIRECT had reported that the Police Service Commission suspended the embattled Deputy Commissioner of Police and he was also replaced as the Head of the Intelligence Response Team (IRT) of the Nigeria Police Force, by DCP Tunji Disu."
  },
  {
    "headline": "Nigeria’s Central Bank Governor, Emefiele Hosts Lavish Birthday Party In Jamaica, Dangote, Bank Executives Show Up In Private Jets",
    "summarized_story": "At a private birthday event in Jamaica organized by the Central Bank of Nigeria’s Governor, Godwin Emefiele, the crème de la crème of Nigeria’s banking and finance industry, as well as Africa’s richest man, Aliko Dangote, gathered at the weekend in a brazen display of wealth.\nThe bank officials, who arrived in the South American country on private aircraft, stormed the celebration to impress Emefiele, who turned 60 last week, according to NEWS DIRECT.\n“Some big boys and Emefiele were at Montego Bay City, Jamaica, last weekend to celebrate his 60th birthday.\nPresident Muhammadu Buhari had last week sent a congratulatory letter to Emefiele, having celebrated his birthday on August 4.\nEmefiele served as the governor of Nigeria’s apex bank since June 3, 2014."
  },
  {
    "headline": "Pictures: Lionel Messi, family members storm Paris ahead PSG medical, ‘final’ deal",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: PSG, Messi agree 2-year deal worth £500, 000 per week",
    "summarized_story": "Paris Saint-Germain have reached agreement with Lionel Messi and his lawyers with the 34-year-old expected in the French capital this afternoon.\nA press conference is set to take place on Wednesday at the Parc des Princes.\nThe final points of negotiation are understood to have concerned the six-time Ballon d’Or winners image rights, as well as the breakdown of his wages and various bonuses.\nThe player’s representatives and Barcelona had earlier moved to dispel reports that the Spanish side made a last ditch bid to keep Messi.\nFor that reason they did not attempt to persuade Messi to drop his salary."
  },
  {
    "headline": "PDP crisis: Will Secondus get Oshiomhole treatment?",
    "summarized_story": "Will National Chairman Peoples Democratic Party (PDP) Prince Uche Secondus go the way of sacked Comrade Adams Aliyu Oshiomhole as the national chairman of the All Progressives Congress (APC)?\nUdeh-Okoye – National Youth Leader, Ambassador Taofiq Arapaja – National Vice Chairman (SW), Chief Dr. Ali Odefa National Vice Chairman (SE), Chief Dan Osi Orbih -National Vice Chairman (SS) and Chief Theophilus Dakas National Vice Chairman (NC).\nS.K.E Udeh- Okoye, Ambassador Taofiq Arapaja – National Vice Chairman (SW), Chief Dan Orbih National Vice Chairman (SS) and Chief Dr. Ali Odefa National Vice Chairman (SE),” the statement further said.\nYouth groupSimilarly, a group – Save PDP Group and Coalition of PDP Youth Groups -protested Monday in Abuja and called for Secondus’ removal.\nNational vice chairs join callIn the same vein, the party’s national vice chairmen are also asking for Secondus’ resignation."
  },
  {
    "headline": "PDP crisis: Govs to continue dialogue with stakeholders Tuesday",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Sack Ngige, Ehanire, Sanusi -NARD -NigPilot",
    "summarized_story": "National Association of Resident Doctors, NARD, has called for the immediate sack of Ministers of Labour and Productivity, Dr. Chris Ngige, his Health counterpart Osagie Ehanire and Registrar, Medical and Dental Council of Nigeria, MDCN, for failure to carry out their duties.\nThe call was made by NARD’s President, Uyilawa Okhuaihesuyi, who said the ministers and Tajudeen should be sacked if they cannot handle their responsibilities.\nOkhuaihesuyi tackled Ngige for issuing threats of replacement against the resident doctors on national television when their demands raised have not been met.\n“If you want to toe the line of no work, no pay, I think you will go and look for 16,000 resident doctors to occupy our place,” he said.\nHowever, in his response, Ngige threatened that the federal government will invoke the no-work and no-pay order against the resident doctors because the federal government has met their demands."
  },
  {
    "headline": "FG Partners with NOA for GEEP 2.0 kickoff –NigPilot",
    "summarized_story": "Federal Government has signed a partnership with the National Orientation Agency as one of its key partners in its quest to raise awareness for its National Social Investment Programmes.\n“I must say the agency has shown outstanding dedication towards effective implementation of the NSIP programmes.\nIt is in this vein that the FMHADMSD entered into a partnership with NOA to appoint the Community Orientation and Mobilization officers as GEEP Desk Officers in all the 774 local government local areas across the country”.\nTo this end, the ministry in conjunction with NOA has appointed Community Orientation and Mobilization officers to be trained as GEEP Local Government Desk Officers in all the 774 local government levels areas across the 36 states and the FCT.\nThese officers will sensitize communities on the GEEP programmes, register interested beneficiaries of TraderMoni, MarketMoni and FarmerMoni."
  },
  {
    "headline": "Xenophobia:How Nigerian Diplomat Manhandled, Tortured in Indonesia -NigPilot",
    "summarized_story": "The development is coming on the heel of manhandling, torturing, and handcuffing of a senior Nigerian Diplomat in Jakarta, Indonesia, Mr Abdul Rahman Ibrahim over the weekend.\nThe release was titled The Continued Harassment, Intimidation and Unlawful Arrest of Nigerians in Asian Countries and The Need For President Muhammadu Buhari ‘s Urgent Intervention”.\nComrade Nwankwo explained with regret that, many Nigerians are currently languishing unjustly in many Prisons across Asia.\nThe development which resulted for him to sustain a lot of injuries in the neck, hands and chest.\nAfter the whole unfortunate and ugly drama, the Officers later realized that Mr. Abdul Rahman Ibrahim is a senior Counsellor/Diplomat with Nigerian Embassy in Indonesia as he had claimed."
  },
  {
    "headline": "JUST IN: Nigeria To Receive 176,000 J&J COVID-19 Vaccines On Wednesday",
    "summarized_story": "Nigeria is expected to receive 176,000 doses of the Johnson and Johnson COVID-19 vaccines on Wednesday.\nHe said the J&J vaccine, like the AstraZeneca, is safe and efficient against the coronavirus disease, including the deadlier Delta variant.\nThe J&J vaccine is a single-shot vaccine.\nIt is expected to boost the COVID-19 fight with the Delta variant sparking fears of a third wave of the pandemic.\nDr Shuaib had recently announced that the second phase of the COVID-19 vaccination programme would commence soon."
  },
  {
    "headline": "More Boko Haram Insurgents Surrender In Borno, Beg For Forgiveness",
    "summarized_story": "More Boko Haram and Islamic State of West Africa Province (ISWAP) terrorists in Borno State have surrendered their arms and embraced amnesty.\nWith banditry now on the increase, the Nigerian military has resolved to intensify both its kinetic and non-kinetic approach towards the ongoing fight against insurgency and particularly leverage the knowledge of Musa Adamu and Usman Adamu to achieve both short and long-term counter-insurgency gains in the North East.\nThe subject of amnesty has been met with controversy as many believe that granting pardons to the insurgents could compromise the country’s security architecture.\nOne of those who has been vocal against the idea is Chairman, Senate Committee on Army, Ali Ndume.\nHe believes the provision of blanket amnesty to insurgents has the tendency to breed new forms of criminality in the country."
  },
  {
    "headline": "NCDC Calls For Action As Cholera Kills 816 In 22 States, FCT",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has called on state governments and citizens to take more proactive steps to combat the outbreak of cholera across states in Nigeria.\nAccording to the NCDC, the recent outbreak has been exacerbated by poor access to clean water, open defecation, poor sanitation, and hygiene.\nWithout proper water, sanitation, and hygiene (WaSH), Nigeria remains at risk of cholera cases and deaths,” the NCDC added.\nFrom July 24 to 28, a reactive oral cholera vaccine (OCV) campaign led by NPHCDA was conducted in Bauchi LGA.\n“Cholera is preventable and treatable; however, it can be deadly when people who are infected do not access care immediately,” it warned."
  },
  {
    "headline": "COVID-19: Nigeria Records 422 New Cases, Five More Deaths",
    "summarized_story": "Nigeria on Monday recorded 422 new cases of COVID-19 and five more deaths, this is according to the Nigeria Centre for Disease Control (NCDC).\nLagos takes the lead with 190 cases, followed by Rivers (86) and Ogun (85).\nMore than 200 million cases of the pandemic have been confirmed with a spike in the death toll of four million globally.\nRecently, the Executive Director of the National Primary Health Care Development Agency (NPHCDA), Dr Faisal Shuaib announced the commencement of the second phase of the COVID-19 vaccination programme on August 16.\n“The start date for the vaccination has been postponed to next week Monday,” he said."
  },
  {
    "headline": "US Warns Citizens Against Travel To France Over COVID-19 Concerns",
    "summarized_story": "The US State Department has advised Americans to avoid all travel to France over rising coronavirus cases in the country.\nFrance is battling a fourth wave of the virus even though Covid-19 hospitalizations are still way off previous highs.\nThe State Department issued a “Level 4: Do Not Travel” advisory for France on Monday, based on a parallel warning from the US Centers for Disease Control, the country’s top medical body.\n“If you must travel to France, make sure you are fully vaccinated before travel,” the CDC said.\nA total of 74 million vaccine doses have been administered in France, according to the World Health Organization, and over 55 percent of the eligible population have received both vaccine doses."
  },
  {
    "headline": "Progressive Governors’ Forum urges Doctors to call off strike",
    "summarized_story": "The Progressive Governors Forum has called on members of the National Association of Resident Doctors (NARD) to suspend their ongoing strike action.\nThe forum in a statement threw its weight behind the initiative of the Nigeria Governors Forum (NGF) aimed at addressing the doctors’ grievances.\nIt noted that most of the grievances of the Resident Doctors are with State Governments.\nThe forum appealed to the resident doctors to negotiate with individual State Governments while issues affecting Resident Doctors in Federal establishments should be negotiated with the relevant structures of the Federal Government.\nThe Forum also expressed satisfaction with the conduct of its July 31st, 2021 ward congresses."
  },
  {
    "headline": "FG summons Indonesian envoy over diplomat’s arrest, harassment",
    "summarized_story": "The Federal Government has summoned the Indonesian Ambassador to Nigeria, Usra Harahap, over the manhandling and arrest of a Nigerian diplomat in Jakarta, Indonesia.\nThe unnamed diplomat was reportedly arrested in front of his official quarters on Saturday.\nThe Minister of foreign affairs, Geoffrey Onyeama, confirmed this at a press briefing on Tuesday.\nThe Ministry of Foreign Affairs had in a statement on Monday, said it has also sent an official protest to the Government of Indonesia."
  },
  {
    "headline": "Strike: House Sub-Committee begins sitting on implementation of NARD demands",
    "summarized_story": "The House of Representatives’ Sub committee set up to work out modalities for the implementation of the demands of striking Resident doctors has begun sitting in Abuja.\nThe House of Representatives had on Monday met with the striking members of the National Association of Resident Doctors over to resolve the disagreement between the doctors and federal government.\nThe resident doctors had last week Monday declared indefinite strike over what it called federal government’s failure to honour its agreement.\nThe Resident doctors are demanding the payment of over N5 5 billion arrears of salaries, a reversal of alleged casualisation of doctors and immediate migration of their salaries from the Government Integrated Financial and Management Information System, GIFMIS, to the Integrated Payroll and Personnel Information System, IPPIS."
  },
  {
    "headline": "Who Leads Nigeria?: Okey Ikechukwu Dissects Contenders’ Prospects – Arise News",
    "summarized_story": "Last week’s exclusive interview on ARISE Morning Show with former military President General Ibrahim Badamasi Babangida, popularly called (IBB), has opened a new dimension to the 2023 presidential election debate on who will succeed Muhammadu Buhari in Aso rock.\nAccording to the general, such persons should have deep knowledge of the economy, must have contacts across the nation and must have been traversing the geo-political zones, marketing their acceptability and capacity.\nAnd that such individuals should be in their 60s as potential presidential or vice presidential candidates in 2023.\nPolitical analyst Dr Okey Ikechukwu dissects the chances of the likely Contenders.\nWatch the interview for more…"
  },
  {
    "headline": "Former SA President Zuma Corruption Trial Postponed to September 9",
    "summarized_story": "A South African court has again postponed a long-delayed corruption trial against jailed former president Jacob Zuma to September 9 following his hospitalisation last week for an undisclosed medical condition.\nHe also ordered the state to appoint a medical doctor of its choice to assess whether Zuma was fit to stand trial and give evidence.\nZuma’s lawyer Dali Mpofu said his client’s medical condition was a matter of confidentiality.\nZuma, 79, last month asked the Constitutional Court to annul his jail sentence, partly on the grounds that he was suffering from an unspecified medical condition.\nIn the dock with French arms firm Thales (TCFP.PA), Zuma is facing 18 charges including corruption and money laundering and has pleaded not guilty to all the charges."
  },
  {
    "headline": "Nas’ New Album ‘King’s Disease II’ No 1 on US Charts",
    "summarized_story": "Shortly after it’s launch, Nas’ new album, ‘King’s Disease II” has reached #1 on the all-genre US iTunes album sales chart.\nNas who won best rap album at 2021 Grammy awards sees this 14th studio album making an immediate impact on the chartsMeanwhile, Britney Spears’ father has said in a court filing that there are “no grounds whatsoever” for removing him from the conservatorship that controls her money and affairs.\nAccording to him, “he had dutifully and faithfully selected as the conservator of his daughters’ estate without any blemishes on the record.”Seyitan Atigarin Arise Entertainment correspondent tells us more.."
  },
  {
    "headline": "Trending: Nigeria Reacts Over Assault On Diplomat",
    "summarized_story": "The Ministry of Foreign Affairs has condemned the assault of a Nigerian diplomat by immigration officials in Jakarta, Indonesia.\nThe ministry in a press statement, noted that the Nigerian Government has complained strongly to the Government of Indonesia, and the Ambassador of Indonesia to Nigeria has been summoned by the Honourable Minister of Foreign Affairs."
  },
  {
    "headline": "Tokyo 2020: Nigeria Sports Minister Takes Responsibility for Athletes’ Anti-doping Violations – Arise News",
    "summarized_story": "Nigeria’s Minister of Sports, Sunday Dare, has apologised for the embarrassment the West African country suffered at the Tokyo Olympics that saw 10 of its athletes disqualified and one of its finalists washing his own jersey.\n“First is the mishap resulting in 10 Team Nigeria athletes being ruled ineligible to compete for missing their mandatory Out of Competition Test, OTC.\n“When notice of this ruling got to me, I immediately mobilized my team and the AFN leadership to see how the situation could be salvaged.\nWe mounted a vigorous appeal process with Athletics Integrity Unit, AIU and had the team members complete the tests.\nThe AFN has also taken responsibility and apologized to the athletes and to Nigerians.”By Abel Ejikeme"
  }
]