[
  {
    "headline": "Why men suffer erectile dysfunction, low sex drive as they age –Experts",
    "summarized_story": "The experts noted that these challenges usually lead to a lack of sex drive and erectile dysfunction.\nErectile dysfunction is the inability to attain or maintain penile erection sufficient for satisfactory sexual intercourse.\nThe study noted that the median prevalence of erectile dysfunction was calculated as 33 percent among all males greater than or equal to 40 years of age.\n“Any medication that will alter the hormones in the body can affect sexual function.\n“It is advisable to discuss with your doctor if you notice a decline in your erectile function after starting a new medicine,” he said."
  },
  {
    "headline": "Why men suffer erectile dysfunction, low sex drive as they age –Experts",
    "summarized_story": "The experts noted that these challenges usually lead to a lack of sex drive and erectile dysfunction.\nErectile dysfunction is the inability to attain or maintain penile erection sufficient for satisfactory sexual intercourse.\nThe study noted that the median prevalence of erectile dysfunction was calculated as 33 percent among all males greater than or equal to 40 years of age.\n“Any medication that will alter the hormones in the body can affect sexual function.\n“It is advisable to discuss with your doctor if you notice a decline in your erectile function after starting a new medicine,” he said."
  },
  {
    "headline": "Nutritious feeding impossible in Nigeria with N30,000 minimum wage, study says",
    "summarized_story": "Alfred OlufemiA Nigerian earning the Federal Government-approved minimum wage of N30,000 monthly cannot afford basic nutritious food that the body needs, says a recent study from Picodi, an international e-commerce company.\nAccording to the study, monthly consumption of milk, bread, vegetables, rice, eggs, fruits and other basic food products by an adult will cost ₦40,980.\nPicodi stated that its analysts also checked how the minimum wage rates have changed in 64 countries and whether such amounts can ensure a minimum standard of living in a given country.\n“The study covered countries with a government-set minimum wage—a total of 64 countries in Europe, North and South America, Africa, Asia and Australia.\nAdekeye, however, noted that it may be different for people living in villages where these basic food products can be sourced."
  },
  {
    "headline": "Nutritious feeding impossible in Nigeria with N30,000 minimum wage, study says",
    "summarized_story": "Alfred OlufemiA Nigerian earning the Federal Government-approved minimum wage of N30,000 monthly cannot afford basic nutritious food that the body needs, says a recent study from Picodi, an international e-commerce company.\nAccording to the study, monthly consumption of milk, bread, vegetables, rice, eggs, fruits and other basic food products by an adult will cost ₦40,980.\nPicodi stated that its analysts also checked how the minimum wage rates have changed in 64 countries and whether such amounts can ensure a minimum standard of living in a given country.\n“The study covered countries with a government-set minimum wage—a total of 64 countries in Europe, North and South America, Africa, Asia and Australia.\nAdekeye, however, noted that it may be different for people living in villages where these basic food products can be sourced."
  },
  {
    "headline": "Enugu Monarchs pledge mobilisation of youths for police recruitment",
    "summarized_story": "By Dennis AgboTraditional Rulers in Enugu state have pledged to mobilize its young subjects for recruitment into the Nigeria Police Force.\nTheir pledge followed an outcry by the Nigerian Police Service Commission, PSC, that the southeast geopolitical zone records a shortfall in police personnel.\nChairman of Enugu state Traditional Rulers’ Council, HRH Igwe Lawrence Agubuzu made the pledge when the PSC engaged leaders, government officials, traditional rulers and Town Union leaders in a sensitization/town hall forum to find a common solution to the problem.\n“It is important that we as traditional rulers closer to the people should explain to our youths that we need to be recruited into this job,” Agubuzu said.\nGovernor Ifeanyi Ugwuanyi of Enugu state who was represented by the Secretary to the state government, Prof. Simon Ortunanya urged Enugu state youths to join the police for it’s importance in combating crimes."
  },
  {
    "headline": "Undisclosed loans spending, crippling debts: SERAP takes FG to ECOWAS court",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has sued President Muhammadu Buhari-led Federal Government before ECOWAS Court over “secrecy in the spending of loans so far obtained, the unsustainable level of borrowing by the government and the 36 states, the crippling debt burden.\nSERAP is also seeking an order directing and compelling the Federal Government to publish details of spending of the loans obtained by governments since 1999, including the list of projects and locations of any such projects on which these loans have been spent.\nThe details of the projects on which the loans are spent are shrouded in secrecy.\n“This followed previous approvals by the National Assembly of $16.2 (16,230,077,718) billion loan; €1 (1,020,000,000) million and a grant component of $125 million loan; $36.8 billion, €910 million loans, and a grant component of $10 million; $8.3 billion and €490 million loans; $6.1 billion, $1.5 billion and 995 million loans; and $4(4,054,476,863), €710 million and grant component of $125 million.”Meanwhile, no date has been fixed for the hearing of the suit.\nVanguard News Nigeria"
  },
  {
    "headline": "I fulfilled Soun’s wish over ownership of LAUTECH —Makinde",
    "summarized_story": "By Adeola Badru – OgbomosoGovernor ‘Seyi Makinde of Oyo State, Sunday, said that he was happy he fulfilled the singular wish of the late Soun of Ogbomoso, Oba Jimoh Oyewumi Ajagungbade III, to ensure the sole ownership of the Ladoke Akintola University of Technology, LAUTECH, for the state, before the monarch joined his ancestors.\nThe governor said the late Soun asked him for only one thing when he visited the palace, ahead of the 2019 election.\nAccording to Governor Makinde, Oba Oyewumi told him that his only wish was to have LAUTECH solely owned by Oyo State.\nHe said: “This is a thanksgiving service in honour of our father, late Soun of Ogbomosoland, Oba Oladunni Oyewunmi Ajagungbade 111.\nDr. Victor Oyelowo, maintained that the late Soun laboured for Ogbomoso people and the church."
  },
  {
    "headline": "1999 Constitution: Amendment bill ready February — Lawmakers",
    "summarized_story": "By Adeola Badru – IbadanSome members of the National Assembly have disclosed that they have not stopped work on the process of amending the 1999 Constitution, assuring Nigerians that the amended document would be ready before the end of the Ninth National Assembly.\nSalami said: “The constitution will be amended before the end of this Ninth National Assembly.\nPeople sent in memoranda from everywhere and there were submissions made by members of the National Assembly themselves to amend certain aspects of the constitution.\nAs a member of the National Assembly today, the police in my constituency still write letters to me to come and repair their vehicles.\nThe amended constitution would be transmitted to the President before the end of February.”The town hall meeting was organised by Daria Media and supported by MacArthur FoundationVanguard News Nigeria"
  },
  {
    "headline": "Mercy Aigbe marries ex husband’s friend",
    "summarized_story": "By Ayo OnikoyiTop Nollywood actress, Mercy Aigbe has remarried after 4 years of separation from her former husband, Otunba Lanre Gentry.\nInterestingly, the former husband, Lanre Gentry also remarried last year in September.\nUnlike his former wife’s marriage, Lanre Genre made a meal of his on social media.\nLanre and Mercy parted ways after a 7-year tumultuous union, oftentimes leading to violence and public dramas.\nWhile Mercy accused Lanre of domestic violence, Lanre accused the actress of infidelity."
  },
  {
    "headline": "BREAKING: Coup wave enters 2022 as soldiers arrest Burkina Faso President",
    "summarized_story": "On Monday, mutinous soldiers declared that his government failed to support them during a deadly insurgency.\nKabore is reportedly being held at a military camp while major locations are witnessing an increased number of military personnel.\nThe situation means the coup wave in Africa, which started in 2020, has spilt into 2022.\nIn September 2021, elite soldiers in Guinea, led by Col Mamady Doumbouya, ousted President Alpha Conde.\nSudan went through a coup in October 2021 after an initial failed attempt."
  },
  {
    "headline": "BREAKING: JAMB announces date for 2022 UTME, DE registration",
    "summarized_story": "The Joint Admissions and Matriculation Board, JAMB has revealed the date for the commencement of the 2022 Unified Tertiary Matriculation Examination as well as the Direct Entry examination, DE registration.\nJAMB’s Director of Public Relations, Dr Fabian Benjamin, who made the announcement on Monday, said the registration exercise would commence in February 2022.\nThe Board in its weekly bulletin forwarded to DAIlY POST said the UTME/DE registration would commence on February 12, 2022, and end on March 19.\nIn a letter addressed to JAMB titled: “Restitution on my JAMB Result 21 Years Ago” the repentant Nigerian blamed youthful exuberance for his misconduct.\nThe Board, in its reply to Mr. Kemepade, said the apology and consequent admission of guilt are “rejected in its entirety and are, therefore, not admissible.”"
  },
  {
    "headline": "‘I’m barred from seeing Buhari, they’re deceiving us with 419 rice pyramid’ – Ortom",
    "summarized_story": "Governor Samuel Ortom of Benue State, has disclosed that he was barred from having access to President Muhammadu Buhari.\nOrtom said he was barred from having access to Buhari due to his constant criticism of the current administration’s bad policies.\nSpeaking at the state’s Government House in Makurdi, Benue State, the governor lamented that Buhari’s policies are bad.\nThe governor also described Buhari’s administration as that of “419.”He described the rice pyramid in Abuja as “419,” used to deceive Nigerians.\n“All those 419 rice pyramids will not help Nigeria."
  },
  {
    "headline": "How pastor who predicted my governorship in 1992 rejected car gift from me – Ortom",
    "summarized_story": "Governor Samuel Ortom of Benue State has recounted how Rev Samuel Alaha, who anointed him in 1992 with a prophecy that he would become governor of the state, rejected a car gift from him after the prophecy came to pass in 2015.\nThe governor, who made the disclosure Sunday during a sermon as the guest preacher at Faithway Gospel Ministries, Gboko, explained that he visited the cleric and presented the new car in appreciation but the vehicle was returned after a few days.\nAccording to Ortom, even though Rev Alaha received the gift on the spot, he called after a few days to inform the governor that he appreciated the offer but begged to return it, saying he did not find it necessary.\nGovernor Ortom described the clergyman as a committed and true man of God whom he had known since 1980, lauding his zeal and commitment in service to the almighty God.\nOrtom pointed out that as Governor, he is determined to execute God’s counsel to people of the state at all times."
  },
  {
    "headline": "Bandits still killing people in Zamfara – Musa Ahmad counters Gov Matawalle",
    "summarized_story": "An analyst, Alhaji Musa Ahmad, has countered the Zamfara State Government for claiming to have upper hands over bandits bedeviling the state.\nAhmad said the government is making such a claim when innocent people are being killed by terrorists on a daily basis.\n“Recently, Governor Bello Mohammed Matawalle told the whole world that banditry would not end soon in Zamfara State.\n“They are treating the security of lives and property of common masses with a mere wave of hand because they have provided adequate security for themselves.\n“Governor Matawalle does not even want newsmen in his state to report the everyday killings in Zamfara."
  },
  {
    "headline": "Suspected kidnappers kill businessman in Ondo",
    "summarized_story": "Gunmen suspected to be kidnappers have shot dead a businessman in Okeluse community, Ose local government area of Ondo State.\nThe deceased businessman, MrAborowa Oladimeji but known as ‘Popular’ owned the Popular Petrol station in Okeluse.\nSources said the gunmen stormed the petrol station around 9 pm on Sunday and opened fire on the deceased.\nOndo Police spokesman, DSP Fumilayo Odunlami, said the killing was suspected to be a case of failed kidnapping.\nOdunlami said the sales boy was not dead as being speculated."
  },
  {
    "headline": "Angry youths raze Kano school over murder of five-year-old Hanifa",
    "summarized_story": "Angry youths have razed a private school in Kano over the murder of five-year-old pupil, Hanifa Abubakar.\nThe private school, Noble Kids Comprehensive College, is located at Kwanar Dakata in Nassarawa local government area, in Kano metropolis.\nThe Nation reported last week that the school was closed by the State Government.\nIn the now-viral video seen by The Nation, angry youths of the community mobilsed in full force to burn down the school.\nThe proprietor of the school Abdulmalik Tanko confessed to the police he used a N100 rat poison kill Hanifa and buried her “in a shallow grave within the private school premises.”According to him, the school has two branches and the first — where Hanifa was buried — was opened in 2017."
  },
  {
    "headline": "JAMB: 2022 UTME, DE registration commences February 12",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) on Monday announced that registration for the 2022 Unified Tertiary Matriculation Examination and the Direct Entry examination will begin on February 12.\nThe board made this known in its weekly bulletin released by its Head of Media and Protocol, Dr. Fabian Benjamin on Monday.\nIn the timeline of events attached to the bulletin, the board said: “UTME/ DE registration starts 12th February 2022 and ends 19th March 2022.\nMock examination holds on 20th April, 2022.\nUTME holds from 20th to 30th April 2022.”"
  },
  {
    "headline": "NAFDAC bans sachet alcohol drinks, others",
    "summarized_story": "To curb the abuse of alcohol across the country, the National Agency for Food and Drug Administration and Control (NAFDAC) has placed a ban on the registration of alcohol in sachet and small volume PET and Glass bottles below 200ml, amidst other stringent regulatory measures.\nThe Director-General of NAFDAC, Prof. Mojisola Adeyeye, who dropped the hint in Abuja, explained that the registration of new alcoholic drinks in Sachet and Small volume PET and Glass bottles above 30 per cent ABV (alcohol by volume) has been banned.\nShe further stated that the Agency will ensure that validity of renewal of already registered alcoholic products in the affected category will not exceed the year 2024.\n- Advertisement -Adeyeye explained that Manufacturers of low volume alcohol beverages (200ml) with satisfactory laboratory reports, which were already submitted to NAFDAC for registration before this decision, have been directed to reformulate their products to stipulated standards free of charge.\nShe explained that the Producers of Alcohol in Sachets and Small volume agreed to reduce production by 50 per cent with effect from January 31, 2020, while ensuring the products are completely phased out in the country by 31st January 2024."
  },
  {
    "headline": "Eguavoen returns to technical director position",
    "summarized_story": "Super Eagles head coach Augustine Eguavoen has revealed that he will return to his position as the technical director of the Nigeria Football Federation (NFF).\nEguavoen stated this following the Super Eagles exit at 2021 Africa Cup of Nation in Cameroon.\n- Advertisement -Msakni beat Super Eagles keeper Maduka Okoye with a long-range effort two minutes into the second half and the goal was to prove decisive.\nEguavoen, who won bronze medal as Eagles coach in 2006 in Tunisia, said he will allow the federation to make final decision on the way forward after AFCON exit.\n“What happens next is that; I’m the interim coach and Technical Director of the NFF, I will go back to my position and allow the Federation make a decision on the way forward,” Eguavoen said."
  },
  {
    "headline": "Ebonyi community boils over Ebubeagu killings",
    "summarized_story": "..As army takes over community to restore calmFrom Chijioke Agwu AbakalikiThere was tension yesterday in Akaeze community in Ivo local government area of Ebonyi State following the alleged killing of a youth in the area by suspected members of Ebubeagu Security operatives.\nDaily Sun gathered that the victim, Nnaogo Akpoke Anyim,was accused by Ebubeagu members in the area of stealing some bamboo tree from the community.\nHe was subsequently arrested and tortured to death by members of the Ebubeagu operatives.\nIt was also gathered that a filling station belonging to Chief Onyebuchi Ogbadu,and houses belonging to some Ebubeagu members in the community were torched, among other properties.\nA source in the area told our correspondent that “Ebubeagu operatives killed a youth in the area."
  },
  {
    "headline": "Electoral Bill battle hots up in NASS",
    "summarized_story": "From Fred Itua and Ndubuisi Orji, AbujaA fresh face-off is brewing between the leadership of the Senate and the House of Representatives over the inability to pass a unified version of the recommitted Electoral Amendment Bill.\nThe president, had while rejecting the bill, told lawmakers that the exclusion of indirect primary mode for political parties from the Electoral Act was anti-democratic and a recipe for crisis.\nSenate Leader, Yahaya Abdullahi is expected to head the conference committee while his counterpart in the House would deputise.\nHe said the ninth Assembly was committed to giving the country a new electoral law ahead of the next general elections.\nHe said the Green chamber on resumption of plenary this week would constitute its conference committee to interface with the senate on the electoral bill."
  },
  {
    "headline": "Confusion, anxiety trail planned subsidy removal",
    "summarized_story": "President Muhammadu Buhari had in August 2021 signed the Petroleum Industry Bill into law, signaling an end to petrol subsidy.\nBut in what looks like a dramatic twist, the Senate President, Mr. Ahmed Lawan, had last week during a meeting with Buhari, said the President has not authorised the removal of fuel subsidy.\nOn his part, former Head of State, Abdulsalami Abubakar, has warned against removing fuel subsidy, saying the decision will push more Nigerians into poverty.\nProffering ways to ensure a rancor-free subsidy removal, its Chairman, Taiwo Adeniyi, said: “The controversy being generated by fuel subsidy is getting to a crescendo and it will be important to guide government and other stakeholders.\n“While there are proponents and opponents of the fuel subsidy regime, three things are indisputable: the fuel-subsidy regime seems fraught with corruption, with few petroleum importers benefiting."
  },
  {
    "headline": "N1.3trn NPLs, recovery hurdles hurt banks’ operations",
    "summarized_story": "And out of N1.23 trillion NPLs recorded by banks at the end of 2020, the National Bureau of Statistics (NBS) recently disclosed that the NPLs in the power sector stood at N33.22 billion.\nFor instance, Union Bank recorded marginal increase in its NPLs ratio during the period, while Wema recorded significant drop in its NPL ratio.\nWema’s NPLs closed H1 2021 at 3.5 per cent from 5.6 per cent in H1 2020 just as Sterling Bank’s NPLs declined from 1.9 per cent in H1 2020 to 1.79 per cent in H1 2021.\nFurther analysis showed a 13.4 per cent increase in FCMB Group NPLs to N3.78 billion in H1 2021 from N2.55 billion, dragging the financial institution NPLs by value to N32.21 billion in H1 2021 from N29.77 billion recorded in H1 2020.\nAnalysts attributed banks decline in some bank’s NPLs to ease of COVID-19 lockdown, effective management of credit risk and reduction of risk to some sectors."
  },
  {
    "headline": "Baby Hanifa: Kalu expresses sadness, says culprits must face the law",
    "summarized_story": "Chief Whip of the senate, Dr. Orji Uzor Kalu, has condoled with the family of kidnapped and murdered five-year-old Kano State schoolgirl, Hanifa Abubakar.\n“This is an inhuman and barbaric act, I cannot contemplate how a sane person would separate a little girl from her parents and subsequently kill her.\nSenator Kalu prayed for the repose of the soul of the schoolgirl and urged her parents to bear the loss with courage and fortitude in God.\nThe police in Kano had arrested two suspects, Abdulmalik Mohammed and Hashim Isyaku, over the abduction and killing of Abubakar.\nShe was buried in a shallow grave and her remains were discovered at a private school premises in Kwanar ‘Yan Gana, Tudun Murtala Quarters, Nassarawa LGA, Kano State."
  },
  {
    "headline": "With Global Stocks in Red, Nigerian Market Gains N2.46trn in Three Weeks",
    "summarized_story": "The stock market in the first trading week kicked off on a strong note, gaining N1.33 trillion in market capitalisation.\nIn the second trading week, market capitalisation gained N323 billion week-on-week to close at N23.951 trillion from the N23.628 trillion it had opened for trading.\nMarket analysts attributed the strong rally in the market to improvement in the economy, boost in liquidity, as well as investors’ renewed interest in the stock market.\nIt was investors bargain hunting in BUA Foods, Dangote Cement, Guinness Nigeria, and International Breweries, which drove the weekly gains.\nSome of those funds are now being invested in the stock market, a major reason we are witnessing appreciation in market performance."
  },
  {
    "headline": "With New Portal, CBN Moves to Halt Over-invoicing By Importers",
    "summarized_story": "The apex bank pointed out that the new regulation aims to achieve accurate value from import and export items in and out of the country.\nThrough over-invoicing, unscrupulous importers are able to illegally wire monies out of the country and ship them abroad.\nIf that price that is being keyed into the portal is not more than 2.5 per cent above the globally acceptable price, the Form M is approved.\nExemptions were also granted to import and export transactions made by all security agencies in the country.\nThe circular added that fees, where relevant, shall be advised from time to time as the system progresses."
  },
  {
    "headline": "Dangote Oil Refinery to Begin Production before Q3, 2022",
    "summarized_story": "Dangote disclosed this at the weekend in Lagos during a facility tour of the oil refinery, the fertiliser plant, and the Dangote Jetty, in the company of President, African Development Bank (AfDB), Dr. Akinwumi Adesina.\nDangote said full production at the refinery could commence by the end of the year or the beginning of 2023.\nEdwin stated that the 650,000 barrels per day refinery would stimulate economic development in Nigeria.\nIn his remarks, the AfDB president described Dangote Refinery and Fertiliser projects as the best industrialised project to happen to Africa.\nThe Nigerian cement tycoon is set to boost his wealth by completing a $19 billion refinery project scheduled to start operations later this year."
  },
  {
    "headline": "Nothing will Bring Me Back to Partisan Politics, Obasanjo Tells PDP Leaders",
    "summarized_story": "*Buhari’s administration clueless, piling eternal debts, says AyuJames SowoleFormer President Olusegun Obasanjo yesterday restated his vow not to return to partisan politics.\nObasanjo, 84, made this known when a delegation of the leaders of the Peoples Democratic Party (PDP) led by the National Chairman of the party, Dr. Iyorchia Ayu, visited him at his residence in Abeokuta, Ogun State.\nHowever, after the closed-door meeting, Obasanjo publicly told his guests to bear in mind that he was no longer in partisan politics.\nWhatever I do in my own life, because I became president on the platform of PDP, PDP will continue to be part of the history of my life.\n“Even though you retired from partisan politics, partisan politics will never retire from your blood, because you want the right thing done and since you want the right thing done, for the life you will remain the emeritus member of the PDP."
  },
  {
    "headline": "2023: INEC Warns Political Parties, Aspirants against Early Campaigns",
    "summarized_story": "“Political parties are aware that based on the existing law, the period for campaigning in public has not matured and has not come into force.\nThe INEC commissioner reminded the political parties that the timetable and schedule of activities for the 2023 general election have not been released by the commission.\n“Furthermore, Section 99 of the Electoral Act, 2010 (as amended) prescribes and circumscribes the period of campaigning in public by political parties.\nBased on the existing law, campaigns in public shall commence 90 days before polling day and end 24 hours before that date.\n“However, section 99 of the Act recognises that political parties are not the only operators in the electoral process."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "SPOTTED: In revised electoral bill, only aspirants can challenge credentials of candidates",
    "summarized_story": "The revised electoral act amendment bill has barred voters from challenging the credentials of the candidate of any political party.\nThe provision is contained in the revised bill that was passed by the two chambers of the national assembly last week.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nAdvertisementThe national assembly deleted the clause afterwards.\nIn the revised harmonised bill, TheCable also observed that the national assembly removed the consensus mode of selecting candidates as passed by the senate."
  },
  {
    "headline": "SPOTTED: In revised electoral bill, only aspirants can challenge credentials of candidates",
    "summarized_story": "The revised electoral act amendment bill has barred voters from challenging the credentials of the candidate of any political party.\nThe provision is contained in the revised bill that was passed by the two chambers of the national assembly last week.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nAdvertisementThe national assembly deleted the clause afterwards.\nIn the revised harmonised bill, TheCable also observed that the national assembly removed the consensus mode of selecting candidates as passed by the senate."
  },
  {
    "headline": "Report: Burkina Faso president detained by soldiers amid coup plot",
    "summarized_story": "President Roch Kabore of Burkina Faso has reportedly been detained by mutinying soldiers.\nThe mutinying soldiers were also said to have also surrounded the state television headquarters.\nHeavy gunfire was reportedly heard on Sunday night near the presidential palace and at several barracks in Ouagadougou, the country’s capital.\nAdvertisementBut the government denied the rumour that a coup was underway and that the president had been arrested.\nBathelemy Simpore, the country’s defence minister, denied the rumour that Kabore had been detained."
  },
  {
    "headline": "Report: Burkina Faso president detained by soldiers amid coup plot",
    "summarized_story": "President Roch Kabore of Burkina Faso has reportedly been detained by mutinying soldiers.\nThe mutinying soldiers were also said to have also surrounded the state television headquarters.\nHeavy gunfire was reportedly heard on Sunday night near the presidential palace and at several barracks in Ouagadougou, the country’s capital.\nAdvertisementBut the government denied the rumour that a coup was underway and that the president had been arrested.\nBathelemy Simpore, the country’s defence minister, denied the rumour that Kabore had been detained."
  },
  {
    "headline": "Two killed as gunmen attack Ondo community",
    "summarized_story": "Gunmen suspected to be herders on Sunday attacked Okeluse community in Ose local government area of Ondo state.\nAborowa Oladimeji, the manager of a fuelling station in the town, was reportedly killed in the attack.\nAdvertisementOne of his staff whose name was not disclosed was also killed by the gunmen.\n“For the CEO of the filling station, he he was shot and he died on the spot.\nHe was about leaving the filling station with his sales boy when the gunmen came.”AdvertisementThe attack is coming a few weeks after five persons were killed at Arimogija community in Ose LGA."
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build 2021 was 🔥🔥🔥",
    "summarized_story": "Share this article:Hi there,This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nSome Techpoint Build 2021 nuggets for youLet’s begin with the keynote speaker: This year’s keynote speaker for Techpoint Build was Adia Sowho, MTN Nigeria’s CMO.\nWith seven semi-finalists pitching at Techpoint Build 2021, Ghanaian company, WorldTech Consult emerged the winner, carting home $10,000.\nTo crown Techpoint Build 2021 activities, Techpoint Awards 2021 was held on Sunday, January 23, 2022, recognising some of the startups pushing boundaries in the ecosystem.\nIt’s a wrap: I thoroughly enjoyed Techpoint Build 2021 — first time at a Build event — and if you attended the event, I’m sure you did too."
  },
  {
    "headline": "Meet the winners of Techpoint Awards 2021",
    "summarized_story": "Share this article:As part of Techpoint Build 2021, we put out a call, asking the public to nominate outstanding startups in various categories.\nAfter a keenly contested affair, the winners of the Techpoint Awards were announced today during a dinner.\nMost Outstanding Mobility & Logistics Company 2021Mobility and logistics are essential for the movement of goods and humans.\nWinner: FlutterwaveFlutterwave caps off an eventful year as winners, following it up with their unicorn milestone achieved in 2021.\nEditorial Choice AwardsHaving covered startup activities over the last seven years, Techpoint Africa’s editorial team picked the winners in this category."
  },
  {
    "headline": "Ghana’s Worldtech Consult wins Techpoint Build 2021 Pitchstorm 3.0, receives $10,000 prize",
    "summarized_story": "Share this article:Today, January 22, 2022, Techpoint Build 2021 ended in grand style with the Pitchstorm 3.0 winner announcement.\nPitchstorm 3.0 FinalistsThe Ghanaian-founded agritech startup, Worldtech Consult successfully made it through three elimination stages to win a $10,000 non-equity fund, the third winner since the competition started in 2018.\nWorldtech Consult, Pitchstorm 3.0 winnerForcardio and Ugandan-founded Dokitar, that emerged runners-up in the health category also went home with ₦1 million and ₦2 million courtesy 54gene, one of the sponsors of Techpoint Build 2021.\nFollowing a call for exciting tech innovations across West Africa, this edition of Pitchstorm received 149 entries.\nPitchstorm is Techpoint Africa’s annual startup competition, where we learn about new and exciting solutions to Africa’s problems while rewarding the solution providers for their innovative ideas."
  },
  {
    "headline": "Nigeria’s small businesses in unending battle against dollar shortages",
    "summarized_story": "Nigeria’s small businesses are locked in a survival battle against a foreign exchange crisis that is forcing them to adapt or die trying.\nThis group of businesses has significantly contributed to economic growth through job creation, revenue generation, economic diversification, etc.\nOne major problem that stresses transactions for these businesses is the payment system which stacks the odds against them.\nHow businesses managed paymentsFacing different policies that threatened to stifle business operations, MSMEs devised means to solve the payment system challenges.\nShipping costAfter successfully paying for products, businesses also have to work around shipping costs, shipping delays, and tracking items."
  },
  {
    "headline": "Nigeria’s small businesses in unending battle against dollar shortages",
    "summarized_story": "Nigeria’s small businesses are locked in a survival battle against a foreign exchange crisis that is forcing them to adapt or die trying.\nThis group of businesses has significantly contributed to economic growth through job creation, revenue generation, economic diversification, etc.\nOne major problem that stresses transactions for these businesses is the payment system which stacks the odds against them.\nHow businesses managed paymentsFacing different policies that threatened to stifle business operations, MSMEs devised means to solve the payment system challenges.\nShipping costAfter successfully paying for products, businesses also have to work around shipping costs, shipping delays, and tracking items."
  },
  {
    "headline": "How failure to optimise informal businesses is costing economy",
    "summarized_story": "The failure of the government to formalise the operations of over 34 million informal Micro, Small, and Medium Enterprises (MSMEs) in Nigeria has continued to minimise the potential of the nation’s economy.\nThe contribution of MSMEs to the Nigerian economy cannot be over-emphasized and therefore regarded as the bedrock of the economy.\nIn Nigeria, MSMEs contributed 46.31 percent of the national GDP and also accounted for 6.21 percent of gross exports.\nChukwu believes that offering incentives to small business owners could go a long way in encouraging formalisation of their operations.\n“An increasing tax burden and rising state regulatory activities are the major driving forces determining the size and growth of the informal economy."
  },
  {
    "headline": "Obaseki to swear-in new Perm Secs Tuesday – Nigerian Observer",
    "summarized_story": "Obaseki to swear-in new Perm Secs TuesdayShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki will, on Tuesday, January 25, 2022, swear-in the newly appointed Permanent Secretaries.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the swearing-in will hold at the New Festival Hall in Government House, Benin City, the state capital.\nThe newly appointed Permanent Secretaries include: Peter Aikhoumobhogbe; Iserhienhien Edamwen Efe; Grace Osaro Aihie; Osaro Washington Abbe; Bose J. Igbinobaro; Anelu Julius Osemen; Asemota Osagie Uyi and Gilbert Egwakhide.\nOthers are Asibor Omokhegbele Lucky; Felicia Edwards; Ifueko Alufokhai; Osikhena Omo Ojior and Toritseju Onaiwu."
  },
  {
    "headline": "Edo vigilante rescues 28 victims of human trafficking in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CIY – A team of local vigilantes in Benin City, the Edo State capital, has rescued 28 victims of human trafficking.\nThe State coordinator, Edo State Community Vigilante Security Network, Oboh Emmanuel Otoide, disclosed this while addressing journalists at the weekend in Benin City.\nAccording to him, “The victims were rescued by our men around 2 a.m on Tuesday along Akpakpava Road in Benin City.\nAmong the items recovered from the suspects include ATM cards belonging to victims of his criminal acts.”He said the Edo State Community Vigilante Security Network is working assiduously with other security agencies in the state to secure the state.\nThe coordinator urged residents to report criminal activities to Edo State Community Vigilante Security Network Central Base Control Room through 09153333340 or 09153333341."
  },
  {
    "headline": "250 Solar streetlights: Abudu community commends group – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – Residents of Abudu, administrative headquarters of Orhionmwon local government area of Edo state have expressed appreciation to members of Abudu in Diaspora Group for the installation of 250 solar streetlights in the community.\nAccording to the residents, the solar street lighting is a delight to them as it would enhance night life and boost socioeconomic activities in the community, which has been without power for more than four years.\nThe Odionwere (Head) of the community, Pa Mathew Ehioghae commended the group for the project, saying, “they are on the right part”.\nA resident, Victor Agada however enjoined the donors to ensure the solar streetlights are maintained regularly to stand the test time.\nThe diaspora group is a nonprofit and apolitical association of Abudu indigenes residing in different parts of the world, with the aim to give back to their community."
  },
  {
    "headline": "Herdsmen: Normalcy returns to Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – There was chaos at Abudu, administrative headquarters of Orhionmwon local government area of Edo State on Friday morning, following the killing of a young man on Thursday in the community by suspected herders.\nAn altercation had ensued between the suspected herders and some farmers inside a farming area where the herdsmen also have camps.\n“They (farmers) meet the Fulani people for road inside the bush wen dem wan go find their dog; na dem begin challenge dem (Fulani) to comot for road.\nIt took the police at Abudu divisional headquarters and elders of the community hectic time to calm the youths before normalcy was restored to the area.\nIt was learnt the suspected killer is being detain at the state police headquarters in Benin city."
  },
  {
    "headline": "Climate activist, Obasi rallies African youths to demand more commitment in effort against climate change",
    "summarized_story": "I believe it is important for people to begin to visualise the threat of climate change.\nThere needs to be collaboration, for instance, among ECOWAS countries, the southern African countries, the Central African states, the East African countries and so on.\nThe developed world must help fund the fight against climate change in the developing world also because we do not have the resources in this part of the world to effectively deal with effects of climate change.\nIndeed, during the recently concluded climate change events held in Glasgow, the climate pact to deliver $100 billion dollars a year to African countries most affected by climate change was finalized.\nSo, it is easy for some individuals there to deny the impact of climate change, or to deny the existence of climate change, like the past president of the United States."
  },
  {
    "headline": "Osinbajo appeals to world leaders to fulfill $100b climate change pledge",
    "summarized_story": "He stated that we need partnerships that help to tackle climate change, address security concerns, promote economic prosperity, combat disease, and improve governance.\nIn addition to climate finance, the Vice President called for a partnership to tackle poverty, access vaccinations, and achieve debt sustainability.\nRight now, less than 10% of African countries have vaccinated 40% of their population.\n“The international community must accordingly support Africa with the resources including vaccine doses that will assist in making vaccinations available to all,” Prof. Osinbajo emphasized.\nAnother point made by the VP in his special address is the call on the international community to support African countries overcome fiscal challenges arising from their limited revenues."
  },
  {
    "headline": "‘I’m proud of you’ – Adesina expresses delight as Dangote Refinery nears completion",
    "summarized_story": "OBINNA EZUGWUPresident of Africa Development Bank, Mr. Akinwunmi Adesina, has praised the chairman of the Dangote Group, Alhaji Aliko Dangote for his commitment to the completion of the Dangote Refinery at Lekki Free Trade Zone, Lagos.\nAdesina who visited the $16 billion refinery billed to come on stream in the third quarter of the year, with Alhaji Dangote at the weekend, took to Twitter to note that its realisation is shows that Africa has the capacity to industrialize.\n“I was very impressed with Dangote’s refinery and petrochemical industrial zone.\n“The largest single train refinery in the world.\nIt shows Africa’s power to industrialise."
  },
  {
    "headline": "Soldiers detain Burkina Faso President, Kabore amid coup fears",
    "summarized_story": "Mutinous soldiers have detained Burkina Faso President Roch Marc Christian Kabore following heavy gunfire around his residence on Sunday night in the capital Ouagadougou.\nResidents also reported they saw a helicopter above the the president’s home in the capital Ouagadougou.\nIt followed gunfire earlier Sunday at several army bases, prompting fears of yet another coup in a volatile West African country prone to military takeovers.\n“We want adequate resources for the battle” against Islamist extremists, a soldier from the Sangoule Lamizana base in Ouagadougou said in a voice recording received by AFP.\nThe disaffected soldiers also wanted top generals to be “replaced”, better care for wounded troops and more support for the families of soldiers killed in battle, the spokesman for the mutinous troops added in the anonymous recording"
  },
  {
    "headline": "Bayelsa Deputy Gov Tasks Lawyers On Integrity",
    "summarized_story": "Bayelsa State deputy governor, Lawrence Ewhrudjakpo, has counseled lawyers in the state to uphold integrity and fair play as watchwords in the legal practice, declaring that such virtue will guarantee them a place at the top of the legal profession.\nHe particularly charged the new executive of the Young Lawyers Forum to strive and make a difference by focusing on achieving the objectives of the Association, stressing that leadership at all levels requires a lot of sacrifice.\nADVERTISEMENTEwhrudjakpo, however, gave them the assurance that if they imbibe patience, humility, courage and determination as lawyers, they would surely make it in society.\nResponding to the forum’s request from the government to support the hosting of its South-South zonal conference billed for April this year in Yenagoa, the deputy governor promised to look into it, but advised them to review some of their programmes.\nEarlier in his presentation, the chairman of the Young Lawyers Forum, Yenagoa Branch, Mr Deinmobowei Abila, commended the deputy governor for his fatherly guidance and interest in the growth of the legal profession in the state."
  },
  {
    "headline": "PDP Stakeholders Renew Clamour For Cancellation Of Ekiti Ward Congress",
    "summarized_story": "Peoples Democratic Party (PDP) stakeholders in Ekiti State have continued to protest the conduct the party’s ward congresses ahead of its primaries to pick the governorship candidate for forthcoming election.\nThe latest protest held at the party’s national headquarters at Wadata House, Abuja was led by Hon.\nLanre Oni, Chief Eniola Eponlolaye and other Ekiti PDP stalwarts and party faithful.\nThey called for the cancellation of the controversial congress and urged the PDP National Working Committee (NWC) to use special delegates for the prosecution of the governorship primaries in the state.\nThey said the measure would provide a level playing ground for all parties to the disputes."
  },
  {
    "headline": "PDP Stakeholders Renew Clamour For Cancellation Of Ekiti Ward Congress",
    "summarized_story": "Peoples Democratic Party (PDP) stakeholders in Ekiti State have continued to protest the conduct the party’s ward congresses ahead of its primaries to pick the governorship candidate for forthcoming election.\nThe latest protest held at the party’s national headquarters at Wadata House, Abuja was led by Hon.\nLanre Oni, Chief Eniola Eponlolaye and other Ekiti PDP stalwarts and party faithful.\nThey called for the cancellation of the controversial congress and urged the PDP National Working Committee (NWC) to use special delegates for the prosecution of the governorship primaries in the state.\nThey said the measure would provide a level playing ground for all parties to the disputes."
  },
  {
    "headline": "Edo LGA Forum Tackles NULGE Over Attack On Obaseki",
    "summarized_story": "The group rather said Obaseki ingenuity had brought increase in the Internally Generated Revenue (IGR) and thus improved governance at the councils.\nContrary to Adorolo’s position that the councils were not involved in revenue sharing, the administrators maintained that they participate fully in the Pre-Joint Account Allocation Committee (JAAC) and the actual JAAC.\nHe said, “We have read the press statement made by the state President of NULGE and wish to state without equivocation that the statement was made in ignorance without knowing the workings of Government.\nADVERTISEMENT“At such meetings, there is always a robust debate before decisions are reached and the money distributed accordingly.\n“The state government does not introduce any extraneous factor in the sharing outside what is permitted by law."
  },
  {
    "headline": "Edo LGA Forum Tackles NULGE Over Attack On Obaseki",
    "summarized_story": "The group rather said Obaseki ingenuity had brought increase in the Internally Generated Revenue (IGR) and thus improved governance at the councils.\nContrary to Adorolo’s position that the councils were not involved in revenue sharing, the administrators maintained that they participate fully in the Pre-Joint Account Allocation Committee (JAAC) and the actual JAAC.\nHe said, “We have read the press statement made by the state President of NULGE and wish to state without equivocation that the statement was made in ignorance without knowing the workings of Government.\nADVERTISEMENT“At such meetings, there is always a robust debate before decisions are reached and the money distributed accordingly.\n“The state government does not introduce any extraneous factor in the sharing outside what is permitted by law."
  },
  {
    "headline": "Toga Shopping: Nigerians express anger at Peter Obi, beg him to join presidential race – Daylight",
    "summarized_story": "By CHIKA CHIMEZIEMany Nigerians have expressed their anger at the former Governor of Anambra State and former Vice Presidential Candidate of the Peoples Democratic Party (PDP), Mr Peter Obi, following his shopping experience at Toga Fashion House, Awka, which he shared on his Twitter page.\nMany Nigerians who thought that the fashion house was domiciled in China, reminded Obi that his attention was urgently needed back home in Nigeria with respect to 2023 Presidency.\nThey thus expressed anger at Obi’s delay in declaring for the Presidential election come 2023 which they are waiting for and not pictures of shopping experience for now.\nWhen contacted on phone by newsmen, Obi restated his resolve to continue to support small businesses and patronise local manufacturers.\nHe explained that he did not go for shopping in China as many believe, but at Awka."
  },
  {
    "headline": "Toga Shopping: Nigerians express anger at Peter Obi, beg him to join presidential race – Daylight",
    "summarized_story": "By CHIKA CHIMEZIEMany Nigerians have expressed their anger at the former Governor of Anambra State and former Vice Presidential Candidate of the Peoples Democratic Party (PDP), Mr Peter Obi, following his shopping experience at Toga Fashion House, Awka, which he shared on his Twitter page.\nMany Nigerians who thought that the fashion house was domiciled in China, reminded Obi that his attention was urgently needed back home in Nigeria with respect to 2023 Presidency.\nThey thus expressed anger at Obi’s delay in declaring for the Presidential election come 2023 which they are waiting for and not pictures of shopping experience for now.\nWhen contacted on phone by newsmen, Obi restated his resolve to continue to support small businesses and patronise local manufacturers.\nHe explained that he did not go for shopping in China as many believe, but at Awka."
  },
  {
    "headline": "Nigerian politicians interested in enriching themselves – Onaiyekan",
    "summarized_story": "The emeritus Archbishop of the Catholic Archdiocese of Abuja, John Cardinal Onaiyekan, has called for a new concept of political power, saying the system currently in practice is fraught with various misdemeanours.\nAccording to him, the current system will only continue to produce career politicians, who see politics as a business, adding that such people were interested in enriching themselves after getting to power.\nHe said, “We need a new concept of political power as service for the common good as we approach the next elections.\nThis calls for a drastic review of the present electoral law.”He also advised that political positions should be made less attractive to give people with genuine intentions a chance.\nThere is no reason the nation should not be able to finally settle this problem before 2022 is over,” the cleric added."
  },
  {
    "headline": "Nigerian politicians interested in enriching themselves – Onaiyekan",
    "summarized_story": "The emeritus Archbishop of the Catholic Archdiocese of Abuja, John Cardinal Onaiyekan, has called for a new concept of political power, saying the system currently in practice is fraught with various misdemeanours.\nAccording to him, the current system will only continue to produce career politicians, who see politics as a business, adding that such people were interested in enriching themselves after getting to power.\nHe said, “We need a new concept of political power as service for the common good as we approach the next elections.\nThis calls for a drastic review of the present electoral law.”He also advised that political positions should be made less attractive to give people with genuine intentions a chance.\nThere is no reason the nation should not be able to finally settle this problem before 2022 is over,” the cleric added."
  },
  {
    "headline": "JUST IN: Burkina Faso President Arrested By Mutinous Soldiers",
    "summarized_story": "Security sources have told AFP that mutinous troops in restive Burkina Faso arrested President Christian Kabore on Monday and kept him in army barracks a day after sparking an uprising.\nLater in the day gunshots were heard near Kabore’s private residence in the capital Ouagadougou, and witnesses reported seeing a helicopter above it.\n“President Kabore, the head of parliament and the ministers are effectively in the hands of the soldiers” at the Sangoule Lamizana barracks in the capital Ouagadougou, a security source said, with another source confirming the arrest.\n– Soldier demands –The latest volatility in Burkina Faso began on Sunday morning when gunfire was heard at numerous military bases, including two in Ouagadougou.\nTalks between representatives of the soldiers and Defence Minister General Barthelemy Simpore failed to make headway, a government source said."
  },
  {
    "headline": "Why I Was Barred From Seeing President Buhari,",
    "summarized_story": "Why I Was Barred From Seeing President Buhari,Samuel Ortom, the governor of Benue State, has revealed why he was denied access to President Muhammadu Buhari.\nOrtom said he was barred from having access to Buhari due to his constant criticism of the current administration’s bad policies.\nSpeaking at the state’s Government House in Makurdi, Benue State, the governor lamented that Buhari’s policies are bad.\nThe governor also described Buhari’s administration as that of “419.”He described the rice pyramid in Abuja as “419,” used to deceive Nigerians.\n“All those 419 rice pyramids will not help Nigeria."
  },
  {
    "headline": "Angry Youths Set Kano Private School On Fire Over Hanifa’s Murder",
    "summarized_story": "According to the Daily Nigerian, some enraged youths have set fire to Noble Kids School, Warshu Hospital Road, in Kawaji, Kano State, in retaliation for the kidnapping and murder of a five-year-old girl, Hanifa Abubakar.\nAbdulmalik Tanko, the school’s owner, had previously kidnapped the young girl and, despite receiving a ransom, killed her.\nHanifa and a group of friends were returning from an Islamic session when a tricycle offered them a ride.\nTanko orchestrated Hanfia’s kidnapping and subsequent murder while she was on her way to Islamiyya School in December, according to SaharaReporters.\nOn Friday, the suspects and the parents of the deceased child were both at the Kano police command headquarters."
  },
  {
    "headline": "2023: God Can Pick Nigeria’s President From My Church – Bishop Oyedepo",
    "summarized_story": "Bishop David Oyedepo, the founder of Living Faith Church, stated on Sunday that God could choose Nigeria’s next president from his congregation.\nThe speaker made the remark when suggesting that God might choose a female president from Living Faith Church, better known as Winners Chapel.\nThe Christian preacher urged members of his church who wanted to run for political office to always seek advice.\nOyedepo said, “And it is important for me to mention to members of the church because another time is here now.\n“Don’t get me wrong, God can pick a president from this church."
  },
  {
    "headline": "Breaking: JAMB reveals date for 2022 UTME, DE registration",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB), Monday, announced February 12, 2022 as the date for the commencement of registration for the Unified Tertiary Matriculation Examination (UTME) and the Direct Entry (DE) examination.\nThis was made known via the board’s weekly bulletin released by its Director of Public Relations, Dr Fabian Benjamin.\nIn the timeline of events attached to the bulletin, the board announced that the “UTME/DE registration starts February 12, 2022 and ends 19th March 2022.\nMock examination holds on 20th April 2022.\nUTME holds from 20th to 30th April 2022.”Details loading…"
  },
  {
    "headline": "37 days to APC National Convention: Buni-led CCEPC scales three legal hurdles in 4 months",
    "summarized_story": "With 37 days to the national convention of the All Progressives Congress (APC), a Federal High Court sitting in Port-Harcourt, Rivers state has struck out the suit challenging the legitimacy of the Governor Mai Mala Buni-led Caretaker Extra-Ordinary Convention Planning Committee (CCEPC).\n‘Party not in crisis’Commenting on the development, an APC chieftain in Kogi state, Kingsley Fanwo, dismissed the crisis tag often attached to the party.\nWhat we have is an attrition of interests which is normal in a ruling party that many believe will continue to lead Nigeria beyond 2023.\nPDP is saying there is problem in APC, and their governors, senators and other heavyweights are dumping their party for the ruling APC.\nWe are also mindful of legacies our amiable President will leave behind in terms of a successor and those who lead the ruling party."
  },
  {
    "headline": "June 12: At last, ex-Nigeria’s Head of State, Abdulsalami, reveals what led to Abiola’s death",
    "summarized_story": "One was I received a delegation from America headed by Pickering who was then, I think, the secretary of state or so.\nSo because I had authorised the American team to see him, the other parts of the family were waiting to see him.\nSo it was the medical team plus the American team that took him to the medical centre, unfortunately at the medical centre he gave up.\nHe told me he was there with the American team, at that time I was staying in the barracks, I had not moved to the Villa.\nSo, I said okay, let him take the American team to my house, I will meet them at the house; so I closed from the office, and went there."
  },
  {
    "headline": "Hanifa Abubakar: Youths Burn School Where Pupil’s Body Was Buried",
    "summarized_story": "Angry youths have burnt the school where the body of Hanifa Abubakar was buried in Kano State.\nChannels Television gathered that the youths stormed the school premises very early in the morning and set it ablaze, purportedly in protest to the killing of the five-year-old.\nHanifa was abducted by her teacher who demanded ransom from her parents and later killed her in December last year.\nThey buried Hanifa in a shallow grave within the school premises located at Kwanar ‘Yan Gana in Tudun Murtala Quarters.\nHe listed them to include the indefinite closure and withdrawal of the operational license of the school where the girl was buried."
  },
  {
    "headline": "Residents Flee As Gunmen Kill Petrol Dealer, Attendant In Ondo Community",
    "summarized_story": "Residents of Okeluse in Ose Local Government Area of Ondo State have fled the community after an attack by gunmen who killed a dealer and an attendant at a fuel station.\nThe dealer, identified as Oladimeji Aborowa, was reportedly killed on the spot after he was shot by the assailants.\nAccording to residents, the incident resulted in serious panic in the community as residents ran into the bush for safety.\nREAD ALSO: Fear Grips Plateau Community As Gunmen Kill Four In Mining SiteThe spokesperson for Ondo State Police Command, Funmilayo Odunlami, confirmed the incident to Channels Television.\nThe Commander of the Ondo State Security Network Agency, popularly called Amotekun, Adetunji Adeleye, also confirmed the incident to Channels Television."
  },
  {
    "headline": "AFCON 2021: Things Nigeria Got Wrong Against Tunisia – Ex-Eagles Keeper",
    "summarized_story": "Former Super Eagles goalkeeper, Idah Peterside, says Nigeria crashed out of the ongoing 2021 Africa Cup of Nations (AFCON) as a result of many irregularities.\n“We should have won that game,” he said in reaction to Nigeria’s defeat to Tunisia on Sunday night at the Stade Roumde Adjia in Garoua, Cameroon.\nTunisia players tried to slow it down; they knew we were quicker and better.\nREAD ALSO: Nigeria Crash Out Of 2021 AFCON After Loss To Tunisia“Tactically, they were superior.\nYou need to change tactics,” Peterside added."
  },
  {
    "headline": "Fear Grips Plateau Community As Gunmen Kill Four In Mining Site",
    "summarized_story": "Palpable fear gripped residents of Dong village, Jos North Local Government Area of Plateau State after gunmen attacked a mining site, killing four persons.\nThe gunmen stormed the mining site on Saturday and shot the workers dead, a situation that forced the State Police Command to deploy more personnel to the troubled community.\nIn a statement issued on Sunday, the Police Public Relations Officer, Gabriel Ubah, said the deployment is to forestall the breakdown of law and order.\nThe police spokesman stated that the command has begun investigations with a view to arresting the perpetrators of the crime.\nUnfortunately, four persons who went to a mining site were killed by yet to be identified gunmen."
  },
  {
    "headline": "UAE Intercepts Two Ballistic Missiles Fired By Yemen Rebels",
    "summarized_story": "Two ballistic missiles fired by Yemen’s Huthi rebels have been intercepted and destroyed over the United Arab Emirates, the defence ministry said on Monday.\n“The attack did not result in any casualties, while the remnants of the intercepted and destroyed ballistic missiles fell in separate areas around the Emirate of Abu Dhabi,” a statement said.\npic.twitter.com/laFEq3qqLm — وزارة الدفاع |MOD UAE (@modgovae) January 24, 2022The strike comes just a week after Yemen’s Huthi rebels claimed responsibility for missile and drone attacks on Abu Dhabi that triggered a fuel tank blast and killed three people.\nThe UAE is part of a Saudi-led military coalition that supports Yemen’s government against the Iran-backed Huthis.\nYemen’s civil war began in 2014 when the Huthis seized Sanaa, prompting Saudi-led forces to intervene to prop up the government the following year."
  },
  {
    "headline": "2023 Presidency: Battle for APC, PDP ticket intensifies",
    "summarized_story": "In this segment, Dr. Dayo Kayode, a Political Technocrat and In-House Analyst, Obaniyi Akinwale review the top headlines from the Nigerian Newspapers for the 19th of January 2022.\nAdvertisement"
  },
  {
    "headline": "INEC to monitor politicians' bank accounts, transactions",
    "summarized_story": "The Independent National Electoral Commission is setting its eyes squarely on the bank accounts of politicians and political parties contesting for different positions in the 2023 presidential elections.\nAccording to the INEC Chairman, Prof Mahmood Yakubu, every candidate would be mandated to turn in their bank account statement to ensure all monies moved in and out are accounted for and prevent vote-buying especially on the day of the election.\nAdvertisementHe also mentioned that this process is for all economic classes to ensure equality and transparency."
  },
  {
    "headline": "I can never return to your party, Obasanjo tells PDP leaders",
    "summarized_story": "Former President, Olusegun Obasanjo has reaffirmed his decisions to stay away from partisan politics and remained a statesman.\nHe made this known while receiving some leaders of the People’s Democratic Party who paid him a visit at his Presidential Library residence in AbeokutaAdvertisementThe delegation which was led by the National Chairman of the party, Iyorchia Ayu, included the PDP Vice Presidential candidate in 2019 and former governor of Anambra State, Peter Obi; Sule Lamido of Jigawa State; Olusegun Mimiko, Liyel Imoke, Donald Duke among others.\nThe former President appreciates them for the visit and said he would always be open for consultation from whoever wants his advice in the interest of Nigeria"
  },
  {
    "headline": "Agege LGA holds security summit, assures residents of safer community -",
    "summarized_story": "The Agege local government area council has held a security summit to address the prevailing security challenges in the area.\nResidents of the ancient community are assured of improved security.\nAdvertisement"
  },
  {
    "headline": "Pinnick Commends Eagles’ Endeavour Despite AFCON Ouster, Shifts Focus to World Cup Play-Off with Ghana",
    "summarized_story": "President of the Nigeria Football Federation, Mr Amaju Melvin Pinnick on Sunday commended the efforts of the Super Eagles despite a 0-1 loss to Tunisia in their Africa Cup of Nations Round of 16 match in Garoua.\n“I want to thank His Excellency, President Muhammadu Buhari for his love, support and encouragement to the team while they were in the championship.\nI also praise the Honourable Minister of Youth and Sports, Mr Sunday Dare for his interest and attention in the progress of the team.\n“The focus and attention will now shift to the FIFA World Cup qualifying play-off against Ghana in March.\nWe want to assure Nigerians that we will prepare even harder for those two matches to get the job done.”"
  },
  {
    "headline": "Australian Open: Navratilova Blasts Peng Shuai T-Shirt Ban",
    "summarized_story": "Retired tennis star Martina Navratilova has blasted a decision by Australian Open organisers to ban T-shirts supporting Chinese player Peng Shuai.\nSecurity staff had on Friday asked spectators trying to enter the grounds to remove T-shirts saying “Where is Peng Shuai?”.\nTennis Australia, the organising body behind the Australian Open, said Peng Shuai’s safety remained their “primary concern”, but defended their decision to confiscate the T-shirt and banner in a statement.\nIt is common for international sport events to have policies on what organisers deem as political statements.\nWimbledon prohibits “any objects or clothing bearing… political statements, objectionable or offensive statements” from the tournament grounds."
  },
  {
    "headline": "French Fashion Designer Thierry Mugler Dies Aged 73",
    "summarized_story": "French fashion designer Thierry Mugler has died at the age of 73, his representatives have announced.\nMugler’s designs were worn by stars including David Bowie and Lady Gaga.\n“We are devastated to announce the passing of Mr Manfred Thierry Mugler on Sunday January 23rd 2022,” a post on Mugler’s official Facebook account confirmed.\nBorn Manfred Thierry Mugler in 1948 in Strasbourg, France, he was a talented performer and by the age of 14 was a dancer with the Ballet du Rhin.\nPeople from the fashion world have paid tribute to Mugler on social media since his death was announced."
  },
  {
    "headline": "Cameroon: More Than a Dozen Dead Yaounde Nightclub Fire",
    "summarized_story": "At least 16 people have been killed in a fire at a popular nightclub in Yaounde, Cameroon’s capital, the government said.\nThe fire engulfed the main room of Liv’s Night Club in the capital’s upmarket Bastos district, home to embassies and diplomat residences.\nIn a statement, Cameroon President Paul Biya called for calm and assured AFCON players and fans of their safety.\nI woke up this morning and they told me that my 38-year-old son is dead,” said one woman, who gave her name as Fidele.\nAnd at around 7am, I received a lot of phone calls asking whether my brother was dead or alive."
  },
  {
    "headline": "Taiwan Reports New Large-Scale Chinese Air Force Incursion",
    "summarized_story": "Taiwan has reported the largest incursion since October by China’s air force into its air defence zone, with the island’s defence ministry saying Taiwanese fighters scrambled to warn away 39 aircraft in the latest uptick in tensions.\nThe latest Chinese mission included 34 fighters plus four electronic warfare aircraft and a single bomber, the Taiwan ministry said.\nThe Taiwan Air Force issued radio warnings and its air defence missile systems were activated, the ministry said in the statement issued late on Sunday.\nThe incursion on Sunday was the largest by Chinese warplanes since October 4, when a record 56 aircraft were detected in Taiwan’s air defence zone.\nBefore the latest incursion, Beijing had already sent 70 Chinese warplanes on 17 days into Taiwan’s air defence zone since the new year began."
  }
]