[
  {
    "headline": "Why doctors are leaving Nigeria in droves – NMA President",
    "summarized_story": "President of the Nigerian Medical Association, Prof. Innocent Ujah, has given reasons why doctors are leaving Nigeria for other countries.\nSpeaking during an interview on Channels TV on Monday, Ujah listed circumstances found around the work environment, insecurity, among other issues as reasons for Nigerian doctors and other professionals to leave the country.\nThe NMA president also stated that half of the doctors trained in Nigeria have moved abroad because they do not have to worry about work equipment and the safety of their families.\nHe said, “Many of the reasons are poor work environment, insecurity, poor remuneration and poor equipment to work with.\n“Remuneration and environment in other countries like Europe, America and Saudi Arabia are far better than Nigeria."
  },
  {
    "headline": "UK set to reduce travel restrictions, scrap red list – Report",
    "summarized_story": "The United Kingdom is set to reduce travel restrictions and scrap the infamous red list which came back into use after the outbreak of the Omicron variant of the COVID-19 virus.\nA UK newspaper, Daily Mail, reports that the Transport Secretary, Grant Shapps, had been able to convince his colleagues that the restrictions should be replaced with testing for the fully vaccinated.\nThere has been outrage from countries placed on the red list, many of which were African countries, since the British government instituted the fresh restrictions.\nThe PUNCH had reported that the Nigerian government would place the UK, Canada, and Saudi Arabia on its travel ban list on Tuesday.\nThe proposal to reduce the travel restrictions is expected to be approved this week, according to the report."
  },
  {
    "headline": "Igbos not beggars, we will fight for 2023 presidency – MASSOB",
    "summarized_story": "The Movement for the Actualisation of the Sovereign State of Biafra, MASSOB, has said the southeast would not kneel and beg for the Presidency in 2023.\nUchenna Madu, leader of MASSOB, said the southeast would fight tooth and nail to produce Nigeria’s president.\nIn a statement he signed, Madu said Igbos are not beggars; hence it would be an abomination to the region to stoop that low.\n“It is an abomination that Igbo elders will kneel down to another in begging, even though that the lives of Ndigbo are at risk.\nWe can never beg, rather we devise our own means of fighting back because Igbos must survive."
  },
  {
    "headline": "Nigeria records 418 new COVID-19 cases in 12 states",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed 418 additional COVID-19 infections across 12 states as the country’s infections surged since the detection of six cases of the Omicron variant.\nLagos State again on Sunday recorded the highest share of the new cases with 314 of the total 418 cases.\nThe NCDC mentioned that the number of active COVID-19 cases in the country increased to 6,754 with 418 additional cases confirmed on Sunday.\nThe NCDC added that a multi-sectoral National Emergency Operations Centre, activated at Level 2, had continued to coordinate the national response activities.\nNCDC announces 674 new COVID-19 cases in Nigeria, more deaths"
  },
  {
    "headline": "Plateau: Wase condemns bandits’ attack on Pinau village",
    "summarized_story": "Ahmed Idris Wase has condemned, in strong terms, bandits attack on Pinau Village in Mavo Chiefdom of Wase Local Government Area, Plateau State.\nWase described the Sunday attack, which resulted in the death of seven persons with several others injured, as ‘inhuman, senseless and unwarranted’, saying “the attackers must be brought to book”.\n“My sympathies are with the families who lost their loved ones in this callous act.\nThese senseless killings are painful and highly condemnable.\nI pray that the Almighty God accept the souls of all those who lost their lives in this unfortunate incident”, he said."
  },
  {
    "headline": "Why Buhari’s anti-corruption fight is flawed – Ex-minister, Shittu",
    "summarized_story": "Adebayo Shittu, a former Minister of Communications, has disclosed why the anti-corruption war of President Muhammadu Buhari is flawed.\nShittu said the anti-corruption war of Buhari is flawed because the anti-graft agencies depend on the Executive to initiate new laws.\nHe spoke during a national anti-corruption conference in Abuja over the weekend.\nAccording to Shittu: “When we were campaigning in 2015, we made the fight against corruption one of the three cardinal programs that we chose for ourselves.\n“What I’m saying is that the ICPC, the EFCC, or the Code of Conduct, should not wait for the Executive to initiate new laws."
  },
  {
    "headline": "FG not ready to tackle insecurity in north – Ahmed Bakare",
    "summarized_story": "A public commentator, Alhaji Ahmed Bakare, has seriously condemned the Federal Government over the insurgency ravaging the northern region of the country, saying that the government seems not to be bothered about the killings and kidnappings.\n“We are not fools and nobody should tell us that both the federal and state governments cannot end banditry activities bedeviling the entire northern region.\nThe federal government only pay the salaries of security operatives but the logistics are being provided by the state governments.\n“I know that in Zamfara State for example, there is no government in the state that did not buy at least 200 operational vehicles for the security agencies in the state.\nHowever, he enjoined Nigerians to keep on praying, pointing out that the troubled period would soon be over."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Obi Cubana counsels youths on respect for elders",
    "summarized_story": "Business mogul, Mr Obi Iyiegbu, popularly known as Obi Cubana has urged Nigeria youths to show respect to elders as part of Africa culture.\nHe said he was saddened at how rude and impolite some of the youths are toward the elders in society.\nHe wrote: “Call me old school, but I was raised in a generation where respect for elders is of utmost importance.\nSocial media especially has made everyone to be equal and the need to respect elders has flown out of the window.\nHe stressed the need to raise a generation where respect for the elderly is the key, saying “when we respect elders, the world will respect us’’."
  },
  {
    "headline": "Ego is a disease, says Genevieve Nnaji",
    "summarized_story": "Multiple award-winning Nollywood act, Genevieve Nnaji has offered a word of advice to celebrities: drop your ego.\nShe described undue ego as a disease.\nThe highly-celebrated movie star, in a post via her Instagram story, referred to ego as a disease which cure is love.\nAccording to the 42-year-old thespian, those who seek love must first learn to love themselves because only then can they attract love.\n- Advertisement -She wrote: “Ego is the disease."
  },
  {
    "headline": "ASUU Strike: Alumni association urges FG to honour agreement",
    "summarized_story": "The (CAANU) has urged the Federal Government to honour the agreement with the Academic Staff Union of Universities (ASUU) to prevent another industrial action.\nIt said the step would prevent strikes or actions that could threaten the continuous academic programme in the universities.\nIt would be recalled that ASUU had threatened to resume its suspended strike following the alleged failure of the Federal Government to meet its demand.\n- Advertisement -The university lecturers, after giving the government three weeks’ ultimatum, referred the decision to resume strike to its branches.\nREAD ALSO: Fed Govt moves to avert ASUU strikeThe branches are expected to reach a decision this week and communicate such to the leadership of ASUU."
  },
  {
    "headline": "BREAKING: Champions League last 16 draw, ManU face PSG",
    "summarized_story": "The Champions League draw was done on Monday.\nThe stand-out tie is undoubtedly the showdown between Paris Saint-Germain and Manchester United, which will see a return of old enmities as Lionel Messi and Cristiano Ronaldo collide once more.\nfirst leg matches will be played in February 15/16/22/23, while the second leg matches will be played in March 8/9/15/16Here are the tiesBenfica vs Real Madrid- Advertisement -Villarreal vs Manchester CityAtletico Madrid vs Bayern MunichSalzburg vs LiverpoolInter Milan vs AjaxSporting Lisbon vs JuventusChelsea vs LilleParis Saint-Germain vs Manchester United"
  },
  {
    "headline": "BREAKING: Gunmen attack Police Headquarters in Abia, kill Inspector",
    "summarized_story": "From Okey Sampson, UmuahiaGunmen in their numbers in the early hours of today attacked the headquarters of Abia State Police command in Umuahia the state capital, killing an Inspector of police.\nThe victim according to a reliable information was said to be one of the policemen on guard duty on the road in front of the headquarters.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe PPRO of Abia State Police Command, SP Geoffrey Ogbonna said he was yet to be briefed on the development.\nClick Here to Apply ."
  },
  {
    "headline": "Family of 6 escape death as truck falls on car in Abia",
    "summarized_story": "From Okey Sampson, UmuahiaIt was a miraculous escape for a family of six as a petroleum tanker fell on top of their car in Aba, Abia state.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“It was miraculous that the whole family survived the accident, not to talk of coming out of their can unscathed; it an only be God.\n“Some of us who watched the tanker on the car, thought all the family members had died, only to find out that before we could come for their rescue, they had come out of the car unaided.\nThe incident was said to have caused hours of serious gridlock on the ever-busy Aba/Owerri Road."
  },
  {
    "headline": "Omicron: FG bans flights from UK, Canada, Saudi, others",
    "summarized_story": "The countries affected are Saudi Arabia, the United Kingdom, Canada and Argentina.\nSo, Air Peace wanted to be going into the UAE three times a week.\nNow, we are giving them 21 frequencies from our agreement, they ought to give us 21.\nSo, what they’re supposed to do is to give Air Peace 21.\nHe said the Government of the United Kingdom proposed sticking to its standard background lines on whether a particular country will put the United Kingdom on the red list and avoid getting into hypothetical situations."
  },
  {
    "headline": "Insecurity: Boko Haram, ISWAP may soon take over Abuja –Naaba,",
    "summarized_story": "By Wilfred EyaFormer Speaker of the House of Representatives, Umar Ghali Na’Abba has decried the security situation in the country, saying there are plots by the Boko Haram and ISWAP fighters to take over the Federal Capital Territory.\nThis is because it is the mismanagement of governance and maladministration by political leaders that feed this insecurity.\nWhat is bad is that the current administration and the political party they belong to have not shown any readiness to change their methods.\nThey are mismanaging their political party.\nBut whatever party in power is not a guarantee that this security situation would just stop."
  },
  {
    "headline": "Ikpeazu calls for support from monarchs to strengthen security",
    "summarized_story": "Abia State Governor, Okezie Ikpeazu, has called on traditional rulers to partner his administration to strengthen security during and after the Yuletide.\nHe extolled the traditional ruler and members of his cabinet for ensuring peace and progress in his kingdom.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“On our part, we will continue to support peaceful communities with development projects and I am also aware of the efforts being made by the people of Abiriba to support our developmental strides through self-help.\n“Our people appreciate the love Governor Ikpeazu has shown us particularly with the completion of the first phase of Abiriba Ring Road on Ugwuezi road, Abiriba, provision of streetlights in our community, classroom blocks and appointment of teachers to man our schools."
  },
  {
    "headline": "Buhari Never Promised Tinubu Running Mate, His Boys Fire Back at Akande",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  },
  {
    "headline": "Ayu: There’ll Be No APC by April 2023",
    "summarized_story": "Ayu reiterated that PDP would win at least 25 of the states in the 2023 governorship polls.\nA statement from Ayu’s media office said, “By March/April 2023, there will be no APC in Nigeria.\nAyu disclosed that it was actually Mark, who advised him to go for the PDP national chairmanship.\nThe governor extolled Ayu’s vast political experience, but reminded him of the enormous task ahead to rescue Nigeria from the APC federal government in 2023.\nTherefore, the battle to rescue Nigeria, the battle to change leadership in 2023 is on you."
  },
  {
    "headline": "NFF Sacks Rohr, Names Eguavoen Interim Super Eagles Technical Adviser",
    "summarized_story": "The Nigeria Football Federation (NFF) has appointed Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nThe statement said the decision to sack Rohr and appoint Eguavoen on an interim basis was taken during a virtual meeting of the NFF Executive Committee on Sunday.\nOlajire quoted General Secretary of the NFF Mohammed Sanusi as saying that the relationship between the NFF and Mr Rohr had come to an end.\n“We thank him for his services to the Super Eagles and Nigeria.\nHe was on-field captain when the Super Eagles lifted the Africa Cup for the first time on away ground, in Tunisia 27 years ago."
  },
  {
    "headline": "Fully Vaccinated South African President Ramaphosa Tests Positive for Covid",
    "summarized_story": "South African President Cyril Ramaphosa tested positive for Covid-19 and is receiving treatment for mild symptoms, according to Bloomberg reports.\n“The president is in good spirits but is being monitored by the South African Military Health Service of the South African National Defence Force.”Ramaphosa, 69, was vaccinated against coronavirus with the single-dose Johnson & Johnson inoculation in February.\nSouth Africa is in the midst of a fourth wave of coronavirus infections fueled by the omicron variant.\nRamaphosa this month traveled to West Africa, where he held talks with Nigerian President Muhammadu Buhari, Ghanaian President Nana Akufo-Addo, Ivory Coast President Alassane Ouattara and Senegalese President Macky Sall.\nRamaphosa was tested for Covid-19 in all of the countries he visited, and returned to South Africa on Dec. 8 after obtaining negative test results, the presidency said."
  },
  {
    "headline": "Breaking: Soun of Ogbomoso Dies at 95",
    "summarized_story": "Kemi Olaitan in IbadanSoun of Ogbomoso, Oba Oladunni Oyewumi Ajagungbade III, is dead.\nTHISDAY learnt that the first class traditional ruler in Oyo State, died Sunday morning in the ancient town at 95.\nPalace sources who confirmed the death of the monarch said his death had not been officially announced.\nOba Oyewumi was born on May 27, 1926 in Ogbomoso to Oba Bello Afolabi Oyewumi Ajagungbade II.\nHe reigned for 48 years, making him one of the longest in Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "JUST IN: UK records first death from Omicron variant",
    "summarized_story": "One person has died of complications arising from the Omicron COVID-19 variant in the UK.\nAdvertisementAccording to the BBC, Boris Johnson, the prime minister, announced the death on Monday.\nJohnson was reported to have said the new variant was also resulting in hospital admissions and the “best thing” people could do was get their booster jab.\nMore to follow…"
  },
  {
    "headline": "JUST IN: UK records first death from Omicron variant",
    "summarized_story": "One person has died of complications arising from the Omicron COVID-19 variant in the UK.\nAdvertisementAccording to the BBC, Boris Johnson, the prime minister, announced the death on Monday.\nJohnson was reported to have said the new variant was also resulting in hospital admissions and the “best thing” people could do was get their booster jab.\nMore to follow…"
  },
  {
    "headline": "Report: UK to lift travel bans -- and replace with testing for the fully vaccinated",
    "summarized_story": "The United Kingdom will scrap the travel red list this week.\nAdvertisementAccording to Daily Mail, Grant Shapps, the UK transport secretary, convinced the government that the red list should be replaced with testing for the fully vaccinated.\nAdvertisementFollowing the discovery, a number of countries banned travel from countries in southern Africa.\nIn response to the travel ban, the federal government said it will restrict airlines coming from Canada, the UK, and Saudi Arabia from Tuesday.\nAdvertisementHadi Sirika, minister of aviation, who disclosed this on Sunday, said it was to reciprocate the travel ban placed on Nigeria over the new COVID-19 variant, Omicron."
  },
  {
    "headline": "Report: UK to lift travel bans -- and replace with testing for the fully vaccinated",
    "summarized_story": "The United Kingdom will scrap the travel red list this week.\nAdvertisementAccording to Daily Mail, Grant Shapps, the UK transport secretary, convinced the government that the red list should be replaced with testing for the fully vaccinated.\nAdvertisementFollowing the discovery, a number of countries banned travel from countries in southern Africa.\nIn response to the travel ban, the federal government said it will restrict airlines coming from Canada, the UK, and Saudi Arabia from Tuesday.\nAdvertisementHadi Sirika, minister of aviation, who disclosed this on Sunday, said it was to reciprocate the travel ban placed on Nigeria over the new COVID-19 variant, Omicron."
  },
  {
    "headline": "Property destroyed as fire razes shopping complex at Computer Village in Lagos",
    "summarized_story": "Fire has razed a shopping complex located in the popular Computer Village in Ikeja, Lagos.\nThe affected shopping complex houses many shops where traders sell phones, laptops and other electronic gadgets.\nAdvertisement“There was a fire incident at 18, Otigba Street, Computer Village, Ikeja, early hour of today.\nThe fire engulfed a shopping complex,” Ajisebutu said.\nHowever, valuable property which estimates are not yet known were destroyed.”In November, there was a gas pipeline leak at the Computer Village axis of the state."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Kwara raises a $4m seed to build Africa’s first credit union-powered neobank",
    "summarized_story": "The company is reportedly growing its credit union customer base by 40% month-on-month, and the listed credit unions are growing their membership by 19% and their loan base by 46%, annually.\nThough it’s reported to be courting some credit union clients in South Africa and the Philippines, which, according to the CEO, validates their solution across multiple markets.\nDue to that, it’s launching a new bank that will be powered by its existing credit unions.\nAlso, any unbanked individual can easily join a credit union and then enjoy the whole banking benefits.\n“Kwara’s unique approach is a catalyst for a new way of retail banking through digital-first credit unions."
  },
  {
    "headline": "Nigeria's GIGM adds bills payment and e-wallet features to its app",
    "summarized_story": "GIG Mobility (GIGM, formerly GIG Motors), a Nigeria-based mobility giant, this week launched electronic wallet and bills payment features on its app, as the company looks to expand its offerings beyond road mobility.\nWith the launch of the e-wallet and payments features, GIGM will be competing in a space where a plethora of fintech apps already operate.\nHence payments and e-wallet are the first of many non-core mobility features that the company intends to offer.\nAsked what other non-mobility solutions GIGM plans to launch soon, Odum said GIGM will continue to explore new offerings for its users.\n“Today it’s bills payment, tomorrow it could be a crowdfunding-based investment platform or a crypto wallet.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Democratising real estate investment, regulating cryptocurrencies, the weekend’s cash rain",
    "summarized_story": "AdvertisementEnter Enterprise Hotel: Think of what fintech startups like Bamboo, Chaka, Trove, and Risevest are doing to aid fractional investing in Nigeria, and you can get an inkling of what Enterprise Hotel does.\nOur Reporter, Chimgozirim Nwokoma, had a chat with Uche Ajaere, Co-founder and CEO of Enterprise Hotel, to get a feel of what the company is doing.\nIt appears South Africa might be the first African country to set out comprehensive regulation on crypto.\nKidnappers have demanded ransom money in Bitcoin in South Africa on several occasions.\nAdvertisementWe’ve brought you news on possible cryptocurrency regulations in South Africa in June and July, but what do we know now?"
  },
  {
    "headline": "Enterprise Hotel is democratising real estate investments for regular Africans",
    "summarized_story": "AdvertisementFractional investment startup, Enterprise Hotel, hopes to change this by offering Africans the opportunity to invest in commercial real estate with as little as ₦30,000 ($52).\nHow Enterprise Hotel makes moneyEnterprise Hotel makes money in two ways.\nHis time working in real estate showed him that only a handful of people could afford to buy or own real estate.\nThen we can start talking to investors.”Aside from helping more people gain access to real estate investments, Enterprise Hotel indirectly solves another problem.\nFor Enterprise Hotel, operating in the real estate industry with its high financial requirements poses a significant hurdle."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Flour Mills to escrow N900m in acquisition of Honeywell",
    "summarized_story": "Flour Mills Nigeria plc (FMN) will press ahead with its N80 billion acquisition of the flour mills unit of Honeywell Group Limited (HGL) and may escrow N900 million of the proceeds, BusinessDay has learnt.\nFlour Mills of Nigeria and Honeywell Group Limited last month agreed to combine operations of FMN through its affiliates and Honeywell Flour Mills plc (HFMP), a portfolio company of HGL, at a total enterprise value of N80 billion, which will make Honeywell Group dispose of a 71.69 percent stake in HFMP to FMN.\nFor over two decades, Honeywell Flour Mills has built a strong business with a production capacity of 835,000 metric tons of food per annum.\nFollowing the transaction, Honeywell Group will be strongly positioned to consolidate and expand its investment activities, including as a partner of choice for investors in key growth sectors.\nBusinessDay learns that Flour Mills Nigeria expects to receive full regulatory approvals for the transaction it sees as critical for consolidating its market leadership in the sector."
  },
  {
    "headline": "Flour Mills to escrow N900m in acquisition of Honeywell",
    "summarized_story": "Flour Mills Nigeria plc (FMN) will press ahead with its N80 billion acquisition of the flour mills unit of Honeywell Group Limited (HGL) and may escrow N900 million of the proceeds, BusinessDay has learnt.\nFlour Mills of Nigeria and Honeywell Group Limited last month agreed to combine operations of FMN through its affiliates and Honeywell Flour Mills plc (HFMP), a portfolio company of HGL, at a total enterprise value of N80 billion, which will make Honeywell Group dispose of a 71.69 percent stake in HFMP to FMN.\nFor over two decades, Honeywell Flour Mills has built a strong business with a production capacity of 835,000 metric tons of food per annum.\nFollowing the transaction, Honeywell Group will be strongly positioned to consolidate and expand its investment activities, including as a partner of choice for investors in key growth sectors.\nBusinessDay learns that Flour Mills Nigeria expects to receive full regulatory approvals for the transaction it sees as critical for consolidating its market leadership in the sector."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "Obaseki, EDSTMA assure free-flow of traffic during yuletide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has charged the Edo State Traffic Management Agency (EDSTMA) and other stakeholders to ensure that there is a free flow of traffic across the state during the yuletide period.\nObaseki gave the charge when he received a team of EDSTMA Traffic Mayor Corps led by the President, Emmanuel Onimhawo, who was on a courtesy visit at the Government House in Benin City.\nWe commend your efforts in traffic management in the city, as we see you sometimes sacrificing your time to control traffic in some designated areas in the state.\nWe will support and encourage you to continue to support EDSTMA in maintaining traffic in the State,” the governor reassured.\nOn his part, Onimhawo said the group is a voluntary body established in 2018 and attached to EDSTMA to control traffic in the State."
  },
  {
    "headline": "Obaseki to expend N24bn to sustain gains recorded in education sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the government plans to spend N24.6bn in 2022 to sustain gains recorded by his administration in the education sector.\nObaseki, who spoke to journalists in Benin City, said the government is committed to deepening reforms in the education sector to ensure that every Edo child is empowered to be globally competitive.\nHe said the monies will be expended on sustaining the gains recorded in the sector through the Edo Basic Education Sector Transformation (EdoBEST) Programme, building and maintaining physical infrastructure across schools in the state, and upskilling teachers, among others.\n“Edo today is ranked as one of the five nationals and sub-nationals in the world leading the charge in tackling learning poverty.\n“At the tertiary education level, the Edo State College of Agriculture and Natural Resources, Iguoriakhi and its sister campuses are being upgraded to global standard.”..."
  },
  {
    "headline": "Agripalm Commences Rebuilding Of Oba Akenzua Primary School In Ikoha – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOVIA-SOUTH – It was pump and ceremony yesterday in Ikoha community, Ovia-South West Local government area of Edo state as inhabitants of the community gathered to witness the foundation laying ceremony of the Oba Akenzua II Primary School by the AgriPalm Limited.\nIn his speech at the ceremony attended by the Ag.\nHe said upon due investigation, the panel among other resolutions requested the AgriPalm to develop the area North of the Pipeline as staff quarters and rebuild the demolished Oba Akenzua II Primary School.\nJustice Otabor, Iseh therefore assured of the council’s readiness to partner AgriPalm limited towards transforming the fortunes of the people of Ikoha community.\nThe Enogie of Siluko Dukedom, HRH Aguobasinmwin Omoregie Akenzua said in order for the school which bears the monumental name of Oba Akenzua II not to be completely obliterated propelled the rebuilding of the school and promised his cooperation and full protection of the project."
  },
  {
    "headline": "Sanwo-Olu Unveils New Power Policy To Meet Lagos Electricity Needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – An electricity sustainability framework that will provide reliable power to residential and industrial areas in Lagos State has been unveiled by Governor Babajide Sanwo-Olu.\nThe Governor recently launched the State’s Electricity Policy at an energy stakeholders’ event organised by the Ministry of Energy and Mineral Resources at Eko Hotel and Suites, Victoria Island.\nThe framework forms one of the technical components of the proposed Lagos State Electricity Law currently being developed to drive interventions towards improving access to electricity.\nSanwo-Olu said the electricity policy unveiled articulated constitutional, legal, engineering and commercial foundations for creating a viable sub-national electricity system that would cater for energy needs of the State, while enabling socio-economic growth for Lagos and the nation.\nThe Governor stressed that the set objectives of the electricity policy would only be realisable if the private partners showed equal commitment as the Government to boost capacity in off-grid generation and distribution network."
  },
  {
    "headline": "NBS says Nigeria’s Mining sector grew by 17.95% in 2020",
    "summarized_story": "National Bureau of Statistics (NBS) has said Nigeria’s mineral production in the mining and quarrying sector grew by 17.95% amounting to 64.3 million tons in 2020 from 54.5 million tons in 2019.\nThe NBS which disclosed this in its Mineral Production Statistics Report for 2019-2020, noted that the top three states with the biggest share of production in 2020 were Kogi (12.5 million tons), Ogun (12.1 million tons), and Cross River (8.9 million tons.\nIn 2020, the most mined minerals were limestone, sand, and granite, while limestone, granite, and laterite were the top three largest minerals in 2019.\nIn 2020, Kogi State, Ogun State and Cross River State were top three States with the largest share of production with 12.50 million tons, 12.11 million tons and 8.90 million tons respectively.\nLimestone, Sand and Granite were three most mined minerals in 2020, while Limestone, Granite and Laterite were the top biggest minerals in 2019Facebook Notice for EU!"
  },
  {
    "headline": "Instant loans: DMBs, MFBs jostle for market share",
    "summarized_story": "Experts in the industry who spoke with our correspondent put the conservative size of instant loans paid out by FinTechs to borrowers in 2020 alone at over N550billion.\nThe competition for the huge instant loan market, I assure you, is going to intensify”, Oni claimed.\nOne of the banks aggressively competing for control of the instant loans market is Access Bank Plc.\nThe bank, checks on its website suggest, have different packages for both public and private workers desiring instant loans.\nA monthly interest fee of 3.5% is applied and a flat management fee is charged upfront."
  },
  {
    "headline": "Delinquent loans, insecurity shrink banks’ end of year profits, dividends",
    "summarized_story": "The bank’s profit before tax saw a significant increase of 31per cent y/y to N97.5billion (H1 2020: N74.3billion).\nIn the third quarter ended September 30, 2021, the bank’s Profit before tax grew by 16% to N135bn from N116.623billion in 2020.\nHowever, on a quarterly basis, the group recorded a 57% surge in its bottom line to N6.2 billion from N4 billion recorded in Q2 2021.\nWEMA BANKWema Bank’s Profit before tax grew by 34% to N1.5bn for the period ended March 30, 2021 from N1.130 billion in 2020.\nAvailable statistics from the Nigerian Stock Exchange (NSE) show that while some banks recorded strong improvements from the previous year results, others incurred declines, a development attributable to the unfolding economic realities in country."
  },
  {
    "headline": "Crisis hits vaccine distribution as Lagos officials threaten strike",
    "summarized_story": "“The Federal and Lagos State Governments have done due diligence to establish the vaccines efficacy and safety”, the governor had assured.\nOur correspondent observed during his visits to some centres in Lagos that many Lagosians coming for the second dose of the vaccine were told to come back later.\nI advise them to exercise patient as they would be informed the moment the vaccine is available” the health worker assured.\nWe should praise and encourage Nigerians health workers at the forefront of the vaccination exercise.\nWe had planned to embark on strike on December 7, but we shelved it after some concerned stakeholders intervened."
  },
  {
    "headline": "Sanwo-Olu pledges more intervention to support fight against SGBV",
    "summarized_story": "By GBENGA ADEOLA…As First Lady Presents Six Vehicles To Judiciary, MDAs, NGOsLagos State Governor, Mr. Babajide Sanwo-Olu at the weekend assured that there would be more intervention by the state government to support the fight against all forms of Sexual and Gender-Based Violence (SGBV) in the state.\n“On behalf of the government and people of Lagos State, I want to thank all of you for what you are doing.\n“We are presenting six vehicles today making a total of Nine vehicles we have presented to support the fight against SGBV.\nBesides the vehicles, rape kits were also donated to the Ministry of Health to help in the treatment of rape survivors.\nThe donors are the Lagos State Security Trust Fund (LSSTF) and Lagos State Gaming and Lotteries Authority, while the Lagos State Signage and Advertisement Agency (LASAA) supported the 16 days of activism campaign with adverts on billboards and electronic media."
  },
  {
    "headline": "Sanwo-Olu pledges more intervention to support fight against SGBV",
    "summarized_story": "By GBENGA ADEOLA…As First Lady Presents Six Vehicles To Judiciary, MDAs, NGOsLagos State Governor, Mr. Babajide Sanwo-Olu at the weekend assured that there would be more intervention by the state government to support the fight against all forms of Sexual and Gender-Based Violence (SGBV) in the state.\n“On behalf of the government and people of Lagos State, I want to thank all of you for what you are doing.\n“We are presenting six vehicles today making a total of Nine vehicles we have presented to support the fight against SGBV.\nBesides the vehicles, rape kits were also donated to the Ministry of Health to help in the treatment of rape survivors.\nThe donors are the Lagos State Security Trust Fund (LSSTF) and Lagos State Gaming and Lotteries Authority, while the Lagos State Signage and Advertisement Agency (LASAA) supported the 16 days of activism campaign with adverts on billboards and electronic media."
  },
  {
    "headline": "2023 polls: PDP, APC fight dirty",
    "summarized_story": "The ruling All Progressives Congress (APC) and the opposition Peoples Democratic Party (PDP) yesterday renewed their hostilities over the 2023 general elections.\nBut, APC fired back, saying that PDP has nothing to offer Nigerians, despite its leadership change.\nAPC National Caretaker Committee Secretary Senator John Akpanudoedehe said PDP was day dreaming, stressing that it is not a solution to the country’s problems.\nAt a reception in Makurdi, the Benue State capital, at the weekend, Ayu declared that the PDP would resist the federal might in 2023.\nThe chairman predicted what he described as the “collapse” of the APC by March/April 2023, saying the APC is a “mere contraption”."
  },
  {
    "headline": "Akande: Obasanjo’s govt was reluctant to find Bola Ige’s killers",
    "summarized_story": "FORMER interim National Chairman of the All Progressives Congress, APC, Bisi Akande, has alleged that the government of former President Olusegun Obasanjo was reluctant to find the killers of Bola Ige.\nAkande added that after Ige’s murder, a copy of the former minister’s letter of resignation from Obasanjo’s government was found in his bedroom, in Abuja.\n“I believe it was after that outing that some elements close to the president met and decided to deal with Bola Ige.\n“There was enough evidence that the government of former president Obasanjo was reluctant to find the killers of Bola Ige.\n“The man, who came hunting for us was President Olusegun Obasanjo, Ige’s friend for many years who became our relentless foe."
  },
  {
    "headline": "BREAKING: Fire Razes Shops At Computer Village In Lagos, Destroys Property Worth Millions Of Naira",
    "summarized_story": "A fire broke out in the early hours of Monday at the famed Computer Village market in Ikeja, Lagos State, destroying some shops.\nThe fire started in one of the stores, according to Lagos State Police Command spokesperson Adekunle Ajisebutu.\n“There was a fire incident at 18, Otigba Street, Computer Village, Ikeja early hour of today.\nThe event is claimed to have destroyed property worth millions of naira.\nMeanwhile, the reason of the fire outbreak had not been determined as of the time of reporting this article."
  },
  {
    "headline": "BREAKING: President Tests Positive For COVID-19",
    "summarized_story": "South African President, Cyril Ramaphosa has tested positive for COVID-19.\nSouth African presidency stated that Ramaphosa is “in good spirits” and is being monitored by doctors.\n“People who have had contact with the president today are advised to watch for symptoms or to have themselves tested.”President Muhammadu Buhari received the South African president on December 1 at the presidential villa in Abuja.\nSouth African Presidency however said that Ramaphosa and his delegation were tested for COVID-19 after returning from a four-country visit to West Africa and it came out negative.\n“The president also tested negative on his return to Johannesburg on 8 December.”"
  },
  {
    "headline": "BREAKING: NFF Sacks Rohr, Appoints Eguavoen Super Eagles Interim Coach",
    "summarized_story": "Gernot Rohr’s contract as coach of the Super Eagles has been terminated by the Nigeria Football Federation.\nFollowing that, the football federation appointed Augustine Eguavoen, its current Technical Director, as the Super Eagles’ Technical Adviser on an interim basis.\nThe statement added, “Following a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\nWe thank him for his services to the Super Eagles and Nigeria,” he added.\nHe was the Super Eagles’ on-field captain when they won the Africa Cup for the first time on foreign soil in Tunisia 27 years ago."
  },
  {
    "headline": "My Brother Wasn’t Kidnapped By Bandits — Sheikh Gumi",
    "summarized_story": "Sheikh Ahmed Gumi has denied that his brother was abducted by bandits.\nGumi called the reports “mischievous, deceptive, and diversionary” in a statement received by Vanguard.\nMalamTukur Mamu, the Dan-Iyan Fika and Media Consultant to Gumi, who signed the statement opined: “Our attention was drawn to yet another fake news that the biological brother of Sheikh Dr. Ahmad Abubakar Gumi has been kidnapped by bandits.\nThe story some sections of the media are deliberately misquoting to give a picture “that the brother of the person supporting the bandits has also been kidnapped” is mischievous, misleading and diversionary.\nA driver of his father was also killed by the same bandits."
  },
  {
    "headline": "Breaking: Fire outbreak engulfs filling stations in Anambra, buildings, vehicles affected (VIDEO)",
    "summarized_story": "Two filling stations located close to Onitsha-Enugu expressway are said to have been engulfed by fire.\nThe incident which its cause was not ascertained as at the time of filling this report spilled to closeby buildings and vehicles.\nMen of the state fire service are reportedly battling the fire incident in a bid to bring it under control.\nA short video clip obtained via social media revealed a nearby persons clamouring for help to quench the ranging fire.\nDetails loading…"
  },
  {
    "headline": "Breaking: Traditional rulers go into hiding as gunmen invade Imo communities, kidnap 2, set palaces on fire",
    "summarized_story": "Gunmen on Sunday kidnapped two traditional rulers in Okigwe area of Imo state.\nThe hoodlums also set palaces ablaze.\nThis is happening barely two days after the gunmen killed a traditional ruler and dump his body inside a car.\nPolice authorities are yet to confirm the incident as at the time of filling this report.\nDetails loading…"
  },
  {
    "headline": "Breaking: Despite taking double vaccine doses, South Africa’s President, Cyril Ramaphosa, tests positive for COVID-19",
    "summarized_story": "South African President Cyril Ramaphosa is receiving treatment for mild Covid-19 symptoms after testing positive on Sunday, the office of the presidency said in a statement.He has delegated all responsibilities to Deputy President David Mabuza for the next week.\nRamaphosa “started feeling unwell after leaving the State Memorial Service in honor of former Deputy President FW de Klerk in Cape Town earlier today,” the presidency statement said.\nHe is however “in good spirits” and is being monitored by the South African Military Health Service of the South African National Defence Force.\n“President Ramaphosa says his own infection serves as a caution to all people in the country to be vaccinated and remain vigilant against exposure.\nRamaphosa, who is fully vaccinated, recently returned from a trip in West Africa."
  },
  {
    "headline": "Travel Ban: Nigeria’s Plan To Red List UK, Others Not Tit-For-Tat, Says Minister",
    "summarized_story": "﻿The Minister of State for Health, Dr Olorunnimbe Mamora, has given further insight into the Federal Government’s plan to place on a red list, countries that have placed Nigeria on a red list in the wake of the omicron variant of the COVID-19.\nDr Mamora, who was a guest on Channels TV’s News @ 10, said contrary to claims that the said plan was on a tit-for-tat basis, the move was only expected to be in the best interest of the country.\n“Whichever way we act, it is in consonance with what we take to be in our own best interest.\nIt’s been done in the best interest of our country.”READ ALSO: Omicron: UK Red Listing Nigeria Is Unjust, Discriminatory – Lai MohammedThe minister also spoke about the exit of many medical practitioners from the country in search of greener pastures abroad.\nAccording to him, health workers consider remuneration, conducive environment, available equipment, among other factors before leaving the shores of Nigeria."
  },
  {
    "headline": "Our Region Is Tormented By Numerous Challenges, Buhari Tells ECOWAS Leaders",
    "summarized_story": "President Muhammadu Buhari has said that the West African subregion is tormented by numerous challenges especially the threat to democracy in Mali and Guinea.\n﻿He called on the ECOWAS leaders to continue to work together in a pragmatic way to confront the numerous challenges noting that it requires collective action.\nToday’s realities remind us of the need to continue to forge stronger solidarity in order to address the new challenges, including the current third wave of the pandemic and its new Omicron variant.\n“Despite the enormity of these challenges, our Chair has navigated us well and continues to do so.\nHe said the emergence of a new variant poses fresh challenges, adding that the sanctions and restrictions on travelling were unjustified."
  },
  {
    "headline": "South African President Ramaphosa Tests Positive For COVID-19",
    "summarized_story": "South African President Cyril Ramaphosa tested positive for Covid-19 on Sunday and is receiving treatment for mild symptoms, the presidency said in a statement.\nHe would remain in self-isolation in Cape Town for the time being and had delegated all responsibilities to Deputy President David Mabuza for the next week.\nOn a recent visit to four West African states, the president and the entire South African delegation were tested for Covid-19 in all countries, the statement said.\n“The president and the delegation returned to South Africa from the Republic of Senegal on Wednesday, 8 December 2021, after obtaining negative test results.\n“People who have had contact with the president today are advised to watch for symptoms or to have themselves tested,” it added."
  },
  {
    "headline": "Panic Grips Zamfara Communities As Gunmen Impose Over N1m Levy",
    "summarized_story": "Gunmen have demanded over N1 million as levies from different communities in the Zurmi, Kaura Namoda and Birnin-Magaji local government areas of Zamfara State.\nWhile noting that some communities are yet to raise the money before the December 11 deadline given by the gunmen, he said the situation has caused panic in the affected areas.\nREAD ALSO: NDLEA Arrests Ghanaian, Two Others With 9.9kg Cocaine, Meth“Gabaken Mesa has paid N1 million, Gabaken Dan-Maliki N1 million and Birnin Tsaba N1 million, just to mention but few,” Aliyu said.\nHe said the state government is aware of the levy imposed on these communities but assured that the government is working with the security agencies to ensure that the communities are secured.\n“The state government is working with the security agencies to make sure that these communities are secured,” the commissioner said."
  },
  {
    "headline": "UCL: Ronaldo, Messi To Rekindle Rivalry As Man Utd Draw PSG",
    "summarized_story": "Manchester United are set to play Paris Saint-Germain in the last 16 of the Champions League.\nMore to follow ."
  },
  {
    "headline": "Israeli PM, Bennett, meets Abu Dhabi Crown Prince, Zayed -",
    "summarized_story": "Israeli Prime Minister Naftali Bennett’s office has disclosed that he has met with Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed at his private palace in Abu Dhabi.\nThis is the first official visit of an Israeli Prime Minister to the United Arab Emirates and is coming 15 months after the signing of a normalization agreement between the two countries.\nBennett had highlighted growing trade ties between his country and the UAE in an interview with WAM, the Emirates’ state-run news agency.\nHe did not however mention in the agency’s write-up of the interview tensions with Iran.\nBut the interview made only the slightest possible nod in that direction, writing: ‘On the UAE’s efforts to enhance international cooperation for facing common challenges, the Israeli Prime Minister stressed, “the values of tolerance, peace and dialogue are common, and that is why the friendship that unites us developed at such a high speed.”‘"
  },
  {
    "headline": "APC Convention: Sani, Mustapha, 9 others to meet Thursday on way forward for party",
    "summarized_story": "Ahead of the national convention of the ruling All Progressives Congress (APC) slated for February 2022, all the national chairmanship aspirants will on Thursday this week gather in Abuja to discuss their strategies for propelling the party forward in preparation for the 2023 general elections.\nSunny Moniedafe, former Borno governor, Senator Kashim Shettima, former Gombe State governor, Senator Danjuma Goje and Mohammed Saidu Etsu.\nThe maiden edition of the summit was held in December 2020 with the Director-General of the Progressive Governors’ Forum (PGF) Salihu Moh.\n“Reports and suggestions on the lecture will be made available to the party and interested members of the public.\n“The National Chairman, Caretaker Extra-Ordinary Convention Planning Committee (CECPC), and Governor of Yobe State, Hon."
  },
  {
    "headline": "APC Governors greet Imo counterpart, Uzodimma at 63",
    "summarized_story": "The Progressive Governors Forum (PGF) has congratulated the Imo State governor, Hope Uzodinma, on his 63rd birthday celebration.\nThe forum in a statement issued on Monday said it joins the governor, the people of Imo State, and other well-meaning Nigerians, to celebrate this special occasion with him and his family.\nWe also acknowledge your contributions to our team of Progressive Governors through your insightful and resolute inputs to the processes of managing governance in Imo State as well as at the national level.\n“As Governor of Imo State, through all the development initiatives being implemented by your APC-led government, you represent the shining light of our politics.\n“Once again, congratulations and Happy Birthday to HE Hope Uzodinma!,” the statement read."
  },
  {
    "headline": "APC Convention: Sani, Mustapha, nine other chairmanship aspirants to discuss way forward -",
    "summarized_story": "This is ahead of the national convention of the ruling party slated for February 2022.\nThe eleven prominent chairmanship aspirants include; former Deputy National Chairman of the defunct Congress for Progressive Change (CPC) Saliu Mustapha, former governor of Nasarawa state, Senator Tanko Almakura, former governor of Borno state Senator Alimodu Sheriff, current Senator representing Niger East Mohammed Sani Musa, former governor of Zamfara state Abdulaziz Yari and former governor of Bauchi state Isa Yuguda.\nThe maiden edition of the summit was held in December 2020 with the Director-General of the Progressive Governors’ Forum (PGF) Salihu Moh.\n“Reports and suggestions on the lecture will be made available to the party and interested members of the public.\n“The National Chairman, Caretaker Extra-Ordinary Convention Planning Committee (CECPC), and Governor of Yobe State, Hon."
  },
  {
    "headline": "Tinubu Was Never Promised Running Mate Position, Buhari’s Boys Fire Back at Ex-Party Chair Akande – Arise News",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  },
  {
    "headline": "Electoral Bill: PANDEF Expresses Concern Over President Buhari’s Delayed Assent",
    "summarized_story": "The Pan Niger Delta Forum (PANDEF) has expressed concern over the delay by President Muhammadu Buhari in assenting to the 2021 Electoral Act Amendment Bill transmitted to him by the National Assembly last month.\n“Anyone, who for whatever reason, solicits the President not to sign the Bill is doing a great disservice to Nigeria.\n“PANDEF, therefore, calls on President Muhammadu Buhari to jettison partisan considerations and assent to the bill without further delay, to strengthen the nation’s democracy”.\nThe CSOs in the letter entitled “Electoral Bill: Invite Representatives of Youths, Women, PLWD and CSOs to the Signing Ceremony,” dated 11th December, 2021, expressed optimism that Buhari would sign the Electoral Amendment bill into law as he celebrates on his birthday.\n“The current Electoral Amendment Bill before the President of the Federal Republic of Nigeria for assent demands immediate and urgent assent in the interest of the electorates and entrenchment of parties’ internal democracy."
  },
  {
    "headline": "Nigeria Calls on Western Allies to Declare Bandits, Boko Haram, IPOB as Terrorists",
    "summarized_story": "Nigeria’s federal government on Sunday said that it was continuing to put pressure on its western allies to “proscribe” bandits, Boko Haram and the Indigenous People of Biafra (IPOB) as terrorists.\nAccording to the presidency, the economic instability that the Covid-19 pandemic has wreaked has further proven an effective recruitment tool for bandits and terrorists across the nation in particular and the African continent as a whole.\nEven Nigeria that proudly holds the mantle of Africa’s largest economy is not immune from the debilitating economic impact of COVID-19.\n“ The economic instability that the pandemic has wreaked has proven an effective recruitment tool for bandits and terrorists across the continent.\n“Second, alongside military force, this government is seeking to address the violence at its economic source."
  },
  {
    "headline": "Nigeria: Governing APC Sets February 19 as Tentative Date for National Convention",
    "summarized_story": "There are indications that the leadership of the All Progressives Congress (APC), has tentatively settled for Saturday, February 19, 2022, as the date for its national convention.\nThis, notwithstanding, the party leadership has remained silent on the presidential ticket, because according to sources, it was not yet a prerogative of the party.\nIn the same breath, some eleven national chairmanship aspirants of the APC have agreed to meet this Thursday, December 16, to brainstorm on how to move the APC forward ahead of the national convention.\nBesides, since the original four-year-term of the sacked Oshiomhole NWC was meant to end in February, the date therefore fits the party’s calendar for the national convention to elect new NWC members.\nOthers are the Minister of Special Duties and Inter-Governmental Affairs, Senator George Akume; former Borno State governor, Senator Kashim Shettima; former governor of Gombe State, Senator Danjuma Goje, Mr."
  },
  {
    "headline": "South Africa President Ramaphosa Tests Positive for Covid, Mildly Ill",
    "summarized_story": "South African President Cyril Ramaphosa is receiving treatment for mild COVID-19 symptoms after testing positive for the disease Sunday, his office said.\nSome in the delegation tested positive in Nigeria and returned directly to South Africa.\nSouth Africa is currently battling a rapid resurgence driven by the omicron variant, health officials say.\nAfter a period of low transmission of about 200 new cases per day in early November, South Africa COVID-19 cases began rising dramatically.\nOn Nov. 25, scientists in southern Africa confirmed the omicron variant, which has more than 50 mutations."
  }
]