[
  {
    "headline": "322,000 Nigerian refugees in Niger, Cameroon, Chad – FG",
    "summarized_story": "A total of 322,000 Nigerian refugees are currently in the Republics of Niger, Cameroon and Chad, the Federal Government said on Friday.\nThe Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Farouq, disclosed this while receiving the draft report from the Technical Working Group on the repatriation of Nigerian refugees in Cameroon.\nThe TWG presented the draft tripartite agreement for the voluntary repatriation of Nigerian refugees in Niger Republic and Chad to the minister in Abuja.\nThe statement read in part, “Receiving the draft at the Nigerian Army Resource Centre Abuja, Farouq noted that a total of 322,000 Nigerian refugees were currently living in neighbouring countries.\n“Out of the figures, Niger currently hosts 186,957 refugees, the Republic of Cameroon 118,409 refugees, while 16,634 refugees are in the Republic of Chad.”The statement quoted Farouq as saying “With the large number of refugees in Niger, Chad and Cameroon, the Federal Government has officially initiated talks with the governments of Chad and Niger to sign tripartite agreements similar to the one we have with the Republic of Cameroon."
  },
  {
    "headline": "COVID-19: Ekiti begins second phase of vaccination, cautions residents",
    "summarized_story": "The Ekiti State Government on Friday said it had begun the second phase of vaccination across the 16 council areas.\nThe Commissioner for Health, Dr Oyebanji Filani, who disclosed this, said the commencement followed the arrival of Moderna COVID-19 vaccines in the state.\nMeanwhile, experts in the health sector have called on the Federal Government to approach the Chinese government on vaccines production and distribution, to bring more choices of safe vaccines for Nigerians.\nThe engagement also stressed the need for local production of COVID-19 vaccines in partnership with the Chinese government to halt the spread of the virus in the country.\nThe meeting, according to Oni, also deliberated on a number of issues including the need to ensure fair and equitable distribution of COVID-19 vaccines, tapping into Chinese Belt and Road Initiatives amidst COVID-19."
  },
  {
    "headline": "Behold HRM Ogiame Atuwatse III….King With Vision And Mission",
    "summarized_story": "An accomplished businessman and CEO of Noble Nigeria Souvenir Limited now Ogiame Atuwatse III, he speaks exclusively to Vanguard on the stormy journey to the throne and his vision and mission to his beloveth Itsekiri people.\nHIS ROYAL MAJESTY, TESOLA EMIKO, ATUWATSE III, THE OLU OF WARRI KINGDOMYour Majesty, let me start by congratulating you on your acension to the throne of your forefathers as the 21st Olu of Warri.\nI think we witnessed some new things that we introduced by way of organization, procession, music and visuals in the ceremony.\nI plan to do many unprecedented things that will enhance, and promote, the rich heritage of the Itsekiri people.\nAs the primary custodian of Itsekiri culture and an avid lover of history, I desire to bring a renaissance of our identity and purpose as a people."
  },
  {
    "headline": "Behold HRM Ogiame Atuwatse III….King With Vision And Mission",
    "summarized_story": "An accomplished businessman and CEO of Noble Nigeria Souvenir Limited now Ogiame Atuwatse III, he speaks exclusively to Vanguard on the stormy journey to the throne and his vision and mission to his beloveth Itsekiri people.\nHIS ROYAL MAJESTY, TESOLA EMIKO, ATUWATSE III, THE OLU OF WARRI KINGDOMYour Majesty, let me start by congratulating you on your acension to the throne of your forefathers as the 21st Olu of Warri.\nI think we witnessed some new things that we introduced by way of organization, procession, music and visuals in the ceremony.\nI plan to do many unprecedented things that will enhance, and promote, the rich heritage of the Itsekiri people.\nAs the primary custodian of Itsekiri culture and an avid lover of history, I desire to bring a renaissance of our identity and purpose as a people."
  },
  {
    "headline": "Mercy Eke: Living Her Dream",
    "summarized_story": "Words by- Josephine AgbonkheseOur cover personality Mercy Eke needs almost no introduction.\nIn this interview, she speaks of her newly-launched platform for giving back: The Mercy Eke Foundation, life as the only woman to have won the BBN grand prize so far; her love life and much more.\nHas it always been your dream to formally giveback to society or did this come as an afterthought?\nSo yes, I’ve been giving, and giving back has always been my thing.\nSo who’s the man in your life right now and what do you love most about him?"
  },
  {
    "headline": "Mercy Eke: Living Her Dream",
    "summarized_story": "Words by- Josephine AgbonkheseOur cover personality Mercy Eke needs almost no introduction.\nIn this interview, she speaks of her newly-launched platform for giving back: The Mercy Eke Foundation, life as the only woman to have won the BBN grand prize so far; her love life and much more.\nHas it always been your dream to formally giveback to society or did this come as an afterthought?\nSo yes, I’ve been giving, and giving back has always been my thing.\nSo who’s the man in your life right now and what do you love most about him?"
  },
  {
    "headline": "Moet and Nicole: Spilling The Tea",
    "summarized_story": "MOET ABEBE: Being an only child helped shape me Between you and Nicole, whose idea was Spill the Tea and what inspired it?\nThe parties present in my work life are not in my private life and vice versa.\nI love to annoy her at times (which you will see in the podcast) but it’s really all love.\nWhen Moet and I set out to create ‘Spill The Tea’, we wanted something people could get lost in.\nI often say this is where I spent some of my best school years."
  },
  {
    "headline": "32 Bethel Baptist High School students regain freedom",
    "summarized_story": "32 students of Bethel Baptist High School, Damishi, Kaduna State today regained their freedom from suspected bandits.\nRecall that on Monday, 5th July, 2021, over 100 students were abducted from the Bethel Baptist High school, Damishi, Kaduna.\nSome of the students had earlier been released while others regained their freedom on health grounds.\nConfirming the release of the students today, the state chairman, Christian Association of Nigeria, Rev.\nHayab, “We should continue to pray for the remaining students, believing that one day, they too will be released to us."
  },
  {
    "headline": "Petroleum marketers in Imo suspend strike",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria, IPMAN, in Imo State on Friday suspended its strike.\nThe suspension of the strike was contained in a release issued in Owerri, the state capital, after a series of meetings had been held involving the Imo State Government , Department of Petroleum Resources (DPR), Department of State Services (DSS), Petroleum Tankers Drivers (PTD) branch of the Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) branch of the Association of Imo Petroleum Marketers and Dealers and some security agencies in the state.\nThe release, which was signed on behalf of the Association of Imo Petroleum Marketers and Dealers by Sir Chimodo Martin reads: “It is no longer news that Association of Imo Petroleum Marketers and Dealers embarked on industrial action since Wednesday, 25th August, 2021.\n“The Association has made its sufferings in the hands of some Government agencies known to the public through the industrial action.\n“Relying on the above promise, the government and the intervention of the DSS, Imo Petroleum Marketers and Dealers have suspended the industrial action forthwith."
  },
  {
    "headline": "Police confirms release of 18 kidnapped students, staff of Zamfara College, two killed",
    "summarized_story": "The Zamfara State Police Command has said that in collaboration with the state government and other critical stakeholders, it has successfully secured the unconditional release of 18 abducted students and staff of Zamfara State College of Agriculture and Animal Sciences, Bakura.\nIt could be recalled that on Monday, 16th of August, 2021, suspected bandits invaded the School and abducted the victims to an undisclosed hideouts.\nHe, therefore, directed all the security agencies to ensure full compliance with the new measures.\nThe Commissioner of police, while handing over the victims to the Governor appreciated the Governor for the support and encouragement rendered to the police and other collaborators that assisted in the successful rescue of the abducted victims.\nThe statement noted that all the victims are undergoing medical treatment and Police medical team before being reunited with their families."
  },
  {
    "headline": "Kaduna: Bandits kidnap four in Zazzau Emirate",
    "summarized_story": "Suspected bandits on Friday kidnapped four persons in Zangon Shanu and Unguwar Liman in the Sabon Gari Local Government Area of Zazzau Emirate, Kaduna State.\nDr. Usman Abdul, a lecturer in the Department of Mathematics, Ahmadu Bello University, Zaria, who lived in Sabon Gari Local Government told DAILYPOST this evening that three males and a house wife were kidnapped by bandits who stormed the villages around 1.am on Friday morning.\nAccording to him, no ransom has been demanded as the bandits have not contacted the relatives of the victims.\nThe Kaduna State Police Command has confirmed the bandits attack.\nHe pleaded with residents of the state to always provide them with useful information of any strange movement around their environments."
  },
  {
    "headline": "Jos crisis: Obiano to evacuate Anambra indigenes",
    "summarized_story": "Anambra State Governor, Chief Willie Obiano has extended his earlier order for all students, who are its indigenes in University of Jos, Plateau State, to be evacuated.\nObiano said the extension would now include all Indigenes of the state living in Jos and students of other institutions in Jos that are desirous of returning home from the troubled and crisis ravaged Jos.\nPlateau crisis: Gov Ortom evacuates Benue students“Such persons are enjoined to go to the GUO Motors station in Jos where officials of the Anambra State Liaison office in Abuja will identify them and, in conjunction with GUO Motors management, arrange for their immediate travel.\n“Governor Willie Obiano has directed the State Liaison office in Abuja to monitor round the clock the safety of all Anambra students at the University of Jos, the NTA TV College, Jos, the College of Accountancy, Jos, the School of Forestry, Jos, the National Film Institute, Jos, and the Veterinary Institute, Jos.\nObiano said the safety of every Anambra Indigene, no matter where in the world they may be, is very important to his government."
  },
  {
    "headline": "Don’t marry a man who will buy his mum car before you – Daddy Freeze",
    "summarized_story": "Popular OAP Daddy Freeze has spoken on a yardstick to identifying a man who is a ‘husband material’.\nDaddy Freeze stated when a man tells a woman he intends to marry that he will buy his mom a car first after they get married, that woman should make a run for it.\nAccording to the 45-year-old, if he would rather buy his mom a car instead of his pregnant wife then, such a man isn’t a marriage material.\n“Furthermore, you leave your parents and cleave to your wife as Christ instructed, so once again wife comes before mother.\nA man should buy his mother a car by all means but NEVER at the expense of his wife and children!”"
  },
  {
    "headline": "How military helicopter attacked us in Rivers waterways – victim",
    "summarized_story": "One of the occupants of the wooden cargo boat, which was attacked along the Bonny waterways in Rivers State, by an unidentified military helicopter, has relieved his ordeal.\nA source earlier said the boat took off at the Bonny-Nembe waters in Port Harcourt, insisting there were dead casualties.\nThe source, who spoke in confidence, expressed shock over the incident, explaining that the boat conveyed passengers and foodstuff.\n“We called for a new engine, a new engine was sent to us and we received it at 1pm.\n“It is a market boat and we were carrying food stuff such as garri, beans, rice, drinks, sugarcane”."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Maria admits being attracted to Cross",
    "summarized_story": "Maria has admitted being attracted to fellow housemate Cross.\nMaria made this known during her conversation with Nini and Peace in the executive lounge.\nADVERTISEMENTMaria said: “I would date Cross if he can man up especially with his facial expressions and don’t talk too much.”The former HOH said she cannot date him because of how he talks and makes facial expressions and unsure of how to express this to him.\n“I find him attractive but he just doesn’t know how to talk and that cuts it for me,” she added.\nMaria also mentioned that no male housemate in the BBNaija Shine Ya Eye house can mentally date her outside the reality show."
  },
  {
    "headline": "My attack on Maduagwu wasn’t a stunt – Jim Iyke",
    "summarized_story": "Star actor Jim Iyke has debunked claims that his attack on the fellow actor, Uche Maduagwu was s stunt for his new film, Bad Comments.\nIn a BBB Igbo news interview segment, Iyke said he was angry with the way Maduagwu was going about painting people black.\nRead Also: Jim Iyke gets physical with Uche Maduagwu in viral video“Though many people blamed him for his actions but I also did not behave well as an older brother and a public figure.\nI decided to go on my own to register my displeasure about his actions towards me.”ADVERTISEMENTIyke reiterated that the incident wasn’t a stunt for his film.\n“It wasn’t a stunt for my forthcoming movie."
  },
  {
    "headline": "Panic over pipeline leakage in Lagos",
    "summarized_story": "By Chika AbanobiResidents living around Omoboriowo Street, Pipeline, Bus Stop, located on Igando-Ikotun Road, panicked yesterday morning, took their heels and ran helter-skelter, following pipeline leakage that saw very large volume of premium motor spirit, otherwise known as petrol, gushing out from the big pipe.\nResidents who spoke to journalists claim to have started noticing the leakage from the pipeline belonging to the Nigerian National Petroleum Corporation (NNPC) at about 6am yesterday.\nBut following calls placed by some of the anxious but enlightened residents to concerned authorities helps were immediately sent to the area from Lagos State Emergency Management Agency (LASEMA), LRU (Light Rescue Unit) Fire, Lagos State Fire Service, Nigerian Security and Civil Defence Corps (NSCDC), NNPC, Lagos State Transport Management and Administration (LASTMA) and Lagos Neighbourhood Safety Corps (LNSC).\nSpeaking on the development, Dr. Olufemi Oke-Osanyintolu, Director-General, Lagos State Emergency Management Agency (LASEMA), linked the leakage to petroleum vandals.\n“A very large volume of PMS was gushing out of the NNPC pipeline,” he said."
  },
  {
    "headline": "Kaduna: Bandits free additional 32 Baptist students, withhold 31",
    "summarized_story": "From Sola Ojo, KadunaBandits on Friday’s evening freed additional 32 students of Bethel Baptist High School, Kaduna, Chairman, Christian Association of Nigeria, Kasuna State Chapter, Rev Josephh Hayab confirmed.\nBandits had on July 5, broke into the school located at Damishi along the Kaduna – Kachia highway, Chikun Local Government Area of the state and whisked away 121 students (males and females).\nWith this batch, 90 of them have so far regained their freedom while 31 others are still at the mercy of their abductors.\n“Yes, 32 of them were freed this evening.\nSo, we are trusting God as He has been doing to help us with the remaining 31 if them still on the captivity”, he prayed."
  },
  {
    "headline": "Panic as petroleum pipeline leaks \"uncontrollably\" in Ikotun – The Sun Nigeria",
    "summarized_story": "Panic has gripped residents of Ikotun Egbe, in the Alimosho Area of Lagos as they fear that the leaking NNPC pipeline allegedly punctured by vandals at the early hours of today may finally erupt into an explosion.\nAs at time of writing this report, some residents of the affected areas had fled their abodes to prevent being caught up in any likely inferno.\nConsequently , the Ikotun market was shut as the product was said to be gushing out from some drainages there.\nBut it warned residents in the affected areas not to lit fire, so as to avert imminent danger.\nIts Director, Mrs Adeseye Margaret, explained that the service received a distress call about 3.24 am “to Omoboriowo Street, Pipeline Bus Stop, via Ikotun, Lagos and Firemen from Abesan Fire Station were swiftly mobilized to the scene."
  },
  {
    "headline": "Again, bandits storm Zaria, kidnap 6",
    "summarized_story": "From Noah Ebije, KadunaBandits in the early hours of Friday stormed Zangon Shanu village, near the main campus of Ahmadu Bello University (ABU) Zaria, Kaduna State and kidnapped six persons.\nZangon Shanu is a settlement mostly inhabited by ABU lecturers, staff of Nigerian College of Aviation Technology and Ahmadu Bello University Teaching Hospitsl, Zaria.\nThe attack on the village was coming barely a month when bandits attacked National Tuberculosis and Leprosy Training Centre and Nuhu Bamalli Polytechnic, Zaria and abducted scores of people.\nA resident of the area told our Correspondent that, “the Bandits stormed the area between 12.am and 1.30am on Friday and kidnapped six people, including three men and three women.\nHe said the bandits shot sporadically into the air to scare other residents after which they went away with their victims."
  },
  {
    "headline": "Breaking: Nollywood veteran actor Ifeanyi Dike, is dead",
    "summarized_story": "By Rita OkoyeVeteran actor and chairman, Board of Trustees (BoT), Actors Guild of Nigeria (AGN), Prince Ifeanyi Dike, is dead.\nHe died this (Friday) morning after a brief illness.\nThe handsome actor has been down with kidney ailment since 2011 after which he underwent a successful kidney transplant in India.\nHowever, he passed on today after a reportedly relapse of the ailment.\nAccording to a family source, his burial plans will be made public later."
  },
  {
    "headline": "Breaking: Another 32 Baptist Students Released by Kaduna Bandits",
    "summarized_story": "Thirty-two of the remaining abducted 63 Bethel Baptist students have released.\n“32 of the students have been released this evening, remaining 31 with the bandits,” the CAN chair said.\nHayab said the released students had been reunited with their parents.\nLast Friday, another batch of 15 students were released by the bandits.\nBandits had on July 5 invaded the school and abducted 121 students."
  },
  {
    "headline": "House Minority Caucus Decries FG’s Clampdown on Media",
    "summarized_story": "By Adedayo AkinwaleThe Minority Caucus in the House of Representatives has frowned upon the federal government’s growing clampdown on the media, as well as the lack of professionalism and neutrality on the part of the regulatory agency under the All Progressives Congress (APC)-led government.\nIt said: “The Minority caucus frowns on the growing clampdown on the media as well as the lack of professionalism and neutrality on the part of the regulatory agency under the All Progressives Congress (APC)-led federal government.\n“The Minority caucus points the federal government to the call by the governor of Mr. President’s home state, Hon.\nIn that regard, the caucus noted that the federal government should take steps to reassure the people rather than trying to muffle information.\nAs representatives of the people, the Minority caucus reminded the NBC the need to stick to professionalism and patriotism in the discharge of its duties."
  },
  {
    "headline": "News in Photographs: Niger Gov Receives Freed School Pupils",
    "summarized_story": "THISDAY learnt that an unspecified amount of money was released to the bandits in addition to five new Bajaj Motorcycles .\nThere was contradiction in the number of pupils released.\nWhile Governor Sani Bello claimed “a total of 91 pupils were kidnapped, we received 90, we unfortunately lost one”, the head teacher of the school Alhassan Abubakar said 93 pupils were released.\nBello confirmed also that four of the released pupils “are not okay”.\nThe governor said now that the pupils had been released government will “go after the kidnappers and bring them to justice”."
  },
  {
    "headline": "Detention: Igboho’s Associates Threaten Contempt Proceedings against DSS DG",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court, Abuja had recently issued a warrant for the release of the detainees after they had perfected the bail granted them by his court.\nHowever, it has been alleged that the Director General of the DSS, Mr Yusuf Bichi, have been blocking lawyers from giving effect to the release of warrants since Monday when they were served on him.\nApparently angered by the development, the lawyer to the 12 detained associates, Mr Pelumi Olajengbesi, on Friday, threatened to commence contempt proceedings against Bichi for the agency’s alleged failure to comply with an order of court for the release of his clients.\nOlajengbesi told journalists that his clients had, last week, met the conditions attached to the bail granted them by Justice Egwuatu following which the judge signed their release warrant on Monday.\nHe said despite being served with the release warrant, the DSS has failed to release the detainees, who were arrested during the July 1 raid on Igboho’s Ibadan home by a combined team of men of the DSS and the Nigerian military, and have been detained since then."
  },
  {
    "headline": "Breaking: Abducted Zamfara College of Agriculture Students Regain Freedom",
    "summarized_story": "By Onuminya InnocentThe abducted students of College of Agriculture and Animal Science, Bakura, Zamfara State have regained their freedom.\nThe Governor of the state Muhammad Bello Mutawalle disclosed this to newsmen in Gusau on Friday.\nMutawalle further explained that they were freed through the help of repentant bandits.\nHe said no ransom was paid for their release.\nDetails shortly…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "Femi Adesina: NDA attack deliberately orchestrated to make government look bad",
    "summarized_story": "Femi Adesina, presidential spokesperson, says the recent attack on the Nigerian Defence Academy (NDA) was a deliberate attempt to make government look bad and discourage the military in its fight against insecurity.\nAdvertisementTwo officers were killed and one other officer abducted on Tuesday, when the NDA was attacked by suspected bandits.\nBut Adesina, in a Facebook post on Thursday, said those who undermine the efforts of the military are ungrateful.\n“As President Buhari has said, the NDA attack was meant to throw a dampener into the morale of our military.\n(Proverbs 21:18).’He added that goodwill always overcome evil, and the seeming victory of “those who celebrate evil” can only be temporary."
  },
  {
    "headline": "Femi Adesina: NDA attack deliberately orchestrated to make government look bad",
    "summarized_story": "Femi Adesina, presidential spokesperson, says the recent attack on the Nigerian Defence Academy (NDA) was a deliberate attempt to make government look bad and discourage the military in its fight against insecurity.\nAdvertisementTwo officers were killed and one other officer abducted on Tuesday, when the NDA was attacked by suspected bandits.\nBut Adesina, in a Facebook post on Thursday, said those who undermine the efforts of the military are ungrateful.\n“As President Buhari has said, the NDA attack was meant to throw a dampener into the morale of our military.\n(Proverbs 21:18).’He added that goodwill always overcome evil, and the seeming victory of “those who celebrate evil” can only be temporary."
  },
  {
    "headline": "Three US residents indicted over 'illegal exportation of arms to Nigeria'",
    "summarized_story": "Three residents of Maryland, USA, have been indicted over allegations of exporting arms and ammunition to Nigeria.\nThe suspects — listed as 45-year-old Wilson Nuyila Tita of Owings Mills, Maryland; 40-year-old Eric Fru Nji of Fort Washington, Maryland; andWilson Che Fonguh of Bowie, Maryland, aged 39 — are alleged to have exported arms and ammunition to Nigeria illegally.\n“A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria,” the statement reads.\n“The defendants also allegedly conspired to conceal from the United States that those items were being shipped from the Port of Baltimore in Maryland to Nigeria and at least one other location in Africa.\nThe defendants and their co-conspirators allegedly contributed funds for the purchase of firearms, ammunition, reloading materials and other equipment for shipping overseas."
  },
  {
    "headline": "Three US residents indicted over 'illegal exportation of arms to Nigeria'",
    "summarized_story": "Three residents of Maryland, USA, have been indicted over allegations of exporting arms and ammunition to Nigeria.\nThe suspects — listed as 45-year-old Wilson Nuyila Tita of Owings Mills, Maryland; 40-year-old Eric Fru Nji of Fort Washington, Maryland; andWilson Che Fonguh of Bowie, Maryland, aged 39 — are alleged to have exported arms and ammunition to Nigeria illegally.\n“A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria,” the statement reads.\n“The defendants also allegedly conspired to conceal from the United States that those items were being shipped from the Port of Baltimore in Maryland to Nigeria and at least one other location in Africa.\nThe defendants and their co-conspirators allegedly contributed funds for the purchase of firearms, ammunition, reloading materials and other equipment for shipping overseas."
  },
  {
    "headline": "32 Kaduna Baptist school students regain freedom -- 31 still in captivity",
    "summarized_story": "Bandits have released 32 of the remaining 63 abducted students of Bethel Baptist High School in Damishi, Kaduna state.\nAdvertisementJoseph Hayab, chairman of the Kaduna state chapter of the Christian Association of Nigeria (CAN), confirmed the students’ release on Friday.\nThe Kaduna CAN chairman told TheCable that “32 of the students have been released this evening, remaining 31 with the bandits”.\nHayab said the released students have been reunited with their parents.\nFollowing the release of the 28 students, the bandits were said to have demanded another N80m as ransom for the remaining students."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "6 ways to spice up your YouTube Shorts content",
    "summarized_story": "Share this article:In August 2021, YouTube announced that it would start paying YouTube Shorts creators $10,000 monthly as a reward for creating exciting and engaging content.\nYouTube Shorts lets you add music to your content by tapping the Add Music icon at the centre of the top bar.\nOne way to emphasise your points, spice up your videos, or pass your ideas across better is by adding texts to your Shorts content.\nIt’s not just for owambe food and drinks; it can apply to your Shorts content too.\nAdvertisementFor context, YouTube Shorts launched in September 2020, allowing users to make catchy 60-second videos on their mobile phones."
  },
  {
    "headline": "Dyscalculia and assistive technology, YouTube Shorts Fund, pawaPay’s $9m seed",
    "summarized_story": "YouTube Shorts has launched the YouTube Shorts Fund to help Shorts creators earn money and grow their businesses.\nThe YouTube Shorts Fund will be distributed as a monthly bonus payment to thousands of eligible YouTube Shorts creators between 2021 and 2022 as a reward for delivering innovative and engaging content on the platform the previous month.\nWhat about YouTube Shorts?\nYouTube claims that the Shorts Fund is the first step towards developing a revenue model for YouTube Shorts.\nThe round was led by UK-based seed fund and accelerator, 88mph, and MSA Capital, a Chinese VC firm."
  },
  {
    "headline": "Tizeti is testing a next-gen technology that could bring 5G-level speeds to Nigeria",
    "summarized_story": "Ananyi explains that the new speeds will be built on the WiGig infrastructure known as 60 GHz Wi-Fi, next-generation technology on par with 5G technology.\nIn 2013, the WiGig Alliance merged with the Wi-Fi Alliance, but the 60 GHz Wi-Fi retained the name WiGig.\nPer Internet World’s Stats’ December 2020 report, Nigeria has a 73% Internet penetration rate with up to 154 million Internet subscriptions.\nWith a presence in four Nigerian states and Accra, Ghana, Tizeti says it has over 10,000 voice lines and two million Internet users.\nWhile the NCC’s 5G auction seems to be some months away, Tizeti’s next-gen technology might just open the floodgates for more innovators in Nigeria’s Internet space."
  },
  {
    "headline": "OPay: From Telnet to Africa’s biggest unicorn",
    "summarized_story": "Today, Zhou Yahui, the Chinese billionaire owner of Opera, may have the title of founder/CEO of OPay, but the roots of the company trace back to Telnet, a digital transformation company.\nFounded in 1985, Telnet, which occupies a wing of a white duplex located at Kofo Abayomi, Lagos Island, does not have the flashy neon…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria far from local aircraft production",
    "summarized_story": "The Federal Government recently expressed its readiness to partner the Magnus Aircraft Manufacturing industry in Hungary to establish an assembling plant and begin to manufacture in Nigeria from start to finish before the end of the Buhari administration.\nHowever, concerns have been raised as to how ready Nigeria is to commence production of aircraft considering…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria economy yet to heal after highest GDP growth since 2014",
    "summarized_story": "Nigeria economy yet to heal after highest GDP growth since 2014Nigeria’s economy expanded at the fastest pace since 2014 in the second quarter of 2021, but does not count for much given the economy has only profited from the easing of COVID-19 restrictions that curbed economic activity last year.\nFailure to implement long standing reforms that would open the economy to more private capital while…"
  },
  {
    "headline": "Edo govt alerts residents on sale of fake entrance forms into College of Nursing Sciences – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has alerted residents to the activities of fraudsters circulating fake entrance forms into the Edo State College of Nursing Sciences.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie Esq., disclosed that the government has not commenced the sale of entrance/admission forms into the college, noting that sale of such forms will be duly publicized through the appropriate channels.\nThe statement reads: “It has come to the attention of the Edo State Government that some persons, in a bid to defraud unsuspecting members of the public, have resorted to putting on sale fake entrance forms into the Edo State College of Nursing Sciences.\n“Government therefore wishes to put all interested candidates, as well as the general public on notice, that the Edo State College of Nursing Sciences has not commenced sales of Entrance/Admission Forms.\n“For the avoidance of doubt, sale of entrance/admission forms into the College will be duly publicized through the appropriate channels, namely the official website of the Edo State Government on https://www.edostate.gov.ng and the Print and Electronic Media on commencement of the process.”“Government hereby reiterates the need to avoid dealing with any person purportedly acting as an agent to the Ministry of Health or the College of Nursing Sciences in respect of the sale of entrance/admission forms into the College,” Ogie noted."
  },
  {
    "headline": "Health, environment, safety top agenda as Edo Marks 30th anniversary – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said that the state government will continue to make investment in preserving the health, safety and environment of Edo people as the state marks its 30th anniversary.\nObaseki said this during the flag-off a tree-planting campaign held at Idu village in Orhionmwon Local Government Forest Reserve, as part of activities to mark the 30th anniversary of Edo State.\nIt is for this reason that we, collaborating with private stakeholders, have embarked on a reforestation program to have ten million trees planted in Edo State, over the next decade.\n“As we celebrate Edo at 30 today, our emphasis and focus must be on environmental sustainability.\nWe have continued to invest in our youth through various programs spearheaded by the Edo Skills Development Agency (EdoJobs), which has given birth to numerous enterprises in the Edo Production Centres, Edo Tech Hub and Edo Creative Hub."
  },
  {
    "headline": "COVID-19 3rd wave: Edo records one more death, 45 new cases, vaccinates over 7200 persons in 48 hrs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo has continued to record more deaths of persons who have not been inoculated with the COVID-19 vaccines, as the state recorded another COVID-19-related death, bringing the total number of fatalities to 8.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nHe said the state in the last 48 hours vaccinated over 7200 persons, following the flag-off of the second phase vaccination exercise across the state by Governor Obaseki.\nAccording to him, “Edo State, in the last 24 hours, recorded 45 new COVID-19 cases, 10 recoveries, and one more death.\nThe new death, also an unvaccinated person, brings the total number of fatalities recorded in the third wave of the pandemic to 8."
  },
  {
    "headline": "Agbor-Uromi road: Motorists, commuters appeal for Gov Okowa intervention – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAgbor – Residents, motorists, and commuters plying the Agbor-Uromi road have continued to groan over difficulty to pass through the Agbor/Igbanke section of the road, in Ika-South local government area of Delta State.\nThe Trunk A national road which link Edo, to and from other states in Nigeria has been rendered unpassable due to flood water from Agbor-Obi area and environ that finds it way beside Agbor Technical College to the road.\n“once the heavy erosion carry red sand enter the road; any motor enter, e go magnet am there.\nThose wen dey come from Port Harcourt go hang, unless dem dey go straight to Asaba side.\nEven the gutters wen suppose channel the water go river don block”, owner of a mechanic workshop adjacent the Agbor Technical College narrated in Pigin English."
  },
  {
    "headline": "Release alleged ESN ‘spy’ girl or charge her to court, judge orders police",
    "summarized_story": "The Federal Capital Territory (FCT) High Court in Abuja, on Friday, gave the Nigerian police an ultimatum to either charge Glory Okorie, an alleged spy for the Eastern Security Network (ESN), to court or release her.\nDetained without charge since her arrest, the suspect has now been in illegal custody for 71 days as of Friday.\nIn the alternative to the order directing the police to charge the suspect, the court ordered the respondents to release Miss Okorie on bail in the sum of N2million with a surety.\n“If the applicant is not charged to court as aforesaid, the respondents are ordered to release her on bail upon fulfilment of the following conditions.\nHe had urged the court to order the release of Miss Okorie on bail from unlawful incarceration by the police for over two months."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Zenith Bank proposes N9.42bn interim dividend for half year 2021",
    "summarized_story": "Zenith Bank Plc has proposed to pay the total sum of N9.42 billion as interim dividends to its shareholders for the half year period ended 30th of June, 2021.\nThe interim dividend will be paid electronically to shareholders on the 20th of September, 2021, subject to appropriate withholding tax.\nShareholders must have completed the e-dividend registration and must have mandated the Registrar (Veritas Registrar Limited) to pay their dividends directly into their bank accounts.\nTo facilitate the payment, the financial giant noted that its register of shareholders will be closed on 13th of September, 2021.\nZenith had declared a half year profit of N106.12 billion in HY 2021, indicating a slight increase of about 2.2% YoY."
  },
  {
    "headline": "Tottenham face Rennes, Mourinho’s Roma get CSKA in Europa Conference League",
    "summarized_story": "English Premier League side, Tottenham Hotspur will play Rennes, Vitesse Arnhem and Mura of Slovenia in the group stage of the inaugural Europa Conference League following Friday’s draw in Istanbul.\nSpurs, who are the sole English representative after finishing seventh in the Premier League last season, could probably not have got a tougher draw in the new, third-tier competition, AFP reported.\nTottenham qualified for the group stage by beating Pacos de Ferreira of Portugal 3-0 on Thursday for a 3-1 aggregate victory, with Harry Kane scoring twice.\nRennes, who came sixth in Ligue 1 last season and have spent 50 million euros ($58.8m) on new signings this summer, defeated Rosenborg of Norway to make it through.\nThe group stage will begin on September 16 and the final will be held in the Albanian capital Tirana on May 25 next year."
  },
  {
    "headline": "Open Grazing: Hope Uzodinma has betrayed Igbo race – ADF",
    "summarized_story": "“We therefore advise him to quickly go for spiritual cleansing before he can be seen as a normal member of the Igbo race,” ADF further noted.\nIt is needed and intended to protect the Igbo race and safeguard her ancestral lands.\nSo, for any Igbo Governor or person for that matter to renounce the anti-open grazing law is a pointer that he subscribes to the wiping out of the Igbo race from existence.\n“Whether the present Imo state Legislature takes action to preserve the Constitutional order order in Imo State or not, Imo state cannot claim to have a legitimate Executive Governor in the present circumstances.\n“May the Almighty God protect and preserve the people of Imo state and return a Constitutional order to their besieged state.”"
  },
  {
    "headline": "Secondus resumes as PDP chairman as Elder Akinwomi hands over",
    "summarized_story": "The National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Friday took over the affairs of the party.\nPrince Secondus who was obeying the purported experte order of a Degema High Court in Rivers State had stayed away but got reinstated after a Kebbi High Court presided over by Justice Nasirat.i.\nSequel to that Prince Secondus who had stayed away even though not served resumed and the Deputy National Chairman South, Elder Yemi Akinwomi who held forth in his absence upon receipt of the new Court order handed over to him.\nAt the brief handover , Prince Secondus pledged to continue providing astute leadership to the party.\nElder Akinwomi also announced his receipt of the court order which he presented to the caucus meeting."
  },
  {
    "headline": "Police Kill Suspected IPOB/ESN Leader, Others, Recover Explosives In Imo",
    "summarized_story": "The Imo State Police Command yesterday said its operatives killed the gang leader of suspected IPOB/ESN and several others in their camp at Akata, Oru East LGA who were planning to attack police formations and government installations.\nIn a release made available to LEADERSHIP Weekend signed by the spokesman, Michael Abattam, this was made possible by the command’s Special Forces.\nThe statement said the operation was sequel to credible information by the command’s intelligence unit revealing that some bandits suspected to be IPOB/ESN terror groups were seen mobilizing to attack police formations and government installations in the state from their camp located at Akata in Oru East LGA of Imo State."
  },
  {
    "headline": "Police Kill Suspected IPOB/ESN Leader, Others, Recover Explosives In Imo",
    "summarized_story": "The Imo State Police Command yesterday said its operatives killed the gang leader of suspected IPOB/ESN and several others in their camp at Akata, Oru East LGA who were planning to attack police formations and government installations.\nIn a release made available to LEADERSHIP Weekend signed by the spokesman, Michael Abattam, this was made possible by the command’s Special Forces.\nThe statement said the operation was sequel to credible information by the command’s intelligence unit revealing that some bandits suspected to be IPOB/ESN terror groups were seen mobilizing to attack police formations and government installations in the state from their camp located at Akata in Oru East LGA of Imo State."
  },
  {
    "headline": "MAKING IT, SPENDING IT: MAKE OR MAR MONEY CHOICES",
    "summarized_story": "Educational books have recorded the highest sales in-country, while books in other categories are struggling to get patronage.\nTo this end, most booksellers and bookshops have included stationeries into the business, to balance the profit margin.\nThen, I was selling primary and secondary textbooks and overtime, I started selling computer accessories like printer inks, A4 Papers and office equipment.\nChallengesEze notes that the major challenge he faces in his business is late payment for the supply of books, textbooks and office equipment from schools and companies.\n“One issue I always have when I make supplies of books and utensils to schools or office equipment to companies, is that we don’t get our money when due."
  },
  {
    "headline": "MAKING IT, SPENDING IT: MAKE OR MAR MONEY CHOICES",
    "summarized_story": "Educational books have recorded the highest sales in-country, while books in other categories are struggling to get patronage.\nTo this end, most booksellers and bookshops have included stationeries into the business, to balance the profit margin.\nThen, I was selling primary and secondary textbooks and overtime, I started selling computer accessories like printer inks, A4 Papers and office equipment.\nChallengesEze notes that the major challenge he faces in his business is late payment for the supply of books, textbooks and office equipment from schools and companies.\n“One issue I always have when I make supplies of books and utensils to schools or office equipment to companies, is that we don’t get our money when due."
  },
  {
    "headline": "Again, Bandits Kill 14 In Kaduna, Katsina, Abduct 6",
    "summarized_story": "Bandits again attacked Dan-Kumel community in Kankara local government council of Katsina State, killing about 11 villagers.\nThe lawmaker asked President Buhari to take a cue from United State President Joe Biden who makes it a daily duty to brief Americans on the fate of US citizens still trapped in Afghanistan.\nAlso speaking on the Tuesday attack on the Nigerian Defence Academy (NDA) in Kaduna State by bandits, Ndume said the incident was unfortunate and confirmed how daring the bandits have become.\nHowever, this is the only time that the bandits have the audacity to take their fight to a military training institution.\nThis is despite the worsening insecurity which resulted in the recent attack on the Nigerian Defence Academy, Kaduna."
  },
  {
    "headline": "Killings: Defend yourselves, Plateau Assembly orders residents",
    "summarized_story": "Following the series of attacks by gunmen in various communities in Plateau State which have led to the killings of many people and destruction of their properties, the state House of Assembly has called on residents to defend themselves.\nThe House also gave Governor Simon Lalong two weeks to address the security challenge in the state.\n“The House condemns all these killings in totality, all these killings are unacceptable and condemnable.\n“We strongly call on Plateau people to practically stand up and defend themselves and their communities, as the conventional security design is no longer guaranteeing our safety as a people.\n“We call on the Executive Governor of Plateau State, Rt."
  },
  {
    "headline": "Killings: Defend yourselves, Plateau Assembly orders residents",
    "summarized_story": "Following the series of attacks by gunmen in various communities in Plateau State which have led to the killings of many people and destruction of their properties, the state House of Assembly has called on residents to defend themselves.\nThe House also gave Governor Simon Lalong two weeks to address the security challenge in the state.\n“The House condemns all these killings in totality, all these killings are unacceptable and condemnable.\n“We strongly call on Plateau people to practically stand up and defend themselves and their communities, as the conventional security design is no longer guaranteeing our safety as a people.\n“We call on the Executive Governor of Plateau State, Rt."
  },
  {
    "headline": "Cristiano Ronaldo returns to Man United after 12 years",
    "summarized_story": "Manchester United legend, Cristiano Ronaldo, Friday, completed a sensational return to the club where he shot into limelight in a deal that attracts a payment of €15 million and €8 million in add-ons to Juventus.\nManchester City who were initial favorites to sign the forward pulled out of the deal paving way for the 5-time Ballon d’Or winner to rejoin United.\nConfirming the news on its website, the club wrote, ““Manchester United is delighted to confirm that the club has reached agreement with Juventus for the transfer of Cristiano Ronaldo, subject to agreement of personal terms, visa and medical.\n“In his first spell for Manchester United, he scored 118 goals in 292 games.\n“Everyone at the club looks forward to welcoming Cristiano back to Manchester.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Cristiano Ronaldo returns to Man United after 12 years",
    "summarized_story": "Manchester United legend, Cristiano Ronaldo, Friday, completed a sensational return to the club where he shot into limelight in a deal that attracts a payment of €15 million and €8 million in add-ons to Juventus.\nManchester City who were initial favorites to sign the forward pulled out of the deal paving way for the 5-time Ballon d’Or winner to rejoin United.\nConfirming the news on its website, the club wrote, ““Manchester United is delighted to confirm that the club has reached agreement with Juventus for the transfer of Cristiano Ronaldo, subject to agreement of personal terms, visa and medical.\n“In his first spell for Manchester United, he scored 118 goals in 292 games.\n“Everyone at the club looks forward to welcoming Cristiano back to Manchester.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "PDP crisis: Secondus kicked out as Akinwonmi presides over caucus meeting",
    "summarized_story": "The embattled National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, was on Friday prevented from presiding over the meeting of the party’s National Caucus.\nInstead, Elder Yemi Akinwonmi presided over the meeting as Acting National Chairman.\nThe National Caucus is made up of members of the Board of Trustees (BoT), the National Working Committee (NWC), the PDP Governors Forum and National Assembly members.\n“Coincidentally, I showed the BoT chairman the letter and he said that he received it too, meaning that the letter was served on me and the BoT chairman”.\nAkinwonmi made to read the content of the letter but members were not ready for it as they signaled for the meeting to commence."
  },
  {
    "headline": "Breaking: Police kill head of IPOB/ESN, scores of others in raid.",
    "summarized_story": "The first shootout occurred when the police stormed the ESN camp at Akata in Oru East Local Government Area.\nIn the exchange of fire, the head of the IPOB/ESN group and scores of others were neutralised, police said.\nIPOB/ESN members retaliated, when the police claimed they ambushed their vehicles returning from the raid.\nCommissioner of Police, Hussaini Rabiu immediately, dispatched the command’s Special Forces and tactical teams to dislodge the ESN members from the camp.\nPolice spokesman CSP Michael Abattam, said when the police team got to the camp, members were attacked by the ESN members."
  },
  {
    "headline": "Representatives of GAAMAC's Africa Working Group meet in Abidjan",
    "summarized_story": "On September 1 and 2, 2021, the six Regional Focal Persons of the Global Action Against Mass Atrocity Crimes’ (GAAMAC) Africa Working Group (G-AWG) will gather in Grand Bassam, Abidjan, Côte d’Ivoire for a two-day retreat to be chaired by Justice Jamila Mohammed.\nThe GAAMAC’s Africa Working Group (G-AWG)will prepare the ground for GAAMAC IV Global Meeting and discuss priorities of the G-AWG for2022-2023.\nJustice Jamila Mohammed is the Chairperson of the Kenya National Committee on the Prevention and Punishment of Genocide, War Crimes, Crimes Against Humanity and All Forms of Discrimination.\nIt encourages and supports locally owned initiatives and is complementary to existing regional prevention efforts.”Dr. Wale Adeboye, Anglophone West Africa focal person for G-AWG and also the Founder West Africa Responsibility to Protect Coalition (WAC-R2P) would provide atrocity crimes prevention perspectives on Nigeria and English West Africa for the delegation.\nThey will explain how G-AWG may support national atrocity prevention architectures and policies in Africa."
  },
  {
    "headline": "32 Bethel Baptist High School Students Regain Freedom",
    "summarized_story": "Today, 32 pupils from Bethel Baptist High School in Damishi, Kaduna State, were released from the clutches of suspected bandits.\nRemember that around 100 pupils were kidnapped from Bethel Baptist High School in Damishi, Kaduna, on Monday, July 5, 2021.\nSome of the students had been released previously, while others had regained their freedom due to health concerns.\nJohn Joseph Hayab, confirmed the students’ release today, but added that 31 students remain in the hands of their kidnappers.\nHayab, “We should continue to pray for the remaining students, believing that one day, they too will be released to us."
  },
  {
    "headline": "Get Ready For Mass Protest – Yoruba Nation Agitators Warn Southwest Govs Over Grazing Reserves",
    "summarized_story": "Yoruba Nation activists and other self-determination activists have promised to stage “never-seen-before mass demonstrations” in any Southwest state that authorizes grazing reserves.\nThe secessionist group, under the umbrella of the Nigerian Indigenous Nationalities Alliance for Self-Determination, made this known on Friday in a statement titled, “Governors in the Southern Region that welcome FG’s Grazing Reserves should prepare for a never-seen-before mass action”.\n“For the avoidance of doubt, under the Land Use Act of 1978, all lands in Nigeria vest in State Governors who hold the same in Trust for the People.\nWith the possible exception of the Federal Capital Territory, the Federal Government of Nigeria does not own any land upon which it can establish grazing routes.\n“We say with all sense of modesty and responsibility that the grazing route is an attempt towards grabbing our ancestral land through the back door which must be rejected by all means necessary."
  },
  {
    "headline": "Gov. Emmanuel Pays Tribute To Prelate Mbang At 85",
    "summarized_story": "The Governor stated this while speaking at the 85th birthday celebration and launch of Prelate Mbang’s memoir titled “My Life and Times” published by Olusegun Obasanjo Presidential Library Publishing, held at the Naval Dockyard in Lagos.\nThe event attracted many dignitaries across the country.\nFormer President Chief Olusegun Obasanjo, who was Chairman, Planning Committee for the event, appreciated Governor Udom Emmanuel for respecting and celebrating the octogenarian, describing Mbang as a man who has never been afraid to speak truth to power.\nEarlier in a special birthday message titled, “85 Hallelujah Cheers to a man of Moral Heft and Christ-like Virtues, Governor Emmanuel on behalf of the State congratulated Mbang for clocking 85.\nAs you turn 85 today, my prayer is that God Almighty, who has kept you through these years, will continue to bless and nourish you with more robust health and a sound mind”, the statement read."
  },
  {
    "headline": "Shoot Overloaded Motorcycles Evading Search, Matawalle Orders Security Operativs In Zamfara",
    "summarized_story": "Bello Matawalle, the governor of Zamfara State, has ordered the military, police, and other security services to shoot on any overloaded motorcycle that refuses to stop for a search.\nThe Governor gave the instruction to security agencies when he received the students of College of Agriculture and Animal Science Bakura, who were freed by their abductors in the early hours of Friday, saying that taking the decision became necessary considering the rate at which insecurity has ravaged the state currently.\nMatawalle noted that the new security measures put in place are to allow for the security operatives to be able to carry out their constitutional responsibility of securing lives and properties of the people of the state.\nThe Governor however warned that the security operatives should ensure full enforcement of the directive and insisted that his government would not take it lightly with any security operative who compromises in the implementation of the new order.\nHe assured that his administration would not relent in its effort to ensure peace and security of lives and properties."
  },
  {
    "headline": "Cholera: Fear, anxiety mount over rising deaths",
    "summarized_story": "The Nigeria Centre for Disease Control, (NCDC) said the country had recorded 37,819 suspected cases of cholera, 1,178 deaths in 23 states and the FCT as at August 14, 2021.\n“The Federal Ministry of Health reported 37,289 cases and 1,434 deaths between January and October 2010, while a total of 22,797 cases of cholera with 728 deaths and case-fatality rate of 3.2% were recorded in 2011.\nHe said there is little or no awareness of good hygiene practices in most parts of the country fuels Cholera.\n“No doubt the ongoing strike by medical doctors is affecting the response to the ongoing response to the outbreak of Cholera.\n“As you are aware, Nigeria is currently experiencing a cholera outbreak in several parts of the country with reported cases of fatalities."
  },
  {
    "headline": "Pictures: Veteran actress, Rachel Oniga, laid to rest amidst tears",
    "summarized_story": "The funeral service for the late Nollywood veteran actress, Rachel Oniga, was held on Friday in LagosThe actress who died on July 31st after battling a heart-related disease is currently taking place in Lagos.\nA service of songs was held in her honour at the Catholic Church of Resurrection, Magodo, Lagos state, Thursday, August 26.\nThe late actress is from Eku, Delta State in Southern Nigeria, she was born on May, 23 1957 in Ebute Metta, Lagos State.\nUntil her death, She began her acting career in 1993, starred in a number of successful Nollywood movies and she was loved in the community.\nShe worked briefly at Ascoline Nigeria Limited, a Dutch Consultant Company before her first movie titled Onome and her debut Yoruba movie was Owo Blow."
  },
  {
    "headline": "Breaking: 2 veteran actors dead in less than 24 hours",
    "summarized_story": "Two veteran nollywood actors Ifeanyi Dike and Victor Olaotan have passed on.\nWhile Dike died on Friday morning, Olaotan was confirmed dead on Thursday evening.\nDike has been down with kidney illness since 2011 after which he underwent a successful kidney transplant in India.\nJulia and some other ace actors had been soliciting support on Olaotan’s behalf.\nJulia, who often spoke with her husband via video calls, had said whenever they spoke, she could see that he was “fighting for his life”."
  },
  {
    "headline": "Stella Oduah dumps PDP, joins APC -NigPilot",
    "summarized_story": "Former Minister of Aviation in the administration of President Goodluck Ebele Jonathan and a serving Senator, Princess Stella Oduah-Ogiemwonyi , has dumped the People’s Democratic Party (PDP) and joined the ruling All Progressives Congress (APC) in Abuja.\nThe APC governorship candidate in the November 2021 election, Senator Andy Uba was at the occasion.\nShe is the latest of high profile members of the former ruling party who joined the APC recently.\n“You will enjoy the privileges enjoyed by all members of the party because you will have a waiver,” Bunu said.\nShe said during the occasion that she joined the APC family as part of the process of the changing political narrative in the South East, and assured that she joined the APC along with her multitude of supporters who have been jubilating in Anambra State."
  },
  {
    "headline": "Digitalization: APC set to go ‘paperless’ – Buni -NigPilot",
    "summarized_story": "The ruling All Progressives Congress, APC, is set for serious digitization and digital transformation of its operations.\nThings are changing and digital technology is becoming a source of inspiration for us to do what we do better.\n” We can use technology to enhance our processes, services and also to deliver our traditional services more efficiently and transparently.\nLikewise, we can use technology to bring new things to our party.\nZainab Marwa, Charles Nkata, Imaan Sulaiman-Ibrahim, OWOLABI Olusegun Awosan, Nasiru Danu, Princess Nse Ekpo and Osayi Ejiga"
  },
  {
    "headline": "Anambra Guber: Collapse your structure for APC, Okechukwu tells APGA -NigPilot",
    "summarized_story": "Therefore, I implore you to kindly consider the fruit in APGA joining APC to win the Anambra governorship.\nIn 2017, President Muhammadu Buhari restored Governor Obiano’s security details on the APC governorship campaign ground.\nIn 2019, Obiano led APGA to reciprocate the grand political gesture of understanding by Mr. President.\n“Gentlemen, would it not make for a greater political impact and success, if APGA consummates what its leaders started right from 2014 by embracing APC in a closer embrace?\nThey should show patriotism and respect for the campaign for Nigeria President of Igbo extraction by joining the mainstream, which APC’s victory in the governorship poll will enhance,” Okechukwu contended."
  },
  {
    "headline": "2023 Presidency: APC should jettison zoning, focus on competence, acceptability – Monidafe -NigPilot",
    "summarized_story": "One of the prominent aspirants for the position of the national chairman of All Progressives Congress, APC, Mr Sylvester Monidafe , has advised his party to put aside the issue of zoning but rather focus on competence, acceptability, and sellability, as criteria to select his flagbearers for the 2023 general elections.\nMonidafe, who gave the advice while speaking with journalists at the national secretariat of APC, said he was aspiring to lead the party because he would bring something unique to the party, one of which he said was his experience of running a party from local government level to national level.\nThe party chieftain noted that the country was on the edge and needed someone with his political capital to save the nation from the precipice, which has to start from reinventing the ruling party."
  },
  {
    "headline": "Another 32 Bethel Baptist School Students Regain Freedom",
    "summarized_story": "Another 32 students out of the 63 remaining abducted students of Bethel Baptist school in Chikun Local Government area of Kaduna State have regained their freedom.\nAlthough the Kaduna State Government and police authorities are yet to confirm the development, a top official of Baptist School told Channels Television that the students regained their freedom on Friday.\nThe kidnappers had on July 5 attacked the school and took away 121 students from their hostels.\nAt least 90 of the students have now regained their freedom while 31 remain in captivity.\nMost of the victims have since returned after their families paid ransom to the gunmen, but some are still in captivity."
  },
  {
    "headline": "Abducted Zamfara College Students Regain Freedom",
    "summarized_story": "The abducted students of the College Of Agriculture and Animal Science Bakura, Zamfara State, have regained their freedom, 12 days after gunmen whisked them away from the institution.\nAccording to Governor Bello Matawalle, the students were released on Friday through the help of some repentant bandits.\n“Today, based on our dialogue and reconciliation, we used the repentant bandits to secure the release of these students,” he said.\nThey are out day and night to make sure that they convinced those criminals to release those students and their teachers.\nUpon receiving the students on Friday, Governor Matawalle, however, said that no ransom was paid for their release."
  },
  {
    "headline": "PHOTOS: Freed Islamiyya Students Arrive At Niger State House",
    "summarized_story": "Ninety-three students of an Islamic seminary who were recently freed after three months in the den of kidnappers have arrived at the Niger State Government House.\nUpon arrival, they were greeted by their parents and government officials, all cheerful for their safety.\nRead Also: Gunmen Free 93 Islamiyya Students Three Months After AbductionThe gunmen had abducted the students from their school in Rafi Local Government Area of Niger State on May 30.\nA few days later, they demanded a ransom of ₦110 million and threatened to kill the victims but 11 of them were released hours later, according to the Niger State Government.\nThe governor of the North-Central state, Sani Bello had earlier ruled out the option of paying a ransom to the abductors."
  },
  {
    "headline": "Unidentified Helicopter Shoots Passenger Boat In Rivers",
    "summarized_story": "At least one person is reportedly in a critical condition after a yet-to-be-identified helicopter shot at a passenger boat along the Port Harcourt – Bonny waterway in Rivers State on Thursday night.\nAn eyewitness told Channels Television that the wooden boat was ferrying traders and their goods from Port Harcourt to Bonny when it was targeted by the unidentified helicopter.\nNo security agency has claimed responsibility and the police are yet to make any comment regarding the incident.\nMeanwhile, drivers along the waterway have demanded a thorough investigation into the incident.\nAccording to them, the fear of their safety on the high seas has now been compounded with the recent incident."
  },
  {
    "headline": "Nigeria Will Continue To Exist As A Nation – Obasanjo",
    "summarized_story": "﻿Despite calls for secession, former President Olusegun Obasanjo has said that Nigeria will continue to exist as a nation.\nWhile noting that some forces don’t want to see the country’s continued co-existence, Obasanjo said those people would continue to fail.\nREAD ALSO: Nigerians Are Unbreakable, Do Not Hate Each Other – OsinbajoHe added that the cost of staying together as a nation is cheaper than the cost of dividing Nigeria.\n“Whatever happens, we will continue to work for the unity, peace, security and progress of this country,” he said.\n“Nigeria will continue to exist because the cost for us for Nigeria not to continue to exist is much more than the cost for us to make Nigeria to continue to exist."
  },
  {
    "headline": "We Don’t Want Experience Of Boko Haram In Northwest – Maj. Gen. Uwem",
    "summarized_story": "The Nigerian Army in collaboration with the police force said they are committed to ensuring the northwest zone does not experience the type of insurgency that has raged the north eastern part of the country for yearsThe Force Commander Joint Taskforce Operation Hadarin Daji Northwest zone Major General Uwem Bassey said with the existing collaboration between sister agencies, citizens can now sleep with their two eyes closedThe General officer Commanding eight division Nigerian Army Sokoto who doubles as the Commander joint task force and his entourage were received by a Guard of Honor at the Zamfara state Police CommandThe aim of the visit is to strengthen Interagency collaboration with the police to rid the northwest zone of criminalityOperation Hadarin Daji was established to keep peace in all trouble areas of Katsina, Zamfara, Sokoto and Kebbi statesAdvertisementThe Taskforce Commander Major General Uwem Bassey adds that the four states under his watch will soon experience lasting peaceOn his part, the commissioner of police Zamfara state Command Ayuba Elkanah asured his guests of continued synergy in curtailing the menace of Banditry and other forms of criminalityHe appealed to communities within banditry affected states to continue to collaborate with security operatives by giving them useful and timely information on activities of criminal elementsCP Elkanah further enjoin communities to expose criminals in their domainThe two Senior officers enjoin troops in the four affected states to redouble efforts to bring the activities of bandits and kidnappers to a haltAdvertisementThe General officer Commanding eight division Nigerian Army Sokoto was accompanied by the commandant one Brigade Gusau.\nThe assurances by the senior officers to rid the northwest zone of banditry is coming a few days after the Zamfara state Governor Bello Matawalle called on president Muhammadu Buhari to declare a state of emergency on security in Northern Nigeria."
  },
  {
    "headline": "32 More Bethel Baptist College Students Regain Freedom",
    "summarized_story": "Thirty-two more students abducted from Bethel Baptist College in Kaduna state have regained their freedom.\nDetails about their release are still sketchy, but sources say the students have been handed over to their parents.\nThe Kaduna state government and police authorities in the state are yet to comment on this development.\nAdvertisementThe students are part of 121 students who were abducted form the Bethel Baptist College in the Maraban area of Kaduna metropolis 5th July.\nThe latest development brings the number of students who have regained their freedom after the July incident to ninety."
  },
  {
    "headline": "Oil Marketers call off 3-Day old Strike in Imo",
    "summarized_story": "The Association of Oil Marketers in Imo State has suspended it’s three day old strike following Intervention of stakeholders in the State.\nThe Association however gave the state government two weeks to resolve all lingering issues raised by association."
  },
  {
    "headline": "Nigeria: Bandits Release 32 Bethel Baptist Students in Kaduna after Ransom Paid, 31 Still Held Captive",
    "summarized_story": "Thirty-two of the remaining sixty-three abducted students of Bethel Baptist High school, Damishi, in Nigeria’s northern Kaduna state have been released from captivity.\nThe chairman of the Christian Association of Nigeria, Kaduna state chapter, Joseph Hayab confirmed this to ARISE News.\nHe said the students were released Friday evening and have reunited with their parents.\nAn undisclosed sum of money was paid before their release.\nThe remaining students still In captivity are now thirty-one."
  },
  {
    "headline": "UK Donates Additional 592,880 Covid Vaccine Doses to Nigeria",
    "summarized_story": "The United Kingdom (UK) has donated another 592,880 COVID-19 vaccine doses to Nigeria, bringing the total to 1,292,640 doses given to the African country by the European country in August alone.\nThe UK has pledged to share 80 million doses of COVID-19 vaccines with the COVAX Facility, as part of a broader pledge to share 100 million doses with the rest of the world.\nThe statement read: “Today (Friday), Nigeria received another 592,880 doses of the AstraZeneca-Oxford COVID-19 vaccine donated to Nigeria by the UK via the COVAX Facility.\nThis brings the total number of COVID-19 vaccine doses donated to Nigeria from the UK through COVAX to 1,292,640 doses in August alone.\nI am so pleased to see Nigeria receive an extra 592,880 doses donated by the UK, which brings the total this month to 1,292,640 doses."
  },
  {
    "headline": "Galaxy Z Fold 3 and Z Flip 3: Samsung’s Revolutionary Foldable Phones",
    "summarized_story": "Samsung Electronics has opened the next chapter in foldable innovation with Galaxy Z Series, which Samsung users have come to love and cherish.\nStephen Okwara, a software engineer and tech trainer, is Key Account Manager at Samsung West Africa.\nHe joined the Morning Show on Friday to speak about the Samsung Galaxy Z Fold3 and Z Flip3.\nBoth give users unique new ways to work, watch, and play.\nAs proud pioneers of the foldable smartphone category, the company has vowed to continue building on the legacy of innovation to shape the future of mobile phone industry globally."
  },
  {
    "headline": "Man United in Advanced Talks to Sign Juventus Forward Cristiano Ronaldo",
    "summarized_story": "Manchester United are in advanced talks to sign Portugal captain Cristiano Ronaldo from Juventus.\nUnited boss Ole Gunnar Solskjaer said Ronaldo “knows that we are here” during a press conference on Friday.\nRonaldo signed for Manchester United from Sporting Lisbon for £12.2m in 2003 and scored 118 goals in 292 appearances for the club.\n“I didn’t think Cristiano was going to turn out leaving Juventus,” Solskjaer said.\nSpeaking before City face Arsenal in the Premier League on Saturday, manager Pep Guardiola said: “Cristiano is a Juventus player."
  },
  {
    "headline": "Nigeria: Following Court Judgement, Secondus Returns as PDP National Chairman",
    "summarized_story": "Uche Secondus on Friday took over as the National chairman of the Peoples Democratic Party, PDP.\nThe embattled National Chairman had obeyed an experte order of a Rivers State High Court that sacked him, but got reinstated after a Kebbi State High Court presided over by Justice Nasirat.i.\nMedia adviser to Mr Secondus, Ike Abonyi in a statement said the Deputy National Chairman South, Yemi Akinwomi who held forth in his absence upon receipt of the Court order handed over the affairs of the party him.\nThe statement read in part, “at the brief handover, Prince Secondus pledged to continue providing astute leadership to the party.\n“Elder Akinwomi also announced his receipt of the court order which he presented to the caucus meeting.”By Abel Ejikeme"
  }
]