[
  {
    "headline": "FG launches new electronic passport in UK",
    "summarized_story": "The Federal Government on Tuesday launched a new enhanced electronic passport to improve passport application process for Nigerians at home and in diaspora.\nThe statement was titled, “FG launches Enhanced Passport In The UK”It partly read, “What we have come to do here is symbolic of the core mandate of the Ministry of Interior and indeed, the Federal Government of Nigeria – affirmation of citizenship integrity.\n” The Nigerian passport is the highest affirmation of Nigerian citizenship.\nIt is therefore our responsibility to provide the passport without any stress, within a reasonable period.\n“As we are all aware, there have been huge challenges to passport administration, from shortage of booklet to touting and an economy of corruption built around it."
  },
  {
    "headline": "N2.3tn was spent as stimulus package for COVID-19 — FG",
    "summarized_story": "The Minister of State for Budget and National Planning, Prince Clem Agba said the Federal Government spent more than N2.3trillion as a stimulus package to cushion the effects of the COVID-19 pandemic.\nHe said that the fiscal and monetary policies were support to states, businesses, households and individuals through grants, tax relief, payroll support, tariff reductions, and direct support to the health sector.\nAccording to the minister, the real sector interventions were focused on mass agriculture, mass housing, public works, off-grid solar power installations and support to small businesses.\n“COVID-19 which started as a health pandemic snowballed into an economic pandemic, so, to accelerate quick recovery of the economy, we developed some strategies which included; national stimulus economic package, mobilisation of external support and funding and increase in non-oil revenue generation.\n“These were aimed at retaining and creating jobs, increasing our productivity ensuring social stability and addressing long-standing economic vulnerabilities."
  },
  {
    "headline": "Zamfara bandits mount road block, collect taxes",
    "summarized_story": "Burn farms, abduct defaulters-nativeIt’s not true ― PoliceBy Ibrahim Hassan-WuyoThe people of Magami in Gusau Local Government Area of Zamfara state has cried for help over the worsening state of insecurity in their communities.\nThey said bandits are destroying their farm lands and imposing levies on them.\n” If you fail to pay bandits the levy, they either abduct you or burn your farm land, ” they said.\nA native of Magami said in a phone interview that the area was in a serious calamity.\n“He said although there were soldiers stationed in Magami town,their lives depend on Almighty Allah because He is the only one that can protect them."
  },
  {
    "headline": "Boko Haram, Banditry: Group blames intelligence failure for killing of General, others",
    "summarized_story": "“We have x-rayed the several attacks our troops have suffered and have come to the realisation that poor intelligence made our troops vulnerable.\n“The Air Force planes can remain in the air perpetually for surveillance, but if intelligence is missing, the enemy with superior intelligence will continue to explore the missing links.\nAs patriots, we are compelled to draw the attention of the authorities to this critical component of warfare.\n“We cannot afford to allow persons who are not committed to the course of defeating insurgents to occupy sensitive positions as far as intelligence gathering is concerned.\nWe therefore in clear terms urge the federal government to immediately sanitise the Department of State Security service and Defence Intelligence Agency to put an end to these painful and embarrassing attacks leading to loss of precious personnel”, the group noted."
  },
  {
    "headline": "AfCFTA: Nigeria may lose out in agro export— Expert",
    "summarized_story": "By Godwin OritseTHE African Free Trade Area (AfCFTA) has the potential to lift millions of people out of poverty and end food insecurity on the Continent, but Nigeria has not been positioned as the ‘real’ stakeholder for agro-export under this agreement, the Chairman of the Nigeria Agro Committee on AfCTA, Captain John Okakpu, has said.\nSpeaking on a radio programmed monitored by Vanguard Maritime Report, Okakpu stressed that the effectiveness and implementation of government policies, especially in the agricultural sector would make or mar these policies as well as the country’s participation and gain from AfCFTA.\nREAD ALSO:Nigeria’s shrimps, prawns export shrinks by 36%He also said that AfCFTA will form a 3.4 trillion dollars economic bloc, which Nigeria cannot afford to miss out.\nAvailable reports show that trade between African nations in agricultural products as a percentage of Africa’s total agricultural trade remains below 20 percent long, one of the lowest in any region."
  },
  {
    "headline": "Cross River to register boats to curb kidnappings on waterways",
    "summarized_story": "The Cross River government says it plans to register all boats and vessels operating in the state to curb kidnappings on the waterways.\nThis is contained in a statement by Mr Bobby Ekpenyong, the Director General of the state waterways agency in Calabar on Wednesday.\nEkpenyong said that the operators would be licensed at the end of the registration which would start on Dec. 1.\nREAD ALSO: Commercial drivers suspend planned fare hike in Cross RiverHe said that the registration became necessary following increased kidnappings and other crimes on waterways in the state.\nBen Ayade is worried about the incessant kidnappings and illegal activities going on in the state’s waterways."
  },
  {
    "headline": "EFCC: I’m not above the law; Joining APC doesn’t give me immunity — Fani-Kayode",
    "summarized_story": "Vanguard had earlier reported how EFCC invited the former minister and how he honoured the invitation at the Lagos office of the anti-graft agency before he was granted bail on self-recognition.\nAlso Read:EFCC invites FFK; grants him bail on self-recognitionReacting to the invitation and some stories in a section of the media, Chief Fani-Kayode noted via his social media handle that joining the APC doesn’t give him immunity and that APC doesn’t shield those found culpable of any offence.\nFani-Kayode who took the time to take a swipe at his critics accuses them of hate and peddling fake news.\nI am not above the law and neither does joining APC give me immunity.\nEFCC has confirmed, through its spokesperson that it had Fani-Kayode at its Lagos office but has since declined further comments on the matter."
  },
  {
    "headline": "Agric: Ayade advocates youth empowerment, easy access to capital",
    "summarized_story": "Governor Benedict Ayade of Cross River State has called for deliberate empowerment of Nigerian youths and easy access to capitals to enable them to focus keenly on agriculture.\nHe bemoaned their inability to easily access capital and other limitations to prosecute agriculture.\n“Nigerian youths have an array of limitations in Agriculture business and this does not encourage them to delve deeper into the business.\nOne is access to cheap capital.\n“What the Governor has done is to develop a 360 Degree Model to drive youth participation in mechanized farming by identifying young people in the State."
  },
  {
    "headline": "‘Attack on Igbo leaders will not go unpunished’ – MASSOB warns Northern Group",
    "summarized_story": "Movement for the Actualization of the Sovereign State of Biafra (MASSOB) has condemned the Coalition of Northern Group (CNG) for attacking Chief Mbazuruike Amaechi and Igbo patriotic leaders who visited President Muhammadu Buhari in Aso Villa concerning the detention of Mazi Nnamdi Kanu.\nMASSOB, responding in a statement by Comrade Edeson Samuel, National Director of Information, described the attack on honorable Igbo leaders as an attack against the Igbo nation.\nAccording to MASSOB, such a statement that is unpatriotic, parasitic and insensitive will never go unpunished.\n“MASSOB will always see CNG as a bunch of cowards, charlatans and street boys that are always at the service of Fulani northern oligarchy and their mission of enthroning Islamic fundamentalism in Nigeria.\nThey are working for the northern-based Islamic terrorist organizations including the Fulani herdsmen, Fulani bandits, Boko Haram, ISWAP and president Muhammed Buhari-led Federal Government."
  },
  {
    "headline": "How N2bn was siphoned from FIRS under guise of duty tour allowance – EFCC witness",
    "summarized_story": "An operative of the Economic and Financial Crimes Commission, EFCC, Ijeoma Matilda on Wednesday narrated to a Federal High Court in Abuja how N2 billion was allegedly siphoned from the Federal Inland Revenue Service (FIRS) under the guise of duty tour allowance.\nShe told the court that sometime in November 2015, EFCC received an intelligence report alleging that the former Coordinating Director of the FIRS, Mr Peter Hena conspired with the first defendant using the staff of the unit to siphon money from the FIRS through Duty Tour Allowances, DTA, to the tune of over N2bn.\n“We went ahead to investigate the first defendant, (Emmanuella Eteta Ita), she denied receiving any money from Peter Hena.\n“We further investigated the first defendant’s United Bank for Africa (UBA) salary account, where we discovered various payments from FIRS, for various reasons.\nUnder cross-examination by Benjamin Ogbayi, counsel to the first defendant and Andrew Hassien, counsel to the second defendant, the witness pointed out that he only worked based on the instructions."
  },
  {
    "headline": "Shun corruption, redouble efforts to protect Imo residents – NSCDC urges operatives",
    "summarized_story": "The Nigerian Security and Civil Defense Corps (NSCDC) in Imo State has urged men and officers of the command to shun corruption and redouble their efforts to maintain the protection of lives and property.\nThe Command said that the officers, who were trained in Katsina State under the Agro Rangers unit, would be on ground to carry out their duties with productivity in perspective.\nNSCDC said,” Agro Rangers will serve as mediators between farmers and herders in the respective LGAs.”The NSCDC Commandant in Imo, Mr Michael Ogar, who stated this in Owerri on Wednesday while briefing journalists, said the Agro Rangers programme was initiated by the Federal Government to protect farming investments across the country from criminal attacks.\nHope Uzodimma of Imo for donating two operational vehicles to support the activities of the Agro Rangers Unit of the Nigeria Security and Civil Defense Corps (NSCDC) in Imo, he said that the vehicles would be used by the 98 officers under the Command’s agro rangers unit.\nThe Commandant expressed optimism that the state government would further assist the Command with necessary logistics for other aspects of its operations such as the fight against oil bunkering."
  },
  {
    "headline": "Kano, Lagos demand special revenue allocation from Nigerian govt",
    "summarized_story": "Kano and Lagos States are demanding a special allocation from the Federal Government of Nigeria.\nGovernor Abdullahi Ganduje revealed that the states have made a case for 1 per cent in the new Revenue Allocation Formula.\n“Looking at the population of Kano, Lagos and other similarities of mega cities, both states demand 1 per cent in the new revenue allocation formula.\n“Every second, people are entering the two cities of Kano and Lagos, and you have no control over that.\nThey also have to get the security services.”Sanwo-Olu confirmed that with the expected review of the revenue formula, Lagos and Kano want 1 per cent."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "JUST IN: JAMB uncovers 706,189 illegal admissions by varsities, others",
    "summarized_story": "The Registrar, Joint Admissions and Matriculation Board (JAMB), Prof. Is-haq Oloyede on Tuesday said the agency has uncovered 706,189 illegal admissions by universities, Colleges of Education, polytechnics and other allies.\nOloyede made the disclosures at the Consultative Sensitization Meeting with Select Stakeholders in Abuja said the illegal admissions have damaged the image of the country.\nWhile about 114 universities accounted for 67.795 of the illegal admissions, 137 polytechnics were responsible for 489,918, 80 Colleges of Education for 142, 818 and 37 other institutions involved in 5,678 cases.\n“The Board was then directed to launch massive campaigns to educate the public against accepting such illegal admissions henceforth.\n“It is astonishing that so far, 706,189 candidates have been disclosed as illegally admitted between 2017 and 2020.”Oloyede said there will no longer be opportunities for illegal admissions by universities and other higher institutions."
  },
  {
    "headline": "Orji Kalu congratulates Buhari’s Chief of Staff, Gambari at 77",
    "summarized_story": "The Chief Whip of the Senate, Sen. Orji Kalu, on Wednesday in Abuja, congratulated President Muhammadu Buhari’s Chief of Staff, Prof. Ibrahim Gambari on his 77th birthday anniversary.\n“I felicitate with the Chief of Staff to the President, Prof. Ibrahim Gambari as he clocks 77.\n- Advertisement -Read Also: Tinubu, Orji Kalu in closed-door meeting“The celebrant is a great achiever in all aspects of life.\n“Having served in various capacities at the global level, the contributions of Prof. Gambari to humanity are enormous, impressive and highly commendable.\n“As the Chief of Staff to the President, the renowned diplomat, is complementing the efforts of President Muhammadu Buhari in building a prosperous Nigeria."
  },
  {
    "headline": "Emefiele urges FG to prioritise investment in infrastructure to boost economy",
    "summarized_story": "Emefiele urges FG to prioritise investment in infrastructure to boost economyThe Central Bank of Nigeria (CBN) has urged the Federal Government to prioritise investment in infrastructure to improve the country’s business environment and boost economic growth.\nEmefiele said that the MPC observed the impact poor infrastructure on rising domestic price levels.\nHe, however, commended government’s effort at economic diversification while calling for more support to boost non-oil exports.\n“Members also reiterated the impact of poor infrastructure on rising domestic price levels, urging the Federal Government to prioritise investment in public utilities to improve the business environment.\n“Under its Agribusiness Small and Medium Enterprise Investment Scheme (AgSMEIS), the bank has released N134.63 billion to 37,571 entrepreneurs,” he said."
  },
  {
    "headline": "PHOTOS: Buhari presides over FEC meeting",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "FG rejects Lagos’ EndSARS report, insists Lekki tollgate massacre phantom",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nBut, the Federal Government is insisting that security agencies did not massacre Nigerians at the tollgate last October, reiterating that Lekki massacre is ‘fake news’.\nUnlike many commentators and analysts, we took our time to read and digest the report, and we are now well placed to respond.\nIt is simply incredible that a judicial panel set up to investigate an incident has submitted a report laden with allegations, the same allegations it was set up to investigate in the first instance.\nIn its rush to claim vindication, CNN apparently didn’t even read the report before rolling out the drums in celebration."
  },
  {
    "headline": "YWC must champion return of looted Yoruba artefacts –Osinbajo",
    "summarized_story": "From Oluseye Ojo, IbadanVice President Yemi Osinbajo, yesterday, urged the newly launched Yoruba World Centre (YWC) to champion the return of artefacts that were plundered, looted or illegally taken away from Yorubaland to any part of the world.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nOsinbajo said: “You must join in the global movement to champion the return of artefacts that were plundered, looted or illegally taken away from these shores.\nThe forced relocation of Yoruba people by slave dealers to the Americas and the Caribbean and other unspeakable degradations and atrocities of slavery, and the ways in which Yoruba culture adapted and survived in the dehumanising humiliation, and suffering in those distant and hostile environments.\nThe centre, according to them, must be used to promote the unity of Yoruba race, national unity and nation building."
  },
  {
    "headline": "Electoral Bill: Govs intensify pressure on Buhari",
    "summarized_story": "On Monday, APC governors, represented by the caretaker committee chairman of the party and Governor of Yobe State, Mala Buni, met with the president.\nThe source said the three APC governors, who represented their colleagues, urged the president to return the Amendment Bill to the National Assembly to reflect some of the concerns raised by stakeholders.\nThe source said National Assembly leaders, who until now, refused to listen to concerns raised by governors, may lose out in the ongoing power play.\nSimilarly, President of the Senate, Ahmad Lawan on Monday, met with President Buhari on the same Electoral Amendment Bill.\nHe said if he returned it, the Senate, vis-a-vis, the National Assembly, would decide on the way forward regarding the contentious issues."
  },
  {
    "headline": "Nigeria suffering from crisis of governance –PDP Govs",
    "summarized_story": "From Ndubuisi Orji, AbujaChairman of the Peoples Democratic Party (PDP) Governors Forum, Aminu Tambuwal, has said Nigeria is suffering from a crisis of governance, hence the myriad of challenges confronting it.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nLife in Nigeria is increasingly becoming brutish and short as insecurity ravages the land.\nHe said that no other party in Nigeria was better equipped and placed to rescue and rebuild the country than the PDP, adding that the party did it before.\nHe recalled how PDP took over power from military rule in Nigeria and within short years under former President Olusegun Obasanjo administration reversed the collapsed economic."
  },
  {
    "headline": "NAMA suspends two-day flight disruption across 4 airports",
    "summarized_story": "By Chinelo ObogoThe Nigerian Airspace Management Agency (NAMA) has said that the Flow Control, embarked upon by the Nigerian Air Traffic Controllers Association (NATCA) on Tuesday, November 23, 2021, has been suspended.\nFola Akinkuotu, said the suspension is to pave way for a follow-up meeting between NAMA management, the Director General of the Nigerian Civil Aviation Authority (NCAA) and the association, scheduled to hold later in the day.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“Flow control’ is a traffic flow management technique used in order to regulate the rate at which aircraft enter an airport airspace to a level no greater than the resource can accept and aircraft are usually delayed at the point of departure.\nThe decision to use ‘Flow Control’ to space departure is what has slowed down operations across the country and caused flight delays and cancellations."
  },
  {
    "headline": "W’Bank: FG, States Won’t Be Able to Pay Salaries in 2022 If Fuel Subsidy is Retained",
    "summarized_story": "Hernandez stated that a situation where N250 billion goes into fuel subsidy monthly was unsustainable as the paucity of revenue confronts the country, especially the sub-national governments.\nThe report pointed to mounting fiscal pressures due to lower-than-expected revenues in 2021 and the rising cost of PMS subsidy.\n“Even in the state of Lagos, which relies the least on Federal transfers, transfers accounted for 29 per cent of revenues in 2020.\nNot only is the PMS subsidy costly, but it mainly benefits richer households.\nWhat we are dealing with is about N243 billion of fuel subsidy monthly."
  },
  {
    "headline": "FG Rejects Lagos #EndSARS Panel’s Report over Inconsistencies, Innuendoes",
    "summarized_story": "The report which was leaked last week, had revealed that at least 11 persons were killed during the peaceful demonstration at the Lekki Tollgate.\n“Where are the family members of those who were reportedly killed at Lekki Tollgate?\nBesides, the Lagos State Government, being the convening authority, has yet to release any official report to the public.\n20th 2020 incident at Lekki, where it did not have a correspondent on ground.\nSecondly, CNN rushed to the air to celebrate an unsigned and unverified report that is riddled with inconsistencies, errors, discrepancies, innuendoes."
  },
  {
    "headline": "Emefiele Rules Out Further Forbearance Extension for Intervention Loans",
    "summarized_story": "Emefiele, while addressing journalists after the two-day meeting of the CBN’s Monetary Policy Committee (MPC) in Abuja, said he does not envisage a likelihood of loan default resulting from the forbearance programme.\nHowever, as the forbearance regime draws to a close in March next year, the CBN governor, citing improvement in economic activities, urged businesses to resume loan repayment.\nHe said: “If you recall from our standpoint, we granted a forbearance regime from just two areas.\nHe said: “Talking about bank charges, the CBN insists that consumers of bank services, in this case, customers must insist and indeed, if it’s not on CBN website, I am going to ask that we place it on our website- the Guide to Bank Charges- go and read your guide to bank charges.\n“You should not allow any bank to just pass on any discretionary charges on your account that is not contained in the guide to bank charges."
  },
  {
    "headline": "Osinbajo: Coca-Cola’s Planned $1bn Investment Will Positively Impact Nigeria’s Economy",
    "summarized_story": "Deji Elumoye in AbujaThe Vice President, Prof. Yemi Osinbajo has said the plan by the multinational beverage company, Coca-Cola, to invest $1 billion in Nigeria in the next five years testifies to the possibilities in the economy despite challenges.\nWhile narrating his personal and family stories about drinking Coke, including how he drank two bottles of Coke a day up until 2017, the Vice President reiterated the Buhari administration’s commitment to creating an environment that allows the private sector innovate and thrive remains active and sincere, despite the challenges.\nAccording to him, government would continue to work with businesses across the broad spectrum of the economy to ensure this is done with a clear view of the opportunities and problems of the day.\nOsinbajo further stressed that in the 70 years that the company has operated in Nigeria, it has demonstrated, “commitment to the Nigerian people with repeated investments, in the building of production facilities across the country, in creating thousands of jobs but also in your active support of every aspect of our national life, from health to education, from women and youth empowerment to sports.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "To Counter OPEC, US, UK, Others Collaborate to Release Emergency Oil Reserves",
    "summarized_story": "The US announcement was for a release of 50 million barrels, the equivalent of about two and a half days of the country’s demand; India would release five million barrels, while Britain would allow the voluntary release of 1.5 million barrels of oil from privately held reserves, according to a Reuters report.\nDetails on the amount and timing of the release of oil from South Korea, Japan and China were not announced.\nSeoul said it would decide after discussions with the United States and other allies, while the Japanese media said Tokyo would detail its plans today.\nOfficials said it was the first time that the United States had coordinated such a move with some of the world’s largest oil consumers.\nThe 32 million barrels loan would take place over the next several months, while the administration would accelerate a sale of 18 million barrels already approved by Congress to raise funds for the budget."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Leadway Assurance Company Denies Defrauding Abuja-based Customer Of Multi-million Naira Claims On Damaged Vehicle",
    "summarized_story": "Woleola had accused the insurance corporation of fraud involving over multi-million naira claims on his damaged vehicle.\nHe described the attitude and disposition of the company to his insurance claim as appalling, disappointing, annoying and frustrating.\n\"I entered into a vehicle insurance contract with Leadway covering my Mercedes Benz E 300 2017 model.\n“In accordance with standard policy terms, an insurance company can either 'repair, reinstate, or replace' the damaged vehicle.\nIn this case, the cost of repair was 25.1% of the Sum Insured Value of N15m, which is far less than 55%."
  },
  {
    "headline": "Nigeria receives stolen Benin, Ife artefacts from US museum",
    "summarized_story": "The consulate-general of Nigeria in New York has taken possession of three Benin and Ife artefacts from the Metropolitan Museum of Art (MET) in the United States.\nAdvertisementAccording to NAN, Abba Tijjani, director-general of national commission for museums and monuments (NCMM), received the artefacts from the museum in the company of Lot Egopija, consul-general of Nigeria in New York.\nThe artefacts are two 16th-century Benin brass plaques and one 14th-century Ife brass head.\nTijjani, who signed a Memorandum of Understanding (MoU) with MET, commended the museum for returning the artefacts to Nigeria.\nAdvertisementHe asked other museums in possession of Nigerian artefacts to follow MET’s exemplary gesture."
  },
  {
    "headline": "Nigeria receives stolen Benin, Ife artefacts from US museum",
    "summarized_story": "The consulate-general of Nigeria in New York has taken possession of three Benin and Ife artefacts from the Metropolitan Museum of Art (MET) in the United States.\nAdvertisementAccording to NAN, Abba Tijjani, director-general of national commission for museums and monuments (NCMM), received the artefacts from the museum in the company of Lot Egopija, consul-general of Nigeria in New York.\nThe artefacts are two 16th-century Benin brass plaques and one 14th-century Ife brass head.\nTijjani, who signed a Memorandum of Understanding (MoU) with MET, commended the museum for returning the artefacts to Nigeria.\nAdvertisementHe asked other museums in possession of Nigerian artefacts to follow MET’s exemplary gesture."
  },
  {
    "headline": "'Refrain from the deal' -- Ecobank advises Flour Mills over acquisition of Honeywell Flour",
    "summarized_story": "Ecobank Nigeria Plc has advised Flour Mills of Nigeria (FMN) to refrain from the proposed acquisition of major stake in Honeywell Flour Mills.\nAdvertisementKunle Ogunba and Associates, solicitors to Ecobank, said this in a letter addressed to the managing director of Flour Mills.\nThe bank claimed that Honeywell Group, the principal company, had not been paying up its loans to the bank.\nOn Monday, Flour Mills informed investors that it had signed an agreement to acquire a 71.69 percent stake from Honeywell Flour Mills and also a 5.06 percent FBN Holdings equity in Honeywell Flour Mills.\n“Please be further informed that the assets of both Honeywell Group Limited and Honeywell Flour Mills Plc."
  },
  {
    "headline": "'Refrain from the deal' -- Ecobank advises Flour Mills over acquisition of Honeywell Flour",
    "summarized_story": "Ecobank Nigeria Plc has advised Flour Mills of Nigeria (FMN) to refrain from the proposed acquisition of major stake in Honeywell Flour Mills.\nAdvertisementKunle Ogunba and Associates, solicitors to Ecobank, said this in a letter addressed to the managing director of Flour Mills.\nThe bank claimed that Honeywell Group, the principal company, had not been paying up its loans to the bank.\nOn Monday, Flour Mills informed investors that it had signed an agreement to acquire a 71.69 percent stake from Honeywell Flour Mills and also a 5.06 percent FBN Holdings equity in Honeywell Flour Mills.\n“Please be further informed that the assets of both Honeywell Group Limited and Honeywell Flour Mills Plc."
  },
  {
    "headline": "Boko Haram, ISWAP setting up camps in Niger, says SSG",
    "summarized_story": "Ahmed Matane, secretary to Niger state government, says Boko Haram and a faction of the Islamic State in West African Province (ISWAP) are setting up camps in the state.\nAdvertisementSpeaking at a press conference in Minna, Niger capital city, on Tuesday, Matane said these groups have been telling communities that they are “God-send” and want to establish a caliphate.\nThe SSG said the insurgents have been asking the people to forsake western education and embark on “civil disobedience”.\n“These people often go to communities to communicate with them and assure them that they will not harm them, and join them during Friday congregational prayer to preach to them on the need to forsake western education and embark on civil disobedience,” he said.\n“They are the same people that kidnapped the Dodo of Wawa, they assured us that they are not bandits, that they are there because they are God sent."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "The NFT artist who captured the global lockdown with 700 portraits",
    "summarized_story": "Optimising this process, coupled with the overwhelmingly positive feedback he received from his 80 selected muses, encouraged him to create more portraits.\nIn the end, Adekola created 700 portraits, but there are only 40 portraits with striking designs and a collage of all 700 portraits on display at the exhibition halls of the gallery.\nNow titled Lockdown Portraits, his project would go on to form a part of his exhibition titled, Dislocation &… alongside Anthology of an African Wedding and Diaspora Axis.\nAdekola has evolved his art using Photoshop for over 20 years, creating over 20,000 texture designs that he used to create Anthology of an African Wedding.\nAnthology of an African Wedding, which also sells as an NFT on OpenSea, consists of 18 art pieces—9 showing traditional wedding scenes and 9 white wedding ones."
  },
  {
    "headline": "Price of cooking gas rises 63%, to last longer",
    "summarized_story": "Nigerians are facing tough times as average price for refilling a 12.5kg cylinder of Liquefied Petroleum Gas (cooking gas) has risen by 62.8 percent over the past one year.\nThe report notes that states with the highest average price for refilling 12.5kg cooking gas were Oyo (N7,718.2), Abuja (N7,660.0) and Imo (N7,655.6).\n“The soaring cooking gas prices may continue till March next year, as winter in Europe will increase the demand for natural gas for heating,” Emmanuel Uwandu, founder of GAS360, a local gas distributor, states.\nRead also: Nigerians grumble as Cooking Gas price keeps risingIn order to cope with the rising cost, some Nigerians are switching to dirtier alternatives like charcoal and firewood, while others have started rationing the use of cooking gas to save cost.\n“I alternate between cooking gas and firewood because I have to factor into the business my children’s school fees."
  },
  {
    "headline": "Rising food price and wellbeing of Nigerians",
    "summarized_story": "The welfare of Nigerians is deteriorating every day due to rising prices, especially that of food items in the market.\nLikewise, the average price of 1kg tomatoes increased year-on-year by 19.28 percent, while a 1kg of white Garri, the popular poor man food, experienced a year-on-year 27.91 percent increase.\nThe percentage of adults who skipped food, ran out of food and went the whole day without food in Nigeria were 27.3 percent, 25.1 percent, and 6.4 percent, respectively.\nThe expert also noted a high probability that food prices will double by the end of 2021.\nThere is a high level of poverty experienced, especially among rural dwellers and specifically women."
  },
  {
    "headline": "All On, partners launch new $10m solar equipment facilities in Nigeria",
    "summarized_story": "The All On-managed finance facility will provide debt funding for solar companies already approved by the Rural Electrification Agency (REA) for the Nigeria Electrification Programme to purchase lower-cost solar equipment through the DART.\n“We are particularly excited about this deal which will inject much needed capital into the renewable energy sector in Nigeria,” said All On CEO, Wiebe Boer.\nThey will manage the global platform to standardise equipment, process solar company orders, manage supplier relationships, and link developers with finance partners.\nAccording to a 2020 Sustainable Energy for All (SEforAll) report on the solar sector in Nigeria commissioned by All On, aggregated procurement and logistics for solar equipment can significantly lower costs and unlock bottlenecks in the supply chain.\n“This could be a breakthrough in bridging the finance gap that hinders the growth of small and medium sized enterprises in the nascent renewable energy sector in Nigeria.”"
  },
  {
    "headline": "Contributory Pension Scheme: Edo sensitises first batch of beneficiaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Tuesday, kicked off a three-day workshop to sensitise the first batch of intending retirees to benefit from the Contributory Pension Scheme introduced by the Governor Godwin Obaseki-led administration in 2017.\nFunctioning Permanent Secretary/Chairman, Edo State Pension Bureau, Abbe Osaro Washington, said the workshop is to prepare the workers ahead of their migration into the scheme by 2022.\n“These intending retirees would be the first to benefit from the new Contributory Pension Scheme introduced by Edo State Government in January 2017.”He continued: “This is the first set of retirees, to be migrated two months from now.\nThese are the first set of intending retirees that will be migrating into the contributory pension scheme.”Addressing the intending retirees, the guest speaker, Mr. Adebola Bello, who spoke on ‘Retirement Benefits Under the Contributory Pension Scheme,’ said the scheme came with modalities, which include transparency and uniform regulation.\nReturns on investment give value to the Contributory Pension Scheme,” he added."
  },
  {
    "headline": "Obaseki assures of support for new UNIBEN Chancellor – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the new Chancellor who was on a courtesy visit at the Government House in Benin City.\nAccording to him, “University education in the post-COVID-19 world requires a rethinking of the system, and how it is organised.\n“The strategy used two or three decades ago for our university education might not be applicable today.\nHopefully, you will lead that stage of helping us rethink university education in Nigeria in the post-COVID-19 era.”“For the future university, we will be quite reliant and dependent on technology.\n“I have been in the university system for some four decades and will use that experience and exposure, and make it available for the development of UNIBEN.”..."
  },
  {
    "headline": "Obaseki inaugurates c’ttee for devt of science, technology, innovation in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated Prof. Kessington Obahiagbon as the Chairman of the Edo State Science, Technology and Innovation Committee, charged with the responsibility of developing a strategy that will make the state a hub for science, technology and innovation in the country.\nThe COVID-19 era has shown that technology is important for any state that wishes to survive the dislocations brought by the pandemic.\n“We are lucky, blessed, and fortunate to be affiliated with experts and leaders in the area of proliferating science and technology.\nHe further stated, “The Committee should also assist the state in developing a strategy to improve the awareness of science, technology and innovation at the grassroots.\n“They should assist in developing a strategy that will make Edo State the hub of science, technology and innovation within and outside the country."
  },
  {
    "headline": "Edo Govt Seeks Collaboration with NTA on MEGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government has called for the support of the Nigerian Television Authority (NTA) in driving the administration’s agenda of Making Edo Great Again popularly known as MEGA.\nWhile making his welcome address, the Commissioner reinstated the commitment of Edo government under Mr. Obaseki to economic revolution and institutional reforms of Edo state which are driven by the MEGA agenda.\nHe appealed to NTA to key into the vision by informing and sensitizing the people about the programmes of Edo government.\nEarlier, the zonal director of NTA Benin Network Centre, Mrs. Pauline Igbanor congratulated Hon.\nSolomon Imohiensen and other staff members of the Edo Ministry of Communication and Orientation."
  },
  {
    "headline": "Why we can’t force down price of cooking gas – Nigerian govt",
    "summarized_story": "He said the government will nonetheless “tinker” with some aspects of gas pricing within its control.\nThe prices of cooking gas in Nigeria have more than doubled in the last year with many Nigerians switching to firewood and charcoal.\nSpeaking with journalists at the presidential villa, Abuja, after a meeting with President Muhammadu Buhari, Mr. Sylva said cooking gas is a deregulated commodity and therefore not subsidised.\n“So the price of cooking gas is not determined by the government or by anybody in the industry.\n“And you all are aware that in Europe, today, gas prices have gone up; there was even a crisis in Europe relating to gas prices."
  },
  {
    "headline": "2023: Bukola Saraki declares intention to run for president",
    "summarized_story": "Abubakar Bukola Saraki, the immediate past senate president, has declared his intention to run for president of Nigeria in 2023.\nSaraki made his intention known during his visit to the Governor of Benue State, Samuel Ortom, on Tuesday, in Makurdi, whom he called a good party man under the People’s Democratic Party, Vanguard reported.\nThe report said Saraki was in Makurdi with former Governor of Kogi State, Idris Wada, former National Chairman of the PDP, Kawu Baraje, Senator Suleiman Adokwe and the Chairman of Council, Saraki for President Campaign, Prof. Iyorwuese Hagher.\nA party that has organized its affairs is ready to lead the country and that is the PDP,” Saraki is said to have stated.\nHe also noted that Saraki was the first from the North Central zone to declare his interest in running for president."
  },
  {
    "headline": "Nigeria launches e-passport to curb forgery, enhance application process",
    "summarized_story": "Nigeria’s federal government has launched an enhanced e-passport to improve application process for Nigerians at home and in the diaspora.\nSola Fasure, media adviser to Rauf Aregbesola, minister of interior who disclosed this in a statement said the official rollout of the enhanced e-passport took place at the Nigerian High Commission in London, UK.\n“The enhanced e-passport is a great improvement on the biometric passport technology which Nigeria adopted in 2007 as a strategic step towards curbing forgery.\nJere said his officers are ever ready to roll out the new passports at the official rate published on the NIS website.\n“We are ready to serve the public and start rolling out the new enhanced e-passport in the UK with immediate effect."
  },
  {
    "headline": "List of CBN’s Intervention Programmes In Various Sectors of the Economy",
    "summarized_story": "Nigeria’s Central Bank, (CBN), has continued to play critical role in the growth of various sectors of the country’s economy through its intervention programmes.\nThese intervention programmes have in no small measure, led to vast growth, particularly in the manufacturing and agricultural sectors of the economy.\nCBN’s Intervention Programmes and Schemes for MSMEs3.\nCBN’s Intervention Programmes and Schemes for Manufacturing4.\nCBN’s Intervention Programmes and Schemes for Healthcare5."
  },
  {
    "headline": "Uzodimma condemns burning of houses, shops in Imo by soldiers",
    "summarized_story": "The Imo State government has condemned as “inappropriate response,” the action of the soldiers who burnt houses, shops, vehicles of residents of Awonmanma in Oru East Local Government Area of Imo State, last Monday in retaliation for the killing of a soldier by gunmen.\nHe, however, ordered a full-blown investigation to ascertain the cause of the crisis and the extent of loss of properties involved.\n“Imo State Government is shocked and dismayed over the events in Awo-omama in Oru East local government area of the state.\nGovernment appreciates the enormous sacrifice by security agencies with the attendant risks, to keep lmo for all law-abiding citizens.\n“On the other hand, communities are advised to always cooperate with security agencies to track down and arrest criminals in their midst."
  },
  {
    "headline": "President Buhari, FEC Congratulate Gambari At 77",
    "summarized_story": "President Muhammadu Buhari, on Wednesday, led cabinet members in wishing his Chief of Staff, Professor Ibrahim Agboola Gambari, a happy 77th birthday celebration.\nShortly before the meeting of the Federal Executive Council (FEC) began, the Secretary to the Government of the Federation, Boss Mustapha, announced to the cabinet that Wednesday was Professor Gambari’s birthday anniversary.\nProfessor Gambari joined the government as Chief of Staff 20 months ago following the demise of the former holder of the office, Abba Kyari.\nHe is widely published in Nigerian and international scholarly journals and has written several books on Nigerian foreign policy.\nProfessor Gambari is the founder of the Savannah Centre for Diplomacy, Democracy and Development, a non-governmental Think-Tank established in Abuja."
  },
  {
    "headline": "President Buhari, FEC Congratulate Gambari At 77",
    "summarized_story": "President Muhammadu Buhari, on Wednesday, led cabinet members in wishing his Chief of Staff, Professor Ibrahim Agboola Gambari, a happy 77th birthday celebration.\nShortly before the meeting of the Federal Executive Council (FEC) began, the Secretary to the Government of the Federation, Boss Mustapha, announced to the cabinet that Wednesday was Professor Gambari’s birthday anniversary.\nProfessor Gambari joined the government as Chief of Staff 20 months ago following the demise of the former holder of the office, Abba Kyari.\nHe is widely published in Nigerian and international scholarly journals and has written several books on Nigerian foreign policy.\nProfessor Gambari is the founder of the Savannah Centre for Diplomacy, Democracy and Development, a non-governmental Think-Tank established in Abuja."
  },
  {
    "headline": "Osun Govt Takes Food Support Scheme To Markets",
    "summarized_story": "The monthly Food Support Scheme of the Osun State government, on Monday, has taken palliatives to some markets in the State for distribution.\nThis is to ensure that citizens who are not captured under the World Bank Social Register adopted by the State for the distribution also benefit from the food support scheme.\nAmong the markets where food items were distributed on Monday include Akindeko Market, Igbonna Market, Oluode Market, Oja-Oba Market, Shasha Market, Ota-Efun Market, all in Osogbo, the State capital.\nOthers were Erin-Osun, Ifon Market among others in Osun Central Senatorial District.\nSome of the beneficiaries who appeared elated and enthusiastic after receiving the palliatives, commended the administration of Governor Gboyega Oyetola for the gesture."
  },
  {
    "headline": "Osun Govt Takes Food Support Scheme To Markets",
    "summarized_story": "The monthly Food Support Scheme of the Osun State government, on Monday, has taken palliatives to some markets in the State for distribution.\nThis is to ensure that citizens who are not captured under the World Bank Social Register adopted by the State for the distribution also benefit from the food support scheme.\nAmong the markets where food items were distributed on Monday include Akindeko Market, Igbonna Market, Oluode Market, Oja-Oba Market, Shasha Market, Ota-Efun Market, all in Osogbo, the State capital.\nOthers were Erin-Osun, Ifon Market among others in Osun Central Senatorial District.\nSome of the beneficiaries who appeared elated and enthusiastic after receiving the palliatives, commended the administration of Governor Gboyega Oyetola for the gesture."
  },
  {
    "headline": "N250m Donation: Akpabio Hosts Davido, Hails Musician",
    "summarized_story": "The Minister of Niger Delta Affairs, Senator Godswill Akpabio, has hosted popular musician, David Adeleke, a.k.a Davido, commending him over his plan to donate N250m to orphanages across Nigeria.\nThe Minister said Davido’s philanthropic gesture informed his call on other Nigerians to emulate the singer.\nAkpabio, who took to his verified Facebook page on Wednesday, also congratulated Davido on birthday anniversary on November 21, 2021.\nAkpabio wrote: “I recently played host to our music icon and philanthropist, David Adedeji Adeleke aka Davido.\nHis attitude towards the less privileged in the society made me to call on other Nigerians in politics, business and entertainment sectors to emulate him."
  },
  {
    "headline": "Baba Suwe never recovered from NDLEA ordeal, son laments",
    "summarized_story": "The actor died on Monday at his house in the Ikorodu area of Lagos State after battling a sickness.\nAdebowale, in a viral video on Monday, accused family members and friends of neglecting the veteran actor while he battled the illness.\nSpeaking on his father’s sickness, Adebowale said the illness started after the NDLEA ordeal.\nThe Lagos State Governor, Mr Babajide Sanwo-Olu, in a statement, described Baba Suwe as a man who used his gift to advance the course of mankind.\nMeanwhile, another son of the deceased, Adesola Omidina, has stated that the actor will be buried on Thursday at his house in Ikorodu, Lagos State."
  },
  {
    "headline": "Baba Suwe never recovered from NDLEA ordeal, son laments",
    "summarized_story": "The actor died on Monday at his house in the Ikorodu area of Lagos State after battling a sickness.\nAdebowale, in a viral video on Monday, accused family members and friends of neglecting the veteran actor while he battled the illness.\nSpeaking on his father’s sickness, Adebowale said the illness started after the NDLEA ordeal.\nThe Lagos State Governor, Mr Babajide Sanwo-Olu, in a statement, described Baba Suwe as a man who used his gift to advance the course of mankind.\nMeanwhile, another son of the deceased, Adesola Omidina, has stated that the actor will be buried on Thursday at his house in Ikorodu, Lagos State."
  },
  {
    "headline": "Burna Boy, Wizkid, Femi Kuti, Tems get Grammy nominations",
    "summarized_story": "Nigerian music superstar, Wizkid has bagged two nominations at the 64th Grammy Awards announced Tuesday by the Recording Academy.\nThe Academy announced the nominations for each of the 86 categories for the 2022 GRAMMYs Awards show holding early next year — The awards will be presented on Monday, January 31, 2022.\nWizkid was nominated alongside fellow Nigerians — Femi Kuti, Burna Boy and Tems — for Best Global Music Performance at The Grammys.\nAlso nominated in that same category was Beninese legend, Angelique Kidjo.\nThe Nigerian Afrobeat star also has his ‘Made in Lagos’ album nominated for Best Global Music Album at The Grammys, alongside Femi Kuti and Made Kuti’s ‘Legacy +’, Angelique Kidjo’s ‘Mother Nature’ and Rocky Dawumi’s ‘Voice of Bunbon Volume’."
  },
  {
    "headline": "Burna Boy, Wizkid, Femi Kuti, Tems get Grammy nominations",
    "summarized_story": "Nigerian music superstar, Wizkid has bagged two nominations at the 64th Grammy Awards announced Tuesday by the Recording Academy.\nThe Academy announced the nominations for each of the 86 categories for the 2022 GRAMMYs Awards show holding early next year — The awards will be presented on Monday, January 31, 2022.\nWizkid was nominated alongside fellow Nigerians — Femi Kuti, Burna Boy and Tems — for Best Global Music Performance at The Grammys.\nAlso nominated in that same category was Beninese legend, Angelique Kidjo.\nThe Nigerian Afrobeat star also has his ‘Made in Lagos’ album nominated for Best Global Music Album at The Grammys, alongside Femi Kuti and Made Kuti’s ‘Legacy +’, Angelique Kidjo’s ‘Mother Nature’ and Rocky Dawumi’s ‘Voice of Bunbon Volume’."
  },
  {
    "headline": "Boko Haram, ISWAP caliphate springs up in Niger state",
    "summarized_story": "The government of Niger State have sounded the alarm that terrorists including the Islamic State of West Africa Province (ISWAP) and Boko Haram are planning to establish a caliphate in the state.\nAhmed Matane, Secretary to the State Government (SSG), made the announcement at a press conference on Tuesday in Minna, the state capital.\n“These are some of the attributes of Boko Haram that are perpetrated in the North East and the Sambisa Forest axis.”He said that ISWAP fighters were also making an attempt to establish a permanent camp at Babana Forest around the Kaiji National Park in Borgu LGA.\n“ISWAP is trying to establish a camp at National Park at Babana in Borgu Local government Area of Niger State,” Matane said.\n“They have assured us that they are ‘God sent’ to establish an Islamic caliphate."
  },
  {
    "headline": "Cohesion Football Tournament announces date for third edition",
    "summarized_story": "Cohesion Football Tournament has announced the kick-off date for the third edition of the tournament, featuring 12 teams for the first time in its history.\nThe event is also designed to productively engage these children and steer them away from crime, substance abuse and other social vices.\nSpeaking about this year’s edition, Damilare Obagbemi, Convener, Cohesion Football Tournament stated that the aim of the competition is to enlighten and mentor these children, encourage their youthful dreams as well as instill in them the mindset that anything is possible through football.\nThis year’s football tournament is supported by Union Bank, PZ and Dano.\nThe official medical partner for the 2days tournament is Sports Assist, Nigeria’s first sport medicine company dedicated to improving health outcomes in professional and recreational sport."
  },
  {
    "headline": "I’m Not Above The law; Joining APC Doesn’t Give Me Immunity — Fani-Kayode Speaks On EFCC Aresst",
    "summarized_story": "NEWS DIRECT had earlier reported how EFCC invited the former minister and how he honoured the invitation at the Lagos office of the anti-graft agency before he was granted bail on self-recognition.\nReacting to the invitation and some stories in a section of the media, Chief Fani-Kayode noted via his social media handle that joining the APC doesn’t give him immunity and that APC doesn’t shield those found culpable of any offence.\nFani-Kayode who took the time to take a swipe at his critics accuses them of hate and peddling fake news.\nI am not above the law and neither does joining APC give me immunity.\nEFCC has confirmed, through its spokesperson that it had Fani-Kayode at its Lagos office but has since declined further comments on the matter."
  },
  {
    "headline": "Oyo State Speaker, Debo Ogundoyin Releases Pre-Wedding Photos",
    "summarized_story": "The Speaker of the Oyo State House of Assembly, Debo Ogundoyin, and his fiancee, Olamidun Majekodunmi, have released their pre-wedding photos ahead of their wedding ceremony slated for this weekend.\nThe high octane party will start with engagement/ traditional marriage on Thursday, November 25, 2021, at the UI International Conference Centre while the white wedding and reception is expected to take place on Saturday, November 27, at the Polo Club, Eleyele, Ibadan.\nSee more photos below…"
  },
  {
    "headline": "EndSARS: Our Federal Government Are Not Coordinated – HURIWA",
    "summarized_story": "The statement by Minister of Information and Culture, Lai Mohammed, dismissing the report of the Lagos panel on the Lekki shootings, while his principal, Major General Muhammadu Buhari (retd.\n), is awaiting the release of the Lagos State Government’s White Paper, the Human Rights Writers Association of Nigeria says, shows that there is no cohesion between the Federal Government and the sub-nationals.\nBlinken had met with the Nigerian President at Aso Rock in Abuja, and Buhari had said the Federal Government was waiting on Lagos State and other state governments to come up with their conclusions.\nInstead of sitting for all of one year, the panel could have just compiled social media tales by the moonlight on the incident and submitted, saving taxpayers’ funds and everyone’s time.\n“The Minister of Information Lai Mohammed has succeeded in revealing the spectacular collapse of the Presidency and that governance is now through an autopilot mode."
  },
  {
    "headline": "Buhari And Sanwo Should Resign Now – EndSARS Groups",
    "summarized_story": "On Monday, the New Nigeria Network, in collaboration with #EndSARSUnited, a coalition of #EndSARS groups, demanded President Muhammadu Buhari and Governor Babajide Sanwo-Olu of Lagos State resign for the killings at the Lekki tollgate on October 20, 2020.\nSanwo-Olu was asked to resign for his indictment in the EndSARS report by the panel.\nThey hummed on the decision of Governor Sanwo-Olu to include the Attorney General of Lagos State and Commissioner of Justice, Moyosore Onigbanjo.\n“To what extent, if any, does the Governor still have the moral authority to appoint and set up a White Paper Committee?\n“While Lagos State Government is calling for restraints, it cannot set loose its hunting dogs."
  },
  {
    "headline": "Lagos #EndSARS report unverifiable fake news on social media – FG",
    "summarized_story": "The federal government Tuesday disowned the report of the Lagos #ENDSARS Judicial Panel of Inquiry and Restitution at the Lagos Court of Arbitration, describing it as mere rehearse of allegations previously made.\nPanel wrong –MohammedBut the leaked panel report indicted security agencies as having killed dozens of protesters, a position the information minister challenged at the media parley in Abuja.\nAnother commentator, a journalist, called it a ‘disgraceful report by a disgraceful panel’, saying it reported allegations instead of investigating the allegations.\nYet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\n“Why did the Judicial Panel feel compelled to concoct a”massacre in context” as a euphemism for”massacre”?"
  },
  {
    "headline": "Petrol subsidy ends 2022, FG absolves self from gas price hike",
    "summarized_story": "Gas price hikeIn a related development, Minister of State for Petroleum Resources Timipre Sylva has said the federal government has no control over the price of cooking gas.\nSo the price of cooking gas is not determined by government or by everybody in the industry.\nSo the pricing of gas internationally now affects also the price of gas in the country.\nLike for the Nigeria Upstream Petroleum Regulatory Commission, which I am the Chief Executive, I’ve been in office in the past 30 days.\nSo, by and large, this is the agenda we have put in place for us to optimize value for the nation in the upstream industry,” he said."
  },
  {
    "headline": "Breaking: Fire outbreak wrecks havoc at Nyanya Abuja market (VIDEO)",
    "summarized_story": "Fire on Tuesday night gutted popular Nyanya market located within Abuja Municipal Area Council (AMAC).\nThe cause of the fire outbreak was yet unknown as at the time of filling this report.\nHowever, men of the FCT fire service has immediately arrived the scene and are battling to completely quench the inferno.\nDetails coming…RelatedNo tags for this post."
  },
  {
    "headline": "Concerned APC Stakeholders welcome Buhari's approval of APC Convention in Feb -",
    "summarized_story": "The Concerned APC Stakeholders has welcomed President Muhammadu Buhari’s approval of February as the Convention date.\non the 6th of October, 2021, the Group wrote a letter to President Muhammadu Buhari calling on him to intervene in some urgent matters posing existential threat to the party.\nThey commend the President as the leader of the party for demonstrating an obvious willingness to listen to all party men and women without any iota of prejudice.\nThey called on the Caretaker/Extra-Ordinary Convention Planning Committee ( CECPC) to take the presidential mandate further by immediately commencing the process that will give APC a befitting and transparent convention that all members would be proud of.\nApart from showing the seriousness it attach to the approval by the president, the Caretaker Committee they say, must not only announce a specific date for the convention, it must put all the necessary machineries for the conduct of the convention in place without further delay."
  },
  {
    "headline": "We are only mandated to relate with political parties",
    "summarized_story": "The Independent National Electoral Commission says it has been mandated to only relate with all political parties and not factional group or groups in the country.\nThe Oyo state Resident Electoral Commissioner of Australia INEC Mutiu Agboke disclosed this at a meeting held with parties stakeholders held in Ibadan.\nAgboke said this is in a bid avoid the commission been accused of serving the interest of other individuals or factions of a political party.\nAccording to him, However, let it also be on record that INEC has a mandate relate with all political parties and not factional group or groups as recently experienced with a particular political party.\nAgboke said the commission would also supports the Electoral Amendment bill that allows political parties to choose their candidates through direct primaries if assented toAgboke disclosed that over four hundred thousand registered voters are still yet to receive their Permanent Voters Cards out of the over two million registered voters in the state."
  },
  {
    "headline": "Breaking: Akeredolu imposes curfew on Ikare",
    "summarized_story": "The Ondo State Government has ordered the imposition of a twenty-four hour curfew on Ikare town, headquarters of Akoko North East Local Government Area of the State with immediate effect.\nThis is coming on the heels of security reports and credible intelligence arising from the situation in Ikare.\nSpecifically, some deaths have been recorded as a result of sporadic gunshots that have pervaded the ancient town in the last 12 hours.\nSecurity agencies, especially the Police and Amotekun have already been directed to ensure full compliance and enforcement of the curfew imposed.\nAll Traditional Rulers, Opinion and Religious Leaders are enjoined to give maximum support to this order just as they are to rein in their subjects and wards."
  },
  {
    "headline": "Akeredolu, Security heads celebrate retiring Commissioner of Police, Bolaji Salami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has described the retiring Commissioner of Police in the state, Bolaji Salami, as a gentleman who is dedicated to duty.\nGovernor Akeredolu saluted him for being a reliable officer, describing him as a team player.\nAt a brief valedictory session held in his honor during the State Security Council Meeting on Monday, Governor Akeredolu commended the manner the Commissioner of Police handled the #Endsars crisis in the state, describing it as impressive.\nGovernor Akeredolu also applauded the retiring officer for his collaboration with other security agencies in the state, saying he is a bold man.\nI cherish coming here to work with you and I will say that I enjoyed everything in this state,” the retiring CP added."
  },
  {
    "headline": "Nigeria: FG, States Won’t Be Able to Pay Salaries in 2022 If Fuel Subsidy is Retained, World Bank Says – Arise News",
    "summarized_story": "Hernandez stated that a situation where N250 billion goes into fuel subsidy monthly was unsustainable as the paucity of revenue confronts the country, especially the sub-national governments.\nThe report pointed to mounting fiscal pressures due to lower-than-expected revenues in 2021 and the rising cost of PMS subsidy.\n“Even in the state of Lagos, which relies the least on Federal transfers, transfers accounted for 29 per cent of revenues in 2020.\nNot only is the PMS subsidy costly, but it mainly benefits richer households.\nWhat we are dealing with is about N243 billion of fuel subsidy monthly."
  },
  {
    "headline": "CBN Governor Emefiele Rules Out Further Forbearance Extension for Intervention Loans",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, on Tuesday foreclosed further extension of the regulatory forbearance on its intervention facilities instituted by the apex bank to cushion the impact of the COVID-19 pandemic on companies and businesses.\nHowever, as the forbearance regime draws to a close in March next year, the CBN governor, citing improvement in economic activities, urged businesses to resume loan repayment.\nHe said: “Talking about bank charges, the CBN insists that consumers of bank services, in this case, customers must insist and indeed, if it’s not on CBN website, I am going to ask that we place it on our website- the Guide to Bank Charges- go and read your guide to bank charges.\n“You should not allow any bank to just pass on any discretionary charges on your account that is not contained in the guide to bank charges.\nThe CBN governor said, “I think it’s good for us to cast our minds back to the position of First Bank six years ago."
  },
  {
    "headline": "Nigeria: Buhari Suspends Inauguration of Newly-Constituted NNPC Board",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Tuesday directed the immediate suspension of the inauguration of the newly constituted Board of the Nigerian National Petroleum Company Limited (NNPC) scheduled for Wednesday until further notice.\nOn September 19, 2021, Buhari in his capacity as minister of petroleum, directed the incorporation of the NNPC Ltd and thereafter constituted a board for the organisation.\nHe further approved the appointment of the board and management of the NNPC Ltd, with effect from the date of incorporation of the company.\nThe President named Senator Ifeanyi Ararume as Chairman of the board while Mallam Mele Kyari and Umar Ajiya were appointed as Chief Executive Officer, and Chief Financial Officer, respectively.\nOther board members were: Dr. Tajudeen Umar (North East), Mrs Lami Ahmed (North Central), Mallam Mohammed Lawal (North West), Senator Margaret Chuba-Okadigbo (South East), Constance Harry-Marshal (South South), and Chief Pius Akinyelure (South West)."
  },
  {
    "headline": "VP Osinbajo Says Coca-Cola’s Planned $1bn Investment Will Positively Impact Nigeria’s Economy",
    "summarized_story": "The Vice President, Prof. Yemi Osinbajo has said the plan by the multinational beverage company, Coca-Cola, to invest $1 billion in Nigeria in the next five years testifies to the possibilities in the economy despite challenges.\nWhile narrating his personal and family stories about drinking Coke, including how he drank two bottles of Coke a day up until 2017, the Vice President reiterated the Buhari administration’s commitment to creating an environment that allows the private sector innovate and thrive remains active and sincere, despite the challenges.\nAccording to him, government would continue to work with businesses across the broad spectrum of the economy to ensure this is done with a clear view of the opportunities and problems of the day.\nOsinbajo further stressed that in the 70 years that the company has operated in Nigeria, it has demonstrated, “commitment to the Nigerian people with repeated investments, in the building of production facilities across the country, in creating thousands of jobs but also in your active support of every aspect of our national life, from health to education, from women and youth empowerment to sports.\nDeji Elumoye in Abuja"
  },
  {
    "headline": "NASA Launches Test Mission of Asteroid-Deflecting Spacecraft",
    "summarized_story": "The asteroid DART is aimed at poses no actual threat and is tiny compared with the cataclysmic Chicxulub asteroid that struck Earth some 66 million years ago, leading to extinction of the dinosaurs.\nDART’s target is an asteroid “moonlet” the size of a football stadium that orbits a chunk of rock five times larger in a binary asteroid system named Didymos, the Greek word for twin.\nAlthough all none poses a foreseeable hazard to humankind, NASA estimates many more asteroids remain undetected in the near-Earth vicinity.\nThe DART spacecraft, cube-shaped with two rectangular solar arrays, is due to rendezvous with the Didymos-Dimorphos pair in late September 2022.\nNASA put the entire cost of the DART project at $330 million, well below that of many of the space agency’s most ambitious science missions."
  }
]