[
  {
    "headline": "FG sets up panel to avert fresh poly lecturers’ strike",
    "summarized_story": "Our correspondent gathered that the committee was expected to turn in its report in the first quarter of 2022.\nThe National President of ASUP, Dr Anderson Ezeibe, disclosed this in an interview with our correspondent in Abuja on Wednesday.\nThe ASUP president told our correspondent that the union would have no choice but to go on strike because of the failure of the Federal Government to meet its demands.\nHowever, in what seems to be a move to avert the crisis, the Federal Government set up a committee to look into the demands.\nEzeibe said, “A committee has been inaugurated to look into the previous agreement and what we are looking towards now is renegotiation."
  },
  {
    "headline": "Sanwo-Olu, Carrington make case for youths, women",
    "summarized_story": "The Lagos State Governor, Babajide Sanwo-Olu, and widow of Ambassador Walter Carrington, Dr Arese Carrington, have said opportunities should be created for youths and women to thrive.\nThey spoke in Lagos at the inaugural Ambassador Walter Carrington Annual Symposium which was titled, ‘Rethinking Governance for Youth and Women’s Participation.’Sanwo-Olu, who was represented by the Commissioner for Establishment, Training and Pensions, Mrs Ajibola Ponnle, said, “The Walter Carrington Foundation has been and continues to play a critical role towards the socio-economic growth and sustainability of society.\nHe said, “Women and youths are the remaining two-third that we must fully utilise for us to get there.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Masari’s Arms Suggestion: Governance of confusion’s complete, Ohanaeze mocks; it’ll create balance of forces — ADF",
    "summarized_story": "Laughing for long after the question was put to him, the President General of Ohanaeze Ndigbo, Prof. George Obiozor, said such suggestion indicates that governance of confusion is complete in the country.\nWith that, governance of confusion is complete,” Obiozor said, laughing it off.\nIn their own reaction, Igbo elite body, Alaigbo Development Foundation, ADF, expressed strong support to Masari’s proposal, saying that self-defense is the first law of nature.\nThey said that if the Federal Government continues to handle the bandits with kids gloves, Governor Masari’s suggestion may be the last option for Nigerians.\n“The terrorists and bandits may begin to retreat if they realise that they have no monopoly of violence,” ADF spokesman, Abia Onyike said."
  },
  {
    "headline": "WHO predicts COVID-19 will end in 2022",
    "summarized_story": "World Health Organisation (WHO) Director General, Tedros Ghebreyesus, has expressed optimism that COVID-19 pandemic will end in 2022.\nSince then, 1.8 million deaths were recorded in 2020 and 3.5 million in 2021, but the actual number is much higher.\nRight now, Delta and Omicron are driving up cases to record numbers, leading to spikes in hospitalisation and deaths.\n“We have 185 days to the finish line of achieving 70 per cent by the start of July 2022.\nAs the pandemic drags on, new variants could become fully resistant to current vaccines or past infection, necessitating vaccine adaptations."
  },
  {
    "headline": "Bandits kill Zamfara District Head, 5 others",
    "summarized_story": "…As security agents block fleeing bandits, rescue kidnapped victimsBy Ibrahim Hassan-WuyoAgain in Zamfara state, bandits who invaded Gada village in Maru Local Government Area and killed a District Head, met their waterloo as they have to abandon the kidnapped women and children to run away due to the superior firepower of Nigerian security agents and the vigilantes.\nAlhaji Umaru Bawan Allah, the District Head was shot and killed, together with 5 others when the group of bandits were going from house to house in the community, unleashing terror and mayhem on the peasants.\nAs if they knew who they wanted to kill, they searched house to house picking those they wanted and shooting them.\nThe bandits kidnapped many villagers, women and children.”” The victims attempted to run away but the bandits caught them.\nLuckily, the security agents assisted by the local vigilantes blocked the bandits as they were leaving.”” They ambushed the bandits with heavy firepower near Karakai village."
  },
  {
    "headline": "Electricity: Nigeria’s metered customers rise 17.7% to 4.7m in 9 months",
    "summarized_story": "By Udeme AkpanThe number of metered customers has increased by 17.7 percent to 4,772,906 in September 2021, from 4,053,403, recorded in the corresponding period of 2020, according to the Nigerian Electricity Regulatory Commission, NERC.\nHowever, it was gathered the number of metered customers would be higher when the October –December, 2021 data are released in the coming months.\nThe report stated: “During the second quarter of 2021, the eleven (11) DisCos received 241,476 complaints from consumers, indicating 1.91% more complaints than those received in the first quarter of 2021.\nIn total, the DisCos attended to 230,169 complaints representing an increase of 1.91 percentage point over the preceding quarter.\nMetering, billing, and service interruption are the prevalent sources of customer complaints, accounting for 58.07% of the total complaints in the second quarter of 2021.”"
  },
  {
    "headline": "Arms for self defence: CAN, ADL, CNG knock Masari",
    "summarized_story": "Governor Aminu Masari of Katsina StateBy Ibrahim Hassan-WuyoThe remarks credited to Governor Aminu Bello Masari of Katsina State that his administration would assist citizens to acquire arms and defend themselves against bandits, have continued to elicit reactions.\nChairman of CAN in Kaduna State,Rev.John Joseph Hayab,said “the public talk by Gov Masari about self-defence is not new to us and our constitution.\nThose we have been praying and hoping that they will defeat the terrorist for us are saying that they can not help us”.\nOn his part, Mutala Muhammad of Arewa Defense League ( ADL) ,said “we welcome with optimism the statement by the Katsina State Governor, Hon.\nMasari should also go further to organise general prayers for God’s intercession,” he said."
  },
  {
    "headline": "Ogun Assembly passes 2022 budget",
    "summarized_story": "The Ogun State House of Assembly has passed the 2022 appropriation bill as presented by Governor Dapo Abiodun barely a month ago.\nDAILY POST recalls that Gov Abiodun had on November 30 presented the 2022 appropriation bill of N350.74 billion to the Assembly.\nOn Wednesday, the lawmakers, at a session presided over by the Speaker, Olakunle Oluomo, passed N350,735 billion, while adjusting some recurrent and or capital estimates of about 182 agencies.\nThe bill was passed after the Chairman, House Committee on Finance and Appropriation, Olakunle Sobunkanla, presented his report.\nMeanwhile, the Speaker has directed that the clean copy of the bill be transmitted to the governor for his assent."
  },
  {
    "headline": "CISLAC condemns DSS siege on Abuja office, demands investigation",
    "summarized_story": "The Civil Society Legislative Advocacy Centre (CISLAC) has condemned Monday’s invasion of its headquarters in Abuja by Department of State Services (DSS) operatives.\nExecutive Director, Auwal Musa Rafsanjani, in a letter to DSS Director-General, Yusuf Bichi, called for an immediate investigation.\nRafsanjani is the Chairman of Transition Monitoring Group (TMG), the civil society election observation body with 400 member- organizations.\nThe activist demanded an end to the trend of shrinking the civic space to which the civil society community represents.\nRafsanjani lamented how the DSS stormed CISLAC head office in Utako without prior notice or official warrant."
  },
  {
    "headline": "Buhari’s aide, Enang orders FRSC to dismantle roadblocks around Calabar-Itu bridge",
    "summarized_story": "The Senior Special Assistant to President Muhammadu Buhari on Niger Delta Matters, Sen. Ita Enang, has ordered the Federal Road Safety Corps (FRSC) to dismantle some of the roadblocks around the Calabar-Itu Bridge.\nEnang said the multiple roadblocks at both ends of the bridge have led to frequent traffic congestion on the bridge, saying that such was harmful to the lifespan of the bridge.\nHe regretted that the vibration experienced by commuters on the bridge was due to frequent traffic delays especially the heavy trucks which spend several hours on the bridge.\nI want the road to be free so that people can leave the waterways.\n“If this bridge collapses, it may take a long time for another one to be constructed, so let us handle the one we have with care.”"
  },
  {
    "headline": "Buhari mourns retired Major Baita",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the demise of retired Maj. Baita Bashir.\nIn a tribute, President Buhari described the late Major, popularly called “Captain Baita” as an outstanding soldier who earned the nation’s gratitude in many ways.\nHe said: “We mourn a great military warrior who won our nation’s gratitude for an outstanding military service.\n“His dedication to our nation and his exemplary leadership capabilities will continue to inspire our Armed Forces.\n“My thoughts are with his family and those mourning the distinguished military warrior and a fine human being."
  },
  {
    "headline": "Clark vs Obasanjo: Ex-President attacked for saying Nigeria owns oil in Niger Delta",
    "summarized_story": "Former President Olusegun Obasanjo has been lampooned for his response to a letter by a Niger Delta leader, Edwin Clark.\nIn a rejoinder on Tuesday, Obasanjo declared that the oil within the region belongs to the entire people of Nigeria.\nOn Wednesday, a South-South coalition said from paragraphs 4 to 12 of his reply, Obasanjo emphasized the constitutionality of “the forceful expropriation of Niger Delta”.\n“It important for the Niger Delta people to take note that its territory and people are seen as war booty won and/or lost.\nThis also shows the failure of the Niger Delta leadership to stand by and for our people."
  },
  {
    "headline": "The man Peseiro: NFF hires coach with poor management, trophy record",
    "summarized_story": "But his record in football management has been largely poor and dogged by sackings and no major trophies.\nFollowing a trophy-less season, Ahly appointed the former Real Madrid assistant manager Peseiro, then 55, as the new boss.\nAs a national team manager, Peseiro failed to take Saudi Arabia to the 2010 World Cup finals.\nHe coached the team to a runner-up run in the UEFA Cup after disposing of the likes of Feyenoord, Middlesbrough and Newcastle United.\nOn October 2, 2008, after being eliminated from the UEFA Cup by VfL Wolfsburg, he was sacked only to be reinstated a few days later."
  },
  {
    "headline": "Why I want to be APC chairman, by Musa",
    "summarized_story": "Why I want to be APC chairman, by MusaAll Progressives Congress (APC) chieftain Senator Sani Musa yesterday promised to initiate reforms, if elected as national chairman.\nSo far, I believe that all the indications for the conduct of the national convention of our party are positive.\nThe APC reconciliation committee is also working round the clock going from state to state to find solutions to all grievances either before or after the congress.\nAs a serving senator and Chairman Committee on Senate Services.\n“As Chairman of the APC, I can leverage on my experience here in the Senate to push the manifesto of the party to the National Assembly more efficiently."
  },
  {
    "headline": "Military seeks media support to end insecurity",
    "summarized_story": "Through its Commander Maj.-Gen. Ibrahim Ali, Operation Safe Haven (OPSH) has reiterated call on the media to support its bid toward ending insecurity.\nThe Special Task Force is maintaining peace in Plateau, Kaduna and Bauchi states.\nMaj.-Gen. Ali made the call when officials of Plateau chapter of the Nigerian Union of Journalists (NUJ) visited him in Jos yesterday.\n“So, we seek further collaboration with you toward ensuring lasting peace in Plateau and Nigeria in general through your various reportage.\nHe commended residents of Plateau for their support to OPSH, and urged them to do more by providing timely information to the security agencies for prompt response."
  },
  {
    "headline": "WHO predicts end to COVID-19 next year",
    "summarized_story": "World Health Organisation (WHO) Director General, Tedros Ghebreyesus, has expressed optimism that COVID-19 pandemic will end in 2022.\nSince then, 1.8 million deaths were recorded in 2020 and 3.5 million in 2021, but the actual number is much higher.\nRight now, Delta and Omicron variants are driving up cases to record numbers, leading to spikes in hospitalisation and deaths.\n“We have 185 days to the finish line of achieving 70 per cent by the start of July 2022.\nAs the pandemic drags on, new variants could become fully resistant to current vaccines or past infection, necessitating vaccine adaptations."
  },
  {
    "headline": "Autonomy: Why governors are yet to comply with Executive Order 10",
    "summarized_story": "Autonomy: Why governors are yet to comply with Executive Order 10Some governors are delaying compliance with the Executive Order 10 by President Muhammadu Buhari on autonomy for the state judiciary and legislature due to the pending case at the Supreme Court on the matter, it was learnt yesterday.\nThe governors have faulted the agreement between the Nigeria Governors Forum (NGF) and the Parliamentary Staff Association of Nigeria (PASSAN) and the Judiciary Staff Union of Nigeria (JUSUN).\nThere were indications that the Supreme Court may give judgment next month to resolve the impasse.\n“No one is contesting the right of the President to issue Executive Order but such a right must not be in conflict with the spirit and letters of the 1999 Constitution.”President Buhari in May 2020 issued the Executive Order 10 for financial autonomy for state judiciary and legislature.\nA Memorandum of Action was signed on May 20, 2021 by all the parties, including the Nigeria Governors Forum (NGF)."
  },
  {
    "headline": "Amaechi misleading Nigerians on money left behind by Jonathan –Chidoka",
    "summarized_story": "“Furthermore, the Jonathan administration left a total of $2.2 billion in the Excess Crude Account on May 29, 2015.\n“The Jonathan administration handed over a $550 billion economy (largest in Africa and 26th globally) and a diversified economy.\nOn May 29, 2015, President Jonathan left behind an economy with a stable currency, where the Naira exchanged for N199 to $1, and Nigeria had a single-digit inflation rate.\n“Under President Jonathan, the unemployment rate stood at 7.5 per cent (better than European Union) today.\n“2,406 days after, a clear 557 days (One year five months) more than President Jonathan governed Nigeria; this administration’s economic policies and heightened insecurity have left the country comatose."
  },
  {
    "headline": "Obasanjo hits Edwin Clark, insists oil belongs to Nigeria",
    "summarized_story": "From Laide Raheem, AbeokutaFormer president, Olusegun Obasanjo, yesterday, knocked leader of the Ijaw nation, Chief Edwin Clark, over his recent claim that oil in the Niger Delta belongs to the region.\nHowever, Obasanjo said the provision did not imply that resources found in any region belongs to the people there.\n“My dear chief, where in this constitutional provision is it said or implied that minerals located in any part of Nigeria belongs to that location?\nI have never shown any anger or distraught with Nigeria Delta Region nor with any part or Region of Nigeria Rather, I have always picked points on leadership performance or policies and I will continue to do so.\n“My records before, during and after the civil war in Nigeria Delta Region was without blemish and it was all goodwill to all the people of Nigeria and especially the people of the Niger Delta Region which was my theatre of operation during the Nigerian civil war."
  },
  {
    "headline": "Onpetu stool: High Court deposes Ogbomoso monarch",
    "summarized_story": "From Oluseye Ojo, IbadanControversy is currently trailing a judgment delivered by an Oyo State High Court in Ogbomoso, over the deposition of the occupant of the stool of Onpetu of Ijeru Kingdom, Oba Sunday Oladapo Oyediran Lagbami Osekun III, in Ogbomoso South Local Government of the State.\nThe Oyo State High Court, in the recent judgment, delivered in November 2021, but was obtained this week, ordered the monarch to, henceforth, stop parading himself as the paramount ruler of Ijeru Quarters, Ogbomoso.\nThe judgment followed a litigation instituted by Chief Popoola Olaniyi Elijah against Chief Oladapo, the Oyo State governor, and the Attorney General and Commissioner for Justice of Oyo State over the chieftaincy stool of Ijeru.\nThe chieftaincy stool of Ijeru had been a contention between the Ijeru and Onpetu Chieftaincy families of Ogbomoso for some decades.\nThe second and third defendants are, hereby, directed to recognise the claimant as the ruler of Ijeru Quarters, Ogbomoso.”The first defendant is perpetually restrained from parading himself or claiming or putting himself out as the paramount ruler of Ijeru Quarters, Ogbomoso township, Oyo State.”"
  },
  {
    "headline": "Bayelsa spill: Experts insist wellhead leak impossible without interference",
    "summarized_story": "The wing valve is a piece of flow-control equipment used in oil and gas operations and is part of a Christmas tree used to shut in flow from an oil well.\nWhere the spill came out from is from the wing valve.\n“The wing valve has been replaced now.\nSo, when the reservoir pressure is determined, the pressure that is going into the design for the well must be able to withstand the reservoir pressure.\n“There’s no way you have a reservoir pressure of 5,000 PSI and you design an equipment of 2,000 PSI."
  },
  {
    "headline": "Why Buhari withheld assent from electoral amendment act bill –Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency, yesterday, gave reasons President Muhammadu Buhari withheld assent from Electoral Act Amendment Bill.\n“The president’s decision to withhold assent from the Electoral Act (Amendment) Bill 2021 has come under scrutiny from media and political circles.\n“It is this act which the new bill seeks to amend.\nOnly the richest of political parties.\n“Until then, the president will do whatever he can to protect this county’s democracy, and that includes withholding assent from this bill."
  },
  {
    "headline": "EXCLUSIVE: National Assembly Members Fail To Provide Documents Of How N2.5billion Running Costs In Six Months Were Spent",
    "summarized_story": "The House of Representatives, the lower chamber of the National Assembly, has failed to produce documents to prove how its members spent N2.5billion running costs paid to them for six months in 2019.\nThe sum of N2,550,000,000.00 was granted to Honorable members as running costs between July and December 2019 as shown below; North East, N187,000,000.00; South South, N272,000,000.00; South East, N442,000,000.00; North Central, N391,000,000.00; South West 629,000,000.00, and North West, N629,000,000.00.\nThe above anomalies could be attributed to weaknesses in the internal control system at the Federal House of Representatives of the National Assembly.\nRecommendations; The Clerk to the National Assembly is requested to furnish reasons why running costs granted to Honourable members were notretired, recover unretired running costs of N2.5billion and remit to the Treasury; iii.\nForward evidence of remittance to the Public Accounts Committees of the National Assembly, iv."
  },
  {
    "headline": "EXCLUSIVE: National Assembly Members Fail To Provide Documents Of How N2.5billion Running Costs In Six Months Were Spent",
    "summarized_story": "The House of Representatives, the lower chamber of the National Assembly, has failed to produce documents to prove how its members spent N2.5billion running costs paid to them for six months in 2019.\nThe sum of N2,550,000,000.00 was granted to Honorable members as running costs between July and December 2019 as shown below; North East, N187,000,000.00; South South, N272,000,000.00; South East, N442,000,000.00; North Central, N391,000,000.00; South West 629,000,000.00, and North West, N629,000,000.00.\nThe above anomalies could be attributed to weaknesses in the internal control system at the Federal House of Representatives of the National Assembly.\nRecommendations; The Clerk to the National Assembly is requested to furnish reasons why running costs granted to Honourable members were notretired, recover unretired running costs of N2.5billion and remit to the Treasury; iii.\nForward evidence of remittance to the Public Accounts Committees of the National Assembly, iv."
  },
  {
    "headline": "EXCLUSIVE: How Code Of Conduct Tribunal Engaged In N516million Illegal Contracts, Projects Without Documents – Audit Report",
    "summarized_story": "The Office of the Auditor-General of the Federation has sent queries to the Code of Conduct Tribunal in Abuja over the alleged award of illegal contracts and projects without documents totalling over N516million.\nThe audit report is titled, “Auditor-General for the Federation’s Annual Report on Non-Compliance/Internal Control Weaknesses Issues in Ministries, Departments and Agencies of the Federal Government of Nigeria for the Year Ended 31st December, 2019.”It partly reads, “CODE OF CONDUCT TRIBUNAL - At the Code of Conduct Tribunal (CCT), the following observations were made; i.\nThe Tribunal has fifteen (15) Motor Vehicles which were acquired between 2008 and 2018 for amounts totalling N1,029,269.22.\n“ISSUE 2: PAYMENTS FOR CAPITAL PROJECTS WITHOUT SUPPORTING DOCUMENTS (=N434,500,000.00) Audit observed that: i.\n“Recommendations; The Chief Registrar is requested to: i. Furnish reasons why payments for capital projects were made without supporting documents as required by extant regulations."
  },
  {
    "headline": "EXCLUSIVE: How Code Of Conduct Tribunal Engaged In N516million Illegal Contracts, Projects Without Documents – Audit Report",
    "summarized_story": "The Office of the Auditor-General of the Federation has sent queries to the Code of Conduct Tribunal in Abuja over the alleged award of illegal contracts and projects without documents totalling over N516million.\nThe audit report is titled, “Auditor-General for the Federation’s Annual Report on Non-Compliance/Internal Control Weaknesses Issues in Ministries, Departments and Agencies of the Federal Government of Nigeria for the Year Ended 31st December, 2019.”It partly reads, “CODE OF CONDUCT TRIBUNAL - At the Code of Conduct Tribunal (CCT), the following observations were made; i.\nThe Tribunal has fifteen (15) Motor Vehicles which were acquired between 2008 and 2018 for amounts totalling N1,029,269.22.\n“ISSUE 2: PAYMENTS FOR CAPITAL PROJECTS WITHOUT SUPPORTING DOCUMENTS (=N434,500,000.00) Audit observed that: i.\n“Recommendations; The Chief Registrar is requested to: i. Furnish reasons why payments for capital projects were made without supporting documents as required by extant regulations."
  },
  {
    "headline": "Senior Lawyer, Ozekhome Disagrees With Ex-President Obasanjo Over ‘Oil Belongs To Nigeria, Not Niger Delta’ Statement",
    "summarized_story": "A Senior Advocate of Nigeria, Chief Mike Ozekhome, has disagreed with former President Olusegun Obasanjo over his statement that Niger Delta cannot lay claim to the crude oil found in the region.\nMike OzekhomeHe insisted that just as the Niger Delta’s oil belongs to the Nigerian federation, the minerals in other parts of the country also belonged to the country.\nThe statement read, “Former president Olusegun Obasanjo has theorized that the oil and gas found in the Niger Delta region belong to the federal government, and not to the oil-bearing communities.\n“Help me inform Obasanjo that Nigeria operates a federal system of government, and that federalism is fiscal and plural.\n“The Niger Delta region has been repressed, suppressed, marginalized and neglected."
  },
  {
    "headline": "Wike: How I was arrested alongside my family members over murder charge",
    "summarized_story": "Nyesom Wike, governor of Rivers, says while he was a student, all the male members of his family were arrested over a murder charge arising from a chieftaincy dispute.\n“There was a time that the entire family was charged for murder — every male was taken away,” Wike was quoted as saying according to a statement by Kelvin Ebiri, his spokesman.\nAdvertisement“We only had women left in the house with children between the ages of 1 and 5.\n“Throughout my chairmanship matter in 1998, when we had election down to April 4, 2000 when Supreme Court finally decided my matter, he (Ukala) never took a dime, one naira,” Wike said.\n“Then my governorship election, most people may not believe it, from governorship tribunal down to Supreme Court, he never collected one dime.”He described Ukala as a “refined and discipline lawyer”, and praised him for being a “worthy mentor”."
  },
  {
    "headline": "Wike: How I was arrested alongside my family members over murder charge",
    "summarized_story": "Nyesom Wike, governor of Rivers, says while he was a student, all the male members of his family were arrested over a murder charge arising from a chieftaincy dispute.\n“There was a time that the entire family was charged for murder — every male was taken away,” Wike was quoted as saying according to a statement by Kelvin Ebiri, his spokesman.\nAdvertisement“We only had women left in the house with children between the ages of 1 and 5.\n“Throughout my chairmanship matter in 1998, when we had election down to April 4, 2000 when Supreme Court finally decided my matter, he (Ukala) never took a dime, one naira,” Wike said.\n“Then my governorship election, most people may not believe it, from governorship tribunal down to Supreme Court, he never collected one dime.”He described Ukala as a “refined and discipline lawyer”, and praised him for being a “worthy mentor”."
  },
  {
    "headline": "Buhari to manufacturers: We’ll improve access to FX for importation of raw material",
    "summarized_story": "The federal government says it will improve access to foreign exchange for the importation of raw materials and machines unavailable locally.\nAdvertisementPresident Muhammadu Buhari said this in Abuja on Wednesday while responding to requests from the manufacturing sector on how to increase its contribution to the Nigerian economy.\n“Our strategic plan to boost manufacturing activities in the country is on course,” the statement quoted Buhari as saying.\n‘‘Let me assure you that this administration is fully aware that the survival of Nigeria lies in agriculture and having a viable domestic manufacturing sector.\n‘‘A strong manufacturing sector creates more jobs and wealth for our people."
  },
  {
    "headline": "Buhari to manufacturers: We’ll improve access to FX for importation of raw material",
    "summarized_story": "The federal government says it will improve access to foreign exchange for the importation of raw materials and machines unavailable locally.\nAdvertisementPresident Muhammadu Buhari said this in Abuja on Wednesday while responding to requests from the manufacturing sector on how to increase its contribution to the Nigerian economy.\n“Our strategic plan to boost manufacturing activities in the country is on course,” the statement quoted Buhari as saying.\n‘‘Let me assure you that this administration is fully aware that the survival of Nigeria lies in agriculture and having a viable domestic manufacturing sector.\n‘‘A strong manufacturing sector creates more jobs and wealth for our people."
  },
  {
    "headline": "NFF appoints Jose Peseiro as Super Eagles head coach",
    "summarized_story": "Jose Peseiro has been appointed as the new head coach of the Super Eagles.\nAdvertisementThe Nigeria Football Federation (NFF) announced Peseiro’s appointment in a communique on Wednesday evening.\nAdvertisement“After careful consideration of a memo presented by Chairman of the Technical and Development Sub-Committee, the Executive Committee endorsed a proposal for the appointment of Mr Jose Peseiro as the new Head Coach of the Super Eagles, following the end to the relationship with Mr Gernot Rohr,” the NFF communique read.\n“However, the Committee resolved that Mr Augustine Eguavoen, named the interim Head Coach, will lead the Super Eagles to the AFCON 2021 in Cameroon with Mr Peseiro only playing the role of Observer.\nUntil his appoint as the Nigerian senior national team coach, Peseiro was Venezuela’s gaffer."
  },
  {
    "headline": "Africa’s tech ecosystem pays tribute to Nnena Nkongho",
    "summarized_story": "The African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence.\nNnena Nkogho by Kunmi OwopetuAn ardent believer in the power of technology, she explained why she eagerly supports the African tech ecosystem, in this interview.\nShe was a trailblazer and deeply committed to the African tech ecosystem, especially at a time when most LPs did not believe in the asset clas.\nNnena Nkongho.\nRaj Kulasingam, Senior Counsel, DentonsI met Nnena many years ago when venture in Africa was a desert."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "GetEquity is changing startup investment in Africa. But how?",
    "summarized_story": "GetEquity, a Nigeria-based investment platform, came into the market with the mantra of “challenging the status quo of startup financing and venture capital” in Africa.\nInitially, the co-founders didn’t set out to democratise startup investment in Africa.\nOn GetEquity, startups get instant access to several angel investors, syndicates and institutional investors.\nApparently, GetEquity operates like every other VC: its team of diverse backgrounds—law, marketing, investment, business development—analyse the potential growth of a startup before onboarding them on their platform.\nIf that’s the case, one can chose to question the validity of the disruption the company promises to bring into startup investment."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Web3: The Internet evolution to come in 2022 and beyond",
    "summarized_story": "Share this article:If you’ve come across the buzzword, non-fungible tokens (NFT) on the Internet, chances are you have also seen the latest buzzword — Web3.\nA decentralised World Wide Web owned by no one but run based on everyone’s decisions.\nHe envisioned the Web in three ways: a Web of documents (Web1), a Web of people (Web2) and a Web of data (Web3).\nThe same way Web3 is causing a stir now on the Internet, the coming of Web2 also did the same thing.\nLike Web2, Web3 wants to make the Internet more inclusive but, in contrast, take control away from big corporations like Facebook, Google, and Amazon."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Outlook for 2022: Telcos to focus on cloud, Internet of things, 5G adoption",
    "summarized_story": "After emerging from the COVID-19 pandemic, the Nigerian telecom industry is entering a new phase and will be faced with a new set of challenges.\nThis is due to the new innovations – cloud technology, internet of things (IoT), and 5G network adoption, among others, brought about by the digital adoption of the sector in the outgoing year.\nAccording to experts, 2022 is projected to be a unique transition year for the telecom industry.\n“We anticipate a gradual migration of cloud technology applications, and data being built inside Nigeria as opposed to outside Nigeria,” Teniola said.\nIn the case of broadband penetration in 2022, the industry is expected to have access to forex in a meaningful manner."
  },
  {
    "headline": "‘Cheap Lake rice’ eludes Lagosians as debt stalls mill renovation",
    "summarized_story": "CIBA Construction Limited; Henry Karll Company Limited; and Bühler Holding, are the three construction companies involved in the project.\nWhen contacted via email, the Henry Karll Company declined to provide answers.\n“Following your email inquiring about the status of Lagos State Rice Mill Project, kindly note that Henry Karll Company Limited has not been authorized to speak to the media.\nSimilarly, CIBA Construction Limited did not respond to a mail from BusinessDay, neither was there response following several calls made to a number gotten from its website.\nStill seeking answers, BusinessDay reached out to Adenike Sodipo, information officer at the Lagos State Ministry of Agriculture, who declined comments unless permitted by the commissioner."
  },
  {
    "headline": "11 key moments of 2021",
    "summarized_story": "2021 was the year of firsts, even if many were unpleasant – a year of triumphs, happy surprises, and bruising pains.\nBelow are some of the key moments of 2021 with significant social, economic and political implications for Nigeria.\nSuper Tucano fighter jets arriveFrom June 2021, Nigeria began taking delivery of the first batch of the Super Tucano Fighter jets it ordered in 2018.\nScientists in South Africa first alerted the world of its discovery and was slammed with travel bans by Western countries.\nNigeria start-ups attract global venture capitalIn 2021, the Nigerian tech ecosystem especially saw the infusion of much capital into their start-up operations."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "Obaseki charges Edo PDP on unity, inclusion, hosts party members in Oredo LGA – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge during a get-together for PDP members in Oredo Local Government Area (LGA), held in Benin City on Tuesday.\n“I am a digital governor; I work with data.\nIt will affect everything else, including the number of Senior Special Assistants (SSAs) and Special Assistants (SAs).\n“The vehicle that we are using, which is the PDP, is not the exclusive right of anybody.\nSo, we must work together to build the party,” he charged."
  },
  {
    "headline": "Edo govt parleys workers, seeks sustained collaboration to realize MEGA Agenda – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for the support of all stakeholders to sustain ongoing reforms across all sectors of the state, reassuring that the government is committed to realizing the Making Edo Great Again (MEGA) Agenda and achieving economic prosperity for Edo people.\nThe unions include the state’s chapters of the Nigeria Labour Congress (NLC), Trade Union Congress (TUC), National Union of Teachers (NUT) and Joint Negotiating Council (JNC), among others.\nReassuring the government’s commitment to improving the state’s civil and public service for effective and efficient service delivery, Okungbowa urged the unions to support the government’s drive at repositioning the service.\nOisamaye Godwin and the Secretary, Edo NLC, Comr.\nBarry Imade hailed Governor Obaseki for prioritizing the reform of the state’s civil and public service."
  },
  {
    "headline": "NFF appoints Jose Peseiro as Super Eagles head coach",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Football Federation (NFF) has announced the appointment of Jose Peseiro, a Portuguese football manager, as the new head coach of the Super Eagles.\nThe NFF, however, said that Mr. Augustine Eguavoen, who was appointed interim manager following the sacking of Gernot Rohr weeks ago, will lead the Super Eagles to the African Cup of Nations starting on January 9 in Cameroon, with the new head coach playing observer role.\n“After careful consideration of a memo presented by Chairman of the Technical and Development Sub-Committee, the Executive Committee endorsed a proposal for the appointment of Mr Jose Peseiro as the new Head Coach of the Super Eagles, following the end to the relationship with Mr Gernot Rohr,” the NFF said in a communique.\n“However, the Committee resolved that Mr Augustine Eguavoen, named the interim Head Coach, will lead the Super Eagles to the AFCON 2021 in Cameroon with Mr Peseiro only playing the role of Observer.\n“It was unanimously agreed that the AFCON is a good avenue for Mr Peseiro to launch a working relationship with Mr Eguavoen, who will revert to his role as Technical Director (hence Mr Peseiro’s immediate boss) after the AFCON.”Facebook Notice for EU!"
  },
  {
    "headline": "Ogun Assembly passes N350.735bn 2022 appropriation bill",
    "summarized_story": "Idowu Olakunle, AbeokutaOgun State House of Assembly yesterday passed the the state’s appropriation bill for the 2020 fiscal year, presented to it by the state governor, Prince Dapo Abiodun.\nThe passage of the Bill was consequent upon the presentation of the report of the House Committee on Finance and Appropriation by its Chairman, Hon.\nThe appropriation bill was later read and adopted clause-by-clause by the Committee of the House presided by the Speaker, Rt.\nThe Assembly in the course of legislative process on the appropriation bill, carried out slight adjustments in the recurrent expenditures of about 144 agencies, just as the capital expenditures of 38 other agencies were equally adjusted.\nResponding, the Speaker thanked his colleagues for their robust contributions, as therefore charged the bill to the House Committee on b"
  },
  {
    "headline": "Compensation a prerequisite for resumption of oil activities, Ogoni group tells FG",
    "summarized_story": "Adebayo ObajemuThe Ogoni Liberation Initiative has advised the federal government to compensate the people of Ogoni in Rivers State, before mulling a thought of resumption of crude oil exploration activities in the area.\nThe compensation, the group says is for years of environmental pollution the people of Ogoni have suffered as a result of reckless oil exploration and exploitation by Shell.\nSpeaking on the issue, Mr. Douglas Fabeke, President of the group made a case for the resettlement of host communities that have suffered a high level of pollution by oil facilities.\nFabeke explained that some oil wells located in close proximity to residential homes made living hazardous in Ogoniland.\n“Adopt the report of the African Commission on Human and Peoples’ Right on Ogoni Case."
  },
  {
    "headline": "Insecurity: Buy guns, defend yourselves, Masari advises residents of Katsina",
    "summarized_story": "Adebayo ObajemuAminu Masari has for the second time in one year advised residents of Katsina State to buy guns and defend themselves against bandits since it has become clear according to him that security officials alone cannot tackle insecurity in the state.\nHundreds of people have been killed or kidnapped in Katsina this year with thousands more displaced from their homes.\nSpeaking during a media parley with journalists at the Muhammadu Buhari House in Katsina, Mr Masari said the number of security personnel is not enough to tackle the situation.\n“We’ll support those who come with the initiative to procure arms because residents need to also complement the efforts of security agencies.\nMr Masari said the police would register all guns bought by the residents to ensure they are put to the right use."
  },
  {
    "headline": "Nigerians In Italy Laud Federal Govt For Responding To Passport Demand",
    "summarized_story": "The National Union of Nigerian Associations in Italy (NUNAI) has lauded the Federal Government of Nigeria for promptly responding to its appeal for the supply of passport booklets to the Embassy in Italy.\nSecretary of NUNAI, Frank David, who described the report as a fallacy, said the total number of Nigerians in Italy is not up to a million.\nDavid noted that it was impossible for over one million Nigerians supposedly living in Italy to be stranded for lack of passport.\nADVERTISEMENTHe noted that currently, there are 209,000 Nigerians in Italy, 180,000 are legally documented with 29,000 yet to be documented.\n“The publication by the Nigerians in Diaspora Organisation Europe (NIDOE) which claims that 1.5 million Nigerians in Italy are in need of passport booklets in Italy is a fallacy and we debunk such claims."
  },
  {
    "headline": "How Ukala Saved My Political Career In 1998 – Wike",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has narrated how a Senior Advocate of Nigeria (SAN), Emmanuel Ukala, saved his political career in 1998, when some politicians in Obio/Akpor local government area of the state ganged up and conspired with the police to frame him up for armed robbery.\n“Throughout my chairmanship matter in 1998, when we had election down to April 4, 2000 when Supreme Court finally decided my matter, he (Ukala) never took a dime, one Naira,” Wike said.\nADVERTISEMENTHe also recalled that before he proceeded to then then Rivers State University of Science and Technology, now Rivers State University, to study Law, Ukala had been his family lawyer.\nJustice Suzette Nyesom Wike, said it took the intervention of Ukala as their counsel for them to be discharged and acquitted.\nHowever, Wike confessed that when he approached Ukala, whom he described as a mentor, he offered him free legal services."
  },
  {
    "headline": "Enugu Police Chief Tasks Personnel On Discipline, Professionalism",
    "summarized_story": "The Commissioner of Police, Enugu State Command, Abubakar Lawal, has charged police personnel to maintain high level of discipline and professionalism.\nHe gave the charge after he concluded his familiarisation tour of duty to Agbani, Enugu Metro, Nsukka, Oji-River and Udenu Area Commands in the State.\nOthers included representatives of sister security agencies, the Neighborhood Watch Group and the Forest Guards.\nHe warned that anything in the contrary will be met with appropriate disciplinary sanctions even as he applauded the stakeholders for their continued partnerships and confidence in the Police.\nHe urged them to remain supportive by promptly providing credible security information and intelligence, which he described as “prerequisites for the effective policing of any given human society.”The Commissioner was accompanied on the tours by members of his Management Team and other Senior Senior Police officers of the Enugu Command."
  },
  {
    "headline": "Enugu Police Chief Tasks Personnel On Discipline, Professionalism",
    "summarized_story": "The Commissioner of Police, Enugu State Command, Abubakar Lawal, has charged police personnel to maintain high level of discipline and professionalism.\nHe gave the charge after he concluded his familiarisation tour of duty to Agbani, Enugu Metro, Nsukka, Oji-River and Udenu Area Commands in the State.\nOthers included representatives of sister security agencies, the Neighborhood Watch Group and the Forest Guards.\nHe warned that anything in the contrary will be met with appropriate disciplinary sanctions even as he applauded the stakeholders for their continued partnerships and confidence in the Police.\nHe urged them to remain supportive by promptly providing credible security information and intelligence, which he described as “prerequisites for the effective policing of any given human society.”The Commissioner was accompanied on the tours by members of his Management Team and other Senior Senior Police officers of the Enugu Command."
  },
  {
    "headline": "Insecurity: Deploy Drones Everywhere, Ex-Spy Tells Federal Govt",
    "summarized_story": "A former Army Intelligence Officer, Colonel Hassan Stan-Labo (rtd) has called on the Federal Government to deploy drones in the fight against insecurity across the country.\nNigeria has been grappling with a series of security challenges ranging from banditry to terrorism, kidnappings, militancy, among others.\nIn the North-West, Kaduna, Katsina, Zamfara, Kaduna, Sokoto and Kebbi State, have witnessed incessant attacks by armed bandits.\nAccording to him, the current administration has not done much to enhance manpower in the nation’s security architecture.\n“I have not yet seen a reasonable level of urgency being exerted by this government to see that we enhance on manpower."
  },
  {
    "headline": "Arms for self defence: CAN, others condemn Masari",
    "summarized_story": "The remarks credited to Governor Aminu Bello Masari of Katsina State that his administration would assist citizens to acquire arms and defend themselves against bandits, have continued to elicit reactions.\nChairman of CAN in Kaduna State,Rev.John Joseph Hayab,said “the public talk by Gov Masari about self-defence is not new to us and our constitution.\nThose we have been praying and hoping that they will defeat the terrorist for us are saying that they can not help us”.\nOn his part, Mutala Muhammad of Arewa Defense League ( ADL) ,said “we welcome with optimism the statement by the Katsina State Governor, Hon.\nMasari should also go further to organise general prayers for God’s intercession,” he said."
  },
  {
    "headline": "Arms for self defence: CAN, others condemn Masari",
    "summarized_story": "The remarks credited to Governor Aminu Bello Masari of Katsina State that his administration would assist citizens to acquire arms and defend themselves against bandits, have continued to elicit reactions.\nChairman of CAN in Kaduna State,Rev.John Joseph Hayab,said “the public talk by Gov Masari about self-defence is not new to us and our constitution.\nThose we have been praying and hoping that they will defeat the terrorist for us are saying that they can not help us”.\nOn his part, Mutala Muhammad of Arewa Defense League ( ADL) ,said “we welcome with optimism the statement by the Katsina State Governor, Hon.\nMasari should also go further to organise general prayers for God’s intercession,” he said."
  },
  {
    "headline": "Peru displaces Maria Carey’s Christmas Song to become Number 1 on UK Apple chart",
    "summarized_story": "Nigeria Music “champion”, Fireboy has hit the UK Apple Charts with his song, ‘Peru’ featuring Ed Sheeran.\nThe song has displaced Marey Carey’s ‘All I want for Christmas Song’.\nThe collaboration between Fireboy and Ed Sheeran seemed to have paid off, because of the massive appeal that the song has received from fans and users of the Apple platform in the UK.\nPeru is also one of the top five songs that rocked the airwaves this year.\nFireboy recently dropped the single and made a video of the Peru Remix during the yuletide."
  },
  {
    "headline": "Peru displaces Maria Carey’s Christmas Song to become Number 1 on UK Apple chart",
    "summarized_story": "Nigeria Music “champion”, Fireboy has hit the UK Apple Charts with his song, ‘Peru’ featuring Ed Sheeran.\nThe song has displaced Marey Carey’s ‘All I want for Christmas Song’.\nThe collaboration between Fireboy and Ed Sheeran seemed to have paid off, because of the massive appeal that the song has received from fans and users of the Apple platform in the UK.\nPeru is also one of the top five songs that rocked the airwaves this year.\nFireboy recently dropped the single and made a video of the Peru Remix during the yuletide."
  },
  {
    "headline": "NFF appoints Jose Peseiro new coach for Super Eagles",
    "summarized_story": "The Nigeria Football Federation (NFF) has announced Jose Peseiro a new permanent coach for Super Eagles, who will take over from interim coach Augustine Eguavoen.\nThe announcement was made in a communique issued after the virtual Executive Committee meeting of the body.\n“After careful consideration of a memo presented by Chairman of the Technical and Development Sub-Committee, the Executive Committee endorsed a proposal for the appointment of Mr Jose Peseiro as the new Head Coach of the Super Eagles, following the end to the relationship with Mr Gernot Rohr.\n“However, the Committee resolved that Mr Augustine Eguavoen, named the interim Head Coach, will lead the Super Eagles to the AFCON 2021 in Cameroon with Mr Peseiro only playing the role of Observer.\nPeseiro until his appointment was Venezuela coach."
  },
  {
    "headline": "Schwarzenegger finally terminates marriage with Shriver",
    "summarized_story": "Arnold Schwarzenegger and Maria Shriver have officially finalised their divorce, more than 10 years after proceedings began.\nCourt documents filed on Tuesday showed that a final settlement had been reached between the “Terminator” star and the U.S. journalist, formally ending their 35 year marriage.\nThe terms of the divorce settlement were not made public.\nShriver, the niece of slain U.S. President John F. Kennedy, filed for divorce in 2011 after Schwarzenegger ended his term as California Governor.\nSchwarzenegger and Shriver married in 1986 and had four children together"
  },
  {
    "headline": "Insecurity: The Military Performed Well This Year – MUN",
    "summarized_story": "The Mothers for United Nigeria (MUN) has described 2021 as a trying year for Nigeria, but said the military has performed excellently well in the face of the security challenges.\nIn an end of year news release in Abuja on Wednesday, MUN said the Armed Forces of Nigeria has been able to significantly curtail the insurgency in the North-East.\nThe group commended the various sacrifices of the AFN in 2021 and prayed for their safety in 2022 and beyond.\nAccording to MUN, “The year 2021 has been full of challenges, but the Armed Forces of Nigeria have stood their ground refusing to be intimidated.\n“We, MUN, are convinced that the Armed Forces of Nigeria under the leadership of Gen. LEO Irabor is on the right track to make the country safe for all."
  },
  {
    "headline": "BREAKING: NFF Appoint New Coach For Super Eagles",
    "summarized_story": "The Nigeria Football Federation has appointed Jose Paseiro as the new Super Eagles manager.\nThe 61-year-old was in charge of the Venezuela national team until August and has also coached Sporting Lisbon, FC Porto, and Al Ahly of Egypt.\nThe Executive Committee of the NFF stated this in a communique made available on Wednesday to the media.\n“However, the Committee resolved that Mr Augustine Eguavoen, named the interim Head Coach, will lead the Super Eagles to the AFCON 2021 in Cameroon with Mr Peseiro only playing the role of Observer.\nHe resigned in August, having not been paid for over a year amidst the South American country’s economic crisis."
  },
  {
    "headline": "NEXT Mall Inferno Catastrophic, Great Loss To FG — Minister",
    "summarized_story": "The fire at Next Cash and Carry, a famous commercial complex in Abuja, is an unquantifiable loss to the Federal Government, according to Sadiya Farouq, Minister of Humanitarian Affairs, Disaster Management, and Social Development.\nIt is catastrophic and a loss not just to the management of this company but to the government and the country at large.\n“Immediately the fire started, we deployed the National Emergency Management Agency NEMA together with other sister agencies to come and assist in rescue operations.\nWe have had all manner of high profile persons coming in to assist and see what happened.\nWe will need the support of the government as we streamline plans to open a new store.”Next Cash and Carry shopping mall in Abuja went up in flames on Sunday morning."
  },
  {
    "headline": "Buhari Govt Planning To Eliminate Me, I Can’t Be Freed Legally – Sunday Igboho Claims",
    "summarized_story": "Yoruba nation agitator, Sunday Igboho has accused the Nigerian Government of attempting to eliminate him in Benin Republic.\nIgboho explained that the Nigerian Government was planning to eliminate him to silence the Yoruba Nation agitation.\nHe said: “The enemies are trying to eliminate Igboho.\nHe bemoaned the diplomatic approach’s failure, noting that the President of the Benin Republic, Talon, had refused to release Igboho.\nFrom issuing an ultimatum to Fulani herders in the Southwest, Igboho delved into agitation for Yoruba Nation."
  },
  {
    "headline": "Nigeria loses $5bn gold to smuggling in 6 years as Buhari makes crucial demands",
    "summarized_story": "The Solid Minerals Development Fund should work with all relevant Government agencies to identify the support and funding needed to deliver on this aggregation target.\nPresident Buhari urged PAGMI to ensure the Solid Minerals Development Fund fast-tracks delivery of other directives to support the Presidential Fertilizer Initiative.\nHe said all stakeholders should conclude the ongoing assignment of recommending a portion of accruals to be dedicated to the Solid Minerals Development Fund.\n“The dedication of a portion of accruals to create a sustainable income stream for the Solid Minerals Development Fund is essential to delivering the mandates assigned to the Fund.\nThe Committee had in 2020 presented the first ever artisanal gold mined and sourced within Nigeria to the president."
  },
  {
    "headline": "Resource location-disputes: Osinbajo to broker truce among Kogi, Anambra, Rivers, others",
    "summarized_story": "Vice President Yemi Osinbajo is to broker truce among Rivers, Kogi, Anambra states and some others over the contentious boundary conflicts and ownership of some resource locations within and around the states.\nThe meeting, according to sources, became necessary following futile efforts by the National Boundary Commission (NBC) to get necessary support from some states to address the conflicts.\nKogi and Anambra have been in fierce legal battle over ownership of oil wells found in Ibaji and Agulere, an altercation that defied all technical and professional approaches to resolve.\nKogi, Anambra are in contention over crude oil found in Ibaji and Agulere, while Lagos and Bauchi are on the fringes demanding inclusion in the elite oil-producing club.\nThe disputes between two communities of Odeke in Ibaji local government area of Kogi and Aguleri in Anambra state has come to an end."
  },
  {
    "headline": "Insecurity: Hamza Al-Mustapha exposes those supplying weapons, hard drugs to bandits, Boko Haram, others",
    "summarized_story": "There are people spending their money to cause crisis and it appears they are succeeding.\nHe alleged that the few Nigerians benefitting from the country’s mineral resources seemed to be unstoppable.\nThey are powerful and can fight any government that tries to stop them.\n“Fighting them will require tact, reverting the laws and educating those carrying out the laws and those in government.\nThey should know where they lag behind and where they are found wanting."
  },
  {
    "headline": "District Head, Two Sons Killed As Bandits Attack Zamfara Community",
    "summarized_story": "Bandits have killed three persons during an attack on Gada community in Bungudu Local Government Area of Zamfara State.\nDuring the invasion of the community very early on Wednesday, the armed men killed the District Head of Gada, Umaru Bawan-Allah, and his two sons.\nThe Commissioner for Information in Zamfara, Ibrahim Dosara, confirmed the attack to Channels Television hours after the incident.\nAccording to him, the armed men abducted many others from the community, in addition to killing the district head of Gada and his two sons.\nGada community is about seven kilometres from Bungudu town, the headquarters of the local government."
  },
  {
    "headline": "NFF Appoints New Super Eagles Head Coach",
    "summarized_story": "The Nigeria Football Federation has endorsed a proposal by its Technical and Development sub-committee for the appointment of Portuguese manager Jose Peseiro as the new head coach of the Super Eagles.\nThe executive committee of the NFF has, however, resolved that the interim head coach Augustine Eguavoen will be in charge of the three-time African champions for the African Cup of Nations in Cameroon while coach Peseiro will serve as an observer.\nThe 61-year-old was in charge of the Venezuela national team until August and has also coached Sporting Lisbon, FC Porto, and Al Ahly of Egypt.\nMeanwhile, the executive committee has mandated the Technical and Development Committee and the NFF secretariat to organise a friendly match for the Super Eagles when the team arrives in Garoua for the AFCON 2021.\nThey have also been mandated to arrange matches for the Super Eagles and the Super Falcons in the upcoming FIFA windows."
  },
  {
    "headline": "COVID-19: ‘Let’s Make Recovery Our Resolution,’ UN Chief Says In New Year Message",
    "summarized_story": "United Nations Secretary-General, Antonio Guterres, has appealed to countries across the globe to make recovery for people, the planet, and prosperity their resolution for 2022.\nHe made the appeal in his New Year message, stressing the need for countries to come together and make recovery for people and the planet their priority as the world continues to recuperate from the COVID-19 pandemic.\nAnd for an economic rescue, he stated that wealthier countries must support the developing world with “financing, investment and debt relief”.\nTo heal from mistrust and division, the UN chief affirmed that a new emphasis must be placed “on science, facts and reason”.\n“Together, let’s make recovery our resolution for 2022,” the Secretary-General concluded."
  },
  {
    "headline": "Family Seeks Justice Over Killing Of Daughter For Alleged Ritual",
    "summarized_story": "﻿The family of a 29-year-old, Elohor Oniorosa, allegedly killed during a visit to her boyfriend, Osaretin David, on Christmas eve is seeking justice.\nSpeaking to Channels Television, the victim’s mother, Comfort Oniorosa, said her daughter left the house for her boyfriend’s place thinking that his illness would have gotten worse.\nREAD ALSO: Man Flees After Killing Girlfriend For Suspected Ritual In EdoHe thereafter led Channels Television to David’s apartment where the crime allegedly took place.\nThe landlord, Ifueko Ogieriakhi, was invited by the police to give a statement in which he explained why he locked up the suspect’s apartment.\nBut the police authorities said they are ever determined to arrest the fleeing suspect and prosecute him if liable for the murder."
  },
  {
    "headline": "Welbeck’s Late Goal Spoils Chelsea’s Title Push",
    "summarized_story": "The 28-year-old was impressive as the powerful focal point of Chelsea’s attack, holding the ball up well and menacing the Brighton defence with his physical presence.\nChelsea wing-back Reece James limped off in the 27th minute with an apparent hamstring injury, to be replaced by Marcos Alonso.\nThey went ahead immediately when Lukaku shook off the attentions of Maupay after a tussle to power a header past goalkeeper Robert Sanchez.\nBrighton’s complaints were waved away as Chelsea — for so long top of the league this season — celebrated.\nThe impressive Yves Bissouma stung the hands of Mendy early in the second half as the visitors continued to trouble Chelsea."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "How Police arrested Okorocha's son-in-law, Uche Nwosu during Church service -",
    "summarized_story": ""
  },
  {
    "headline": "Thugs Attack PDP Congress Venue, Destroy Vehicles, Chairs, Others -",
    "summarized_story": "Unknown thugs have attacked venue of the Zamfara State Peoples Democratic Party State CongressThe congress is to enable party members to Elect Officials that will steer the ship of the party in the next three yearsThis follows the recent Defection of the state Governor Bello Matawalle from the PDP to the ruling APCThe thugs attacked the venue of the congress and started pelting stones on some members of the party who were on ground before the commencement of the congressVehicles, Chairs, Canopies and other valuables at the venue were destroyed by unidentified political thugs who’s mission was to prevent the conduct of the congressAuthorities of the party says no amount of intimidation will prevent them from conducting their party Congresses which is their Constitutional rightThe Zamfara State PDP has relocated the congress to another venue which seems to be more saferThe Congress is ongoing in an undisclosed venueEfforts to speak to police in the state proves abortive as the spokesperson of the command is not responding to phone calls"
  },
  {
    "headline": "Respect Buhari, keep to February 5 national convention date, group tells Buni's CECPC -",
    "summarized_story": "A group within the governing All Progressives Congress (APC) under the umbrella of Progressive Mandate Movement (PMM) has challenged Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee (CECPC) to ensure that the party’s national convention does not fail to hold by 5th of February, 2022.\nThe group also demanded immediate release of processes leading to the national convention, adding that if nothing is done by January 5th 2022, the National Secretariat will be made ungovernable for the CECPC.\nThe statement claimed that President Muhammadu Buhari had wanted the APC National Convention to hold in December 2021 but due to appeal by the Buni’s CECPC, the presidency agreed to February 2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party some advantages, making it look like nobody is in charge of the governing party.\n“We therefore call on Governor Mai Mala Buni-led National Caretaker Committee not to go beyond February 5 to hold our party’s National Convention."
  },
  {
    "headline": "World Needs to be Resolute About Recovery in 2022, UN Sec-Gen Guterres Says – Arise News",
    "summarized_story": "World Needs to be Resolute About Recovery in 2022, UN Sec-Gen Guterres SaysThe United Nations Secretary-General, António Guterres has said the world should be resolute about recovery in 2022.\nHe however said they are tests that humanity can pass “if we commit to making 2022 a year of recovery for everyone.\nHe said: “Recovery from the pandemic — with a bold plan to vaccinate every person, everywhere.\n“Recovery for our economies — with wealthier countries supporting the developing world with financing, investment and debt relief.\nHe said: “Together, let’s make recovery our resolution for 2022."
  },
  {
    "headline": "Arsenal Manager Arteta to Miss New Year’s Day Clash with Man City after Testing Positive for Covid",
    "summarized_story": "Arsenal boss Mikel Arteta will not be on the touchline for his side’s Premier League clash against Manchester City after he tested positive for Covid-19.\nHowever, Arteta must now self-isolate for at least seven days after he tested positive for coronavirusArteta was the first high profile figure in the Premier League to test positive for coronavirus in March 2020, which led to the postponement of the Gunners’ clash with City.\nIt comes as the Omicron variant causes mass disruptions to the Premier League, with a number of fixtures being postponed in the last fortnight due to the rapid increase in cases across the United Kingdom.\nThe Premier League recorded its highest number of positive cases for a seven-day period in the week before Boxing Day, reflecting the increases seen countrywide.\nDespite the disruption, clubs have agreed to continue with the league season to the best of their ability."
  },
  {
    "headline": "Biden, Putin to Hold Call Over Stepped Up Security Demands",
    "summarized_story": "US President Joe Biden and Russia President Vladimir Putin will speak Thursday as the Russian leader has stepped up his demands for security guarantees in Eastern Europe.\nThe two leaders will discuss “a range of topics, including upcoming diplomatic engagements,” National Security Council spokeswoman Emily Horne said in a statement announcing the call.\nThe talks come as the U.S. and Western allies have watched the buildup of Russian troops near the border of Ukraine, growing to an estimated 100,000 and fueling fears that Moscow is preparing to invade Ukraine.\nSecretary of State Antony Blinken spoke on Wednesday with Ukrainian President Volodymyr Zelenskyy.\nState Department spokesman Ned Price said Blinken “reiterated the United States’ unwavering support for Ukraine’s independence, sovereignty, and territorial integrity in the face of Russia’s military buildup on Ukraine’s borders.”"
  },
  {
    "headline": "Late Diego Maradona’s Brother, Hugo, Dies Of Heart Attack At 52",
    "summarized_story": "Hugo Maradona, the younger brother of football legend Diego, has passed away at the age of 52 after suffering a heart attack.Hugo suffered the fatal attack at his home in Naples, the city where Diego played at the peak of his career and where Hugo played as a junior, around 11.50am Tuesday.The club said Napoli president Aurelio De Laurentiis and the team “come together around Maradona’s family and unite with them in the pain of Hugo’s death”.\nIt comes just 13 months after a cardiac arrest killed Diego – Argentina’s world cup hero and one of the greatest ever to play the game – who died in Argentina in November 2020 at the age of 60."
  },
  {
    "headline": "Electoral Act Amendment Bill: El-Rufai Backs Buhari’s Veto",
    "summarized_story": "Governor of Kaduna State, Mallam Nasir El-Rufai says President Muhammadu Buhari is justified in refusing to give his assent to the Electoral Act Amendment Bill.\nIn an Exclusive Interview with Arise News, El-Rufai gave reasons why he believes that the President is right."
  }
]