[
  {
    "headline": "NYSC: Scores to repeat service, others get extension",
    "summarized_story": "A group, Rescue Nigerian Youth Solomon Dalung Foundation, has called on Nigerians to reject old politicians who have run out of solutions to the challenges facing the country.\nHe said, “I am queuing behind our aspirant, Prince Adewole Adebayo because the politicians we have are getting older and they are not getting it right again.\nWe need bright and visionary leaders who can rescue the country from its current economic and security quagmires so we can move forward like other nations.\n“It is glaring that Nigerian politicians are not making Nigerian youth productive – they only use them during the political process for their selfish end.\nWe are bothered by what our youths are gradually becoming nowadays because of socio-economic challenges and frustration they grapple with."
  },
  {
    "headline": "Jibrin risks dismissal over alleged misconduct at housing authority",
    "summarized_story": "The Governing Board of the Federal Housing Authority on Thursday summoned its Executive Director, Research, Innovation, Development, Abdulmumin Jibrin, to appear before an investigative panel, instituted against him over alleged misconduct.\nAbdulmumin is mandated to appear in person before the disciplinary panel on Friday, February 18, 2022, to show course why he should not be dismissed from the housing agency.\nIt was reliably learnt that Abdulmumin has been absent from duty for 92 days, an offence, which contravenes the rules guiding public offices.\nJibrin was recently appointed the Director-General of the Bola Tinubu, Social Mobilisation Group, working towards the actualisation of the ex-governor of Lagos State’s 2023 presidential ambition.\nThe invitation, issued to Abdulmumin is in accordance, with the provisions of paragraph 8,2,0 of the Federal Housing Authority Revised Condition of Service, 2008, and Section 030307 of the Public Service rules (2009), according to the letter."
  },
  {
    "headline": "Gunmen kidnap Abuja prince, kill one",
    "summarized_story": "Some armed men have kidnapped the son of the traditional ruler of Gwombe community in the Kuje area council of the Federal Capital Territory, Danjuma Jangaba.\nThe prince identified as Junaidu, it was gathered, was returning from a neighbouring community when he was waylaid by the armed men who had mounted a barricade at the area.\nIt was further gathered that sighting the armed men, the rider of the motorcycle he was on tried to escape but was shot dead.\nA resident of the area, who pleaded anonymity, said the incident has led to panic in the area.\nHe said, “We learnt that the prince was returning from a neighbouring community on a motorcycle on Wednesday evening when the gunmen accosted him."
  },
  {
    "headline": "Kano APC Crisis: Ganduje extends olive branch to Shekarau faction",
    "summarized_story": "By Omeiza Ajayi, AbujaGovernor Umar Abdullahi Ganduje of Kano state has extended an olive branch to the Senator Ibrahim Shekarau-led faction of the party, following an appellate court ruling in favour of the governor’s backed faction.\nWe, APC of Kano state have got a judgment that all the elections we conducted from the wards to the state level are legally recognized.\n“I am appealing to them (Shekarau faction) because we are members of one family, the APC.\nHouse Leader, Ado Doguwa on his part said the door was opened for the Shekarau faction to collapse its structure into the governor’s faction.\nWith commitment, we will join hands together to deliver Kano state for APC in the forthcoming 2023 general election and beyond”, he stated."
  },
  {
    "headline": "2023 presidency should be for South-East, says Clark",
    "summarized_story": "By Anayo Okoli, ENUGUELDER Statesman and Ijaw leader, Chief Edwin Clark, on Thursday, restated his position that the people of South-East region should produce Nigeria’s President in 2023.\nClark said his reason was not because they are Igbo or people from South-East, but because they are Nigerians.\nChief Clark who spoke during a programme on Arise TV, insisted that it would be unfair to deny the South-East the opportunity to produce the President next year.\nHe wondered what had happened to that declaration if the people of South-East are denied the Presidency.\nHe maintained that every part of the country has had a fair share of testing political power at the Presidency except the South-East."
  },
  {
    "headline": "Attack on cattle market not by host community — Gov Ikpeazu",
    "summarized_story": "Govt to site military base in the areaBy Steve OkoGov Okezie Ikpeazu of Abia State has said that preliminary investigations had revealed that youths of the host community were not responsible for the midnight raid at Omumauzor Cattle Market Ukwa West on Tuesday.\nThe governor who disclosed this when he visited the market on Thursday vowed that the state would stop at nothing in bringing the perpetrators to book.\nHe said that “the State Government has the capacity to protect the lives and property of people and residents of the State”.\nAccording to Ikpeazu, investigations further showed that the youths of the immediate community were the ones that assisted the victims after the attack.\nHe further said that he would meet with key stakeholders from the area this weekend on the issue."
  },
  {
    "headline": "Reliance on oil places Nigeria on edge — Emefiele",
    "summarized_story": "By Festus Ahon, ASABATHE Central Bank of Nigeria, CBN, Thursday, said Nigeria’s overreliance on oil in a mono-economy always placed the country on the edge especially when there is fluctuation in the prices of oil globally.\nGovernor of CBN, Mr Godwin Emefiele who stated this in Asaba during the opening ofa two-day CBN Fair for stakeholders in Delta, said the bank has the mandate to grow the economy in a sustainable manner.\nEmefiele who was represented by the Director, Corporate Communications of CBN, Mr. Osita Nwanisoba, said CBN various intervention programmes were geared towards the diversification of the economy from oil.\nHe said the fair was aimed at sensitising citizens on the interventions of CBN for them particularly graduates to leverage on to become entrepreneurs.\nEgbedi who was represented by the Permanent Secretary in the ministry, Mr Ben Agamah, called for continued partnership in creating more employment for the people of Delta State."
  },
  {
    "headline": "Peer review: AU rates Nigeria high in infrastructure, agric revolution",
    "summarized_story": "The African Union Development Agency-New Partnership for Africa’s Development (AUDA-NEPAD) says Nigeria recorded tremendous successes in infrastructure development and agricultural revolution during the African Peer Review Mechanism (APRM).\nPrincess Gloria Akobundu, Chief Executive Officer of AUDA-NEPAD, said this at a news conference in Abuja on Thursday.\n“The review report was far-reaching and encompassed various segments of the socio-political economy and highlighted the developments recorded since the first peer review in 2008.\nAli said that being peer reviewed for the second time was a great step toward the growth and development of the country.\nThe second peer review came 13 years after the first one which was conducted in 2008."
  },
  {
    "headline": "Fuel scarcity: NNPC vows adequate petrol supply next week",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has assured citizens of adequate petrol supply next week.\nThe agency gave the assurance at the National Economic Council (NEC) meeting at the State House on Thursday.\nMinister of Industry, Tradeand Investment, Niyi Adebayo, said despite the potentials, the local automotive industry has been significantly plagued by several challenges.\nHe listed weak demand for locally assembled cars and lack of government patronage which could have assisted the assemblers in achieving economies of scale.\nFEC also received an update on the COVID-19 vaccination by the Executive Director, National Primary Health Care Development Agency (NPHCDA), Dr. Faisal Shuaib."
  },
  {
    "headline": "Osun 2022: CSOs demand Aregbesola’s sack for allegedly fueling crisis",
    "summarized_story": "Ahead of the Osun State governorship primary election of the All Progressives Congress (APC) scheduled for Saturday, a Coalition of Civil Society Organisations in Osun State has called on the federal government to sack the Minister of Interior, Rauf Aregbesola, for allegedly promoting crisis in the state.\nThe spokesperson of the coalition, Mr. Wasiu Alli made the call while addressing a press conference on Thursday in Abuja.\nThis speaks about the administrative incompetence of Mr. Aregbesola whose superintendence over the Interior Ministry has seen it degenerate into one that cannot secure its own Correctional Centres.\n“Where Mr. Aregbesola should be seen finding solutions to these now-common jailbreaks; he has been busy promoting unrest in Osun State.\n“Where he cannot be cautioned, we demand his outright sack or redeployment if he cannot act responsibly in line with the dictates of the Office he presently holds."
  },
  {
    "headline": "Sickle cell: Why you must go for test before marriage – Ogun Commissioner advises intending couples",
    "summarized_story": "Ogun State Commissioner for Health, Dr. Tomi Coker, has advised intending couples to go for screening to determine their blood status before going into marriage.\nThis, she said becomes necessary to guard against having children with sickle cell in the future.\nAccording to her, about 150,000 children are born annually with sickle cell disease in Nigeria.\nShe added that 90 per cent of the children die, making Nigeria the world’s leading contributor to infant mortality from sickle cell disease.\n“An estimated 150,000 babies are born annually in Nigeria with sickle cell disease."
  },
  {
    "headline": "Obasa mourns Tinubu’s strategist, Tunde Samuel",
    "summarized_story": "Lagos State House of Assembly Speaker, Mudashiru Obasa, has mourned Professor Tunde Samuel, a former adviser to ex-Governor Bola Tinubu.\nHe described the late member of the Governor’s Advisory Council (GAC), led by Tinubu, as a titan whose positive roles cannot be forgotten.\nSamuel, a founding member of the All Progressives Congress (APC), died on Wednesday night at the age of 73.\nAt a visit to the family on Thursday, Obasa said his exit would take a long time for Agege people, the APC, the GAC and Lagos to bear.\nSamuel was one of Tinubu’s policy and political strategists, a close friendship that dates back decades."
  },
  {
    "headline": "Gov Diri backs Bill for establishment of NYSC Trust Fund",
    "summarized_story": "Governor of Bayelsa State, Senator Douye Diri, has thrown his weight behind the call for the passage of the Bill for the establishment of the NYSC Trust Fund.\nDiri, who was represented by the Secretary to the State Government /Chairman, NYSC State Governing Board, Rt.\nKonbowei Benson, commended the management of the NYSC for initiating the move for the establishment of the NYSC Trust Fund.\nAccording to him, “I commend the management of the NYSC for the unprecedented initiative to establish the NYSC Trust Fund.\nAs the governor of Bayelsa State, l stand here to declare my support for the establishment of the NYSC Trust Fund,” Governor Diri said."
  },
  {
    "headline": "Nigeria’s economy grew by 3.98% in Q4 2021 – NBS",
    "summarized_story": "From Isaac Anumihe, AbujaThe National Bureau of Statistics (NBS) yesterday, said that the nation’s economy grew by 3.98 per cent in the fourth quarter of 2021 even as it recorded an annual growth rate of 3.40 per in 2021.\n“It is pertinent to note that the economy has maintained this positive trajectory up to the 4th quarter of 2021, recording a GDP growth rate of 3.98 per cent.\nThis figure to an average Nigerian may be seen as lower than the 4.03 per cent growth rate recorded in Q3, 2021.\nSG recalled that the Nigerian economy exited the COVID-19- induced recession in Q4, 2020 with a marginal GDP growth rate of 0.11 per cent.\n“Fourth quarter 2021 daily oil production also shows lower volume compared to the third quarter 2021 production volume of 1.57mbpd."
  },
  {
    "headline": "Strike: UNN grounded as ASUU ensures total compliance",
    "summarized_story": "He said that the ASUU-UNN has formally communicated the university authority over the one-month warning strike, adding that the strike is total and comprehensive in the institution.\n“UNN ASUU agreed in a congress to join the nationwide warning strike after the union national body made the initial declaration, and for us here in UNN the strike is total and comprehensive.\nThe ASUU chairman added further that the union has set up a monitoring team to ensure and maintain total compliance.\n“We just returned from Christmas break in January and now going back home as a result of one-month warning strike by ASUU on February 14 is frustrating.\n“I am not happy, doesn’t mean government can not find a solution to incessant strike in public universities, now we are not allowed to enter classroom because of the strike."
  },
  {
    "headline": "Breaking: Kano APC crisis:Ganduje faction wins at Appeal Court",
    "summarized_story": "From Desmond Mgboh, KanoNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe Court of Appeal sitting in Abuja has set aside the judgment of the lower FCT court, which annulled the ward and Local Government Congresses of the All Progressives Congress in Kano State.\nThe Appeal Court, in judgment affirmed that the lower court lacked jurisdiction to entertain the case100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nIt also held that the matter was not a pre- election matter, but an internal affair of a political party and should, therefore, be left to the leadership of the party to resolve."
  },
  {
    "headline": "JUST IN: PSC suspends ACP Ubuah, 2 others from service",
    "summarized_story": "Molly Kilete, AbujaThe Police Service Commission(PSC), has announced the suspension of Assistant Commissioner of Police, ACP Sunday Ubua and Assistant Superintendent of Police, ASP James Bawa from service.\nThey were also alleged to be involved in the current cocaine seizure and transfer to the National Drug Law Enforcement Agency.\nThe Commission’s decision was contained in a letter to the Inspector General of Police, dated 16th February 2022 and signed by Hon.\nThe Inspector General of Police was requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\nThe Commission also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action."
  },
  {
    "headline": "NNPC’s injection of 3.2bn litres fails to douse fuel scarcity",
    "summarized_story": "2 billion litres of Premium Motor Spirit (PMS), into the domestic market Wednesday, failed to stem the current fuel scarcity of fuel in major cities of the country.\nSome black marketers on Wednesday took advantage of the lingering scarcity of Premium Motor Spirit (PMS) to make brisk business from residents and motorists in Lagos.\nSome of the black marketers were selling a litre of fuel for prices between N180 to N250 per litre depending on the location, demand and negotiating skills of the buyer.\nIt was also observed that the chaotic situation had brought in black marketer who are making brisk business from the scarcity of fuel in the metropolis.\nWhen our Correspondent went round town on Wednesday, there were long queues at some fuel stations including Jenny, Gabrow, Rain Oil among others while some others who did not have fuel were under lock and keys."
  },
  {
    "headline": "UPDATED: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission (PSC) has suspended Assistant Commissioner of Police, Sunday Ubua, and Assistant Superintendent of Police, James Bawa, from the exercise of the powers and functions of their respective offices with effect from Monday, February 14, 2022.\nThe two police officers were working under the suspended DCP Abba Kyari in the Intelligence Response Team of the Force Investigation and Intelligence Department of the Nigeria Police Force.\nThe Inspector-General of Police was requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "UPDATED: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission (PSC) has suspended Assistant Commissioner of Police, Sunday Ubua, and Assistant Superintendent of Police, James Bawa, from the exercise of the powers and functions of their respective offices with effect from Monday, February 14, 2022.\nThe two police officers were working under the suspended DCP Abba Kyari in the Intelligence Response Team of the Force Investigation and Intelligence Department of the Nigeria Police Force.\nThe Inspector-General of Police was requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "BREAKING: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission has called for the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of disgraced police chief, Abba Kyari.\nAlso, the Commission has directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe FBI also alleged that the embattled social media celebrity sent money to Kyari via a third person’s bank account and hosted him in his Dubai apartment.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "BREAKING: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission has called for the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of disgraced police chief, Abba Kyari.\nAlso, the Commission has directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe FBI also alleged that the embattled social media celebrity sent money to Kyari via a third person’s bank account and hosted him in his Dubai apartment.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "Terrorists Abduct Wives, Four Daughters Of Kaduna Community Leader",
    "summarized_story": "Terrorists locally known as bandits have abducted the wives and four daughters of Mallam Ibrahim Tanko, the Ssrkin Hausawa of Anguwar Azara in Jere, along Abuja-Kaduna highway, Kaduna State.\nIllustrationHe gave the names of his kidnapped wives as Maimuna Ibrahim and Hauwawu Ibrahim.\nThe Sarkin Hausawa gave the names of his abducted daughters as Aisha Ibrahim, Farida Ibrahim, Zainab Ibrahim and Hussaina Ibrahim.\nThe Sarkin Hausawa said soldiers arrived in the area an hour after the bandits had left with their victims.\nThe spokesman of the Kaduna State Police Command, ASP Mohammed Jalige, was quoted as saying the police was not yet aware of the incident."
  },
  {
    "headline": "Only 31% of Borno teachers are competent, LEA assessment panel tells Zulum",
    "summarized_story": "A committee set up to conduct assessment for local education authority (LEA) teachers in Borno says only 31 percent of teachers in the state are competent to teach.\nBabagana Zulum, Borno governor, had tasked the committee with conducting basic literacy and numeracy competency assessment for 17,229 local education authority teachers across the 27 LGAs of the state.\nAdvertisementAccording to the report, out of 17,229 teachers, only 5,439 — representing 31.6% — proved competent to teach, while 3,815 teachers — representing 22.1% — are not competent to teach and are not trainable.\nAlthough 7,975 teachers — representing 46.3% — were found not to be fully competent, the report indicated that they could be trained.\n“The numbers were based on the overall number of teachers as some with higher numbers of untrainable teachers have a higher number of teachers employed."
  },
  {
    "headline": "Only 31% of Borno teachers are competent, LEA assessment panel tells Zulum",
    "summarized_story": "A committee set up to conduct assessment for local education authority (LEA) teachers in Borno says only 31 percent of teachers in the state are competent to teach.\nBabagana Zulum, Borno governor, had tasked the committee with conducting basic literacy and numeracy competency assessment for 17,229 local education authority teachers across the 27 LGAs of the state.\nAdvertisementAccording to the report, out of 17,229 teachers, only 5,439 — representing 31.6% — proved competent to teach, while 3,815 teachers — representing 22.1% — are not competent to teach and are not trainable.\nAlthough 7,975 teachers — representing 46.3% — were found not to be fully competent, the report indicated that they could be trained.\n“The numbers were based on the overall number of teachers as some with higher numbers of untrainable teachers have a higher number of teachers employed."
  },
  {
    "headline": "EU must help stem economic migration of Africans to Europe, says Buhari",
    "summarized_story": "President Muhammadu Buhari has asked the European Union to make new trade deals and policies that will help stem economic migration from Africa to Europe.\nBuhari, who is currently in Brussels for the EU-AU summit, said irregular migration from Africa to the global north is draining Africa’s talent pool and creating political crises in Europe.\nIn an op-ed piece published by Politico on Thursday on the summit, the president said the EU must “undo” its one-sided deals, and do more to create jobs for Africans in Africa.\n“The relationship between the EU and Africa must be rebalanced to power job creation.\nAdvertisement“For instance, subsidy-driven surpluses of European milk are powdered and sent to Africa, decimating its diary industry,” Buhari said."
  },
  {
    "headline": "EU must help stem economic migration of Africans to Europe, says Buhari",
    "summarized_story": "President Muhammadu Buhari has asked the European Union to make new trade deals and policies that will help stem economic migration from Africa to Europe.\nBuhari, who is currently in Brussels for the EU-AU summit, said irregular migration from Africa to the global north is draining Africa’s talent pool and creating political crises in Europe.\nIn an op-ed piece published by Politico on Thursday on the summit, the president said the EU must “undo” its one-sided deals, and do more to create jobs for Africans in Africa.\n“The relationship between the EU and Africa must be rebalanced to power job creation.\nAdvertisement“For instance, subsidy-driven surpluses of European milk are powdered and sent to Africa, decimating its diary industry,” Buhari said."
  },
  {
    "headline": "PHOTOS: Lagosians flood filling stations with jerrycans as petrol scarcity persists",
    "summarized_story": "Many Lagosians have taken to filling stations in unusually large numbers, with jerrycans, to purchase petrol.\nThe development is as a result of the petrol scarcity that persists in the country due to what regulators have described as efforts to recall “contaminated products” in circulation.\nFollowing the development, President Muhammadu Buhari ordered that “producers and providers” of the off-spec petrol must be held accountable.\nAdvertisementOn Thursday, TheCable went round Lagos streets to document how Nigerians are buying the product in jerrycans.\nWhile some filling stations prohibited the sale of petrol in jerrycans, those who sold charged as high as N1,000 per empty 25kg keg before attending to buyers."
  },
  {
    "headline": "How can startups succeed in their sectors?",
    "summarized_story": "By 2020, the number of African startups that had secured funding had increased, by 552.73%, to 359 startups.\n2021 saw startups raise over $4 billion from 355 funding rounds from investors like LoftyInc, Y Combinator, Partech and Novatech.\nUnfortunately, very few of these startups actually succeed or excel in their operations.\nTo examine how startups can achieve operational excellence and attract more funding in the process, TechCabal spoke with Femi Adeyemo, founder and CEO of Arnergy.\nLeading by exampleThe most important thing Adeyemo thinks founders can do to help build and sustain a culture of operational excellence in their startups is leading by example."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "Africa’s young population is driving a gaming market revolution",
    "summarized_story": "This article is contributed to TechCabal by Conrad Onyango/bird story agencyFrom consoles to smartphones, Africa’s growing, tech-savvy population is driving significant growth in the multi-million dollar gaming industry as increased adoption of digital currencies and blockchain technology takes African gaming to the next level.\nUsiku Games Africa, a Kenyan based Social Impact gaming company is pioneering the new era of blockchain gaming in the country where the rising number of tech-savvy youth could soon start earning from the industry boom.\nKenya and Ethiopia finish fourth and fifth largest gaming markets in the continent with 22 percent and 13 percent of their population into gaming respectively.\nAccording to Newswagg’s, 80 percent gamers with crypto accounts are interested in using digital currency for gaming purchases, with 67 percent yearning for an opportunity to use cryptocurrency in gaming.\nGlobal crypto gaming was valued at 321 million US dollars in 2020."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Local competition for Uber, Wasla raises $9 million, MoneyHash’s pre-seed round",
    "summarized_story": "Today on Techpoint Digest:Local competition for UberWasla’s $9 million raiseMoneyHash’s pre-seed fundingLocal competition for Uber?\nThe startup has announced an investment of $9 million from Contact Financial Holding, a financial services provider in Egypt.\nFollowing the fresh injection of capital, the startup plans to introduce buy now, pay later options and a new online payment option for its users.\nThey’re very technologically advanced, and their adoption of eCommerce is quite good.”MoneyHash’s pre-seed fundingAccepting payments is a significant challenge for businesses across the globe.\nMoneyHash, an Egyptian startup, has raised $3 million in pre-seed funding for this purpose after launching in 2021."
  },
  {
    "headline": "Why national policy must address tax impact on healthcare",
    "summarized_story": "The national policy draft on incentivising the healthcare industry is built on four pillars of fostering an enabling environment to attract private capital, driving public-private partnerships, government funding, and technology adoption.\nThe policy, unfortunately, fails to present actionable plans on how the government aims to reduce out-of-pocket expenses borne by individual patients who contribute 77 percent of private spending on healthcare in Nigeria, she says.\n“Some of the solutions that could be proffered to reverse the brain drain challenge among us includes private sector incentives and training,” Ajayi notes during a meeting with the Federal Government to lay bare the struggles of private sector players.\nFor example, some of the incentives that our members feel are required in the healthcare sector.\nIt requires effective enforcement of the policy, monitoring, sanctions for defaulters, and adequate compensation for those who follow through."
  },
  {
    "headline": "24-hour power dawns for Aba as Geometric gets to work",
    "summarized_story": "The nine-year tussle between Geometric Power and Interstate Electric that hindered Aba, the commercial hub of Eastern Nigeria, from enjoying a 24-hour power supply has been laid to rest as Geometric Power paid $26 million re-acquisition value of the Aba ring-fenced area, yesterday.\nBarth Nnaji, chairman/founder, Geometric Power Limited, said the Aba ring-fenced project would really bring a new model of how to deliver electricity in the country.\nThe huge investment so far is to ensure that the network works effectively and to position the Aba ring-fenced area to set the pace in electricity generation and distribution, he stated.\nAnother initiative taken by the BPE was to sign an agreement between the Federal Government, Geometric Power and Interstate Electric on the principles that will guide the resolution of the licensing overlap between EEDC and Geometric Power as well as the sale and transfer of the asset by the EEDC to Geometric Power, he said.\nKester Enwereonu, director, EEDC, who represented Interstate Power, acknowledged that the handover marked the end to the ownership tussle of the Aba ring-fenced, which he said actually began right from the time the acquisition process was concluded."
  },
  {
    "headline": "How Instagram’s ‘Billionaire Gucci Master’ Sank Abba Kyari, the Super Cop",
    "summarized_story": "That same week, 3,000 miles away, Nigeria Police Force Deputy Commissioner Abba Kyari, also known as @abbakyari75, struck a different pose.\nThe U.S. government alleged that one of the influencer’s fellow conspirators was a man sworn to uphold the law: Abba Kyari.\nMoments after reaching out to Kyari about Chibuzo, Abbas updated Juma.\nThe same day, the Justice Department revealed that it had indicted Juma, Chibuzo, Kyari, and three U.S.-based defendants on charges of conspiring to commit fraud and money laundering.\n“I do take good care of them.”The NDLEA officer reported the approach and, outfitted with a wire, collected the money from Kyari."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "Osun 2022: Aregbesola attacks Oyetola again, says he is a traitor",
    "summarized_story": "By Sunday Oguntuyi, OsogboFormer governor of Osun State and current Minister of Interior, Mr. Rauf Aregbesola has described the incumbent governor of the state, Mr. Adegboyega Oyetola as a traitor who doesn’t deserve to be reelected.\nAregbesola said the governor has rubbished all the legacy they built together for eight good years of serving together as governor and chief of staff, hence not worthy of second term.\nAccording to him, Oyetola has since assumption of office in 2018 battled him over an offence he knows nothing about.\nMoshood Adeoti, his former secretary instead of governor Oyetola, Aregbesola said Oyetola has betrayed the confidence he reposed in him, and it was time for a real progressive and a party man.\nBoasting that Adeoti will emerge victoriously on Saturday as the party’s flagbearer, he said, “He (Oyetola) will not return for second term."
  },
  {
    "headline": "U.S. Govt Exchange Alumna Opens Nigeria’s First Waste Museum in Ibadan",
    "summarized_story": "The Waste Museum will provide environmental education and equip women and youth from underserved communities with upcycling skills.\nWith the Waste Museum, we are showcasing the value of waste,” Olowookere said.\n“Today, we are celebrating the opening of the Waste Museum as it creatively and sustainably addresses two societal challenges —unemployment and waste management.” Foltz said.\nThe Academy for Women Entrepreneurs is a U.S. government initiative that supports women entrepreneurs around the world.\nDesigned to cultivate entrepreneurial know-how, AWE helps women entrepreneurs connect with funding opportunities, enhance opportunities for business expansion, and increase the likelihood of entrepreneurial success."
  },
  {
    "headline": "Foremost Mining Engineer, George Onyemenam for burial Feb 24",
    "summarized_story": "BY EMEKA EJEREActivities lined up for the final funeral rites of a notable Mining Engineer and community leader, Ogbueshi George Nduka Onyemenam, have been announced.\nOnyemenam died on January 26, 2022 in his country home, Asaba, Delta State, after an illness.\nOn Thursday, February 24, 2022, there will be a funeral mass, also at St. Joseph’s Pro Cathedral, Nnebisi Road, Asaba, by 10 am, to be followed immediately by interment at Uga Ezeafadia, Umuezeafadia, Asaba.\nHe later proceeded to Camboume School of Mines, England, where he qualified as a Mining Engineer.\nOnyemenam retired from government work at an early age of 45 to become the General Manager of a British mining company in Makafo, on the Plateau."
  },
  {
    "headline": "Nigeria’s economy grew by 3.4% in 2021 — NBS",
    "summarized_story": "Nigeria’s gross domestic product (GDP) grew 3.4 percent in 2021, the strongest since 2014 and the first annual growth above 3 percent since President Muhammadu Buhari won the 2015 election.\n“The fourth quarter growth indicates a steady economic recovery accounting for annual growth of 3.40% in 2021.\n“The Q4 2021 growth rate was higher than the 0.11% growth rate recorded in Q4 2020 by 3.87% points and lower than 4.03% recorded in Q3 2021 by 0.05% points.\nNevertheless, quarter on quarter, real GDP grew at 9.63% in Q4 2021 compared to Q3 2021, reflecting a higher economic activity than the preceding quarter.”The report showed that in Q4, aggregate GDP stood at N49.27 million in nominal terms.\nThe oil sector contracted by 8.06 percent in the fourth quarter and an annual growth rate of -8.30 percent in 2021."
  },
  {
    "headline": "BREAKING: Respite As Petroleum Unions Suspend Planned Strike Action",
    "summarized_story": "Fears that the current disruption in petrol supply and distribution network would escalate following threat by key petroleum sector unions to down tools have been allayed.\nThis follows intervention of the Nigerian National Petroleum Company (NNPC) Limited, which led to an agreement with other stakeholders to amicably resolve all pending issues.\nADVERTISEMENTThe meeting agreed that NNPC and all parties should commit to working together in the monitoring of the road projects.\nAlso, the NMDPRA informed the meeting that a committee has been constituted to review the rates which include PTD, NARTO and NUPENG in addition to other stakeholders.\nIn addition, all parties agreed to work expeditiously towards concluding the review of the freight rate and make recommendations to the government."
  },
  {
    "headline": "Hijab: Kwara Gov Set Up Committee To Probe Ijagbo Violence",
    "summarized_story": "Kwara State governor, AbdulRahman AbdulRazaq, has set up a seven-man committee to investigate the circumstances that led to the recent violence in Oyun Baptist High School Ijagbo in Oyun local government area of the state.\nThe governor asked the committee to establish the roles of every person involved in the crisis and recommend to the state government what steps to be taken to avoid a reoccurrence in the future.\nADVERTISEMENTThe constitution of the committee was announced in a statement signed by the governor’s chief press secretary, Radius Ajakaye, on Thursday.\nThe committee has three weeks to submit its report to the government, the statement added, urging the people of the community and every party involved to cooperate with the committee and give peace a chance.\nLEADERSHIP recall that the violence that broke out in Oyun Baptist High School, Ijagbo a fortnight ago over hijab wearing by Muslim schoolgirls claimed one life while many other people sustained various degree of injuries."
  },
  {
    "headline": "Police Arrest 7 Traffic Robbers In Lagos",
    "summarized_story": "Officials of the Lagos Rapid Response Squad (RRS), on Thursday, afternoon arrested three traffic robbers at Ikeja City Mall just as National Union of Road Transport Workers (NURTW), Mile 2 Park assisted the police in arresting four notorious traffic robbers in the area.\nThe Commander, Rapid Response Squad (RRS), CSP Olayinka Egbeyemi, had on a tip off on the activities of traffic robbers in Mile 2 on Thursday deployed plain cloth police men to the area to monitor and arrest the suspects.\nADVERTISEMENTOne of the suspects, Nurudeen Suraj was a week ago arrested and detained at Agboju Police Station.\nThose arrested in Ikeja were selectively picked up after a petition initiated by the management of Ikeja City Mall on reported incidences of traffic robbery in the area.\nThe suspects, who were placed under close monitoring before their arrest this afternoon, on most occasion pretend to be beggars and nose mask vendors."
  },
  {
    "headline": "FCTA Clears Beggar Caught With N500,000, $100 Cash Of Wrongdoing",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) has said that the 48-year-old Hadiza Ibrahim, a street beggar caught with N500,000 and $100 cash was not involved in any drug peddling, arms dealing, kidnapping or otherwise, as the money in her possession, was accumulated overtime.\nThe FCT Administration revealed that preliminary security profiling of Hadiza, who was caught at a junction along Ademola Adetokunbo Crescent, in Wuse II, Abuja, clearly established that she was not into such nefarious acts.\nThis revelation was against the backdrop of mixed reactions trailing the controversial arrest of Hadiza by officials of Social Development Secretariat (SDS) some days ago.\n“We have established colonies and settlements of real people who are in dire need of such support either cash or kind.\nADVERTISEMENTExplaining how she accumulated the huge sum, she said it was from her savings through N2,000,00 daily contribution."
  },
  {
    "headline": "5 Hospitalised As Fire Guts Lagos Law School",
    "summarized_story": "At least five persons have been hospitalised following a fire outbreak on Wednesday night, which gutted a section of the Lagos campus of the Nigeria Law School, located at Ozumba Mbadiwe Street, Victoria Island, Lagos.\nIt was gathered that the incident led to commotion among occupants who scampered in different directions to avert being harmed in the inferno.\nI saw a student jump out from the first floor where the fire started near the reading room.\nIt was also gathered that there was no casualty and no tangible property was destroyed apart from one big electric cable.\nADVERTISEMENTConfirming the fire incident, the Director of Lagos State Fire Service and Rescue, Margret Adeseye, through the Public Affairs Officer, Amodu Shaibu, said there was no casualty as the incident was minor."
  },
  {
    "headline": "Oyetola blasts Aregbesola: You are not God",
    "summarized_story": "By Victor Adeoti/IkireOgbeni Rauf Aregbesola, the former governor of Osun and current Minister of Interior, on Thursday said he has taken his case against Governor Gboyega Oyetola to God.\nBut a spokesman for Oyetola dismissed Aregbesola’s rant, saying he is not God.\nAregbesola, who spoke in Yoruba, said Oyetola had been in battle with him since assumption of office.\nOyetola, Ismail Omipidan, said Aregbesola is not God and cannot determine the fate of his principal.\n“Therefore, it is God and Osun people that will determine Oyetola’s fate, not an individual trying to play God,” Omipidan said."
  },
  {
    "headline": "New York Judge orders Trump, children testify in civil probe",
    "summarized_story": "A New York judge ruled on Thursday that former U.S. President Donald Trump and two of his adult children must answer questions under oath in the state attorney general’s civil probe into their family company’s business.\nLawyers for Donald Trump did not immediately respond to requests for comment.\nLast month, James said her nearly three-year investigation into the Trump Organization had uncovered significant evidence of possible fraud.\nLawyers for Donald Trump have said he did not know enough to respond to allegations of inaccurate valuations, though Trump detailed some possible discrepancies in a five-page statement on Tuesday.\nWashington D.C.’s attorney general is separately suing the Trump Organization and Trump’s inaugural committee over the alleged misuse of $1.1 million of charitable funds."
  },
  {
    "headline": "BREAKING: CCTV Recordings Of Baba Ijesha Tampered With",
    "summarized_story": "An Ikeja Domestic Violence and Sexual Offences Court has heard that the content of a Closed Circuit Television (CCTV) recording on popular actor James Olarewaju aka Baba Ijesha may have been tampered with.\nA defence witness and expert in CCTV installation and maintenance, Engr.\nAdeleke Lawrence made an allusion to this while being led in evidence by Babatunde Ogala (SAN) in the ongoing trial of Ijesha Baba.\nBaba Ijesha is facing a six-count charge of child defilement bordering on allegations of indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration before Justice Oluwatoyin Taiwo.\nTwo video recordings of Baba Ijesha were played during resumed proceedings on Thursday following the request of Ogala."
  },
  {
    "headline": "Throwback Video Of Suspended Police Officer, Abba Kyari Chilling In A Nightclub",
    "summarized_story": "A throwback video of embattled suspended police officer, Abba Kyari chilling in a club has surfaced after his indictment in a drug trafficking case.\nNews Direct reported earlier that Kyari is accused of taking out 15kg from 25kg of cocaine which he and his team intercepted after arresting some traffickers that came into the country from Ethiopia.\nHe is also being accused of offering to give an NDLEA officer a cut from sale of the cocaine.\nIn the video which surfaced, Kyari was seen vibing to a song and also trying to imitate a dance move.\nWatch the video below……………."
  },
  {
    "headline": "BREAKING: Fire Guts Asokoro Hospital In Abuja",
    "summarized_story": "A portion of the Asokoro District Hospital has been engulfed by fire.\nDetails of the fire incident are sketchy as at the time of filing this report.\nAsokoro General Hospital also known as Asokoro District Hospital is a government owned healthcare facility located in the Federal Capital Territory, Abuja.\nThe hospital offers range of medi-care services such as ophthalmology, physiotherapy, pediatrics, radiology amongst other services and is rated among the best in Abuja.\nDetails later…"
  },
  {
    "headline": "Federal Government Finally React On ASUU Strike",
    "summarized_story": "Chris Ngige, the Minister of Labour and Employment, said on Wednesday that the Academic Staff Union of Universities’ current strike is a “leave” because the union failed to notify his ministry before going on strike.\nNgige, however, said, “I am sure you know NIREC which is headed by the sultan and the CAN president.\nWe were waiting for them to come back and then we heard they were going on strike.\n“ASUU failed to get back to us and proceeded on strike without sending notifications.\nIf you want to go on strike, you should at least inform us officially by giving us notification but they refused to."
  },
  {
    "headline": "2023: 102-year-old woman declares interest to lead Nigeria",
    "summarized_story": "A 102-year-old woman, Mrs. Nonye Josephine Ezeanyaeche, has declared her intention to contest for the office of the president in the 2023 general election.\nEzeanyaeche, who is also popularly known as ‘living legend’ or “Mama Africa’, hails from Aguata, Anambra state and is the founder of the ‘Voice for Senior Citizens of Nigeria’ group.\nMama Africa who made intention known during a recent visit to the management team of the Nigerian Television Authority (NTA), expressed readiness to contest for the number one position if the younger generations of the country are not ready.\nShe was said to have received many awards for her contributions to humanity and nation-building, including the African Peace Award, 2021."
  },
  {
    "headline": "CBN kicks against new money laundering laws",
    "summarized_story": "The Central Bank of Nigeria (CBN) Thursday kicked against plan by the Senate to enact new anti-money laundering laws without required amendments on the existing Money Laundering (Prevention ) Act 2011.\nSimilarly, the Economic and Financial Crimes Commission (EFCC) and the Attorney – General of the Federation Abubakar Malami(SAN) also disagreed on the proposed establishment of proceeds of crimes commission.\nThe proposed bills are (i) Money Laundering (Prevention and Prohibition) 2021, (ii) Public Complaints Commission (Repeal and Re – enactment) Bill 2022 and (iii) Proceeds of Crimes (Recovery and Management) Bill 2021.\nCBN submitsIn his submission on the legislative proposals, CBN Governor Godwin Emefiele said an amendment of the existing Money Laundering (Prevention ) Act 2011 would better serve the interest of Nigeria than a repeal and re-enactment.\n“Consequently, the CBN is opposed to the passage of the proposed bills for the repeal and re – enactment of the existing Money Laundering (Prevention) Act 2011."
  },
  {
    "headline": "Kano APC Congress fallout: How Ganduje floored Shekarau at Appeal Court",
    "summarized_story": "The Abuja Division of the Court of Appeal Thursday set aside the judgment of the FCT High Court which invalidated the Kano state ward and local government congresses of the All Progressives Congress (APC) in the state.\nAmong others, the appellants (Ganduje faction) prayed the court to recognise the existing leadership of the party and discountenance the lower court’s ruling.\nA/Court upturns victoryIn its verdict,the Court of Appeal held that the lower court lacked jurisdiction to try the case.\nEarlier, the APC Caretaker/Extraordinary Convention Planning Committee (CECPC) had declared that it did not send a parallel state congress committee to Kano state.\nThe governor also confirmed that the APC national secretariat had given Abbas a certificate of return as the APC state chairman."
  },
  {
    "headline": "Reps Ask INEC To Improve Voter Registration Process",
    "summarized_story": "﻿The House of Representatives on Thursday called on the Independent National Electoral Commission to urgently deploy physical enumerators and other assistance to conduct new voter registration across all federal constituencies.\nINEC had put in place a machinery for a virtual continuous voters registration, but the online process does not seem satisfactory to the lawmakers.\nThey are worried that the online registration process will not cover all constituencies and lead to disenfranchisement of Nigerians and voter apathy.\nMeanwhile, the House through a motion, is urging the Federal Government to provide body cameras for all security operatives on duty across the country.\nThis, according to the House, will help address allegations of harassment, extortion, and extra-judicial killings of citizens by security operatives, as well as protect them."
  },
  {
    "headline": "Poverty Reduction: N5,000 ‘Goes A Long Way’ For Many Nigerians – Minister",
    "summarized_story": "The Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, has said the N5,000 monthly national cash transfer to vulnerable households goes a long way in reducing poverty.\n“When people say N5000 does not save people, that is an elitist statement, honestly because we’ve had causes to go to the field, and we have seen these people that when you give them this N5,000, they cried and shed tears because they’ve never seen N5,000 in their lives.\nSo, it goes a long way, it changes their status and by that, it lifts them from one stage to another.”The Minister also spoke about the out-of-school children, giving the figures as over 10 million.\nWhile noting there are now 46 million Nigerians on the National social register, she believes that the conditional 5,000 naira intervention strategy to the poor and vulnerable has indeed assisted in lifting more Nigerians out of poverty.\nOn the exit programme for N-Power Programme, the minister affirmed that government has a plan of putting about 300,000 applicants on a training programme while the Central Bank of Nigeria will provide them loan."
  },
  {
    "headline": "Cocaine Saga: PSC Suspends Abba Kyari’s Men, Assistant Police Commissioner, ASP",
    "summarized_story": "The Police Service Commission (PSC) has suspended an Assistant Commissioner of Police (ACP), Sunday Ubua, and Assistant Superintendent of Police (ASP), James Bawa, who both worked under the embattled Abba Kyari in the Intelligence Response Team of the Nigeria Police Force (NPF).\nThis was contained in a statement issued on Thursday by the Head of Press and Public Relations of the PSC, Ikechukwu Ani.\nAlso, the commission maintained that Kyari, who is in custody, remains suspended until investigations into the matter are completed.\nRELATEDAbba Kyari: PSC Postpones Decision, Insists On New Panel To Conduct Fresh InvestigationHushpuppi: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGFNDLEA Declares Abba Kyari Wanted For Drug TraffickingA Wanted ManBefore now, Kyari was declared wanted and arrested by the NDLEA over his links with an international drug cartel.\nThe former head of the IRT was subsequently suspended by the PSC and an investigation – which has been marred in controversy – launched into the claims."
  },
  {
    "headline": "Nigeria’s GDP Grew By 3.98% In 2021 Q4 – NBS",
    "summarized_story": "The National Bureau of Statistics says Nigeria’s GDP grew by 3.98% in Q4 2021, sustaining a positive trajectory.\nIt further stated that the Q4 2021 growth rate was higher than the 0.11% growth rate recorded in Q4 2020 by 3.87% points and lower than 4.03% recorded in Q3 2021 by 0.05% points.\nThe nominal GDP growth rate in Q4 2021 was higher relative to 10.07% growth recorded in the fourth quarter of 2020 but lower compared to 15.41% growth recorded in the preceding quarter.\nThe non-oil sector grew by 4.73% in real terms during the reference quarter (Q4 2021).\nIn real terms, the Non-Oil sector contributed 94.81% to the nation’s GDP in fourth quarter 2021, higher from share recorded in the fourth quarter of 2020 which was 94.13% and higher than the third quarter of 2021 recorded as 92.51%."
  },
  {
    "headline": "US Challenges Russia To Step Back From Ukraine Attack",
    "summarized_story": "The United States said Thursday that Russia is on the verge of unleashing a massive military attack against Ukraine, dismissing Moscow’s claim to be pulling forces back, as artillery fire hit a Ukrainian kindergarten.\nRussia denies any invasion plans but warned of “military-technical measures” if its far-reaching demands for a US and NATO pullback from eastern Europe aren’t satisfied.\n“We insist on the withdrawal of all US armed forces in Central Europe, Eastern Europe and the Baltics,” it added.\nThe United States, NATO and Ukraine all said they had seen no evidence of a pullback, with Washington saying Russia had in fact moved 7,000 more troops near the border.\nAccording to US officials, there are now about 150,000 Russian troops arrayed in offensive groupings on the southern, eastern and northern borders of Ukraine."
  },
  {
    "headline": "Southwest stakeholders drum support for Tinubu's presidential ambition -",
    "summarized_story": "Some Southwest delegates loyal to Asiwaju Tinubu have opposed a proposed constitutional amendment seeking to exclude former and serving members of the National assembly from participating in the All Progressives Congress National Convention.\nThe stakeholders made this known through a communique read by one of its members Hon.\nAdvertisementMembers of the caucus also agreed that any proposed amendment is like trying to alter the membership of the party’s national convention which is tantamount to changing the rules in the middle of the game.\nAdvertisementThe caucus also made it known that it is in support of the presidential ambition of Asiwaju Tinubu, adding that it will continue to advocate it’s support for this course.\nAdvertisementAccording to the communique, we shall continue to support every decision of the caretaker committee led by Governor Mai Mala Buni to hold the national convention on the 26th of February."
  },
  {
    "headline": "Reps kicks as heads Of MDAs fail to honour invitation",
    "summarized_story": "The House of Representatives has threatened to issue warrant arrest against heads of Ministries, Departments and Agencies as they fail to honour invitation over corruption allegations.\nAdvertisement"
  },
  {
    "headline": "Ango Abdullahi meets Obasanjo says \"We must strategize for the good of Nigeria\" -",
    "summarized_story": "The Convener of the Northern Elders Forum (NEF), Prof. Ango Abdullahi has disclosed that the country needed good tidings from the 2023 elections, hence the need to strategize.\nAbdullahi made this disclosure after about two hour meeting with former President, Chief Olusegun Obasanjo in Abeokuta on Tuesday evening.\nAdvertisementThis was contained in a release by Special Assistant on Media to the former President, Kehinde Akinyemi on Wednesday.\nYou are in the media and you know what we have been saying about the situation in the country.\nThings are not good enough and as we head for 2023, we hope to be strategizing for the good of the nation.”"
  },
  {
    "headline": "Just In: Reps probe cause(s) of petrol scarcity",
    "summarized_story": "The House of Representatives has launched an investigation into the cause(s) of petrol scarcity across the country.\nThe importation of adulterated Premium Motor Spirits into the country has caused scarcity of the product across the with a litre sold between N250 and N300 in many places.\nAdvertisementMeanwhile, members of the house of representatives will vote on clause by clause amendment to 1999 Constitution on Wednesday.\nAlso, President Muhammadu Buhari has translitted the 2022 Supplementary Budget to House of representatives for consideration."
  },
  {
    "headline": "Trump Must Testify in New York Investigation, Judge Rules",
    "summarized_story": "Former President Donald Trump must answer questions under oath in New York state’s civil investigation into his business practices, a judge ruled Thursday.\nJudge Arthur Engoron ordered Trump and his two eldest children, Ivanka and Donald Trump Jr., to comply with subpoenas issued in December by New York Attorney General Letitia James.\nIf Trump were to testify in the civil probe, anything he says could be used against him in the criminal investigation being overseen by the Manhattan district attorney’s office.\nAnother lawyer for Donald Trump, Alina Habba, accused James of trying to use the civil investigation to gather evidence for the criminal probe.\nEngoron previously sided with James on other matters relating to the probe, including making Eric Trump testify after his lawyers abruptly canceled a scheduled deposition."
  },
  {
    "headline": "Prof Kemi Rotimi: Abba Kyari Is No Super Cop",
    "summarized_story": "Things appear to going from bad to worse for disgraced Deputy Commissioner of Police, Abba Kyari, who was arrested on Monday by the police and handed over to the National Drug Law Enforcement Agency, NDLEA, over his alleged involvement in illicit drug trafficking.\nAs if this was not bad enough, on Wednesday, the Punch newspaper reported that police investigations had revealed how members of an international crime syndicate led by Ramon Abass, also known as Hushpuppi, paid N235 million to Kyari’s younger brother.\nThe probe also showed that Kyari equally funnelled N44 million to his brother’s bank account in multiple transactions.\nHowever, the investigation, according to Punch, failed to disclose whether Kyari’s brother was acting as a proxy for his embattled elder brother, who is still in the custody of the NDLEA.\nThe investigative report, which was submitted to the Attorney-General of the Federation, showed that a total of N279.120 million flowed to the younger Kyari’s bank account at various times from the cyber scam syndicate members – Efe Martins (lead coordinator), Sikiru Adekoya, Usman Ibrahim and Hussaini Ala.To discuss the unfolding sordid saga involving Kyari and his accomplices in the police force, is Prof Kemi Rotimi, a History lecturer at the Obafemi Awolowo University, Ile-Ife, and a leading scholar on policing and the Nigeria Police Force."
  },
  {
    "headline": "Abba Kyari’s Brother Linked To Hushpuppi In Money Laundering Scam – Trending With Ojy Okpe",
    "summarized_story": "Investigations by the Nigerian police force following the arrest of Abba Kyari, the suspended Deputy Commissioner of police has revealed how members of a syndicate led by international scammer, Ramon Abass, popularly known as Hushpuppi paid over 235, Million Naira to a younger brother of Abba Kyari.\nUsers on social media are beginning to dig up awards and honours that celebrated Abba Kyari effectiveness and gallantry as a law enforcement officer.\nA 2018 video of an event by Silverbird Communications which recognized Abba Kyari as the 2018 hero of the year has gone viral.\nOn Tuesday, commuters around the Ajao Estate area of Lagos State, were left in shock after a commercial bus driver set himself ablaze to prevent his vehicle from being impounded by some officials of the Lagos State Traffic Management Authority.\nIn Malaysia the deputy minister of women and family community development affairs sparked outrage across the country for advising husbands to beat their unruly wives gently in order to discipline them."
  },
  {
    "headline": "Nigeria: How ‘Supercop’ Kyari Retained Loyalty of Elite Squad, Called the Shots Despite Suspension",
    "summarized_story": "Headed then by Kyari, the team soon made its mark as a squad that was out to tackle crime given the constant arrests and the category of cases they busted.\nThe case that brought him to national limelight was that of Evans Onwuamadike, the ‘Billionaire kidnapper’, who was arrested by Kyari and his team.\nFor each operation, the bond between Kyari and men forged stronger as they weathered one allegation after the other.\nHow did DCP Kyari think for a moment that he would be reinstated after the FBI fiasco?\nIt was a stunned IG, who heard that he kept assuring his boys that DCP Disu would be removed and he would be reinstated."
  },
  {
    "headline": "Nigeria: APC Governors Divided Over National Convention, Choice of Consensus",
    "summarized_story": "The forthcoming convention of Nigeria’s All Progressive Congress (APC) has split governors elected under the political party into three different groups.\nThe inside source stated, “We are now looking at March for possible date for the national convention.\nIt was learnt that the two governors met with the president last week, where they sold the idea of Senator Sani Musa as a consensus national chairman of the APC.\nBut other APC governors on hearing of the meeting rejected the choice of Musa, and insisted it was not made with their consent.\nBut the crisis rocking APC, insiders said, was compounded by the inability of the convention committee to announce a zoning formula for the national convention."
  }
]