[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Ninety: Building A Legacy",
    "summarized_story": "In 2016, Ninety graduated with a Bachelor of Science degree in Information Technology from the Accra Institute of Technology, Accra, Ghana.\nDecked in a crisp white shirt paired with blue jeans and white low-top sneakers, Ninety gives us insight into how he plans to leave a legacy.\nI think that’s a good way to describe the kind of music I make.\nIn what ways do you think social media has changed the music industry?\nCommunication is everything and social media has made that super easy."
  },
  {
    "headline": "Ninety: Building A Legacy",
    "summarized_story": "In 2016, Ninety graduated with a Bachelor of Science degree in Information Technology from the Accra Institute of Technology, Accra, Ghana.\nDecked in a crisp white shirt paired with blue jeans and white low-top sneakers, Ninety gives us insight into how he plans to leave a legacy.\nI think that’s a good way to describe the kind of music I make.\nIn what ways do you think social media has changed the music industry?\nCommunication is everything and social media has made that super easy."
  },
  {
    "headline": "Sandra Chukwudozie: The Energy Trailblazer",
    "summarized_story": "She is the Founder and CEO of Salpha Energy, an energy solutions company that enables people to access energy at all levels.\nI’m proud that the international media is paying attention to young Nigerian (women), who, are making real impact in the renewables sector.\nFrom a young age, I was exposed to the energy industry through the family business.\nThe Nigerian energy market is bottom heavy, so our strategy is to bring the underserved and unserved homes and businesses in rural and urban areas into focus, and up the energy ladder.\nI could go to the mainland where my office is at Festac or Apapa where my family business is."
  },
  {
    "headline": "Sandra Chukwudozie: The Energy Trailblazer",
    "summarized_story": "She is the Founder and CEO of Salpha Energy, an energy solutions company that enables people to access energy at all levels.\nI’m proud that the international media is paying attention to young Nigerian (women), who, are making real impact in the renewables sector.\nFrom a young age, I was exposed to the energy industry through the family business.\nThe Nigerian energy market is bottom heavy, so our strategy is to bring the underserved and unserved homes and businesses in rural and urban areas into focus, and up the energy ladder.\nI could go to the mainland where my office is at Festac or Apapa where my family business is."
  },
  {
    "headline": "Oluyemi Orija: Heartbeat For Indigent Inmates",
    "summarized_story": "Oluyemi Orija, Managing Partner at Headfort Chambers cum Executive Director of Headfort Foundation, is one who has dedicated her life to decongesting Nigerian prisons by helping poor inmates access justice.\nOrija has also drawn the attention of reputable local and international media outlets like Aljazeera and the Guardian UK.\nBeing a lawyer gave me the opportunity to touch lives by looking for indigent inmates incarcerated unjustly, and rendering free legal service to them.\nImagine a center built for 800 inmates housing over 3,000 inmates; what kind of rehabilitation will take place there?\nWhere inmates presumed innocent are living in the same space with condemned inmates for months, and sometimes, years?"
  },
  {
    "headline": "ASUU strike: Apostle Johnson Suleman warns Buhari govt",
    "summarized_story": "Apostle Johnson Suleman of Omega Fire Ministries has cautioned the Federal Government over the ongoing industrial action by the Academic Staff Union of Universities, ASUU.\nIn a tweet, Apostle Suleman wrote: “ASUU is still on strike!\nContinue!”DAILY POST reports that ASUU has been on strike since February 2022.\nThe latest strike was due to the Federal Government’s refusal to allow ASUU to use their own generated payment platform, University Transparency Accountability Solution, UTAS, among other demands.\nMeanwhile, the body had said the ongoing strike may end any time soon."
  },
  {
    "headline": "Plateau attacks: 12 killed as vigilante clash with bandits",
    "summarized_story": "Gunmen suspected to be bandits on Monday night clashed with vigilantes in Zak Community of Wase Local Government Area of Plateau State and as a result of the incident, 12 people were killed.\nDAILY POST recalls that last week Thursday, suspected bandits were said to have killed seven military personnel and one vigilante in some communities of Bashar chiefdom in the aforementioned council of the state.\nRecall that the suspected bandits had given quit notices to some communities in the council, warning the residents to evacuate the villages or be wiped out.\n“We are aware of an incident in Wase, but I cannot confirm any casualty.\nDAILY POST reports that Zak is about 40 kilometers from Wase town, the headquarters of Wase LGA."
  },
  {
    "headline": "Obaship stool: Ondo community kicks against alleged imposition by govt",
    "summarized_story": "Residents of Ifon Community, the administrative centre of Ondo State’s Ose Local Government Area, took to the streets to protest the purported state government’s intention to impose a candidate on them to fill the community’s vacant traditional leader’s seat.\nFollowing the passing of Oba Israel Adeusi, who was shot and assassinated by unidentified assailants on the Benin-Owo highway in the local government’s Elegbeka Area in November 2020, the Olufon stool became vacant.\nHe claimed that state deputy governor Mr. Lucky Ayedatiwa stated during a meeting with major community leaders that the seventh ruling house, the Erunogbe Ruling House, will produce the future monarch.\n“One Prince from Umougba Ruling House is already parading himself as the next king with the support of the state government.\n“This is an abomination that would have grave effects on the community if it became true,” he said."
  },
  {
    "headline": "Buhari bids outgoing OPEC Secretary-General, Barkindo farewell",
    "summarized_story": "President Muhammadu Buhari has bid farewell to the outgoing Secretary-General of the Organisation of Petroleum Exporting Countries (OPEC), Mohammed Barkindo.\n‘‘Your time in charge of the affairs of OPEC has been a very challenging one for the global oil industry.\nOil producers were finding it difficult to come together to address challenges that were crippling the oil market.\nHe added that OPEC is now in the final lap of restoring the production figures due to a rebound in the global market and economy.\nHe, therefore, thanked President Buhari for giving him the opportunity to serve, pledging that Nigeria would continue to play its leadership role in OPEC as well as in the global oil industry."
  },
  {
    "headline": "Pastors harbouring children illegally in Ondo church not our members – CAN",
    "summarized_story": "“CAN, therefore, commends the Police for their prompt actions which included rescuing over 70 victims from the Church premises.\nThey should further be subjected to medical check-ups since nobody knows what they were going through where they were camped.\n“We hereby urge all denominations to keep an eye on the pastors under them towards ensuring wholesome biblical conduct.\nMembers of the churches all over the nation are enjoined to cross-check every teaching from the Bible before believing it,” the statement further stated.\nRecall that the nation was awaken with a discovery of over 40 children allegedly camped in a church building on the guise of rapture."
  },
  {
    "headline": "Don't drop Okowa as running mate, Igbo youths warn Atiku, PDP The Nation Newspaper",
    "summarized_story": "Igbo youths under the auspices of the Ohanaeze Ndigbo Youth Council Worldwide(OYC) have cautioned the presidential candidate of the Peoples Democratic Party(PDP) Atiku Abubakar against any plan to drop Governor Ifeanyi Okowa as his running mate.\nThere are speculations that Atiku is facing pressures from governors to drop Okowa and replace him with his Rivers State counterpart, Nyesom Wike.\nHowever, in a statement on Tuesday in Enugu, the youths said Atiku should drop Okowa to his peril.\n“Though this has been overtaken by events, the only consolation we have is the choice of Governor Ifeanyi Okowa as running mate to Alhaji Atiku Abubakar, considering that Okowa is a true Igbo son.\nShould the PDP make the mistake of pairing him with Atiku, the PDP will be roundly rejected during the presidential election,” the Ohanaeze youths warned."
  },
  {
    "headline": "Amaechi influenced nominations of Odum, Umana as Ministers",
    "summarized_story": "A founding member of the All Progressives Congress (APC) in Rivers State, Eze Chukwuemeka Eze, has claimed that a former Transport Minister, Chibuike Rotimi Amaechi, influenced the nominations of Udi Odum and Umana Okon Umana as ministers.\nEze in a statement in Port Harcourt on Tuesday said the former Rivers Governor was also behind the reappointment of Prof. Henry Ugboma as the Chief Medical Director (CMD) of the University of Port Harcourt Teaching Hospital.\nEze said Amaechi’s actions and his participation at the presidential primary of the APC as a major contender were part of the reasons party faithful trooped out to give him heroic reception in Port Harcourt, Rivers State.\nEze said Amaechi tasked the people of the state to ensure the victory of APC candidates by mobilising and strengthening their units in the forthcoming elections.\nThe party chief described Amaechi as a great leader, who should be motivated and encouraged to continue to give out his best for the country’s good."
  },
  {
    "headline": "Court orders forfeiture of convict’s iPhone, laptop, Mercedes Benz to FG The Nation Newspaper",
    "summarized_story": "A High Court in Kaduna State on Tuesday ordered the EFCC to sell an iPhone 12, HP laptop and a Mercedes Benz C300 belonging to Julius Emmanuel and the proceeds paid into Federal Government coffers.\nThe EFCC Counsel, E. K. Garba, told the court that the convict was arrested based on intelligence report received on his internet-related fraud activities.\nGarba said on receiving the report, the convict was arrested in his residence in Kakuri Kaduna, where incriminating documents and materials were recovered from him.\nThe prosecution added that part of the money he got from the fraud activities, he used to purchase a Mercedes Benz C300 worth N8million.\nGarba urged the court to convict Emmanuel in line with his plea and the exhibits tendered before it."
  },
  {
    "headline": "BBNaija 7 returns with double show on July 23 The Nation Newspaper",
    "summarized_story": "Big Brother Naija will return for its seventh season in July with a double launch show on July 23 and July 24, 2022.\nFor the seventh season, the show will witness a return of a few pre-COVID 19 elements including the fan-favorite ‘Ninjas’ and a live studio audience.\nRead Also: Community leader tasks BBNaija organisers on modest presentationFans can also expect a line-up of more engaging tasks, unpredictable twists and Big Brother’s wit.\nVoting will only be on the Big Brother Naija website, mobile site and the MyDStv and MyGOtv apps for active customers.\nThe double launch shows, according to the organisers, will air from 7pm on Africa Magic Showcase, Africa Magic Urban and Africa Magic Family channels and the 24-hour show on DStv channel 198 and GOtv channel 29."
  },
  {
    "headline": "Wike’s camp gives ‘Ayu must go’ condition to back Atiku The Nation Newspaper",
    "summarized_story": "The camp of Rivers State Governor Nyesom Wike is seeking the immediate resignation of National Chairman Iyorchia Ayu as a condition for peace.\nIt follows overtures to the aggrieved governor by presidential candidate Atiku Abubakar.\nHowever, the presidential candidate insisted that the chairman should remain in office to lead his campaign for next year’s election after which he will quit.\nThey maintained that Atiku should honour his promise that once the PDP presidential candidate emerges from the North, a Southerner will lead the party.\n“It was agreed that once a presidential candidate comes from the North, the National Chairman of the party, Dr. Iyorchia Ayu, will step down."
  },
  {
    "headline": "VP slot: Islamic cleric, MBF, Afenifere, others reject Muslim-Muslim ticket",
    "summarized_story": "Kaduna-based Islamic cleric, Sheik Haliru Maraya, said it was wrong for any Muslim to support a Muslim-Muslim ticket.\nThe cleric, in a statement, yesterday, said those promoting the Muslim-Muslim ticket do not wish the country well.\n“The journey will still be rough for Muslim-Muslim ticket but it is a lesser risk for the party.\n“There is a huge difference between when a Northern Muslim runs a Southern Muslim presidential ticket, and when a Southern Muslim runs a Northern Muslim presidential ticket.\nKeeping in mind that the Vice President is selected and not elected, a Muslim- Muslim ticket, or a South-South ticket will represent a clear demonstration of insensitivity and political recklessness,” he said."
  },
  {
    "headline": "Amotekun’ll confront bandits in forest –Akeredolu",
    "summarized_story": "By Christopher Oji, Sunday Ani and Chukwudi NwejeOndo State Governor, Oluwarotimi Akeredolu (SAN), has said that members of the South West security outfit, Amotekun, would no longer wait for herdsmen and bandits terrorising the state to attack the people, but take the battle to them in the forest.\nSpeaking during the Politics Today programme on Channels Television, yesterday, Akeredolu decried a situation where criminals are left to acquire illegal weapons, while Nigerians are disposed of their legally acquired weapons.\nThe governor also charged the people of Ondo State to, henceforth, confront the criminals when they attack them, instead of running into their homes.\nHow we are going to confront the criminals is not what we shall discuss in public, but how we are going to do it is nobody’s business,” he said.\nHow do we determine those behind the attack when herdsmen, bandits and terrorists are all in the bushes."
  },
  {
    "headline": "Sultan, CAN, Methodist bishop, others move to douse religious, ethnic tension",
    "summarized_story": "By Chukwudi NwejeAhead of the 2023 general election, eminent religious and civic leaders from across Nigeria have joined their voices to condemn the growing issues of injustice and inequitable representation in government.\nThe religious leaders, including Sultan of Sokoto, Muhammadu Sa’ad Abubakar, President, Christian Association of Nigeria (CAN), Samson Ayokunle, and President and founder, Vision Africa, Sunday Onuoha, made their views known in a joint statement entitled: ‘Declaration for a Peaceful and Secure Nigeria’, issued after an International Religious Freedom Summit in Washington, D.C., at the weekend.\nTherefore, the essential freedom and dignity of every person must be respected and protected.\n“We recognise and respect the various traditions and faith communities present in Nigeria, and will promote their collaboration to advance the well-being of all and to resolve conflicts peacefully,” they said.\n“We will engage in constructive, respectful dialogue, always seeking pathways to cooperative action that promote the common good for the people and country of Nigeria."
  },
  {
    "headline": "FG unviels criteria for 2022 FGCs admission",
    "summarized_story": "From Fred Ezeh, AbujaFederal Government has reconfirmed that it would strictly abide by the established criteria for admission into 110 Federal Government Colleges (FGCs) otherwise known as Unity Schools.\nIt said 60 per cent of the admission would be based on national merit, 30 per cent would be on equality of states while 10 per cent will be on exigency.\nA statement from Federal Ministry of Education indicated that the Minister of Education, Mallam Adamu Adamu, disclosed the information at the meeting of the Principals of the110 Unity Colleges in Benin, which marks the commencement of the admission process into Unity Colleges.\nAdamu who was represented by Hajia Binta Abdulkadir, director, Senior Secondary Education in the Ministry, directed that the admission process must be guided by the principles of fairness, equity and good conscience.\nHe emphasised that candidates who applied for admission from outside of their immediate communities should be given priority in the admission process."
  },
  {
    "headline": "Another Catholic priest kidnapped in Kaduna",
    "summarized_story": "From Noah Ebije, Kaduna and Tony Osauzo, BeninThe parish priest of St. Charles Catholic Church, Zambina, in Kauru Local Government Area of Kaduna State, Rev.\nEmmanuel Uchechukwu Okolo, confirmed the development in a statement made available to journalists in Kaduna.\nThe statement said: “It is with great pain that we announce to you the kidnapping of our priest, Rev.\n“He was abducted from the parish rectory at St. Charles Catholic Church, Zambina, in Kauru Local Government Area of Kaduna State.\n“May Jesus, crucified on the Cross, listen to our prayers and hasten the unconditional release of His Priest and all other kidnapped persons.”Meanwhile, the Edo State Police Command, yesterday, announced the rescue of Rev."
  },
  {
    "headline": "Runsewe Vindicated as Knocks Trail Clerics Praying at Bobrisky’s Housewarming – THISDAYLIVE",
    "summarized_story": "Even so, not everybody has been brave enough, like that African President, to speak out against the rising tide of this behaviour.\nBut the Director-General of the National Council for Arts and Culture (NCAC), Segun Runsewe, is leading the conversation.\nIn the beginning, Bobrisky received knocks because he claimed that he bought the house for N400 million.\nDuring the ceremony, however, Bobrisky was not the main attraction, rather the Islamic clerics who attended the housewarming ceremony took the spotlight.\nThe clerics were not at Bobrisky’s party to renounce his cross-dressing lifestyle."
  },
  {
    "headline": "Niger Suspends Mining Activities in 3 LGAs – THISDAYLIVE",
    "summarized_story": "Laleye Dipo in MinnaThe Niger State Government yesterday suspended mining activities in three local government areas, including Shiroro, where seven Mobile Policemen were killed by terrorists last week.\nTHISDAY observed that not less than 1,000 mining sites are in the state with none of them registered with the state government.\nIt was also learnt that the state government has not been generating any income from the mining sites.\nThe Managing Director of the Niger State Solid Minerals Company, Mr. Rufai Umar, when contacted, declared that: “Officially we don’t know about Ajate Aboki mining site; there is no official relationship with us (government).\n“Of course, we don’t know who owns the mining site, and that is one of the problems we are facing in the state."
  },
  {
    "headline": "Private Sector Moves to Partner NIWA to Complete Lokoja River Port – THISDAYLIVE",
    "summarized_story": "Ibrahim Oyewale in LokojaThe private sector in Kogi State and the management of the Nigeria Inland Waterways Authority (NIWA) are mulling a partnership arrangement between them that would lead to the completion of the Jamata River Port in Lokoja, the state capital.\nThe General Manager, Marine Services of NIWA, Mr. Joseph Ororo, and the General Manager, Ports and Environmental Services, Agbalu Fidelis, were among other top management staff of NIWA at the facility tour.\nWhile the private sector lauded the efforts of the government thus far, it decried the slow pace of work on the port, pointing out that if the port is operational, it would help reduce cost of doing business.\nThe private sector said the location of Lokoja and the River Port cannot be overemphasised, lamenting that travel time, loss of many hours, and dilapidated nature of the state of Nigerian roads have made it very important to complete the Lokoja port.\nThe various representatives of the private sectors pointed out that following the benefits that would accrue the country when completed, and called the government to seek a private sector partnership arrangement that would see to the completion of the port."
  },
  {
    "headline": "Ondo Police Rearrest Notorious Jailbreaker in Soakaway – THISDAYLIVE",
    "summarized_story": "*I’ve killed only three people, says suspectFidelis David in AkureOperatives of the Ondo State Police Command yesterday re-arrested a 21-year-old serial killer and Jail-breaker, Ikuemelo Tosin, popularly known as 4Gnetwork, in a soakaway.\nTHISDAY gathered that the convict, who escaped during the Owo Correctional jail break in May 2022, was re-arrested at Igbokoda in Ilaje Local Government Area of the state.\nImmediately, the Divisional Police Officer (DPO) and his men went after him, and was re-arrested in a soak-away.\nThe suspect, while reacting, said he had killed only three persons as a cultist before his arrest.\nSix other convicts and I met in the correctional centre, planned and escaped through the toilet sink after digging out through the pipe because there was one Aboki (northerner) among us."
  },
  {
    "headline": "BBNaija Returns with N100m Grand Prize – THISDAYLIVE",
    "summarized_story": "By Vanessa ObiohaPopular Reality TV show, Big Brother Naija, will be returning for its seventh season on July 23 with a N100 million grand prize.\nIt has become a tradition for the organisers to top the winning prize each new season.\nLast year, the winner, WhiteMoney, went home with a N90 million grand prize.\nThe show returns with some of its pre-Covid elements including the fan-favourite ‘Ninjas’ and a live studio audience.\nThe seventh season will be a double launch, premiering on Saturday, 23 and Sunday, 24 July 2022."
  },
  {
    "headline": "EXCLUSIVE: Organ Harvesting: Beatrice, Wife Of Nigerian Ex-Deputy Senate President, Ekweremadu, Held In HMP Bronzefield Prison, Europe’s Largest Female Jail",
    "summarized_story": "Beatrice, wife of the former Deputy Senate President, Ike Ekweremadu, is being held at HMP Bronzefield prison in the United Kingdom, SaharaReporters has gathered.\nHMP Bronzefield is an adult and young offender female prison located on the outskirts of Ashford in Surrey, England.\nBronzefield is the only purpose-built private prison solely for women in the UK, and is the largest female prison in Europe.\nSee Also Military Organ Harvesting: Ekweremadu Appears Before UK Court, Date Fixed To Decide Location Of Trial“The women are unlocked at 08:00hrs for breakfast and to receive any medication they may require.\nThe Uxbridge Magistrate Court last week denied Beatrice access to Ekweremadu who is being detained in another prison."
  },
  {
    "headline": "EXCLUSIVE: Organ Harvesting: Beatrice, Wife Of Nigerian Ex-Deputy Senate President, Ekweremadu, Held In HMP Bronzefield Prison, Europe’s Largest Female Jail",
    "summarized_story": "Beatrice, wife of the former Deputy Senate President, Ike Ekweremadu, is being held at HMP Bronzefield prison in the United Kingdom, SaharaReporters has gathered.\nHMP Bronzefield is an adult and young offender female prison located on the outskirts of Ashford in Surrey, England.\nBronzefield is the only purpose-built private prison solely for women in the UK, and is the largest female prison in Europe.\nSee Also Military Organ Harvesting: Ekweremadu Appears Before UK Court, Date Fixed To Decide Location Of Trial“The women are unlocked at 08:00hrs for breakfast and to receive any medication they may require.\nThe Uxbridge Magistrate Court last week denied Beatrice access to Ekweremadu who is being detained in another prison."
  },
  {
    "headline": "Nigerian Soldiers Kick Against Army Day Celebration, Accuse Top Officials Of Corruption",
    "summarized_story": "This is coming barely 48 hours to this year’s July 6th Army Day Celebration, in which the aggrieved soldiers have insisted that there is nothing to celebrate.\nAccording to them, the major problem is that some of the top Army officers are involved in massive corruption and feeding large on the entitlements of personnel.\n“They are celebrating Army Day while some soldiers are using their money to pay for the houses they are living in while they are serving in the army because there is no accommodation in barracks.\nSoldiers use their money to buy uniforms and they are talking about Army Day celebration.\nYet, the army would say that they are taking care of soldiers and the families of soldiers that lost their lives."
  },
  {
    "headline": "Nigerian Soldiers Kick Against Army Day Celebration, Accuse Top Officials Of Corruption",
    "summarized_story": "This is coming barely 48 hours to this year’s July 6th Army Day Celebration, in which the aggrieved soldiers have insisted that there is nothing to celebrate.\nAccording to them, the major problem is that some of the top Army officers are involved in massive corruption and feeding large on the entitlements of personnel.\n“They are celebrating Army Day while some soldiers are using their money to pay for the houses they are living in while they are serving in the army because there is no accommodation in barracks.\nSoldiers use their money to buy uniforms and they are talking about Army Day celebration.\nYet, the army would say that they are taking care of soldiers and the families of soldiers that lost their lives."
  },
  {
    "headline": "Crisis Brews In Delta State Community After Over 300 Fulani Herdsmen Settle In, Monarch Issues 15-day Ultimatum For Relocation",
    "summarized_story": "Residents of Okpanam community in the Oshimili North Local Government Area of Delta State have been engulfed in fear as no fewer than 300 Fulani herdsmen reportedly took over a section of the community and are settling in.\nBut the traditional ruler said on Monday that “Fulani people just went to occupy one part of Obodogba land belonging to the Okpanam community.\nHe is dealing with the security challenges community by community.\nThe government should come to our aid and halt the council chairman from passing this so-called executive order.\nHowever, the Delta State Commissioner for Information, Mr. Charles Aniagwu, has said that the state government was not aware of invasion of part of Okpanam land by herdsmen."
  },
  {
    "headline": "UK court to sentence 85-year-old Nigerian-born doctor for killing woman during procedure",
    "summarized_story": "Isyaka Mamman, an 85-year-old Nigerian-born doctor, is to be sentenced by the Manchester Crown Court for gross negligent manslaughter of a patient at the Royal Oldham Hospital, United Kingdom.\nMamman is said to have been born in Okene, Kogi state, and qualified as a doctor in Nigeria in 1965.\nAlso, the court heard that his “true age” is a matter of contention as his birthplace in Nigeria has no system of birth registration.\nHe later took off years from his age by adopting a birth date in 1941, suggesting he began his medical degree at the age of 16.\nAdvertisementBut in 2001 when he began approaching the compulsory retirement age of 65, Mamman adopted yet another birth date – October 1947."
  },
  {
    "headline": "UK court to sentence 85-year-old Nigerian-born doctor for killing woman during procedure",
    "summarized_story": "Isyaka Mamman, an 85-year-old Nigerian-born doctor, is to be sentenced by the Manchester Crown Court for gross negligent manslaughter of a patient at the Royal Oldham Hospital, United Kingdom.\nMamman is said to have been born in Okene, Kogi state, and qualified as a doctor in Nigeria in 1965.\nAlso, the court heard that his “true age” is a matter of contention as his birthplace in Nigeria has no system of birth registration.\nHe later took off years from his age by adopting a birth date in 1941, suggesting he began his medical degree at the age of 16.\nAdvertisementBut in 2001 when he began approaching the compulsory retirement age of 65, Mamman adopted yet another birth date – October 1947."
  },
  {
    "headline": "LP's coalition talks with NNPP collapsed on June 15, says Victor Umeh",
    "summarized_story": "Victor Umeh, former national chairman of the All Progressives Grand Alliance (APGA), says the coalition talks between the Labour Party (LP) and the New Nigeria Peoples Party (NNPP) ended on June 15.\nUmeh faulted Rabiu Kwankwaso, presidential candidate of the NNPP, for giving the impression that the talks between both parties are still in progress.\nAdvertisementHe said the Labour Party is no longer interested in “every other discussion” with the NNPP.\nThe Labour Party has averted its mind from every other discussion with the NNPP.\n“But these fellows have continued to give the impression that they are still in talks with the Labour Party."
  },
  {
    "headline": "LP's coalition talks with NNPP collapsed on June 15, says Victor Umeh",
    "summarized_story": "Victor Umeh, former national chairman of the All Progressives Grand Alliance (APGA), says the coalition talks between the Labour Party (LP) and the New Nigeria Peoples Party (NNPP) ended on June 15.\nUmeh faulted Rabiu Kwankwaso, presidential candidate of the NNPP, for giving the impression that the talks between both parties are still in progress.\nAdvertisementHe said the Labour Party is no longer interested in “every other discussion” with the NNPP.\nThe Labour Party has averted its mind from every other discussion with the NNPP.\n“But these fellows have continued to give the impression that they are still in talks with the Labour Party."
  },
  {
    "headline": "Winner to get N100m prize as BBNaija season 7 begins July 23",
    "summarized_story": "Multichoice Nigeria has announced that season seven of the Big Brother Naija (BBNaija) reality show will begin on July 23.\nAdvertisementThe organisers, in a press briefing on Tuesday, also announced a grand prize of N100 million for this year’s winner.\nThis makes it the highest grand prize a winner of the reality show will be receiving — since the BBNaija debuted in 2006.\nIt will air from 7 pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban, and Africa Magic Family.\nIn 2020, Olamilekan ‘Laycon’ Agbeleshe emerged the winner of the BBNaija season five."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "How Nigerian startups can build healthier cultures",
    "summarized_story": "Earlier in May, TechCabal asked 5 employees at different startups what was important to them when considering a job offer.\nBut they ranked something else even higher: company culture.\nTurnover costs startups up to 20% of an employee’s annual salary, and for managerial roles, the costs will go up.\nBucknor uses the 70–20–10 model to explain why it’s important that startups learn how to give constructive feedback.\nThe way you address those needs impact your relationship with the children.”The right incentives, according to Samson-Grace, can boost a startup’s culture."
  },
  {
    "headline": "10 lessons Emeka Ajene learned while building Gozem",
    "summarized_story": "Emeka Ajene co-founded Gozem alongside Raphael Dana in 2018.\nAcross African markets where the innovation economy is still nascent and some positive aspects of Silicon Valley-style management aren’t widely-adopted (yet?\nHearing but not heeding is what kills young men.” — Igbo proverbAttracting talent is a challenge for all organizations, and doubly so for early-stage companies.\nAnd for startups operating in African markets, the talent challenge is compounded by the relative lack of depth within local talent pools.\nDuring my time in Togo, Gozem experienced its share of unforeseen external bad luck, from office flooding to power outages to regular connectivity disruptions and more."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "DMO lists 2 FGN savings bonds for subscription at N1,000 per unit – Nigerian Observer",
    "summarized_story": "DMO lists 2 FGN savings bonds for subscription at N1,000 per unitShare FacebookTwitterStumbleuponLinkedInPinterestThe Debt Management Office (DMO) on Monday announced the listing of two FGN savings bonds for subscription for the month of July.\nThe bonds were offered at N1,000 per unit.\nThey are subject to a minimum subscription of N5,000 and in multiples of N1,000 thereafter, subject to a maximum subscription of N50 million.\n“Settlement date is June 15, and coupon payment dates are Sept. 15, Dec. 25, March 15 and June 15.\n“Interest is payable quarterly and bullet repayment is on the maturity date,’’ the DMO stated."
  },
  {
    "headline": "Intending spouses, politicians should go through drug screening – NDLEA Boss – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestRetired Brig.-Gen. Mohammed Buba-Marwa, NDLEA chairman, has reiterated the need for drug tests for intending couples.\nHe stressed that intending spouses and even politicians should go through drug screening and those found wanting should go into rehabilitation.\n“We must all rise against drug abuse.\nMarwa also solicited for continued partnership with the media for more awareness and sensitisation on the fight against drug abuse.\nEarlier, Chairman of the NUJ Council, Ishaka Dedan, appreciated Marwa’s contributions to the fight against drug abuse, stating that a lot of success had been achieved."
  },
  {
    "headline": "Scraping, abandoning Ajaokuta steel coy will be a waste — D-G – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestProf. Linus Asuquo, the Director-General, National Metallurgical Development Centre (NMDC), says scraping or abandoning Ajaokuta Steel Company will be a great waste.\nHe said that reviving the steel company would be the best option for the country rather than neglecting the project to waste year on year.\n“We are spending billions of naira to import metals being used for our railway construction, if we have Ajaokuta steel company working, there will be no need importing steel.\nAsuquo said that coal and iron ore needed for iron making had been researched by NMDC, adding that only foreign coal would be needed to blend with Nigeria coal for steel making.\n“Coal is one of the materials needed for iron making and lots of research have been done on that by the centre."
  },
  {
    "headline": "How fuel queues in Abuja is being tackled – NNPC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian National Petroleum Company Limited (NNPC Ltd) started its weekly activities with a resolve to quickly end the incessant queues at various filling stations in the Federal Capital Territory (FCT), Abuja.\n“No one can guarantee stability of petroleum products supply; the world has never seen this kind of uncertainty.\nSpeaking at the event in Abuja, the Minister of State for Petroleum Resources, Chief Timipre Sylva, said that the presentation of the Licences was part of the implementation of the PIA 2021.\nKomolafe added that the conclusion of the 2020 Marginal Fields Bid Round brought to an end the era of Marginal Field awards as stipulated by the PIA.\n“I make bold to say that harnessing our abundant resources remains Nigeria’s major pathway towards leveraging gas, the least carbon-emitting fossil fuel, as a transition fuel."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "BBNaija season 7 begins July 23, winner to get N100m in prizes",
    "summarized_story": "Multichoice Nigeria, organisers of the Big Brother Naija (BBNaija), has announced that season seven of the reality show will begin on July 23.\nThe organisers, in a press briefing on Tuesday, also announced a grand prize of N100 million for this year’s winner.\nBusola Tejumola, head of content and West Africa channels of Multichoice Nigeria, said the winner of the show take home N50 million cash prize with another N50 million worth of prizes from the sponsors.\nIt will air from 7 pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban, and Africa Magic Family.\nThis year’s edition of BBNaija will run for 72 days and end on October 2, 2022."
  },
  {
    "headline": "Capacity of Nigeria’s 26 power plants drop by 70%",
    "summarized_story": "The combined generation capacity of 26 power plants in Nigeria has dropped by 70 percent.\nThe data shows that the capacity of the plants dropped from a total of 13,461 megawatts to 4,022MW as of when they were last tested in July 2021.\nShiroro plant with a nameplate capacity of 600MW already dropped to 248MW, while Mabon with 40MW capacity did not generate any power as of the last review date.\nThe gas plants under the Power Plant Agreement such as Egbin, went from 1100MW to 606MW, Sapele from 1020MW to 46MW, Delta from 900MW to 281MW, AfamIV-V production capacity went from 776MW to 67MW, and Geregu capacity dropped from 414MW to 277MW.\nThe country’s power generation had, as of last month, crashed to an all-time low of 9MW per day."
  },
  {
    "headline": "PDP Primary: Sam Ohuabunwa lost to undemocratic delegates system – Prof. Nwala, ADF president",
    "summarized_story": "Prof. Uzodinma Nwala, president of the Alaigbo Development Foundation (ADF), has decried the outcome of the People’s Democratic Party (PDP) presidential primary, noting that Mazi Sam Ohuabunwa, a renowned pharmacist who had participated in the primary, lost to what he described as the undemocratic delegates system.\nAccording to Nwala, Mazi Ohuabunwa is one of the most qualified Nigerians, but was rigged out by the system.\n“Mazi Sam Ohuabunwa has been with us for several years and we know him as one of the most priceless candidates of any political party in the Nigerian political system.\nHe and people like Mr Peter Obi, are a few of the gems in the Nigerian political history.\n“ADF urges Mazi Sam Ohuabunwa to keep his head high and not to abandon the suffering masses."
  },
  {
    "headline": "Universal Insurance posts N2.33bn as turnover, PAT rises by 300.58% in Q1",
    "summarized_story": "Adebayo ObajemuUniversal Insurance Plc has come out with its First Quarter report for the period ended 31 March 2022.\nGross Premium Written of N2.33 billion was reported for the 3 months period, up by 47.60% from N1.58 billion reported the previous year.\nProfit after tax grew by 300.58% to N674 million from N168.29 million reported in Q1 2021.\nEarnings per share increased significantly to 4 kobo from the EPS of 1 kobo.\nAt the share price of 20 kobo, the P/E ratio of Universal Insurance stands at 4.75x with earnings yield of 21.07%."
  },
  {
    "headline": "PDP can’t remove sitting govt with divided house – Party chieftain warns",
    "summarized_story": "Recently, the likes of Samuel Ortom, Benue State governor; Ayodele Fayose, former Ekiti State governor, Jonah David Jang, former Plateau State governor, among others, have strongly criticised Atiku over the decision.\n“It was wrong for Atiku to send messengers to Wike, he has direct access to him and should talk to him,” he said.\nThe issue of chairman should be addressed after the election because we can’t remove the incumbent government with a divided house and a new chairman,” he said.\n“Many governors are with Wike and they must be brought in because we can’t win without the governors.\nThose outside the party would wish there is an implosion in the party, but the leaders must not allow this to happen.”"
  },
  {
    "headline": "BREAKING: Winner To Get N100m Prize As BBNaija 7 Begins July 23",
    "summarized_story": "Multichoice Nigeria has announced that Season Seven of the Big Brother Naija (BBNaija) reality TV show will begin on Saturday, July 23, 2022.\nThe organisers, in a press briefing on Tuesday, also announced a grand prize of N100million for this year’s winner.\nHead of content and West Africa channels of Multichoice Nigeria, Busola Tejumola, said the winner of the reality TV show will take home N50million cash prize with another N50million worth of prizes from the sponsors.\nIt will air from 7pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban, and Africa Magic Family.\nThis year’s edition of BBNaija will run for 72 days and end on October 2, 2022."
  },
  {
    "headline": "BREAKING: Winner To Get N100m Prize As BBNaija 7 Begins July 23",
    "summarized_story": "Multichoice Nigeria has announced that Season Seven of the Big Brother Naija (BBNaija) reality TV show will begin on Saturday, July 23, 2022.\nThe organisers, in a press briefing on Tuesday, also announced a grand prize of N100million for this year’s winner.\nHead of content and West Africa channels of Multichoice Nigeria, Busola Tejumola, said the winner of the reality TV show will take home N50million cash prize with another N50million worth of prizes from the sponsors.\nIt will air from 7pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban, and Africa Magic Family.\nThis year’s edition of BBNaija will run for 72 days and end on October 2, 2022."
  },
  {
    "headline": "JUST-IN: 12 Persons Feared Killed As Bandits, Vigilantes Clash In Plateau Village",
    "summarized_story": "At least 12 persons were feared killed in a clash between bandits and vigilantes in Zak community of Wase local government area of Plateau State.\nA youth leader in Wase by name Shapi’i, who confirmed the development, told our correspondent that the incident occurred around 9am on Monday.\nHe explained that the clash left 12 people dead including nine bandits and three members of the vigilante group.\nLEADERSHIP reports that Zak, is about 40 kilometers from Wase town, the headquarters of Wase LGA.\nThe youth leader narrated that, “The bandits came on motorcycles in their numbers in the morning."
  },
  {
    "headline": "JUST-IN: 12 Persons Feared Killed As Bandits, Vigilantes Clash In Plateau Village",
    "summarized_story": "At least 12 persons were feared killed in a clash between bandits and vigilantes in Zak community of Wase local government area of Plateau State.\nA youth leader in Wase by name Shapi’i, who confirmed the development, told our correspondent that the incident occurred around 9am on Monday.\nHe explained that the clash left 12 people dead including nine bandits and three members of the vigilante group.\nLEADERSHIP reports that Zak, is about 40 kilometers from Wase town, the headquarters of Wase LGA.\nThe youth leader narrated that, “The bandits came on motorcycles in their numbers in the morning."
  },
  {
    "headline": "JUST-IN: Kidnapped Kaduna Catholic Priest Regains Freedom",
    "summarized_story": "Barely 24 hours after his abduction, a Kaduna Catholic Priest, Rev.\nEmmanuel Silas, has regained his freedom from abductors.\nJUST-IN: Again, Catholic Priest Kidnapped In KadunaThe Chancellor said, “with hearts filled with joy, we raise our voices in a symphony of praises as we announce the return of our brother, Rev.\nEmmanuel Silas was released around 9.00pm same day he was kidnapped.\nEmmanuel Silas.”"
  },
  {
    "headline": "JUST IN: U. S. Court Postpones Sentencing Of Hushpuppi, For The Second Time",
    "summarized_story": "JUST IN: U. S. Court Postpones Sentencing Of Hushpuppi, For The Second TimeThe U. S. Central District Court in California has again postponed the sentencing of Ramon Abass, popularly known as Hushpuppi, for the multi-million-dollar fraud charges.\nMr. Abass, in July 2021 agreed to plead guilty to the multi-million-dollar fraud charges filed against him by the United States government.\nDespite pleading guilty, Mr. Abass will not be exempted from paying restitution.\n“Defendant understands that the defendant will be required to pay full restitution to the victim(s) of the offense to which the defendant is pleading guilty.\nThe exact sentence to be imposed on Mr. Abass remains unknown."
  },
  {
    "headline": "Petrol Subsidy Removal At This Time Could Cause Instability – Lai Mohammed",
    "summarized_story": "The minister of information and culture, Lai Mohammed, in an interview on Monday, said it is the wrong time to remove the costly petrol subsidy.\nThe federal government had postponed the planned petrol subsidy removal till further notice, citing “high inflation and economic hardship”.\nZainab Ahmed, minister of finance, budget, and national planning, had said petrol subsidy was “hurting the nation” and limiting the federal government’s ability to service debt.\nThe International Monetary Fund and the World Bank had also raised concerns about Nigeria’s petrol subsidy.\n“We believe that climate change is real and important for emission control, but there is a bit of double standard in the EU policy regarding climate change,” he said."
  },
  {
    "headline": "Billionaire Otedola Visits Tinubu, Prays He Becomes President In 2023",
    "summarized_story": "Billionaire Otedola Visits Tinubu, Prays He Becomes President In 2023Billionaire businessman, Femi Otedola, has visited the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Ahmed Tinubu, in Paris, France.\nTinubu is currently in France holding ‘important meetings’ according to his spokesperson, Tunde Rahman.\nOtedola’s visit to Tinubu comes after that of the Ogun State governor, Dapo Abiodun, who visited the APC national leader in Paris on Monday.\nThe businessman, who described Tinubu as his ‘great friend’, prayed that the APC presidential candidate wins the 2023 presidential election.\nOtedola, who took to his verified Twitter handle on Tuesday to announce his meeting with Tinubu, wrote: “I am always excited visiting my Great Friend Asiwaju Ahmed Bola Tinubu @officialABAT“May God grant him his heart’s desire in becoming the President of this great Nation …F.Ote”"
  },
  {
    "headline": "Insecurity: Comedian I Go Dye Commends Edo Dep. Gov’s Collaborative initiative",
    "summarized_story": "Philip Shaibu on his collaborative approach to combating insecurity in the State.\nHe said, in a post made available on his Instagram some hours ago, “I want to commend the acting Governor of Edo State Rt.\nConsequently, in promoting this value as a global diplomat on peace advocate ambassador I want to commend the acting Governor of Edo State Rt.\nThe security votes budgeted should be used to influence the capacity of the various security agencies,” he writes.\nIn recent times the comedian has been more involved in the affairs of the nation, airing his opinions on national issues."
  },
  {
    "headline": "Picture: Otedola hits France, prays for Tinubu",
    "summarized_story": "Billionaire businessman, Femi Otedola, has prayed for the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Ahmed Tinubu, over his 2023 ambition.\nOtedola made this known after he visited Tinubu in Paris, France.\nSharing a picture on his Twitter page, Otedola eulogised Tinubu as his “great friend”.\n“I am always excited visiting my great friend Asiwaju Ahmed Bola Tinubu,” Otedola tweeted on Tuesday.\n“May God grant him his heart’s desire in becoming the President of this great Nation."
  },
  {
    "headline": "Strike: ASUU reveals when universities will resume if…",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) said its members were ready to resume as soon as the federal government responds to their demands.\nSpeaking on Monday night, ASUU President, Professor Emmanuel Osodeke, made it known during an interview on Channels Television, saying the government was responsible for the prolonged strike action.\nHe said the striking lecturers were ready to resume immediately as soon as the government meets their demands.\nIn his words, “As far as ASUU is concerned, the strike can end tomorrow.\n“Let the government tell us we have finished testing the UTAS, we have accepted it; by tomorrow we will call off the strike."
  },
  {
    "headline": "Official: Kidnapped Catholic priest regains freedom",
    "summarized_story": "The Catholic Diocese of Kafanchan, Kaduna State has confirmed the release of Rev.\nEmmanuel Silas, barely 24 hours after he was abducted by some armed men.\nSilas was kidnapped from the parish rectory at St. Charles Catholic Church in Zambina, Kauru Local Government Area of Kaduna state in the early hours of Monday.\nEmmanuel Okolo, thanked everyone who offered prayers for the quick release of the priest.\n“With hearts filled with joy, we raise our voices in a symphony of praises as we announce the return of our brother, Rev."
  },
  {
    "headline": "Group Berates Oil Marketers, Commends Kyari",
    "summarized_story": "The Coordinator, Stand Up Nigeria, Sunday Attah, on Saturday berates the action of some oil marketers who are hiding under various claims to create artificial logjams in order to force the government to increase the pump price of fuel.\nAttah describe the development as most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits.\nThe group however, exonerated the NNPC from playing any role in the ongoing scarcity after carrying out investigation into the cause of the problem.\nThis is most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits”.\nWe therefore call on the marketers to show more sense of patriotism by taking into cognisance the pains they put other Nigerians through just to make profit."
  },
  {
    "headline": "ACCI Appoints MD/CEO Bristol Group as Vice President – Industry",
    "summarized_story": "The Executive Committee and Council Members of Abuja Chamber of Commerce and Industry has appointed the group Managing Director and Chief Executive Officer (MD/CEO) of Bristol Group, Dr Chijioke Ekechukwu as the Vice President -Industry of the Chamber.\nThe President of ACCI, Dr Al-Mujtaba Abubakar announced the appointment of Dr Ekechukwu at the 16th EXCO meeting on Thursday as ACCI VP Industry to replace the late Ichie Jude Igwe who occupied the position till his demise on the 15th of October 2021.\nDr Chijioke has served as the Director General ACCI betweeen 2017 and 2018.\nHe is on the Board of First Generation Mortgage Bank Ltd, Abuja, Bristol Academy Ltd and Dignity Finance and Investments Ltd.\nHe is also the Chairman of Oriental Rice Mill Ltd.Dr. Ekechukwu, a former President of Rotary Club of Abuja is happily married with children."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Russian-Ukraine War: Buhari wants EU to increase oil and gas purchases from Nigeria",
    "summarized_story": "By Mathew Dadiya, AbujaPresident Muhammadu Buhari, Thursday in Lisbon, Portugal, indicated that Nigeria is ready to fill the natural gas gaps in Europe predicated by the current Russian-Ukrainian war.\nThe President also said with over 200 million mainly young people, Nigeria is ready to be the hub of the African Continental Free Trade Area (AFCFTA).\nIn his statement on areas of cooperation between Nigeria and Portugal delivered at the Presidential Palace in Lisbon, Buhari urged Portugal to consider Nigeria as a valued and trusted partner in Africa.\nOn oil and gas, Buhari said with the current Russian-Ukraine war, increased cooperation in oil and gas between the two countries has become vital to avoid a crisis in the demand and supply chain, even as Nigeria is already a major supplier of gas to Portugal.\nBuhari also stressed the need to establish a Joint Commission, saying:‘‘We believe that the establishment of a Joint Commission will help to promote the full realization of the objectives of our bilateral relations."
  },
  {
    "headline": "Why Nigeria Can’t Remove Fuel Subsidies Now – Lai Mohammed",
    "summarized_story": "The Minister of Communication and Culture, Lai Mohammed, has said that the Federal Government cannot, at the moment, remove subsidies on the Premium Motor Spirit (PMS), popularly called petrol.\nNigeria is Africa’s largest oil exporter but still has to import almost all its fuel needs due to a lack of refining capacity.\nThe Federal Government shelved plans to abolish fuel subsidies earlier this year, a move that raised concerns with the International Monetary Fund (IMF).\nHe added, “We believe that climate change is real and important for emission control, but there is a bit of double standard in the EU policy regarding climate change,” he said.\nNigeria suffers intermittent fuel shortages and has raised its deficit forecast twice this year and increased borrowing to cover the cost of the subsidy."
  },
  {
    "headline": "ASUU Ready To Call Off Strike Once FG Signs Agreement – Prof Osodeke",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has said it is ready to call off its nationwide industrial action immediately if the Federal Government signs the negotiated agreement.\n“As far as ASUU is concerned, the strike can end tomorrow, we have finished the negotiations, let the government call us this night that we should come tomorrow and sign the agreement, we will be there,” Osodeke said.\nWhen will they sign the agreement, and when will they accept UTAS?\nOn Monday, the ASUU strike action entered its 140th day with the union and Federal Government failing to reach an agreement for the overall good of the Nigerian students.\nASUU has been at loggerheads with the federal government, citing the refusal of the latter to honour the 2009 agreement it entered with the Union."
  },
  {
    "headline": "Gunmen Kidnap Naval Officer, Demand N3m Ransom",
    "summarized_story": "Gunmen have kidnapped an Abuja-based officer of the Naval Headquarters in Abuja, Musa Lawal.\nDuring the attack, his car was destroyed by the suspected kidnappers as they forcefully gained entrance into his residence.\nAccording to the wife of the kidnapped naval officer, Mrs Juliana Musa, the kidnappers reached out to the family an hour after her husband was kidnap, demanding N3 million.\nWhen contacted, the Kogi State Police Public Relations Officer, SP Williams Ayah, confirmed the incident to Channels Television on Tuesday via a phone call.\nAyah stated that the police in collaboration with the navy are presently combing the bush to rescue the officer from the abductors."
  },
  {
    "headline": "39-Year-Old Suspect Commits Suicide In NAPTIP Detention",
    "summarized_story": "A 39-year-old suspect has committed suicide at the detention center of the National Agency for the Prohibition of Trafficking in Persons (NAPTIP).\nThe suspect was arrested and detained in Ikeja GRA, Lagos State for child trafficking offences.\nAn intelligence officer on duty explained that while on a routine check, she discovered that the suspect detained hung himself.\nBut the Police Public Relations Officer in the state, Benjamin Hundeyin, confirmed the incident on Monday.\nThe police spokesman also reiterated that the Lagos State Police Command would continue its investigation into the incident."
  },
  {
    "headline": "2023 Elections: Otedola Visits Tinubu, Prays He Emerges Nigeria’s President",
    "summarized_story": "Popular businessman, Femi Otedola, has visited the presidential candidate of the All Progressives Congress (APC) Mr. Bola Tinubu in Paris, France.\nThe APC presidential candidate, who is currently in France, has been holding a series of meetings with personalities, his spokesman, Tunde Rahman, stated.\nOtedola’s visit to Tinubu followed that of Ogun State Governor, Dapo Abiodun, to the ruling party’s candidate on Monday.\nWhile describing the ex-Lagos State Governor as his great friend, the businessman prayed that God will grant his heart’s desire of becoming Nigeria’s President next year.\nIt is believed that the APC candidate is considering Borno State Governor, Babagana Zulum or his predecessor, Senator Kashim Shettima as potential options."
  },
  {
    "headline": "APC kicks as members defect to PDP in Sokoto",
    "summarized_story": "The All Progressives Congress APC in Sokoto state has reacted to the defection of its members to other political parties in the state.\nThe Chairman of the APC in Sokoto state, Isa Sadiq Achida described the defecting members as political wanderers who are pursuing personal and selfish goals.\nAdvertisementSome members of the party including a group of about 3,000 traders members of All Progressive Congress (APC) in the state had defected to People’s Democratic Party (PDP).\nHe noted that about 80 per cent of members of Sokoto state Traders Association, Youths Wing backed the decision to move into the PDP.\nAdvertisementBut the APC leadership in Sokoto insisted that the mass majority of citizens in Sokoto are with the party and defectors are only making themselves enemies of the masses."
  },
  {
    "headline": "Why I visited Nnamdi Kanu in detention",
    "summarized_story": "Governor of Anambra State, Professor Chukuma Soludo has explained why he visited the detained leader of the proscribed People of Biafra, Nnamdi Kanu in DSS custody.\nAnd in that, we met with transporters, traditional rulers and prepared to give amnesty to those in the bush.\n“The truth is that, Nnamdi Kanu is the leader of IPOB, and it has Eastern Security Network.\nBut it’s evident to me that quite a number of criminal gangs have emerged because it’s a lucrative criminality – kidnapping, stealing etc.\nBasically, we have three operating documents – first, the Soludo solution, Anambra vision 2070 which I chaired and the transition committee report."
  },
  {
    "headline": "Group makes case for Gov. El-Rufai as APC Presidential running mate -",
    "summarized_story": "A group in Kaduna state known as Tinubu Support Organization (TSO) are appealing to The All Progressive Congress (APC) presidential flag bearer, Bola Ahmed Tinubu to adopt the Kaduna State Governor, Nasir El-Rufai as his running mate ahead of the 2023 Presidential election.\nThey also revealed that Governor Nasir El-rufai resisted pressure to be dragged into the presidential race.\nTSO believes that the choice of running mate is a critical success factor for the victory of Asiwaju.\nThis is a man that is running a state government with appointees from all over Nigeria.\nWe appeal to all our leaders in the APC to support Asiwaju Bola Ahmed Tinubu to choose El-Rufai as his running mate.”"
  },
  {
    "headline": "PDP Faults Governor Matawalle's Directives On Bearing Firearms -",
    "summarized_story": "The Peoples Democratic Party in Zamfara has kicked against the state Governor, Bello Matawalle, over his directive for citizens to bear arms for self defenceThe decision according to the PDP could lead to lead to anarchy and political vendetta against the opposition partiesAdvertisementThe state secretary of the party, Faruku Ahmed stated this at a press conference held at the party’s secretariate in Samaru, GusauHe says it is the sole responsibility of government at all levels to protect the lives and property of all citizensAdvertisementAdvertisementThe Zamfara main opposition party insist the Matawalle’s decision is uncalled for“Security is everybody’s business, hence to secure the lives and property is the responsibility of the state and federal governments“ He saidAdvertisement” As peace-loving and law-abiding citizens, we fault Zamfara State and the Federal Government for shifting such a serious constitutional responsibility to ordinary citizens whom majority are struggling to meet their daily damand” Ahmed maintained“It has been clear that the security agencies, groups and legal experts within and outside the state have opposed the firearms acquisition deal”AdvertisementAdvertisementThe PDP noted that the ruling APC’s failure has left Governor Bello Matawalle with no option than to manipulate the insecurity situation within the state to witch-hunt opposition https://www.tvcnews.tv/purplegold/post-new.php#parties.\n“As such, the PDP perceived the exercise as a deliberate attempt to divert public resources.”AdvertisementThe PDP through it’s Secretary, therefore, called on the federal government and heads of security agencies to stop Governor Matawalle from what they described as dangerous plan of allowing people to bear arms which may not be for the good of the country.\nThe opposition party is also accusing the state government under the leadership of Governor Bello Matawalle of esterblishing security Committees that is Targeted at frustrating opposition parties in the stateAdvertisementAdvertisement“We are calling on the Inspector General of police, the DSS and the NSCDC to be eagle eye on the ill-intention of targeting the opposition parties using various security committees established by Zamfara State government because the approach seems to be so tricky.” The PDP Lament."
  },
  {
    "headline": "Six Dead, 24 Injured after Illinois Highland Park Shooting",
    "summarized_story": "For the Illinois killings, a rifle had been found and police are searching for a gunman who opened fire at Highland Park police, Commander Chris O’Neill told reporters.\nIllinois State Police also responded to the scene, “assisting Highland Park PD with an active shoot situation,” according to a statement the agency tweeted.\nFourth of July events in other Chicago suburbs, Evanston and Skokie, were also called off in the wake of the Highland Park shooting.\n“Unfortunately as you may know, we have an active shooter situation in Highland Park at their parade,” Illinois Gov.\n“I’m still getting reports.”United States Rep, Brad Schneider was at the Highland Park event when shots rang out."
  },
  {
    "headline": "TotalEnergies Moves to Connect New 50,000 Barrels Per Day Oilfield to Deepwater Storage",
    "summarized_story": "Multinational oil and gas company, TotalEnergies, has said its effort to increase oil production in Nigeria would materialise this year, disclosing that it was on the verge of connecting the 50,000 barrels per day (bpd) Ikike oilfield to the 200,000bpd-capacity Egina deepwater storage facility.\nThat field, the Ikike field, has the capacity to produce about 50,000 barrels per day.\n“The Implementation Framework of the Guideline highlights the specific directorates of the Board and their responsibility regarding the implementation of the insurance guideline.\nOthers are Regulation for the Establishment of Operations in Nigeria 2021; Regulation for Nigerian Oil and Gas Industry Technology Transfer 2021; Regulation for Nigerian Oil and Gas Research and Development 2021; and Regulation for Nigerian Oil and Gas Industry Enforcement and Compliance 2021.\nHe said the seven Ministerial Regulations were meant to strengthen the implementation of Nigerian Content and would be further discussed in the upcoming panel sessions outline for this seminar."
  },
  {
    "headline": "Using Capacity as Parameter for Presidency, Peter Obi Not Comparable to Kwankwaso, Says Galadima",
    "summarized_story": "A prominent member of the New Nigeria Peoples Party (NNPP), Buba Galadima, on Monday, said if the major prerequisite for Nigeria’s presidency was capacity, the presidential candidate of the Labour Party, Mr. Peter Obi, was not comparable to the NNPP candidate, Rabiu Kwankwaso, by all standards.\nGaladima, a former ally of President Muhammadu Buhari, was a guest on The Morning Show, where he spoke on the electoral alliance between Obi and Kwankwaso.\nWe need someone with the capacity to run this country and I can’t see, using this parameter, that would place the candidate of the Labour Party above Senator Rabiu Musa Kwankwaso.\nBut while the APC presidential candidate, Tinubu, submitted Kabiru Masari as his running mate, Obi submitted the name of Doyin Okupe as vice presidential candidate.\nJust last month, the APC presidential candidate said he graduated from a university in United States, but did not fill or indicate where he obtained his primary and secondary school education."
  },
  {
    "headline": "Nigeria Will Recruit One Million Citizens for 2023 Census, Says Population Comission",
    "summarized_story": "Nigeria’s National Population Commission (NPC) has disclosed that a total of one million Nigerians would be recruited by the federal government for the conduct of the 2023 national census.\nRelatedStories No Content AvailableThe Commissioner representing Ekiti at the NPC, Mr. Deji Ajayi, said this in Ado Ekiti on Monday, during a media briefing heralding the trial census to be conducted in Ekiti preparatory to the next year’s main census exercise.\nThe retired Permanent Secretary, said areas to be enumerated in the trial census in Ekiti included: Ado, Emure, Iro, Ijero, Ikole, Iworoko, Ise, Ikun and Omuo Ekiti.\n“Census is a massive operation that will engage one million personnel and managing such a huge workforce manually will raise huge logistical and documentation challenges.\n“It is in recognition of this fact that the NPC resolved that recruitment for the 2023 census will be done electronically."
  },
  {
    "headline": "Nigeria Risks Chaos If Petrol Subsidy Is Removed: FG",
    "summarized_story": "Chief Executive of NMDPRA, Farouk Ahmed, said this when the top executives of the South-west Independent Petroleum Marketers Association of Nigeria (IPMAN) visited him in Abuja.\nNigeria is Africa’s largest oil exporter, but still has to import almost all its fuel needs due to lack of refining capacity.\n“When you consider the chaos, the social disharmony and … instability such an action (abolishing subsidies) would facilitate, is it worth it?\nNigeria suffers intermittent fuel shortages and has raised its deficit forecast twice this year and increased borrowing to cover the cost of the subsidy.\nHe added that the industry regulatory authority had received complaints about private petroleum products depots selling Premium Motor Spirit (PMS), popularly called petrol, above the approved price of N165 per litre."
  }
]