[
  {
    "headline": "JAMB introduces physical health, computer science for UTME",
    "summarized_story": "The Joint Admissions and Matriculation Board has said it is introducing two new science subjects for the Unified Tertiary Matriculation Examination.\nThe subjects are Physical Health Education and Computer Science.\nThe registrar also noted that the board would soon clear the backlog of illegal admissions conducted by tertiary institutions in the country.\nHe said the move was to ensure that students, who were improperly admitted, but had the minimum qualifications, were rescued.\nJAMB had recently uncovered 706,189 illegal admissions by universities, polytechnics, colleges of education and other related institutions."
  },
  {
    "headline": "UNIABUJA abduction planned to attract publicity, says minister",
    "summarized_story": "The Minister of the Federal Capital Territory, Muhammad Bello, has said the recent abduction at the University of Abuja was well planned with the intention to attract publicity.\nLast month, gunmen abducted six persons, including two professors, a deputy registrar and three family members, during an early morning raid on the university’s staff quarters.\nA statement on Sunday by the Chief Press Secretary to the minister, Anthony Ogunleye, stated that the crime was carried out to raise doubts on the security in place in the nation’s capital.\nThe minister was quoted to have said this when he received members of the Governing Council of the University of Abuja, led by its Chairman and Pro-Chancellor, Prof Ahmed Muhammed, during a courtesy visit.\nThe statement was titled, ‘FCT minister cautions against building without proper approvals within the territory’."
  },
  {
    "headline": "Celebrity influencers loving life with Makari",
    "summarized_story": "Omotayo speaks on how she has successfully made fashion and beauty a huge part of her life and how the Makari brand made this fusion seamless in her everyday life.\nFashion and beauty is a huge part of your life, how has Makari brand amplified that?\nHow has the Makari brand influenced your everyday lifestyle?\nHow has the Makari brand affected your life and style?\nI absolutely love moisturizing products, skin, lips, hair, you’d always find me in that shine and of course,my signature graphic liners, they make me stand out."
  },
  {
    "headline": "Celebrity influencers loving life with Makari",
    "summarized_story": "Omotayo speaks on how she has successfully made fashion and beauty a huge part of her life and how the Makari brand made this fusion seamless in her everyday life.\nFashion and beauty is a huge part of your life, how has Makari brand amplified that?\nHow has the Makari brand influenced your everyday lifestyle?\nHow has the Makari brand affected your life and style?\nI absolutely love moisturizing products, skin, lips, hair, you’d always find me in that shine and of course,my signature graphic liners, they make me stand out."
  },
  {
    "headline": "6 Fast Rising Makeup Artists In Nigeria",
    "summarized_story": "Words By – Yemisi SuleimanThe evolution of the makeup industry has seen the continued surge of young millennials including, University graduates taking to makeup artistry as a profession.\nZainab Azeez…Jack Of Many Make Up FeatsZainab Azeez is a Beauty Entrepreneur, who has been a Makeup artist professionally for 11years.\nThe professional makeup artist, who studied Architecture at the University of Lagos, is the go-to makeup artist for music star Yemi Alade.\nShe is one of the leading make-up artists in the country, whose work earned her an award as the Best Makeup Artist at the Africa Magic Viewers Choice Awards 2020, AMVCA.\nOnyebuchi Sez-Elabor…The Trainer Of TrainersHead makeup artist for Debrene Beauty Nigeria, Onyebuchi Sez-Elabor simply known as Buchi is definitely a force to reckon with in the beauty industry."
  },
  {
    "headline": "6 Fast Rising Makeup Artists In Nigeria",
    "summarized_story": "Words By – Yemisi SuleimanThe evolution of the makeup industry has seen the continued surge of young millennials including, University graduates taking to makeup artistry as a profession.\nZainab Azeez…Jack Of Many Make Up FeatsZainab Azeez is a Beauty Entrepreneur, who has been a Makeup artist professionally for 11years.\nThe professional makeup artist, who studied Architecture at the University of Lagos, is the go-to makeup artist for music star Yemi Alade.\nShe is one of the leading make-up artists in the country, whose work earned her an award as the Best Makeup Artist at the Africa Magic Viewers Choice Awards 2020, AMVCA.\nOnyebuchi Sez-Elabor…The Trainer Of TrainersHead makeup artist for Debrene Beauty Nigeria, Onyebuchi Sez-Elabor simply known as Buchi is definitely a force to reckon with in the beauty industry."
  },
  {
    "headline": "An evening of songs and light",
    "summarized_story": "By Oscar Ochiogu.\nIt must have been a day of rejoicing in Heaven as praises and songs filled the arena as friends and family came together to celebrate the life of a Royal Patriarch, Gentleman, Leader, educator A.C.G (Obong) OkonDan Umoh (RTD) at the Lagos farewell service held at Glitz Event Centre, Victoria Island, Lagos.\nThe event showcased and celebrated the Lights and Sounds of this much-admired Gentleman was wellattended by a crowd of achievers, a tribe of learners, and an association of community builders who spokeof his personality as a humble, principles, focused man who understood the tenets of faith and flaggedmorals."
  },
  {
    "headline": "Babangida, Abubakar leaders of immense vision – Anyim",
    "summarized_story": "A former Secretary to the Government of the Federation (SGF) and a presidential hopeful, Senator Anyim Pius Anyim, has described former heads of state, General Ibrahim Badamosi Babangida and General Abdusalami Abubakar as patriots and leaders of immense vision.\nAnyim, also a former President of the Senate, said this when he was received by the two Nigerian leaders at their Minna residences in Niger State.\nHe partly stated, “On Thursday, 2nd December 2021, the topmost presidential aspirant of the People’s Democratic Party (PDP), Distinguished Senator Anyim Pius Anyim (GCON) met with former Nigeria’s Head of State General Ibrahim Badamosi Babangida and General Abdusalami Abubakar in their home.\n“I have received in a private audience by two of our nation’s most esteemed leaders and patriots, their excellencies, Alhaji Abdulsalami Abubakar (GCFR) and Ibrahim Badamosi Babangida.\n“We need leaders that must connect and engage with the people especially the youth."
  },
  {
    "headline": "NBC code to protect Nigerians from harm – Ex-acting DG, Idachaba",
    "summarized_story": "A former acting Director-General of the National Broadcasting Commission (NBC), Professor Armstrong Idachaba, has said the code of the regulatory agency is mainly to protect broadcast programme consumers from harm.\nDAILY POST recalls that President Muhammadu Buhari government came under heavy criticism lately with its review of the NBC code.\nThe Minister of Information and Culture, Lai Mohammed, had said that the amended NBC Code included the provision raising the fine for hate speech from N500,000 to N5 million.\nAccording to him, the review of the NBC code every four years has always been an opportunity for negotiations and new arguments.\n“As you can also see, the provisions of the code are actually meant to protect society from harm."
  },
  {
    "headline": "Insecurity: S/West Muslims urge Nigerians to provide security agencies with credible information",
    "summarized_story": "Muslims under the umbrella of Muslim Ummah of South-West Nigeria (MUSWEN) have advised Nigerians to supply credible information to security agencies in order to stem the tide of kidnapping, armed robbery and other criminal activities in the country.\nSanni, while speaking on the security situation across the country, noted that Nigerians should not wait for security agents before they secure themselves.\nHe explained that it is not possible for security agents to be everywhere, hence Nigerians should volunteer information that could help them arrest the criminals.\n“Therefore, they should be involved to volunteer necessary information to the security agencies to assist in combating insecurity”.\n“Development and consolidation of democratic culture, strong and capable public institutions, a strong and just economic space including guaranteed job and food security,” he said."
  },
  {
    "headline": "We’ll defend ourselves from terrorists – SOKAPU",
    "summarized_story": "The youth wing of the Southern Kaduna People’s Union (SOKAPU) has vowed to defend its communities against any terrorist attack.\nReacting on Sunday over the frequent kidnapping and killings of innocent people in their area, the SOKAPU youth wing vowed they could no longer remain quiet and allow terrorists to attack communities, abduct the people and take them to the forests.\nNational Youth Leader of SOKAPU, Comrade John Isaac in a statement on Sunday, urged the residents of the area to rise up and defend themselves.\nAccording to him, we must defend ourselves against terrorists that have now found a safe haven in our forests.\nThe group, while expressing grief over the recent attack at Unguwar Gimbiya, noted with sadness the repeated attack as the same community was attacked in July."
  },
  {
    "headline": "JAMB to clear backlog of illegal admissions, bars CBT centres from selling UTME e-PINS",
    "summarized_story": "The Joint Admissions and Matriculation Board, JAMB, has said that it would soon clear the backlog of illegal admissions carried out by tertiary institutions in Nigeria.\nDAILY POST reports that JAMB had recently uncovered 706,189 illegal admissions by universities, colleges of education, polytechnics and other related institutions in the country.\nAccording to him, JAMB would also prohibit Computer Based Test (CBT) centres from selling e-PINs to guard against the extortion of candidates.\nHe said, “On our campaign on cashless CBT centres, particularly during our registration exercise.\nIt’s known that many CBT centres, despite the supervision, still manage to exploit candidates."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "UNN: Inside the ramshackle Zik’s Flats",
    "summarized_story": "However, the most debilitating is Zik’s Flats.\n“And to think that most of the Vice-Chancellors in recent times, including the current V-C, Prof. Igwe, were occupants of Zik’s Flats makes the rumours strongly believable.\nRebuilding Zik’s Flats alone will gulp more than N5 billion and after that, you begin to charge N12, 000 or N15, 000 accommodation fees per session.\n“After my husband passed on in 1996, we started noticing that Zik’s Flats are facing gradual deterioration.\nThat Zik’s legacy will not go downThis is a very big legacy that Zik’s family will prevent from going down."
  },
  {
    "headline": "Insecurity: UniAbuja employs hunters, vigilante groups",
    "summarized_story": "The Pro-Chancellor and Chairman of the University of Abuja (UniAbuja) Governing Council, Mohammed Modibbo, at the weekend said the institution has commenced a 24-hour security patrol to ensure the safety of members of staff and students of the institution.\nModibbo disclosed this at a retreat organised by the Governing Council for Principal Officers, Deans, Directors and university-based unions on Saturday in Abuja.\nHe said the institution has also engaged the services of hunters and vigilantes to boost its security following a recent incident of abduction of some members of staff and family members by bandits.\nHe said the governing council is also working out a plan to ensure decent accommodation for members of staff through the involvement of investors and other relevant bodies.\nHe said UniAbuja was making efforts to also partner with several international organisations and foreign universities on alternative funding for the university."
  },
  {
    "headline": "Youths urged to be active in politics",
    "summarized_story": "Read Also: Youths urge Buhari not to rush NDDC report- Advertisement -He said: “The youth are always ready.\nDon’t start looking at youths as that category of people in society who do not have the capacity.\nBut if you don’t give the youth the opportunity to participate, you will not know that they have the capacity to be able to effectively participate in politics.\n“The youth need to gear up and participate in politics.”Alhaji Sabo urged youths to shun evil, embrace virtue, work hard so as to succeed in life.\nThis award will ensure that one puts in more efforts and ensure that one does one’s best wherever one finds oneself.”"
  },
  {
    "headline": "People living with HIV seek end to inequality",
    "summarized_story": "The Network of People Living with HIV/AIDS in Nigeria (NEPWHAN) has called on the governments at all levels and other relevant stakeholders to address the issue of inequality because it infringes on their fundamental human rights.\n“People living with HIV/AIDS currently experience a lot of inequalities in different walks and aspects of life.\nAlso, couples with HIV can still have children without HIV.\nA person’s HIV positive status should not be a reason to terminate the employment of the member of staff.\nIt is also very important that all Nigerian knows their HIV statuses, and if found positive, they should be placed on treatment."
  },
  {
    "headline": "Breaking: 26-year-old plumber hacked to death in Enugu",
    "summarized_story": "From Jude Chinedu, EnuguA 26-year-old plumber, Sochima Ude, from Umuaka village in Nsude, Udi Local Government Area, has been reportedly hacked to death in the Timber Market area of Nike, Enugu North LGA of Enugu State.\nPolice are currently after the four suspects alleged to have carried out the dastard murder of the young man said to be the only son of his his mother.\nHis body has been deposited at the Ntasi Obi Mortuary in Trans-Ekulu, Enugu.\nFamily sources say the deceased’s aged mother is heartbroken by the news of the gruesome murder of her only son.\nThe Police is yet to react to the incident at the time of filling this report."
  },
  {
    "headline": "BREAKING: 26-year-old plumber hacked to death in Enugu",
    "summarized_story": "From Jude Chinedu, EnuguA 26-year-old plumber, Sochima Ude, from Umuaka village in Nsude, Udi Local Government Area, has been reportedly hacked to death in the Timber Market area of Nike, Enugu North LGA of Enugu State.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHis body has been deposited at the Ntasi Obi Mortuary in Trans-Ekulu, Enugu.\nThe Police is yet to react to the incidence at the time of filling this report.\nClick Here to Apply ."
  },
  {
    "headline": "2023 presidency: I’m set to begin consultations –Gov. Tambuwal",
    "summarized_story": "Unfortunately, Zamfara State has been the epicenter of banditry and kidnapping in the Northwest.\nSo, it is not as if it was about the people of Sokoto State.\nThen when you talk about what we have done, there has been a lot of synergy among the agencies in Sokoto State.\nIn the last four, five years, we had given out not less than 500 vehicles to security services in Sokoto State.\nSo, it is not as if Sokoto is new to it or that the whole idea is coming as a new thing to Sokoto State."
  },
  {
    "headline": "Aviation stakeholders raise red flag over concession of Lagos, Abuja, Kano, P/Harcourt airports",
    "summarized_story": "By Peter AnosikeAviation industry stakeholders have raised a red flag on the planned concession of the Murtala Mohammed International Airport, Lagos; Nnamdi Azikiwe Airport, Abuja; Aminu Kano International Airport, Kano, and the Port Harcourt International Airport, Rivers State by the Federal Government.\nThe stakeholders are worried that the government is looking at concessioning the airports to foreign firms while there are tested indigenous firms that can do the job efficiently.\n“For obvious reasons, it is necessary for the airports to be concessioned to local firms with track records, merit and competence, rather than foreign companies that you cannot vouch for.\n“Some of the foreign companies being touted don’t even have the required records.\n“It is hoped that you will accede to our request to avoid any litigation over the proposed concession of the four airports terminals”."
  },
  {
    "headline": "Buhari directs TETfund to increase research fund to N8bn",
    "summarized_story": "From George Onyejiuwa,OwerriThe President Muhammadu Buhari has directed the Tertiary Education Trust Fund (TETFUND) to increase research fund under the National Research Fund (NRF) scheme to the tune of N8 billion.\nThe president gave the directive yesterday at the 33rd Convocation ceremony of the Federal University of Technology Owerri (FUTO).\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe also charged the nation’s universities to redesign their curricula and programmes by infusing relevant trainings and vocations that are relevant to solve specific societal problems.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "UK to Add Nigeria to Red List of Countries amid Omicron Spread",
    "summarized_story": "Canada had on Tuesday banned travellers from Egypt, Nigeria and Malawi over fears of the spread of the new Omicron variant.\nJavid confirmed that Nigeria would be added to the red list of countries from where people arriving the UK must quarantine in a hotel for 10 days.\n“So today, the government has decided to add Nigeria to the travel red list and that will be effective from 4am on Monday.\nConcerning local vaccine production, Ehanire said the government was determined to achieve that.\nThe minister promised that the government was working to revive the vaccine production facility."
  },
  {
    "headline": "Anxiety in PDP as Supreme Court Hears Secondus’ Appeal Tomorrow",
    "summarized_story": "The Supreme Court, it was gathered, will hear Secondus’ petitions on Monday, December 6.\nThe applicants had asked the court to stop Secondus from parading himself as the PDP chairman as he had been suspended at his ward.\nThe court subsequently restrained Secondus from performing the functions of the office of the national chairman of the PDP.\nHowever, Secondus is now praying for the Supreme Court to declare that the appellate court erred in its judgment.\nFintiri’s statement was titled: ‘Change of Date for the Presentation of Certificate of Return and Swearing-in Ceremony of the Newly Elected PDP National Officers.’Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NNPC’s Monthly Deductions from FAAC Hit N200bn in December",
    "summarized_story": "Furthermore, in May, the NNPC removed N126 billion as a subsidy, while June came next with N164.3 billion.\nHowever, the overall crude oil lifting by the newly rechristened company almost doubled in September, according to the national oil company during the presentation which held on the 17th of November.\nOn domestic crude and gas sales, it added: “The sum of N252,968,629,898.13 was the gross domestic crude oil and gas revenue for October 2021.\nCompared to the previous month, the overall NNPC crude oil lifting was 5.79Mbbls in August 2021, a record of 33.5 per cent decrease relative to the 8.71Mbbls lifted in July 2021.\n“I cannot conclude this speech without touching on gas pricing which is a major threat to gas affordability and gas penetration."
  },
  {
    "headline": "Buhari: Nigeria is Africa’s Most Viable Investment Destination",
    "summarized_story": "* Investors commit N412bn to 35 Nigerian startups in 10 monthsFestus Akanbi in Lagos and Deji Elumoye in AbujaPresident Muhammadu Buhari has declared that Nigeria remains the most viable and attractive investment destination in Africa.\nBuhari also said Nigeria is on the path of becoming Africa’s leading industrial and trading nation.\nThis is coming as some foreign and local investors have invested a total of N412billion ($992million) across 35 Nigerian startups in the first 10 months of 2021.\nAccording to him, “Nigeria’s pavilion at the Expo 2020 clearly shows why we remain the most viable and attractive investment destination in Africa.\nInvestors Commit N412bn to 35 Nigerian Startups in 10monthsMeanwhile, some foreign and local investors have invested a combined sum of N412billion ($992million) across 35 Nigerian startups in the first 10 months of 2021."
  },
  {
    "headline": "At Dubai Expo 2020, Buhari Tasks World Leaders on Partnership to Stem COVID-19",
    "summarized_story": "On the same day, amid the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, the federal government unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nBuhari, while addressing the global audience at Dubai Expo 2020, said: “The concerted efforts by world leaders, working together, enabled us to limit the catastrophic consequences of this pandemic.\nFG Refuses to Restrict Inbound Travellers over OmicronNotwithstanding the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, the federal government yesterday unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nFG Approves Booster DoseThe federal government has formally endorsed the administration of booster dose of the COVID19 vaccine for Nigerians.\nAccording to the DG, NPHCDA, Faisal Shuaib, a COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the federal government."
  },
  {
    "headline": "BREAKING: Secret Police, DSS Invite Ex-Kogi Commissioner Over Comment On Sheikh Gumi's Visit To Okunland",
    "summarized_story": "The former commissioner said his comment on Gumi's visit to meet with foreign Fulani in the state was based on grapevine sources.\nHe said: \"I have been invited to the DSS State office in Lokoja slated for Tuesday, 7th December 2021 at 10 am\"The DSS has not formally accused or charged me for anything.\nIn the last six years, an influx of foreign Fulani into Okunland has taken place with disastrous consequences for our People.\nIn Okun land, many areas have been occupied illegally by foreign Fulani, (foreign to us and Nigeria.\nWe encountered them in Okun land and they confessed to coming from Mali in one instance)."
  },
  {
    "headline": "BREAKING: Secret Police, DSS Invite Ex-Kogi Commissioner Over Comment On Sheikh Gumi's Visit To Okunland",
    "summarized_story": "The former commissioner said his comment on Gumi's visit to meet with foreign Fulani in the state was based on grapevine sources.\nHe said: \"I have been invited to the DSS State office in Lokoja slated for Tuesday, 7th December 2021 at 10 am\"The DSS has not formally accused or charged me for anything.\nIn the last six years, an influx of foreign Fulani into Okunland has taken place with disastrous consequences for our People.\nIn Okun land, many areas have been occupied illegally by foreign Fulani, (foreign to us and Nigeria.\nWe encountered them in Okun land and they confessed to coming from Mali in one instance)."
  },
  {
    "headline": "BREAKING: Former US Senator And Presidential Candidate, Bob Dole Dies At 98",
    "summarized_story": "Bob Dole, a former US Senator and Republican presidential candidate, died Sunday morning, the Elizabeth Dole Foundation said.\nIt is with heavy hearts we announce that Senator Robert Joseph Dole died early this morning in his sleep,\" the foundation said on Twitter.\nDole served as a US senator for Kansas for nearly 30 years, starting an impressive political run.\nHe began to test the waters for his own presidential run in 1980.\nPrior to his political career, Dole registered for the Army in 1942 and was a second lieutenant, according to NBC News."
  },
  {
    "headline": "BREAKING: Former US Senator And Presidential Candidate, Bob Dole Dies At 98",
    "summarized_story": "Bob Dole, a former US Senator and Republican presidential candidate, died Sunday morning, the Elizabeth Dole Foundation said.\nIt is with heavy hearts we announce that Senator Robert Joseph Dole died early this morning in his sleep,\" the foundation said on Twitter.\nDole served as a US senator for Kansas for nearly 30 years, starting an impressive political run.\nHe began to test the waters for his own presidential run in 1980.\nPrior to his political career, Dole registered for the Army in 1942 and was a second lieutenant, according to NBC News."
  },
  {
    "headline": "UK Court Convicts Nigerian Involved In Romance Scam Targeting Over 670 People",
    "summarized_story": "A Nigerian man, Osagie Aigbonohan, was on Friday convicted by the Southwark Crown Court, United Kingdom over his involvement in a romance scam in which he conned several women out of thousands of pounds.\nThe statement said one of the victims was terminally ill, but Aigbonohan continued to pursue her even after she had passed away.\nRecords showed that despite living in Abbey Wood, London, the Nigerian will spend victim’s money in locations across London, Manchester and Glasgow.\nAigbonohan was said to have appeared before Southwark Crown Court on Friday, where he pleaded guilty to charges relating to fraud and money laundering.\n“Aigbonohan showed total disregard for the victims in this case and was happy to commit further fraud by moving money between various fraudulently held accounts."
  },
  {
    "headline": "DOWNLOAD: Lagos releases #EndSARS panel report",
    "summarized_story": "The Lagos government has released the report of the state’s judicial panel on police brutality.\nAdvertisementOn October 19, 2020, as part of recommendations put forward during the #EndSARS protests, the Lagos government inaugurated the judicial panel to investigate petitions on police brutality in the state.\nOn November 15, the panel submitted two reports — one on police brutality cases and another on the Lekki incident investigation.\nAccording to a statement signed by Moyosore Onigbanjo, the state’s attorney-general and commissioner for justice, the panel’s report is now officially available to the public.\nAdvertisementThe panel report can be viewed and downloaded here."
  },
  {
    "headline": "DOWNLOAD: Lagos releases #EndSARS panel report",
    "summarized_story": "The Lagos government has released the report of the state’s judicial panel on police brutality.\nAdvertisementOn October 19, 2020, as part of recommendations put forward during the #EndSARS protests, the Lagos government inaugurated the judicial panel to investigate petitions on police brutality in the state.\nOn November 15, the panel submitted two reports — one on police brutality cases and another on the Lekki incident investigation.\nAccording to a statement signed by Moyosore Onigbanjo, the state’s attorney-general and commissioner for justice, the panel’s report is now officially available to the public.\nAdvertisementThe panel report can be viewed and downloaded here."
  },
  {
    "headline": "Eight children found dead inside abandoned car in Lagos",
    "summarized_story": "Eight children have been found dead in a car parked on Adelayo street, Jah-Micheal, along Badagry expressway in Lagos.\nAdvertisementThe children were said to be between the ages of four and six.\nAdekunle Ajisebutu, Lagos police spokesperson, confirmed the incident to TheCable on Sunday.\nAdvertisement“The eight children were said to have mistakenly locked themselves in an abandoned car while playing,” Ajisebutu said.\nAdvertisementOdumosu further commiserated with the families of the victims."
  },
  {
    "headline": "Eight children found dead inside abandoned car in Lagos",
    "summarized_story": "Eight children have been found dead in a car parked on Adelayo street, Jah-Micheal, along Badagry expressway in Lagos.\nAdvertisementThe children were said to be between the ages of four and six.\nAdekunle Ajisebutu, Lagos police spokesperson, confirmed the incident to TheCable on Sunday.\nAdvertisement“The eight children were said to have mistakenly locked themselves in an abandoned car while playing,” Ajisebutu said.\nAdvertisementOdumosu further commiserated with the families of the victims."
  },
  {
    "headline": "UK suspends processing of visitor visa applications from Nigeria",
    "summarized_story": "The British High Commission says it will “pause making decisions” on visitor visa applications from all red list countries, including Nigeria.\nThe development comes hours after the UK added Nigeria to its travel red list as a result of concerns over the Omicron COVID variant.\nAdvertisementOn the announcement on the suspension of processing visitor visa applications in Nigeria, the UK said the decision will be in effect until the travel ban is lifted.\n“You will not be able to request a refund of your visa fee once you have given your biometrics at a Visa Application Centre (VAC).\n“If you have submitted a visit visa application and you do not wish to withdraw, we will continue to hold your application."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "Nigeria’s Payourse secures $600k pre-seed to accelerate crypto adoption across Africa",
    "summarized_story": "But as good as this may sound, navigating through most of the available crypto products still feels like Chinese arithmetic to many Africans.\nAnd this experience is shutting out a large number of Africans from the crypto economy, thereby hindering even wider adoption.\nOne of them, Payourse, a Lagos-based blockchain startup that builds user-friendly products and tools to accelerate the adoption of crypto in Africa, has secured a $600,000 pre-seed investment to scale its products, hire more talent and expand into new markets.\nBut because of its seamless experience, Coinprofile began to gain traction among crypto users.\nUnlike other companies that charge fees on every transaction, Coinprofile doesn’t charge users on a transaction."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Payourse’s $600k pre-seed, Herconomy’s 24hr funding and Octamile’s $500k pre-seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Payourse’s $600k pre-seed$600k pre-seed by HerconomyWorld AIDS DayOctamile’s $500k pre-seedOfferZen’s $5.1m Series APayourse’s $600k pre-seedL-R Payourse Co-founders, Bashir Aminuy and John Anisere.\nAdvertisementFive years later, Payourse — the brainchild of Aminu, Hakeem Oyewole, and John Anisere — has announced the raise of a $600k pre-seed to build the next crypto powerhouse.\nYou can read it here: Nigeria-based blockchain startup, Payourse raises $600k pre-seed to build a Web3 powerhouseHerconomy bags $600k pre-seedHerconomy TeamHerconomy is a startup that empowers women by offering them capacity building, jobs, networking, and financial services.\nOn Wednesday, December 1, 2021, the startup announced a $600,000 pre-seed raise, led by members of the Herconomy community.\nOctamile raises $500k pre-seedOctamile Founder, Gbenro DaraOctamile, an African insurtech startup, has closed a $500,000 pre-seed round to simplify access to insurance for Africans."
  },
  {
    "headline": "UK suspends visa applications in Nigeria",
    "summarized_story": "The British High Commission has suspended visa applications in Nigeria pending when the UK ban is lifted.\nIn a letter by the British High Commission on UK visa application, it stated that in order to support the UK government’s aim to protect public health from COVID-19, and associated variants of concern, UK visa and immigration will pause making decisions on visitor visa applications in all red list countries, including Nigeria, until travel restrictions are lifted.\n“If you apply for a visit visa in a red list country and you meet the UK immigration rules, your application will be paused.\nYou will not receive a decision on your visit visa application whilst red list travel restrictions remain in place.\nOn Saturday, the UK Government said Nigeria has been added to the countries on its red list due to the discovery of COVID-19 Omicron cases linked to Nigeria."
  },
  {
    "headline": "Nigeria’s Covid-19 response: 5 things to know, do when travelling",
    "summarized_story": "For passengers travelling out of Nigeria, travellers must perform a COVID-19 PCR test not more than 2days (48hours) before boarding and departure.\nRapid antigen or antibody tests are not acceptable; only PCR tests can be used for this purpose.\nOnly children less than 10 years old areexempted from uploading a pre-arrival negative COVID-19 PCR test result.\nOnly children less than 10 years old are exempted from uploading a pre-arrival negative COVID-19 PCR test for presentation at the airport.\nSamples will be taken, and a COVID-19 PCR test done."
  },
  {
    "headline": "2023: Don’t sit on the fence",
    "summarized_story": "In an interview with BusinessDay recently, the former governor of Kano State said: “Today, people still don’t have trust in government.\nIn Nigeria, voter apathy is a national trend that is perhaps, more worrisome in Southern Nigeria, irrespective of whether the election is a local or national election.\nThey are of the view that this also indirectly affects voter behaviour which leads to voter apathy.\nThe voter apathy is even alarming in the last two general elections won by the All Progressives Congress (APC).\nThe people did not vote and the candidate won without votes”, he said, lamenting that such situations make voters sit on the fence."
  },
  {
    "headline": "Obaseki to spend N51bn on physical infrastructure, construction of roads, bridges in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state plans to expend N51billion in 2022 for the development and sustenance of physical infrastructure, as well as the construction and rehabilitation of roads and bridges.\nThe governor, who recently presented the 2022 budget proposal to Edo State House Assembly in Benin City, said N30bn will be spent on improving roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nReassuring the completion of all ongoing road projects in the state, Obaseki, reassured residents that his government remains committed to infrastructural development across the state.\nIn the new financial year, we have budgeted N30bn to improve roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nThese include roads linking towns as well as small township and inner-city roads."
  },
  {
    "headline": "Obaseki intensifies efforts at human capital devt, begins 5-month business training for youths, women – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has launched a 5-month training on business development and sustainability for youths and women in oil-producing communities in the state, in line with the government’s focus on human capacity development.\nHe said the government’s commitment to human capacity development necessitated the creation of the Human Capital Development Department as approved by the Board of EDSOGPADEC.\nBut the new focus of EDSOGPADEC, in line with its core mandate, is now human capital development.\nThis is also in line with the Governor Godwin Obaseki-led administration’s Making Edo Great Again (MEGA) Agenda.\nThe Director, Human Capital Development Department, Mr. Godwin Ogieriakhi said the empowerment programme cuts across the three (3) oil-producing local governments of the State, with 50 persons drawn from each local government area in the first phase."
  },
  {
    "headline": "Obaseki seeks int’l partners’ support to strengthen impact of agric programmes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has urged international donors to support the government in executing sustainable agricultural programmes to check food security.\nWhile commending IFAD on its impactful role across Africa, Obaseki said the assistance provided by the Fund can help leapfrog systems and institutions in Nigeria and Edo State.\nHe noted, “We have failed to create the real market for agricultural produce, economic culture, subsidizing agricultural produce and mixed pricing of exchange rate.\n“As a government, our focus is how to be serious and help address the challenges.\nAgricultural Development Programme (ADP) Office carry a lot of signboards with all sorts of assisted programmes but yet no much impact or difference has been made in agricultural production and output."
  },
  {
    "headline": "Okowa, Group Demand Justice For Slain 12-Year-Old -Dowen College Student – Nigerian Observer",
    "summarized_story": "As we continue to watch this case closely, we extend our prayers and support to the Oromoni family.\nEbilade Ekerefe National Spokesman, Ijaw Youth Council and made available to newsmen in Warri, the group said,“We watched with awe and shock the reported circumstances surrounding the death of a 12-year-old student of Dowen College in Lagos, Sylvester Oromoni Jnr.\n“The supposed injuries from the beatings led to his death, according to a Twitter user with the handle@perrisonoromoni, the boy’s cousin.\n“Late Sylvester Oromoni Jnr is a son of Ijaw land from Ogbeh-Ijoh area of Warri South-West Local Government of Delta State.\nThis story if true amounts to organizing a party around the corpse of the late Sylvester Oromoni."
  },
  {
    "headline": "Dowen College Killing: Cultism, drug addiction wreck schools",
    "summarized_story": "But as the days passed, school confraternity evolved into violent drug gangs intimidating, harassing and murdering fellow students on campus.\nGradually, it permeated, and today it’s become an epidemic, one, once again highlighted by killing last week, of 12-year-old Sylvester Oromoni, allegedly by fellow students at Dowen College, Lekki, Lagos State.\nThe Lagos State authorities must investigate the incidents leading to Sylvester’s death and ensure no child goes through what he endured.\nPolice Order Investigation as Lagos Orders Closure of CollegeAmid the outrage and controversy over the boy’s death, Lagos State Government on Friday, ordered the indefinite closure of the college.\nI will stop here.”The rise in immorality and cultism in schools, experts say, is mostly due to de-emphasis on discipline in homes and schools."
  },
  {
    "headline": "Parthian Partners Redeems N20bn From 1st Commercial Paper Issuance",
    "summarized_story": "Parthian Partners Limited (PPL) has redeemed its inaugural public issue at maturity of its Series 1 Tranche A & B commercial paper under its N20 billion Issuance Programme.\nParthian Partners Limited is rated Bbb (stable outlook) by Agusto & Co and the company’s Commercial Paper Programme is rated A1- by DataPro, evidencing the institution’s good funding profile, improving profitability and support from the owners, as well as good capitalisation.\nThe issuance represents the first by an Inter-dealer brokerage firm in the Nigerian capital market on the FMDQ Securities Exchange Limited platform.\nThe Issuer is one of the six FMDQ Securities Exchange Limited (FMDQ) registered inter-dealer brokers in Nigeria.\nParthian Partners remains committed to proving itself as a market leader in fixed-income, equities and structured finance both in Nigeria and across Africa."
  },
  {
    "headline": "Private, Public Sector Leaders Strengthen U.S.-Nigeria Commercial Ties",
    "summarized_story": "Leading Nigeria private and public sector leaders work to deepen trade and investment ties between the United States and Nigeria.\nAmbassador Mary Beth Leonard celebrated the contributions of the private sector to the U.S.-Nigeria Commercial and Investment Dialogue (CID) in elevating the business climate for improved trade relations.\nGovernments use the Commercial Investment Dialogue as a framework for engagement with businesses and one another,” the Ambassador said.\nParticipants of the CID focused on five priorities areas key to improving trade and investments ties between the United States and Nigeria: infrastructure, agriculture, digital economy, investment, and regulatory reform.\nThe CID is a bilateral policy instrument focused on trade and investment between Nigeria and the United States."
  },
  {
    "headline": "SERAS CSR Africa Awards 2021: Zenith Bank GMD, Onyeagwu wins ‘CEO of the Year,’ Zenith named ‘Most Responsible Organisation in Africa’",
    "summarized_story": "Zenith Bank’s Group Managing Director/CEO, Mr. Ebenezer Onyeagwu, has emerged CEO of the Year for a second consecutive year at the Sustainability, Enterprise and Responsibility (SERAS) CSR Africa Awards held at the weekend in Lagos.\nUnder his leadership, the Zenith Bank’s social investments totalled NGN3.285 billion in 2020, representing nearly 2% of the Bank’s profit after tax.\nZenith Bank Plc also emerged winner in four other categories at the SERAS CSR Africa Awards, carting home the awards for “Best Company in Reporting and Transparency”, “Best Company in Infrastructure Development”, “Best Company in Gender Equality and Women Empowerment”, and the coveted “Most Responsible Organisation in Africa”.\nThe Sustainability, Enterprise and Responsibility Awards (SERAS) is an initiative of TruCSR which celebrates and promotes investments by corporate organisations in the society through CSR and sustainability initiatives.\nThe 2021 awards featured 387 projects by 97 organisations across Africa."
  },
  {
    "headline": "NDLEA Arrests Spain-based Drug Peddler At Abuja Airport",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 44-year-old father of three, Gabriel Anthony Patrick, at the Nnamdi Azikiwe International Airport Abuja (NAIA), for ingesting 96 pellets of cocaine, which he excreted in the custody of the agency.\nHe claimed he came into Nigeria on November 17 to sell cloths and car spare parts he shipped to Lagos earlier.\nMeanwhile, in the same vein, NDLEA operatives at the Murtala Muhammed International Airport (MMIA) Lagos, have arrested one Okorie Godwin Onyeribe over his attempt to export 21.85kg of cannabis concealed in foodstuff to London, UK.\nADVERTISEMENTHe was nabbed at the NAHCO export shed of the airport on Friday, December 3, 2021.\nAlso, five students of American University of Nigeria, Yola, Adamawa State and University of Maiduguri, Borno State are among suspects arrested for drug offences in raids operations across nine states in the last week."
  },
  {
    "headline": "NDLEA Arrests Spain-based Drug Peddler At Abuja Airport",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 44-year-old father of three, Gabriel Anthony Patrick, at the Nnamdi Azikiwe International Airport Abuja (NAIA), for ingesting 96 pellets of cocaine, which he excreted in the custody of the agency.\nHe claimed he came into Nigeria on November 17 to sell cloths and car spare parts he shipped to Lagos earlier.\nMeanwhile, in the same vein, NDLEA operatives at the Murtala Muhammed International Airport (MMIA) Lagos, have arrested one Okorie Godwin Onyeribe over his attempt to export 21.85kg of cannabis concealed in foodstuff to London, UK.\nADVERTISEMENTHe was nabbed at the NAHCO export shed of the airport on Friday, December 3, 2021.\nAlso, five students of American University of Nigeria, Yola, Adamawa State and University of Maiduguri, Borno State are among suspects arrested for drug offences in raids operations across nine states in the last week."
  },
  {
    "headline": "Kalu Is Not Leaving APC, Only Flying A Kite – Abia Chapter",
    "summarized_story": "The party was reacting to reports making the rounds that Kalu, who represents Abia North senatorial district in the Senate, was making moves to defect to the Peoples Democratic Party (PDP).\nThe statement reads: “To the best of our knowledge, the Senator representing Abia North on our party platform is going no where.\n“Their expectation that the state party structure will fall into their hands has become a bridge too far.\nUnfortunately for him, no winner in the congress is ready to concede his position,” the APC spokesman said.\n“We in Abia APC are calling on our national leadership to call his bluff."
  },
  {
    "headline": "Kalu Is Not Leaving APC, Only Flying A Kite – Abia Chapter",
    "summarized_story": "The party was reacting to reports making the rounds that Kalu, who represents Abia North senatorial district in the Senate, was making moves to defect to the Peoples Democratic Party (PDP).\nThe statement reads: “To the best of our knowledge, the Senator representing Abia North on our party platform is going no where.\n“Their expectation that the state party structure will fall into their hands has become a bridge too far.\nUnfortunately for him, no winner in the congress is ready to concede his position,” the APC spokesman said.\n“We in Abia APC are calling on our national leadership to call his bluff."
  },
  {
    "headline": "President Buhari Assumes Presidency Of Great Green Wall",
    "summarized_story": "President Muhammadu Buhari has assumed the presidency of the Great Green Wall in Africa for a period of two years.\nThe Minister of State for Environment, Mrs Sharon Ikeazor, disclosed this at the end of the 4th ordinary session of the Conference of Heads of State and Government (CHSG) of the Pan-African Agency for the Great Green Wall held in Abuja.\nSo for the next two years, Nigeria and President Buhari will be the President of the Great Green Wall Initiative in Africa.\nShe recalled the commitment of President Buhari when last month in Glasgow, Scotland at the Climate Change Summit (COP 26) side event on the Great Green Wall (GGW), where he expressed optimism about Africa’s ambition to restore over 100million hectares of the degraded landscape for productive agriculture.\nHe assured that the restoration of Africa’s degraded ecosystems and ensuring the resilience of our people against climate change effects shall be strengthened."
  },
  {
    "headline": "Lecturer begs court: Separate us, my wife is dating Offa Polytechnic Rector – Daylight",
    "summarized_story": "A lecturer with Federal Polytechnic Offa, Kwara State, Mr Aderemi Bankole has urged an Osun State High Court, sitting in Ede to dissolve his marriage after accusing his wife of infidelity with the Rector of the school, Dr Lateef Olatunji.\nThe petition which was submitted to the court by his counsel, Hashim Abioye has as defendants, his wife, the Rector and one Mr Oluwole Solanke.\n“When she was illegally harboured, it later resulted in the premature birth, she was pregnant at the said period.\nWhile in London and Nigeria she engaged in illicit and immoral relationships with Dr Lateef Olatunji and Oluwole Solanke both being colleagues with her at Federal Polytechnic Offa.\n“I plead with the court to dissolve our marriage and the court should grant me the custody of our two children”, it reads."
  },
  {
    "headline": "Lecturer begs court: Separate us, my wife is dating Offa Polytechnic Rector – Daylight",
    "summarized_story": "A lecturer with Federal Polytechnic Offa, Kwara State, Mr Aderemi Bankole has urged an Osun State High Court, sitting in Ede to dissolve his marriage after accusing his wife of infidelity with the Rector of the school, Dr Lateef Olatunji.\nThe petition which was submitted to the court by his counsel, Hashim Abioye has as defendants, his wife, the Rector and one Mr Oluwole Solanke.\n“When she was illegally harboured, it later resulted in the premature birth, she was pregnant at the said period.\nWhile in London and Nigeria she engaged in illicit and immoral relationships with Dr Lateef Olatunji and Oluwole Solanke both being colleagues with her at Federal Polytechnic Offa.\n“I plead with the court to dissolve our marriage and the court should grant me the custody of our two children”, it reads."
  },
  {
    "headline": "15 AMAZING FACTS ABOUT ENUGU GOVERNOR, IFEANYI UGWUANYI",
    "summarized_story": "By AZUH AMATUS1 Full name: Lawrence Ifeanyi Ugwuanyi2 He is a top politician and the current governor of Enugu state.\n3 Amiable Ugwuanyi was a member of the House of Representatives for 12 years, between 2003 and 2015.\n5 The two-term governor was first sworn-in on May 29, 2015 and was again inaugurated for a second term on same date in 2019.\n6 As a federal lawmaker, Ugwuanyi was also a two-term chairman of house committee on marine transport.\n7 The visionary leader also held the position of deputy chairman, house committee on pensions."
  },
  {
    "headline": "15 AMAZING FACTS ABOUT ENUGU GOVERNOR, IFEANYI UGWUANYI",
    "summarized_story": "By AZUH AMATUS1 Full name: Lawrence Ifeanyi Ugwuanyi2 He is a top politician and the current governor of Enugu state.\n3 Amiable Ugwuanyi was a member of the House of Representatives for 12 years, between 2003 and 2015.\n5 The two-term governor was first sworn-in on May 29, 2015 and was again inaugurated for a second term on same date in 2019.\n6 As a federal lawmaker, Ugwuanyi was also a two-term chairman of house committee on marine transport.\n7 The visionary leader also held the position of deputy chairman, house committee on pensions."
  },
  {
    "headline": "Shekarau visits Tinubu amidst battle with Ganduje for Kano APC",
    "summarized_story": "While the G7 faction elected Haruna Danzago as the chairman of its executive, Abdullahi Abbas was elected to lead the Ganduje faction of the party.\nGanduje and members of his faction of APC are believed to be strong supporters of the presidential ambition of Tinubu.\nThe expectation was that Ganduje will bring in the strength of Kano APC to support Tinubu when the push comes to shove on the selection of APC presidential candidate.\nIndeed, a national newspaper had on Saturday reported that the judgment giving control of Kano APC to Shekarau was a setback for presidential ambition of Tinubu.\nThe recognition of Danzago as Kano APC Chairman by Fayemi, who is also said to be interested in the 2023 presidential ticket of APC was widely reported in national newspapers."
  },
  {
    "headline": "Omicron COVID-19 variant not severe: Anthony Fauci",
    "summarized_story": "Dr. Anthony Fauci, President Joe Biden’s infectious disease adviser has punctured the global alarm about the new Omicron COVID-19 variant.\nIn an interview with CNN on Sunday, Fauci described the disease caused by the variant, as not severe.\nLouisiana currently has one Omicron case from an individual who traveled within the United States, its health department said on Sunday.\nGovernors of two states with reported Omicron cases — Connecticut and Colorado — said they hoped their higher-than-average vaccination rates would blunt the impact.\nAs U.S. Omicron cases emerge, COVID-19 vaccine makers aim to quickly tweak their shots to target the variant and U.S. regulators have vowed speedy reviews, but that could still take months."
  },
  {
    "headline": "2023: Why Igbos May Never Produce President Of Nigeria – Bishop Azubuike",
    "summarized_story": "Athan Azubuike, the Presiding Bishop of the House of God International Church, has declared that the Igbos would always be second best and may never provide a president of Nigeria, even if they have everything it takes to govern the country in 2023.\nThis was said by the cleric during an Owerri event for young clergy.\nHe claimed that the average Igbo man is a trader rather than a politician because they lack the ability to mobilize people on a grassroots level.\nHe said,” One thing about an Igbo man is that an average Igbo person is a trader only interested in profit-making, we are not interested in working.\nYou’ll tell me it’s Rochas Okorocha, Anyim Pius Anyim, Sam Ohuabunwa among others but since Pius became the Senate President, how many times have you seen him and others in Imo State."
  },
  {
    "headline": "FG Reacts To Calls To Scrap NYSC Scheme",
    "summarized_story": "The National Youth Service Corps is here to stay, according to the Federal Government, and its contributions to national growth are undeniable.\nThe film was made to raise awareness of the program’s importance in developing national unity, patriotism, peace, and cohesion.\nThis movie needs to travel and hit every viewing platform across Nigeria and in the diaspora; it must go viral.\n“Let the message go out strong and clear, that the NYSC has come to stay.\nThe scheme is more relevant now than it has ever been before in the country”."
  },
  {
    "headline": "Embattled Dowen College Speaks On Sylvester’s Death, Vows To Assist Police With Investigation",
    "summarized_story": "Embattled Dowen College has vowed to work alongside the authorities in the investigation into the death of one of its pupils, Sylvester Oromoni, who was allegedly tortured by colleagues for refusing to join a cult.\nThe tragic and unfortunate incident which transpired this past November, and Sylvester’s untimely death requires a thorough and proper investigation.\n“Dowen College is fully committed to this.\n“We pray that God, who alone knows how to comfort the sorrowing, will comfort Sylvester’s family and all those who loved and knew him.\n“We commiserate with the Oromoni family, and the students of Dowen College who have lost a friend and fellow student."
  },
  {
    "headline": "EndSARS:Lagos State Releases Full Judicial Panel Of Inquiry Reports Online",
    "summarized_story": "The Lagos State Government has made the detailed Judicial Panel of Inquiry reports available online.\nA statement signed by the Attorney-General and Commissioner for Justice, Mr. Moyosore Onigbanjo (SAN), on Sunday, said the reports submitted by the Judicial Panel of Inquiry titled: “Report of Lekki Incident Investigation on 20th October 2021” and “Consolidated Report on General Police Brutality” both dated November 15, 2021, and submitted to Mr.\nAccording bro Onigbanjo, members of the public can view and download the certified true copy (CTC) of the documents on the website of the Lagos State Ministry of Justice – https://lagosstatemoj.org/official-documents/“Further inquiries should be directed to the Office of the Hon.\nAttorney-General & Commissioner for Justice through info@lagosstatemoj.org,” the commissioner stated.\nRecall that controversy has continued to trail an earlier leaked report of the panel few hours after submission to the governor which revealed damning report against governments, Army, Police, among others personalities."
  },
  {
    "headline": "Breaking: Barrow leads as vote count continues in Gambia presidential election",
    "summarized_story": "Gambian President Adama Barrow had a narrow early lead after Saturday’s presidential election, according to provisional results from the first few constituencies to be verified by the electoral commission.\nUnder the simple majority system, provisional results are expected to be announcedlater on Sunday with numbers from individual constituencies released in the interim.\nGambia uses a unique voting system – marbles dropped into each candidate’s ballot drum – to avoid spoiled ballots in a nation with a high illiteracy rate.\nJammeh, who was defeated by an opposition coalition that backed current President Barrow, fled to Equatorial Guinea in 2017 after refusing to accept defeat.\nEarlier on Saturday, Barrow cast his vote in Banjul and said he was confident of victory."
  },
  {
    "headline": "Kaduna: Terrorists free abducted Baptist church members",
    "summarized_story": "Up to 65 members of the Baptist church and others who were kidnapped by bandits in Kaduna state have been released by their abductors.\nThe victims were kidnapped by bandits on October 31 when they invaded the Emmanuel Baptist Church, Kakau Daji in the Chikun Local Government Area of Kaduna State.\nOn Saturday, the victims including women, men and children were brought to the Albarkar Baptist Church in the Kaduna state capital after their release and were reunited with their families.\nMeanwhile, the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the victims were handed over to the state government by the military for an onward reunion with their families.\nHe also said the victims, upon their release, were taken to the hospital by the military for a post-trauma evaluation."
  },
  {
    "headline": "Breaking: West ham stun Chelsea in Premier League clash",
    "summarized_story": "Chelsea FC are facing possible displacement off the top of Premier League table after they succumbed to West ham defeat a while ago on Saturday.\nWest ham had the day afterall with a 3-2 victory at home.\nDetails coming…"
  },
  {
    "headline": "Omicron: FG Expresses Disappointment Over UK Govt’s Red Listing Of Nigeria – Channels Television",
    "summarized_story": "The Minister of Health, Dr Osagie Ehanire, has expressed disappointment over the United Kingdom government’s placement of Nigeria on its red list following the detection of the COVID-19 Omicron variant.\n“We were not very happy when six countries in Sub-Saharan Africa were placed on a red list and the WHO also advised against putting each on the red list,” the minister said on Channels Television’s Sunday Politics, less than one day after the UK announced the move.\nWhile reiterating that the placement of countries on the red list will not help in the global fight against the pandemic, Ehanire said Nigeria is anticipating the fourth wave of the disease.\n“If every country were going to put other countries on the ban list, very soon you would have a large number of countries on your red list,” the minister said.\nAside from Nigeria, Egypt and Malawi were the other countries recently added to Canada’s travel ban list."
  },
  {
    "headline": "Sylvester Oromoni: Police Begin Investigation Into Death Of Dowen College Student",
    "summarized_story": "The police in Lagos have announced that they have commenced an investigation into the death of Sylvester Oromoni jr, a 12-year-old student of Dowen college in the Lekki area Of Lagos.\nOdumosu added that the command is teaming up with the Delta State Police Command in the investigation to unravel the mystery behind the death of the minor.\nIn a viral video, Oromoni jr was seen writhing in pain.\nWith the series of video evidence in circulation, the Management of Dowen College has released a statement saying they will cooperate with authorities to dig deep into the matter.\nThe Lagos State government through its Ministry of Education who had paid an earlier inquiry visit to the college on Friday has announced that the school be shut down indefinitely."
  },
  {
    "headline": "Two Officers, Five Soldiers Killed As Troops Engage BH/ISWAP Terrorists In Borno",
    "summarized_story": "“Regrettably, two officers and five soldiers paid the supreme price, while three personnel who sustained gunshot wounds are currently receiving medical attention,” the spokesman stated.\nGeneral Onyema, however, revealed that the troops neutralized scores of the terrorists who came on gun trucks and motorcycles.\n“Troops gallantly engaged the marauding terrorists with superior firepower, forcing them to abandon their mission and withdraw in disarray.\n“In the fierce battle for Kala Balge, troops defended the town and neutralized 26 BH/ISWAP terrorists,” the army spokesman narrated.\nMeanwhile, the Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya has paid tribute to the departed heroes, who paid the supreme price in defending their fatherland."
  },
  {
    "headline": "Army Says ‘No Cause For Alarm’ As Explosions Rock Maiduguri",
    "summarized_story": "﻿The army on Saturday said there was no need to panic after explosions rocked some communities in Maiduguri, the Borno State capital.\nREAD ALSO: Army Deploys 62 Soldiers To Mali“This unfortunate incident has caused some level of damage and apprehension in residential areas.\nIn February, at least 17 people were killed and 43 others injured when ISWAP fighters fired multiple rockets on Maiduguri.\nOver 40,000 people have been killed since the Boko Haram insurgency began 12 years ago and more than two million are displaced from their homes.\n“We have to fortify Maiduguri town, we have to ensure adequate patrols on a daily basis to avert future attacks."
  },
  {
    "headline": "UK Launches Investigation Into Death Of Six-Year-Old Arthur Labinjo-Hughes",
    "summarized_story": "The United Kingdom has launched a national investigation into the death of six-year-old Arthur Labinjo-Hughes to protect other children.\nLabinjo-Hughes, from Solihull, died in June 2020 after being tortured by his dad and step mum for more than a year.\nThe development upgrades an existing local serious case review which had been started into Arthur’s death.\nThe Attorney General’s Office (AGO) this weekend confirmed to Sky News that Tustin and Hughes’ sentences are to be reviewed.\nThis is even as crowds of people gathered at Solihull Street, where Arthur lived, to hold a vigil for him on Sunday."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Low turnout as Ekiti residents vote to elect Council chairmen, Councillors -",
    "summarized_story": "There was low turn-out of voters today at the Local Government Elections held in Ekiti State to determine which party will Pilot the affairs of the 16 LGA, and 20 LCDAs for the next two years.\nTVc monitored the Election around the State and reports that asides the fact that Vehicular Movement was restricted, the Voting Exercise was largely PeacefulIn most Polling units visited ,voters didn’t turn up until 10am, and before 12pm,the exercise has been concluded as party agents were nowhere to be found in most of the Wards and Units.\nThe Creation of 20 LCDAs had generated Controversies of its own in the last few months, and it is yet to be seen how the meagre resources available to Ekiti State will be able to take care of 36 Local Councils altogether."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "Omicron: UK Suspends Issuance of Visas in Nigeria",
    "summarized_story": "The British High Commission says it will pause “making decisions” on visitor visa applications from all red list countries, which includes Nigeria.\nThe decision was announced in a statement issued by the commission on Sunday and posted on Twitter.\n“To support the UK Government’s aim to protect public health from COVID-19 and associated variants of concern (VOC), UK Visas & Immigration (UKVI) will pause making decisions on visitor visa applications in all red list countries, including Nigeria, until travel restrictions are lifted,” the statement reads.\nThe UK had in less than 24 hours included Nigeria in the “Red list states” meaning that Nigerians without British passport or resident permits can’t travel to the UK until further notice."
  },
  {
    "headline": "#EndSARS: Falana Faults Lagos White Paper",
    "summarized_story": "Human rights lawyer, Femi Falana says the white paper on the report submitted by the Lagos judicial panel on police brutality is illegal.\nCiting a section of the Tribunals of Inquiry Law, Falana says the report of the judicial panel is as effective as a judgment of the Lagos state high court.\nThe senior advocate also criticised the report of the white paper committee, stating that there were many contradictions.\nHe said in previous interviews on Arise TV that, the governor admitted to visiting victims at the hospital as well as admitting that two persons were killed.\nHe also faults the state government for stating that the panel did not disclose the identities of the soldiers who shot at protesters."
  },
  {
    "headline": "My Son Was Tortured To Death – Father Of Sylvester Oromoni Jr.",
    "summarized_story": "Share on TwitterShare on Facebook1 of 3 - +Father of Sylvester Oromoni, 12-year old school boy tells Arise News in exclusive interview"
  },
  {
    "headline": "Army Says No Cause for Alarm as Terrorists Bomb Maiduguri",
    "summarized_story": "The Nigerian Army Saturday urged the public not to panic after terrorists linked to the Islamic State of West Africa Province (ISWAP) fired bombs at some areas in Maiduguri, the Borno State capital.\nReacting to the incident, Borno State Governor, Prof. Babagana Zulum, stressed the need to fortify Maiduguri town against future attacks.\nThe Borno Police Command said a six-month-old baby was injured when ISWAP terrorists fired five mortar bombs into Maiduguri yesterday.\nThe Commissioner of Police, Abdul Umar, told the News Agency of Nigeria (NAN) in Maiduguri that the terrorists fired the bombs from the outskirt of Ngomari Old Airport, behind Borno State University.\nBorno State Governor, Prof. Babagana Zulum, visited the scene of the explosions yesterday and sympathised with those affected."
  },
  {
    "headline": "Nigeria: Terrorists Release 70 Kaduna Baptist Church Members, Nine Others after 35 Days in Captivity",
    "summarized_story": "Terrorists have released 70 abducted persons, including 61 members of the Baptist Church, Kakau Daji, Chikun Local Government Area of Kaduna State.\nThis is coming as no fewer than 10 passengers travelling in a commercial car were kidnapped by bandits in Niger State.\nChairman of the Kaduna State chapter of the Christian Association of Nigeria (CAN), Rev.\nThe spokesman of the Kaduna State Police Command, Mohammad Jalige, could not be reached when contacted on his mobile phone.\nMeanwhile, no fewer than 10 passengers travelling in a commercial car have been kidnapped by bandits in Niger State."
  }
]