[
  {
    "headline": "Russia attacks Ukrainian theatre sheltering over 1,000 civilians",
    "summarized_story": "Ukraine claimed on Thursday that Russia had destroyed a theatre harbouring more than a thousand people in the besieged southern port city of Mariupol, with the toll yet unknown.\nOfficials posted images showing the once gleaming whitewashed three-storey theatre hollowed out and ablaze, with bricks and scaffolding piled high.\nWe will never forgive this,” the Mariupol City Council said in a Telegram post.\nAnd some said they were lucky to survive, but unfortunately not all were lucky,” he said in a video message.\n“The only word to describe what has happened today is genocide, genocide of our nation, our Ukrainian people."
  },
  {
    "headline": "Soludo: 10 things to know about new Anambra governor",
    "summarized_story": "A former governor of the Central Bank of Nigeria, Charles Chukwuma Soludo, has been sworn in as the Anambra State Governor.\nSoludo, who was the candidate of the All Progressives Grand Alliance was declared as the winner of November 6 2021, Anambra Governorship Election by the Independent National Electoral Commission.\nBackgroundSoludo was born on July 28, 1960, and hails from Isuofia in the Aguata Local Government Area of Anambra State.\nAfter his failed attempt, he dumped the PDP on July 17, 2013, and joined the All Progressive Grand Alliance in preparation for the November 2013, Anambra state governorship election.\nThe court then ordered INEC to replace Umeoji with Soludo as the validly elected candidate of APGA for the governorship election."
  },
  {
    "headline": "Inauguration: Soludo vows to chase touts out of Onitsha, markets",
    "summarized_story": "01165/17/3/2022/ Chimezie Anaso/TA/ICE/NANBy David RoyalProfessor Charles Soludo who was on Thursday sworn-in as Governor of Anambra State, has vowed to end the activities of touts and revenue collectors in the state.\nSoludo, a former Central Bank of Nigeria governor said this during his inauguration as the governor of the state.\nThere will be new and better ways of managing our parks, managing our markets, different and better ways of collecting government revenues, managing waste, and general service delivery to citizens.\n“We must ladies and gentlemen rid Onitsha and all our roads and markets of touts and make Anambra a pleasurable experience.\nIn other news, it was a show of shame on Thursday at the inauguration of Prof Chukwuma Soludo as the governor of Anambra when the wife of outgoing Gov."
  },
  {
    "headline": "Energy Deal: Lekoil Nigeria knocks off Lekoil Cayman/Savannah",
    "summarized_story": "By Prince OkaforFollowing an application filed by the Chief Executive Officer, Lekoil Nigeria Limited, Lekan Akinyanmi, the company has reacted to the lifting of an injunction initially granted by The Grand Court of the Cayman Islands against Lekoil Cayman Limited.\nVanguard gathered that the injunction was to halt proceedings into a convertible facility agreement with Savannah Energy, the deal (option agreement and the tripartite) entered into by Lekoil Cayman and Savannah Energy Investments Limited.\nLekoil Nigeria stated that its Board respects the Court’s decision, primarily on the basis that to not lift the injunction would be to risk the insolvency of the Lekoil Limited as a result of the liquidated damages incurred by Lekoil board.\nThey also argues that the Lekoil Cayman/Savannah agreement effectively “gifted” Savannah Energy a material interest in the business, essentially enabling Savannah Energy to “acquire” her stake at below market rate and substantially lower than the value of the offers previously tabled by Lekoil Nigeria to all shareholders.\n“While awaiting the court’s determination of the legality or otherwise of the actions undertaken by the Board of Lekoil Limited and the company’s resulting shareholding structure, the Board of Lekoil Nigeria has taken the decision to suspend her offers to shareholders of Lekoil Limited,” the statement added."
  },
  {
    "headline": "AgriBusiness Summit: Youths should go into Agric sector – Akinboro",
    "summarized_story": "By Nwafor SundayChairman Voriancoreli, Bolaji Akinboro, has appealed to Nigerian youths to go into agricbusiness.\nAkinboro made the appeal at an event organized by Vanguard, “The economic forum series: Agribusiness and Food security summit 2022”, at the Civic Centre.\nWith the theme, ‘Enhancing Nigeria’s food security in a changing climate and digital technology environment’, Akinboro emphatically noted that youths do not show presence in the Agribusiness in the country.\nAkin decried the attitude of Nigerian youths towards Agricbusiness, noting that the age range of farmers in Agricbusiness in Nigeria is 50 and above.\nIn his words: “These two must marry each other and put a measure to increase the agric sector in Nigeria”."
  },
  {
    "headline": "Breaking: Nigeria’s public debt raises to N39.556trn",
    "summarized_story": "Emma Ujah, Abuja Bureau ChiefNigeria’s total public debt as at December 31, 2021 stood at N39.\n556 trillion ( $95.\n770 billion)The Debt Management Office (DMO) provided the data at an interactive session in Abuja, this morning.\nDetail later:"
  },
  {
    "headline": "BREAKING: Soludo makes scathing remarks about Obiano’s wife, Bianca Ojukwu’s fight",
    "summarized_story": "By Vincent UjumaduProfessor Soludo, though expressed worry over the incident, concentrated on his signing of the documents before the state Chief Judge of the state, Justice Onochie Anyachebelu.\nAnd while beginning his speech, he said: “Those who also want to leave can as well do so.\n“The Anambra we are talking about is a place of law and order.\nAt the time he was speaking, former Governor Obiano and his wife had left the scene.\nVanguard News Nigeria"
  },
  {
    "headline": "Lawyer threatens NRC with legal action after train ran out of fuel",
    "summarized_story": "An Ibadan-based lawyer, Barrister Abiodun Amole, has threatened to commence legal action against the Nigerian Railway Corporation.\nHe the need to commence the legal action was necessary due to the fact that he was one of the passengers who boarded a train which recently ran out of fuel.\nDAILY POST recalls that a Lagos-bound train, which carried some passengers from Ibadan, had last week run out of fuel.\nIt was learnt that hundreds of passengers who boarded the train were stranded last Thursday.\nAmole, in a petition written by his counsel, Olumide Ojedokun and addressed to the Chairman, Nigerian Railway Corporation, explained that he was completely frustrated when the train ran out of fuel."
  },
  {
    "headline": "War: Zelensky lists six priorities at peace talks with Russia",
    "summarized_story": "Ukrainian President, Volodymyr Zelensky has listed six priorities during peace talks with Russia.\nAccording to the presidential press service, Zelensky said this while addressing the nation on Thursday.\n“The negotiations between Ukraine and Russia are continuing.”Recall that Ukrainian and Russian delegations started their fourth round of negotiations on Monday via video link.\nThe Ukrainian Presidential Advisor, Mykhailo Podolyak, on Wednesday said that Zelensky might hold talks with Russian President Vladimir Putin in the coming days.\nKremlin spokesman, Dmitry Peskov said on Friday that a meeting between Putin and Zelensky was possible."
  },
  {
    "headline": "Impact Anambra with your expertise – Atiku tells Soludo after swearing-in",
    "summarized_story": "A Peoples Democratic Party, PDP, presidential aspirant, Atiku Abubakar on Thursday congratulated Charles Soludo following his swearing-in as the Governor of Anambra State.\nAtiku said Soludo should use his experience and expertise to impact Anambra State.\nHe also prayed that the former Central Bank of Nigeria, CBN, Governor would impact Nigeria positively.\nCongratulations, Gov Soludo.”Soludo was sworn in by the state’s Chief Judge, Justice Onochie Anyachebelu, at the Anambra State Government House.\nThe event was witnessed by several dignitaries, including the immediate past Governor, Chief Willie Obiano and his wife, Mrs Ebelechukwu, and all the 30 members of the Anambra State House of Assembly."
  },
  {
    "headline": "Ukraine war: We have might to put you in your place – Russia threatens US",
    "summarized_story": "Russia on Thursday warned that it has the might to put the United States, US, in its place.\nDmitry Medvedev, the Deputy Secretary of Russia’s Security Council, accused the West of stoking a wild Russophobic plot to tear Russia apart, NAN reports.\n“It will not work, Russia has the might to put all of our brash enemies in their place,” Medvedev said.\nPresident Vladimir Putin says that what he calls the special military operation in Ukraine was necessary because the United States was using Ukraine to threaten Russia and it had to defend against the “genocide” of Russian-speaking people by Ukraine.\nThe West also said claims that it wants to rip Russia apart are baseless."
  },
  {
    "headline": "Anambra: Drama as Soludo orders noisemakers to leave swearing-in venue [VIDEO]",
    "summarized_story": "The new Governor of Anambra State, Charles Soludo, on Thursday lashed out at some noisemakers during his swearing-in.\nSoludo charged those making noise at the swearing-in event to leave the venue.\nThe former Governor of the Central Bank of Nigeria, CBN, noted that Anambra State would be one of law and order under his era.\nThe event was witnessed by several dignitaries, including the immediate past Governor, Chief Willie Obiano and his wife, Mrs Ebelechukwu, and all the 30 members of the Anambra State House of Assembly.\nWatch the video here:"
  },
  {
    "headline": "UPDATED: Obiano’s wife, Bianca Ojukwu fight dirty at Soludo’s inauguration",
    "summarized_story": "Facing her, Obiano’s wife said: “You said we’re not going to be Governor, you ‘bitch.”.\nIn retaliation, Obiano’s wife held Bianca’s hair and dress before security operatives and other dignitaries barricaded the arena, warning reporters to dismantle their equipment immediately.\nWhile the fight lasted, Obiano, Soludo and Senator Uche Ekwunife among others were stunned.\nBefore Obiano’s wife got to the arena, security operatives stopped her from driving through the main gate while Bishops were allowed in through the same route.\nBut others, who reacted on the incident on condition of anonymity, blamed Obiano’s wife for the incident."
  },
  {
    "headline": "JUST IN: Nigeria’s debt stock grows to N39.556tr",
    "summarized_story": "Nigeria’s total debt stock as at December 2021 stood at N39.556 trillion.\nDirector General of the Debt Management Office (DMO) Ms. Patience Oniha made the disclosure at a media interaction on Nigeria’s debt levels at the end of 2021.\nOniha said other arms of government are also responsible for Nigeria’s growing debt.\nSpeaking on the country’s ballooning debt profile, Oniha stated: “Borrowing came from the budget.\nShe also disclosed that Nigeria’s debt to GDP is now 22.47 percent which is within the 40 percent threshold allowed by the World Bank."
  },
  {
    "headline": "BREAKING: Obiano’s wife, Bianca Ojukwu fight dirty at Soludo’s inauguration",
    "summarized_story": "There was mild drama on Thursday during the inauguration of Prof Charles Soludo as Governor when Willie Obiano’s wife Ebelechukwu and Bianca Ojukwu engaged in a fight.\nRead Also: Obiano hands over to Soludo in Anambra ThursdayObiano’s wife confronted Bianca, accusing her of not wanting the husband to be Governor while calling her a bitch.\nIn retaliation, Mrs Ojukwu stood up and slapped her leading to a fight.\nDetails Shortly…"
  },
  {
    "headline": "Gunmen kill two prison officials in Imo",
    "summarized_story": "Two prison officers were killed yesterday at Umulolo in Okigwe Local Government Area of Imo State.\nThe attack caused panic in the area as people scampered for safety following an explosion at the scene.\nA security source said the officials were ambushed.\n“The attackers threw dynamites into two Hilux vans of the officials, two of whom were killed on the spot while others were wounded and have been rushed to hospital.\nIt was also reported that one Hilux van was destroyed by the dynamite while the other was not affected,” the source said."
  },
  {
    "headline": "FCT Police, kidnappers in gun battle",
    "summarized_story": "The Federal Capital Territory (FCT) Police Command has rescued one Sani Dauje, who was abducted by a kidnap syndicate at the Dobi Kwalita in Gwagwalada area of the nation’s capital.\nAccording to a statement on Thursday by the FCT Police Public Relations Officer, DSP Josephine Adeh, prior to the rescue, the officers of the command, upon intelligence on the gathering of the assailants, engaged the kidnappers in a gun duel.\nShe said the officers, who were aided by military personnel of 176 battalion and local vigilante, were able to repel the kidnappers and arrested one 18-year-old suspect, Usman Babangida.\n“The Command, therefore, enjoins the residents to maximize the availability of the following numbers for the rendition of information: 08032003913, 08061581938, 07057337653 and 08028940883.\nThis is to sustain a relatively peaceful FCT for all and sundry”."
  },
  {
    "headline": "breaking-soludo-sworn-in-as-governor-of-anambra-state",
    "summarized_story": "From Obinna Odogwu, AwkaChief Judge of Anambra State, Justice Onochie Anyachebelu, on Thursday morning, administered the oath of office on Prof. Chukwuma Soludo as the new governor of the state.\nSoludo, former Central Bank of Nigeria (CBN) governor, won the November 6, 2021 governorship election on the platform of the All Progressives Grand Alliance (APGA).\nHe took the oath of office at about 9:50am.\nBefore he was sworn in, his deputy, Dr Onyeka Ibezim, took his oath of office.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly."
  },
  {
    "headline": "2023: PDP presidential candidate emerges May 29 – The Sun Nigeria",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party ( PDP) presidential candidate for the 2023 general elections is to emerge at the party’s national convention scheduled for May 28 and 29, 2022.\nPDP National Publicity Secretary, Debo Ologunagba, announced this, yesterday, while briefing journalists, in Abuja on the outcome of the National Executive Committee (NEC) meeting.\nHe, however, said NEC resolved that youths interested in contesting the 2023 polls would pay half of the nomination fee.\nOlogunagba said NEC approved the constitution of a committee to address the issue of zoning of the presidential ticket and other elective positions in the 2023 general election.\nPDP National chairman, Iyorchia Ayu, while declaring the NEC meeting open, charged party leaders to close rank, in the run-up to the 2023 general elections."
  },
  {
    "headline": "Osun, Ekiti polls: Yoruba group moves to stop election, sues INEC, AGF",
    "summarized_story": "From Oluseye Ojo, Ibadan and Chukwudi NwejeThe apex Yoruba self-determination organisation, the Ilana Omo Oodua (IOO) has made real its threat that agitation for Yoruba nation would resume this week with a renewed vigour to actualise the dream.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe two cases were separately file on Tuesday before the Federal High Court, sitting in Ado-Ekiti, as well as the Federal High Court, sitting in Osogbo.\nThe defendants in each of the two cases are the Attoney-General of the Federation/Minister of Justice, and Independent National Electoral Commission (INEC).\nThe Sun Newspapers, had in its Saturday Sun edition of March 12, 2022, exclusively reported that the IOO said the group would resume agitation for Yoruba nation in a bigger way this week, following the release of Igboho from prison custody in Cotonou."
  },
  {
    "headline": "Marketers, airlines dialogue over aviation fuel price hike",
    "summarized_story": "Major Oil Marketers Association of Nigeria (MOMAN) have opened talks with domestic airlines to end the crisis in supply of aviation fuel to the industry.\nHe, however, advised the domestic airlines to change the way they do business to enable them get steady supply of aviation fuel to run their operations.\n“There is aviation fuel in the country.\nMany of us who have contracts with international airlines have to keep stocks for them.\nNow, international airlines pay for their products based on a pricing formula so it is predictable."
  },
  {
    "headline": "Ebonyi: Court to hear Umahi, deputy, 16 lawmakers motion for stay of execution March 21",
    "summarized_story": "A similar motion by the 16 House of Assembly members who were ordered to vacate their seats would also be heard on the adjourned date.\nThis is even as the respondents have filed a counter affidavits in urging the court not to stay the execution of its judgment.\nThey are specifically seeking a stay of execution of the order of court directing the Independent National Electoral Commission(INEC) to immediately receive from the Peoples Democratic Party(PDP), the names of its candidates to replace them.\nThe court is also prayed to stay the execution of its order directing INEC to hold a governorship election in accordance with section 177(c) of the 1999 Constitution.\nIn addition, the motion on notice dated March 9, 2022 is equally seeking an order staying the execution of the order of court directing INEC to immediately declare the persons nominated by the PDP as Governor and deputy governor of Ebonyi state respectively."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "'We'll review tariff every six months' -- NERC confirms removal of electricity subsidy",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has confirmed the removal of electricity subsidies by the federal government, adding that the commission will review tariff rates every six months.\nOver the weekend, Zainab Ahmed, minister of finance, had announced the removal of subsidy on electricity tariff.\nSpeaking during a press briefing on Wednesday, Sanusi Garba, NERC chairman, said the commission played a role in ensuring that tariff rates were regulated.\nAdvertisementHe said that the electricity subsidy had been reduced in the past four to five years over its unsustainability regarding investors’ return on investments.\nAdvertisement“So that policy decision (stopping electricity subsidy) is as announced by the Minister of Finance."
  },
  {
    "headline": "'We'll review tariff every six months' -- NERC confirms removal of electricity subsidy",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has confirmed the removal of electricity subsidies by the federal government, adding that the commission will review tariff rates every six months.\nOver the weekend, Zainab Ahmed, minister of finance, had announced the removal of subsidy on electricity tariff.\nSpeaking during a press briefing on Wednesday, Sanusi Garba, NERC chairman, said the commission played a role in ensuring that tariff rates were regulated.\nAdvertisementHe said that the electricity subsidy had been reduced in the past four to five years over its unsustainability regarding investors’ return on investments.\nAdvertisement“So that policy decision (stopping electricity subsidy) is as announced by the Minister of Finance."
  },
  {
    "headline": "EXTRA: Drama as Obiano's wife, Bianca fight at Soludo's inauguration",
    "summarized_story": "There was drama at the inauguration of Chukwuma Soludo as the governor of Anambra state when Ebelechukwu, wife of Willie Obiano, his predecessor, and Bianca Ojukwu engaged in a fisticuff at the event.\nAdvertisementEbelechukwu reportedly moved to the front row where Bianca, widow of Chukwuemeka Ojukwu, was seated and slapped her.\nAdvertisementThe action drew the attention of security agents and some personalities who pulled Obiano’s wife off Bianca who was reportedly shocked at the action.\nEbelechukwu was reportedly taken away from the scene of the event and shortly afterward, her husband left the venue.\nThe two women have reportedly been at loggerheads for years."
  },
  {
    "headline": "EXTRA: Drama as Obiano's wife, Bianca fight at Soludo's inauguration",
    "summarized_story": "There was drama at the inauguration of Chukwuma Soludo as the governor of Anambra state when Ebelechukwu, wife of Willie Obiano, his predecessor, and Bianca Ojukwu engaged in a fisticuff at the event.\nAdvertisementEbelechukwu reportedly moved to the front row where Bianca, widow of Chukwuemeka Ojukwu, was seated and slapped her.\nAdvertisementThe action drew the attention of security agents and some personalities who pulled Obiano’s wife off Bianca who was reportedly shocked at the action.\nEbelechukwu was reportedly taken away from the scene of the event and shortly afterward, her husband left the venue.\nThe two women have reportedly been at loggerheads for years."
  },
  {
    "headline": "Sanwo-Olu, Fani-Kayode head APC media committee as Buni dissolves Bello’s convention panel",
    "summarized_story": "Mai Mala Buni, national chairman of the All Progressives Congress (APC) caretaker committee, has dissolved the convention sub-committees for the March 26 national convention set up by Abubakar Bello, Niger state governor.\nOn Wednesday, President Muhammadu Buhari asked governors on the platform of the party to allow Buni to plan the national convention.\nTheCable had reported how Buni worked to scuttle the APC convention scheduled for March 26.\nAdvertisement“As approved by the Chairman of the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) and Governor of Yobe State, H.E.\nMai Mala Buni, please find the list of Chairmen, Deputy Chairmen and Secretaries of the various sub-committees for the Party’s 2022 National Convention (as earlier published)."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Sokowatch launches in Senegal and Côte d’Ivoire after $125m round",
    "summarized_story": "Sokowatch, an e-commerce company offering tech-enabled supply chain solutions to Africa’s informal retailers, on Wednesday said it has closed a $125 million Series B equity round at a valuation of $625 million, per TechCrunch.\nInitially launched in Kenya by founder and CEO Daniel Yu in 2015, Sokowatch scaled into neighboring East African markets Tanzania, Rwanda, and Uganda in 2018.\nThrough Wasoko’s platform, informal retailers are able to order products at any time via SMS or mobile app for free same-day delivery to their stores.\n“If you look at the past 10 years, both Senegal and Cote d’Ivoire have experienced solid year-on-year GDP growth,” the CEO said.\nThe new capital will enable Wasoko to drive further geographic expansion and product growth across the continent, according to the company."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria’s struggling economy in 7 charts",
    "summarized_story": "Nigeria’s economy has continued to struggle to keep up to its title ‘Africa’s largest economy’ with its dwindling oil production, low standard of living, and the rising cost of goods and services.\nThis however isn’t the case for Nigeria, Africa’s biggest economy, which has seen a decline in oil production over the past months.\nNigeria, Africa’s largest oil producer has continued to see instability with its oil production.\nRead also: Nigeria’s economy unravels at worst time ahead electionsThe latest oil production is a decline from the 1.39 million barrels of oil produced in January 2022.\nWhile the oil cartel indicated that the increasing oil price might have provided ample support for the Nigerian economy."
  },
  {
    "headline": "Petrol imports double to N3.96trn in one year",
    "summarized_story": "Top officials of the two biggest oil marketers’ associations in Nigeria who spoke to BusinessDay blamed the surging petrol imports bill on oil price rally, smuggling of petrol to neighbouring countries and naira devaluation.\nHe listed higher international oil prices as being outside Nigeria’s control and smuggling and “unjustifiable petrol consumption” as within the country’s control.\n“Nigeria is the only West African country selling petrol at one-third of the international price,” Isong told BusinessDay.\nRead also: Nigeria will use Eurobond cash to fund 2022 petrol subsidy- Minister of financeMany stakeholders have lamented that the country’s petrol subsidy is denying the country value that could have accrued from higher oil prices.\n“Fighting petrol smuggling involves multi-government agencies, not just EFCC alone."
  },
  {
    "headline": "Commodity exchanges seen as better deal for farmers",
    "summarized_story": "Following the ban by the Federal Government on direct purchase of farm produce by foreigners from farmers, experts have said commodity exchanges rather than licensed agents will be the best option for farmers.\nThe Nigerian Commodity Exchange, formerly Abuja Securities & Commodities, which is the only government commodity exchange, is yet to commence operations.\n“The foreigners buying directly from the farms were distorting the market and not giving stability to the value chain.\nStakeholders in the sector called on the government at all levels to organise the commodity value chain and regulate the activities of foreign traders in the country.\n“There is a structure, value chain and commodity trading must be organised for distribution through the proper channels."
  },
  {
    "headline": "Edo commits to pensioners’ welfare, assures on clearing issues with gratuities, harmonized pay – Nigerian Observer",
    "summarized_story": "Comrade Philip Shaibu, disclosed this while addressing pensioners in the Ring Road area of Benin City.\nShaibu noted, “We have addressed the issue of pensions.\nWe have been having issues on how to resolve the challenge with the payment of gratuities.\nWe have agreed that the Head of Service Committee will continue with the discussion on how to resolve the issue.\nHe added: “Just like we addressed the issue of pension, which we have resolved, we will also resolve this issue."
  },
  {
    "headline": "CVR: INEC registers 103,101 in Edo – REC – Nigerian Observer",
    "summarized_story": "Mr Johnson Alalibo, the State Resident Electoral Commissioner (REC), made this known at a stakeholders meeting on Continuous Voter Registration (CVR), in Benin.\nAlalibo, who noted that the figure was not encouraging, appealed to stakeholders to mobilise their people for the ongoing registration, especially in the newly created polling units.\n“In June 2021, the continuous voter registration commenced online, but restricted to the local and state government offices of the commission.\nHe, however, warned against double registration, adding that anyone caught to have engaged in double registration risked the total loss of his or her registration.\nThe REC further explained that due to the limited available number of INEC Voter Enrolment Devices (IVED), the voter registration exercise would be rotational as more devices were being expected."
  },
  {
    "headline": "ROK Studios shooting 50 films in Edo, partners govt’s creative hub initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… trains youths on scriptwriting, cinematography, sound engineeringBENIN CITY – The Edo State Government, through the Victor Uwaifo Creative Studio and Sound Stage (VUHSS) has partnered ROK Studios on the production of 50 films in the state for distribution across its network.\nThe partnership has birthed training programmes for creatives and other youths in the state on scriptwriting, cinematography, and sound engineering.\nThe Victor Uwaifo Creative Studio and Sound Stage is part of efforts by the Governor Godwin Obaseki-led state government to up-skill content creators in Edo State with the sole vision of building Edo State into a hub for Nigeria’s creative industries.\nAccording to the Managing Director of Edo State Skills Development Agency, Mrs. Ukinebo Dare, “A wonderful opportunity we have in Edo today is the ongoing partnership between the Victor Uwaifo Creative Studio and Sound Stage (VUHSS) and ROK STUDIOS.\n“The partnership between VUHSS and ROK Studio began in January, and since then, it has boosted the visibility of the hub and made it a beehive of buzz and activity."
  },
  {
    "headline": "Edo assures sustained investment in healthcare sector, seeks partnership to enhance quality delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has pledged to sustain partnerships with stakeholders in the health sector, ensuring an improved healthcare system that will guarantee the delivery of quality and efficient healthcare services to the people.\nThe Edo State Head of Service, Anthony Okungbowa Esq., made the promise when the executives and members of the Medical and Dental Consultants’ Association of Nigeria (MDCAN), Edo State Hospital Management Agency Branch, paid a courtesy visit to the Government House, Benin City.\nReassuring the government’s commitment to providing state-of-the-art equipment and enduring infrastructure in the health sector, the HOS said the health and wellbeing of every Edo citizen is a top priority for the Obaseki-led administration.\nHe further noted that the government has upgraded the state-owned College of Nursing Sciences, which will develop the human capacity to sustain ongoing reforms in the healthcare system and will sustain reforms and programmes to improve access to quality and affordable healthcare services to Edo people.\nEarlier in his remark, the leader of the group and Hospital Management Agency Branch Chairman of MDCAN, Dr. Sunday Omozuwa lauded Governor Obaseki for his developmental strides in the health sector, pledging unalloyed commitment to the state government’s ongoing reforms in the sector."
  },
  {
    "headline": "Hushpuppi commits another $400,000 scam in US prison",
    "summarized_story": "Nigerian internet fraudster, Ramon Abbas, alias Hushpuppi, detained by the authorities in the United States for committing multi-million dollars fraud, has yet allegedly committed another $400,000 scam while in prison.\nInvestigators found out that criminals can order a virtual option of EIP debit cards and receive it instantly.\nCriminals can also order for the plastic version of EIP debit cards and they receive it to their mail address.\nHe purchased a total of 58 EIP debit cards in this period, with a total value of $429,800.\nOf the 58 EIP debit cards, Abbas chose the virtual card option for 36 EIP cards and he selected the plastic physical card option for 22 EIP cards."
  },
  {
    "headline": "BREAKING: Obiano’s wife slaps Emeka Ojukwu’s spouse, Bianca at Soludo’s inauguration",
    "summarized_story": "Wife of the Willie Obiano, the immediate past governor of Anambra State, Mrs. Ebelechukwu Obiano, on Thursday, slapped Mrs Bianca Ojukwu, wife of late Chief Emeka Ojukwu at the inauguration ceremony of the state’s new governor, Charles Soludo.\nNAN reports that dignitaries including Ex-Gov Obiano were already seated when Mrs Obiano stepped in and moved to the front row where the widow of Dim Odumegwu Ojukwu was seated and slapped her.\nThe action drew the attention of security agents and some personalities who pulled Mrs Obiano off the hold of Bianca who was visibly shocked at the action.\nMrs Obiano was later taken away and shortly afterwards, her husband left the venue since the incident happened after the new governor had been sworn in.\nThere’s been bad blood between the Obianos and Mrs. Ojukwu."
  },
  {
    "headline": "2023: PDP fixes dates for presidential, governorship primaries",
    "summarized_story": "The People’s Democratic Party (PDP) national working committee (NWC), has released its schedule of activities in the lead up to the 2023 general election.\nAccording to the timetable, the national convention to elect the party’s presidential candidate will take place on May 28, while the governorship primaries will take place on May 21.\nThe timetable which was signed by Umar Bature, the national organising secretary of the PDP, was officially released on Wednesday after the joint meeting of the board of trustees (BOT) and national executive committee (NEC) of the party at its headquarters in Abuja.\nRecall that the main opposition party had fixed its presidential nomination form for N35 million, while youths aged between 25 and 30 will get 50 percent discount on the nomination form fees"
  },
  {
    "headline": "2023: APC reps back Tinubu’s presidential bid",
    "summarized_story": "The All Progressives Congress (APC) caucus in the house of representatives has thrown their weight behind the presidential ambition of Bola Ahmed Tinubu.\n“I can tell you without any fear of contradiction that Senator Bola Ahmed Tinubu supported so many Nigerians to become president of the Federal Republic of Nigeria.\nIf there is any time for this man to be supported to achieve his life ambition, it is now.\nSenator Ahmed Tinubu has got everything it takes to be president.\n“I am the only one in the race that is most competent, most qualified to be your president come the year 2023."
  },
  {
    "headline": "Davido To Gift N20m Startup Support To 20 Young Entrepreneurs",
    "summarized_story": "Award winning Nigerian singer and philanthropist, David Adeleke also known as Davido is set to give N20million to 20 young entrepreneurs.\nThe singer also took to his official Twitter page on Wednesday to lament the hardship in the country and what people were going through.\nDemonstrating that he cares and to alleviate their hardship, the popstar further stated that he was going to give out N20m to 20 people on Friday to aid their businesses.\nADVERTISEMENTDavido tweeted, “Country hard right now sha … let’s give N20m to 20 people on Friday… send in your business ideas or start-up ideas … more details shortly #Wrblo”.\nThe singer who just had a successful concert at O2 Arena in London, has a mantra, ‘We rise by lifting others’."
  },
  {
    "headline": "Hushpuppi Commits Alleged Fresh $400,000 Fraud From Inside US Prison",
    "summarized_story": "Hushpuppi, has received fresh charges as US prosecutors submit court documents showing how he committed fraud and laundered over $400k from behind bars.\nUS prosecutors presented documents before the United States District Court of California on Wed 16th March 2022 with fresh evidence indicting HushPuppi of committing fraud and money laundering in U.S Federal correctional facility.\nEconomic Impact Payments are financial support offered by the US government to U.S residents according to the CARES Act.\nOne of the ways eligible US residents receive their Economic Impact Payments is by debit cards.\nFrom the documents presented in court, it was found that hackers use data of U.S residents to file and obtain Economic Impact Payments debit cards."
  },
  {
    "headline": "2023: Dattijo Meets Kaduna Lawmakers On Sustaining El-Rufai’s Legacies",
    "summarized_story": "All Progressives Congress (APC) governorship aspirant in Kaduna State, Mohammed Sani Abdullahi (Dattijo), has urged members of the Kaduna State House of Assembly to support him in sustaining the laudable achievements of Governor Nasir El-rufai.\nI believe that only continuity will guarantee that Kaduna will match forward with the determined leadership it has witnessed under the APC,” he told the lawmakers.\n“Aside from the energy, faith and devotion that I bring to this endeavour, my experience in the public sector has equipped me with the required competence to lead Kaduna State to achieve greater prosperity.\nADVERTISEMENTWhile soliciting the support of the lawmakers for his candidacy, Dattijo said he was willing to abide by the decision of the governor and the leadership of the party.\nDattijo was recently appointed an associate and founding member of Dunning Africa Center by the prestigious Henley Business School, University of Reading, United Kingdom."
  },
  {
    "headline": "Obiano’s Wife, Bianca Ojukwu Fight At Soludo’s Swearing-in Ceremony",
    "summarized_story": "There was disbelief at the inauguration of Prof. Charles Chukwuma Soludo as the new governor of Anambra State when the wife of the outgone Governor Willie Obiano, Mrs Ebelechukwu, slapped Ambassador Bianca Ojukwu at the event on Thursday.\nThe News Agency of Nigeria (NAN) correspondent who was at the scene of the event reports that the incident occurred immediately after Soludo took his oath of office.\nADVERTISEMENTNAN reports that dignitaries, including the immediate-past Governor Obiano were already seated when Mrs. Obiano stepped in and moved to the front row where Mra Ojukwu, the widow of the late Biafran Leader, Dim Odumegwu Ojukwu, was seated and allegedly slapped her.\nThe action drew the attention of security agents and some personalities who pulled Mrs. Obiano off the hold of Ojukwu, who was visibly shocked at the action.\nMrs. Obiano was later taken away and shortly afterwards, her husband left the venue since the incident happened after the new governor had been sworn in."
  },
  {
    "headline": "Ganduje Commends Buhari For Deepening States’ Fiscal Transparency, Accountability",
    "summarized_story": "Kano state governor, Abdullahi Umar Ganduje has commended the administration of President Muhammadu Buhari for its fiscal intervention through the States Fiscal Transparency Accountability and Sustainability (SFTAS) programme for results aimed at deepening fiscal transparency, accountability and sustainability at the State level.\nAccording to a press statement signed by Mr Ibrahim Mohammed, the SFTAS programme communication specialist, the workshop which attracted participants from the 36 states of the federation was meant to explore ways of ensuring the sustainability of the programme ideals at all levels of government.\nSalisu Lawal Indabawa , director PRS in the State Ministry of Finance made the commendation last Thursday in Kano while declaring open a workshop on fiscal sustainability organized by the SFTAS programme coordination unit in Federal Ministry of Finance, Budget and National Planning.\nHe also stressed that the wholesale adoption of the SFTAS programme by the 36 States of the Federation has translated into increasing efficiency of public expenditure; strengthened fiscal sustainability through increased efficiency in spending, strengthened revenue mobilisation and debt sustainability to prevent fiscal crises in the future.\nHe therefore urge State governments to continue to uphold the ideals of the programme for the betterment of the citizens and the society at large."
  },
  {
    "headline": "JUST IN: Obiano leaves Soludo’s inauguration venue as dignitaries scramble for entrance",
    "summarized_story": "The outgoing governor of Anambra State, Chief Willie Obiano, has left the venue of the swearing-in ceremony of the new Governor of the state, Prof. Chukwuma Soludo.\nHe left the venue with his wife, Ebelechukwu, who trekked out of the venue at exactly 9.55 am.\nThe incoming governor, Soludo had minutes ago taken his oath of office.\nSoludo came in the company with his wife, Mrs Nonye, while his Deputy, Dr Onyeka Ibezim also arrived with his wife.\nDignitaries in Anambra State and beyond are currently at the gate of the Anambra State government house, scrambling to enter the venue of today’s swearing-in."
  },
  {
    "headline": "PDP Crisis: Governor Ortom settles Wike, Obaseki fight",
    "summarized_story": "Benue State Governor, Samuel Ortom, has reportedly reconciled Governor Nyesom Wike of Rivers State and his Edo State counterpart, Godwin Obaseki.\nRecall that Wike, Rivers State Governor, and his Edo State counterpart, Godwin Obaseki have been on warpath over party structure.\nWike’s war of words with Obaseki began with Edo State Deputy Governor Philip Shaibu threatening to leave the PDP due to a crisis in the state chapter.\nWike had described Shaibu as a khaki-wearing deputy governor with no father.\nReacting to the development in a statement he personally signed, Obaseki said his deputy “at no point threatened the party” as alleged by the Rivers governor."
  },
  {
    "headline": "BREAKING: APC Cancels Thursday NEC Meeting",
    "summarized_story": "The All Progressives Congress’s National Executive Council meeting set for Thursday, March 17, 2022, was canceled on Wednesday in Abuja.\nDr. John Akpanudoedehe, the party’s Caretaker/Extraordinary Convention Planning National Secretary, revealed this in a statement headlined ‘Purported APC NEC meeting cancelled’ that he signed late Wednesday.\nThe statement read “As directed by the National Chairman of the All Progressives Congress Caretaker/Extraordinary Convention Planning and Governor of Yobe State, Mai Mala Buni, a purported emergency meeting of the Party’s National Executive Committee slated for Thursday, March 17, 2022, is hereby cancelled.”Details later…"
  },
  {
    "headline": "BREAKING: Buhari writes APC governors, says Buni should be allowed to oversee convention",
    "summarized_story": "President Muhammadu Buhari says Mai Mala Buni, Yobe state governor, should be allowed to conduct the national convention of the All Progressives Congress (APC).\nIt was earlier reported how Buni worked to scuttle the APC convention scheduled for March 26.\nThe Independent National Electoral Commission (INEC) had subsequently rejected a notice of a national executive committee (NEC) meeting announced by Bello.\n“First, the issue of the leadership of the Caretaker Extra Ordinary Convention Committee (CECC), should immediately return to status quo ante.\n“Third, the Mai Mala Buni-led CECC should, accordingly, be allowed to proceed with all necessary preparations to hold the convention as planned-unfailingly, on 26th March, 2022.”"
  },
  {
    "headline": "Breaking: Obiano’s wife, Bianca Ojukwu fight at Soludo’s inauguration",
    "summarized_story": "The wife of immediate past governor of Anambra state, Ebelechukwu Obiano, and Bianca, wife of late Odumegwu Ojukwu fought each other while the inauguration of new governor Prof. Charles Soludo was ongoing.\nThe ugly scenario was said to have played out when an oral exchange ensued between them.\nEbelechukwu has been reportedly involved in similar acts in the past with many accusing her of always wielding certain influence on her husband while he was the state governor.\nDetails loading…"
  },
  {
    "headline": "Happening now: Willie Obiano out, Charles Soludo in as Anambra governor (PICTURES)",
    "summarized_story": "The former Central Bank of Nigeria (CBN), governor, Prof. Charles Chukwuma Soludo, Thursday, assumed office as new Anambra State Governor.\nSoludo, who emerged governor of the state during the November 6, 2021 gubernatorial poll, took over from the immediate past governor, Chief Willie Obiano, in a ‘low keyed’ swearing in ceremony held at government house, Awka.\nThe event earlier billed to be attended by 50 persons was however, graced by over two hundred dignatories from all walks of life including the former governor Obiano.\nBlueprint reports that Obiano after the official hand over boarded his vehicle home while Prof. Soludo addressed the public."
  },
  {
    "headline": "APC leadership crisis: Buhari wields the big stick, orders govs to leave Buni alone – Blueprint Newspapers Limited",
    "summarized_story": "The warning came against the backdrop of the leadership crisis rocking the ruling party.\nFirst, the issue of the leadership of the Caretaker Extra Ordinary Convention Committee (CECC), should immediately return to status quo ante; b.\nA statement signed Wednesday in Abuja by the national secretary of the Caretaker Extraordinary Convention Planning Committee (CECPC) Senator John James Akpanudoedehe, said the NEC meeting was cancelled as directed.\n“As directed by the National Chairman of the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning (CECPC) and Governor of Yobe State, H.E.\nMai Mala Buni, a purported emergency meeting of the Party’s National Executive Committee (NEC) slated for Thursday, March 17, 2022 is hereby canceled.”"
  },
  {
    "headline": "Soludo Sworn In As Anambra Governor In Low-Key Event",
    "summarized_story": "Charles Soludo has been sworn in as the fifth governor of Anambra State in a modest event that took place at the Government House on Thursday.\nHe also thanked stakeholders, his supporters, Federal Government agencies like the police, and the people of Anambra State for their roles in his election last November.\nA circular by the state government showed that about 50 persons were invited for the ceremony as Soludo said he wanted a low-profile event.\nRELATEDCharles Soludo Wins Anambra Governorship ElectionWhy Obiano Supported Me To Become Anambra Governor – SoludoAnambra Election: I Knew Soludo Would One Day Be Governor, Says NgigeCourt Dismisses Suit Challenging Soludo’s ElectionThursday’s swearing-in is the culmination of a series of events leading to the programme.\nThe suit sought to nullify his win on allegations that Soludo provided false information to the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "‘Businesses Are Suffering,’ Elumelu Laments Over Hardship, Poverty In Nigeria",
    "summarized_story": "Nigerian Economist and businessman, Tony Elumelu on Thursday lamented over the worsening electricity, hike in prices of diesel, and its effect on businesses in the country.\nThe CEO of Heirs Holdings in a series of tweets said businesses are suffering under the situation with Nigerian citizens groaning under food inflation as well.\n— Tony O. Elumelu, CON (@TonyOElumelu) March 17, 2022“How can a country so rich in natural resources have 90% of its citizens living in hardship and poverty?,” Elumelu said.\n“I have often said that access to electricity is critical for our development, alleviation of poverty and hardship.\nHow can we be losing over 95% of oil production to thieves?"
  },
  {
    "headline": "Buhari Apologises To Nigerians Over Fuel Scarcity, Reacts To Blackouts",
    "summarized_story": "President Muhammadu Buhari on Wednesday apologised to Nigerians for the inconvenience caused by the prolonged shortage of petroleum products.\n“The administration knows the fuel shortage has placed a strain on Nigerian citizens and businesses, but relief is on the way.\n“The blackouts seen in the national grid are also being addressed,” he assured Nigerians.\nTo also ramp up the underutilised capacity of the NDPHC capacity, he said a $50 million gas supply agreement was being finalised to secure the sustainability of up to 800MW of underutilised NIPP assets.\nThe President assured Nigerians that the government’s attention to these problems would bear fruits very soon."
  },
  {
    "headline": "‘No Party Member Should Attack Another,’ PDP Chairman Calls For Unity",
    "summarized_story": "The National Chairman of the Peoples Democratic Party (PDP), Senator Iyorchia Ayu, has appealed to members across the country to stay united to ensure the party’s success at all times.\n“With unity, everything is possible,” Ayu told the PDP leaders at the meeting.\n“I call on every member of this party to forget their differences.\n“No party member should attack another party member.\nFor the PDP chairman, it is important for party leaders and members to settle their differences using in-house mechanisms and to position the party in a position to reclaim power at the centre in 2023."
  },
  {
    "headline": "NPF Orders Immediate Indefinite Suspension Of Edo State PCRC Chairperson",
    "summarized_story": "The Nigeria Police Force has ordered the immediate and indefinite suspension of the Police Community Relations Committee (PCRC) Chairperson of the Edo State Police Command, Mrs Helen Atekha Odemwingie.\nThe suspension follows a trending picture of the PCRC chairperson and other members seen wearing black uniforms similar to that of the police with accompanying insignias and inscriptions at an event held at the Edo State Police command.\nThe Force equally condemned the illegal use of police uniforms, kits and accoutrements by non-police individuals and groups.\n“In recent times, members of the police public relations person across the state are seen to be taking their relationship with the police too far, particularly in their mode of dressing.\n“Many come to events in Tshirts and accomplishments in police colour, others go about police divisions to solicit for the release of suspects in police custody”, he added."
  },
  {
    "headline": "2023: I’m joining the race to fix insecurity, economy says presidential aspirant",
    "summarized_story": "A presidential aspirant, Nicolas Felix has disclosed that he will unveil innovative policies that will reduce the crime rate in the country.\nSpeaking at a media parley in Lagos, on Wednesday, Dr Felix said he has decided to join the 2023 race to reduce the negative perception about Nigeria across the globe.\n“Politics was never in my blood, but I realised I have to join the race to stop the complaints about Nigeria.\nIf you expect those that got the place filthy to clean it up, then you are making a big mistake.\nAs of today in Nigeria, security is a mess."
  },
  {
    "headline": "President Buhari Recognises Governor Buni as head of APC CECPC",
    "summarized_story": "President Muhammadu Buhari has written an official letter recognising Chairman of the Caretaker Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) Governor Mai Mala Buni, even as he ordered a status quo ante in the party’s leadership change.\nIn a letter President Muhammadu Buhari personally signed Wed, He also ordered all members of the Progressive Governors Forum and their followers to desist from any behaviour or utterances that will lead to disunity in the ranks of the party.\nThe President copied the letter to the APC acting Chairman Governor Sani-Bello,the Inspector General of Police, Director General of Department Of State Services, Secretary to the Government of Federation, among others."
  },
  {
    "headline": "Kogi govt berates ex-PGF DG over comments against Gov Bello, Buni -",
    "summarized_story": "Lukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nLukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nTo the amateur politician, the unfounded allegations against the administration of Governor Yahaya Bello should sway the minds of Nigerians or party leaders.\nGovernor Yahaya Bello has only refrained from dignifying detractors with response, venom for venom, because of his sound upbringing.\nCivil servants on Grade Level 1 to 6 received 100% salary with the 30,000 minimum wage."
  },
  {
    "headline": "Ondo govt honours Fasoranti, Arogbofa, other Illustrious citizens -",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has honored a foremost Yoruba Leader, Reuben Fasoranti, and three others for their contributions to the creation of the state forty-six years ago.\nGovernor Akeredolu urged the present crop of leaders to continue to demand good governance,"
  },
  {
    "headline": "“I Commit to Being Accountable and Judicious Use of Taxes”- Gov. Charles Soludo",
    "summarized_story": "1 of 6 - +Former Governor of the Central Bank of Nigeria, Charles Soludo inauguration as the Governor of Anambra State takes place at the governor house in Agu-Awka today.\nSome notable figures in attendance include the immediate past governor of Anambra, Willie Obiano, his wife; and wife of late Dim Odumegwu Ojukwu, Bianca."
  },
  {
    "headline": "Russia Accused of Bombing Theatre Sheltering Civilians, Biden Calls Putin a War Criminal",
    "summarized_story": "Moscow has yet to capture any of Ukraine’s biggest cities despite the largest assault on a European state since World War Two.\nMoscow denies targeting civilians and Russia’s defense ministry said its forces had not struck the building, RIA news agency said.\nThe U.S. Embassy in Kyiv said Russian forces had shot dead 10 people waiting in line for bread in Chernihiv, northeast of Kyiv.\n“Neutral status is now being seriously discussed along, of course, with security guarantees,” Russian Foreign Minister Sergei Lavrov said.\nPresident Volodymyr Zelensky has said Ukraine could accept international security guarantees that stopped short of its longstanding aim to join NATO."
  },
  {
    "headline": "Chris Cuomo Wants $125 Million for ‘Unlawful’ CNN Firing",
    "summarized_story": "Chris Cuomo wants an arbitrator to award him $125 million for his firing from CNN, alleging his bosses knew full well how he advised his brother, former New York Gov.\nHis filing seeking arbitration on Wednesday exposed more ugliness at the network, where Cuomo, CNN chief Jeff Zucker and his top deputy, Allison Gollust, have all been ousted in the past three months.\n“It should be obvious by now that Chris Cuomo did not lie to CNN about helping his brother,” said his lawyer, Bryan Freedman.\nDuring the height of the COVID-19 pandemic in 2020, Chris Cuomo interviewed his big brother on CNN nine times — a temporary lift of the network’s policy that Chris Cuomo not participate in stories concerning the governor.\nIn his filing Wednesday, Chris Cuomo said CNN leadership demanded the interviews even though he and his brother had expressed reservations about them."
  },
  {
    "headline": "UK: Met Police Officers Who Strip Searched Black Schoolgirl Under Investigation",
    "summarized_story": "“The horrific strip search of a Black girl at school is a clear example of why police should not be in places of education.\nAbolition makes the case for itself.”Ebinehita Iyere, founder of Milk Honey Bees, told The Independent: “From a structural level, Black girls are being let down.\nThey are criminalised through the British education system and the case of Child Q has further amplified that reality.\n“Many Black girls will read, hear or have experienced things similar to her case.\n“Society must listen to and protect Black girls."
  },
  {
    "headline": "Liverpool Beat Arsenal to Cut Man City’s Premier League Lead to One Point",
    "summarized_story": "A clinical Liverpool beat Arsenal 2-0 to cut Manchester City’s once double-digit lead at the top of the Premier League table to a single point on Wednesday, leaving the title race wide open.\nBut the game tipped decisively early in a frenetic second period as Liverpool extended their own relentless run to nine consecutive league wins.\nLiverpool’s title destiny is now very much in their own hands as they still have to visit City in April.\n“They really raised the level today but unfortunately games are won in the boxes,” he said of his side.\nA misplaced backpass by Thiago let in Martin Odegaard who looked poised to score but Alisson made a superb save."
  }
]