[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Chinese investors to cultivate 10,000 hectares of rice in Yobe – Buni",
    "summarized_story": "Mai Mala Buni of Yobe on Wednesday said a group of Chinese investors will establish 10,000 hectares of rice plantation under a trial agricultural project in the state.\nHe expressed the readiness of his administration to partner the investors for agricultural development of the state.\nHe urged the people to take advantage of the investment to earn a living and improve agricultural production of the state.\nHe explained that the group would plant high-yielding and improved variety of rice in the state.\n“We are transferring modern agricultural technology currently used in agricultural production in China,” Wang said."
  },
  {
    "headline": "Why I want to be Delta Governor in 2023 — Goodnews Agbi",
    "summarized_story": "Dr Agbi who has been very active in Delta State politics since he joined in 1998, contested the governorship primaries of the defunct Grassroots Democratic Party, GDM, with Chief James Ibori who later became the Governor of Delta State as his only opponent.\nEXCERPTS:Why are you contesting for the Gubernatorial race in Delta come 2023 Delta election?\nWhy should an indigene of Delta State be paying around two hundred and fifty thousand for school fees in a State University of a rich State like Delta?\nI will merge the existing Universities campuses into the three Senatorial districts of Delta State, that is, Delta State University Abraka will have all the faculties in Abraka, with the Engineering and Law established in Abraka or its environs all in Delta Delta Central.\nFor Delta South, the two Campuses In Oleh will merge with Delta State University of Science and Technology at Ozoro with one administration."
  },
  {
    "headline": "Maternal, child health: Enugu targets 1m children, 280,000 pregnant women",
    "summarized_story": "The Enugu State Government has targeted some one million children for free drugs, medical consumable and other routine services in its going Maternal, Newborn, and Child Health Week.\nInaugurating the programme in Enugu on Wednesday, Wife of Enugu State Governor, Mrs Monica Ugwuanyi, urged pregnant women to take attendance to anta-natal seriously.\nUgwuanyi noted that the tests would afford pregnant women the chance to easily detect when pregnancy complications were looming.\n“Our mothers, especially pregnant women, should feed well.\n“During the programme, women and children will be given health education, pre-natal vitamin A, other multivitamins, routine immunisation, family planning commodities and COVID-19 vaccination among others."
  },
  {
    "headline": "NCAA suspends Dana Air flight operations, withdraws ATL",
    "summarized_story": "By Prince OkaforMore troubles in the aviation industry, as the Nigerian Civil Aviation Authority (NCAA) announced the suspension of Dana Airlines’ Air Transport Licence (ATL) and Air Operator Certificate (AOC) indefinitely, with effect from midnight of Wednesday, 20th July, 2022.\nAccording to the authority, the suspension was made pursuant to Section 35(2), 3(b) and (4) of the Civil Aviation Act, 2006 and Part 1.3.3.3(a)(1) of the Nigeria Civil Aviation Regulations (Nig.CARs), 2015.\nThe suspension order, handed down by the Director General, Captain Musa Nuhu, has since been communicated to the management of Dana Airlines.\nVanguard had reported that the company, stated that the suspension of its operations was due to the impact of the challenging operating environment on its daily operations.\nIf they suspend flight operations to concentrate on other aspects of their operations which includes non-schedule operations which are profitable, aircraft maintenance agency and the aircraft training school which is doing well, I must commend them for being bold on this.”"
  },
  {
    "headline": "Lawan calls for review of Curriculum in Colleges of Education to attract more enrollment",
    "summarized_story": "By Henry Umoru, ABUJATHE President of the Senate, Senator Ahmad Lawan has called on all relevant authorities to consider a review of the curriculum in the Colleges of education to attract more enrollment.\nLawan said: ” Today we are discussing how we can make our colleges of education more viable in terms of discharging their mandates and by making them to attract enrollment of more students and better students.\n“That places some burden on the Institutions because it means the Institutions must have to be creative and innovative on their internally generated revenues.\n“We will try to see how our colleges of education will attract students because when you go through the priority scale, most of our youths will indicate preference for University…That explains why the enrollment situation in colleges of education is bad because it’s usually the last resort.\n“We should have our colleges of education becoming top choice for our students."
  },
  {
    "headline": "I’m disturbed by killing of religious figures – Buhari mourns slain Kaduna Catholic priest, Cheitnum",
    "summarized_story": "President Muhammadu Buhari on Wednesday condemned the killing of a Catholic priest, Rev.\nThe Catholic Priest was murdered four days after gunmen abducted him.\nReacting to the incident in a statement by his Spokesman, Malam Garba Shehu, in Abuja on Wednesday, Buhari said he’s disturbed by murder of religious figure in the country.\nThe statement read: “I am deeply disturbed by the murder of this revered religious figure by outlaws who seem to be bent on creating chaos and disorder in the country.\nBuhari extended his condolences to the family of the late Catholic priest and the Christian Association of Nigeria leadership in Kaduna State."
  },
  {
    "headline": "Enugu youths celebrate Gov. Ugwuanyi’s achievements, back Senatorial bid",
    "summarized_story": "“Your Excellency, we thank you for all you have done for Enugu State and Nsukka people in particular.\nThis is just one of the numerous projects you did in Enugu, Nsukka, and for our people in the rural areas.\n“Since then, you have kept Enugu State peaceful and everything is moving on smoothly as if to say there is a magic you are doing.\nIt is not magic but because you entrusted Enugu State to the hands of God.\nRoads you have constructed in Enugu, Nsukka and rural areas are countless."
  },
  {
    "headline": "Yar’Adua’s son set to wed Borno lawmaker’s daughter in Maiduguri",
    "summarized_story": "The son of late President Umaru Musa Yar’Adua is set to Wed his heartthrob, Yacine on Saturday in Maiduguri, Borno State.\nOther members of the planning committee include a former Defence Minister, Alhaji Lawal Batagarawa as deputy chairman, and Rtd.\nBrigadier General Mustapha Dennis Onoyiveta, the ADC to the late President Yar’Adua as secretary.\nThe security sub-committee is chaired by Major General A.T. Ibrahim (rtd) with Mallam Yusuf Tilde, CSO to the late president, as deputy.\nThe women affairs sub-committee is chaired by Dr Salamatu Suleiman with Hon Aishatu Dukku as deputy, among other different subcommittees too numerous to mention."
  },
  {
    "headline": "2023: I’ll remain loyal, committed to you – Tinubu to Buhari",
    "summarized_story": "The presidential candidate of the All Progressives Congress, APC, Bola Ahmed Tinubu, has pledged to remain committed and loyal to President Muhammadu Buhari.\nTinubu spoke at the State House on Wednesday when he accompanied his running mate, Kashim Shettima to see the President shortly after he(Shettima) was unveiled by the leadership of the party on Wednesday.\nA statement signed by Garba Shehu, Spokesman to the President, said Tinubu pledged to remain “loyal and devoted” to the President.\nGarba Shehu said that in his remarks, Shettima thanked Buhari for his “empathy, support and positive role,” leading to his emergence as Running Mate to the APC presidential candidate.\nWe will remain eternally grateful.”"
  },
  {
    "headline": "Ex-Ekiti Deputy Governor’s mother dies, Fayemi mourns",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi has commiserated with the Famuagun family of Ado-Ekiti, over the death of their matriarch, Deaconess Grace Adetutu Famuagun, mother of the late former deputy Governor of the State, Mrs Funmilayo Adunni Olayinka.\nDeaconess Famuagun died on Tuesday, after a brief illness.\nHe described the deceased as a virtuous woman, a loving and caring mother who was always supportive of good causes.\nHe urged the children to be consoled by the fact the deceased lived well, touched many lives and left behind a legacy of honour.\nThis is not a time for mourning, it is a celebration of life well spent in the service of God and humanity.”"
  },
  {
    "headline": "Anxiety as revenue touts beat female customer to coma in Onitsha market The Nation Newspaper",
    "summarized_story": "Illegal revenue collectors suspected to be working for the caretaker committee of Ogbaru Main Market, Onitsha, Anambra State on Wednesday beat a female customer to coma for allegedly refusing to pay certain dues demanded from her.\nThe victim, simply identified as Mama Ifeoma, from Mbaitolu in Ikeduru Local Government Area of Imo State, was reportedly attacked for refusing to pay twice an amount demanded by the revenue collectors.\nShe said: “Problem started when she told the revenue collectors that she had already paid and will not pay another money.\n“The violence nature of these revenue touts is becoming worrisome and we are helpless right now.\nWhen contacted, Chairman of the Caretaker Committee, David Obidike dismissed the allegations, declining confirmation of existence of such revenue collectors and their activities in the market."
  },
  {
    "headline": "ASUU strike: NANS mobilises students to join NLC protest The Nation Newspaper",
    "summarized_story": "The National Association of Nigerian Students (NANS) has said it will partake in the nationwide protest by the Nigeria Labour Congress (NLC) over the prolonged strike by university workers scheduled for next week.\nThe association noted that it has commenced mobilisation of students across the country.\nSunday Asefon, directed all the subdivisions of the association to begin mobilisation to join the NLC in the protest.\n“I am pleased to inform all Nigerian students and her structures, SUG, JCC, ZONAL and National Executive Council to commence immediate mobilisation to partake in the rescue mission of NLC,” he wrote.\nThe statement said the take-off point for those in Abuja will be the secretariat of the NLC and the Labour House Abuja, saying the union hopes the efforts will yield the desired result."
  },
  {
    "headline": "D’banj opens up on being a security guard in London The Nation Newspaper",
    "summarized_story": "Nigerian star, Dapo Oyebanjo aka D’banj has opened up on his humble beginnings before fame.\nHe revealed that he had to take up a security job where he worked twelve hours overnight to make a living.\n“I know say I be star, na night shift I dey so in the morning, I still dey fresh but of course, I realise say you gat to work,” said D’banj.\n“At that time, the oyinbos no need to dey check you for CCTV, they know how to monitor you.\nThey formed MoHits records and signed five music acts before the end of the record label after their split as business partners."
  },
  {
    "headline": "Why we lost Osun election, by APC chairman The Nation Newspaper",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC) Senator Abdullahi Adamu explained why the party lost the July 16 Osun governorship election to the Peoples Democracy Party (PDP).\nAdemola Adeleke of the PDP defeated Governor Gboyega Oyetola of the ruling All Progressive Congress (APC).\nHe said: “We lost the race not because we are incapable but because of the crisis within.\nNo one could ever anticipate that we would lose the election.\n“Osun defeat doesn’t in any way mean that we will lose at the general election."
  },
  {
    "headline": "BREAKING: Buhari meets Shettima after unveiling The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has received All Progressives Congress (APC) presidential running mate Senator Kashim Shettima, almost immediately after he was unveiled on Wednesday.\nShettima was accompanied on the visit by Borno Governor Babagana Zulum.\nThe duo arrived the forecourt of President Buhari’s office at 3:40 pm.\nDetails of the meeting with President Buhari were unavailable as of the time of filing this report.\nDetails Shortly…"
  },
  {
    "headline": "Presidential election must win for APC –Tinubu",
    "summarized_story": "He hinged the desperation to win the presidential poll on the opportunity to reposition the country in agriculture, education, health and infrastructures.\n“In Northern Nigeria, there are credible candidates with rich credentials and with massive grassroots following that can complement the presidential ticket of the APC in the presidential elections.\nThe president expressed strong optimism that the APC ticket would emerge victorious in 2023.\nShetima thanked the president for his “empathy, support and positive role,” leading to his emergence as running mate to the APC Presidential Candidate.\nAccording to him, the 1993 MKO Abiola-Kingibe presidential ticket and the current Tinubu-Shettima ticket, bridged one of our fault lines in the management of our diversities."
  },
  {
    "headline": "NLC proposed solidarity protest with ASUU illegal –FG",
    "summarized_story": "However, the Federal Government, yesterday, claimed the planned protest was a plot by the NLC to create anarchy in the country describing it as illegal.\n“The NLC is not a political party; the NLC can go on strike or protest if the rights of NLC members are involved.\nNANS President, Sunday Asefon, in a statement, yesterday, directed all NANS structures across the country to mobilise and ensure that the NLC protest was a success.\nHe said NANS would mobilise students to the protest sites and would act based on directives by the NLC on the protest.\nHe said NANS structures across the country would submit to the leadership of NLC all through the protest."
  },
  {
    "headline": "Nationwide blackout as Nigeria’s electricity grid collapses again",
    "summarized_story": "By Adewale SanyaoluFor the sixth time in seven months, the Nigerian national electricity grid collapsed yet again yesterday, throwing major parts of the country into darkness.\nAs at 5.35pm yesterday, the grid system was yet to be restored.\nThe Eko Electricity Distribution Company in a notice on its official Twitter Handle confirmed that the grid collapse occurred at about 11:27 am.\nThe notice reads in part “Dear customers, we regret to inform you of a system collapse on the national grid at precisely 11:27 am today, Wednesday, July 20.\nThe last grid collapse the fifth in the series this year, occurred on June 13."
  },
  {
    "headline": "Osun guber: Adeleke, deputy receive certificate of return",
    "summarized_story": "From Lateef Dada, Osogbo and Ndubuisi Orji, AbujaOsun State Governor-elect, Senator Ademola Adeleke, and his deputy, Prince Kola Adewusi, yesterday, received their Certificate of Return from the Independent National Electoral Commission (INEC).\nHe commended the people of the state on the peaceful way and manner in which they conducted themselves during the election.\nAdeleke dedicated his victory to his late brother and first executive governor of the state, Senator Isiaka Adeleke, every indigene of the state, all his supporters, friends and families.\nOmooba Dotun Babayemi had sued the PDP, INEC and Senator Adeleke, claiming the authentic flag bearer of the party in the state governorship election.But, the appellate court dismissed the case on technical grounds.\n“The judgment is a firm confirmation that the Osun governorship primaries was transparently conducted by the Sen. Iyorchia Ayu-led National Working Committee (NWC)."
  },
  {
    "headline": "Gunmen abduct varsity student in Cross River",
    "summarized_story": "The Police command in Cross River has confirmed the abduction of a student of Arthur Jarvis University, Akpabuyo, near Calabar, the Cross River state capital.\nThe Police Public Relations Officer (PPRO) in the state, DSP Irene Ugbo, confirmed the incident in a telephone interview with the News Agency Nigeria (NAN) yesterday, in Calabar.\nThe students were reportedly returning to their hostels from where they had gone to read when gunmen accosted them at about 8pm, on Tuesday.\nWhile one of the students was seized by the gunmen, others, who ran for their lives, sustained various degrees of injury.\nActing Registrar of the university, Mrs Ngozi Ughas, said, in a statement, that the school management was on top of the incident."
  },
  {
    "headline": "Verve International Welcomes Cinetpay into Its Network – THISDAYLIVE",
    "summarized_story": "Nosa AlekhuogieAfrica’s payment technology and card business, Verve International has welcomed its first francophone e-commerce and merchant aggregator, CinetPay into the Verve ecosystem.\nSpeaking about the partnership, the Chief Executive Officer of Verve International, Vincent Ogbunude, said: “We are pleased to welcome CinetPay to the Verve network – the next in a series of strategic African FinTech partners we are welcoming into our network.\nAs the leading pan-African payment scheme, our focus remains to rapidly expand and deepen our network by partnering with FinTech companies, switches, processors, banks, merchant aggregators, and regulators.\nCinetPay is one of such partners and we look forward to deepening our impact through this mutually beneficial partnership.”CEO and Co-founder of CinetPay said, Idriss Marcial Monthe, said: ‘’We are pleased with this partnership with Verve International which will broaden the payment collection choices for our merchants.\nThis partnership brings us closer to our ambition, known to all and which is to offer the best online payment experience in Africa through simple, fast and secure transactions.’’"
  },
  {
    "headline": "9PSB, Seerbit Partner to Enhance Financial Service Offerings – THISDAYLIVE",
    "summarized_story": "9Payment Service Bank (9PSB) and SeerBit, a pan-African enterprise payment platform, have entered into a strategic partnership that will facilitate seamless access to financial services for individuals and businesses in Nigeria.\n9PSB and SeerBit will co-create a seamless payment and omnichannel banking ecosystem that aggregates and simplifies transactions for banking agents, merchants, end consumers, and businesses.\nThe partnership creates a unique opportunity to deploy a home-grown solution that sets out a roadmap for the digitisation of payments and enables the ecosystem for closing the financial exclusion gap.\nSpeaking on the partnership, CEO of 9PSB, Branka Mracajac, said 9PSB remained committed to building a strong financial ecosystem that is driven by collaboration.\nShe said, “The core of our business is to provide easy, convenient, and seamless financial transactions to the unbanked, under-banked, and under-served."
  },
  {
    "headline": "Teesas Empowers Ophanage Children with Education Tabs – THISDAYLIVE",
    "summarized_story": "Nosa AlekhuogieEdTech start-up Teesas has empowered the children of Little Saint’s Orphanage (Abule Egba Home) in Lagos with education tablets.\nThe empowerment initiative is in line with Teesas’ Donate Programme, which was launched to support underprivileged and out-of-school children in attaining academic excellence.\nThis represents a significant increase in the number of out-of-school children when compared to the 10.5 million estimated by UNICEF in 2021.\n“We believe that our educational app is Africa’s learning gateway because it opens up opportunities for learning by children anywhere.\nMrs. George stated that the Teesas Donate Program was appropriately timed as the orphanage home had just equipped its library with computers to facilitate digital learning among the children."
  },
  {
    "headline": "Expert Calls for Regulatory Polices to Protect Smaller Telecom Operators – THISDAYLIVE",
    "summarized_story": "Emma OkonjiAyoola Oke, a former Special Assistant to the former Chief Executive Officer of the Nigerian Communications Commission (NCC) Dr. Ernest Ndukwe, has raised the alarm that over 90 per cent of home grown telecom operators may go into extinction within the next five years, if appropriate measures are not put in place.\nHe therefore called for strict regulatory policies that would protect smaller and home grown telecom operators from going into extinction.\nOke, an Information and Communications (ICT) Legal and Regulatory expert, spoke to newsmen in Lagos recently, about the issues affecting local telecom operators and raised the issue of how the bigger telecom operators are driving smaller operators out of business, insisting that should such development continued unabated, it might likely force smaller telecom operators out of business in the next five years.\nOke described the industry as sub-divided into three tiers: Tier 1, Tier 2 and Tier 3.\nThe Former Special Assistant cited the instance of bigger operators asking smaller operators to pay for termination rate in dollars rather than the country’s legal tender which is the naira and consequently leading to their disconnection."
  },
  {
    "headline": "Report: Nigerian Economy Reaping Benefits of Real-time, Digital Banking Transformation – THISDAYLIVE",
    "summarized_story": "ACI Worldwide is a global leader in mission-critical, real-time payments software.\nThe report, which tracks real-time payments volumes and growth across 53 countries, includes an economic impact study for the first time, providing a comprehensive view of the economic benefits of real-time payments for consumers, businesses, and the broader economy across 30 countries.\nThe report reveals Nigeria as Africa’s undisputed real-time and digital payments leader, adding that Nigeria recorded 3.7 billion real-time transactions in 2021, ranking 6th in the league table of the world’s most developed real-time payments markets, behind India, China, Thailand, Brazil,and South Korea.\nThese innovative products include single-issuing platforms for all payment types, digital payment acceptance for acquirers, enterprise payment platforms and secure omni channel payment processing platforms, among others.\nManaging Director, Digital Infrastructure and Managed Services, Interswitch Systegra, Mr.Jonah Adams, said: “As more Nigerians continue to adopt real-time and digital payments, we have seen a commensurate increase in the need for backend infrastructure that enable these transactions."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Our Members Still In Nigerian Government’s Detention, We Don't Forget You – ISWAP Mulls Impending Attacks",
    "summarized_story": "The Islamic State in West Africa Province (ISWAP) has vowed to attack more prisons in Nigeria after claiming responsibility for the recent Kuje Prison attack in Abuja where over 800 inmates were released.\nA song in Hausa had preceded the sermon in which the singing group chorusing, “Let’s come together and defeat the infidels who worship the false deities.\nAnd for those still in detention, we have not, and we would never forget about you as long as we are alive.\n“You should know that there’d be a repeat of the Kuje incident when you can see the jihadists chanting ‘Allahu Akbar’ over your head, to free you from your enemies.\nAs Allah said in the Quran: “And the best outcome is for the righteous.”"
  },
  {
    "headline": "Our Members Still In Nigerian Government’s Detention, We Don't Forget You – ISWAP Mulls Impending Attacks",
    "summarized_story": "The Islamic State in West Africa Province (ISWAP) has vowed to attack more prisons in Nigeria after claiming responsibility for the recent Kuje Prison attack in Abuja where over 800 inmates were released.\nA song in Hausa had preceded the sermon in which the singing group chorusing, “Let’s come together and defeat the infidels who worship the false deities.\nAnd for those still in detention, we have not, and we would never forget about you as long as we are alive.\n“You should know that there’d be a repeat of the Kuje incident when you can see the jihadists chanting ‘Allahu Akbar’ over your head, to free you from your enemies.\nAs Allah said in the Quran: “And the best outcome is for the righteous.”"
  },
  {
    "headline": "NCAA suspends Dana Air over 'inability to conduct safe flight operations'",
    "summarized_story": "The Nigerian Civil Aviation Authority (NCAA) says it has suspended Dana Airlines’ air transport licence (ATL) and air operator certificate (AOC) indefinitely.\nThe authority said it suspended the operating licences after “discovering that the airline is no longer in a position to meet its financial obligations and to conduct safe flight operations”.\n“The suspension was made pursuant to Section 35(2), 3(b), and (4) of the Civil Aviation Act, 2006 and Part 1.3.3.3(a)(1) of the Nigeria Civil Aviation Regulations ( http:// Nig.CARs ), 2015.\nIn May, over 50 passengers were rescued when fire gutted the tyres of an aircraft operated by Dana Air in Port Harcourt.\nAdvertisement In 2012, the federal government also grounded Dana Air after its passenger plane carrying 153 people crashed in Lagos."
  },
  {
    "headline": "NCAA suspends Dana Air over 'inability to conduct safe flight operations'",
    "summarized_story": "The Nigerian Civil Aviation Authority (NCAA) says it has suspended Dana Airlines’ air transport licence (ATL) and air operator certificate (AOC) indefinitely.\nThe authority said it suspended the operating licences after “discovering that the airline is no longer in a position to meet its financial obligations and to conduct safe flight operations”.\n“The suspension was made pursuant to Section 35(2), 3(b), and (4) of the Civil Aviation Act, 2006 and Part 1.3.3.3(a)(1) of the Nigeria Civil Aviation Regulations ( http:// Nig.CARs ), 2015.\nIn May, over 50 passengers were rescued when fire gutted the tyres of an aircraft operated by Dana Air in Port Harcourt.\nAdvertisement In 2012, the federal government also grounded Dana Air after its passenger plane carrying 153 people crashed in Lagos."
  },
  {
    "headline": "'Nollywood movie' -- CAN accuses APC of inviting 'dubious' clerics to Shettima unveiling",
    "summarized_story": "The Christian Association of Nigeria (CAN) has disowned the “clerics” present at the unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC).\nThe unveiling ceremony took place on Wednesday at the Shehu Musa Yar’Adua centre in Abuja.\nBola Tinubu, APC presidential candidate and a Muslim from the south-west, had, on July 10, announced Shettima, a Muslim from the north-east, as his running mate.\nHowever, Joseph Hayab, Kaduna CAN chairman, said the outfit of some of the supposed clerics looked like something from a Nollywood movie.\n“Because of desperation, the newly-robed bishops took the shine off the occasion, more than the candidate that was unveiled."
  },
  {
    "headline": "'Nollywood movie' -- CAN accuses APC of inviting 'dubious' clerics to Shettima unveiling",
    "summarized_story": "The Christian Association of Nigeria (CAN) has disowned the “clerics” present at the unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC).\nThe unveiling ceremony took place on Wednesday at the Shehu Musa Yar’Adua centre in Abuja.\nBola Tinubu, APC presidential candidate and a Muslim from the south-west, had, on July 10, announced Shettima, a Muslim from the north-east, as his running mate.\nHowever, Joseph Hayab, Kaduna CAN chairman, said the outfit of some of the supposed clerics looked like something from a Nollywood movie.\n“Because of desperation, the newly-robed bishops took the shine off the occasion, more than the candidate that was unveiled."
  },
  {
    "headline": "'Fake bishops' -- outrage as 'clerics' attend unveiling of Shettima as APC VP candidate",
    "summarized_story": "The presence of men clad in clergy robes at the unveiling ceremony of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) has elicited outrage on social media.\n#Staged #davidhundeyin pic.twitter.com/Psb7Opmnr9 — Daddy (@NwokeMbaise22) July 20, 2022 AdvertisementKamoru has been identified as a fake Bishop Peter Okoye.\nThey went as far as hiring hoodlums and thugs to pose as bishops and priests😭🤣😂 I fear who still they support APC OOOO.\nThose guys are shameless#BATSHET2023 #staged #davidhundeyin #adeboye #APC — Belinda Uju (@belindauju) July 20, 2022my own anger is that they hired malnourished-looking men to act as the Unknown bishops.\n💔💔 #Staged — FoodDoctor (@FoodDoctorPro) July 20, 2022"
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "Hannah Subayi believes the gap between Anglophone and Francophone African startups is reducing",
    "summarized_story": "As you know anglophone Africa tends to be a bit more advanced than Arab-speaking and francophone Africa.\nHowever, we cannot deny that the operational environment remains a bit tougher to some extent in francophone Africa.\nWe see more anglophone African investors trying to invest in francophone Africa.\nHS: Historically, francophone Africa, just by virtue of the language, mainly only looked to France for funding and expansion.\nIf you look at francophone African startups, they are incorporated in Paris but that’s not any different from other startups that are incorporated in Delaware."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Inside Kenya's messy money laundering grapple with fintechs",
    "summarized_story": "It also stated that both companies were linked to Flutterwave and the related companies it accused of money laundering.\nWhile financial services institutions have strict regulations, money laundering still drains an average of $1.6 trillion annually from the global economy.\nKenya’s Proceeds of Crime and Anti-Money Laundering Act (POCAMLA) 2009 contains comprehensive guidelines for guarding against money laundering processes and other significant financial crimes.\n“If a licensed company in Nigeria sends a certain sum of money to a Kenyan account, the initial reactions shouldn’t be money laundering.\nAccording to our source, the ARA’s approach has created room for extortion of the respective sources, even though no clear case of money laundering has beyond money entering an account."
  },
  {
    "headline": "Edo Assembly repeals 1972 Rural Electricity Board Law, passes bill to liberalise electricity market – Nigerian Observer",
    "summarized_story": "The Assembly unanimously adopted all six parts of the bill during a session of the committee of the whole on Tuesday, July 19, 2022.\nMarcus Onobun, directed the Assembly Clerk to forward clean copies of the bill for assent to Governor Godwin Obaseki.\nThe passed bill provides for the liberalization of the electricity market in the state, allowing for a more pragmatic approach to rural electrification and expansion of distribution infrastructure in the state.\nIn the new regime, electricity providers in the state with Generation License, Independent Electricity Distribution Network License and Eligible Customer (willing buyer-willing seller) approval from the Nigerian Electricity Regulatory Commission (NERC) would reap the full benefit of a liberalized electricity market.\nWe will have a lot more certainty in the market as there is a state-level regulation for power operations."
  },
  {
    "headline": "Edo govt denounces dubious coalition, fingers displaced politicians for spreading lies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has denounced a phantom social group, Coalition of Benin Social Cultural Organisations, noting that displaced Edo politicians are hiding behind the group to spread lies against the government.\nIn a statement, Special Adviser, Media Projects, Crusoe Osagie, said the Coalition of Benin Social Cultural Organisations is not known to law by any means.\n“The long list of empty allegations are merely the tired lies employed unsuccessfully by the Edo Peoples Movement (EPM) and the comatose All Progressives Congress (APC) in Edo State just before the September 19, 2020 elections, which Edo people saw for what they actually are: cheap blackmail.\n“As for each and every point made in their copious allegations, they are all complete lies, which are not even intelligently told.\nWe call on all Edo people and Nigerians to completely ignore them.”Share this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Obaseki to present executive bill establishing new town devt agency, others to Edo Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has approved the sending of the bill to establish the Edo State New Town Development Agency to the Edo State House of Assembly for consideration and passage.\nThe Edo State Commissioner for Orientation and Communication, Hon.\nHe said the governor also directed that the bill to repeal and reenact the Edo State Physical Planning, Urban and Regional Development be sent to the Assembly.\n“Also, the Edo State New Town Development Agency Bill is to be presented by the Attorney General for consideration by the Edo State Executive Council and consequent transmission to Edo State House of Assembly.”In his contribution, the Commissioner for Environment and Sustainability, Hon.\nJonathan Lawani, said the Governor also directed Heads of Local Governments to prioritize sanitation and cleanliness in the local councils."
  },
  {
    "headline": "Edo pledges responsive health system, urges citizens’ ownership of reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Commissioner for Health, Prof. Obehi Akoria, has reiterated the Governor Godwin Obaseki-led administration’s commitment to decentralizing the health care system and strengthening the sector to bring quality healthcare closer to residents in Edo State.\nProf. Akoria, who stated this while addressing journalists, noted that enrolments into the Edo Health Insurance Scheme (EDHIC) are ongoing, with a goal of reducing the burden of Out-of-Pocket Spending (OOPS) on healthcare, so that no resident is unable to access basic healthcare at the point of need.\nShe emphasized the importance of healthcare financing in achieving sustainable development and economic growth in the state, and called for citizen ownership of ongoing healthcare reforms.\nThe medical professional said, “We need synergy between Edo residents and Government to achieve the improvements in healthcare quality that we all desire”.\nShare this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Industry leaders identify path to Nigeria’s economic revival at Zenith Bank International Trade Seminar",
    "summarized_story": "Speaking on the origin of the Zenith Bank Annual International Trade Seminar, Onyeagwu said that the commodity price slump of 2014-2016 was a watershed moment.\nHighlighting some of the salient outcomes of the past six Zenith Bank Annual International Trade Seminar editions, Onyeagwu noted that previous editions’ outcomes have found expression and influenced policy initiatives.\nHe noted that Zenith Bank will continue the advocacy of promoting non-oil export.\nIn his words: “This is why the theme of this year’s seminar ‘Unlocking Opportunities in Nigeria’s Non-Oil Export Business’ is timely and appropriate.\nThe bank launched the Non-Oil Export Seminar in 2017 as an initiative to deepen the discourse on promoting the non-oil export business in Nigeria."
  },
  {
    "headline": "Smugglers can make up to N4m from one petrol tanker – Dr Ihetu",
    "summarized_story": "Dr. Godswill Ihetu, a former Managing Director/Chief Executive Officer, Nigeria LNG Limited, has noted that the commercialisation of NNPC won’t resolve the problem of smuggling of petroleum products so long as subsidy remains.\nIhetu who spoke on Arise TV Morning Show on Wednesday, noted that the huge profit margin made by smugglers is a huge incentive driving the illicit business in the country.\n“The point is petrol is significantly cheaper in Nigeria.\nWhat it means is that 33000 litre tanker taken across the border can give you over N4 million profit.\nThe field has been opened for both NNPC and others to import and create competition in the market.”"
  },
  {
    "headline": "Prison inmates may also vote in 2023 – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has noted that inmates in Nigeria Correctional Centres might vote during the 2023 general election.\nINEC chairman, Prof. Mahmood Yakubu, gave the hint on Tuesday when he received the Comptroller-General of the Nigeria Correctional Service, Haliru Nababa, and his team at the commission’s headquarters in Abuja.\nThe INEC chairman noted that the commission was committed to inclusivity, including the rights of inmates to vote during elections.\nHe pointed out that inmates’ voting rights have been recognised by Kenya and South Africa on the African continent, and Nigeria was ready to toe a similar path.\nHe stressed the need to address the issues militating against inmates’ voting as soon as possible, as he pointed out that the 2023 general election was seven months away."
  },
  {
    "headline": "Police don’t have right to search people’s phones – Force PPRO",
    "summarized_story": "Olamuyiwa Adejobi, the Nigerian Police Public Relations Officer has noted that men of the force have no right to search people’s phones unless such phone is an exhibit.\nAdejobi made this disclosure in a tweet on Wednesday in response to a tweep who wanted to know if the police had such powers.\nHe wrote in his response, “No policeman has the right to check ones phone anywhere except the phone is an exhibit in a case under investigation and that phone must have been marked exhibit.\nAny policeman who does that is not a policeman, but rather a scavenger.”"
  },
  {
    "headline": "Nigeria’s Calvin Bassey completes move to Ajax from Rangers for €23m",
    "summarized_story": "Nigeria’s Super Eagles defender, Calvin Bassey, has completed his transfer from Rangers FC to Dutch side, Ajax FC for €23 million.\nThe transfer fee is expected to rise to €26.5 million when other deal variables are added.\n“Ajax has reached an agreement with Rangers FC and Calvin Bassey for the transfer of the defender to Amsterdam,” the statement reads.\nAjax will pay a transfer fee of EUR 23 million to Rangers FC.\nThe Nigerian international was under contract with Rangers FC until mid-2024.”Although he is eligible to represent both England and Italy, Bassey chose Nigeria due to his parental heritage."
  },
  {
    "headline": "Kotu Ta Tabbatar Da Adeleke A Matsayin Dan Takarar PDP Na Asali",
    "summarized_story": ""
  },
  {
    "headline": "An Shirya Taron Farko Na Karamin Kwamitin Aikin Gona Na Kwamitin Gwamnatocin Kasashen Sin Da Najeriya",
    "summarized_story": ""
  },
  {
    "headline": "APC Ta Gabatar Da Shettima A Matsayin Abokin Takarar Tinubu",
    "summarized_story": ""
  },
  {
    "headline": "INEC Ta Mayar Wa Davido Martani Kan Bai Wa Adeleke Takardar Shaidar Lashe Zabe",
    "summarized_story": ""
  },
  {
    "headline": "NEMA Ta Raba Tallafi Ga ‘Yan Hijira 24,000 A Katsina",
    "summarized_story": ""
  },
  {
    "headline": "NCAA suspends Dana Air operations indefinitely – P.M. News",
    "summarized_story": "By Yunus YusufThe Nigerian Civil Aviation Authority (NCAA) has suspended Dana Airlines’ Air Transport Licence (ATL) and Air Operator Certificate (AOC) indefinitely, with effect from midnight of Wednesday, July 20, 2022.\nThe statement said that the suspension was made pursuant to Section 35(2), 3(b) and (4) of the Civil Aviation Act, 2006 and Part 1.3.3.3(a)(1) of the Nigeria Civil Aviation Regulations (Nig.CARs), 2015.\nIt said that the suspension order, handed down by Nuhu, has since been communicated to the management of Dana Airlines.\nIt said that these revealed that Dana Airlines was no longer in a position to meet its financial obligations and to conduct safe flight operations.\n“The Nigerian Civil Aviation Authority (NCAA) have also been briefed on the incident,” he had said."
  },
  {
    "headline": "Sanwo-Olu re-launches Lagos Residency card with smart features – P.M. News",
    "summarized_story": "The move by Lagos State Government to generate a comprehensive database of all persons residing in the State has moved a notch higher, with the launch of an upgraded and chip-embedded smart residency card by the Lagos State Residents Registration Agency (LASRRA), on Wednesday.\nGovernor Babajide Sanwo-Olu personally unveiled the smart residency card at launching events held simultaneously across five locations in the State.\nThis new residency ID, according to LASRRA, is a multipurpose smart card with 28 applets that make the provision of 28 services possible to the cardholders.\nIbilola Kasunmu, said the State could not afford to lag behind in the age of global digitalisation, thereby making the transition to smart residency card compelling.\nThe high point was the symbolic presentation of the smart residency cards to the Governor and residents freshly registered by LASRRA."
  },
  {
    "headline": "BREAKING: Buhari meets Shettima after unveiling",
    "summarized_story": "President Muhammadu Buhari has received All Progressives Congress (APC) presidential running mate Senator Kashim Shettima, almost immediately after he was unveiled on Wednesday.\nShettima was accompanied on the visit by Borno Governor Babagana Zulum.\nThe duo arrived the forecourt of President Buhari’s office at 3:40 pm.\nDetails of the meeting with President Buhari were unavailable as of the time of filing this report.\nDetails Shortly…"
  },
  {
    "headline": "Breaking: Coalition of Bishops, Pastors storm Shettima’s unveiling as Tinubu’s running mate",
    "summarized_story": "Contrary to the position of the Christian Association of Nigeria (CAN), a coalition of Bishops and some pastors were seen at the Musa Yar’adu centre, venue of the official unveiling of Senator Kashim Shettima as the vice presidential candidate of the ruling All Progressives Congress (APC).\nThe Bishops in their numbers were seen dressed in their cassock.\nRecall that, CAN had rejected the Muslim-Muslim ticket of the APC when it issued an official statement against the selection of Kashim Shettima as the running mate to Bola Ahmed Tinubu.\nOne of the Bishops who pleaded anonymity told News Direct that they were at the event to declare their support for the Tinubu-Shettima presidential ticket.\nThe Presidential candidate of the party, Bola Ahmed Tinubu, the leadership of the APC led by Senator Abdullahi Adamu and several other party leaders also attended the event."
  },
  {
    "headline": "BREAKING: Magnus Abe Dumps APC, Backs Tinubu’s Ambition",
    "summarized_story": "Senator Magnus Abe, a former member of the National Assembly who represented Rivers South-East Senatorial District, has left the APC in Rivers State.\nHowever, Abe promised his continuing support for Bola Tinubu’s presidential campaign in a statement released on Wednesday afternoon and signed by his spokesman, Parry Benson.\nThe statement quoted Abe as saying, “I have since left the APC in Rivers State, I am still part of Asiwaju Bola Ahmed Tinubu’s family and has no issue with him whatsoever.”Details later…"
  },
  {
    "headline": "JUST IN: National Grid Collapses Again",
    "summarized_story": "The Eko Electricity Distribution Company confirmed that the grid collapse occurred at about 11:27 am.\n“Dear Customers, we regret to inform you of a system collapse on the National grid at precisely 11:27 am today, Wednesday, July 20.\nWe are in talks with the Transmission Company of Nigeria to ascertain the cause of the collapse and a possible restoration timeline,” the Disco company said via its Twitter handle on Wednesday.\nDetails later…"
  },
  {
    "headline": "Presidency: 2023 a must win election – Tinubu",
    "summarized_story": "The Christian body Tuesday issued an official statement to reject any political party that settled for a Muslim-Muslim ticket.\nSpeaking newsmen, one of the clerics who identified himself as Bishop Oguba said he was not aware CAN had taken any position on the Muslim-Muslim ticket.\nAs far as I am concerned, the body of Christ is not a political party.\n“The clergies should be concerned about the security of the country not the same faith ticket by any political party.\nThe party must not be perceived as promoting a religious agenda by fielding a Muslim-Muslim ticket."
  },
  {
    "headline": "ASUU: NLC’s planned solidarity protest illegal, invitation to anarchy – FG",
    "summarized_story": "The federal government Wednesday said the planned street protest by the Nigeria Labour Congress (NLC) in solidarity with the striking members of the Academic Staff Union of Universities (ASUU) is illegal.\nThe NLC can go on strike or protest if the rights of NLC members are involved.\nWell yes, there’s a dispute between some members of NLC, ASUU and the federal government which is being looked into.\nSo, calling out people on street protest you begin to wonder, what is the motive of NLC in this matter?\n“They are parts of the tripartite agreement that have been negotiating with federal government on this ASUU issue."
  },
  {
    "headline": "Breaking: Another serving Senator dumps PDP",
    "summarized_story": "Senator Bassey Albert Akpan, representing Akwa-Ibom North East Senatorial District, has resigned his membership of the People’s Democratic Party (PDP).\nHis resignation as a member of the PDP was contained in a letter dated July 15, 2022.\nSenator Akpan, who chairs the Committee on Petroleum Resources (Upstream), informed the upper chamber of his decision to join the Young Progressives Party (YPP).\nBassey’s defection to the YPP brings the number of serving Senators in the party to two.\n“As a result of the foregoing, I resigned my membership of the PDP and now joined the Young Progressives Party (YPP) which now becomes my new party."
  },
  {
    "headline": "Bayelsa Govt Clears Air On State Of Its Airport",
    "summarized_story": "… Says Bayelsa Airport Is Not DowngradedBy Eunice Nnachi, YenagoaThe Bayelsa State Government has made a clarification that the state-owned international airport had not been downgraded, as being insinuated in some quarters.\nThe Deputy Governor, Senator Lawrence Ewhrudjakpo, gave the clarification on Wednesday when the Federated Correspondents Chapel of the Nigeria Union of Journalists, Bayelsa State Council, paid him a courtesy call in Government House, Yenagoa.\nAccording to the Deputy Governor, the D-Check is a major maintenance check to determine the air-worthiness of an aircraft after it had made commercial flights for a period of 10 years.\nI know that you are going to ask us what is happening to the Bayelsa International Airport.\nThe Bayelsa Airport has not been downgraded."
  },
  {
    "headline": "IYC leadership enroll 301 youths in ICT scheme",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Ijaw Youths worldwide, the Ijaw Youths Council (IYC) on Tuesday marked its second year in office, with the enrollment of 301 youths from ijaw communities into Information and communications technology (ICT) scheme.\nThe First batch of benefiting 60 youths are expected to be trained in Computer programming, coding and appreciation and handed starter packs at the end of the training scheme.\nIn his speech, the initiator of the ICT Scheme and National Spokesman of the Ijaw Youths Council (IYC), Comrade Ebilade Ekerefe, said the scheme was initiated to change the narrative of the ijaw youths worldwide rather than adopting repeated combatant approach which has yielded less results.\nYou know a lot of people misunderstand the Ijaw youths Council.\nThe Ijaw youths Council itself was founded to propel economic development of the Ijaw nation, which meant that we need to educate our people”."
  },
  {
    "headline": "NDDC launches talent hunt in Niger Delta to address youth unemployment",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Niger Delta Development Commission, (NDDC) has launched a novel Niger Delta Talent Hunt (NIDETH) to harness creativity among youths in the entertainment industry and address unemployment in the Niger Delta region.\nDr. Akwa commended President Muhammadu Buhari and the Minister of Niger Delta Affairs, Mr. Umana Okon Umana, for supporting activities aimed at harnessing the creative potential of youths in the Niger Delta.\nUdengs Eradiri, described the Niger Delta youths as enterprising, observing that artistes from the region had challenges of getting support and platforms to express themselves.\n“The Niger Delta youths need to be a part of these opportunities.\nHe said that 80 per cent of the entertainment industry was rooted in the Niger Delta."
  },
  {
    "headline": "FG approves N7.5bn for irrigation, airports surveillance equipment",
    "summarized_story": "By Mathew Dadiya, AbujaThe Federal Executive Council (FEC), on Wednesday, approved contracts worth N7,499,603,500 for an irrigation project augmentation in Adamawa State and surveillance equipment for two airports in the country.\nAddressing correspondents, at the post-FEC briefing Minister of Aviation, Senator Hadi Sirika, disclosed that Council approved contracts worth N1,499,603,500 for the award of contract for surveillance equipment for two airports in the country.\nThe benefiting airports, according to the minister, are those of Kaduna and Port Harcourt in Kaduna and Rivers States.\nSirika also disclosed that the council approved that Nigeria enters into a Bilateral Air Service Agreement (BASA) with Canada.\nAlso, the Minister of Water Resources, Sulieman Adamu, said that Council approved the augmentation of N6 billion for the Chochi irrigation project in Adamawa State."
  },
  {
    "headline": "Airline Operators Condemn Closure of Lagos Airport Runway",
    "summarized_story": "By Naomi Douglas…Call for solution to JetA1, forex scarcity to avoid shutdownAirline Operators of Nigeria AON, has lamented the closure of Runway by Federal Airports Authority of Nigeria FAAN, for 90 days.\nIn a statement signed on Wednesday by AON spokesperson, Professor Obiora Okonkwo said the action will further worsen the crisis facing Nigeria’s aviation industry.\nOkonkwo urged federal government to quickly provide solutions to aviation fuel, foreign exchange scarcity to avoid total shutdown, collapse of the sector.\n“The closure of the main domestic runway of MMA automatically adds an additional 10-15% more fuel costs per sector into and out of the domestic airport in Lagos, based on theadditional flight and taxi time incurred as a result.\nThe airlines have already felt these additional costs within the first week of the closure of the runway."
  },
  {
    "headline": "UPDATED: NCAA Suspends Dana Air Operations Indefinitely",
    "summarized_story": "The Nigerian Civil Aviation Authority (NCAA) has suspended Dana Airlines’ Air Transport Licence (ATL) and Air Operator Certificate (AOC), indefinitely.\nHe stated that the suspension of the operations of the airlines would take effect from midnight of July 20.\nAccording to him, the suspension order has since been communicated to the management of Dana Airlines.\nDwindling Options For PassengersThe suspension of Dana Air operations adds to the woes and challenges bedevilling the aviation industry.\nOn Monday, Aero Contractors announced the temporary suspension of its “scheduled passenger services operations”."
  },
  {
    "headline": "Slain Kaduna Priest: Security Chiefs Won’t Rest Until Nigeria Is Safe – Buhari",
    "summarized_story": "President Muhammadu Buhari has condemned the murder of a Catholic priest, Reverend Father John Cheitnum of the Kafanchan Catholic Diocese, four days after he was seized by gunmen in Kaduna State.\n[READ ALSO] Abducted Kaduna Priests: One Killed, One FreedAmong several of such attacks was the abduction of Reverend Father John Cheitnum and Reverend Father Donatus Cleopas last Friday in Jere Local Government Area (LGA) of Kaduna State.\nTheir abduction came barely two weeks after another priest, Reverend Father Emmanuel Silas, was kidnapped by bandits from the parish rectory of Saint Charles Catholic Church, Zamina in Kauru LGA.\nReverend Father Cleopas, on his part, was said to have been released by the bandits after an undisclosed amount of money was paid to them as ransom.\n“I’m not allowing the security chiefs to rest unless and until we find a very effective solution to this disturbing security situation."
  },
  {
    "headline": "APC Unveils Kashim Shettima As Vice-Presidential Candidate",
    "summarized_story": "The All Progressives Congress (APC) has unveiled former Borno State Governor, Senator Kashim Shettima as its vice presidential candidate for the 2023 general elections.\nThe event, which is ongoing at the Shehu Yar’adua center in Abuja, has in attendance the party’s presidential candidate and ex-Lagos State Governor, Bola Tinubu, APC National Chairman, Abdullahi Adamu, and other chieftains.\nREAD ALSO: APC To Officially Unveil Vice Presidential Candidate Shettima On WednesdayIn his remark, Adamu described the APC presidential candidate as a detribalized Nigerian who has carried everyone along irrespective of their ethnic and political differences.\nExtolling the virtues of the ex-Lagos State Governor, the APC Chairman said Tinubu can be trusted to run an all-inclusive government if elected as President in the 2023 general elections.\nThe ex-Lagos State governor also hinged his choice of Shettima for his loyalty to the ruling party."
  },
  {
    "headline": "Osun Governor-Elect Adeleke Receives Certificate Of Return",
    "summarized_story": "The Governor-elect of Osun State, Ademola Adeleke, was presented his certificate of return by the Independent National Electoral Commission on Wednesday.\nHis presentation comes almost 72 hours after defeating the incumbent governor Adegboyega Oyetola of the All Progressives Congress, with 403, 371 votes compared to Oyetola’s 375,027 votes on Saturday’s poll.\n,Adeleke’s certificate of return was presented by the INEC National Commissioner, Supervising Osun, Ogun, and Oyo states, Prof. Kunle Ajayi,The deputy governor-elect, Prince Kola Adewusi also received his at the ceremony.\nIn his acceptance speech at the Osun INEC head office in Osogbo, Adeleke dedicated his victory to the memory of his late elder brother, Senator Isiaka Adeleke, and the people of the Osun state.\nSee more photos below:"
  },
  {
    "headline": "Kyari Narrates Experience During Kuje Prison Attack, To Know Fate On Bail Application August 30",
    "summarized_story": "The suspended Deputy Commissioner of Police (DCP), Abba Kyari, has narrated his experience during the attack on the Medium Security Correctional Centre, Kuje in Abuja by a group of terrorists.\nAddressing the court through his counsel, Onyechi Ikpeazu, Kyari said he hid himself like a rat away from the insurgents.\nAs a result, the suspended police officer asked the court to grant his fresh application for bail.\nMeanwhile, the court has admitted in evidence over $61,000 which Kyari allegedly offered the NDLEA as a bribe.\nAfter listening to the counsels, Justice Nwite adjourned the case until August 30 for the ruling on Kyari’s fresh application for bail."
  },
  {
    "headline": "𝗔𝗸𝗶𝗻𝗹𝗮𝗱𝗲, 𝗖𝗵𝗶𝗲𝗳 𝗗𝗮𝗱𝗮 𝗺𝗲𝗲𝘁 𝗢𝗴𝘂𝗻 𝗪𝗲𝘀𝘁 𝗣𝗗𝗣 l𝗲𝗮𝗱𝗲𝗿𝘀",
    "summarized_story": "The Deputy Governorship Candidate of the People’s Democratic Party, Adekunle Akinlade on Tuesday met with the leadership of the party in Ogun West, at the private residence of Chief Alani Akinde, in Ota.\nThis is in line with the spirited campaign for the restoration of a people-centered government and adequate security in Ogun State."
  },
  {
    "headline": "APC to unveil Shettima as Tinubu's running mate on Wednesday -",
    "summarized_story": "The All Progressives Congress (APC) will formally unveil its Vice Presidential Candidate, Senator Kashim Shettima, to the Nigerian public on Wednesday, 20th July.\nThe event which will start at 11am prompt will hold at the Shehu Musa Yar’Adua Centre, Abuja.\nAdvertisementIn a statement signed by the party’s Organising secretary, Sulaiman Muhammad Argungu, all members of the National Executive Committee (NEC), members of the Progressives Governors’ Forum, members of APC Caucus in the National Assembly, members of the Federal Executive Council (FEC) are to attend.\nOther are members of the Diplomatic Corps, Presidential Aspirants at the June 2022 Special National Convention, APC State Chairmen, APC State Secretaries and APC State Organising Secretaries.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Oyebanji seeks Ekiti stakeholders' cooperation as he begins thank you tour of LGAs -",
    "summarized_story": "Ekiti State Governor-elect, Biodun Abayomi Oyebanji, has said he would run an inclusive government and give equal opportunity to all Ekiti indigenes, regardless of political leanings and background.\nOyebanji stated this on Monday during his ‘thank you tour’ in Ikole, Oye and Ilejemeje local government areas, where he met traditional rulers, party leaders and other stakeholders and shared some of his plans and programmes for the state.\nIn particular, I appreciate our traditional rulers for their support and prayers.\nAdvertisementAdvertisement“To our party members and other people of Ekiti State, I thank you because you are truthful to yourselves, God and the generation yet unborn.\nThe Governor-elect called on party members to be magnanimous in victory by reaching out to aggrieved members and intending members and integrating them into the progressive fold."
  },
  {
    "headline": "Ekiti APC, Governor-elect begin thank you tour, road show",
    "summarized_story": "Ekiti State Governor- elect, Biodun Abayomi Oyebanji and the deputy governor- elect, Monisade Afuye on Monday (today) July 18, commenced a ‘thank you tour’ to all the 16 local government areas of the state to express their gratitude to the people of the State for their support in the June 18 governorship election.\nThe tour kicked off from Ikole local Government on Monday by 10am.\nAdvertisementAdvertisementThe second phase of the tour would involve visitation to ethnic groups, trade unions and community leaders.\nRecall that the Governor-Elect had visited prominent Ekiti leaders and stakeholders within and outside the state shortly after his election.\nAdvertisementOyebanji said the consultation would continue till his inauguration, adding that regular consultation with stakeholders and leaders will be a major feature of his administration’s Public engagement policy."
  },
  {
    "headline": "Europe Races to Cut Russian Gas Usage Amid New Putin Warning",
    "summarized_story": "And therefore, in any event, whether it’s a partial, major cut-off of Russian gas or a total cut-off of Russian gas, Europe needs to be ready,” EU Commission President Ursula von der Leyen said.\nread moreThe move, which needs the backing of EU states, will be discussed on Friday so ministers can approve it on July 26.\nIn Germany, the government plans to inject billions of euros into the country’s biggest buyer of Russian gas, Uniper.\nPutin said said Gazprom, which has a monopoly on Russian gas exports by pipeline, was not to blame for the reduction of gas transit capacity via a network of pipelines to Europe.\nIn its pivot east, Gazprom said on Wednesday Russian gas supplies heading to China hit a new daily record."
  },
  {
    "headline": "Police Still Hunting Terrorist Turbaned in Zamfara, Says Katsina Governor Masari",
    "summarized_story": "Katsina State Governor, Aminu Bello Masari, on Tuesday painted a rather confounding scenario, when he said the police are still hunting a notorious terrorist kingpin, Adamu Aliero, who was recently turbaned the Sarkin Fulanin Yandoto by the now suspended Emir of Birnin Yandoto, in Tsafe Local Government Area of Zamfara State, Aliyu Garba Marafa, by Governor Bello Matawalle.\nBut Masari, during the interview, explained that the Katsina State government had not forgiven the notorious terrorist and that the government would work with security agencies to arrest the hoodlum.\nHe reiterated that some terrorists recruited by Aliero were still killing, kidnapping and raping residents of Katsina State in villages and communities that bordered Zamfara .\nThe police command here (Katsina) has the responsibility to reach out to the police in Zamfara to know what’s actually going on.\n“The only issue is that the police in Katsina can’t go to Zamfara and arrest him."
  },
  {
    "headline": "Nigerian Airlines Condemn Closure of Lagos Airport Runway",
    "summarized_story": "The Airlines Operators of Nigeria (AON) has condemned the decision of the Federal Airports Authority of Nigeria (FAAN) to close the domestic runway, known as Runway 18L for three months.\nThe umbrella body of indigenous airlines in Nigeria said the closure added to additional operational cost, flight delays and disruptions, insisting that there are other alternatives instead of outright closure of the facility.\nRelatedStories No Content AvailableAON made its position known a letter it wrote to FAAN, dated July 15, 2022m, titled: ‘Closure of Runway 18L at Murtala Muhammed Airport (MMA),’ and addressed to the Managing Director of the agency, Captain Rabiu Yadudu.\n“In light of this, we raise the following critical issues for your urgent attention: The AON welcomes the effort by FAAN to install runway lighting on Runway 18L, at last.\n“The closure of Runway 18L has led to a chain of direct flight delays on a daily basis, impacting the entire system of scheduled domestic flights in the country."
  },
  {
    "headline": "$160m Remittances: Nigerians Treated Harshly for Ineffective Anti-Money Laundering Policy, Says Ping Express",
    "summarized_story": "Promoters of Ping Express have debunked allegations that the company or its past directors were involved in money laundering or fraud.\nAccording to the statement, Ping Express served more than 80,000 hardworking and honest Nigerians in the US and more in other parts of the world.\nPing Express operated in more than 28 countries including UK, Canada and several European countries and served immigrants from 27 African countries with consistent Standard Operating Procedure (SOP) that were reviewed and approved by regulators.\n“These users paid Ping directly from their personal bank accounts in the US.\n“Ping operated strict compliance standards, and ensured users paid from their personal bank accounts."
  },
  {
    "headline": "Buhari Gives Education Minister Two Weeks to Resolve University Lecturers’ Five-Month Strike",
    "summarized_story": "Buhari after hearing from the relevant MDAs directly involved ordered the Minister of Education to ensure that the impasse was resolved within two weeks and report back to him.\nA sources added that the president, however, commended Ngige in his efforts so far to resolve the lingering crisis with the university unions.\nThose who attended the meeting with the president included the Minister of Education, Mallam Adamu; his Finance, Budget and National Planning counterpart, Dr. Zainab Ahmed and Ngige.\nThe ASUU president denied that the union said the president was going to sign agreement between it and the government.\nIt however commended President Muhammadu Buhari for his intervention in the ongoing strike embarked upon by the university based unions."
  }
]