[
  {
    "headline": "Consuming rotten tomatoes can increase cancer risk, nutritionist warns",
    "summarized_story": "Amarachi OkehA nutritionist, Dr. James Oloyede has said that consuming rotten tomatoes can increase the risk of contracting cancer.\nOloyede warned that rotten tomatoes contain aflatoxins which can predispose those who consume them to cancer.\nAccording to Oloyede, studies have confirmed that the exposure of rotten tomatoes to aflatoxins is associated with an increased risk of liver cancer.\n“Those white things found in rotting tomatoes are fungi, aflatoxins.\nRotten tomatoes growing mucus and fungi are not healthy."
  },
  {
    "headline": "Consuming rotten tomatoes can increase cancer risk, nutritionist warns",
    "summarized_story": "Amarachi OkehA nutritionist, Dr. James Oloyede has said that consuming rotten tomatoes can increase the risk of contracting cancer.\nOloyede warned that rotten tomatoes contain aflatoxins which can predispose those who consume them to cancer.\nAccording to Oloyede, studies have confirmed that the exposure of rotten tomatoes to aflatoxins is associated with an increased risk of liver cancer.\n“Those white things found in rotting tomatoes are fungi, aflatoxins.\nRotten tomatoes growing mucus and fungi are not healthy."
  },
  {
    "headline": "Go for genotype screening before marriage, scientists urge couples",
    "summarized_story": "Some laboratory scientists say it is important for intending couples to know their genotype status before marriage to prevent Sickle Cell Disorder.\nNAN reports that World Sickle Cell Day is a United Nation’s recognised day to raise awareness on sickle cell disorder at the national and international level.\nHe explained that if a hemoglobin SS or AS gene person marries another hemoglobin AS gene carrier, the tendency that they would give birth to SS (sickle cell) gene offspring was very high.\n“Hemoglobin SS disease is the most common type of sickle cell disorder.\n“Children are only at risk of sickle cell disorder if both parents carry sickle cell trait."
  },
  {
    "headline": "Go for genotype screening before marriage, scientists urge couples",
    "summarized_story": "Some laboratory scientists say it is important for intending couples to know their genotype status before marriage to prevent Sickle Cell Disorder.\nNAN reports that World Sickle Cell Day is a United Nation’s recognised day to raise awareness on sickle cell disorder at the national and international level.\nHe explained that if a hemoglobin SS or AS gene person marries another hemoglobin AS gene carrier, the tendency that they would give birth to SS (sickle cell) gene offspring was very high.\n“Hemoglobin SS disease is the most common type of sickle cell disorder.\n“Children are only at risk of sickle cell disorder if both parents carry sickle cell trait."
  },
  {
    "headline": "Gov Emmanuel, key to unlocking A’Ibom, Nigeria’s locked economic potentials — Nigerian Govs",
    "summarized_story": "Nigerian Governors under the auspices of the PDP Governor’s Forum, have extolled the virtues and achievements of Governor Udom Emmanuel of Akwa Ibom State, noting that he has brought prudence, innovation and competence in the management of state resources.\nSpecial Guest of Honour at the event, and Governor of Sokoto State, Rt.\nTambuwal who is the Chairman of PDP Governors’ forum, announced that all PDP States Governors are in Akwa Ibom State to deliberate over the state of affairs of the nation .\nOn his part, Governor Ahmadu Umaru Fintiri of Adamawa State lauded the new thinking of Governor Udom Emmanuel of Akwa Ibom State whom he described as a pacesetter doing wonders.\nRt Hon Ahmadu Umaru Fintiri noted that the economic realities of the day demands new thinking, saying that is what PDP Governors are doing."
  },
  {
    "headline": "Sickle Cell Day: Author calls for awareness, adequate information",
    "summarized_story": "Malam Shehu Mohammed, author of the book on sickle cell anaemia titled “I am a survivor,” has called on Nigerians to create more awareness and sensitisation exercise to the sickle cell disease.\nAccording to him, he will be embarking on enrolling 100 indigent sickle cell survivors on the National Health Insurance Scheme.\nHe said it would allow the sickle cell survivors to have free access to healthcare.\nDuring a lecture, Mrs Josephine Olunaike, Founder, Beulah Sickle Cell Foundation, said that the disease was not a death sentence.\nOlunaike said that Nigeria had one of the highest prevalence of sickle cell disease in the world."
  },
  {
    "headline": "Indian PM writes President Buhari on health benefits of Yoga",
    "summarized_story": "The Prime Minister of India, Narendra Modi, has written to President Muhammadu Buhari, on health benefits of Yoga, particularly in boosting immunity and helping recovery from COVID-19.\n”While the threat of the pandemic remains, there have been positive developments since the last International Day of Yoga.\n“The theme for this year’s International Day of Yoga is “Yoga for Wellness’’, which is particularly relevant in the current context.\nRegular practice of Yoga can also help them recover.”According to the prime minister, Yoga has an inherent power to connect, saying Yoga is good for community, immunity and unity.\n“Please accept my best wishes to you, your family and your citizens, for good health and well-being,’’ he added."
  },
  {
    "headline": "Truck crushes motorcyclist, passenger to death in Ogun",
    "summarized_story": "James Ogunnaike, ABEOKUTATwo persons were on Friday night crushed to death by a truck on Ilaro- Ibese road in Yewa North local government area of Ogun State.\nThe Spokesman of the Traffic Compliance and Enforcement Corps (TRACE), Mr. Babatunde Akinbiyi confirmed the incident to the newsmen in Abeokuta on Saturday.\nAkinbiyi, while quoting eyewitnesses, said the truck driver drove recklessly, left his lane and faced the motorcycle, thereby crushing both the rider and his passenger to death.\nHe said “an angry mob later set the truck on fire while the driver ran away.\nHe commiserated with the family of the dead victims, while admonishing truck drivers to resist the temptation of reckless and dangerous driving and give consideration to other road users."
  },
  {
    "headline": "Alleged Harassment: We Didn’t torture any Clergyman — Taraba Police",
    "summarized_story": "By Femi BolajiFollowing a report to the Leadership of Methodist Church by some clergymen that they were harassed by the police in Taraba state, the state Police command Saturday said it did not harass clergymen of the religious organization.\nSpokesman of the Police Command, DSP David Misal, who spoke at a briefing, however, accused the clergymen of spying on the Police, which he said contravenes the secrecy act.\nHe explained that the command had earlier received a complaint letter from some persons about the clergymen, which he said led to the command extending an invitation to them.\nAccording to him, “ the State Intelligence Bureau (SIB) sent an invitation letter to the clergymen for interrogation in which they voluntarily without threat or any form of coercion reported to the Police Headquarters.\n“it is pertinent to note that, Bishop John Wesley Yohana did not report any case to the Police neither uses his position to influence the action of the Police against the accused persons as alleged.“"
  },
  {
    "headline": "2021 UTME: We are disappointed with JAMB",
    "summarized_story": "Some parents whose children sat for the 2021 Unified Tertiary Matriculation Examination (UTME) on Saturday, expressed their frustration and disappointment on the conduct of the exam.\nUTME: 160, 617 candidates write 2021 mock exams – JAMB”We were told this same problem happened during the last Mock examination.\nAnother parent, Mr Ovim Ochechi, lamented that the happenings at JAMB centre was the saddest experience to Nigerian academics, adding that it was a betrayal of trust from JAMB.\nAnother parent, Hajia Zara Ahmed, said the centre did not have the capacity to be a JAMB CBT centre and should be disqualified.\n”This is not encouraging and we are calling on JAMB to be more proactive”, Olowo added."
  },
  {
    "headline": "Kebbi kidnap: Use your powers against bandits",
    "summarized_story": "Governor Kayode Fayemi of Ekiti State, on Saturday, urged local hunters and vigilantes to use all their powers against bandits.\nFayemi, who is the Chairman of the Nigeria Governors Forum, NGF, made the appeal while addressing local hunters and vigilantes groups in Birnin Kebbi, the Kebbi State capital.\n“Hunters and people of the state should use all power within their possession to end bandits attack.\nOne of the students abducted from the school was shot dead during a gun duel between soldiers and the abductors.\nHowever, the Nigerian Army had confirmed that five of the abducted students and two teachers have been rescued."
  },
  {
    "headline": "Buhari congratulates UN Guterres, Amina Mohammed on second tenure",
    "summarized_story": "President Muhammadu Buhari has congratulated Secretary-General of the United Nations, António Guterres, on his re-appointment for a second-term in office and extension of Deputy Secretary-General, Amina Mohammed’s tenure for another 5 years.\nIn a statement by Malam Garba Shehu, the president in a statement on Media and Publicity, in Abuja on Saturday, congratulated the Secretary-General and Deputy Secretary-General for the global recognition and opportunity to serve humanity with their experience.\nBuhari expressed the hope that their passion to promote peace, alleviate poverty, improve health and empower more people would gain more speed and results.\nThe president commended the former minister for her contributions to development, at home and abroad.\nHe prayed that the almighty God grants her good health, strength and more wisdom for the journey ahead."
  },
  {
    "headline": "I will never restructure Nigeria, you're naive, ignorant of war",
    "summarized_story": "President Muhammadu Buhari has vowed that his administration will not restructure the country.\nBuhari warned that those agitating for separation and canvassing for restructuring are naive and ignorant of war.\n“If you ask many Nigerians what are they going to restructure, you will find out that they have nothing to talk about.\nSo those calling for whether separation or restructuring, some of them I will say they are very naive or even mischievously dangerous.\nThose agitating for restructuring are ignorant of war and its consequences."
  },
  {
    "headline": "UAE lifts ban on travels between Nigeria, Dubai",
    "summarized_story": "The United Arab Emirates, UAE, has finally lifted the ban on travels between Dubai and Nigeria.\nDubai had placed a ban on travelers from Nigeria, South Africa based on breach of COVID-19 protocols.\nUAE announces new remote work visaReacting to the resumption of normal flights between Nigeria and Dubai, Emirates in a statement confirmed resumption of flights from Nigeria to Dubai from 23rd June.\nPart of the statement read, “Emirates welcomes the latest protocols and measures announced by Dubai’s Supreme Committee of Crisis and Disaster Management to allow the safe resumption of passenger travel from South Africa, Nigeria and India to Dubai.\n“In accordance with these protocols, we resume flights 23rd June.”EFCC targets corrupt assets in UAE, UK, reminds bankers of June 1 plan"
  },
  {
    "headline": "Okon and wild Rastafarian nabbed on Democracy Day",
    "summarized_story": "By Tatalo AlamuTo Opambata Police Station near Alapere where Baba Lekki was engaged in a battle of will and wits to free Okon and a feral Rastafarian calling himself Jah Jamaica over subversive activities on Democracy Day.\n“Jah, Jah, dem alootin, dem aburning and dem law ashootin.\nAt the Opambata Police Station, Baba Lekki opened cautiously and without his usual legal razzmatazz.\nBut the fellow you are detaining is not even a Nigerian”, Baba Lekki noted.\n“Jah, Jah, officer be reasonable, how man go riotin for Lagos when I am alreading alootin for Ojota?” the Rastafarian demanded."
  },
  {
    "headline": "Criminal herdsmen in Ibarapa aided by jobless indigenes — Igboho monarch",
    "summarized_story": "The Ona Onibode, Oba AbdulRasheed Adetoyese, is one of the three traditional rulers in Igboholand, Oke Ogun part of Oyo State.\nThe army barracks at Saki also deters criminal herders from using the forest.\nI don’t think you should limit the problems of insecurity to criminal herders alone.\nCrime in Ibarapa is high because some of the indigenes are working in tandem with the criminal herders in perpetrating crimes in the area.\nWhat is the relationship between Sunday Igboho and the Igboho community?"
  },
  {
    "headline": "How false killer herdsmen alarm caused panic in Lagos community",
    "summarized_story": "In the wake of reports of alleged herdsmen attacks in a Lagos community, KUNLE AKINRINADE visited the community and reports that it was a false alarm.\n“Therefore, the allegation that herders dislodged from Igangan in Oyo State invaded our community and attacked farmers is nothing but fake.\nA farmer in the community, Akanbi Adewale, also described the report of herdsmen invasion and attacks as false.\n“We have been living in fear since we heard that some people claimed we are Fulani herdsmen.\n“An investigation would also reveal to your good office that there is no presence of Fulani herdsmen in Odo-Egiri community."
  },
  {
    "headline": "Kano: Shekarau’s wisdom as Ganduje’s gain",
    "summarized_story": "He was Minister of Education under former President Goodluck Jonthan as well as a two-term governor of Kano State.\nNo need to tell you that he enjoyed (some people say he still enjoys) a cult-like followership in Kano, especially among the talakawa.\nADVERTISEMENTExpectedly, many are wondering why lawmaker representing Kano Central Senatorial district has been so reticent.\nA close ally of his said: “His decision to maintain a low political profile is borne out of wisdom.\nHe understands that in a state, the governor is the leader and he is giving Ganduje all the space and support he needs to act as the leader of APC in Kano."
  },
  {
    "headline": "Charly Boy @ 71 Injustice in Nigeria stinks",
    "summarized_story": "By Oscar NwoguCharles Chukwuemeka Oputa popularly known as Charly Boy is an enigma of some sort.\nOne year after, the general feeling is that Charly Boy would mark his 71st birthday today, Saturday June 19.\nHowever, Charly Boy will today celebrate his aging backward birthday with the launch of his EP titled, Odudubariba, which simply means a spiritual warrior.\nWhat we are going through in Nigeria today is decades of inaction, docility and my thief better pass your thief mentality.\nAre we expecting fireworks, protests and all sort of razzmatazz from Charly Boy as he counts his age backward?"
  },
  {
    "headline": "We’re finished: 5 dead, scores injured, 25 vehicles razed in Lagos gas explosion",
    "summarized_story": "But by the time it was over, it left five people dead, scores injured, some of them critically, 25 cars burnt and one building structure in complete ruins.\nThe affected victims are being attended to at the Lagos State University Teaching Hospital (LASUTH), he added.\nThe Lagos State Emergency Management Agency (LASEMA), in a short message, said all emergency workers were at the scene working to contain the situation.\nLagos State Government has commiserated with Ogun State Government and the families of those who died in the aftermath of the gas explosion which affected OPIC Plaza in Ikeja.\nThe LASEMA DG disclosed that the carcass of the gas tanker and truck had been evacuated and forensic evidence would be gathered to ascertain whether the recommended safety measures were violated."
  },
  {
    "headline": "Ibadan gang war: Death toll rises to 11",
    "summarized_story": "From Oluseye Ojo, IbadanThe death toll in the gang war that started on Wednesday night in Ibadan, Oyo State capital has risen to 11 on Friday as two rival gangs clashed heavily in some communities in Ibadan metropolis.\nThe affected communities include Inalende, Abebi and Oopoyeosa in the Oyo State capital.\nA reprisal was reportedly staged on Thursday night by aggrieved OPC members at Oopoyeosa, which was said to have led to the death of another seven members of one of the gangs.\nseven Oopo youths and four OPC.\nAs I speak with you, the OPC has begun to mobilise their members to attack the Oopo youths again."
  },
  {
    "headline": "Ekiti APC suspends two over affiliations with pro-Tinubu group",
    "summarized_story": "The two victims, Messrs Kayode Adetifa and Jide Oso, were APC members in Ward 9, Owaye Quarters in Ayede Ekiti, Oye Local Government Area of the state.\nThe Chairman of Ward 08, Ado-Ekiti Local Government, Mr. Clement Afolabi, was in April suspended over a similar offence.\n“In view of the above reasons the general executive of the ward met 27th May, 2021 and decided to suspend you for running against the party (APC) Constitution till further notice.”Responding, the APC Publicity Secretary, Hon.\nAde Ajayi, said the two were disciplined by party leaders for factionalising the party, saying the suspension has nothing to do with SWAGA.\nBut they have been dividing the party and all efforts to rein them in failed,” he said."
  },
  {
    "headline": "Dividend of democracy is right of every Lagosian –Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Mr. Babajide Sanwo-Olu has declared that one of the primary objective of his administration, is to ensure that every Lagosian enjoys the dividends of democracy.\nSanwo-Olu stated this at the formal inauguration of the upgraded/rehabilitated Ikoyi network of roads, which includes Thompson Avenue, Milverton Road, Mac Donald Road/Lateef Jakande RoadPledging the commitment of his administration to good governance, the governor said the regeneration of Ikoyi network of roads and others across the state is a testimonial of its commitment to ensure every part of the city feels the dividends of democracy.\nSanwo-Olu urged residents of the area to support the state government in its bid to develop the city by paying their land use charge as at when due.\nSpecial Adviser to the Governor on Works and Infrastructure, Aramide Adeyoye, said the benefits of the three thousand, three hundred and forty Seven metres Ikoyi Network of roads with a completion duration of eleven months included improved socio economic activities, connectivity, increased property value, boost trade and investment opportunities, enhanced security within the axis.\nHe thanked residents of the area for their cooperation as well as the contractor for the prompt completion of the roads."
  },
  {
    "headline": "Student Dies in Crossfire as Troops Free Five Kebbi School Abductees",
    "summarized_story": "Governor Abubakar Atiku Bagudu of Kebbi State visited the affected school yesterday, where he met with the parents, and promised that all abducted students would be freed.\nBagudu Promises Freedom for Abducted StudentsMeanwhile, Governor Bagudu yesterday met with parents of abducted Yauri students at the school premises, assuring them that they would be rescued soon.\nYauri Lawmaker LamentsThe lawmaker representing the Igaski/Shanga/Yauri in Kebbi State at the House of Representatives, Yusuf Sununu, has lamented attacks by bandits in Kebbi State.\nSununu warned that the growing insecurity in Kebbi State was a major threat to food security in the country.\nThis tends to deter the progress so far achieved by the Kebbi State Government in terms of agriculture and in terms of promoting access to education.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Tells MTN to Reduce Tarrifs, Provide Quality Service to Nigerians",
    "summarized_story": "•Osinbajo: Corporate bodies must ensure accountability in service provisionDeji Elumoye in AbujaPresident Muhammadu Buhari yesterday charged the MTN Group to make its services affordable and in high quality to its Nigerian subscribers.\nAs such, we urge you to offer top-of-the-range and affordable service to Nigerians.\n“I recently unveiled and launched the National Policy for the Promotion of Indigenous Content in the Nigerian telecommunications sector.\nI call on MTN to support the implementation of this policy and train and engage more Nigerians in your company.\nHe added that MTN as a corporate citizen is responsible in all the countries where it is represented."
  },
  {
    "headline": "Amina Mohammed Gets 2nd Term as UN Deputy Secretary-General",
    "summarized_story": "Mohammed is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations.\nPreviously, she was Nigeria’s Minister of Environment from 2015 to 2016 and was a key player in the Post-2015 Development Agenda process.\nFrom 2012, Mohammed was a key player in the Post-2015 Development Agenda process, serving as the Special Adviser to UN Secretary-General Ban Ki-moon on Post-2015 development planning.\nMohammed served as Federal Minister of Environment in the cabinet of President Muhammadu Buhari from November 2015 to February 2017.\nIn January 2017, United Nations Secretary-General António Guterres announced his intention to appoint Mohammed Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "President Has Power to Extend Tenure of Retiring IG, Court Rules",
    "summarized_story": "In his defence, the IGP told the federal high court that the new Nigeria Police Act gave him a four-year tenure, which would only lapse in either 2023 or 2024.\nThe judge also observed that the constitution and the police act were silent on the issue of whether or not the president could extend the tenure of a retired IGP.\nSome senior advocates of Nigeria (SANs) and the Peoples Democratic Party (PDP), had assailed Buhari for extending Adamu’s tenure.\nPresident has decided that the present IG, Mohammed Adamu, will continue to serve as the IG for the next three months to allow for a robust and efficient process of appointing a new IG.\n“This is not unconnected to the desire of Mr. President to not only have a smooth handover but to also ensure that the right officer is appointed into that position."
  },
  {
    "headline": "Buhari in Maiduguri, Vows Not to Rest Until Peace is Restored",
    "summarized_story": "He also commended the state Governor, Prof. Babagana Zulum, for his resilience and relentless efforts in rebuilding the state.\nAccording to him, “It was part of these measures that I gave approval for the federal government to build 10,000 resettlement homes in Borno State.\n“I will never forget in my life that during my career as a politician, Borno State is where I got the highest percentage of votes, more than 90 per cent!\nBuhari also interacted with some of the wounded soldiers assuring them that the government was committed to their recovery and welfare.\n“We have witnessed the gradual return of peace to Borno State and it is our sincere hope that insurgency will soon be brought to an end,” he said."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "BREAKING: Femi Otedola 'Accepts' PDP’s Offer To Run Against Ambode",
    "summarized_story": "Femi Otedola, a businessman and Chairman of Forte Oil PLC, has “accepted” the offer of a governorship ticket by the Peoples Democratic Party (PDP).\nPDP offers Femi Otedola governorship ticket.\nPDP offers Femi Otedola governorship ticket.\nAnd I am sure you feel the same way because we all envision a better Lagos, a Lagos of our dreams.\nI ask you to believe again and together, let’s achieve more,” Governor Ambode said."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Buhari to ECOWAS leaders: Take realistic decisions that will positively impact citizens",
    "summarized_story": "President Muhammadu Buhari has asked leaders of countries in West Africa to take practical and realistic decisions that will reflect positively on citizens.\nAccording to Garba Shehu, presidential spokesman, Buhari also spoke on the political situation in Mali.\nAdvertisementSpeaking at the summit, Buhari said the situation in Mali could take a turn for the worse if not properly handled.\nIn doing so, we must take realistic and practical decisions which will positively impact our citizens,” he said.\n“Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted."
  },
  {
    "headline": "Buhari to ECOWAS leaders: Take realistic decisions that will positively impact citizens",
    "summarized_story": "President Muhammadu Buhari has asked leaders of countries in West Africa to take practical and realistic decisions that will reflect positively on citizens.\nAccording to Garba Shehu, presidential spokesman, Buhari also spoke on the political situation in Mali.\nAdvertisementSpeaking at the summit, Buhari said the situation in Mali could take a turn for the worse if not properly handled.\nIn doing so, we must take realistic and practical decisions which will positively impact our citizens,” he said.\n“Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted."
  },
  {
    "headline": "'We'll meet on the field' -- Bagudu promises to join hunters to track bandits",
    "summarized_story": "Atiku Bagudu, governor of Kebbi, has promised to join local hunters to track bandits in the state.\nAdvertisementHe stated this on Saturday, when the local hunters in the state paid him a visit, following the recent attack on a school in Kebbi.\nAdvertisementSpeaking while addressing the hunters, Bagudu who was in the company of Kayode Fayemi, governor of Ekiti, said as soon as he gets security clearance from troops, he’ll join the hunters on the field.\n“We are here in solidarity with our brother, the governor of Kebbi state, and all the good people of Kebbi state on the unfortunate incident at FGC Birnin Yauri,” he said.\nWe know as leaders of local hunters, you will go fight them in the bush and defeat them."
  },
  {
    "headline": "'We'll meet on the field' -- Bagudu promises to join hunters to track bandits",
    "summarized_story": "Atiku Bagudu, governor of Kebbi, has promised to join local hunters to track bandits in the state.\nAdvertisementHe stated this on Saturday, when the local hunters in the state paid him a visit, following the recent attack on a school in Kebbi.\nAdvertisementSpeaking while addressing the hunters, Bagudu who was in the company of Kayode Fayemi, governor of Ekiti, said as soon as he gets security clearance from troops, he’ll join the hunters on the field.\n“We are here in solidarity with our brother, the governor of Kebbi state, and all the good people of Kebbi state on the unfortunate incident at FGC Birnin Yauri,” he said.\nWe know as leaders of local hunters, you will go fight them in the bush and defeat them."
  },
  {
    "headline": "'Two COVID tests in 72 hours' -- UAE releases new travel protocol for Nigeria",
    "summarized_story": "The Dubai Supreme Committee of Crisis and Disaster Management has released a new protocol directing travellers from Nigeria to undergo COVID-19 tests upon arrival at the airport in the United Arab Emirates.\nPassengers are also expected to have taken a COVID test 48 hours before departure, and have negative results to show for it.\nAdvertisement“Passengers must have received a negative test result for a PCR test taken within 48 hours before departure; UAE citizens exempted,” the new guideline reads.\nIt was later reintroduced on March 15, with the federal government explaining that the airline had continued to conduct rapid antigen tests for passengers before departure from Nigeria.\nThereafter, in March, the UAE embassy in Abuja announced a new COVID-19 travel protocol for Nigeria as part of measures to curtail the spread of the virus in the country."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "Egbin power seeks $2bn in equity and debt to double output",
    "summarized_story": "Egbin power seeks $2bn in equity and debt to double outputNigeria’s Egbin Power Plc, the biggest in Africa’s most populous nation, is to raise $1.8 billion to more than double generation capacity as it seeks to boost output and export electricity to West African countries, reports Bloomberg.\nIt is looking at a combination of debt and equity to meet the funding requirements ahead of the…"
  },
  {
    "headline": "Airlines, passengers hurting over Lagos airport’s non-functional runway lights",
    "summarized_story": "This situation forced local airlines to land at the international wing at night, then taxi to local airport.\nWith 18R and 18L (domestic and international) runway lights at Lagos airport now non-functional, it means no airline can land or take off at night at both runways.\nLagos airport currently processes over 65 percent passenger traffic in Nigeria and travellers bound for Lagos have had to land at Abuja airport because the runway lights at Lagos airport are bad.\nOlumide Ohunayo, an aviation analyst, told BusinessDay that Nigeria has had the issue of non-functional runway lights for over 10 years.\nHe said government needs to expedite action on providing runway lights not just for Lagos but for all the major airports in the country."
  },
  {
    "headline": "Dearth of investment dollars may be the end of oil",
    "summarized_story": "Dearth of investment dollars may be the end of oilIt is often said that the stone age did not come to an end due to a lack of stones, in the case of crude oil, neither peak demand nor depleted reserves looks to herald its end, but a dearth of investment dollars.\nAccording to a Rystad Energy analysis, the proven oil and gas reserves…"
  },
  {
    "headline": "Obaseki begins e-registration of Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said his administration has commenced digital registration of all workers across the 18 local government areas of the state.\nObaseki stated this while addressing members of Edo State Civil Service Commission, led by the chairman, Mrs. Ekiuwa Inneh, on a courtesy visit, at the Government House, Benin City.\nAccording to him, “We have sent Information Technology Communications (ITC) experts to scan all your documents into a digital format.\nWe have started the process of digitally registering every staff member in public and civil service in Edo.\n“I want to assure you that we will key into your transformation agenda for the civil service; you have recognized the fact that the civil service has to be empowered,” she added."
  },
  {
    "headline": "Fathers’ Day: Obaseki hails sacrifice, resilience of fathers amid COVID-19 crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI celebrate fathers for their immense role in holding the family unit together despite the disruptions caused by the coronavirus pandemic and the attendant dislocations in economies across the world.\nDespite the challenges, fathers remained strong pillars of support in the family.\nWhile it must be acknowledged that the economies of the world have been heavily impacted by the coronavirus pandemic, fathers walked a tight rope to keep families whole, even in the face of adversities.\nFathers were resilient and made immense sacrifice to keep the family united, even with the effects of the lockdown.\nGodwin N. ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Obaseki celebrates Dame Uzamere at 60, extols her exemplary life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Saturday, led other top government functionaries to the 60th birthday celebration of Dame Iriagbonse Joy Uzamere, at St. Matthew’s Cathedral in Benin City.\nDame Iriagbonse Joy Uzamere is the mother of the immediate past Chief of Staff to the Governor, Mr. Osaze Ethan Uzamere.\nAccording to him, “She’s a pillar, not only in her family but also in the church and in the community.\nImasuen said Dame Iriagbonse Joy Uzamere is a gift to mankind and her family.\nOther dignitaries at the event are wife of Edo Governor, Mrs. Besty Obaseki; immediate past chief judge, Edo State, Esther Edigin; Sen. Matthew Urhoghide; Edo State head of service, Anthony Okungbowa and former chairman, Edo All Progressives Congress (APC), Anselm Ojezua, among others."
  },
  {
    "headline": "CNL Advocate Stakeholders Collaborations In Curbing Oil Theft And Vandalism – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Chevron Nigeria Limited (CNL) has sought for more cooperation from stakeholders in Niger Delta to reduce oil theft and vandalism.\nThe Bayelsa State Commissioner for Mineral resources, Dr Ebieri Jones, commended CNL for supporting the GMoU, the communities for their peaceful disposition and the KRDF for their achievements.\n“I see KRDF as a change agent and wish to see an integration of KRDF projects and government projects,” he affirmed.\nHe commended CNL for its commitment to the development of the KEFFES communities and emphasized the need for peace in the communities to support CNL operations and provide enabling environment for development.\nLeghemo, the Amanaowei of Koluama 1 and the Chairman, Board of Trustees of the KRDF charged community stakeholders and the government to keep on supporting the Foundation."
  },
  {
    "headline": "SSS takes over investigation into rape, killing of Akwa Ibom job-seeker – Officials",
    "summarized_story": "A former attorney general of Akwa Ibom State, Uwemedimo Nwoko, told PREMIUM TIMES last week that the SSS has taken over the investigation from the police.\nThey have taken custody of the suspect,” Mr Nwoko said.\nApart from Mr Akpan who has confessed to the rape and killing of Miss Umoren, another suspect in the case is his father.\nIf a suspect in a criminal investigation is taken into custody by the SSS, the SSS would eventually have to return them to the police, the lawyer said.\nIt is a murder case, it is the office of the attorney general that is handling the matter directly,” Mr Nwoko said."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Suspected Herdsmen Attack Farmers In Kwara",
    "summarized_story": "Suspected herdsmen have attacked farmers on a farm belonging to the Publicity Secretary of the All Progressives Congress (APC) in Kwara state, Alhaji Tajudeen Aro in Offa .\nThe farm, located behind the Offa University was reportedly attacked by suspected herdsmen said to be migrating from an unknown location.\nThe spokesman of the state Command of the Nigerian Security and Civil Defence Corps (NSCDC), Babawale Afolabi confirmed the incident.\nAfolabi said the herdsmen arrived the farm at about 6:00 pm to unleash violence on the farmers.\nADVERTISEMENT“Meanwhile, in the effort of Offa Civil Defence JTF to arrest the suspects, the cows belonging to the suspected herdsmen were recovered at the farm where most of the cows were injured by farmers."
  },
  {
    "headline": "Suspected Herdsmen Attack Farmers In Kwara",
    "summarized_story": "Suspected herdsmen have attacked farmers on a farm belonging to the Publicity Secretary of the All Progressives Congress (APC) in Kwara state, Alhaji Tajudeen Aro in Offa .\nThe farm, located behind the Offa University was reportedly attacked by suspected herdsmen said to be migrating from an unknown location.\nThe spokesman of the state Command of the Nigerian Security and Civil Defence Corps (NSCDC), Babawale Afolabi confirmed the incident.\nAfolabi said the herdsmen arrived the farm at about 6:00 pm to unleash violence on the farmers.\nADVERTISEMENT“Meanwhile, in the effort of Offa Civil Defence JTF to arrest the suspects, the cows belonging to the suspected herdsmen were recovered at the farm where most of the cows were injured by farmers."
  },
  {
    "headline": "Buhari Faults UN For Not Disarming Foreign Fighters In Libya",
    "summarized_story": "President Muhammadu Buhari on Saturday faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they are disarmed and non-collaboration with regional stakeholders.\nThe Nigerian leader spoke on the situation Mali, which was recently suspended from the regional bloc due to a military coup.\n”Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted.\n”This positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens.\n”The region has experienced two waves of the Covid-19 pandemic, with the second wave being more prevalent with higher death rates."
  },
  {
    "headline": "Buhari Faults UN For Not Disarming Foreign Fighters In Libya",
    "summarized_story": "President Muhammadu Buhari on Saturday faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they are disarmed and non-collaboration with regional stakeholders.\nThe Nigerian leader spoke on the situation Mali, which was recently suspended from the regional bloc due to a military coup.\n”Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted.\n”This positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens.\n”The region has experienced two waves of the Covid-19 pandemic, with the second wave being more prevalent with higher death rates."
  },
  {
    "headline": "South-East Govs, Stakeholders Disown IPOB",
    "summarized_story": "AdvertisementsThe stakeholders, therefore, reaffirmed the commitment of Ndigbo to one united Nigeria.\nAddressing journalists after a South-East Governors Forum meeting, Ebonyi State governor, Dave Umahi, pleaded with leaders of other regions of the country to note the threats to Igbo people and protect them.\nAccording to Umahi, the meeting requested the National Assembly members from the South-East to support the creation of state police in the ongoing constitution amendment exercise.\nADVERTISEMENT“We plead with the leaders of other regions to please note the threats to our people and protect them.\nThe impressions that South-East leaders are silent over some of our youths agitation for successional are not correct,” he said."
  },
  {
    "headline": "United Arab emirates lifts ban on travels between Dubai & Nigeria",
    "summarized_story": "The United Arab Emirates, UAE, has finally lifted the ban on travels between Dubai and Nigeria.\nDubai had placed a ban on travelers from Nigeria, South Africa based on breach of COVID-19 protocols.\nREAD ALSO: BBNaija Reunion: Wathoni Apologises for body shaming DorathyReacting to the resumption of normal flights between Nigeria and Dubai, Emirates in a statement confirmed resumption of flights from Nigeria to Dubai from 23rd June.\nPart of the statement read, “Emirates welcomes the latest protocols and measures announced by Dubai’s Supreme Committee of Crisis and Disaster Management to allow the safe resumption of passenger travel from South Africa, Nigeria and India to Dubai.\n“In accordance with these protocols, we resume flights 23rd June.”"
  },
  {
    "headline": "Igbo man marries beautiful Fulani woman in colorful wedding Photos",
    "summarized_story": "A photo of a Fulani bride with her Igbo groom in a wedding ceremony has surfaced on social media.\nThe cultural blend at Fauiza and Jonathan’s traditional wedding was a beautiful sight to behold, which got a lot of people on social media gushing.\nNo doubt, the #Jozy2019 traditional wedding was a pure delight.\nREAD ALSO: BBNaija Reunion: Wathoni Apologises for body shaming DorathyFaiza’s Fulani Michika culture was well represented and we also saw the groom’s culture highlighted during the palm wine carrying.\nAfter you have viewed and loved this feature, check out their white wedding feature and also catch up with their love story and pre-wedding shoot here."
  },
  {
    "headline": "Jonathan, Adesina Join Buhari in Ghana For ECOWAS summit",
    "summarized_story": "President Muhammadu Buhari on Saturday attended the 59th ordinary session of the Economic Community of West African States (ECOWAS) Authority of heads of state and government.\nNaija News reports that former President Goodluck Jonathan and Akinwumi Adesina, president of the African Development Bank (AfDB) also attended the summit.\nAlso present in Accra alongside Buhari are Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), and Geoffrey Onyeama, minister of foreign affairs.\nThe 59th Ordinary Session of the ECOWAS Heads of State and Government was preceded by the 46th Ordinary Session of the ECOWAS Mediation and Security Council (MSC) at the Ministerial Level and the 86th Ordinary Session of the ECOWAS Council of Ministers, in Accra, Ghana.\nThe President is expected back in Abuja at the end of the Summit."
  },
  {
    "headline": "Biafra: Southeast Govs Disown IPOB, Set To Engage Members",
    "summarized_story": "Governors in the Southeast part of Nigeria has publicly condemned activities of the Indigenous People of Biafra, IPOB.\nThe political leaders had met on Saturday in Enugu State to lay out plans on curbing the current security crisis rocking the region, condemned all secession agitation in the country.\n“The impression that South-East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South-East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\n“In order not to mismanage the unfortunate situation, South-East leaders have set up a committee to engage such youths to stop and allow elders speak to address such fears,” he said."
  },
  {
    "headline": "Party suspends Aregbesola’s ex-commissioner, as Osun APC crisis worsens",
    "summarized_story": "The leadership of the All Progressives Congress in Elerin C, Ward 9, Irepodun South Local Council Development Authority, Erin Osun, Osun State has suspended the former commissioner for Local Government and Chieftaincy Affairs, Kolapo Alimi.\nAlimi, a lawyer, who served as commissioner during the tenure of the immediate past Osun governor, Rauf Aregbesola, was suspended from APC over alleged anti-party activities.\nThe letter conveying Alimi’s suspension, dated 16th June and addressed to the state APC Caretaker Committee Chairman, was obtained by Saturday PUNCH on Friday.\nIt read in part, “We the undersigned Elerin “C” Ward 09 Ward Executives members of Irepodun South LCDA, Erin-Osun under the chairmanship of Alh.\nKolapo Moruf Alimi and we concluded that he is due for suspension, as the elders and stakeholders of the party have been duly carried along and he is hereby suspended from the party (APC)."
  },
  {
    "headline": "Party suspends Aregbesola’s ex-commissioner, as Osun APC crisis worsens",
    "summarized_story": "The leadership of the All Progressives Congress in Elerin C, Ward 9, Irepodun South Local Council Development Authority, Erin Osun, Osun State has suspended the former commissioner for Local Government and Chieftaincy Affairs, Kolapo Alimi.\nAlimi, a lawyer, who served as commissioner during the tenure of the immediate past Osun governor, Rauf Aregbesola, was suspended from APC over alleged anti-party activities.\nThe letter conveying Alimi’s suspension, dated 16th June and addressed to the state APC Caretaker Committee Chairman, was obtained by Saturday PUNCH on Friday.\nIt read in part, “We the undersigned Elerin “C” Ward 09 Ward Executives members of Irepodun South LCDA, Erin-Osun under the chairmanship of Alh.\nKolapo Moruf Alimi and we concluded that he is due for suspension, as the elders and stakeholders of the party have been duly carried along and he is hereby suspended from the party (APC)."
  },
  {
    "headline": "FG: No going back on grazing routes recovery",
    "summarized_story": "In spite of the overwhelming outcry against the plan to retrace and recover grazing routes across the country, the Federal Government is not showing signs of relenting.\nSaturday PUNCH findings revealed that stock routes, popularly called grazing routes, are currently being retraced and recovered by the Federal Government for herders to graze their cattle.\nShe said, “There are some stock routes that we have across the country, and in the past, we had monuments along these stock routes, particularly the primary stock routes.\nThe official, who requested not to be named for lack of authorisation, explained that the stock routes were in three classes.\nWe have primary and secondary stock routes and in some cases, we have tertiary stock routes.”Providing further explanation on the three classes of routes, the official said, “The primary stock routes are the major routes that run in a North-to-South direction from the Sahel to the coastal market."
  },
  {
    "headline": "FG: No going back on grazing routes recovery",
    "summarized_story": "In spite of the overwhelming outcry against the plan to retrace and recover grazing routes across the country, the Federal Government is not showing signs of relenting.\nSaturday PUNCH findings revealed that stock routes, popularly called grazing routes, are currently being retraced and recovered by the Federal Government for herders to graze their cattle.\nShe said, “There are some stock routes that we have across the country, and in the past, we had monuments along these stock routes, particularly the primary stock routes.\nThe official, who requested not to be named for lack of authorisation, explained that the stock routes were in three classes.\nWe have primary and secondary stock routes and in some cases, we have tertiary stock routes.”Providing further explanation on the three classes of routes, the official said, “The primary stock routes are the major routes that run in a North-to-South direction from the Sahel to the coastal market."
  },
  {
    "headline": "Intending couples to do drug test before marriage",
    "summarized_story": "Nigeria’s anti-drug Czar Brig.-Gen. Buba Marwa is pushing his drug war to a new level as he said anyone intending to get married would have to do drug test.\nBut he said President Muhammadu Buhari is resolute in his new thrust to purge the country of illicit drugs.\n“That is why we have put in place various programmes with far reaching effects, one of which is drug integrity test.\n“In the nearest future, anyone seeking employment into any government industry or ministry, parastatal or agency; or seeking admission into tertiary institution; or even getting married must first have to do drug test,” he said.\nExplaining further, Marwa said intending couples have always had to do one test or the other to ensure that they have a successful marriage."
  },
  {
    "headline": "Bagudu vows to lead hunters, vigilantes in battle against bandits",
    "summarized_story": "By Ibrahim BelloKebbi State Governor, Atiku Bagudu, has vowed to lead hunters and vigilantes in the battlefield against bandits ravaging the state.\nHe also joined his counterpart in Ekiti, Dr. Kayode Fayemi to charged the hunters and vigilantes to be ready to defend the territories of states against frequent attacks by bandits.\nThe groups had converged on the state capital to declare their readiness to wage war against bandits.\n“In all what these bandits are doing to us, they have challenged our faiths, our property and our honours and we can’t allow them to go.\nAbubakar Badaru, who also accompanied Fayemi, charged the local hunters to use all power within their possession to rescue and defeat bandits terrorising the state."
  },
  {
    "headline": "Nigeria will remain united under my watch – Buhari",
    "summarized_story": "By Mustapha YauriPresident Muhammadu Buhari has reiterated that Nigeria would remain a united and indivisible nation under his stewardship.\nThe President disclosed this at the inauguration of Kudirat Abiola’s Sabon Gari Peace Foundation in Zaria, Kaduna State on Saturday.\nBuhari was represented by the Executive Secretary, Revenue Mobilisation, Allocation and Fiscal Commission, Alhaji Mohammed Bello.\nNasir El-Rufai, represented by the Commissioner for Education, Alhaji Shehu Mohammed, said many of those clamoring for restructuring does not even understand what they clamored for.\n“This indicates that wherever you come from, you can still live elsewhere and make a living within the shores of Nigeria."
  },
  {
    "headline": "We Are Against Nnamdi Kanu’s Agitation For Biafra – S’east Governors, Ohaneze",
    "summarized_story": "They South East Leaders noted threats by some groups against people of South East and firmly promise to protect everyoneeither from other regions or ours and pleaded with the leaders of other regions to protect their people living in their regions.\nThe statement reads,“We condemn the killing of security agencies, burning of strategic infrastructure and killing of civilians in South East and other regions.\n“We condemn in totality, the activities of violent secessionist groups in South East and elsewhere, we firmly proclaim thatwe do not support them, they do not speak for South East.\nThe impression that South East leaders are silent over some of our youths agitators for secession is not correct.\nSouth East Governors, Ohaneze President, National Assembly members, notable leader had come out publicly many times in the past to speak against such agitations."
  },
  {
    "headline": "Boko Haram: Nigerians Proud Of Your Sacrifices – Army Chief, Yahaya tells Injured Soldiers",
    "summarized_story": "Maj. Gen. Farouk Yahaya, the Chief of Army Staff, has told injured troops in the ongoing counter-insurgency operations against Boko Haram that Nigerians are proud of their efforts in restoring peace to the North-East region.\nYahaya also prayed for their quick recovery in a statement released on Saturday.\nThe wounded troops were also guaranteed of good welfare and medical care, according to the COAS.after assuming office“The COAS gave the assurances on Friday when he visited the 7 Division Hospital and University of Maiduguri Teaching Hospital to commiserate with the sick and wounded in action troops recuperating at the medical facilities.\n“He averred that the nation [Nigeria] is indeed proud of their selfless service and sacrifices towards restoring peace to the North-East region.\n“The COAS also appreciated the commitment and selflessness of the troops in the Theatre and implored them to exhibit a high level of professionalism and ensure that all remnants of Boko Haram and ISWAP terrorists are neutralized,” the statement read in part."
  },
  {
    "headline": "Pastor Kumuyi To Return Tithes, Offerings Of ‘Sinful’ Deeper Life Members",
    "summarized_story": "Pastor Williams Kumuyi, the founder of the Deeper Christian Life Bible Ministry, has stated that he will return certain worshippers’ tithes and offerings.\nKumuyi claims that he will return the money to those who are still living in sin.\nKumuyi emphasized the necessity of living a virtuous life, saying that God does not require “sinner’s money.”He claimed that paying tithes and offerings at church is futile for a sinner.\n“God does not require your money if you are a sinner here.\nKumuyi stated, “God does not require it, and the church does not require it.”"
  },
  {
    "headline": "In Ogun, Dangote Truck Crushes Two To Death",
    "summarized_story": "On Friday evening, two people were killed by a truck on the Dangote-Ibeshe route in the Yewa North Local Government Area of Ogun.\nThe incident was reported to NAN in Abeokuta on Saturday by Babatunde Akinbiyi, the spokesman for the Traffic Compliance and Enforcement Corps (TRACE).\nAccording to witnesses, the truck driver drove dangerously, leaving his lane and colliding with the motorcycle, killing both the rider and his passenger.\n“An enraged mob eventually set fire to the Dangote truck, while the driver fled,” he stated.\nHe expresses his condolences to the victims’ families while urging truck drivers to reject the temptation of reckless and risky driving and to consider other road users."
  },
  {
    "headline": "Breaking: Germany beat Portugal, return to Euro winning ways",
    "summarized_story": "From a goal down, Germany race to 4-1 while Portugal reduce the deficit 23 minutes to the end.\nThe tie eventually ended 2-4 in favour of Germany.\nPortugal go down from the summit to No 3, a point behind both new leaders France and Germany.\nPortugal will next face France in their last group game on Wednesday, at the same time that Germany will engage Hungary.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "Amina Mohammed reappointed UN Deputy Secretary-General",
    "summarized_story": "Nigeria’s Amina Mohammed has been re-appointed as Deputy Secretary-General of the United Nations.\nAntónio Guterres on Friday asked Mohammed to serve as Deputy Secretary-General for a second term, shortly after the UN General Assembly re-appointed him for a second term.\nGuterres’ second term starts on January 1, 2022, and will run for a period of five years.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nMohammed is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "Breaking: Anxiety as residents block Abuja-Kaduna highway, protest bandits’ attack, stranded travellers groan",
    "summarized_story": "Many travellers are currently stranded on the Abuja-Kaduna Highway as angry residents have blocked the road over attacks, especially the killing of a 13-year-old girl by bandits.\nThe tragic incident occurred at Anguwar Magaji in Chikun Local Government Area of the state, according to Daily Trust.\nA resident of the area told Daily Trust that they were not safe at home and their farms.\n﻿He explained that the residents only want security or to be allowed to protect themselves against the bandits.\nA witness told Daily Trust that the protesters refused to listen to the plea of security personnel who approached them."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "Troops rescue abducted students, teachers in Kebbi State -NigPilot",
    "summarized_story": "The fierce gun duel between troops of Operations Hadarin Daji and armed bandits that abducted school students and teachers in Kebbi State has led to their rescue from the bandits, the Nigerian Army has said.\nThe Service, however, regretted that one of the female students lost her life in the process.\n“The troops also recovered 800 cattle rustled by the bandits.\nThe gallant troops are still on the heels of the kidnappers in order to rescue the remaining abductees still in captivity.\n“The rescued teachers and students will be handed over to the Kebbi State Government.The Nigerian Army appreciates the cooperation so far from good spirited citizens and wish to solicit for more”."
  },
  {
    "headline": "Banditry does not represent any ideology, doctrine, religion – Gov Masari -NigPilot",
    "summarized_story": "The Governor of Katsina State, Rt.\nAminu Bello Masari, has said that banditry in Katsina State and environs was peculiar as it does not represent any ideology, doctrine, religion, or political party.\nGovernor Masari gave this commendation when he paid a courtesy call on the CAS at NAF Headquarters, Abuja.\nDirector of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a statement noted that Governor Masari said that banditry in Katsina is pure criminality.\nThe Chief of Air Staff, Air Marshal Oladayo Amao thanked Governor Masari for his support to the NAF and other security agencies in Katsina State."
  },
  {
    "headline": "NGOs train displaced persons on tactics out of poverty, hunger -NigPilot",
    "summarized_story": "We are here to let them know that they can enhance their livelihoods through specific digital training while leveraging their God-given talents and skills.\nOur people have suffered but we thank NHI for always coming to our aid with food and other essential items.\nThank you, thank you, thank you,” he said.\nYathuma disclosed that no fewer than 30 internally displaced persons attended the ‘Dignified IDP’ training, comprising 20 young women and 10 young men.\n“We are excited that 67 per cent of the trainees are young women."
  },
  {
    "headline": "South East Governors Condemn Violent Secessionist Groups, Back United Nigeria",
    "summarized_story": "Members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nHe added, “The impression that South East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\nThe forum also condemned the killing of security agencies, burning of strategic infrastructure, and killing of civilians in the South East and other regions.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in South East and our visitors,” Governor Umahi said while reading the communique issued at the end of the meeting."
  },
  {
    "headline": "Pressure Mali To Return To Civilian Rule, Buhari Tells ECOWAS Leaders",
    "summarized_story": "President Muhammadu Buhari on Saturday called on West African leaders to exert pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nThe Nigerian leader spoke on the situation in Mali which was recently suspended from the regional bloc due to a military coup.\n“Pressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, President Buhari faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they were disarmed.\nIn his capacity as the ECOWAS champion on the fight against COVID-19, President Buhari also drew attention to the need for more citizens in the region to be vaccinated, stressing the need for adherence to other non-pharmaceutical interventions."
  },
  {
    "headline": "Secession Agitation: To Say We Are Silent Is Not Correct – South East Leaders",
    "summarized_story": "Leaders in the South East have faulted the notion that they have been unbothered about the agitation for secession by some youths in the region.\n“The impression that South East leaders are silent over some of our youths’ agitation for secession is not correct; South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations,” he said.\nREAD ALSO: South East Governors Condemn Violent Secessionist Groups, Back United NigeriaThe governor added, “We condemn in totality, the activities of violent secessionist groups in the South East and elsewhere, we firmly proclaim that we do not support them, they do not speak for South East.\nAccording to him, the leaders have noted the threats by some groups against the people of the South East and will protect them and everyone from other regions.\n“We condemn the killing of security agencies, burning of strategic infrastructure, and killing of civilians in South East and other regions."
  },
  {
    "headline": "Mob Sets Truck Ablaze For Killing Motorcycle Rider, Passenger",
    "summarized_story": "An angry crowd has set a truck ablaze following an accident that led to the death of two persons in Ogun State.\nSources said the truck had veered off its lane and faced an oncoming motorcycle before it crushed both the rider and the passenger to death.\nThe spokesman for the Ogun State Traffic Compliance and Enforcement Corps (TRACE), Babatunde Akinbiyi, also confirmed the incident to Channels Television on Saturday in Abeokuta, the state capital.\nHe noted that an angry mob descended on the truck and set it ablaze while the driver of the vehicle took to his heels.\nThe TRACE spokesman condoled with the families of the victims over the loss and warned motorists, especially truck drivers against reckless and dangerous driving."
  },
  {
    "headline": "Air Force Trains Personnel To Tackle Incessant Aircraft Crashes",
    "summarized_story": "The Nigerian Air Force (NAF) has commenced the re-training of personnel in order to ensure the safety of its crew, as part of efforts to tackle the incessant air mishaps in the Nigerian military.\nAddressing reporters on Saturday, NAF Director of Training, Air Commodore Esen Efanga, explained that the Chief of Air Staff approved the training to enable the crew to be up to speed with global best practices and reduce human factors that cause air crashes.\n“It is the Chief of Air Staff’s intention to establish a culture of safety in the Nigerian Air Force so that while we have increased and enhanced our operations, we take care of this critical aspect of NAF operations,” he said.\nAttahiru, who was appointed as the Chief of Army Staff in January, died in a plane crash in Kaduna alongside 10 other personnel of the Nigerian Army and Nigerian Air Force.\nThe incident was preceded by two other crashes – the first being Beechcraft KingAir B350i which crashed at Bassa village in Abuja while en route to Minna, killing seven NAF personnel in the process."
  },
  {
    "headline": "Police arrest suspected bandit, recover AK-47 rifle, vehicle",
    "summarized_story": "Operatives of the Kaduna Police command have arrested a suspected bandit while on routine patrol along a forest in Saminaka, Lere Local Government area of the state.\nAmong items recovered from him is an AK- 47 rifle.\nKaduna Police spokesperson Mohammed Jalige said the bandit was intercepted among others in a green Volkswagen vehicle while heading towards Kaduna.\nThe police operatives who gave them a hot chase apprehended one, and after a search of the vehicle found an AK-47 rifle concealed.\nAdvertisementThe police assure that they are working hard to end banditry and all forms of criminality in the state."
  },
  {
    "headline": "South East leaders reaffirm commitment to united Nigeria",
    "summarized_story": "South East Leaders have again reaffirmed their commitment to a united Federal Republic of Nigeria, that allows justice, fairness, love and respect for one another.\nThe leaders made the affirmation after it’s about four hours closed door meeting, held at the government house Enugu.\nReading the communique on behalf of the group, chairman of South East Governors forum and Governor of Ebonyi state, Dave Umahi reinstates their position to condemned the activities of successionist group in the region.\nThe group promised to protect non Igbo residing in the region, while they expect leaders of other regions to address the threat to Ndigbo and protect them.\nAdvertisementThe group also throw their weight behind Ebubeagu corps and said it remains the only recognised community security outfit for the south East."
  },
  {
    "headline": "Insecurity: Governors’ wives organise prayer session in Zamfara",
    "summarized_story": "True repentance, good conduct by Nigerians and good moral upbringing of children are the ways to end the security challenges bedeviling the nationThis was the thrust of the conversation at a prayer session for peace and security organized by the Nigerian Governors Wives ForumThe wife of the Zamfara state Governor Aisha Bello Matawalle joined her counterparts across the thirty six states of the Federation in the national prayers.\nFemale Islamic Scholars, academics and politicians converged on the Zamfara state government House Chamber Gusau, to pray for the state and Nigeria at Large over the spate of Insecurity in all parts of the countryThe prayer session was organized by the Nigerian Governors’ wives association to seek divine intervention over the happenings in the country.\nAdvertisementThe upsurge in banditry, agitations, cattle rustling, kidnappings, rape and other crimes, is worrying and these women believe prayers alone cannot save the country except there is true repentance from the non state actors involved in perpetrating these crimes.\n” It is important for us as people and as a nation to return to God in Prayer to seek divine intervention against the criminal activities ravaging our dear Nation” Aisha Matawalle” There is need for every Nigerian to return to God for a better and more peace country”The wife of the Zamfara State Governor Aisha Bello Matawalle, the Deputy Vice Chancellor of federal University Gusau and other speakers at the event appeal to parents and guardians to control their children and wards in order to prevent their involvement in any act capable of undermining the peace and unity of the countryThe current insecurity and other related crimes in the country has not only crippled farming and socio-economic activities, but has also plunged Nigerians into hunger, poverty and frustration."
  },
  {
    "headline": "Two Own Goals Help Germany to 4-2 Win Against Portugal",
    "summarized_story": "Robin Gosens and Kai Havertz created havoc against Portugal on Saturday as Germany beat Fernando Santos’ side 4-2 in their Group F Euro 2020 game, with help from two own goals.\nCristiano Ronaldo and Diogo Jota both scored for Portugal but own goals from Ruben Dias and Raphael Guerreiro as well as strikes from Gosens and Havertz ensured Germany left with the three points.\nGermany got off to what appeared to be a dream start when Gosens scored from the near post after just five minutes.\nIt felt like it wasn’t going to be Germany’s day when Portugal scored 10 minutes later through record-breaking striker Ronaldo.\nBoth Germany and Portugal are on three points with the former ahead in second place on goal difference."
  },
  {
    "headline": "Euro 2020: Hungary Hold World Champions France to Surprise Draw",
    "summarized_story": "Tournament favourites France were held to a surprise 1-1 draw against Hungary in their second Euro 2020 Group F game in Budapest.\nFrance missed two big chances to take the lead through Kylian Mbappe’s header and Karim Benzema’s sliced effort wide, but Hungary stunned the world champions through Attila Fiola’s finish having been put through on goal, sending the home crowd into raptures.\nIn a cauldron atmosphere in Budapest, France levelled on 66 minutes through Antoine Griezmann, finishing up at close range after Mbappe had held up Hugo Lloris’ long kick upfield.\nThey could not grab a winner, and the result means France have four points after two games, which should be enough to make the last 16 as they finish their group stage against Portugal on Wednesday, while Hungary, on one point, must beat Germany in their final game in Munich."
  },
  {
    "headline": "Again, Angry Youth Block Highway in Protest as Terrorists Kill Four, Abduct 49 in Nigeria’s Northwest Kaduna – Arise News",
    "summarized_story": "The community which is located on the outskirts of Kaduna metropolis was said to have come under persistent attacks by bandits throughout the week.\nSpeaking in a telephone interview on Saturday, the source said a total of four people were killed, while 49 people were abducted within three days.\nHe said, “on Tuesday the bandits invaded the community killed two people and abducted 15 others.\n“There is also another soldiers’ camp close to the main road, yet the attacks have persisted.\n“Our people have been living in perpetual fear and this is a community that is close to Kaduna metropolis."
  },
  {
    "headline": "Assets In Nigeria That Stood Up To Inflation. Savings Accounts Aren’t One Of Them",
    "summarized_story": "Oyekunle Benson, CFA with Context Analysis, spoke to the Global Business Report about Nigeria’s high inflationary environment.\nHe also looked at the 10, 20, and 30 year annualized performance of asset classes vs inflation.\nThis gives a clue to how to face Inflation in the coming years.\nBe sure to watch this informative session."
  },
  {
    "headline": "If You Engage in Any Commercial Activity in Nigeria, You’re Subject to the FCCPC: Consumer Protection CEO Irukera",
    "summarized_story": "Following the inquiry into the death of Lagos chef Peju Ugboma – whose family accused the medical centre that treated her of negligence – the Executive Vice Chairman and Chief Executive of Nigeria’sFederal Competition and Consumer Protection Commission, Babatunde Irukerat, was on ARISE NEWS on Friday to clarify the role and scope of the government agency.\nThis is against the backdrop of comments made bythe Chairman, Medical Jurisprudence Committee of the Nigerian Medical Association, Dr OIayinka Atilola, who on Thursday suggested – also on ARISE NEWS – that the FCCPC was overreaching by investigating Ugboma’s death.\nWatch this insightful video for Irukera’s explanation of the FCCPC’s role."
  }
]