[
  {
    "headline": "Finance bill: TIN doesn’t compel everyone to pay tax, experts tell FG",
    "summarized_story": "He said, “There is nothing in the new finance bill that is before the National Assembly about TIN.\nThe bill called the 2021 Finance Bill is the bill that takes effect in 2022.\nThat was the one that has TIN, not the 2021 Finance Bill.\nSo, the government has a responsibility to ensure the right narrative.”He further stressed the need for a proper tax system, which would hinder tax avoidance and illicit financial flows.\nIt does not mean that you have to pay tax."
  },
  {
    "headline": "Ooni asked to explore tradition against insecurity in South-West",
    "summarized_story": "The Owa of Idanre kingdom, Oba Fredrick Aroloye, has urged the Ooni of Ife, Oba Enitan Ogunwusi, to intervene in the spate of insecurity in the region, using traditional means.\nIdanre traditional ruler, who decried the state of insecurity in the region, stressed that there was the need to tackle the menace unconventionally.\nAroloye said, “It’s documented that the Ooni of Ife is the Arole of Oduduwa.\nWe haven’t thrown everything away.”According to Idanre monarch, Oba Ogunwusi would be the third Ooni that had visited Idanre because of the relationship between the two towns.\nResponding, the Oba Ogunwusi agreed with Oba Aroloye and promised to address the issue."
  },
  {
    "headline": "Ekiti APC plans to deregister other factions – Tinubu’s group",
    "summarized_story": "The South-West Agenda for Tinubu 2023 presidential ambition within the All Progressives Congress in Ekiti State on Saturday raised the alarm over alleged plot by the party leadership in the state to manipulate membership register.\n“We are loyal party members and we want progress for this party; but it will be a great disservice for us to keep quiet in the face of this unsavory act.\nThis will not help our party and national leadership who are working hard to reposition our party,” Adeyeye said.\nBut the state APC Publicity Secretary, Segun Dipe, who described the allegation as comical, unfounded and spurious, said the APC was even “ready to accommodate the worst of enemies to shore up its membership base.”Dipe said, “We are not going to deregister anybody.\nEkiti APC is not planning anything of such and our plan is to register more members and not to reduce the ones we have currently."
  },
  {
    "headline": "Ndigbo better off staying in Nigeria, but… — Gov Uzodimma",
    "summarized_story": "By Agbonkhese ObohGovernor Hope Uzodimma of Imo State has said Ndigbo is better off staying as part of the Nigerian state, noting that bemoaning the marginalisation of Ndigbo in the Nigerian project was trite, while what is cogent is to address a rational and realistic way out of it.\n“Most standard provision stores in any remote part of Nigeria is likely to be owned and operated by an Igbo man or woman.\n“The second most populous ethnic group in any city in Nigeria outside the indigenes of the city are Igbos.\n“From available statistics, Igbo students across the globe and even in Nigeria are making waves with their technological innovations.\n“We have unassailable ingenuity and opportunities presented to us to explore to emerge leaders again in this land of Nigeria that we are equal owners.”Vanguard News Nigeria"
  },
  {
    "headline": "Bandits Kill kidnapped ECWA Church Pastor, after collecting ransom",
    "summarized_story": "…Exchange fire with security agents in Kaduna community, shoot pregnant ladyBy Ibrahim Hassan-WuyoBandits have finally killed Rev.\nDauda Bature, Pastor of ECWA Church Nariya, Kaduna State who was kidnapped in his farm.\nThe bandits later demanded for ransom and Rev.\nMeanwhile, residents of a Kaduna community had to run for their lives as security agents and Invading bandits were engaged in a gun duel ,leading to shooting of a pregnant woman.\nNormalcy has returned to the Sabo GRA as people were seen pursuing their legitimate businesses, even as stern looking combat ready security agents continued to patrol the area."
  },
  {
    "headline": "Nigeria’s education system is on life support — ASUU",
    "summarized_story": "By Emmanuel Iheaka, OwerriThe Academic Staff Union of Universities (ASUU) has submitted that Nigeria’s education system is in life support and may soon die if caution is not applied.\nEchereobia said ASUU has remained the lifeline of the education system in the country, describing the union as a selfless one fighting for a better tertiary education in the country.\n“Education system in Nigeria is in life support Machine, the life support is ASUU, if you remove ASUU, it will collapse; ASUU is a selfless union fighting for infrastructure and welfare of members and students”, he stated.\nEchereobia urged the incoming leadership of the union never to joke with the welfare of staff and students.\nOtti maintained that the lecturers are first academics before being members of ASUU and should therefore, take teaching seriously."
  },
  {
    "headline": "I paid N2,650 for Toyota Camry valued N2.6m with luck — Suspect confesses",
    "summarized_story": "Shina Abubakar, OsogboA suspect, Abdulazeez Ibrahim, 26, has disclosed that he paid N2,650 for a Camry Toyota car valued at N2,650,000 out of luck.\n“I owned a motorcycle and a small Mazda car.\nBut on a Friday last month, I left Iwo for Osogbo on the motorcycle to get a bigger car.\nI got to a dealer and negotiated Toyota Camry car, we agreed on N2,650,000 but I transferred N2,650 to his account.\nHe, however, stated that the suspect will be charged to court after the completion of an investigation into the case."
  },
  {
    "headline": "Nigeria’s high debt: Invitation to recolonisation and slavery (2)",
    "summarized_story": "By Aare Afe BabalolaPREVIOUSLY, I extensively considered the unfortunate repeat in the history of slavery – from the days of slavery by Europeans who forcefully carted away Africans abroad, to the recent spate of self-imposed slavery by Africans in Europe and the Americas.\nDebt slaveryBesides the most common forms of slavery being military slavery and domestic slavery, one subtle and perhaps the most lethal of them all is debt slavery.\nThe peril of debt slavery is not due to the danger it personally poses to the obligor, but its huge effect on those who were not party to the said debt.\nDebt slavery as a modern-day form of slavery is the most common method of enslavement with an estimated 8.1 million people bonded to labour having pledged their assets or services as security for the repayment of a debt or some other obligation.\nConclusionNo doubt, it is high time that African leaders began to make intentional efforts to adopt sound economic policies which will make a dangerous foray by Africans into self-imposed slavery less appealing."
  },
  {
    "headline": "Inadequate fund, budgetary release affecting fight against HIV/AIDS – YOSACA",
    "summarized_story": "The Yobe State Agency for the Control of AIDS (YOSACA) has identified inadequate funding and budgetary release as some of the factors affecting the operation of the agency to effectively tackle the scourge of the virus in the state.\nHe said the biggest HIV/AIDS population-based survey on the surface of the earth, which was conducted in 2018, has succeeded in sampling 15 local government areas out of the 17 in the state.\nHe said the theme of this year’s World AIDS Day, ‘End Inequality: End AIDS, End the Pandemic’ was key to the agency’s target of ending the mother to child transmission of the disease.\nWhile commending the Yobe State Government for its support, the Executive Secretary appealed for the government to address the challenges facing the agency.\nHe also appreciated the World Health Organisation, (WHO); Saving One Million Lives; State Emergency Management Agency, (SEMA) for their continued support."
  },
  {
    "headline": "Yuletide: Umahi withholds commissioner, perm sec, others’ salaries",
    "summarized_story": "The Governor of Ebonyi State, David Umahi, on Saturday directed the immediate withholding of salaries of the Commissioner of Health, Dr Daniel Umezuruike, and the permanent secretary for failing to keep general hospitals clean.\nUmahi equally ordered that salaries, Christmas bonuses and rice be withheld from workers in the 14 general hospitals located in the 13 local governments of the state.\nThe statement reads in part: “The Governor of Ebonyi State, Chief David Umahi has observed with disappointment, the poor supervision of the 14 General Hospitals by the State Ministry of Health.\n“Salaries, Christmas bonuses and rice are hereby withheld from all the staff of the 14 general hospitals and the Ministry of Health, including the Commissioner for Health and his Permanent Secretary.\n“The Governor gives all concerned a grace of 10 days to get the general hospitals totally clean and attend to duties or face very severe consequences.”"
  },
  {
    "headline": "Shehu Sani condemns murder of Kaduna ECWA pastor",
    "summarized_story": "Former Senator Shehu Sani, who represented Kaduna Central at the 8th National Assembly, on Saturday condemned the gruesome killing of Reverend Dauda Bature of the Evangelical Church Winning All (ECWA).\nBature’s abductors had demanded a N10 million ransom but he was killed after the payment was delayed.\nSani, on his verified Facebook wall, wrote:“The gruesome killing of Reverend Dauda Bature of the ECWA Church Nariya, Igabi LG Kaduna State by bandits is tragic, unfortunate and condemnable.\nIt’s now clear that everyone lives at the mercy of terrorists.\nWhere are those that swore an oath to protect and to defend?”Pastor’s killing: ECWA urges government to tackle lingering insecurity"
  },
  {
    "headline": "How FG encourages corruption through budgetary allocation – Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State has accused the Federal Government of promoting corruption by not releasing from the yearly budget, the whole money required for a project within the required time frame.\nThe governor made the claims in his speech during the commissioning of the GRA Junction Flyover project in Port Harcourt on Saturday.\nThe Governor said the practice by the Federal Government encourages variation of the value of the projects and leads to abandonment.\nAccording to the Governor, in such cases, inflation may affect the value of the contract leading to a likelihood of adjustment of the items and eventually breeds corruption.\nSo, they’ll put variation and at the end of the day, the job will not be N60 billion."
  },
  {
    "headline": "Yobe: Buni commends citizens for donating to education trust fund",
    "summarized_story": "Governor Mai Mala Buni of Yobe State has commended citizens of the state for donating to the State Education Trust Fund.\nAccording to a statement issued by his spokesman, he gave the commendation on Saturday when he received members of the Yobe State Education Trust Fund.\nThe Governor commended the board members of the Yobe State Education Trust Fund for accepting to serve the state while assuring of his administration’s commitment to providing qualitative education in the state.\nMohammed Abubakar, who spoke on behalf of the members, commended Buni for the foresight of his administration to drastically change the standard of education in the state.\nRecall that the Yobe State Government had recently constituted a Board of Trustees for the State’s Education Trust Fund (YETFUND)."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Decline of values and political culture in Nigeria",
    "summarized_story": "To interrogate this ugly phenomenon, this essay will focus primarily on the role played by undemocratic attitudes, unwholesome values, objectionable beliefs, and sentiment, in short, the declining values and political culture, ‘ala Nigeriana’.\nAny meaningful explanation of the phenomenon of ‘declining political culture’ must therefore begin with a conceptualization of the generic term, ‘political culture’.\nIn other words, political culture consists of people’s shared, learned beliefs about their political system and their role within that system.\nPolitical culture influences the way people see their political world and what they expect from it.\nNo doubt, military dictatorship engendered a subject political culture because of the restricted channel for political participation."
  },
  {
    "headline": "On money rituals, logic and life",
    "summarized_story": "Just some few days ago—Thursday, December 2, 2021—and in her Punch column and article titled “The logic of what Nigerians call ‘money rituals’,” Abimbola Adelakun in her usual incisive manner attempts to pierce through the conceptual and existential fog that suffuse the idea of money rituals that has captured the imagination of Nigerians.\nFor her, “there is nothing like money rituals.\nWhile saying “there is nothing like money rituals” assumes logic, and the logic of economic calculation, it is to assume too much about the capacity of logic to explain the whole of life and its many mysterious and dark crevices.\nWhat would rather happen is that those who read it would likely shake their heads in consternation: how could anyone say there is no money rituals?\n- Advertisement -To say “there is nothing like money rituals” is to say there is nothing like mysticism and occultism."
  },
  {
    "headline": "Why I fell in love with Mo’ Bimpe, by actor Adedimeji Lateef",
    "summarized_story": "Why I fell in love with Mo’ Bimpe, by actor Adedimeji LateefPopular actor and filmmaker, Adedimeji Lateef, has opened up on the qualities that attracted his Nollywood colleague, Adebimpe Oyebade, popularly known as Mo’ Bimpe, to him.\nIn an interview with GoldMyneTV, the 35-year-old ‘Crying Machine’ showered encomiums on his wife-to-be while he spoke about her outstanding qualities.\nRead Also: Davido acquires Lambogini Aventador on birthdayAdedimeji further revealed that he was very happy about the union.\nYes, I’m happy.\nI must be happy and I am happy about it.”The Nollywood couple had tried to keep their relationship under wrap."
  },
  {
    "headline": "Jaruma to Ned Nwoko: you married Regina Daniels for fame",
    "summarized_story": "Popular local aphrodisiac seller, Hauwa Saidu Mohammed aka Jaruma has slammed Ned Nwoko for saying that her “kayanmata” did not work on him.\nOn Wednesday, Ned Nwoko, husband of Nollywood actress Regina Daniels, called out his ex-wife, Laila and Jaruma.\nIn a statement from the billionaire’s media team shared via his Instagram page, he clarified the circumstances surrounding his separation from his former Moroccan wife, Laila.\n“As for Jaruma who claimed that her ‘kayanmata’ is working on Ned Nwoko and that was why his wife Laila left, such speculation is baseless and laughable.\n“Every single thing you’ve said about your Moroccan wife Laila is just to tarnish her image."
  },
  {
    "headline": "2023: We’re not desperate for Yoruba president –Afenifere",
    "summarized_story": "From Oluseye Ojo, IbadanPan-Yoruba socio-cultural and political organisation, Afenifere, has said it was not desperate to have a Yoruba man as Nigeria’s president in 2023.\nThe group’s position was in contrast with that of Yoruba Council of Elders (YCE), which said it supported a president of Yoruba extraction.\nThey insisted that presidential power must come to the South West in 2023, and the acceptable person that the Yoruba would present for the office would be decided as time progresses.\nAs far as we are concerned in Afenifere, whoever that emerges as president in 2023, will have problem in running the country if Nigeria is not restructured.\nHe added that the Yoruba that are interested in contesting for president in 2023 should come out clearly and declare their intention."
  },
  {
    "headline": "Abducted Imo monarch killed, body dumped at market square",
    "summarized_story": "From George Onyejiuwa, OwerriTension and anxiety gripped Imo State on Friday, with the killing of the abducted traditional ruler of Atta community in Njaba Local Government area of the state.\nThe lifeless corpse of Eze Azike who was reportedly abducted on Thursday was dumped at the market square of this community on Friday morning.\nIt was also learnt that the gunmen had killed four other persons in the Atta Njaba community before the abduction of the late traditional ruler.\n“The traditional ruler of Atta ancient kingdom in the Njaba LGA, Eze Edwin Azike, has been murdered.\nHis lifeless body was dumped at the market square and the villagers discovered it this morning."
  },
  {
    "headline": "2023: Igbo won’t beg for presidency –Massob, others",
    "summarized_story": "Movement for the Actualization of the Sovereign State of Biafra (MASSOB), yesterday, said it was abominable for the Igbo to kneel to people in order to mount the saddle of power.\nNdigbo are not cowards or weaklings.”He advised Igbo elders to stop making disgraceful and disrespectful utterances in their quest for the President of Nigeria.\nHe added that being a president of Nigeria for four or eight years is not the ultimate desire of Ndigbo.\nSupporting the MASSOB leader’s stance, the National President of Indigenous Igbo Youth Congress (IIYC), Chief Mayor Echefu, said that Igbo do not kneel for anybody or group, but only to Almighty God.\nChairman of ADF Media and Publicity Bureau, Abia Onyike noted that it was left for each Igbo presidential aspirant to decide which approach to adopt in pursuing his aspiration."
  },
  {
    "headline": "Pastor nabbed for raping pregnant woman in Ondo",
    "summarized_story": "From Bamigbola Gbolagunte, AkureThe Police in Ondo State have arrested a popular broadcaster and pastor of Celestial Church of Christ (CCC) (names withheld) for allegedly raping a five-month pregnant lady inside the premises of his church.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIt was alleged that the 19-year old lady was raped when she went for a deliverance programme at the church.\nOn that faithful day, I went to church but unfortunately, they had finished the service.\nHe later stood up and entered a room; he called me to enter a room inside the church."
  },
  {
    "headline": "Men are polygamous by nature –Nkechi Blessing",
    "summarized_story": "Nollywood actress, Nkechi Blessing Sunday will never quit her marriage because of infidelity; rather she would stay back and fight for what she loves.\nI do not support cheating because no woman wants to share her husband, but these are things that one cannot control.\nMen are polygamous by nature.\nThere are a lot of attractive females everywhere, so it takes the grace of God for a man to stay faithful to a woman.\nSocial media doesn’t scatter relationships; it’s the lies that partners tell themselves that scatter it."
  },
  {
    "headline": "Kaduna: Bandits Kill Pastor after Demanding More Ransom",
    "summarized_story": "• Invade Sabo GRA, Oil Village, set house ablaze, abduct 8John Shiklam in KadunaThe pastor of the Evangelical Church Winning All (ECWA), Nariya, Igabi Local Government Area of Kaduna State, Rev.\nThe sad incident occurred Thursday as dare devil bandits invaded parts of Sabon Tasha GRA, Oil Village and Anguwan Bulus areas of Kaduna metropolis, abducting eight residents including a policeman and his family.\nThe hoodlums were said to have invaded Sabon Tasha GRA and Anguwan Bulus simultaneously in the early hours of Saturday.\nThe bandits had in an earlier attack on Anguwan Bulus, also located near the Sabo GRA, abducted a policeman, his wife and son.\nHe added that in Sabo GRA, the bandits set a house ablaze, while a mother and her four children were abducted in Oil Village."
  },
  {
    "headline": "Tambuwal: Defective Military Operation in Zamfara Made Sokoto Vulnerable to Bandits’ Attacks",
    "summarized_story": "Aminu Waziri Tambuwal of Sokoto state, has left the state “very vulnerable” to the deadly and inhuman activities of these criminal elements.\n“It does appear as if those bandits pursued from Zamfara state have relocated to Sokoto state.\nThis is a very serious call for concern,” he said, appealing to President Muhammadu Buhari “to deploy more resources to Sokoto state.\nSince the commencement of this administration, we have given security personnel in Sokoto state not less than 500 vehicles.\n“Mr President wants me to convey his profound condolence over the loss of all the citizens who have departed."
  },
  {
    "headline": "At Biden’s Forum, Buhari Promises Free, Fair Elections, Transfer of Power to Winners in 2023",
    "summarized_story": "“I am proud to state that Nigeria has had over two decades of uninterrupted democratic governance and has unequivocally remained committed to upholding the core values and principles of democracy.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\nPresident Buhari thanked President Biden, government and people of the United States for hosting the summit.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,” the President said.\nBut regrettably, our democratic gains of the past decades are under threats of unconstitutional takeover of power."
  },
  {
    "headline": "N69bn Debt: Appeal Court Dismisses Jimoh Ibrahim’s Suit to Recover Asset",
    "summarized_story": "The appellate court upheld the November 4, 2020 order of Justice Rilwan Aikawa of the Federal High Court, Lagos which authorised AMCON to take over Ibrahim’s assets.\nOther properties are the building of Abuja International Hotels Limited located at No.\n94, Awolowo Road, Ikoyi, Lagos; NICON Building at No.\nSome other entities which AMCON alleged were linked to Ibrahim, including Nicon Insurance Limited, Nigerian-Re-Insurance Limited, Abuja Hotel Limited and Nicon Hotels Limited also filed an application asking the judge to discharge the said order.\nIn a unanimous decision yesterday, the Court of Appeal upheld the preliminary objection of AMCON and accordingly dismissed both appeals."
  },
  {
    "headline": "Omicron: Obasanjo, Uganda’s Former VP, in Joint Article, Lambast Western World for Red Listing African Countries",
    "summarized_story": "Our CorrespondentsFormer president Olusegun Obasanjo and the former vice-president of Uganda, Specioza Wandira-Kazibwe, have condemned the travel ban on African countries over concerns relating to the Omicron variant of COVID-19.\nA number of countries in Europe banned travel from countries in Africa following the discovery of the variant by South African scientists.\n“Africa’s embrace of smart multilateralism is manifest in being the first continent to agree on a common digital platform for bio-surveillance and biosecurity.\nIt was as clear as noonday to those of us championing African multilateralism that retreating behind the walls of nationalist survival would be continental suicide.\n“This is smart multilateralism at work."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Government To Place UK, Canada, Saudi Arabia On COVID-19 Red List, Stop Airlines From Flying Into Country",
    "summarized_story": "The Nigerian Government has stated that it will place the United Kingdom, Canada and Saudi Arabia on a red list over the outbreak and spread of Coronavirus' Omicron variant.\nSirika said, “There is also a case of Saudi Arabia that put Nigeria on the ban list; Canada.\n“We have given our input that it is not acceptable by us and we recommend that those countries – Canada, UK, Saudi Arabia and Argentina – be also put on the red list.\n\"Once they are on the red list, which means they are banned, their airlines will also be banned.\nThe British High Commission had also last Sunday said it would stop issuing visitor visa applications from all red list countries including Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Government To Place UK, Canada, Saudi Arabia On COVID-19 Red List, Stop Airlines From Flying Into Country",
    "summarized_story": "The Nigerian Government has stated that it will place the United Kingdom, Canada and Saudi Arabia on a red list over the outbreak and spread of Coronavirus' Omicron variant.\nSirika said, “There is also a case of Saudi Arabia that put Nigeria on the ban list; Canada.\n“We have given our input that it is not acceptable by us and we recommend that those countries – Canada, UK, Saudi Arabia and Argentina – be also put on the red list.\n\"Once they are on the red list, which means they are banned, their airlines will also be banned.\nThe British High Commission had also last Sunday said it would stop issuing visitor visa applications from all red list countries including Nigeria."
  },
  {
    "headline": "Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura",
    "summarized_story": "Buhari, it was gathered, would also be embarking on local trips to Ebonyi, Kano as well as to his hometown of Daura in Katsina State where he is likely to spend the New Year break.\nLocal trips in December include Ebonyi, Kano and Daura where he will likely spend the New Year break,” a source within the President's circle told SaharaReporters on Saturday.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE.\nSee Also Sahara Reporters Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionThe Nigerian President has been junketing across the world in the last three months.\nIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly."
  },
  {
    "headline": "Junketing President Buhari To Visit Turkey, Plans Local Trips To Ebonyi, Kano, Daura",
    "summarized_story": "Buhari, it was gathered, would also be embarking on local trips to Ebonyi, Kano as well as to his hometown of Daura in Katsina State where he is likely to spend the New Year break.\nLocal trips in December include Ebonyi, Kano and Daura where he will likely spend the New Year break,” a source within the President's circle told SaharaReporters on Saturday.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE.\nSee Also Sahara Reporters Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionThe Nigerian President has been junketing across the world in the last three months.\nIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly."
  },
  {
    "headline": "Ex-Barcelona Star, Samuel Eto’o, Elected Cameroon Football Federation President",
    "summarized_story": "Cameroon football legend, Samuel Eto'o, has been elected to lead the Cameroon Football Federation for the next four years.\nEto’o was announced as new president on Saturday at the federation’s general assembly.\nThe four-time African Footballer of the Year and former Indomitable Lions international defeated rival, Seidou Mbombo Njoya, the fourth Vice- President at the Confederation of African Football.\nFive candidates, who were supposed to contest the elections, pulled out on the morning of the election, leaving only Eto'o and Mbombo to fight for the position.\n\"I’m deeply grateful to be elected as new president of Fecafoot."
  },
  {
    "headline": "2023: Don’t direct Yoruba to support any aspirant, Obasanjo advises Ooni of Ife",
    "summarized_story": "Former President Olusegun Obasanjo has advised Adeyeye Ogunwusi, the Ooni of Ife, against endorsing aspirants vying for political offices.\nThe event held at the palace of the ooni in Ile Ife, Osun state.\n“Anyone of them who says that he is interested in politics, just pray for him and let them go.\nAnyone who approaches you and says that he wants to be president or governor, just pray for such a person and let him go.\nYou have been doing all within your capacity to ensure food sufficiency in the continent,” NAN quoted him as saying."
  },
  {
    "headline": "2023: Don’t direct Yoruba to support any aspirant, Obasanjo advises Ooni of Ife",
    "summarized_story": "Former President Olusegun Obasanjo has advised Adeyeye Ogunwusi, the Ooni of Ife, against endorsing aspirants vying for political offices.\nThe event held at the palace of the ooni in Ile Ife, Osun state.\n“Anyone of them who says that he is interested in politics, just pray for him and let them go.\nAnyone who approaches you and says that he wants to be president or governor, just pray for such a person and let him go.\nYou have been doing all within your capacity to ensure food sufficiency in the continent,” NAN quoted him as saying."
  },
  {
    "headline": "Is a new Nigeria really possible?",
    "summarized_story": "I was driving along Opebi Road, Lagos, when the traffic lights turned red at Salvation junction.\nBut traffic lights are not Christmas lights and are, therefore, not decorations.\nThe same people who ignore traffic lights in Nigeria would obey them in Rwanda — only to return and start lamenting that Rwanda is a better country.\nYesterday, when Waziri Adio, former executive secretary of the Nigeria Extractive Industries Transparency Initiative (NEITI), presented his memoir, ‘The Arc of The Possible’, in Abuja, the Salvation traffic lights incident kept coming to mind.\nNow, imagine somebody going into public office and helping government to save money — as well as not having his hand in the till."
  },
  {
    "headline": "Is a new Nigeria really possible?",
    "summarized_story": "I was driving along Opebi Road, Lagos, when the traffic lights turned red at Salvation junction.\nBut traffic lights are not Christmas lights and are, therefore, not decorations.\nThe same people who ignore traffic lights in Nigeria would obey them in Rwanda — only to return and start lamenting that Rwanda is a better country.\nYesterday, when Waziri Adio, former executive secretary of the Nigeria Extractive Industries Transparency Initiative (NEITI), presented his memoir, ‘The Arc of The Possible’, in Abuja, the Salvation traffic lights incident kept coming to mind.\nNow, imagine somebody going into public office and helping government to save money — as well as not having his hand in the till."
  },
  {
    "headline": "PHOTOS: 'Manual for Nigerians' -- Waziri Adio's 'The Arc of the Possible' unveiled in Abuja",
    "summarized_story": "Waziri Adio, former executive secretary of the Nigeria Extractive Industries Transparency Initiative (NEITI), on Saturday, unveiled his new book, ‘The Arc of the Possible’.\nThis book impacts a lot and should be a manual for all well-meaning Nigerians, social critics, public affairs analysts,” he said.\nAlso speaking, Chaudhuri commended Adio, noting that the author displayed global best practices when he was in public service.\nThe event also featured an intergenerational conversation on ‘The Promise and Perils of Public Service in Nigeria’.\nThe conversation was moderated by Samson Itodo, executive director, Yiaga Africa, and convener of the #NotTooYoungToRun movement."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nCinetPay thus simplifies the process of accepting payments, eliminating the need for merchants to integrate with different systems for managing sales and revenues.\nSimilarly, up to 80% of the population in the French-speaking African region have a mobile money account and less than 20% bank accounts.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Enterprise Hotel is democratising real estate investments for regular Africans",
    "summarized_story": "AdvertisementFractional investment startup, Enterprise Hotel, hopes to change this by offering Africans the opportunity to invest in commercial real estate with as little as ₦30,000 ($52).\nHow Enterprise Hotel makes moneyEnterprise Hotel makes money in two ways.\nHis time working in real estate showed him that only a handful of people could afford to buy or own real estate.\nThen we can start talking to investors.”Aside from helping more people gain access to real estate investments, Enterprise Hotel indirectly solves another problem.\nFor Enterprise Hotel, operating in the real estate industry with its high financial requirements poses a significant hurdle."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "More pain for Nigerian states as FAAC shrinks by N68bn in November",
    "summarized_story": "More pain for Nigerian states as FAAC shrinks by N68bn in NovemberThe ability of Nigerian states and other tiers of government to meet their various obligations is under more risk as gross monthly distribution by the Federation Account Allocation Committee (FAAC) to the three tiers of government dropped by N68billion in November.\nThe continuous decline in Nigeria’s FAAC allocation to the three tiers of government is also due to the subsidy payment, according to market analysts.\nThe Nigerian National Petroleum Corporation (NNPC) has been deducting from its remittance to FAAC, a threat to the ability of many Nigerian states and other tiers of government to meet their financial obligations.\n“Since June ’21, the corporation has deducted a total of N939bn from its FAAC remittance.\n“Incessant payment of subsidy on refined petroleum products would narrow FAAC allocations and widen the country’s budget deficit."
  },
  {
    "headline": "IHS risks losing N380bn tower deal with MTN Nigeria over dollar pricing",
    "summarized_story": "IHS, the largest tower company in Africa, may lose an eight-year-old N380 billion contract after MTN Nigeria required the deal to be denominated in the local currency, the naira.\nIHS controls many MTN Group tower assets in different parts of Africa including Nigeria.\nIn 2014, IHS acquired 4,154 towers from MTN Nigeria and a further 4,696 towers in 2015.\nThe 9,000 towers from MTN Nigeria are more than 50 percent of IHS’ tower assets in Nigeria at 16,522 towers.\nMTN holds 85,176,719 ordinary shares of IHS Towers, representing about 20 percent of the tower company, as a result of the IPO."
  },
  {
    "headline": "Again, Emirates suspends flights to Nigeria over UAE-Nigeria diplomatic row",
    "summarized_story": "The United Arab Emirates (UAE) has rejected the directive from Nigeria that puts on hold Emirates flights suspension while restricting the carrier to one weekly light to Abuja.\nThe carrier, in a statement, said Emirates will be completely suspending its flights between Nigeria and Dubai until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\nAccording to the carrier, “With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be completely suspending its flights between Nigeria and Dubai, until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\n“We regret the inconvenience caused, and customers can contact their travel agent or booking office to make alternative arrangements.\nNuhu explained that Hadi Sirika, the Minister of Aviation had graciously granted Emirates Airlines 21 frequencies weekly to two major airports in Nigeria; Lagos, 14 and Abuja, seven."
  },
  {
    "headline": "EdoGIS employs 50 new staff to improve efficiency, optimal service delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government through the state’s skills development agency, Edojobs has recruited over 50 new personnel into the Edo State Geographical Information Service (EDOGIS), in a new drive to ensure efficiency and optimal service delivery at the service.\nThe recruitment process commenced in February 2021, with over 2000 applicants vying to fill the various positions.\nThe applicants were screened through different stages, involving both oral and written assessment and interviews.\nThe new staff include customer service representatives, geometricians, estate surveyors, GIS analysts, land administrators, facility manager, drivers, administrative assistants, legal assistants and accountants, among others.\n“In years past, before Governor Godwin Obaseki’s administration in Edo State, there was a massive job deficit in the state, which had cascading effects on society."
  },
  {
    "headline": "Obaseki gifts house, N1m to outstanding Edo teacher – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, announced the gift of a house and the sum of N1 million to an outstanding Biology Teacher in the state, Mrs. Benedicta Idele, who emerged as the first runner-up in the 2020 Maltina Teacher of the Year Award.\nObaseki made the announcement when he received the teacher who was on a courtesy visit at the Government House in Benin City.\nAccording to him, “We cherish what you have done; we admire you and as a state, your efforts will not go unrecognized.\nA couple of years ago, another teacher won a similar award and as a government, we gifted her a house; that tradition has been established and you will also get one.\nEarlier, the awardee, a biology teacher in Asoro Grammar School, Egor Local Government Area of the state, attributed her success to the recent training she undertook which was organized by Edo State Government."
  },
  {
    "headline": "Obaseki swears in five SSAs, 12 SAs in Orhionmwon LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has sworn in five Senior Special Assistants (SSAs) and 12 Special Assistants (SAs), following harmonization by leaders and members of the Peoples Democratic Party (PDP) in Orhionmwon Local Government Area (LGA).\nObaseki, who performed the inauguration ceremony in Abudu, the headquarters of Orhionmwon LGA, reiterated the need to encourage women participation in politics.\nI said for SSAs, they should give me five nominations and two of these people should be women.\nThey mobilized for us and now it’s time for them to get an appointment, but they were not nominated.\nWhen I came to campaign, we made promises and I am not the kind of leader that doesn’t fulfill promises."
  },
  {
    "headline": "Obaseki, Ibori, Kwankwaso, others pay last respects to Lucky Igbinedion’s mother, Maria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, joined other eminent Nigerians to pay last tribute to late Mrs. Maria Oredola Igbinedion, mother of former Edo State Governor, Chief Lucky Igbinedion.\nGuests at the funeral mass held at St. Austin Catholic Church, Benin City include former Military Governor of Bendel State, Sen. Tunde Ogbeha; former Governor of Delta State, Chief James Ibori and former Governor of Kano State, Sen. Rabiu Kwankwaso.\nOthers are former Senate President, Pius Ayim Pius; former Imo State Governor, Achike Udenwa; former Edo State Deputy Governor, Mike Oghiadomhe and Sen. Matthew Urhoghide, among others.\nObaseki, who commiserated with the former governor, extolled the exemplary life of late Mrs. Maria Oredola Igbinedion, noting that she lived a fulfilled life, in service to God and humanity.\nMoses said late Maria Igbinedion exuded uncommon love and impacted positively on those who crossed her path while she was alive."
  },
  {
    "headline": "Airline row: Air Peace accuses UAE of spreading falsehood in letter to Nigerian govt",
    "summarized_story": "So, we never left Sharjah Airport nor did we at any time “shifted” and operated out of DXB (Dubai Airport).\nThe letter deliberately painted us as unserious while at the same time, suggesting that we look for other airports in the country to operate from,” Air Peace said.\nThey were later told that Air Peace would only be accepted if only it brought a small aircraft.\n(Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport and then returned to Sharjah airport.\n“Finally, we suggest that Air Peace should consider flying their two other flights to any UAE airport at which there are available slots."
  },
  {
    "headline": "Football legend, Samuel Eto’o elected Cameroon FA president",
    "summarized_story": "Samuel Eto’o, former Cameroonian international football player, has been elected president of the country’s football association, and will run football in the country for the next four years.\nThe four-time African Footballer of the Year defeated rival Seidou Mbombo Njoya, the fourth vice-president at the Confederation of African Football.\nI’m deeply grateful for to be elected as the new president of @FecafootOfficie,” Eto’o said in a tweet on Saturday.\n“I’ve spoken to the business community and we’re certain we’ll get the right investors who can accompany us in fulfilling our goals,” Eto’o had said prior to the polls.\nHe signed a permanent deal with Mallorca in 2000, scoring 54 goals in 133 outings to establish himself as the team’s all-time leading scorer."
  },
  {
    "headline": "UAE minister justifies reduction of Air Peace slots as row with Nigeria escalates",
    "summarized_story": "(Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport and then returned to Sharjah airport.\n“Finally, we suggest that Air Peace should consider flying their two other flights to any UAE airport at which there are available slots.\nAs expected, the GCAA will support Air Peace in this activity, where required.\n“Your Excellency, your kind support is anticipated so that the NCAA reviews their decision and restores the approval of the Emirates Airline Winter Schedule, as filed.\nWhile only one Nigerian airline operates internationally, one or two others operate on regional routes."
  },
  {
    "headline": "Alleged take over of Abuja Electricity: Court orders parties to maintain status quo",
    "summarized_story": "A Federal High Court sitting in Abuja, on Friday, ordered parties in a suit filed over the controversy on the alleged takeover of the Abuja Electricity Distribution Company (AEDC) to maintain status quo pending the next date of hearing.\nThe plaintiffs; CEC Africa Investments Limited and KANN Utility Company Limited, in a suit marked: FHC/ABJ/CS/1557/2021, had sued the Attorney General of the Federation (AGF) and Central Bank of Nigeria (CBN) as 1st and 2nd defendants, NAN reported.\nThe plaintiffs had sought an order restraining the AGF, CBN, BPE and Ministry of Finance from interfering with the operations and management of AEDC .\nAfter hearing the motion, Justice Ekwo ordered the parties to maintain status quo ante bellum pending the next date of hearing.\nHe adjourned the case until December 20 for hearing of the motion on notice."
  },
  {
    "headline": "NANS Commends CBN Gov Over Entrepreneurship Scheme",
    "summarized_story": "The National Association of Nigerian Students (NANS) has commended the CBN governor, Godwin Emefiele, for the impact-driven vision of the Tertiary Institutions Entrepreneurship Scheme.\n“Union Leaders are under tremendous pressure by graduates on how to access programmes of government or how to get jobs from the market as none seems coming forth.\nResponding, the Students Union Leader from Kwara State and KADPOLY said Emefiele deserves a standing ovation, describing the initiative as long overdue.\n“How can tertiary institutions be training us to become unemployed, this is a misnormer and this initiative is bold and deserves a standing ovation,” he said.\nHe said the interventions of the Emefiele-led CBN were both strategic and doing the magic."
  },
  {
    "headline": "NANS Commends CBN Gov Over Entrepreneurship Scheme",
    "summarized_story": "The National Association of Nigerian Students (NANS) has commended the CBN governor, Godwin Emefiele, for the impact-driven vision of the Tertiary Institutions Entrepreneurship Scheme.\n“Union Leaders are under tremendous pressure by graduates on how to access programmes of government or how to get jobs from the market as none seems coming forth.\nResponding, the Students Union Leader from Kwara State and KADPOLY said Emefiele deserves a standing ovation, describing the initiative as long overdue.\n“How can tertiary institutions be training us to become unemployed, this is a misnormer and this initiative is bold and deserves a standing ovation,” he said.\nHe said the interventions of the Emefiele-led CBN were both strategic and doing the magic."
  },
  {
    "headline": "Federal Govt Under Obasanjo Complicit In Bola Ige’s Death – Akande",
    "summarized_story": "He recalled in the book that the late Chief Ige’s ordeals started when Chief Obasanjo came on official visit to Oyo State when Lam Adesina was the governor of the state.\nHe also gave me solidarity when the President visited Osun State.\nI believe it was after that outing that some element closed to the president met and decided to deal with Bola Ige.\nThat was why I came to the conclusion that the Federal Government was complicit in the assassination of Uncle Bola Ige,’’ he buttressed.\nThey were earlier close friends because Akinwunmi, as an article of faith, wanted me to become the governor of Osun State at all cost."
  },
  {
    "headline": "Federal Govt Under Obasanjo Complicit In Bola Ige’s Death – Akande",
    "summarized_story": "He recalled in the book that the late Chief Ige’s ordeals started when Chief Obasanjo came on official visit to Oyo State when Lam Adesina was the governor of the state.\nHe also gave me solidarity when the President visited Osun State.\nI believe it was after that outing that some element closed to the president met and decided to deal with Bola Ige.\nThat was why I came to the conclusion that the Federal Government was complicit in the assassination of Uncle Bola Ige,’’ he buttressed.\nThey were earlier close friends because Akinwunmi, as an article of faith, wanted me to become the governor of Osun State at all cost."
  },
  {
    "headline": "Why Air Peace Lost Flight Frequencies At Sharjah Airport, UAE Tells Nigerian Govt",
    "summarized_story": "The United Arab Emirates (UAE), has written the federal government of Nigeria why a Nigerian carrier, Air Peace, lost its flight frequency slot at Sharja airport.\n“Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport, and then returned to Sharjah Airport.\nIt, however, urged NCAA to review the decision and restore the approval of the Emirates Airline winter schedule, as filed.\n“Finally, we suggest that Air Peace should consider flying their two flights to any UAE airport at which there are available slots.\nAs expected, the GCAA will support Air Peace in this activity, where required."
  },
  {
    "headline": "How I ‘bought’ Toyota Camry valued N2.6m for N2,650 in Osun — Suspect",
    "summarized_story": "A suspect, Abdulazeez Ibrahim, 26, has disclosed that he paid N2,650 for a Camry Toyota car valued at N2,650,000 out of luck.\nBut on a Friday last month, I left Iwo for Osogbo on the motorcycle to get a bigger car.\nI got to a dealer and negotiated Toyota Camry car, we agreed on N2,650,000 but I transferred N2,650 to his account.\nThe Osun State Commissioner of Police, Olawale Olokode, while addressing journalists, said immediately the case was reported to the command by the car dealer, Kazeem Ogunjobi, detectives swung into action and the Toyota Camry car was recovered in a painter’s workshop in Iwo.\nHe, however, stated that the suspect will be charged to court after the completion of an investigation into the case."
  },
  {
    "headline": "How I ‘bought’ Toyota Camry valued N2.6m for N2,650 in Osun — Suspect",
    "summarized_story": "A suspect, Abdulazeez Ibrahim, 26, has disclosed that he paid N2,650 for a Camry Toyota car valued at N2,650,000 out of luck.\nBut on a Friday last month, I left Iwo for Osogbo on the motorcycle to get a bigger car.\nI got to a dealer and negotiated Toyota Camry car, we agreed on N2,650,000 but I transferred N2,650 to his account.\nThe Osun State Commissioner of Police, Olawale Olokode, while addressing journalists, said immediately the case was reported to the command by the car dealer, Kazeem Ogunjobi, detectives swung into action and the Toyota Camry car was recovered in a painter’s workshop in Iwo.\nHe, however, stated that the suspect will be charged to court after the completion of an investigation into the case."
  },
  {
    "headline": "Police confirm kidnap of mother, four children in Kaduna",
    "summarized_story": "The Kaduna State Police Command said on Saturday that kidnappers abducted a mother and her four children in ‘Oil Village’ in the Chikun Local Government Area of the state.\nThis was just as the Command said security operatives foiled an attack on Sabo Government Residential Area in Chikun in the early hours of Saturday.\n“On receiving the distress call, operatives were immediately mobilised with the support of other security agents to the scene with a view to thwart the bandit’s intention.\nThe criminals on sensing the presence of security agents, started shooting indiscriminately.\nThe criminals been frustrated by the Police and other security agents, set the resident on fire and flee for their lives."
  },
  {
    "headline": "Police confirm kidnap of mother, four children in Kaduna",
    "summarized_story": "The Kaduna State Police Command said on Saturday that kidnappers abducted a mother and her four children in ‘Oil Village’ in the Chikun Local Government Area of the state.\nThis was just as the Command said security operatives foiled an attack on Sabo Government Residential Area in Chikun in the early hours of Saturday.\n“On receiving the distress call, operatives were immediately mobilised with the support of other security agents to the scene with a view to thwart the bandit’s intention.\nThe criminals on sensing the presence of security agents, started shooting indiscriminately.\nThe criminals been frustrated by the Police and other security agents, set the resident on fire and flee for their lives."
  },
  {
    "headline": "How the Buhari govt promotes corruption: Wike's stunning revelation",
    "summarized_story": "Okafor Ofiebor/ Port HarcourtGovernor of Rivers State, Nyesom Ezenwo Wike has offered a stunning revelation about how the Buhari Federal Government inadvertently promotes corruption through contracts.\nHe said such practice encourages variation of the value of the projects, elongates the time specified to complete such projects and most often, leads to abandonment.\nWike gave the explanation while speaking at the inauguration of the GRA Junction Flyover project that was performed by Mike Agbedor Ozekhome, SAN, on Saturday in Port Harcourt.\nHe pointed out that such culture is not encouraged in Rivers State under his administration and there is no rationale for him to spend four years, for example doing a particular project.\nYou will find a round about, pedestrian underpass, midway turns, traffic and streetlights within the project."
  },
  {
    "headline": "New York City FC lift first MLS Cup, stun Portland",
    "summarized_story": "New York City FC stunned Portland Timbers 4-2 in penalties on Saturday to claim their first MLS Cup on a rainy and windy afternoon at Providence Park in Portland.\nNYCFC had shot into the lead on 41st minute with a goal by Valentin Castellanos.\nThe visitors from New York kept the lead until Mora’s heartbreaking goal in injury time.\nVictory for New York City must have been heart wrenching for Portland head coach Giovanni Savarese, who was expecting the team to win their second MLS cup.\nSavarese said the clubs raucous fanbase and the home advantage would give his team a major boost against visiting New York City FC."
  },
  {
    "headline": "Bandits Kill Abducted ECWA Pastor In Kaduna After Collecting Ransom",
    "summarized_story": "Reverend Dauda Bature, pastor-in-charge of the Evangelical Church Winning All in Nariya, Igabi Local Government Area, Kaduna State, was assassinated by bandits after an undisclosed ransom was paid.\nThe cleric was alleged to have been kidnapped on November 8 while working in his farm in the same area, according to Sun.\nThe bandits allegedly began negotiations with the man’s wife and sought a ransom of roughly N10 million, which the family could not afford at the moment.\n“When some money was raised, they asked the wife to bring the money which she took to them on November 18.\n“What this means is that the bandits have become so cruel and brutal to their victims."
  },
  {
    "headline": "Gov Masari Reveals Why Katsina Commissioner Was Brutally Murdered",
    "summarized_story": "Aminu Bello Masari, the Governor of Katsina State, has revealed how the late Commissioner of Science and Technology in Katsina State, Dr. Rabe Nasir, died.\nNadir’s lifeless body was found in the bathroom of his home, located at the Fatima Shema Housing Estate yesterday,” Masari said in the statement.\n“He was a conscientious, dedicated, hardworking, and loyal person who never failed in any duty assigned to him,” Masari said of the deceased.\nWhile expressing his condolences to the Commissioner’s immediate family, which included his wife, children, elderly mother, and many siblings, Katsina State Governor stated the Commissioner’s death was a big loss to the state.\nIn Katsina, the body of late Dr. Nasir Rabe was laid to rest today, in accordance with Islamic rights."
  },
  {
    "headline": "Buhari’s Visit To Ebonyi Key To Release Of Nnamdi Kanu From Detention — Ohanaeze",
    "summarized_story": "Ohanaeze, however, urged the leadership of IPOB to stop any attempt or action that will warrant President Buhari to decline in actions that will lead to the unconditional release of Nnamdi Kanu.\n“IPOB shouldn’t give credence to the antagonism and friction of Northern groups like Arewa Consultative Forum, Northern Elders Forum, Coalition of Northern groups and Arewa Youths that President Buhari shouldn’t release Nnamdi Kanu, because this imbecility and absurdity will make President Buhari to decline in actions that will lead to the release of Nnamdi Kanu.\n“Ndigbo will welcome President Buhari to Ebonyi State in line with Igbo traditional culture and norms of welcoming esteemed visitors.\n“Southeast Governors led by Governor Umahi will secure the release of Nnamdi Kanu and others in Abakiliki.\nWe have implicit confidence that the southeast political leadership and Igbo leadership led by Ohanaeze Ndigbo will seal the deal and facilitate the release of Nnamdi Kanu."
  },
  {
    "headline": "Sylvester Oromoni: 6 Suspects Arraigned, Remanded In Custody",
    "summarized_story": "Three students and three staff members of Dowen College Lekki were remanded in custody by a Lagos Chief Magistrate Court yesterday for the attack and death of 12-year-old Sylvester Oromoni Junior.\nFollowing an application by the Lagos State Police Command to retain the suspects in custody awaiting the conclusion of its investigation into the terrible incident, Magistrate A.O.\nOn Tuesday, the Lagos State Police Command announced that five Dowen College pupils and three housemasters were already in arrest for alleged participation in the killing of a classmate.\n“The students whose names were mentioned are in police custody and investigation is on.\nThe police authorities had so far refused to make public the names of the suspects in its custody over the incident."
  },
  {
    "headline": "Breaking: Tragedy hits US as 70 die in worst Kentucky’s tornadoes",
    "summarized_story": "The governor of the US state of Kentucky has said that more than 70 people were killed by tornadoes on Friday night.\nAndy Beshear said the figure could rise to more than 100 in what he called the worst tornadoes in the state’s history.\nAt least five people died as tornadoes wreaked havoc in other states, including one in an Amazon warehouse in Illinois.\nMore than 100 people were inside the Mayfield factory when the tornado hit, he said.\nThe Amazon warehouse in Edwardsville in southern Illinois was damaged during a tornado on Friday night, the authorities said."
  },
  {
    "headline": "Breaking: Samuel Eto’o emerges Cameroon FA FECACFOOT President",
    "summarized_story": "Cameroon soccer great Samuel Eto’o was elected president of the national football federation (FECAFOOT) on Saturday, a month before the country hosts the African Cup of Nations.\nFormer striker Eto’o, who played for Barcelona, Inter Milan and Chelsea, will take over an organisation long tainted by infighting, mismanagement and allegations of corruption.\nThe 40-year-old Eto’o won the election with 43 votes from members of FECAFOOT’s general assembly.\nCameroon will host the African Cup of Nations from Jan. 9 to Feb. 6.\nIt was stripped of the right to host the tournament in 2019 because of delays in preparation and security concerns."
  },
  {
    "headline": "Tragedy! Student dead as fire outbreak unsettles Taraba varsity",
    "summarized_story": "Tragedy Friday night struck the female hostel of Taraba State University when fore outbreak killed a year one student identified as Emoseh Lawi.\nAccording to report, the victim was a student of the Tourism Department of the university.\nShe was said to be be sleeping when the unfortunate occurred.\nThe Institution’s Information Director Sa’ad Mohammed has confirmed the incident.\nHe said the root cause of the fire outbreak must be uncovered to avoid future occurrences."
  },
  {
    "headline": "Young Graduates Can Solve Nigeria’s Biggest Problems, Says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Saturday expressed optimism that young Nigerian graduates can provide solutions to the biggest challenges confronting the nation.\nHe made the remark while speaking at the 60th anniversary of the Obafemi Awolowo University (OAU), Ile-Ife, in Osun State, according to a statement signed by presidential spokesperson, Laolu Akande.\nYou will have to confront the problems of climate change and a world moving away from fossil fuels, and you will usher in the age of renewable energy and green solutions,” the Vice President said.\nHe added that this generation of young Nigerians are equipped and could proffer solutions in the areas of education, agriculture, health care and security.\nAt the end of the Convocation, the Vice Chancellor of the University, Prof. Eyitayo Ogunbodede, conducted the VP and other dignitaries around an arts exhibition to commemorate the event."
  },
  {
    "headline": "Bandits Kill Pastor, Abduct Woman And Four Children In Kaduna",
    "summarized_story": "Bandits have killed one Pastor Dauda Bature who was in charge of the Evangelical Church Winning All (ECWA) parish in the Narayi area of Chikun Local Government Area (LGA) of Kaduna State.\nThe source who does not want his identity disclosed explained that the bandits kidnapped Bature on November 8 while he was working on his farm.\nREAD ALSO: Army Chief Warns Of Possible Increase In Activities Of Bandits, Terrorists By 2022In a related development, bandits invaded Oil village in Chikun LGA where they forcefully took away a woman and her four children to an unknown location.\nThe command’s spokesman explained that the criminals, who were frustrated by the police and other security operatives, set the residence ablaze and fled into the bush.\nAccording to Jalige, the police have launched investigations into the two incidents and effort is ongoing to rescue the abducted victims."
  },
  {
    "headline": "Army Chief Warns Of Possible Increase In Activities Of Bandits, Terrorists By 2022",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Farouk Yahaya, has called on commanders of various theatres of operation to prepare for a possible increase in attacks by bandits and terrorists among other criminal elements disturbing the peace of the nation.\nHe made the call on Friday in Abuja while addressing senior officers at the closing ceremony of the COAS Annual Conference 2021.\n“We must take the fight to the adversary in order to neutralise and defeat them,” the army chief said in his charge to officers and soldiers fighting insecurity in various parts of the country.\n“Commanders are also urged to develop contingency plans to ensure our forces always retain the initiative in all our theatres of operation.\nAccording to the army chief, participants also deliberated the various security issues plaguing the nation, including the activities of bandits, terrorists, and secessionists among others."
  },
  {
    "headline": "Parents Should Be Forced To Send Their Children To School – Atiku",
    "summarized_story": "Former Vice President Atiku Abubakar says education is significant to the development and security of any country.\nAs a result, he believes there is a need to force parents to ensure their children are educated, even at the basic level to have a peaceful society.\n“Parents should be persuaded, even forced, to send their children to school so they, at least, acquire basic education.\nThat basic education should be free and compulsory.\nWhy do we seem reluctant to the idea of providing good quality basic education for all our people?"
  },
  {
    "headline": "Mauritius Records First Two Omicron Cases, More Feared",
    "summarized_story": "The Indian Ocean island nation of Mauritius has recorded its first two infections of the Covid-19 Omicron variant, both linked to people returned from South Africa, with a dozen more contact cases feared.\nOne of the two Omicron cases was detected in a man who flew home to the island from South Africa on November 27.\nMauritius fully opened its doors to international visitors at the start of October, hoping to rebuild its vital tourism industry after long months of isolation because of the pandemic.\nBut it was forced to reimpose restrictions last month as Delta variant cases surged.\nAccording to latest figures reported to the World Health Organization, Mauritius has had 62,652 Covid cases and 680 deaths."
  },
  {
    "headline": "ECOWAS council considers two-term limits for presidents in the region",
    "summarized_story": "ECOWAS council considers two-term limits for presidents in the region"
  },
  {
    "headline": "Akeredolu's aide accuses Federal Fire Service of damaging his vehicle -",
    "summarized_story": "A Special Assistant to the Ondo state Governor, Oluwarotimi Akeredolu on Multimedia, Olugbenga Asade, has accused the Federal Fire Service Corps (Ondo State) of damaging his vehicle.\nHe noted that two months after damaging his vehicle, nothing has been done to fix it by the fire fighters.\nThey declined my request to see the driver that crashed my vehicle.\nHe therefore requested, that the Federal Fire Service Corps should provide the truck driver that crashed his vehicle with an apology for absconding and as well, take responsibility of fixing his damaged vehicle.\nAccording to him, the Federal Fire service in the state has continued to turn deaf ears to his plea."
  },
  {
    "headline": "[WATCH] Bisi Akande unveils Autobiography entitled 'My Participations'",
    "summarized_story": ""
  },
  {
    "headline": "Updated: 28-year-old female lawyer nominated commissioner in Nasarawa -",
    "summarized_story": "A 28 year old female lawyer, Hannah Bala, has been nominated as a Commissioner by the Nasarawa State Governor, Abdullahi Sule.\nThe nomination of the female lawyer was announced at the state House of Assembly by the Speaker, Ibrahim Balarabe.\nThis follows the presentation of fifteen commissioner nominees to the assembly for consideration.\nSpeaking on her nomination, the Nasarawa State governor, Abdullahi Sule through his Chief Press Secretary, said the decision is to encourage and ensure active participation of the youths in governance.\nHannah graduated from the Nasarawa State University Keffi in 2016 and proceeded to the Nigerian law school where she graduated in 2018."
  },
  {
    "headline": "Emirates Suspends All Flights to Nigeria",
    "summarized_story": "Emirates has announced the suspension of its operations into Nigeria.\nThe move was made following the retaliatory action taken by the federal government of Nigeria to reduce an earlier 21 frequencies approved for the UAE airline to just one.\nThe Nigerian government had rescinded its earlier decision to allow Emirates to operate 21 weekly frequencies to Nigeria as a reaction to the refusal of the UAE authorities to grant the request of Air Peace, the only Nigerian airline operating in UAE to operate three weekly flights to Sharjah.\nIn a statement issued by the airline on Friday evening, it declared, “With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be completely suspending its flights between Nigeria and Dubai, until the civil aviation authorities find a solution to the current ongoing issue.\n“We regret the inconvenience this caused, and customers can contact their travel agent or booking office to make alternative arrangements."
  },
  {
    "headline": "Fifty People ‘Likely’ Killed in Tornadoes, Kentucky Governor Says",
    "summarized_story": "Some 50 people are “likely” to have been killed in a devastating outbreak of tornadoes that ripped through Kentucky and several other U.S. states late Friday and early Saturday, Kentucky Governor Andy Beshear said.\nHe told local TV station WLKY that the number of dead could be “significantly north of that”, the Washington Post reported.\nIt added that a spokeswoman for the state’s emergency management service said that rescue officials had not confirmed figures for deaths or injuries as of early Saturday.\nSome of the worst destruction was in Mayfield, in western Kentucky, the New York Times reported.\nThe storms caused a CSX company freight train to derail in western Kentucky, although it said no injuries were reported, the Times said."
  },
  {
    "headline": "New UK Mask Rules Start as Johnson Under Fire Over Parties",
    "summarized_story": "In his current role, Doyle has directed the government’s public statements about the party allegations.\nFor several days, Johnson’s office denied a party had taken place and insisted rules had been followed at all times.\nThat claim unraveled when a leaked video showed senior staff members joking about the alleged party.\nI don’t know.”The Christmas party claims are the latest in a string of allegations of rule-breaking and ethics violations by Johnson and government officials.\nWes Streeting, health spokesman for the opposition Labour Party, said the stream of allegations undermined trust in the government during a public health crisis."
  },
  {
    "headline": "Nigeria: Jolted by Unending Killings, Buhari Sends NSA, IG to Sokoto, Katsina",
    "summarized_story": "Terrorists have been ravaging Sokoto State for almost three years, with several local government areas under the control of the outlaws.\nLast Thursday, three people were killed by extremists who invaded Kurawa village in Sabon Birni Local Government Area of Sokoto State.\nLast Wednesday, the Katsina State Commissioner of Science and Technology, Dr. Rabe Nasir, was killed in his House located at Fatima Shema Quarters, Katsina.\nHe said: “The gruesome murder of Dr. Rabe Nasir, a serving commissioner in Katsina State, is a great loss, not only to Katsina State, but also to the entire nation.\nThere has been outrage in the North since terrorists burnt alive some travellers in Sokoto State early in the week."
  },
  {
    "headline": "Omicron: Obasanjo, Uganda’s Former VP, in Joint Article, Lambast Western World for Red Listing African Countries",
    "summarized_story": "Former NIgeria president Olusegun Obasanjo and the former vice-president of Uganda, Specioza Wandira-Kazibwe, have condemned the travel ban on African countries over concerns relating to the Omicron variant of COVID-19.\nA number of countries in Europe banned travel from countries in Africa following the discovery of the variant by South African scientists.\n“Africa’s embrace of smart multilateralism is manifest in being the first continent to agree on a common digital platform for bio-surveillance and biosecurity.\nIt was as clear as noonday to those of us championing African multilateralism that retreating behind the walls of nationalist survival would be continental suicide.\n“This is smart multilateralism at work."
  }
]