[
  {
    "headline": "Tribunal orders Multichoice to pay FG N900bn tax backlog",
    "summarized_story": "A Tax Appeal Tribunal sitting in Lagos has ordered Multichoice Nigeria Limited, owners of cable television services, DSTV, to pay 50 per cent of N1.8trn tax backlog to the Federal Inland Revenue Service.\nDirector, Communications and Liaison Department of the FIRS, Mr Abdullahi Ahmad, made this known in a statement in Abuja on Wednesday.\nAhmad explained that FIRS discovered the backlog through a forensic audit, as it allegedly showed that Multichoice Nigeria Limited had failed to pay to the Government of Nigeria in past assessment years.\n“Multichoice Nigeria Limited filed the matter at the Lagos TAT following its dispute over FIRS’ issuance of Notices of Assessment and Demand Note in the sum of N1,822,923,909,313.94k on 7 April 2021.\nThe News Agency of Nigeria (NAN) recalls that FIRS had in July announced its plan to engage some commercial banks as agents to freeze and recover N1.8 trillion from accounts of Messrs MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA)."
  },
  {
    "headline": "BREAKING: Serena Williams withdraws from US Open",
    "summarized_story": "Serena Williams has pulled out of the US Open because of a hamstring injury, the American 23-time Grand Slam winner announced on her Instagram page on Wednesday.\n“After careful consideration and following the advice of my doctors and medical team, I have decided to withdraw from the US Open to allow my body to heal completely from a torn hamstring,” wrote the 39-year-old.\nThe US Open starts next Monday.\nAFPDetails later…"
  },
  {
    "headline": "BBNaija S6: Housemates begin payment for party, gym, others",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemates have been asked to start paying for party experience, gym, opening the deep freezer, and use of washing machine.\nThis was contained in a brief read to the house by the Head of House, Liquorose, on Wednesday, day 32 of the show.\nAccording to the brief, the payments will be made in their special currency, Abeg naira.\nThe fee for each service includes party experience – 50 Abeg Naira, washing machine – 50 Abeg Naira, gym – 10 Abeg Naira, and opening the deep freezer – 10 Abeg Naira.\n“The ledger balance and Abeg Naira must always tally."
  },
  {
    "headline": "Alleged Taskforce Extortion: Again, ‘Danfo’ drivers suspend operation along Iyana-Ipaja-Ikotun routes",
    "summarized_story": "This led to chaos on major roads as protesting drivers blocked the road preventing recalcitrant members from operating.\nThe development also affected private car owners as they were stuck in traffic for hours.\nAs early as 6 am, no commercial vehicle could be seen operating as commercial motorcyclists, popularly called “Okada” riders hiking the transport fare.\nMost commuters who could not afford the hiked fare resorted to the long treks to their various destinations.\nChairman, Lagos State Taskforce, a few minutes ago reportedly, met with an executive of National Union of Road Transport Workers, NURTW, Alimosho branch, where some of the differences creating frictions were ironed out."
  },
  {
    "headline": "Southeast is strategic industrial, trade hub ― Osinbajo",
    "summarized_story": "Professor Yemi OsinbajoDetailing some of the ongoing and completed Federal Government projects in the Southeast, Vice President Yemi Osinbajo, affirms that the Buhari administration considers the zone a strategic industrial, trade hub, and a major player in Nigeria’s economic growth.\nProfessor Osinbajo stated this earlier today at the inauguration of two completed projects in Anambra State: the MSMEs Shared Facility at the Ogbunike Leather Trading Cluster, and the Awka 120MVA 132/33kV Sub-Station.\nThe Second Niger Bridge Project which connects Asaba in Delta State and Onitsha in Anambra State has now achieved 65 per cent completion.\nThey also demonstrate our conviction that Anambra State and the Southeast at large, have a huge role to play in our drive to foster economic growth and lift our people out of poverty.\nOn the Ogbunike Shared Facility project, the Vice President said the initiative would transform businesses within and around the cluster, hugely increasing their production capacity."
  },
  {
    "headline": "Zulum’s 52nd birthday marked with launch of 300-page ‘Second Verdict’ in Borno",
    "summarized_story": "By Ndahi Marama, MaiduguriA combination of media aides and social media associates yesterday celebrate the 52nd birthday of Borno State Governor, Prof. Babagana Umara Zulum, with the launch of “Second Verdict”, which is a compendium of published news, analyses, features, columns, commentaries, discourse editorials, selected speeches and scorecard, in the Governor’s second year.\nZulum was born on Monday, August 25, 1969, in Mafa town, Borno State.\nThe unveiling took place on Tuesday night, the eve of Zulum’s 52nd birthday with the theme: “Celebrating Zulum’s 52nd Birthday with 2nd Verdict”.\nSpeaking on Zulum’s media aides and social media associates, Prof. Marte said, “you guys have done a great job.\nThe “Second Verdict” was dedicated to resident journalists and social media promoters as well as many other media supporters of the Governor."
  },
  {
    "headline": "We’re not selling any of Captain’s asset ― Okunbo family",
    "summarized_story": "Captain Hosa OkunboThe family of the late business mogul and philanthropist, Captain (Dr) Idahosa Okunbo, has vehemently denied reports that the family has put up his multi-million naira hotel in Abuja for sale or any of his assets.\n“Suffice it to say, therefore, that this wicked piece is nothing but an unfortunate figment of the evil imagination of depraved persons.\nThe Okunbo family stands united in ensuring the consolidation of the laudable legacy our departed dearly beloved son left behind.\n“This again is another wicked misinformation from demons who will be judged appropriately by our Almighty Father in heaven.\n“We are resolute on this commitment and nothing will distract this family under any circumstance BEFORE, DURING and AFTER the burial obsequies."
  },
  {
    "headline": "BREAKING: Gunmen invade Jos North community in fresh attack, over 30 killed",
    "summarized_story": "By Marie-Therese NanlongSome gunmen on Tuesday night invaded and attacked Yelwan Zangam community, close to the permanent site of the University of Jos, killing about 35 people.\nIt was gathered that the attack occurred at about 9 pm on Tuesday despite the dusk to dawn imposed in the Jos North as well as Jos South and Bassa local government areas.\nThe attackers reportedly shot sporadically, gunning down fleeing residents and burning some others within their homes.\nBefore the incident, the fragile bridge linking the community to other communities was allegedly destroyed to prevent help from coming to the people.\nThe State Police Command is to is yet to confirm the incident but locals have already posted dead bodies recovered on the different social media platforms."
  },
  {
    "headline": "Yelwan massacre: Buhari government has abandoned Plateau – Senator Gyang",
    "summarized_story": "Senator representing Plateau North Senatorial district, Instifanus Gyang has described Tuesday’s invasion of Yelwan Zangam in Jos North Local Government Area of Plateau State as a ‘night of terror’.\nHe said the State has been abandoned by the Buhari-led government.\nYelwan Zangam community came under bandits’ attack on Tuesday leading to the massacre of 35 persons, some of whom were burnt beyond recognition.\nIn a statement he made available to DAILY POST, he said: “The situation on the Plateau is that of a people abandoned to their fate by the Federal Government.\nGyang called on government to demonstrate sincerity in securing lives of all citizens, Plateau people inclusive, and take all necessary and decisive action to apprehend and prosecute the perpetrators."
  },
  {
    "headline": "Primate Ayodele reacts to NDA attack, reveals bandits’ next target",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has reacted to the attack by bandits on the Nigerian Defence Academy, NDA, in Kaduna who killed two officers and abducted one yesterday.\nPrimate Ayodele said the attack was a shame to the Department of State Services, DSS, and the security system of Nigeria.\nAn intelligence report should have been made available by the DSS before the attack on the NDA.\nHe warned the security agencies to immediately secure the place against another dangerous attack by the bandits.\n‘‘The National Institute For Policy And Strategic Studies, Kuru is the bandits next target."
  },
  {
    "headline": "Killings, abductions: Ahmed Gumi reveals only way out of insecurity in Nigeria",
    "summarized_story": "Renowned Islamic scholar, Ahmed Gumi has identified unity as a major force in tackling the security crisis currently bedeviling the entire nation.\nGumi, during a lecture in Kaduna State on Wednesday titled “Security and National Development”, said the battle is not against any religion or ethnicity, stating that Nigerians need to come together and tacked the security challenges.\nHe said, “The security situation in Nigeria is not about religion or ethnicity, it is affecting all of us.\nNigerians need to come together as a force to fight this criminals”.\nSame day, unknown gunmen invaded Yelwa Zangam community, Jos North Local Government Area of Plateau State and slaughtered about 36 residents."
  },
  {
    "headline": "Nigeria, Russia sign military cooperation deal",
    "summarized_story": "Nigeria and Russia have signed a new military-technical cooperation agreement.\nA statement by the Nigerian Embassy in Russia said the deal provides a legal framework for the supply, servicing of military equipment, training of personnel and technology transfer.\n), who led top military officials to Russia, signed on behalf of Nigeria.\nDmitry Shugaev, Director of Federal Service for PliIitary-Technical Cooperation signed on behalf of Russia.\nIn 2017 and 2019, Nigeria and Russia signed military cooperation and trade agreements."
  },
  {
    "headline": "Guard against sensationalizing your report – Niger CP to journalists",
    "summarized_story": "The Commissioner of Police Niger State command, CP Monday Bala Kuryas has urged journalists not to sensationalize their report.\nKuryas stated this during a courtesy visit by the leadership of Nigeria Union of Journalists, NUJ, Niger State Council at the police headquarters in Minna.\nCP Kuryas explained that as the watchdog of the society, journalists must at all times guard against report that could further creat more challenges to the state.\n“Journalists have a critical role to play towards ensuring balanced reporting aimed at promoting corporate existence of the people,” he stated.\nEarlier, the Chairman of the State Council of NUJ, Comr."
  },
  {
    "headline": "31 Nigerian cities risk flooding, experts warn",
    "summarized_story": "A fellow of the Nigerian Society of Engineers (NSE), Mr Sunday Egbiki, has raised an alarm that 31 Nigerian cities risk being washed away by flood.\nAccording to him, Lagos State, Kogi, Niger, Benue, Nassarawa and Plateau are among the 31 states at risk of being washed away by flooding.\n“Out of the 36 states in Nigeria, it is only five cities that are not affected by flooding.\nCiting Lagos State as an example, Egbiki said several flood plains had been built up resulting in constant flooding being experienced in the state.\nAccording to him, Net Zero Carbon Buildings will ensure adoption of construction methods that lowered energy and water consumption in houses thereby reducing carbon footprints."
  },
  {
    "headline": "Ex-military officers to be engaged to boost security, says CDS",
    "summarized_story": "The Army has said it will engage retired senior military officers to enhance and overcome the security challenges the country is facing.\nThe Chief of Defence Staff (CDS), Gen. Leo Iraboh, announced this yesterday at a one-day interactive session with retired senior military officers from the Northeast at the 23 Armoured Brigade in Yola, the Adamawa State capital.\nAccording to the CDS, among the cardinal objectives of the parley is the need to come up with solutions, as security is everybody’s business.\nADVERTISEMENTThe CDS said he believed that solutions to the lingering security challenges in the region lie with the people.\n“Also, we believe that in the coming days, security will improve and be better in the region and Nigeria,” he said."
  },
  {
    "headline": "Military launches manhunt for officer’s abductors at NDA",
    "summarized_story": "NDA is a military university that trains officer cadets for commissioning into one of the Army, the Navy, and the Air Force.\nIt said the situation has become so bad that gunmen now have the temerity to attack military formations and kill officers.\nMany African countries train their military officers here.\n“Today the factory where all Nigerian military officers are produced has been invaded and desecrated.\nKaduna State House of Assembly Speaker, Yusuf Zailani, described the attack as an assault on Nigeria’s territorial integrity."
  },
  {
    "headline": "Nigerians won’t forgive leaders if PDP loses 2023 elections – PDP youths",
    "summarized_story": "The youth wing of the Peoples Democratic Party (PDP) has asked the party’s leadership to quickly step and prevent the crisis from consuming the party ahead of the 2023 general elections.\nThe opposition party’s youths wing under the auspices of PDP National Youth Movement said Nigerians will not forgive the PDP if it by any means allow the ruling All Progressives Congress (APC) win the 2023 general elections because of “avoidable and resolvable crisis.”President of the PDP Youths Movement, Engr.\nSalaudeen Lukman, in a statement on Wednesday also alleged the crisis rocking the PDP is a clear handiwork of external forces suspected to be that of the ruling party.\nThey accused the APC of sponsoring intruders to destabilise the major opposition party ahead of 2023 general elections.\n“PDP therefore has no reason to disappoint Nigerians or dash the hope of all citizens with this avoidable and resolvable crisis.”"
  },
  {
    "headline": "Nasarawa: Unknown gunmen abduct NASIEC Secretary",
    "summarized_story": "From Abel Leonard, LafiaThe Nasarawa State Police Command has confirmed the abduction of the Secretary of the Nasarawa State Independent Electoral Commission (NASIEC), Barrister Mohammed Opu, at his residence located at Bakin Rijiya Village, along Lafia-Shandam Road, Lafia.\nThis was contained in a press release made available to reporters on Wednesday, signed by police spokesman ASP Ramhan Nansel for the Commissioner of Police.\nThe statement reads:"
  },
  {
    "headline": "BREAKING: 36 victims burnt alive by bandits in Plateau community",
    "summarized_story": "From Gyang Bere, JosNo fewer than 36 persons were burned to death when Fulani bandits attacked Yelwan Zangam community in Jos North Local Government Area of Plateau State.\nThe massacre reportedly occurred in the early hours of Wednesday, leaving women, children and the aged dead in their sleep.\nThe attackers also burnt houses with food items.\nDavid Zaion, a member of the community, who confirmed the incident, said that attackers invaded the community and killed everything in sight.\n‘We have recovered 36 corpses of people who were killed by the Fulani, most of the corpses were burnt beyond recognition,’ he said."
  },
  {
    "headline": "Anger, fear as bandits invade NDA, kill 2 officers, abduct Major",
    "summarized_story": "The bandits reportedly entered the NDA premises disguised in military uniforms and passed through the security gate into the academy officers quarters and started shooting sporadically.\nIt is very worrisome that bandits could have the audacity to attack military academy and kill officers.\nThis has never happened in the history of the military that bandits could have the effrontery to attack military academy.\nToday, the factory where all Nigerian military officers are produced has been invaded and desecrated.\nWhat else do we need to show that our national security system is running on reverse gear?"
  },
  {
    "headline": "Confusion in PDP as Akinwonmi, Nazif lay claim to party leadership",
    "summarized_story": "From Ndubuisi Orji, Abujacrisis rocking the Peoples Democratic Party (PDP) assumed a new twist, yesterday, as the Deputy National Chairman ( South), Elder Yemi Akinwonmi and the Deputy National Chairman (North), Suleiman Nazif, laid claim to the leadership of the opposition party.\nA Degema High Court, in Rivers State, had on Monday, restrained the PDP National Chairman, Uche Secondus, from parading himself as national chairman, pending determination of the substantive suit.\nNazif explained that Section 35(3)(d) of the PDP Constitution (2017) empowers him to take over the affairs of the party in acting capacity, in the absence of the national chairman and deputy national chairman (South).\nHowever, Akinwonmi insisted he was the authentic acting national chairman of the party and declared Nazif’s decisions null and void.\nThe chairman is followed by the deputy national chairman 1 (South), followed by the deputy national chairman (north)."
  },
  {
    "headline": "Insecurity: Over 100,000 killed in North East –Zulum",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGovernor Babagana Zulum said over 100,000 people have been killed in the 12-year insurgency in the North East.\nHe also said the whereabouts of about 10 per cent Borno indigenes were not known as a result of insecurity in the state.\nHe said 2,600 insurgents were in custody of the state, but not all of them that have surrendered were criminals.\nZulum made the disclosure while briefing journalists after a meeting with President Muhammadu Buhari in Abuja, yesterday.\nHe said no law prescribes the killing of surrendered insurgents, saying they would be trained for the purpose of reintegration into the society."
  },
  {
    "headline": "We’re Not Selling Captain Okunbo’s Assets, Says Family",
    "summarized_story": "Segun JamesThe family of the late business mogul and philanthropist, Captain Idahosa Okunbo, has vehemently denied reports that the family has put up his multi-million naira hotel in Abuja for sale or any of his assets.\n“Suffice it to say therefore, that this wicked piece is nothing but an unfortunate figment of the evil imagination of depraved persons.\nThe Okunbo family stands united in ensuring the consolidation of the laudable legacy our departed dearly beloved son left behind.\n“This again is another wicked misinformation from demons who will be judged appropriately by our Almighty Father in heaven.\n“We are resolute on this commitment and nothing will distract this family under any circumstance BEFORE, DURING and AFTER the burial obsequies."
  },
  {
    "headline": "Breaking: Gunmen Attack Jos North, Kill 36",
    "summarized_story": "Seriki AdinoyiUnknown gunmen have attacked Yelwa-zangam community, behind the University of Jos, in Jos North Local Government Area, killing over 36 persons.\nEyewitnesses in the community said the armed men invaded the community at about 9pm on Tuesday and raided for hours without help from security agents.\nThey shot, killing and maiming everyone on sight, and also burning houses.\nAn entire family was burnt alive in their homes while others that attempted to run into nearby bush were shot.\nYelwa-zangam community is dominated by Christian Anagutta natives."
  },
  {
    "headline": "Shock, Anger, Trail Daredevil Attack on Nigeria’s Elite Military University",
    "summarized_story": "The military university, Nigerian Defence Academy (NDA), Kaduna, came under attack in the early hours of yesterday.\nMany African countries train their military officers here.\n“Today, the factory where all Nigerian military officers are produced has been invaded and desecrated.\n“On its part, the Kaduna State government will continue to take actions considered imperative in the campaign against bandits throughout the state,” Aruwan said.\nFurther details will be released later.”In a related development, Speaker of the Kaduna State House of Assembly, Hon."
  },
  {
    "headline": "Sanusi: Ending Subsidies Puts Nigeria on Fiscal Sustainability Path",
    "summarized_story": "He also warned the government against excessive borrowing, describing it as a time-bomb.\nIt is desirable, but not sustainable but we have to be ready to make certain sacrifices.\n“This generation will continue borrowing to consume while passing the debt to the next generation to pay.\n“Those who know me know that in many ways I am passionate about issues around women and girls.\n“Given the responsibility to raise at least $2 million in five years and i dare say that five years is too long."
  },
  {
    "headline": "Ortom: Buhari Making Grazing Routes, Reserves Condition for Peace",
    "summarized_story": "“From my previous discussions with the president, it is obvious he believes for peace to reign, grazing routes and reserves must be opened for herdsmen.\n“Even most of the northern states have agreed that open grazing is un-Islamic and as Christians, open grazing has been frowned at in the Bible in the book of Exodus.\nOrtom, who said it was disappointing for President Buhari to declare a review of Grazing Routes and Reserves, was also concerned that the president might have been misquoted.\nHis words: “With the array of responsible and learned people around Mr. President, it is quite disappointing to hear the president come out to declare a review of grazing routes and reserves.\n“It is, therefore, questionable why he would choose to open ranches in Katsina and open grazing routes and reserves in other states."
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "BREAKING: 30 Residents Reported Dead In Fresh Attacks In Jos",
    "summarized_story": "Many people have been reportedly killed at Yelwan Zangam community in Jos North Local Government Area of Plateau State.\nAccording to Daily Trust, several houses were also burnt down in the attacks which reportedly claimed more than 30 lives.\nThis is coming barely one week after 27 travelers were killed in Gada-biyu – Rukuba road, still in Jos North LGA.\nHe said more than 30 people were killed, adding that security personnel had been deployed in the area.\nThe Plateau State Police Command is to is yet to give details of the incident, as at the time of filing this report."
  },
  {
    "headline": "'Many killed', houses razed in fresh attack on Plateau community",
    "summarized_story": "An unconfirmed number of people have been reportedly killed in Yelwa Zangam, a community in Jos North LGA of Plateau state.\n“The command is aware of the incident at Yelwa Zangam,” he said.\nAdvertisementIt also comes about eight days after five people were killed at Chando-Zrrechi village, Miango district of Bassa LGA of Plateau state.\nThere has been tension in Plateau after 22 travellers returning to Ondo state from Bauchi were killed on August 14 along Rukuba highway in Jos North LGA of the state.\nSimon Lalong, the state governor, had declared a 24-hour curfew in Jos North and dusk-to-dawn restriction in Jos South and Bassa LGAs."
  },
  {
    "headline": "'Many killed', houses razed in fresh attack on Plateau community",
    "summarized_story": "An unconfirmed number of people have been reportedly killed in Yelwa Zangam, a community in Jos North LGA of Plateau state.\n“The command is aware of the incident at Yelwa Zangam,” he said.\nAdvertisementIt also comes about eight days after five people were killed at Chando-Zrrechi village, Miango district of Bassa LGA of Plateau state.\nThere has been tension in Plateau after 22 travellers returning to Ondo state from Bauchi were killed on August 14 along Rukuba highway in Jos North LGA of the state.\nSimon Lalong, the state governor, had declared a 24-hour curfew in Jos North and dusk-to-dawn restriction in Jos South and Bassa LGAs."
  },
  {
    "headline": "'Tax evasion': Tribunal orders Multichoice to deposit N900bn with FIRS before hearing appeal",
    "summarized_story": "A tax appeal tribunal (TAT) sitting in Lagos has ordered Multichoice Nigeria Limited to deposit 50 percent of the disputed N1.8 trillion tax with the Federal Inland Revenue Service (FIRS).\nMultichoice is the owner of the satellite televisions, DStv and Gotv – popular subscription-based platforms in NigeriaIn July, the FIRS had appointed some commercial banks as agents to recover N1.8 trillion from accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA).\nThe FIRS said it determined through a forensic audit that Multichoice Nigeria Limited had failed to pay to the government of Nigeria taxes worth N1.8 trillion.\nAdvertisementIn its reaction, Multichoice had assured that it would work with FIRS to prove its tax compliance.\nAhmed, its chairman, issued the order following an application brought to the tribunal by the counsel to FIRS."
  },
  {
    "headline": "'Tax evasion': Tribunal orders Multichoice to deposit N900bn with FIRS before hearing appeal",
    "summarized_story": "A tax appeal tribunal (TAT) sitting in Lagos has ordered Multichoice Nigeria Limited to deposit 50 percent of the disputed N1.8 trillion tax with the Federal Inland Revenue Service (FIRS).\nMultichoice is the owner of the satellite televisions, DStv and Gotv – popular subscription-based platforms in NigeriaIn July, the FIRS had appointed some commercial banks as agents to recover N1.8 trillion from accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA).\nThe FIRS said it determined through a forensic audit that Multichoice Nigeria Limited had failed to pay to the government of Nigeria taxes worth N1.8 trillion.\nAdvertisementIn its reaction, Multichoice had assured that it would work with FIRS to prove its tax compliance.\nAhmed, its chairman, issued the order following an application brought to the tribunal by the counsel to FIRS."
  },
  {
    "headline": "Report: How parents sold property to raise ransom for abducted children in Niger state",
    "summarized_story": "Abubakar Adam, a resident of Niger state, says he sold his car, land and other property to raise the ransom for the release of his 11 children.\nAdvertisementAdam’s children were part of the 156 students and teachers abducted from Salihu Tanko Islamic School located in Tegina town in Rafi LGA of the state on May 30.\nThe bandits had demanded N110 million ransom for the release of the abductees.\nAccording to Reuters, Adam, a 40-year old tyre repairer, said he was able to raise N3 million after selling his property and clearing out his savings.\nEarlier, Chukwuemeka Nwajiuba, the minister of state for education, said the federal government is “constrained to stop negotiations” with bandits, adding that ransom payment is fuelling abductions."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "Bitnob connects with U.S.-based Strike via Bitcoin Lightning Network",
    "summarized_story": "But the Bitcoin Lightning Network connecting Strike and Bitnob is a system that could disrupt and improve how money is transferred across the world.\nWith @Bitnob_official's Lightning Network integration, we now have free, instant, non-reversible remittances of any size to and from the United States, Nigeria, and Ghana.\nMichael: Tell me about the Lightning Network connecting Strike and Bitnob.\nLike flyovers that are much faster and with less traffic, the Lightning Network does the same Bitcoin transactions but it is instantly settled, regardless of where you’re sending Bitcoin from.\nBecause we’re interoperable with Strike, we’re able to instantly settle transactions via the Lightning Network without the sender or receiver needing to touch Bitcoin or knowing that the transaction was done through the Lightning Network."
  },
  {
    "headline": "Nigeria wants businesses registered in hours, yet it takes months",
    "summarized_story": "Nigeria wants businesses registered in hours, yet it takes monthsHassana (not her real name) is wedged behind her HP workstation with stacks of documents required to register a client’s business in a one-room apartment in Jabi, Abuja.\nOn a table nearby, a scanner and a printer whir along as she spends monotonous hours signing and scanning document after document to upload onto the website…"
  },
  {
    "headline": "Citizens helpless as bandits humiliate Nigeria’s military",
    "summarized_story": "Different groups of ragtag gangs with no known military training and described as ‘bandits’ are exposing the severe weaknesses in Nigeria’s security architecture through attacks that are humiliating for the Nigerian military.\nThe so-called bandits have murdered at least one army general, while a number of senior Nigerian military officers and several soldiers have been…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Families sell house and land to free kidnapped relatives, says Reuters",
    "summarized_story": "He sent his 3-million naira ($7,300) into the bush, together with payments from other families in his town of Tegina.\nPresident Muhammadu Buhari has told states not to pay anything to kidnappers, saying it will only encourage more abductions.\nThe owner of the school sold off half the grounds.\nInformation minister Lai Mohammed defended the strategy not to pay ransoms, saying the government had destroyed many bandit camps and tried other approaches to tackle banditry.\nIt all explains, Bukarti of the EPU said, why Adam and other parents are willing to sell everything they have to pay ransoms themselves."
  },
  {
    "headline": "Washed off road: Project constructed by Federal Ministry of Agric – Edo govt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said viral pictures of a poorly executed road project linking Uokha and Ohami in Owan East Local Government Area (LGA) of the state, which according to reports washed off two months after completion, is a project of the Federal Ministry of Agriculture and Rural Development.\nChief of Staff to the Edo State Governor, Osaigbovo Iyoha, in a statement, said the project does not represent the standard of roads constructed by the Edo State Government, reassuring the government’s commitment to quality and durable infrastructure.\nAccording to him, “The attention of the Edo State Government has been drawn to viral online pictures showing shoddy job on a road project linking Uokha and Ohami in Owan East Local Government Area of Edo State, which according to reports, washed off two months after completion.\n“The poorly executed project, titled ‘construction of 4.0km Asphaltic Road at Uokha to Ohami,’ as clearly stated in the signpost at the construction site, is a project of the Federal Ministry of Agriculture and Rural Development and executed by Messr.\n“The shoddy and substandard job does not represent the standard of projects in Owan East or any part of Edo State under the leadership of Governor Godwin Obaseki."
  },
  {
    "headline": "Obaseki eulogises late Captain Hosa Okunbo, celebrates life of selfless service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has described late Capt.\nIdahosa Okunbo as an icon of selfless service, noting that his death was a great loss to the state and country.\nThe governor said this when he paid a condolence visit to the Okunbo family in Benin City, the Edo State capital.\nIdahosa Okunbo is not just a loss to the Okunbo family, it is a bigger loss to the Benin and Edo family, as well as Nigeria.\nWe must learn from his life, particularly his life of generosity.”“Captain was generous to a fault."
  },
  {
    "headline": "Obaseki meets police, army chiefs, urges efforts to tackle arms build-up, set up of military bases in crime-prone areas – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased synergy between the government and security agencies to tackle the proliferation of arms and combat insecurity in the state.\nObaseki also received the Inspector General of Police (IGP), Usman Alkali Baba, stating the need to set up a special squad to tackle arms build-up in Edo communities.\nWe also appeal that you support us with a special squad to complement our efforts in calming the restiveness that we are seeing around communities, largely because of land disputes.\n“We will be seeking your assistance to help us set up a special squad to handle this problem, especially the arms buildup in communities across the State.\nEarlier, the IGP commended Obaseki for ensuring synergy between the government and the police, noting, “Edo State is the best amongst states in the federation in terms of community policing."
  },
  {
    "headline": "IGP Alkali lauds Edo govt on security, tasks officers on commitment to duty. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Inspector-General of Police IGP Usman Alkali Baba has commended the Edo State government for the support it gives to the state police command.\nAlso, the IGP urged operatives of the state police command to reciprocate the state government support by ensuring that Edo State is better policed than before.\nIGP Alkali stated this while addressing men and officers of Edo State Police Command at the state police headquarters in Benin City, yesterday.\nIGP Alkali further expressed confidence that the rebuilding of some police infrastructure destroyed during the EndSARS crisis in Benin City would also serve as morale booster.\nThe IGP who was in Benin City on a one-day familiarisation visit, urged the officers to keep hope alive as the proposed review of their salaries would soon be achieved."
  },
  {
    "headline": "Nigerian Exchange marks 60 years of operation",
    "summarized_story": "ADVERTISEMENTNigerian Exchange Group (NGX Group) Wednesday commemorates its 60 years of operation as a leading integrated market infrastructure group on the continent, the bourse said in a statement.\nThe group, which has seen a raft of transformations since inception, started activity in an official capacity on August 35, 1961, roughly nine months after inauguration, when it adopted the moniker, Lagos Stock Exchange.\n“We celebrate the vision of these seven individuals and organisations, who in the Nigerian spirit, broke new ground in starting the Exchange, and we are proud of our sterling history over these six decades,” said Group Chairman Abimbola Ogunbanwo.\nThe exchange took the name Nigerian Stock Exchange in 1977, establishing branches in a couple of commercial hubs across the country.\nThe exchange this year transition from a mutual company to a public firm, a milestone occasioning the adoption of its new name, the Nigerian Exchange group."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Tribunal orders Multichoice to pay 50% tax backlog before appeal hearing",
    "summarized_story": "A Tax Appeal Tribunal (TAT) sitting in Lagos, has ordered pay TV outlet, Multichoice Nigeria Limited, to pay 50 percent of N1.8 trillion to the Federal Inland Revenue Service (FIRS) over alleged tax evasion.\nAbdullahi Ismaila Ahmad, FIRS spokesperson, made this known in a statement on Wednesday.\nMultichoice is the owner of the satellite television, DSTV, a popular subscription-based platform in NigeriaThe FIRS said it determined through a forensic audit that Multichoice Nigeria Limited had failed to pay to the government of Nigeria taxes worth N1.8 trillion.\nThe five-member TAT led by A.B.\nAhmed, its Chairman, issued the order following an application to it by the counsel to FIRS"
  },
  {
    "headline": "Real Madrid make €160m bid for Mbappe",
    "summarized_story": "Spanish giants, Real Madrid has offered €160 million ($188 million) to Paris Saint-Germain for 22-year-old France World Cup winner Kylian Mbappe, French and Spanish media reported on Wednesday.\nAccording to outlets L’Equipe and Le Parisien the Ligue 1 club have rejected the proposal for 22-year-old Mbappe, whose contract at the Parc de Princes expires next June.\nPSG paid 180 million euros to Monaco for the forward in 2017 and are keen for him to sign a new deal, AFP reported.\nAfter the arrival of Lionel Messi in Paris earlier this month club president Nasser Al-Khelaifi said Mbappe “has no reason to do anything else” but stay.\nMbappe has scored once and provided two assists in three appearances so far this term with Messi expected to make his PSG debut at Reims on Sunday."
  },
  {
    "headline": "Buhari’s insistence on grazing reserves an open invitation to “Afghanistanisation” of Nigeria – Adeniyi",
    "summarized_story": "Reacting to the development in a chat with Business Hallmark, Chief Adeniyi said the idea of grazing reserves is unacceptable and must be rejected by all Nigerians.\nAdeniyi said the attempt is an unmitigated provocation, and called on relevant stakeholders in Nigeria to call Buhari to order before he plunges the country into deep crisis.\nIt is just not fair.”According to Adeniyi, cattle rearing is a private business and should never be the business of the government.\nGovernments don’t own these cows, why should Federal Government under President Buhari insist on raising the temperature of the polity all the time.\nDeliberate provocation and open invitation to ‘Afghanistanisation’ and ‘Somalianisation’ should not be allowed to compound their woes.”"
  },
  {
    "headline": "Transcorp Plc names Oliver Andrews as Independent Non-Executive Director",
    "summarized_story": "The Board of Directors of Transnational Corporation of Nigeria Plc (Transcorp Plc) has announced the appointment of Mr. Oliver Andrews as an Independent non-Executive Director of the company, with effect from 20th of August, 2021.\nThe company disclosed in a notice signed by its secretary, Kofo Olokun-Olawoyin, and sent to the floor of the Nigerian Exchange Limited (NGX).\nMr. Andrews is an accomplished consultant and development expert with over thirty-five (35) years of relevant experience in infrastructure development, investing, public-private partnership and strategic advisory work.\nHe was formerly Executive Director and Chief Investment Officer at the Africa Finance Corporation (AFC) and also served as CEO of TCI Infrastructure and the Gambian Ports Authority.\nThis is in addition to various Board and leadership roles that he actively participated in."
  },
  {
    "headline": "We’re Not Selling Any Of Okunbo’s Assets – Family",
    "summarized_story": "The family of the late business mogul and philanthropist, Captain (Dr.) Idahosa Okunbo, has vehemently denied reports that the family has put up his multi-million naira hotel in Abuja for sale or any of his assets.\n“Suffice it to say, therefore, that this wicked piece is nothing but an unfortunate figment of the evil imagination of depraved persons.\nThe Okunbo family stands united in ensuring the consolidation of the laudable legacy our departed dearly beloved son left behind.\n“This again is another wicked misinformation from demons who will be judged appropriately by our Almighty Father in heaven.\n“We are resolute on this commitment and nothing will distract this family under any circumstance BEFORE, DURING and AFTER the burial obsequies."
  },
  {
    "headline": "We’re Not Selling Any Of Okunbo’s Assets – Family",
    "summarized_story": "The family of the late business mogul and philanthropist, Captain (Dr.) Idahosa Okunbo, has vehemently denied reports that the family has put up his multi-million naira hotel in Abuja for sale or any of his assets.\n“Suffice it to say, therefore, that this wicked piece is nothing but an unfortunate figment of the evil imagination of depraved persons.\nThe Okunbo family stands united in ensuring the consolidation of the laudable legacy our departed dearly beloved son left behind.\n“This again is another wicked misinformation from demons who will be judged appropriately by our Almighty Father in heaven.\n“We are resolute on this commitment and nothing will distract this family under any circumstance BEFORE, DURING and AFTER the burial obsequies."
  },
  {
    "headline": "Buhari’s Commitment To Niger Delta Devt Unprecedented – APC Group",
    "summarized_story": "The APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress (APC) has described the numerous achievements of the President Muhammadu Buhari-led administration in the Niger Delta as unprecedented in the history of the oil producing region.\nThis is yet another jinx broken by President Buhari.\nToday, spurred by the Buhari Administration’s New Vision for the Niger Delta, there are several Modular Refinery construction projects ongoing across the Niger Delta, all led by the private sector.\nThe OPAC Refinery in Delta State has also been completed.\nThe Niger Delta Development Commission (NDDC) is being reformed and repositioned, in line with the President’s vision of ensuring that the people of the Niger Delta benefit maximally from the wealth of their land."
  },
  {
    "headline": "Buhari’s Commitment To Niger Delta Devt Unprecedented – APC Group",
    "summarized_story": "The APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress (APC) has described the numerous achievements of the President Muhammadu Buhari-led administration in the Niger Delta as unprecedented in the history of the oil producing region.\nThis is yet another jinx broken by President Buhari.\nToday, spurred by the Buhari Administration’s New Vision for the Niger Delta, there are several Modular Refinery construction projects ongoing across the Niger Delta, all led by the private sector.\nThe OPAC Refinery in Delta State has also been completed.\nThe Niger Delta Development Commission (NDDC) is being reformed and repositioned, in line with the President’s vision of ensuring that the people of the Niger Delta benefit maximally from the wealth of their land."
  },
  {
    "headline": "CNPP To Lawan: Your Advice Against External Borrowing Belated",
    "summarized_story": "The Conference of Nigeria Political Parties (CNPP) has described as “belated and a clear sign of the level of incompetence and lack of foresight in and around the President Muhammadu Buhari administration” the advice by senate president Ahmad Lawan for reduction in borrowing to fund annual budget.\nThe umbrella body of all registered political parties and political associations in the country also called on anti-graft agencies to identify, recover stolen revenues, arrest and prosecute all heads of agencies and ministries involved in the alleged unremitted internally generated revenue (IGR) in the country.\nADVERTISEMENT“It is a shame that Nigeria has the current principal officers of the National Assembly, the worse anti-people legislative leaders since the advent of the current democratic experiment.\n“With the confirmation by the President of the Senate that several agencies of the federal government are not remitting their internally generated revenues to the national treasury depicts of the unprecedented level of hypocrisy in the fight against corruption by the Buhari administration.\n“We call on all relevant anti-graft agencies to rise up to their duties to not only prevent the looting of the nation’s treasury but toalso swing into action immediately to identify, recover stolen revenues, arrest and prosecute all heads of agencies and ministriesinvolved in the alleged unremitted internally generated revenues to the Treasury Single Account (TSA)”, the CNPP charged."
  },
  {
    "headline": "Outrage as uniform-wearing gunmen attacked NDA",
    "summarized_story": "GUNMEN wearing army uniform, in the early hours of Tuesday, invaded the country’s foremost military institution, the Nigerian Defence Academy, Afaka, Kaduna, killing two officers and abducting one.\nIt was learnt that the gunmen, who headed in different parts of the premises, caught the officers on duty off guard because they were wearing military uniform.\nThe officers killed by the gunmen were Lieutenant Commander Wulah and Flight Lieutenant Commander Okoronkwo; while one Major Datong was said to be missing.\nThey were fully kitted in military camouflage and forced their way into the academy before proceeding to the officers’ quarters.\nThe NDA spokesman stated in a statement titled, ‘Security breach of the Nigerian Defence Academy architecture’, that the cadets and the community were safe."
  },
  {
    "headline": "Outrage as uniform-wearing gunmen attacked NDA",
    "summarized_story": "GUNMEN wearing army uniform, in the early hours of Tuesday, invaded the country’s foremost military institution, the Nigerian Defence Academy, Afaka, Kaduna, killing two officers and abducting one.\nIt was learnt that the gunmen, who headed in different parts of the premises, caught the officers on duty off guard because they were wearing military uniform.\nThe officers killed by the gunmen were Lieutenant Commander Wulah and Flight Lieutenant Commander Okoronkwo; while one Major Datong was said to be missing.\nThey were fully kitted in military camouflage and forced their way into the academy before proceeding to the officers’ quarters.\nThe NDA spokesman stated in a statement titled, ‘Security breach of the Nigerian Defence Academy architecture’, that the cadets and the community were safe."
  },
  {
    "headline": "BBNaija: Why Angel is my ‘favorite girl’ in the house – Boma",
    "summarized_story": "BBNaija: Why Angel is my ‘favorite girl’ in the house – BomaBBNaija: Why Angel is my ‘favorite girl’ in the house – BomaBig Brother Naija Shine Ya Eye housemate, Boma, has stated that Angel is his favorite girl in the house.\nShe lets you know where she stands.”Cross said, “The two girls that are really truthful in this house are Nini and Angel.”Reacting to the statement, Boma said, “Angel is my favorite though.\nI don’t want any problem.”Agreeing with Boma, Cross said, “My favorite lady in the house is Angel.”Cross and Boma then agreed that Angel is the favorite girl for most of the guys in the house.\nBoma and Angel situationBoma has grown very fond of Angel lately, as the duo are always seen together around the house.\nIt started when Angel spent her time at the Executive lounge with Boma."
  },
  {
    "headline": "BBNaija: Why Angel is my ‘favorite girl’ in the house – Boma",
    "summarized_story": "BBNaija: Why Angel is my ‘favorite girl’ in the house – BomaBBNaija: Why Angel is my ‘favorite girl’ in the house – BomaBig Brother Naija Shine Ya Eye housemate, Boma, has stated that Angel is his favorite girl in the house.\nShe lets you know where she stands.”Cross said, “The two girls that are really truthful in this house are Nini and Angel.”Reacting to the statement, Boma said, “Angel is my favorite though.\nI don’t want any problem.”Agreeing with Boma, Cross said, “My favorite lady in the house is Angel.”Cross and Boma then agreed that Angel is the favorite girl for most of the guys in the house.\nBoma and Angel situationBoma has grown very fond of Angel lately, as the duo are always seen together around the house.\nIt started when Angel spent her time at the Executive lounge with Boma."
  },
  {
    "headline": "Video: What could be making Wike so happy, dancing victoriously?",
    "summarized_story": "Rivers State Governor, Nyesom Wike has been caught on video dancing joyously as if he has won a big trophy.\nWike may have won a big battle, he succeeded in using the court to oust Uche Secondus as PDP National chairman.\nWhat this his trophy?\nWatch below as he dances."
  },
  {
    "headline": "Breaking: Another massacre in Jos, 35 killed",
    "summarized_story": "Gunmen have killed no fewer than 35 people in Jos, just some two weeks after muslim travellers were massacred on Rukuba road.\nThe latest killing occurred Tuesday night at Yelwa Zangam community behind the University of Jos (UNIJOS).\nA resident, Yakubu, confirmed the fresh attack to reporters on Wednesday morning, according to The Nation.\nHe said more than over 30 people were killed and security personnel had been drafted to the area.\nSince the Rukuba, Jos has been gripped by reports of deadly violence."
  },
  {
    "headline": "Tinubu Spends Over 60 Days On Foreign Medical Treatments Amid 2023 Presidential Ambition",
    "summarized_story": "Tinubu was taken out of the nation to Paris, France, a few days before Christmas in 2020.\n“Tinubu is undergoing medical examinations in Paris, France.\nOn August 9, Tinubu had another knee surgery at the John Hopkins University Hospital in Maryland, the United States.\nSources close to Tinubu had told SaharaReporters that he wanted the surgery in Paris, France but changed his plan over rumours of his death.\nThis is despite the push for his 2023 presidential ambition by certain bodies such as South West Agenda for Asiwaju Bola Ahmed Tinubu (SWAGA 23)."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap NASIEC Secretary In Nasarawa",
    "summarized_story": "Muhammed Abubakar Opu, the Secretary of the Nasarawa State Independent Electoral Commission, has been kidnapped by unknown gunmen.\nASP Ramhan Nansel, the state’s Police Public Relations Officer, made the disclosure in a statement made available to our Correspondent on Wednesday in Lafia.\nHe explained that a group of about five unidentified gunmen stormed the NASIEC Secretary’s house in Bakin Rijiya Village, along the Lafia-Shendam Road, around 11.45 p.m. on Tuesday night and abducted him to an unknown destination.\nHe urged members of the public to support the police by providing important information that would aid in the arrest of criminals and the rescue of the victim.\nOn October 6th, NASIEC stated that it would hold Local Government Area elections across the state’s 13 LGAs to replace vacant positions for Chairmen and Councilors."
  },
  {
    "headline": "PDP Splits As Two Chairmen Emerge, Wike, Secondus Divide NWC",
    "summarized_story": "Nigeria’s leading opposition party, the Peoples Democratic Party, was on Tuesday factionalized with the emergence of two acting national chairmen.\nOn Tuesday, Akinwonmi issued a statement declaring himself as the acting national chairman in the absence of Secondus, citing Section 45 (2) of the PDP Constitution.\nThe deputy national chairmen shall perform the following functions: 1) assist the national chairman in the discharge of his duty.\n4) In the absence of the national chairman and the deputy national chairman from the region or part of the country where the national chairman originates from, the other deputy national chairman shall act as the national chairman without prejudice to Section 47 (6) of this Constitution.\nIf the national chairman is not available, someone will take over; if the deputy national chairman, South, is not available, the deputy chairman, North, will take charge."
  },
  {
    "headline": "BREAKING: Over 35 Feared Killed As Suspected Bandits Attack Plateau Community",
    "summarized_story": "Over 35 people were killed when suspected Fulani bandits raided the Yelwa Zangam community in Plateau State’s Jos North Local Government Area.\nAccording to eyewitnesses, armed bandits raided the town, which is located behind the University of Jos, late on Tuesday, burning houses and shooting anybody in sight in Jos on Wednesday morning.\nBefore commencing their attack, the terrorists reportedly blocked the community’s bridge, preventing anyone from getting help.\nThe attack comes just 24 hours after Plateau State Governor, Barr.\nAs of the time of reporting this story, the Plateau State Police Command has yet to provide specifics about the occurrence."
  },
  {
    "headline": "Breaking: Police confirm kidnap of electoral scribe in Nasarawa",
    "summarized_story": "The Nasarawa state police command, Wednesday, confirmed the abduction of the Secretary of Nasarawa State Independent Electoral Commission (NASIEC) Barr.\nMuhammed Abubakar Opu by unknown gunmen.\nThe Police Public Relations Officer in the, ASP Ramhan Nansel, confirmed this in a statement made available to Blueprint in Lafia.\nHe said the yet-to-be identified gunmen numbering about five stormed the house of the NASIEC secretary located at Baking Rijiya village in Lafia local government area around 11:45pm on Tuesday night and kidnapped him to an unknown destination.\nHe then appealed to the members of the public to assist the police with useful information that could lead to the arrest of the criminal elements and rescue the victim unhurt."
  },
  {
    "headline": "Breaking: Again, hoodlums invade Jos, many feared dead",
    "summarized_story": "Tension is mounting in Yelwa village located inside Jos North local government area of Plateau state after suspected hoodlums invaded the area and reportedly killed dozens of people midnight on Tuesday.\nA local in the area said, “Nothing less than 30 people were killed, houses were raised down.”A source later told Blueprint that the General Officer Commanding 3rd division of the Nigerian Army, Major-General Ibrahim Ali, who is also the Commander Operation Safe Haven, as well as the Commissioner of Police Plateau state command were at the scene.\nEfforts to speak with the Police Public Relations Officer in the state, ASP Ubah Ogaba, was futile as his phone line was not reachable, and he couldn’t respond to a WhatsApp message sent to him.\nDetails loading…"
  },
  {
    "headline": "Breaking: Major Datong kidnapped by bandits in NDA found dead",
    "summarized_story": "Major Datong, the military officer kidnapped in the early hours of Tuesday by armed bandits at the Nigerian Defence Academy, Kaduna has been found dead.\nMilitary authorities are yet to confirm the latest development.\nBlueprint reports that Nigeria’s foremost military university was invaded by bandits who killed two officers Lt-Cdr Wulah and Flt.- Lt. CM Okoronwo and abducted Maj Datong.\nThe bandits were said to have invaded the permanent site of the institution located along Airport road, Afaka, in Igabi local government area of Kaduna state around 1.00am.\nIncidentally, the NDA is opposite the Federal College of Forestry Mechanization, Afaka where 39 students were abducted by bandits on March 11, 2021."
  },
  {
    "headline": "Ogoni Clean-up: 15 sites fully cleansed under Buhari’s watch – APC legacy group -NigPilot",
    "summarized_story": "In November 2020 President Buhari commissioned the first phase of the Waltersmith Refinery in Imo State.\nThe OPAC Refinery in Delta State has also been completed.\nMore than a decade after Train 6 was completed and launched, President Buhari has in 2021 flagged off the construction of Train 7.\nThe Niger Delta Development Commission (NDDC) is being reformed and repositioned, in line with the President’s vision of ensuring that the people of the Niger Delta benefit maximally from the wealth of their land.\nThe project was first conceived in the late 1970s, but all the contracts awarded prior to the Buhari Administration were aborted."
  },
  {
    "headline": "Gunmen attack Jos North community kill over 35 persons -NigPilot",
    "summarized_story": "Gunmen suspected to be bandits have attacked the Yelwa zangam community, behind the University of Jos, killing over 35 people.\nEyewitnesses say the armed gunmen invaded the community at about 9 pm on Tuesday evening burning houses and shooting anyone on sight.\nIt was gathered that the attackers had disabled the bridge leading to the Anaguta community preventing any access to help before launching their attacks.\nThe eyewitness who does not want his name in print said several entire families were burnt alive in their homes while others who sustained injuries are being treated in the hospital.\nThe Plateau State Police Command is to is yet to give details of the incident, as at the time of filing this report."
  },
  {
    "headline": "NAPTIP rescues 104 victims of human trafficking, arrests 8 suspects -NigPilot",
    "summarized_story": "According to him, the eight suspected human traffickers were also arrested in the process just as efforts are on to apprehend other members of the trafficking syndicates who are at large.\nMuhammed disclosed this in Abuja while speaking on the Agency’s renewed offensive against human traffickers across the Country.\nNigerian Pilot gathered that the figure includes the rescued of 80 victims in Kano two weeks ago on their way to Libya, and the latestfigure of 19 victims rescued in Kano few days ago.\n“No matter where the traffickers go to deceive and recruit victims, they will always meet us at the exit point.\nTheir field days in the illicit business of human trafficking and child labor are over."
  },
  {
    "headline": "Council calls for advocacy programmes to improve student enrolment -NigPilot",
    "summarized_story": "Education stakeholders have said there is the need for the Federal Ministry of Education, FME, in collaboration with the States Ministries of Education, SMoEs, Heads of Tertiary Institutions and Staff/Students Unions and other relevant stakeholders should organise Zonal and National advocacy programmes to improve student enrolment, retention and completion of academic programmes in tertiary institutions on time.\nThe stakeholders gave the advice at 65th National Council on Education, which took place in Jalingo, Taraba State recently.\nAt the conclusion of the 5-day Council, with the theme: ‘Eradicating Out-of-School Children Phenomenon: A Tool for the Achievement of Education 2030 Agenda’, the participants also agreed that the Federal Ministry of Education, National Universities Commission, NUC, National Board for Technical Education, NBTE, National Commission for Colleges of Education in collaboration with the SMoEs and other relevant stakeholders should monitor Open and Distance Learning, ODL.\nThey suggested that the FME in collaboration with NUC, NBTE, NCCE should conduct Zonal/National Advocacy on improving ODL delivery, develop Action Plan/Blueprint and a Stand-alone National Policy for the implementation of ODL in Nigeria.\nThe Council also agreed that “Strengthening of Security and Safety in Nigerian Schools for the achievement of Education 2030 Agenda” would be the theme for the next cycle of Joint Consultative Committee on Education, JCCE, meetings and the 66th National Council on Education, (NCE) meeting."
  },
  {
    "headline": "Several Feared Killed, Many Injured In Fresh Plateau Attack",
    "summarized_story": "Several persons were feared killed with many others injured after suspected herdsmen attacked Yelwa Zangam village, Zangam District in Jos North Local Government Area, Plateau State.\nThe attack which occurred on Tuesday night also left several houses burnt.\nWhile there’s yet to be any official statement from security agencies, Channels Television observed on visiting the Plateau State Specialist Hospital, that there were no fewer than 16 corpses at the morgue while those injured were receiving treatment.\nThis comes just days after the State Governor, Simon Lalong had imposed a curfew on Jos North, Bassa and Jos South Local Government areas following an attack on Rukuba Road in Jos North Local Government Area.\nTwenty-three people – who were travelling from Bauchi en-route Jos to Ikare in Ondo State – were killed in the incident while 23 others were injured during the attack."
  },
  {
    "headline": "Insecurity: The Govt Knows Sponsors Of Boko Haram, Says Former Naval Officer",
    "summarized_story": "﻿Former Navy Commodore, Kunle Olawunmi on Wednesday hinted that the Nigerian government knows those behind the decade-long Boko Haram insurgency in the country.\n“In April this year, the government said they had arrested 400 Bureau De Change (BDCs)-related people that were sponsoring Boko Haram.\nThey told us.”The presidency had earlier said it would publish names of those behind the Boko Haram war with the development generating heated controversy across the country.\nHe claimed that the government has developed cold feet in fighting the insurgency because some of those backing Boko Haram are now top-ranking government officials.\n“The centre of gravity of Boko Haram and insurgency in Nigeria are the sponsors of that programme,” the professor of Intelligence and Global Security Studies, added."
  },
  {
    "headline": "Nigeria Records 655 New COVID-19 Cases, Five More Deaths",
    "summarized_story": "Nigeria has recorded 655 fresh cases of the COVID-19, with five more persons dead.\nThe Nigeria Centre for Disease Control (NCDC) announced this in its daily report on Tuesday.\nThe 655 new cases were reported from nine states – Lagos (288), Rivers (188), Oyo (64), Akwa Ibom (31), FCT (28), Ekiti (21), Edo (17), Bayelsa (11), and Kaduna (7).\nWith the latest figures, the total confirmed cases in the country have now risen to 188,243 while 169,035 have been discharged and 2281 have died.\nConfirmed Cases by StateStates Affected No."
  },
  {
    "headline": "Zulum: Surrendered Insurgents Should Not Be Rejected To Avoid Endless War",
    "summarized_story": "﻿The Governor of Borno State, Babangana Zulum, has said that repentant insurgents should not be rejected in order to avoid worsening the insurgency war.\n“The report of the surrendering of the insurgents and to me in particular and to the greater people of Borno State is a very welcome development unless we want to continue with an endless war,” Zulum said.\n“More than 100,000 people were killed and therefore, I am in total support of this ongoing surrender by the insurgents”.\nRead Also: More Boko Haram Insurgents Surrender In Borno, Beg For ForgivenessGovernor Zulum’s comments come as more insurgents continue to embrace amnesty.\nHe believes the provision of blanket amnesty to insurgents has the tendency to breed new forms of criminality in the country."
  },
  {
    "headline": "NDA Attack: CDS Visits Scene As Search For Kidnapped Officer Intensifies",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor on Wednesday visited the Nigerian Defence Academy (NDA) in Kaduna State for an on-the-spot assessment of the attack on the military institution by bandits.\nHe was briefed on arrival by the NDA Commandant, Major General IM Yusuf before he was taken to the scene of the incident.\nBandits disguised as military officers invaded the academy on Tuesday, went straight to the officers’ quarters inside the school, and killed two officers.\nThe bandits after kidnapping the officer escaped through the breaching barbwire fence of the academy along the Kaduna Airport Road in Afaka which is surrounded by a forest.\nPresently, a joint team of security operatives in Kaduna State are making frantic efforts to rescue the abducted officer."
  },
  {
    "headline": "Nigeria needs a focused leader- Ifeanyi Okowa",
    "summarized_story": "As the 2023 general elections approaches, Delta state governor Ifeanyi Okowa has stated that Nigeria requires a focused leader, recognising that an individual, regardless of ethnic heritage, must be able to bring the country together.\nThe governor is currently speaking at the #RippleDialogue, which is focused on reestablishing trust in a divided Nigeria.\nThe governor stated that given the existing status of the country, restructuring is unavoidable at this time."
  },
  {
    "headline": "JOHESU UITH embark on indefinite strike over non-payment of promotion arrears, others",
    "summarized_story": "Members of the University of Ilorin Teaching Hospital chapter of the Joint Health Sector Unions (JOHESU) have declared an indefinite strike in protest of the non-payment of promotion and arrears.\nThey also accused the hospital management of deliberately not stocking the hospital with drugs.\nMembers unanimously agreed to embark on the indefinite strike at a congress held within the hospital premises.\nMr Olutunde Oluwawumi, JOHESU chairman at the hospital, declared that members will not return to work until the management pays at least three years of promotion and arrears."
  },
  {
    "headline": "Insecurity: NPF to train over 5,000 youth on intelligence gathering in Kaduna",
    "summarized_story": "The Police Public Enlightenment Campaign Forum is set to collaborate with the Kaduna State Government to teach 5,758 young people on intelligence gathering and crime prevention.\nChief Sheriff and National Coordinator of the forum DSP Abdullahi Umar Ladan, stated this during a press conference in Kaduna on Tuesday.\nHe said that the partnership is with Banpet Security and Surveillance Services, which will train 250 young people across the state’s 23 local government units.\nThe selected youths will also be trained in community policing, intelligence gathering, and electronic security technology in both soft and hard products, according to him.\nDSP Ladan further explained that the partnership is directly with the Ministry of Local Government and Chieftaincy Affairs Kaduna State."
  },
  {
    "headline": "Dagogo Jack: Prospects and Challenges of Power Sector",
    "summarized_story": "Former Chairman, Presidential Task Force on Power, Engineer Beks Dagogo-Jack, speaks about the problems and prospects of electricity generation, transmission and distribution."
  },
  {
    "headline": "Ivory Coast’s First Ebola Patient Since 1994 Recovers",
    "summarized_story": "A young Guinean woman, who was the first confirmed case of Ebola in Ivory Coast since 1994 has recovered from the disease, the Ivorian health ministry has said.\nThe 18-year-old had tested positive for the Ebola virus in Ivory Coast after arriving there two weeks earlier.\n“We performed on the patient two biological tests which were negative in an interval of 48 hours.\nEbola, which is transmitted through close contact with bodily fluids, is a fatal viral disease that causes severe fever and, in the worst cases, unstoppable bleeding.\nIvory Coast is the third African country this year to have been affected by the Ebola virus after the Democratic Republic of Congo and Guinea."
  },
  {
    "headline": "Uganda Receives First Group of Afghanistan Refugees",
    "summarized_story": "Uganda has received the first group of 51 evacuees from AfghanistanThe group landed at Entebbe International Airport aboard a private chartered flight on Wednesday morning, Uganda’s foreign ministry said in a statement.\nThe ministry says the group is transiting through Uganda and will move on to the US and other countries.\nThe evacuation followed the American government’s request to Uganda, to take in some of the people fleeing the crisis in Afghanistan since the Taliban takeover.\nLast week, a Ugandan junior government official told the BBC that Uganda was to take in 2,000 Afghan refugees at the request of the US government.\nUganda hosts over one million refugees who have fled several conflicts and other disasters across eastern Africa."
  },
  {
    "headline": "Israeli PM Bennett to Meet Biden as Mideast Tensions Grow",
    "summarized_story": "Israeli Prime Minister Naftali Bennett’s meeting with President Joe Biden comes in the midst of heightened tensions with its regional arch-enemy, Iran, and as Israel grapples with a gradual resurgence of hostilities on its southern border with the Gaza Strip.\nBennett, in his first state visit overseas since taking office, was scheduled to meet Wednesday with senior administration officials, including Secretary of State Antony Blinken and Defense Secretary Lloyd Austin, and on Thursday with Biden.\nRecent months have seen a string of attacks on Israeli-connected shipping, believed to have been carried out by Iran.\nIndirect negotiations between the two sides to reach an arrangement for the reconstruction of the Gaza Strip have broken down in the past week.\nHamas has launched incendiary balloons into southern Israel and staged violent demonstrations on the border, raising the specter of renewed violence."
  },
  {
    "headline": "Algeria Cuts Diplomatic Ties with Morocco over ‘Hostile Actions’",
    "summarized_story": "Algeria is cutting diplomatic relations with Morocco, Foreign Minister Ramdane Lamamra said, accusing its neighbour of “hostile actions”.\nMorocco and Algeria have had strained relations for decades, mainly over the issue of Western Sahara.\n“Algeria has decided to cut diplomatic relations with the Kingdom of Morocco from today,” Lamamra said at a news conference on Tuesday.\nThe cutting of diplomatic relations is effective from Tuesday but consulates in each country will remain open, Lamamra said.\nAlgeria backs the Polisario movement that seeks independence for Western Sahara, which Morocco regards as part of its own territory."
  }
]