[
  {
    "headline": "British PM walks out amid lawmakers’ probe on Roman Abramovich’s ‘sanction’",
    "summarized_story": "Labour former minister Chris Bryant later raised a point of order to ask about the accuracy of Mr Johnson’s remarks.\nMr Bryant, speaking after the Prime Minister’s statement to announce new sanctions following Russia’s actions against Ukraine, said: ‘I hope the Prime Minister could just stay for a brief moment.\n‘I am sure the Prime Minister was completely inadvertent in giving a false indication.\nBut it would be helpful if the Prime Minister could correct the record… these are important moments of fact.’Commons Speaker Sir Lindsay Hoyle replied: ‘I am not responsible for the answers that ministers give.\nTories lined up to appeal for Mr Johnson to get ‘dirty’ money out of the UK ‘rouble by rouble’, saying the West needs to ‘hit hard’ straight away."
  },
  {
    "headline": "Uzodinma accuses PGF ex-DG of working for PDP",
    "summarized_story": "The governor of Imo state, Hope Uzodinma, has accused the immediate past Director General of Progressives Governors Forum, Salihu Lukman of being a mole while he lasted as the DG PGF.\n“It is obvious that Lukman had been engaged by enemies of democracy to deliberately discredit respected APC Governors and Leaders like Uzodimma just because their selfish political permutations are not working out.\n“Few weeks out of office, Lukman is behaving true to type – a mole planted amidst the APC top echelon to spy on them.\n“Why would Lukman’s feeling about the postponement of the APC Convention be in sync with the feeling of the opposition politicians and the few APC members known for anti-party activities?\nHe had yet to respond to a text message as of the time of filing this report."
  },
  {
    "headline": "Buhari meets Ghana’s President Addo-Akufo behind closed door",
    "summarized_story": "President Muhammadu Buhari met with his Ghanaian counterpart, Nana Addo-Akufo, behind closed door in Abuja on Tuesday.\nThe News Agency of Nigeria (NAN) reports that the agenda of the meeting was not made public.\nNAN gathered, however, that they discussed some sub-regional issues bordering on security and socio-political developments in ECOWAS member states.\nAddo-Akufo is the current Chair of ECOWAS.\nVanguard News Nigeria"
  },
  {
    "headline": "NBM felicitates with Benin monarch over return of artifacts",
    "summarized_story": "By Ozioruva AliuBENIN CITY – THE leadership of the Benin Zone of Neo Black Movement (MBM) has congratulated the Benin Monarch, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, on the return of two looted Benin artifacts; a cockerel (Okpa) and Uhunwun-alao (Head of Oba) by the Jesus College of the University of Cambridge and University of Aberdeen, Scotland to the Oba of Benin.\nIn a statement by the Public Relations Officer of NBM in the zone, Moses Idahosa, the group also commended President Muhammadu Buhari for ensuring that the artifacts were returned to the palace of the Oba of Benin where they were looted.\nREAD ALSO:How Oba Ewuare II received Benin artefacts looted 125 years agoIt said: “No doubt, the arrival of the two artifacts is not only historic and symbolic but has also further expanded the splendor of other artifacts in the palace, and we pray for the urgent return of over 10, 000 other Benin looted artifacts currently domiciled in over 145 Museums across Europe and the US.\n“We call on other institutions and authorities holding unto other looted Benin artifacts to emulate the kind and noble gesture of Jesuit College of Cambridge University, and the University of Aberdeen, Scotland and return Benin artifacts in their possession, as it will be a de-service to the black-race and humanity at large if the artifacts are not returned to the Oba Palace, their original abode.\nThe Zonal PRO averred that the Benin artifacts transcend beyond mere artworks, as they are symbols of traditional heritage of the Great Benin Kingdom which must not be allowed to be domiciled outside the palace of the Oba."
  },
  {
    "headline": "Counter Terrorism Centre: DSS punctures TrackaNG-BudgIT claim of fund diversion",
    "summarized_story": "“It added that it “visited the site and discovered they only renovated a primary school and mosque adjacent to the site”.\nIt further expresses dismay at the shoddy way Tracka embarked on its project verification exercise as well as the manner it drew conclusions without the slightest efforts to be diligent.\n“It may also be noted that the primary school in question was a dilapidated Nomadic Education Centre located at Galga, near Gubi Dam, Firo where the CTC is located.\n“Surprisingly, Tracka only stopped its verification of the budget implementation at the primary school from where it drew hasty conclusions of non-implementation.\nGoing forward, the Service will not take lightly attempts by individuals or organisations like Tracka to defame it,” Dr. Afunanya warned."
  },
  {
    "headline": "OkonLagos, Victoria Inyama, others educate Ugezu on importance of DNA test in Nigeria",
    "summarized_story": "Ugezu J UgezuBy David RoyalNollywood producer, director, and actor, Ugezu J Ugezu, has been chastised by colleagues and social media users for his opposition to the use of DNA tests in Nigeria.\nFollowing the trends in Nigeria and as parents realize daily that their children aren’t biologically theirs, many men, particularly in Nigeria, are becoming interested in DNA tests.\nHis post below:Reacting to Ugezu’s post on Instagram, Nollywood actor, Ime Bishop Umoh, popularly known as OkonLagos objected, saying that things have changed.\nNdewooooo 🙏🏽”Another social media user, Prince Paulaj opined that DNA is not what’s tearing home/family/relationship apart, infidelity is the problem.\nLet’s tackle infidelity but DNA test.”@ngallalizzyyahoo.co commented “DNA is very important, so many men are spending money on other children while their biological children are suffering somewhere."
  },
  {
    "headline": "FG to collaborate with Republic of Korea in tackling unemployment",
    "summarized_story": "The Federal Government is collaborating with the Republic of Korea (South Korea) to address unemployment, especially among the youth and women in the country.\nSen. Chris Ngige, Minister of Labour and Employment, said this while receiving the Ambassador of the Republic of Korea in Nigeria, Mr Kim Young-Chae on Tuesday, in Abuja.\nHe urged the Republic of Korea to assist Nigeria in agriculture, which has enormous capacity to boost the foreign exchange base of the country.\nKim Young-Chae expressed his intention to increase Trade and Investment of Republic of Korea in Nigeria.\nHe also solicited for Nigeria’s support for the Foreign Minister of Republic of Korea in vying for the position of the Director General of International Labour Organisation (ILO)."
  },
  {
    "headline": "Gov Emmanuel reacts to death of Pastor Ezekiel Atang",
    "summarized_story": "The Governor of Akwa Ibom State, Mr Udom Emmanuel, has commiserated with the family of late Pastor Ezekiel Atang, a renowned preacher in the state.\nAtang, until his death two days ago, was the General Overseer of the God’s House of Refuge, Uyo .\nIn a statement issued by Akwa Ibom State Government Media Unit and obtained by our correspondent, the Akwa Ibom State Governor visited the family to console them of the sudden demise of the pastor.\nAccording to the statement, “His Excellency, Mr Udom Emmanuel, today visited the home of renowned Uyo based cleric, Pastor Ezekiel Atang who passed on suddenly two days ago.\n”The Governor commiserated with the family on the demise of the Late Senior Pastor of God’s House of Refuge who left behind his wife, Dr Dara Atang, three children, aged mother, elder brother and other relations.”"
  },
  {
    "headline": "Navy appoints new spokesman, redeploys predecessor",
    "summarized_story": "The Nigerian Navy (NN), on Tuesday, said it has appointed Commodore Adedotun Olukayode Ayo-Vaughan as its new spokesman.\nRear Admiral JD Akpan, Director of Plans, in a statement, said the appointment followed the redeployment of his predecessor, Commodore Suleman Dahun, as Director of Civil Military Cooperation.\nCommodore Ayo-Vaughan, who holds a Bachelor of Science degree in Chemistry and a Masters Degree in International Affairs and Diplomacy from Ahmadu Bello University, Zaria, is a member of the 43rd Regular Course of the Nigerian Defence Academy.\nThe statement further added that Commodore Ayo-Vaughan attended the French War College (Ecole de Guerre), Paris, France for his strategic course after obtained a Masters in Defence Management, Command and Strategy, Ecole de Guerre, France and Post Graduate Certificate in Data Science and Business Analytics from the University of Texas, USA."
  },
  {
    "headline": "COVID-19 ‘origin’ Wuhan reports new cases",
    "summarized_story": "Wuhan in China has reported new positive cases for COVID-19, suspected to be the Omicron variant.\nAuthorities in the capital of China’s Hubei Province confirmed 14 cases as of Tuesday afternoon.\nAn Independent Panel for Pandemic Readiness and Response had accused China and the World Health Organisation (WHO) of slow reaction.\nClark said China could have been faster in its response, wondering why the discovery of 27 cases in Wuhan was made public one week after detection.\n“One question is whether it would have helped if WHO had used the word pandemic earlier than it did”, she said."
  },
  {
    "headline": "US Capitol invasion: Trump loses at Supreme Court",
    "summarized_story": "Former U.S. President Donald Trump on Tuesday lost his bid to block the release of White House records needed in the probe of Capitol invasion.\nThe court had on January 19, 2022 ordered that the files be handed over to the House of Representatives.\nWeeks earlier, the U.S. Court of Appeals for the District of Columbia Circuit upheld a lower court ruling against Trump.\nThe court declared that the ex-leader had no basis to challenge President Joe Biden’s decision to allow the records get to congress.\nTrump’s supporters stormed the Capitol building after his address wherein he insisted the 2020 election was rigged."
  },
  {
    "headline": "Fuel scarcity: NSCDC warns petrol dealers, consumers against sharp practices",
    "summarized_story": "The Ekiti State Commandant of the Nigeria Security and Civil Defence Corps (NSCDC), Mr. John Olatunde Fayemi, has cautioned Premium Motor Spirit users and dealers in the state not to inflict economic injuries on the people as well themselves.\nCommandant Fayemi stated this while monitoring the sales and dispensing of the product in Ado Ekiti, following a series of complaints that some filling stations were selling the product above the regulated pump price.\nThe State Commandant further noted that selling the product above government approved price is tantamount to sabotaging government’s efforts to make the economy run smoothly.\nWhile also considering such acts as inflicting economic injuries on the people by the petroleum dealers, he posited that illegal storage of fuel at home for black marketing is an unwholesome practice that contravenes the safety and health policy of the state government.\nThis is with a view to easing out the scarcity of the product that has lingered in the state for about two weeks now."
  },
  {
    "headline": "‘Why Edo is prioritising women’s economic empowerment’",
    "summarized_story": "Edo State governor’s wife Mrs. Betsy Obaseki has said the current administration is prioritising women’s economic empowerment and development, to enable them become more productive.\nThe Coordinator of PAWED Advocacy Coalition in Edo State, Mrs. Vivian Evbotokhai, said the Obaseki administration was taking the lead in investment in women’s economic empowerment.\nShe said the project was targeted at pushing for the state government to fulfil its commitment for women’s economic empowerment.\nPAWED Advocacy Coalition’s Second Lead, Mrs. Bliss Ojeruse, said Women’s Economic Empowerment (WEE) had been recognised as a bridge to gender disparity across the globe.\n“We will not allow ourselves to be divided again; whether you are Edo South, Edo Central or Edo North, Edo is one."
  },
  {
    "headline": "Expectations high from Governor-elect Soludo, says Catholic bishop",
    "summarized_story": "As governor-elect Prof. Charles Soludo prepares to take over the mantle of leadership in Anambra State on March 17, the Catholic Bishop of Awka, Most Rev Paulinus Ezeokafor, has said expectations are high from him.\nThe bishop spoke at St. Patrick’s Catholic Cathedral, Awka during a victory thanksgiving mass organised in honour of APGA, Anambra State chapter.\nHe said APGA’s feat in the last governorship election was destined by God.\n- Advertisement -Ezeokafor said: “Your victorious outing in the last governorship election was made possible by God.\nThe Chairman of the party in the state, Sir Norbert Obi, thanked the bishop for the advice and encouragement."
  },
  {
    "headline": "N2.6tr: NEITI board okays release of report in March",
    "summarized_story": "NEITI’s Executive Secretary, Dr. Orji Ogbonnaya Orji made this known yesterday in a text message to The Nation .\nBesides, on that, The Nation asked Orji whether NEITI would still unveil the audit report that month, he said the presentation had been postponed to last December.\nHe added that next year, the organization will commence the Mining Industry audit.\nHe said: “Now, the 2020 audit report will validate if these payments have been made by the companies.\nHe said that the plan would be enhanced by regular meetings and more importantly supporting in investigating issues bordering on criminality arising from NEITI industry reports in oil, gas and mining sector."
  },
  {
    "headline": "‘Zone APC presidential ticket to Southeast’",
    "summarized_story": "Northern youths yesterday urged the All Progressives Congress (APC) to zone its 2023 presidential ticket to the Southeast.\nThe youth, under the auspices of the Concerned Northern APC Youth Forum, said this at a briefing in Abuja.\nThey also called on the APC and Nigerians to support the Presidential ambition of Governor David Umahi of Ebonyi State.\n“In David Umahi, we have found a worthy successor to President Muhammadu Buhari in 2023.\n“We urge other bodies across the entire country to support David Umahi’s presidential bid as this is the surest way for Nigeria to go,” he added."
  },
  {
    "headline": "‘Wives demanding money from husbands before sex are satanic’",
    "summarized_story": "The Spiritual Director, Ave-Maria Prayer Ministry, Ifite Awka, Anambra State, Brother Livinus Okeke, has warned women against asking for money as a condition for having sex with their husbands.\nHe said such acts were not only satanic, but also attracted curses to their homes and families.\nSpeaking during a service to mark the 10th anniversary of the ministry, the cleric described many mothers as ‘packaged troublemakers’ to their husbands.\nOkeke said: “Some wives now demand N20,000 or thereabouts from their husbands before going to bed with them.\nSaid he: “Some do that to also keep their wives happy and that is the love we are talking about."
  },
  {
    "headline": "If we hadn’t intervened in roads, rail, people would have been trekking from Lagos to Ibadan – Buhari",
    "summarized_story": "He said: “My objective was very clear, despite the dwindling resources, I wanted to deal with infrastructure across the country.\n“Which country can really advance without road, rail and power, that’s why I wanted to sort out infrastructure, knowing that Nigerians are competitive by nature, and they will face their businesses when there’s road, rail and power,” he added.\nPresident Buhari assured that the construction and rehabilitation of infrastructure will be sustained, which include the Abuja-Kaduna-Kano express road, being handled by Julius Berger to ensure good, long-term quality.\nIn her remarks, the Deputy Governor thanked the President for his working visit to the state, where he commissioned projects in Kaduna, Kafanchan and Zaria.\nThe Emir of Zazzau also thanked the President for the visit in January and support to the Government, adding that the memory will be long cherished by all Kaduna State citizens."
  },
  {
    "headline": "Appeal court judge escapes from aductors in Anambra",
    "summarized_story": "From Stanley Uzoaru, OwerriJustice Rita Pemu of the Court of Appeal, Owerri Division, on Sunday escaped from her abductors along Azia – Orsumoghu, Ihiala road in Anambra State while returning back to her base in Owerri from Benin.\nRegular individuals can earn as low as $300 daily Find out how it works.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nMeanwhile, the State scribe of the NBA while condemning the abduction of their member also thanked God for sparing her life.\nBut as at the time of this report, the whereabouts of the personal aides of the judge are yet unknown."
  },
  {
    "headline": "2023: APC agrees to swap offices between north, south in zoning formula",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe All Progressives Congress (APC) has agreed on a zoning formula that will swap offices held between north and south in the last eight years.\nThis emerged following a meeting between President Muhammadu Buhari and governors elected under the APC at the presidential, Abuja on Tuesday.\nHe said: “We have agreed to a zoning formula for all the six geo-political zones.\nEssentially, northern zone will have the positions the south have had in the last eight years.\nThe outgoing deputy governor of Anambra state who recently defected to the ruling party was also in attendance."
  },
  {
    "headline": "Unknown gunmen slaughter two guards at Ogun filling station",
    "summarized_story": "Laide Raheem, AbeokutaGunmen suspected assassins have slaughtered two night guards attached to the Total filling station around Delabo Junction, Ilisan Remo in Ikenne local government area of Ogun State.\nThe two night guards said to be Igbo but residents of the town were said to have been killed on Sunday night and their bodies discovered in the pool of their blood early morning of Monday.\nOur Correspondent gathered that the assailants allegedly took nothing away from the filing station fuelling the suspicion that it might be a pure case of assassination.\nThe incident is said to have caused palpable fear in the town coming on the heels of reported Hausa clash with police on Friday.\nThe police were said to have been forced to fire shots into the air to disperse the rampaging Hausa youths."
  },
  {
    "headline": "Osun cult clash claims 10 lives",
    "summarized_story": "From Lateef Dada, OsogboThe clash between rival cult in Ilesa, Osun State, on Monday evening, has claimed ten lives, Daily Sun has gathered.\nSources said the clash took place subsequently in Ifofin, Idasa, Irojo and brewery areas in the town.\nShe said information available to the command revealed that five persons were killed during the clash.\nA security source confided in Daily Sun that no fewer than eight persons were killed in the clash.\nAccording to a source in the town, “about ten persons were killed."
  },
  {
    "headline": "News in Photographs: Buhari, APC Govs Meet",
    "summarized_story": "President Muhammadu Buhari Tuesday met with governors elected on the platform of the All Progressives Congress at the State House Abuja.\nThe meeting held in the Council Chamber was also attended by Vice President Yemi Osinbajo.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Senate Constitution Panel Submits Report Wednesday, Says Omo-Agege",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate Committee on the review of the 1999 constitution will submit its report on Wednesday.\nThe Chairman of the committee, Senator Ovie Omo-Agege, stated this on Tuesday.\nOmo-Agege, who is also the Deputy President of the Senate, made the announcement while presiding over plenary due to the absence of Senate President, Ahmad Lawan.\nHe, however, said Lawan would give further details on the matter on Wednesday.\nHe added that the lawmakers would take the reports home on Wednesday and return on Tuesday, March 1, to vote on the amendments."
  },
  {
    "headline": "Return Nigeria’s Artefacts in Your Possession, Buhari Pleads with Nations, Institutions",
    "summarized_story": "•Says 1,130 Benin bronzes due back from Germany this yearDeji Elumoye in AbujaPresident Muhammadu Buhari has appealed to countries, institutions, and bodies, both private and public, to return Nigeria’s artefacts in their possession.\nBuhari also disclosed that 1,130 Benin bronzes would be returned to Nigeria by the German government before the end of this year.\nThe artefacts were repatriated from the University of Cambridge and University of Aberdeen, respectively, in the United Kingdom, after 125 years of their leaving the territory of present day Nigeria.\nAccording to the president, “These artefacts are part of the records of the history of the Benin people.\nBuhari also appreciated the Federal Republic of Germany, which was planning the process of repatriating 1,130 Benin bronzes to Nigeria this year from many of Germany’s public museums."
  },
  {
    "headline": "Again, APC Moves Convention, Now to Hold March 26",
    "summarized_story": "The latest notice also replaced an earlier letter to INEC informing it of APC’s decision to hold its zonal congresses on March 26.\nAPC had in an earlier letter, with reference number APC/NHDQ/INEC/019/22/14, notified INEC of its decision to hold its national convention on February 26.\nAkpanudoedehe, who spoke at the end of a four-hour meeting of the caretaker committee, said, “We have agreed and approved that activities for the party’s national convention will commence from February 24 and terminate on March 26 at Eagle Square with the national convention.\nThe adoption of the screening report is slated for March 8, while zonal congresses would be held on Saturday, March 12, and the zonal congresses appeal would take place on March 14.\nHe stated, “It is clear that Mai Mala Buni is opposed to organising the APC national convention on February 26, 2022 or any time soon."
  },
  {
    "headline": "UK Injects £10m into Nigeria’s Energy Sector",
    "summarized_story": "•Returns £210,000 illegal paymentMichael OlugbodeThe United Kingdom has injected £10 million into Nigeria’s low carbon energy project.\nIt sets out the terms and understanding between the governments of the United Kingdom and Nigeria to make the compensation payment.\nThe financing would also help Nigerian investors focus on low carbon energy, and support off-grid, low-carbon energy projects.\nUK Minister for Africa, Vicky Ford, speaking on the investment, said, “The UK is committed to increasing both renewable energy and energy access in Nigeria, driving clean, sustainable and resilient growth.\nOnyeama received, in audience, the United Kingdom Minister for Africa, Latin America and the Caribbean."
  },
  {
    "headline": "EXCLUSIVE: Thieves Invade Rehabilitation Camp For 'Repentant' Boko Haram Terrorists In Gombe, Steal Items Of Workers Owed Allowances",
    "summarized_story": "SaharaReporters reliably gathered from an affected worker that thieves have in recent times been sneaking into the camp to also steal food items and other valuables meant for the welfare of persons within the facility.\n\"Recently, more than three mobile phones and other valuables belonging to workers at the camp were stolen by thieves.\n\"Nobody including the camp coordinator has answers to how thieves sneak in and out of this place to operate without being apprehended.\nAnother worker at the Gombe camp revealed that the activities of thieves have made many people around the place seek ways of leaving the area.\n\"In fact, workers especially those of us yet to be paid our allowances for two months, have been working on getting posting elsewhere."
  },
  {
    "headline": "EXCLUSIVE: Thieves Invade Rehabilitation Camp For 'Repentant' Boko Haram Terrorists In Gombe, Steal Items Of Workers Owed Allowances",
    "summarized_story": "SaharaReporters reliably gathered from an affected worker that thieves have in recent times been sneaking into the camp to also steal food items and other valuables meant for the welfare of persons within the facility.\n\"Recently, more than three mobile phones and other valuables belonging to workers at the camp were stolen by thieves.\n\"Nobody including the camp coordinator has answers to how thieves sneak in and out of this place to operate without being apprehended.\nAnother worker at the Gombe camp revealed that the activities of thieves have made many people around the place seek ways of leaving the area.\n\"In fact, workers especially those of us yet to be paid our allowances for two months, have been working on getting posting elsewhere."
  },
  {
    "headline": "How Top Officials In Attorney-General, Malami's Ministry Of Justice Embezzled N104million, Moved Cash In Bag",
    "summarized_story": "Afterwards, the junior officer, Danjuma reportedly withdrew the money from his bank account and handed it over to Kadmi in a bag.\nCriminal Justice”.\nAnother N4,500,000 payment was received the same day as payment of ”DTA Air ticket for 15 Officers for retreat on cause and delay/backlog of criminal justice administration schedule for 13th – 18th December 2021.\nN4.3 million was paid into Danjuma's account as payment for the assessment collation and review across the states justice sector institutions in Nigeria.\nOn November 17, Danjuma received N4,400,000 payment for “national and review across the state justice sector institution in Nigeria."
  },
  {
    "headline": "How Top Officials In Attorney-General, Malami's Ministry Of Justice Embezzled N104million, Moved Cash In Bag",
    "summarized_story": "Afterwards, the junior officer, Danjuma reportedly withdrew the money from his bank account and handed it over to Kadmi in a bag.\nCriminal Justice”.\nAnother N4,500,000 payment was received the same day as payment of ”DTA Air ticket for 15 Officers for retreat on cause and delay/backlog of criminal justice administration schedule for 13th – 18th December 2021.\nN4.3 million was paid into Danjuma's account as payment for the assessment collation and review across the states justice sector institutions in Nigeria.\nOn November 17, Danjuma received N4,400,000 payment for “national and review across the state justice sector institution in Nigeria."
  },
  {
    "headline": "FFK: Only A Fool Runs From His Shadow By Bolaji O. Akinyemi",
    "summarized_story": "Pro 28:1 (BBE):\"The evil man goes running away when no man is after him, but the upright are without fear, like the lion.\"\nWhat FFK fails to realize is that he is inconsequential to the discourse on the Nigerian state!\nWhat is it that must not be heard from Snow White?\nIf silence is golden, then FFK better be ready for the deafening sound of truth unspoken when it should be upon the conscience of the wicked.\nWill Snow White speak on Thursday in Lagos at the Apostolic Round Table?"
  },
  {
    "headline": "Biden orders deployment of troops in Eastern Europe amid Ukraine-Russia crisis",
    "summarized_story": "US President Joe Biden says the country will deploy additional troops and equipment to Baltic members of the North Atlantic Treaty Organisation (NATO) in Eastern Europe.\nThe development is coming hours after Russian President Vladimir Putin reportedly ordered troops into two breakaway regions in eastern Ukraine.\nThe Baltic states — Estonia, Latvia, Lithuania — are the only ex-soviet countries to have joined the European Union (EU) and NATO — which Ukraine aims to join.\nSpeaking on Tuesday at a media briefing, Biden said the “United States will continue to provide defensive assistance to Ukraine in the meantime”, adding that the US will also “continue to reinforce and reassure our NATO allies”.\nWe want to send an unmistakable message that the United States together with our allies will defend every inch of NATO territory and abide by the commitments we made it to NATO."
  },
  {
    "headline": "Biden orders deployment of troops in Eastern Europe amid Ukraine-Russia crisis",
    "summarized_story": "US President Joe Biden says the country will deploy additional troops and equipment to Baltic members of the North Atlantic Treaty Organisation (NATO) in Eastern Europe.\nThe development is coming hours after Russian President Vladimir Putin reportedly ordered troops into two breakaway regions in eastern Ukraine.\nThe Baltic states — Estonia, Latvia, Lithuania — are the only ex-soviet countries to have joined the European Union (EU) and NATO — which Ukraine aims to join.\nSpeaking on Tuesday at a media briefing, Biden said the “United States will continue to provide defensive assistance to Ukraine in the meantime”, adding that the US will also “continue to reinforce and reassure our NATO allies”.\nWe want to send an unmistakable message that the United States together with our allies will defend every inch of NATO territory and abide by the commitments we made it to NATO."
  },
  {
    "headline": "2023: Kwankwaso launches political movement to 'rescue Nigeria from dangerous course'",
    "summarized_story": "Rabiu Kwankwaso, former governor of Kano, has launched The National Movement, a political organisation, ahead of the 2023 general election.\nSpeaking on Tuesday at the launch of of movement, Kwankwaso said the organisation was formed to seek solution to the country’s current economic and political challenges.\nThe former Kano governor said the journey of the political movement started in 2021 when a group of friends and associates met under the auspices of ‘Kwankwaso’s friends’ to review the situation of the country.\n“Thus, The National Movement was born.\nAs we can all see here today, The National Movement is made up of all Nigerians at home and in the diaspora."
  },
  {
    "headline": "2023: Kwankwaso launches political movement to 'rescue Nigeria from dangerous course'",
    "summarized_story": "Rabiu Kwankwaso, former governor of Kano, has launched The National Movement, a political organisation, ahead of the 2023 general election.\nSpeaking on Tuesday at the launch of of movement, Kwankwaso said the organisation was formed to seek solution to the country’s current economic and political challenges.\nThe former Kano governor said the journey of the political movement started in 2021 when a group of friends and associates met under the auspices of ‘Kwankwaso’s friends’ to review the situation of the country.\n“Thus, The National Movement was born.\nAs we can all see here today, The National Movement is made up of all Nigerians at home and in the diaspora."
  },
  {
    "headline": "APC convention: Chairmanship 'zoned to north' as governors meet Buhari",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna, says the All Progressives Congress (APC) has agreed on a zoning arrangement for party offices ahead of the national convention.\nEl-Rufai spoke on Tuesday at a media briefing after a meeting of the progressive governors’ forum (PGF) with President Muhammadu Buhari in Abuja.\nAccording to the Kaduna governor, in line with the agreed arrangement, positions earlier held by the north will now go to the south and vice versa.\nAdvertisement“Essentially, the northern zone will have the positions the south has had in the last eight years and vice versa.\n“There were some governors that felt that we should put off the convention until we resolve all the congress issues in some states."
  },
  {
    "headline": "Fintech Focus: Why KYC compliance is crucial for fintechs",
    "summarized_story": "This article focuses on Know Your Customer compliance and fraud.\nTypically, access is restricted for users that do not fulfil KYC requirements.”It’s important to note that KYC is a continuous process.\n“When drafting KYC compliance strategy, fintechs need to balance customer needs with risk management,” Bammeke says.\nMore so, as the company expands, it should continuously improve the KYC process in line with new risks.\nInnovation in KYC: A peek into the futureCompared to legacy institutions known for slower, more nuanced KYC compliance procedures, fintechs are nimble and have quicker, more accessible processes as their services are fully digital."
  },
  {
    "headline": "AfricaWorks’ ambition transcends being a coworking space",
    "summarized_story": "After a minute in the lobby, Gregoire Schwebig, founder and CEO of AfricaWorks came out to meet me.\nAs we exchanged pleasantries, one question lingered; why is this French man building a home-grown business in Africa?\nMore than just a coworking spaceFor AfricaWorks, as the African tech and business ecosystem grows, it will continue to grow to support them across the continent.\nBeyond being a pan-African coworking space, it now wants to do more as it slowly transitions into a tech company.\nAfricaWorks in NairobiAmong other places, the company is also planning to open new space at the Kotoka international airport in Accra, Ghana."
  },
  {
    "headline": "A virtual art gallery in DRC connects local artists with global clients",
    "summarized_story": "Welcome to the engine room of Bandombe Galerie, a virtual art gallery that is the brainchild of Sisqo Ndombe.\nBandombe showcases and connects contemporary African artists with potential clients, globally.\n“It has given access to many African artists and their works to a wider audience and market,” he said.\nOne of those who bought up into Ndombe’s virtual gallery initiative is Rwanda-based painter, Izere Antoine.\nNigerian artist Onofua Dennis, who has also signed on with Bandombe talks glowingly of the virtual gallery."
  },
  {
    "headline": "OctaFX opens the gates for weekend crypto trading",
    "summarized_story": "After having a good year with enthusiastic feedback from the trading community, OctaFX has finally opened its crypto trading offer for the weekends.\nFor Forex trading, this is irrelevant since one can trade the up- as well as the downside of the fiat and cryptocurrency markets.\nAnd up until recently, the global Forex broker offered its cryptocurrency trading only Mondays through Fridays.\nOctaFX is a global broker that provides online trading services worldwide since 2011.\nIt offers a state-of-the-art trading experience and a top-notch service environment to over 7.5 million traders worldwide."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Wash trading scams and money laundering; why NFT traders should be careful",
    "summarized_story": "What is NFT wash trading?\nHow to spot NFT wash tradingEtherscan screenshot that shows a completed wash trade.\nSource: ChainalysisKnowing how blockchain works is required to spot or track NFT wash trading.\nAdvertisementInterestingly, Chainalysis tracked wash trading activities with blockchain analysis, which revealed how sellers go about their wash trading activities.\nNFT wash trading is sort of like a WhatsApp vendor sending you money to buy their products to make it seem like they’re making sales."
  },
  {
    "headline": "Techpoint Pitch Friday is back!",
    "summarized_story": "Share this article:After a long hiatus, Techpoint Pitch Friday is back.\nPitch Friday takes place on the second Friday of every month and provides an avenue for aspiring and existing entrepreneurs to share their businesses or ideas with an audience.\nSome of them include Kelvin Umechukwu of Bumpa, Abolarinwa Adegunloye of Arteasy, winner of the Most Outstanding Marketplace award at Techpoint Awards 2021, and Femi Aiki of Foodlocker, a Techpoint Pitchstorm alumnus.\nFor example, say you’re looking to raise from investors, you could get feedback that could help you refine your pitch.\nAll you have to do is register to pitch your startup here or as a part of the audience here, then save the date in your calendar."
  },
  {
    "headline": "Women-focused credit facility and Africa’s developer ecosystem",
    "summarized_story": "AdvertisementBefore then, these are what I’m discussing today:Credit facility for African women entrepreneurs716,000 African developers and countingWhat’s up with the new features on your favourite apps?\nYesterday, it announced backing Nigeria’s first commercial bank, First Bank of Nigeria Ltd, with a $100 million credit facility to support women entrepreneurs and SMEs in the country.\nOf this amount, a minimum of $30 million will go into credit lines for women-owned and led businesses.\nThe credit facility will be disbursed through the bank’s over 700 branches and 150,000 agents across the country.\nThe findings show an all-time increase in demand for African developers globally and over 2.5x growth in VC funding, all of which happened despite the challenge that came with the pandemic."
  },
  {
    "headline": "GDP growth fails to lift job-creating sectors",
    "summarized_story": "But growth has been sluggish in sectors that have the capacity to create jobs and lift many people out of poverty.\nIn terms of value, the performance of these sectors has also been underwhelming without significant growth compared with 2014.\nTrade grew marginally to N11.4 trillion in 2021 compared with N11 trillion in 2014, while the agriculture sector expanded to N18.7 trillion in 2021 compared with N15.4 trillion in 2014.\nSince oil-dependent Nigeria recovered from the 2016 recession, the growth of the sectors has been stifled by various challenges.\nThe Nigerian education sector has received poor budgetary allocations to run the system."
  },
  {
    "headline": "Why Nigeria needs robust credit assessment infrastructure",
    "summarized_story": "Most people in developing economies cannot access credit because of a lack of credit infrastructure in these economies.\nCredit infrastructure is an enabler of financial services and lending, the building blocks of the modern economy.\nBut a functional credit infrastructure system is needed to access credit, especially in its affordable form.\nIt is necessary for developing economies to adopt proper credit policies to address credit infrastructure gaps and kickstart economic growth.\nBuilding a robust credit infrastructure in Nigeria is the bridge to creating new financial and scale possibilities (option) for businesses, and individuals."
  },
  {
    "headline": "Oil surges near $100 but Nigeria is not at the party",
    "summarized_story": "Oil surges near $100 but Nigeria is not at the partyOil and gas prices are climbing on fears that the Ukraine-Russia crisis will disrupt supplies across the world but Nigeria and its economy remain unimpacted, thanks to years of poor spending.\nIn London, the FTSE 100 share index opened more than 1.4% lower before regaining some ground.\nThe UK and several western allies have threatened sanctions on Russia, which is the second-largest oil exporter after Saudi Arabia.\nThe Ukraine-Russia crisis could have “substantial implications” on oil prices, which have jumped more than 10% since the start of the month, said Sue Trinh of Manulife Investment Management.\nSanctions forcing Russia to supply less crude or natural gas would have an “important impact on the global economy”, she added."
  },
  {
    "headline": "Leave politics for politicians, do your jobs as professionals, Obaseki charges new Permanent Secretaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… preaches against disunity, disharmony in EdoBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, swore in nine new Permanent Secretaries with a charge to act responsibly in the discharge of their duties.\nThe newly sworn in Permanent Secretaries include: Iryn Omorogiuwa, Efosa Aisien, Nyamali Erumuse, Igbinomwanhia Abieyuwa, Imoihosen Oziegbe, Peter Osagie, Sabina Chikere, Osawemwenze Kayode-Iyasere and Bernard Aigbe.\nYou are not the political heads of these agencies and ministries; leave politics for politicians and do your jobs as professionals.\nEdo is one; whether you are Edo South, Edo Central or Edo North, Edo is one.\nResponding on behalf of the newly sworn-in Permanent Secretaries, Mr. Bernard Aigbe, thanked the governor for finding them worthy for the appointment, pledging not to fail in their duties."
  },
  {
    "headline": "Obaseki inaugurates eight-man private property protection c’ttee to improve land administration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated an eight-man Edo State Private Property Protection Law Implementation Committee charged with the responsibility of improving land administration in the state and supporting the government’s efforts at checking the activities of land grabbers and property speculators in communities across the state.\nObaseki, while inaugurating the committee at the Government House in Benin City, said his administration amended some aspects of the Edo State Private Property Protection Law to strengthen the committee’s capacity to effectively and efficiently deliver on its duties.\nHe said, “This committee was set up to arrest and restrain offenders who contravene provisions of the Edo State Private Property Protection Law 2021.\nThey are also to receive, screen and conduct preliminary review proceedings on public and private petitions relating to the subject of this law.\n“We will ensure peace in our communities and state, ensuring that the act of selling people’s land is a thing of the past in Edo.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts. – Nigerian Observer",
    "summarized_story": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts.\nShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Leadership and members of NBM of Africa Worldwide, Benin Zone, have congratulated the Benin Monarch, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, on the return of two looted Benin artifacts; bronze Cockerel (Okpa) and Uhunwun-alao (Head of Oba) by the Jesuit College of the University of Cambridge and University of Aberdeen, Scotland to the Oba of Benin.\nThe Benin Zone, NBM of Africa, in a statement issued by its Public Relations Officer (PRO), Comrade Idahosa Moses, on behalf of the President, Benin Zone, said that members of the movement heartily commended President Buhari and Oba Ewuare II for ensuring that the artifacts were returned safely to the Oba palace, where they were looted.\n“May God bless and keep safe His Royal Majesty and grant him good health, happiness, more wisdom and long life, Oba Gha Tokpere, Isee!!!”.\nThe Zonal PRO averred that the Benin artifacts transcend beyond mere artworks, as they are symbols of traditional heritage of the Great Benin Kingdom which must not be allowed to be domiciled outside the palace of the Oba."
  },
  {
    "headline": "Anti open grazing bill scales second reading in Edo assembly – Nigerian Observer",
    "summarized_story": "Hon.Okhuarobo said the bill also seeks to introduce modern methods of ranching.\nHon.Okiye noted that the bill, if passed would eliminate the dangers associated with open grazing.\nOther lawmakers unanimously supported the passage of the bill with a call on the security agencies in the state to step up their game especially in rural communities.\nWith no dissenting voice, the speaker thereafter subjected the bill to a voice vote and was unanimously supported by the lawmakers.\nThe speaker, directed the clerk, Yahaya Omogbai to forward copies of the bill to the house committee on food security."
  },
  {
    "headline": "Bolt and Fixit45 collaborate to improve access to autocare services",
    "summarized_story": "Fixit45, has partnered with ride-hailing platform, Bolt to provide its community of drivers with access to subscription-based plans that minimize potential mobility disruption and improves their chances of income optimization.\nThis subscription-based service plan for drivers on the Bolt platform guarantees unfettered access to quality auto services that include autocare, vehicle repair and maintenance from Fixit45’s service network across the Country.\nOther benefits include access to repair financing, discounts on spare parts, unlimited diagnosis, periodic car wash and tire services.\n“As a platform that enhances mobility experiences, Fixit45 has collaboration in its DNA.\nThis partnership with Bolt is poised to keep the lights of the Nigerian economy on,” Obaoye said."
  },
  {
    "headline": "CSCS’ Chief Executive, Jalo-Waziri, elected Vice President of AMEDA",
    "summarized_story": "In strengthening its governance and execution of strategic objectives, the regional association of global Central Securities Depositories (CSDs), Africa and Middle East Depositories Association (AMEDA), elected Mr. Haruna Jalo-Waziri, the Managing Director/Chief Executive Officer of Central Securities Clearing System (CSCS) Plc as its Vice President.\nAs the Chief Executive Officer of CSCS, Mr. Jalo-Waziri has led transformation of CSCS into an agile and innovative market infrastructure, delivering unprecedented results to the company’s shareholders and broader Nigerian capital market stakeholders.\nSpeaking on the election, Mr. Jalo-Waziri noted: “I feel greatly honored by my nomination and more so the overwhelming vote of confidence at the election.\nJalo-Waziri has been a very active member of AMEDA, representing the Nigerian CSD, over the past five years.\nWith memberships in Africa and Middle East regions, AMEDA serves as a dialogue channel and bridge for global partnerships with the regions’ CSDs."
  },
  {
    "headline": "NGX Inducts 133 New Authorised Dealing Clerks",
    "summarized_story": "Nigerian Exchange Limited inducted a total of 133 Authorised Dealing Clerks from 63 Trading License Holder today, 22 February 2022 charging them to uphold the highest level of ethics and responsibility.\nThe X-Academy, our specialized learning centre is equipped to fill this gap by offering a wide range of courses geared towards bridging the knowledge gap of capital market professionals, investors and the general public, about how the capital market works.\nAny opinion or other information in this message or its attachments that does not relate to the business of Nigerian Exchange Group is personal to the sender and is not given or endorsed by Nigerian Exchange Group.\nNigerian Exchange Group accepts no responsibility for any loss arising from such personal communication.\nNigerian Exchange Group (RC 2321) Registered Office: 2-4 Customs Street, Lagos, NigeriaFacebook Notice for EU!"
  },
  {
    "headline": "Fidelity Bank Restates Support for CBN FX Repatriation Push, Sensitizes Customers on Emerging Opportunities in non-Oil Exports",
    "summarized_story": "The Executive Director, Northern Businesses, Fidelity Bank Plc, Hassan Imam made this known on Monday in Kano at a workshop for exporters and investors on the implementation and opportunities in the new CBN RT200 FX Policy.\nThe Regional Bank Head, North West 1, Fidelity Bank Plc, Mannir Ringim re-emphasised the bank’s readiness to support government’s economic imperatives to boost revenue in non-oil sector of the economy.\n“Now, Fidelity Bank wants to remain the exporters’ bank of choice not only by providing finance but by helping exporters in bridging the knowledge gap in exporting their commodities.\nAccording to him, the workshop tagged, Harnessing Export Business Opportunities, CBN RT200 FX Programme: current issues, non-oil exports and implications to business; drew inspiration on the policy’s guidelines.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria with over 6million customers who are serviced across its 250 business offices and digital banking channels."
  },
  {
    "headline": "Alleged N2.9bn Fraud: Okorocha’s Absence Stalls Arraignment",
    "summarized_story": "The planned arraignment of a former governor of Imo State, Owelle Rochas Okorocha, could not hold at a Federal High Court in Abuja, due to the absence of the former governor in court on Tuesday.\nOkorocha was governor of Imo State from 2011 to 2019, and presently a Senator representing Imo West in the National Assembly.\nWhen the matter came up on Tuesday, all the other defendants were present in court except Senator Okorocha.\nADVERTISEMENT“My Lord, the matter would have been for arraignment of the defendants but the 1st defendant is not in court.\nMeanwhile, the trial judge, Justice Inyang Ekwo, has adjourned the matter to March 28, 2022 by 12noon, for arraignment."
  },
  {
    "headline": "2023 Presidency: Gov Bello Remains People’s Choice – Group",
    "summarized_story": "A political support group known as ‘Got Your Back Nigeria’ has declared Kogi State governor, Yahaya Bello, as the choice of the Nigerian people for the office of the President come 2023.\nThe co-ordinator of the group, Prof. Chris Mustapha Nwaokobia Jnr, stated this in a press statement titled, “2023 Presidency: And The People’s Choice Is GYB, Why, You May Ask” sent to journalists in Abuja on Tuesday.\n“We cannot in pursuing our individual ambition deny others that right.\nNigerians are unanimous in the choice of Youth, Competency, Capacity, and Inclusiveness.\nAnd Nigerians believe that together with GYB we can reset, restart and rework our nation for greatness."
  },
  {
    "headline": "N’Delta: Young Professionals Laud Emefiele For Supporting Youth Entrepreneurship",
    "summarized_story": "The Nigerian Young Professionals Forum (NYPF), has lauded the enviable strides of the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele, towards supporting the development of human capacity, especially among young people in the Niger Delta region.\nSimbi Wabote, as well as the Heritage Bank led Ifie Sekibo, both of whom are from the Niger Delta.\nHigh point of the event was the sharing of heart-touching stories by some successful business owners in the Niger Delta.\nThe 2022 Niger Delta MSME Summit which is the 48th event to be organised by the NYPF, was jointly organised by the Niger Delta Young Professionals (NYDP).\nThe third edition of the Niger Delta MSME Summit is slated for Akwa Ibom State in 2023."
  },
  {
    "headline": "Ethnic Youth Leaders Condemn Attack On CBN Gov Emefiele",
    "summarized_story": "The Nigerian Ethnic Youth Leaders Council (NEYLC), on Monday, condemned a newspaper report (not LEADERSHIP) for what it described as an unprovoked attack on the Governor of Central Bank of Nigeria (CBN), Dr. Godwin Emefiele.\nThe NEYLC, which is made up of the Arewa Consultative Youth Movement (ACYM), Ohanaeze Ndigbo Youth Movement, Oduduwa Youths and Middle Belt Youth, made its position known in a statement signed by the Ohanaeze Secretary-General and head of Coalition’s secretariat, Nwada Ike Chiamaka.\nThe ethnic youth leaders said it was surprising that the newspaper could descend so low to the point of criticising Emefiele for an ambition that he was yet to declare.\n“We therefore call on the management of the newspaper to apologise to Emefiele and those who have been appealing to him to contest.\nThe newspaper should also retrace its steps and restrict itself to the traditional role of informing the people and not playing to the gallery.”ADVERTISEMENT"
  },
  {
    "headline": "APC’s Inability To Conduct Convention Shows State Of Nigeria Under Its Watch – PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) has said that the inability of the ruling All Progressives Congress (APC) to conduct a routine national convention as planned further explained why all sectors of national life in Nigeria have been in shambolic state under the APC administration.\n“The APC is a perfect example of failure both as a party and government unable to conduct a simple National Convention in two years.\nIt has become a Russian Roulette with unending request for extension of time to undertake a routine statutory political activity.\nADVERTISEMENT“Our Party is not surprised that the APC, a party of backstabbers, again postponed its National Convention already scheduled for February 26, 2022.\n“The only way the APC can legitimately participate in the 2023 general is to re-apply to the Independent National Electoral Commission (INEC) for fresh registration as a political party."
  },
  {
    "headline": "Nigeria Surviving On Loans, Nothing Is Working – Gani Adams To Buhari",
    "summarized_story": "Nigeria Surviving On Loans, Nothing Is Working – Gani Adams To BuhariAare Onakakanfo of Yorubaland, Iba Gani Adams, has urged President Muhammadu Buhari to initiate new strategic approach to save Nigeria’s economy.\nAdamns criticized the Buhari administration policies that had reduced the nation to surviving on foreign loans.\nHe warned that dependence on borrowings would make Nigeria a perpetual debtor and cause problems for future generations.\n“Nigeria has been surviving on foreign loans and the economic hardship is hitting hard on ordinary citizens.\n“It is very important for President Muhammadu Buhari to take a drastic step that can help salvage the economy”, he noted."
  },
  {
    "headline": "JUST IN: Buhari, 18 All Progressives Congress Governors In Tense Meeting Over Contentious Convention",
    "summarized_story": "JUST IN: Buhari, 18 All Progressives Congress Governors In Tense Meeting Over Contentious ConventionPresident Muhammadu Buhari is meeting with governors from the ruling All Progressives Congress (APC) behind closed doors (APC).\nDaily Trust reports that some party stakeholders are not happy with the postponement of the February 26 date earlier fixed for the convention.\nStakeholders of the party are expecting the president to act to save the party from a looming implosion.\nAhead of today’s meeting with the president, the party governors under the aegis of the Progressive Governors’ Forum (PGF) had a meeting last night at the Kebbi Government Lodge.\nThe caretaker committee was constituted to resolve the crisis in the party and conduct convention."
  },
  {
    "headline": "Governor Emmanuel Sacks Chief of Staff As Crisis Over 2023 Succession Deepens",
    "summarized_story": "Governor Udom Emmanuel of Akwa Ibom State has sacked his Chief of Staff (CoS), Akparawa Ephraim Inyang-eyen.\nThe statement reads: “On behalf of His Excellency, the Governor, government and the good people of Akwa Ibom State, I write to convey to you His Excellency, the Governor’s profound appreciation of the worthy contributions you made to the development of our dear State while you served as Chief of Staff to the Governor.\n“However, given the urgent need to match skill set and competencies to the task of maintaining the momentum of economic development in peace, your services are no longer required and you are hereby relieved of your position, as the Chief of Staff (CoS) to His Excellency, the Governor with immediate effect.\n“You have therefore directed to hand over all property of government in your possession to the Secretary to State Government.\nBesides, it was learnt the governor became furious over the allegation that the former CoS was secretly supporting Senator Bassey Albert Akpan’s quest to become the next governor instead of the governor’s choice of Pastor Umo Eno, his Commissioner for Lands and Water Resources."
  },
  {
    "headline": "BREAKING: Buhari, APC Govs Meet Over National Convention",
    "summarized_story": "President Muhammadu Buhari and All Progressives Congress(APC) Governor’s are in a closed-door meeting in the Executive Council Chamber of of the Presidential Villa, Abuja.\nThe meeting, whoch started around 3pm, was rescheduled following postponement of the earlier one by President Buharinlast week just before he traveled to Belgium for the EU-African Summit.\nThe meeting has 18 members of the Progressives Governors Forum(PGF) in attendance.\nThey are Governors of Yobe, Ekiti, Ebonyi, Jigawa, Kaduna, Lagos, Borno, Niger, Gombe, Osun, Kebbi, Nasarawa, Kwara, Kano, Imo, Kogi, Ogun and Plateau States.\nAnambra Deputy Govenor is also in attendance."
  },
  {
    "headline": "Niger: Insurgents’ explosives kill 4 NSCDC operatives, 6 civilians slain, 20 Zuru villages sacked by gunmen",
    "summarized_story": "The NSCDC personnel were reported to be on rescue mission when their vehicle ran into the landmines.\nNiger state Commissioner of Police Monday Bala Kuryas confirmed this in telephone interview with journalists in Minna.\n“We appeal to residents to assist security personnel deployed with reliable information that could aid in apprehending miscreants.\nIt was gathered that about 20 towns and villages were sacked in Zuru emirate of Sakaba and Danko/Wasagu local government areas.\nHe assured the IDPs that efforts were on to resettle them in their various places while additional security personnel would be deployed to reinforce security."
  },
  {
    "headline": "[Breaking] ‘Drug trafficking’: Abba Kyari fights back, drags FG to court",
    "summarized_story": "DCP Abba Kyari, the suspended Police officer on Monday sued the federal government to the court over his alleged involvement in drug trafficking.\nKyari is currently in the custody of the National Drug Law Enforcement Agency (NDLEA).\nPending the hearing and determination of his fundamental right enforcement application, the detained Police officer in his suit marked FHC/ABJ/CS/182/22, is praying the court to compel NDLEA to grant him bail on health grounds.\nDetails loading…"
  },
  {
    "headline": "Breaking: Court throws out suit challenging Atiku’s citizenship",
    "summarized_story": "A Federal High Court in Abuja Monday struck out a suit challenging the Nigerian citizenship of former Vice President, Alhaji Atiku Abubakar.\nJustice Inyang Eden Ekwo struck out the suit instituted by the Incorporated Trustees of Egalitarian Mission for Africa challenging the Nigerian citizenship of former number two man in Nigeria.\nThe court held that the Non Governmental Organisation (NGO) had no legal right in the first instance to query the citizenship of the former Vice President.\nThe suit which was filed on 11th February, 2019, has Atiku, PDP, the Independent National Electoral Commission, the Attorney-General of the Federation and Minister of Justice as well as the Attorney General of Adamawa state as defendants.\nSpecifically, the plaintiff had approached the court for an interpretation of Sections 25(1) & (2) and 131(a) of the 1999 Constitution."
  },
  {
    "headline": "APC Governors Back New Convention Date, Adopt Zoning",
    "summarized_story": "﻿Governors of the All Progressives Congress on Tuesday said they were in support of the party’s new date for its National Convention.\nChairman of the APC Governors’ Forum and Governor of Kebbi State, Atiku Bagudu, revealed this after the Governors met with President Muhammadu Buhari in Abuja.\nThe APC on Monday had postponed its National Convention to March 26.\n‘United Governors’“There were differences among [APC] Governors over timing of the Convention,” Governor Nasir El-Rufai of Kaduna said after Tuesday’s meeting, according to a series of tweets by presidential aide Tolu Ogunlesi.\nBy God’s grace by March 26 we will hold the APC national convention."
  },
  {
    "headline": "Strike: FG Meets With ASUU",
    "summarized_story": "The Minister of Labour and Employment, Chris Ngige on Tuesday met with the leadership of the Academic Staff Union Of Universities (ASUU).\nThe meeting was the first since ASUU declared its warning strike last week, over what it termed as the Federal Government’s refusal to honour its agreement to implement the Memorandum of Action signed with them in December 2020.\nMeanwhile, the House of Representatives has asked the Federal Government and ASUU to comply with the Memorandum of Understanding to end the ongoing warning strike in the interest of students and the education sector in the country.\nThe resolutions followed a motion titled, ‘urgent need to address the frequent strike actions by ASUU,’ moved by Dozie Nwankwo from Anambra State.\nThe University lecturers embarked on the strike action last week and it is expected to last for four weeks."
  },
  {
    "headline": "Cocaine Deal: Court Grants NDLEA’s Request To Detain Abba Kyari, Six Others",
    "summarized_story": "A Federal High Court sitting in Abuja has granted an application by the National Drug Law Enforcement Agency (NDLEA) to detain for two weeks, the suspended Deputy Commissioner of Police Abba Kyari and six others under investigation for their involvement in a 25kilograms cocaine deal.\nJustice Zainab Dimka Abubakar gave the order on Tuesday, Director, Media & Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi, disclosed in a statement.\nThe agency had in the application dated February 15, sought the leave of the court to detain the suspects in NDLEA custody for 14 days pending the conclusion of investigations.\n“That the 1st to 5th respondents have volunteered their statements upon preliminary investigation, which has shown complicity in the case.\n“That the investigation will take some time as there are complicated dimensions of the case that require follow-up and unravelling."
  },
  {
    "headline": "UK Imposes Sanctions On Russian Banks And Oligarchs",
    "summarized_story": "Britain on Tuesday slapped sanctions on five Russian banks and three billionaires, in what Prime Minister Boris Johnson called “the first barrage” of measures in response to the Kremlin’s actions in Ukraine.\n“The UK and our allies will begin to impose the sanctions on Russia that we have already prepared… to sanction Russian individuals and entities of strategic importance to the Kremlin,” he told MPs.\nThe five banks targeted — Rossiya, IS Bank, General Bank, Promsvyazbank and the Black Sea Bank — and three people sanctioned will see any UK assets frozen.\n“We made clear to the Russian Ambassador that Russia would pay the price for its actions through further sanctions if it did not withdraw its troops,” a ministry spokesperson added.\nJohnson insisted further sanctions were “at readiness to be deployed” if the Kremlin continued its aggression."
  },
  {
    "headline": "Holders Chelsea Beat Lille 2-0 In Champions League Last 16 First Leg",
    "summarized_story": "Kai Havertz and Christian Pulisic scored as Chelsea beat Lille 2-0 in the first leg of their Champions League last-16 tie at Stamford Bridge on Tuesday.\nHavertz headed the reigning European champions into the lead in the eighth minute and Pulisic doubled their advantage on a breakaway just after the hour.\nThe result leaves the French champions up against it going into the return leg on March 16."
  },
  {
    "headline": "7 Man panel concludes sitting on Zamfara Deputy Governor, Mahdi Gusau -",
    "summarized_story": "A Public hearing on the allegations levelled against the Zamfara State Deputy Governor Mahdi Aliyu Gusau by the Seven Man Panel of Investigation set up by the state Chief Judge has endedThe panel says they are aware that the deputy Governor was notified to appear before it via email, watsapp, hard copies of the letter and other electronic meansAdvertisementThe panel also insisted that it was not served nor made aware of any restraining order preventing it from carrying out the exerciseThe Zamfara State House of Assembly is accusing deputy Governor Mahdai Aliyu Gusau of Misappropriation of funds, breach of the Constitution, Gross misconduct and abuse of OfficeAdvertisementIt has according kick-started the process of Impeaching the Deputy GovernorAdvertisementAdvertisementThe lawmakers had earlier this month requested the state chief judge Kulu Aliyu to set up a panel to Investigate the deputy Governor on allegations against himA few days later, the Chief Judge set up a seven man fact finding panelAdvertisementAdvertisementAt the first day of the public hearing, Seven Witnesses from the Complainant testified before the panel but no representative came from the respondentAdvertisementAbdul Ibrahim a Senior Advocate of Nigeria who is also a member of the Panel while addressing Newsmen at the end of the public hearing said the panel will be fair to all partiesHe adds that the panel is saddled with the responsibility to Investigate the allegations on the Deputy Governor and not declare anyone guilty of any offenceAdvertisementThe panel insists that the deputy Governor was duly served a notice to appear before it through available meansCounsel to the Zamfara State House of Assembly Nasiru Jangebe expressed Confidence in the panelAdvertisementThe Zamfara State Deputy Governor Mahdi Aliyu recently at a press conference described the impeachment exercise as illegal because a competent court of law had restrained any moves being made to Impeach himBut, the Panel says they are yet to be served with such an order from any Court of LawAdvertisementThe panel has three months to Submit it’s Report to the Zamfara State House of Assembly."
  },
  {
    "headline": "APC zones 2023 Presidency to Southern Nigeria",
    "summarized_story": "The All Progressives Congress will most likely choose its National chairman by consensus rather than by the ballot.\nThis was disclosed by the chairman of the progressives governors forum after a closed door meeting between the 22 APC governors and president Muhammadu Buhari in the presidential villa.\nAdvertisementAtiku Bagudu says Mr. President is disposed to the emergence of a consensus candidate and believes this will be in the interest of the party, but also says other aspirants who have indicated interest in the contest are also competent and qualified to occupy the office of national chairman.\nThe governors have unanimously agreed that zoning and consensus should be incorporated as part of arrangements for the national convention.\nAdvertisementGovernor of Kaduna state Nasir El-Rufai also revealed that the party has agreed on a zoning formula for all six geopolitical zones and the positions occupied by the northern zones in the last eight years will be swapped with the southern zones."
  },
  {
    "headline": "Youths threaten to sue female Engineer if she fails to join 2023 presidential race",
    "summarized_story": "A group of youths under the aegis of Ondo State Youth for Good Governance have vowed to drag a renowned engineer, Dr. Funmilayo Waheed-Adekojo to court if she fails to join the 2023 Presidential race.\nRising from its meeting in Akure, the Ondo state, the group said the Arigidi-Akoko born philanthropist has what it takes to transform Nigeria.\nAdvertisementThe youths said Funmilayo Waheed-Adekojo would be charged to court if she refuses to contest for the presidential election in 2023.\nThey pointed out that Nigeria needs a woman with wealth of experience in the business world and humanitarian gesture to change the face of politics in NigeriaAdvertisementAccording to a statement issued at the end of the meeting and signed by Organizing Secretary of the group, Abiloro Feranmi and Publicity Secretary, Alade Sunday Olumide, Funmilayo Waheed-Adekojo will serve Nigeria better if given chance to serve Nigeria."
  },
  {
    "headline": "Civil society groups protest in Abuja, urge Buhari to sign Electoral Amendment bill",
    "summarized_story": "Civil society groups are on a peaceful protest in Abuja to pile pressure on President Muhammadu Buhari to sign the electoral act amendment bill.\nThe groups gathered at the unity fountain in the country’s capital, they carried placards with different messages targeted at Mr. President and intended to force him to sign the bill that will enhance Nigeria’s electoral process.\nAdvertisementThey are worried that a further delay to get the President’s assent on the bill will alter INEC’s election timetable .\nAn earlier statement from the presidency signed by Femi Adeshina the spokesman appeared to dismiss the concerns of groups advocating for electoral reforms and accused them cashing in on the delay in signing the bill to forment civil disorder and muddy the waters.\nAdvertisementThe presidency insists president Buhari will do the right thing within the lawful time."
  },
  {
    "headline": "Shehu Sani : Buhari Benefits from Electoral Bill and He Should Sign It Now",
    "summarized_story": "Twenty-six civil society groups embark on a protest in Abuja over President Muhammadu Buhari’s seeming reluctance to assent to the Electoral Act Amendment Bill.\nOn President Buhari’s request, the bill was re-amended by the National Assembly and retransmitted to the president for his approval late last month.\nTo discuss the Electoral Bill and comment on the president’s obvious prevarication on the legislation, is Senator Shehu Sani.\nSenator Sani is an author, playwright and human rights activist.\nHe also represented Kaduna Central Senatorial District in the National Assembly between 2015 and 2019."
  },
  {
    "headline": "Abba Kyari Sues FG, Denies Allegations & Demands 500M Compensation – Trending With Ojy Okpe",
    "summarized_story": "The embattled deputy commissioner of police, Abba Kyari sued the federal government on Monday and denied drug trafficking allegations leveled against him.\nThe Minister Of Information and Culture, Lai Mohammed during a media briefing on Monday, raised the alarm on the rising rate of ritual killings in the country some of which have been attributed to the use of Social media.\nHe said the federal government is committed to ensuring the responsible use of social mediaFormer President Olusegun Obasanjo has shared insights on how the federal government can tackle insecurity."
  },
  {
    "headline": "Hong Kong Orders Mandatory Covid Tests for All Residents",
    "summarized_story": "Hong Kong will test its entire population for COVID-19 in March, the city’s leader said Tuesday, as the city grapples with its worst outbreak driven by the omicron variant.\nHong Kong has reported about 5,000 new daily infections since Feb. 15, with the number threatening to overwhelm its healthcare system.\nSince the surge began at the beginning of the year, the city has recorded nearly 54,000 cases and 145 deaths.\nThe order for citywide testing comes after mainland Chinese authorities dispatched health workers and medical resources last week to help contain the outbreak in the semi-autonomous Chinese city."
  },
  {
    "headline": "Oil Hits Highest Since 2014 on Russia-Ukraine Escalation",
    "summarized_story": "“The potential for a rally over $100 a barrel has received an enormous boost,” said Tamas Varga of oil broker PVM.\nU.S. West Texas Intermediate (WTI) crude jumped $4.41, or 4.8%, to $95.48 versus Friday’s settlement, having earlier reached $96, also the highest since 2014.\nThe crisis over Ukraine has added further support to an oil market that has surged due to tight supplies as demand recovers from the coronavirus pandemic.\nThe Organization of the Petroleum Exporting Countries and allies, known as OPEC+, have resisted calls to boost supply more rapidly.\nTalks are ongoing on renewing Iran’s nuclear agreement with world powers, which could eventually boost Iran’s oil exports by over 1 million barrels per day."
  },
  {
    "headline": "Russia Faces New Sanctions after Putin Recognise Breakaway Ukraine Regions",
    "summarized_story": "The United States and its European allies are set to announce fresh sanctions against Russia on Tuesday after President Vladimir Putin recognised two breakaway regions in eastern Ukraine, deepening Western fears of a new war in Europe.\nA senior British government minister said it was clear Putin had chosen confrontation over dialogue and Britain would respond with sanctions.\nHe said the situation was as grave as the 1962 Cuban missile crisis when a confrontation between the United States and the Soviet Union brought the world to the brink of nuclear war.\nEuropean Union member states’ ambassadors will meet to discuss possible sanctions with limited sanctions a possible option, an EU official said.\nRussia annexed Crimea from Ukraine in 2014, and Western countries imposed sanctions on Russia."
  }
]