[
  {
    "headline": "After three years in ‘exile’, Dankwambo returns to Gombe",
    "summarized_story": "There was ecstasy in some parts of Gombe State on Saturday when a former governor of the state, Ibrahim Dankwambo, returned three years after he left the state.\nPDP chieftains and his supporters thronged the Gombe Airport to welcome him, a development that led to a gridlock in the metropolis.\n“We made a mistake in 2019 and we should not repeat the same mistake in 2023; we should get ready,” Dankwambo said at the party secretariat.\nHe also said he would purchase presidential form if his supporters urge him to participate in the 2023 election.\nHe added, “If they want me to purchase the form I will go and get the forms."
  },
  {
    "headline": "2nd Niger Bridge: N157bn spent so far, project dear to Buhari, says minister",
    "summarized_story": "The Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, said on Saturday that N157bn had so far been spent on the construction of the second Niger Bridge.\nShe applauded Julius Berger for its innovations in executing the project and for engaging women in the project.\n“Today, we have been able to fund this project with N157bn and I’m here to see where all this money is going.\nThe NSIA MD said the project was one of the three projects being funded from the Presidential Infrastructure Development Fund.\nOrji said, “The PIDF is a special fund set up by President Muhammadu Buhari and managed by the NSIA."
  },
  {
    "headline": "2023: Yahaya Bello targets raising 20m millionaires by 2030",
    "summarized_story": "Governor Yahaya Bello of Kogi on Saturday officially declared his intention to contest for the 2023 presidential election and promised to end poverty by raising 20 million millionaires by 2030.\nThe News Agency of Nigeria (NAN) reports that Bello declared to run for President under the platform of the All Progressives Congress (APC).\n“ I have proven time and time again that I am the only such successor in the APC’s line-up for 2023.\n‘’Bello promised inclusivity, adding that Nigerians should be able to live and contribute anywhere in the nation with the guarantee that they would not be called strangers .\nAbiola-Costello said the nation was on the match to its true destiny with Bello, adding that women would build the nation and therefore, encouraged women and youths to support Bello because the takeover tie for them had come."
  },
  {
    "headline": "Man, 27, in Police net for hacking his father to death in Ogun",
    "summarized_story": "By James OgunnaikeA-27-years old man Ibrahim Sikiru was on the 30th of March 2022 arrested, by operatives of Ogun State Police command for killing his biological father.\nA statement issued by the command spokesperson, Abimbola Oyeyemi, said, the suspect was arrested following a complaint lodged at Onipanu divisional headquarters by one Abiodun Sunday, a neighbor to the deceased.\nUpon the report, the DPO Onipanu division, CSP Bamidele Job quickly mobilized his men and moved to the scene where the suspect was arrested and victim rushed to General Hospital for treatment.\n“The suspect, who is strongly suspected to be a cultist has no reasonable explanation for his action when interrogated”, Oyeyemi said.\nMeanwhile, the State Commissioner of Police, Lanre Bankole, has ordered the immediate transfer of the suspect to homicide section of the state criminal investigation and intelligence department for further investigation and diligent prosecution."
  },
  {
    "headline": "IGP Patrols Abuja-Kaduna Highway, says Kaduna is accessible",
    "summarized_story": "Deploys more troops on Abuja-Kaduna highwayBy Ibrahim Hassan-WuyoThe Inspector-General of Police, Usman Alkali ,has said that the rumours that Kaduna is no longer accessible due to attacks is not true.\nHe spoke on Saturday when he patrolled the Abuja-Kaduna highway.\nMr. Alkali also deployed more troops to the Abuja-Kaduna to boost security,following Monday’s train attack by terrorists.\nHe said troops have been deployed to the scene of the train attack inside Dutse forest in Chikun local government area of Kaduna, where repairs of the destroyed rail tracks were on going.\n“Rumours that Kaduna is no longer accessible due to attacks is not true.The Abuja-Kaduna highway is safe for people to travel by,” he said."
  },
  {
    "headline": "Ramadan: Re-dedicate your life to humanity, pray for Nigeria, Obasa urges Muslims",
    "summarized_story": "By Ebunoluwa SessouSpeaker of the Lagos State House of Assembly, Mudashiru Obasa, has urged Nigerian Muslims to rededicate their lives, increase their love for others, and show stronger commitment and obedience to God’s instructions during this period of the Islamic holy month.\n“It should be seen as an opportunity for Allah’s blessings “as we carry out all that He has commanded us to do.\n“I congratulate us all, the Muslim Ummah, for having this opportunity, a special grace from God to take part in this year’s Ramadan.\n“Let’s not forget to show love more at this time and at all times in our journey of life.\nObasa however urged Muslims in the country to use the period to pray for a better Nigeria characterised by peace."
  },
  {
    "headline": "Unemployment, hunger bedeviling Nigeria — Wike",
    "summarized_story": "By Davies IheamnachorThe Rivers State Governor, Chief Nyesom Wike, has stated that unemployment and hunger were part of the myriad of challenges confronting the nation.\nWike also said the security architecture in his state is impeccable and in place, adding that the state is safe for investors.\nWike, who was represented by his Deputy, Dr.(Mrs) Ipalibo Banigo, said that the project would put smiles on the faces of our people not only in Aluu and Ikwerre Local Government Area, but the entire Rivers State and Nigeria in general.\nRivers State is the most secured state in Nigeria today,” he said.\nHowever, the Chairman of Ikwerre Local Government Area, Engr."
  },
  {
    "headline": "Taraba speaker urges Muslims to pray for peace in Nigeria",
    "summarized_story": "Muslims in Taraba State and the country at large have been urged to pray for peace to reign in the country which has been bedevilled by the insecurity of life and property.\nThe speaker of the Taraba State House of Assembly, Joseph Albasu Kunini, made the admonition on Saturday in Jalingo, the state capital, while felicitating the Muslims on the commencement of this year’s Ramadan fast.\nAccording to him, since the holy month of Ramadan “is meant to strengthen the relationship between the Muslim Ummah and their Creator,” they should use the opportunity to pray for His intervention for peace to permeate every part of the country.\n“This has become imperative because we are approaching the electioneering period and people have started jostling for various elective offices, hence only fervent prayers will ensure the emergence of good leaders both at the state and federal levels,” he said.\nPraying that “this year’s Ramadan mark the turning point in the precarious situation in the country” he urged both Muslims and Christians not to relent on praying for peace to reign in the state and the nation at large."
  },
  {
    "headline": "Embark on road tour to prove Nigeria safer under Buhari – APC stalwart to Lai Mohammed",
    "summarized_story": "A chieftain of the ruling All Progressives Congress (APC), Jonathan Vatsa, has challenged the Minister of Information and Culture, Lai Mohammed, to tour the country by road to prove that Nigeria is safer under President Muhammad Buhari as he claimed.\nVatsa, a former Commissioner for Information and Culture in Niger State, told newsmen in Minna that the security situation facing the nation has continued to deteriorate on a daily basis with no end in sight.\nI challenge Mr Minister to tour the country by road, particularly Niger and Kaduna states let us see if the country is safer in the hand of Buhari or not.\nThe former Publicity Secretary of APC in Niger State argued that the country is currently going through the worst security situation since independence.\n“Yet someone is there taking the people for granted with his unguarded comments that the country is safer in the midst of this bloodbath,” Vatsa maintained."
  },
  {
    "headline": "Despite FG’s promise, Taraba still experiencing fuel scarcity",
    "summarized_story": "Despite assurance by the Federal Government that the persistent fuel scarcity in the country would soon be a thing of the past, the situation has continued to get worse in Taraba.\nAt the time of filing this report, queues have again returned to filling stations spread across Jalingo, the state capital, and its environs.\nDAILY POST reports that the product has continued to become very scarce in the last three months in the state.\nWhen DAILY POST visited some filling stations in Jalingo metropolis, it was observed that the gates were locked while black marketers had a busy day in their illicit business.\nWith long queues at the few petrol stations that were open, desperate consumers who spoke with our correspondent, said they were ready to buy fuel at any amount."
  },
  {
    "headline": "Ramadan: Seek forgiveness from God to end insurgency – Makinde tells Muslims",
    "summarized_story": "Governor Seyi Makinde of Oyo State has advised Muslims across the country to use the period of the Ramadan fast to seek forgiveness from God.\nMakinde who spoke on Saturday explained that this is necessary in order to tackle the menace of insurgency across the country.\nDAILY POST recalls that Muslims across the globe on Saturday commenced the one month Ramadan fast.\nMakinde has however enjoined Muslims to use the period to seek forgiveness from God.\n“I enjoin you to use the opportunity of this month of blessings to seek Allah’s forgiveness to make insurgency a thing of the past in our country."
  },
  {
    "headline": "Ramadan: Pray for security, peace, progress of Nigeria – Oyetola to Muslims",
    "summarized_story": "Governor Gboyega Oyetola of Osun State has implored Muslims to use the period of Ramadan to intensify prayers for the security, peace, progress and development of Nigeria.\nThe governor made the urge in a felicitation message to Muslims on the commencement of the holy month of Ramadan.\nOyetola reminded Muslims of the essence of fasting in the month of Ramadan, which according to him, in the Quran is for them to attain taqwa (piety).\n“Furthermore, let’s take advantage of the month of Ramadan to intensify prayers for the security, peace, progress and development of our dear State and country.\nI pray to Allah to answer our prayers and accept all our acts of worship in this blessed month and reward us all abundantly."
  },
  {
    "headline": "State House in Dodan Barracks to be revitalised — Presidency",
    "summarized_story": "The Permanent Secretary, State House, Tijjani Umar, at the weekend led a team of the management staff for an on the spot assessment of the current state of facilities in State House, Dodan Barracks, the former seat of the federal government in Ikoyi, Lagos.\nDetails of the event were contained in a statement issued yesterday by the State House Director of Information, Mr Abiodun Oladunjoye.\nSpeaking at a town hall meeting with the staff in Lagos, the Permanent Secretary said the Presidential facilities in the State House, Dodan Barracks at Ribadu Road, Ikoyi will receive the necessary attention to make them “active, functional and effective” in delivering services.\nNoting the strategic importance of the former abode of Nigeria’s heads of state, the Permanent Secretary recalled that in January this year, President Buhari, while returning from a state visit to Ogun State, passed through Dodan Barracks, where he boarded a helicopter to Murtala Muhammed Airport in Ikeja, Lagos.\nHe also encouraged State House staff to make use of the library for research, reference and to revive and entrench the dying reading culture that is needed for national development."
  },
  {
    "headline": "Ramadan: Why we must embrace kindness, love, by Tinubu",
    "summarized_story": "National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has enjoined Muslims to embrace acts of kindness and love during the ongoing Ramadan by reaching out to the poor, the needy and the less fortunate.\n“Ramadan asks of all of us to embrace acts of kindness, love our neighbours and reach out to the poor, needy and unfortunate among us.\n“Yet, we also face serious and dangerous challenges because of a small few who know not the way of truth, love and goodness.\nInstead, let us renew and strengthen our faith and trust in Almighty Allah and His great mercy towards us.\n“We beseech Almighty Allah to grant Nigeria special favour such that we become the just, prosperous and harmonious society He intends for us to be."
  },
  {
    "headline": "Emefiele: National Arts Theatre remodeling gulped $100m",
    "summarized_story": "The Central Bank of Nigeria (CBN) governor, Mr. Godwin Emefiele, has said the remodeling of the National Arts Theatre will cost the Bankers’ Committee $100 million at completion.\nHe spoke yesterday during the second inspection of progress of work at the National Arts Theatre, Iganmu, Lagos with the Lagos State Governor Babajide Sanwo-Olu, Minister of Information and Culture Lai Mohammed and Minister of Youth and Sports Development Sunday Dare.\nEmefiele said Sanwo-Olu had opened the Bankers’ Committee eyes to the opportunity present at the National Arts Theatre when the team was looking for possible area to site the project.\n“I thank the governor of Lagos State because at the time we were looking for where this project would be sited, he opened our eyes on the need to take a look at this 44 hectare land that also includes the National Arts theatre.\nContinuing, he said: “Our target is that by the special grace of God, Mr. President will commission the new National Arts Theatre by November."
  },
  {
    "headline": "North-West needs outfit like Amotekun, not foreign mercenaries – Shehu Sani",
    "summarized_story": "While Senator Shehu Sani said what the Northwest needs to defeat terrorism is a regional security outfit like the Southwest’s Amotekun, the CNPP asked El-Rufai to resign, saying that he has failed to secure the lives and property of the people of his state.\nSani said: “We must acknowledge that we are in a desperate situation in Northwest Nigeria, and desperate situation calls for solutions from all angles.\n“But I don’t think we need mercenaries to come and fight in the Northwest part of Nigeria.\nWhat is needed now is for the Northwestern state governors, including Niger State, to set up a regional security outfit which they will use their security votes to fund, just like the Southwest have done with Amotekun.\n“But you can grow your own security outfit, fund them, equip them and give them the go ahead to fight these terrorists."
  },
  {
    "headline": "Tinubu at 70: Triumph over travails",
    "summarized_story": "And a contemporary figure in the realm who best demonstrates the truth of this declaration is Asiwaju Bola Ahmed Tinubu, ex-Lagos State Governor who is now aiming to be the country’s president in 2023.\nWhile some question his moral credentials, others say his past as a governor should eminently fit him for a higher office.\nIn 2004, following the seizure of nearly N33b Federal allocation fund belonging to Lagos State by the Obasanjo government over the creation of new local governments by Governor Tinubu, the world expected the state to collapse.\nHowever despite 14 months of travail the Tinubu administration underwent on account of the withheld fund, the government still recorded noticeable achievements.\nIt was a hugely successful venture, because NADECO’s exploits, clandestine and overt, eventually saw off the martial rule, whose exit brought the civilian dispensation where Tinubu became the governor of Lagos in 1999."
  },
  {
    "headline": "2023: Presenting Northern candidate against South will be war -Frank Kokori",
    "summarized_story": "By Omoniyi SalaudeenChief Frank Kokori is a chieftain of the ruling All Progressives Congress (APC).\nHow would you react to the escalating security situation in Nigeria especially the recent attacks by bandits on Kaduna-bound trains?\nThe PDP too can spring up a good candidate that will work for the good of the country.\nThere are many good people from the North in the PDP just as there are good people in the South.\nPresenting a Northern candidate against the South will be like a war."
  },
  {
    "headline": "2023: I may be Nigeria’s consensus candidate –Peter Obi",
    "summarized_story": "From Aloysius Attah, OnitshaVice Presidential candidate of the Peoples Democratic Party in the 2019 general elections and presidential aspirant for the 2023 elections, Mr Peter Obi, yesterday predicted that he might likely emerge as the consensus candidate of all Nigerians and the Peoples Democratic Party for the general elections.\nThe former Anambra State governor said discussions for a consensus candidate among the aspirants might turn out in his favour since he represents the best choice for Nigerians at this point in history.\n“They didn’t say consensus is from a particular section; it might be consensus for Nigeria, and as we are going round, we shall be discussing everything.\nYou never know I might be the consensus candidate.\nEarlier, the national convener of the Young Professionals, Mr. Daniel Wilbert, an Itsekiri from Warri, Delta State, who presented the forms to Obi, on behalf of the group, said they looked around and found Mr Obi as the best for the job of Nigeria’s president this time."
  },
  {
    "headline": "Soludo, S’East bishops, monarchs move to end sit-at-home",
    "summarized_story": "This was contained in a statement issued by the government and the Joint Body of Southeast Council of Traditional Rulers and Bishops/Archbishops (Joint Body) on Peace and Conflict Resolution.\nThe document was endorsed by the Chairman, Anambra State Traditional Rulers Council (ANSTRC) and Obi of Onitsha, Igwe Nnaemeka Achebe; and Archbishop of the Catholic Archdiocese of Onitsha, and Metropolitan of Onitsha Ecclesiastical Province, Archbishop Valerian Okeke.\nOther signatories are the Secretary to the Anambra State Government, Prof. Solo Chukwulobelu; the Chairman, Enugu State Traditional Rulers Council, Igwe Lawrence Agubuzu, and Most Rev.\n“The Anambra State government hereby undertakes to train, rehabilitate and empower you to contribute to our homeland development.\n“It is the expectation of the Joint Body that the conclusion of the prayer session shall mark the end of sit-at-home in Anambra State in particular and the Southeast region in general."
  },
  {
    "headline": "Buhari, Osinbajo, Obasanjo, Gbajabiamila, Sanwo-Olu, Abiodun, Gambari, Dangote felicitate with Mama Otedola at 90",
    "summarized_story": "Buhari, in a congratulatory letter he personally signed, joined all Nigerians and the people of Lagos State in congratulating Mama Otedola on her 90th birthday.\n“I wish you many more years in good health.\nSimilarly, Obasanjo conveyed the heartiest congratulations on behalf of his family, as well as the people of Lagos State.\n“Your graceful attainment of an advanced age of 90, in good health and sound mind, is a rare favour that is desired by many.\nGambari also congratulated the former First Lady of Lagos on her attainment of the blessed age of four scores and 10."
  },
  {
    "headline": "2nd Niger Bridge: Finance Minister praises NSIA, Julius Berger",
    "summarized_story": "The Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, and the Managing Director of the Nigerian Sovereign Investment Authority, Uche Orji, yesterday began an inspection of the Second Niger Bridge project.\nThe bridge aims to minimize traffic congestion on the old Niger bridge and to strengthen connectivity in the entire region.\nSpeaking shortly after the inspection, the finance minister described the Second Niger Bridge as a very significant project for the Federal Government.\nShe said the government attached so much importance to the Second Niger Bridge project because of the huge developmental impact the project would have on the lives of Nigerians.\nThe other two projects are the Abuja-Kaduna-Kano Road project and the Lagos-Ibadan express road project."
  },
  {
    "headline": "Train Attack: NRC Confirms Safety of 170 Passengers",
    "summarized_story": "• As 21 are reported missing by relativesKasim Sumaina in AbujaThe Nigerian Railway Corporation (NRC), Saturday confirmed the safety of 170 passengers, even as it said that 21 passengers were still reported missing by the relatives who made calls to the corporation.\n“This update has become absolutely necessary so as to prevent the circulation of falsehood or misleading information to the general public.\n“Thus, the total seat capacity of the train is 840 seats.\nYou may also recall that the train manifest contained 362 validated passengers aboard the train.”The NRC boss hinted that the corporation, in continuation of its concerted effort through repeated calls, has been able to confirm the safety of “170 passengers, while 21 passengers are reported missing by the relatives who made calls to us,” Okhiria said.\n“In practical terms, a high powered restoration team, led by directors have been working round the clock to re-rail the coaches affected by the bomb blast."
  },
  {
    "headline": "Amaechi Joins Presidential Race",
    "summarized_story": "Minister of Transport, Mr Rotimi Amaechi, has joined the 2023 presidential race, THISDAY can reveal.\nWhile Amaechi has yet to make a formal declaration of his presidential bid, THISDAY at the weekend sighted a brochure prepared to sell his candidacy to Nigerians.\nIn line with the power zoning arrangement, agreed among political leaders since 1999, which rotates power between North and South, the presidential ticket of the ruling APC will move to South, as President Buhari who is serving his second term hails from the North.\nThe whole of Page Three of the brochure has the name of the minister boldly printed and translated into English as follows: Chibuike – God is Strength; Rotimi – Stand by Me; and Amaechi – Who Knows Tomorrow.\nThe brochure also has infographics of his achievements as Rivers governor and as transport minister ."
  },
  {
    "headline": "Buhari Meets El-Rufa’i over Kaduna Train Attack",
    "summarized_story": "Nasir El-Rufai of Kaduna State on Friday in Abuja updated President Muhammadu Buhari on security developments in his state following the Monday night’s terror attack on Abuja-Kaduna bound train.\nAccording to him, security agencies have been making frantic efforts to rescue victims of Monday night’s attack on a Kaduna bound train, from the hands of their abductors.\nEl-Rufa’i, who spoke in Hausa language, disclosed that the attack on the train was carried out by Boko Haram iinsurgents in collaboration with some bandits operating in Kaduna, Zamfara, Niger, Sokoto and Kebbi States.\nNAN recalls that the Kaduna-bound train, which left Abuja at 6 p.m. on Monday, was attacked by suspected terrorists at about 7.45 p.m., just about 15 minutes’ drive before Kaduna.\nEight persons had been officially confirmed dead, 46 hospitalised and several others kidnapped following the attack."
  },
  {
    "headline": "Challenged by Train Attack, Doubted by a Nervous Nation, Military Launches Offensive against Terrorists",
    "summarized_story": "The lawmakers demanded the sack of the National Security Adviser, Major General Babagana Monguno (rtd).\nThe Army, Navy, Police, DSS all of these agencies are accountable to the National Security Adviser.\nI’m calling for the resignation of National Security Adviser, he must be removed.\nThe lawmakers, therefore, urged the federal government to implement recommendations contained in the House security summit, held last year.\nThat bill was referred to the national security committee, but up till now, there is no report."
  },
  {
    "headline": "Stock Market Shrugs Off Insecurity Worries, Gained N3.02trn in Q1",
    "summarized_story": "Kayode TokedeThe market capitalisation of the Nigerian Exchange Limited (NGX) gained N3.02 trillion in the first quarter (Q1) of 2022, notwithstanding the growing insecurity concerns in the country.\nThe market performance was buoyed by impressive corporate earnings by major listed companies that saw some of them delivering robust dividend payout to shareholders.\nPrecisely, the market capitalisation gained N3.02 trillion to close on March 31, 2022, at N25.312 trillion, higher than the N22.297 trillion it opened for trading activities on January 4, 2021.\nOthers were the NGX Pension, NGX Industrial Goods, NGX 30, and NGX Lotus II that went up by 6.34 per cent, 5.63 per cent, 5.39 per cent, 4.37 per cent, and 1.18 per cent, respectively.\nHe added, “To invest profitably in this changing environment, you need investment education, trading plans and trading tools/software."
  },
  {
    "headline": "DOCUMENT: How Sokoto Governor Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\nThis profiling was aimed at identifying the state government’s accounts that may have been exposed to Diversion, misappropriation of public funds and money laundering by government officials,” part of the documents obtained by SaharaReporters read.\nDOCUMENT: How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Ye... by Sahara Reporters on ScribdSee Also Corruption EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years"
  },
  {
    "headline": "DOCUMENT: How Sokoto Governor Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years",
    "summarized_story": "A document from the Economic and Financial Crimes Commission (EFCC) and the Central Bank of Nigeria has exposed how the Sokoto State Government led by Governor Aminu Waziri Tambuwa stole, diverted about N189 billion from the state-owned accounts to private individuals.\nAccording to Abubakar, the accounts received a total cumulative inflow of N567,160,024,619.93 within the said period out of which N189,155,043,825.09 was illegally diverted.\n“The Department recently carried out financial profiling of the Sokoto State Government.\nThis profiling was aimed at identifying the state government’s accounts that may have been exposed to Diversion, misappropriation of public funds and money laundering by government officials,” part of the documents obtained by SaharaReporters read.\nDOCUMENT: How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Ye... by Sahara Reporters on ScribdSee Also Corruption EXCLUSIVE: Document Exposes How Sokoto Governor, Tambuwal, Aides Stole, Diverted N189 Billion From State Accounts Within 6 Years"
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "UK Court Jails Adeyinka Grandson, ‘Yoruba Supremacist’, Over Attacks On Igbo, Fulani",
    "summarized_story": "Grandson, also known as Adeyinka Shoyemi, a UK-based Nigerian of Yoruba descent, is known for his social media attacks on people of Igbo extraction as well as criticism of the Hausa-Fulani.\nHe was first arrested by the Scotland Yard Counter Terrorism Command, and the Metropolitan Police under the approval of the Westminster Magistrates’ Court in London in August 2019.\nScotland Yard Counter Terrorism Command had nabbed him for allegedly “stirring racial discrimination” against the Igbo and Fulani ethnic groups and also “encouraging terrorism”.\nOn several counts he had issued ‘quit notices’ to Igbo living in Yoruba land else they would face dire consequences.\nGrandson was found guilty on 30 November 2021 of eight counts of inciting racial hatred after a trial at Southwark Crown Court."
  },
  {
    "headline": "For the Chief Commander at 80",
    "summarized_story": "Not only did Obey go on to sing people’s praises, his own praises were also sung everywhere as he reinvented jùjú music.\nAs a little boy, I thought jùjú music was the genre for Christians and fújì for Muslims.\nQuoting his father, who also sang fújì, Osupa said fújì’s roots were in kiriboto, etiyeri, seli and wéré.\nHe often sang songs that spoke to current affairs.\nAs the “Chief Commander” clocks 80 today, he will surely miss his wife for 48 years."
  },
  {
    "headline": "For the Chief Commander at 80",
    "summarized_story": "Not only did Obey go on to sing people’s praises, his own praises were also sung everywhere as he reinvented jùjú music.\nAs a little boy, I thought jùjú music was the genre for Christians and fújì for Muslims.\nQuoting his father, who also sang fújì, Osupa said fújì’s roots were in kiriboto, etiyeri, seli and wéré.\nHe often sang songs that spoke to current affairs.\nAs the “Chief Commander” clocks 80 today, he will surely miss his wife for 48 years."
  },
  {
    "headline": "COVID-19: FG scraps post-arrival PCR test for fully vaccinated travellers",
    "summarized_story": "The federal government has scrapped post-arrival PCR COVID tests for fully vaccinated travellers entering Nigeria.\nAdvertisement“In-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights,” the protocol reads.\n“Fully vaccinated passengers arriving Nigeria will not also be required to carry out post-arrival PCR test or a rapid antigen test upon arriving Nigeria.\nAdvertisement“Travelers must bring along an electronic or hard copy of their negative COVID-19 PCR test for presentation at the departure airport and upon arrival in Nigeria.\n“Samples will be taken, and a COVID-19 PCR test done."
  },
  {
    "headline": "COVID-19: FG scraps post-arrival PCR test for fully vaccinated travellers",
    "summarized_story": "The federal government has scrapped post-arrival PCR COVID tests for fully vaccinated travellers entering Nigeria.\nAdvertisement“In-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights,” the protocol reads.\n“Fully vaccinated passengers arriving Nigeria will not also be required to carry out post-arrival PCR test or a rapid antigen test upon arriving Nigeria.\nAdvertisement“Travelers must bring along an electronic or hard copy of their negative COVID-19 PCR test for presentation at the departure airport and upon arrival in Nigeria.\n“Samples will be taken, and a COVID-19 PCR test done."
  },
  {
    "headline": "State police: Nigerians want governors to be chief security officers, says Makinde",
    "summarized_story": "Seyi Makinde, Oyo governor, has asked the national and state assemblies to consider resource control and state policing in the ongoing efforts to amend the constitution.\nMakinde said Nigerians are demanding that their governors play the role of chief security officers, adding that the introduction of state police would help in tackling insecurity.\nAnd so, it is high time the twin issues of resource control and state police are subjected to robust debate at the legislature.\n“Nigerians are demanding that their governors play the role of chief security officers of their states.\n“Can there be a better time to discuss resource control constitutional amendments are a must."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "Two years on, what has #YouTubeBlack Voices done for African creators?",
    "summarized_story": "While YouTube aims to provide a platform for creators globally to explore their creativity, in 2020, it shined a special focus on Africa when it launched the #YouTubeBlack Voices Fund.\nAdetula’s biggest takeaway from the Fund is the opportunity to network with and form relationships with over 135 other top creators around the world.\nThe Fund’s inaugural cohort last year featured a Creator Class of 20 content creators, from Nigeria, South Africa, and Kenya.\nStill, in South Africa, 25 channels have over 1 million subscribers, an increase of over 30%, year over year.\nOver 65% of watch time on content produced by channels in South Africa comes from outside of South Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "NowNow reaffirms commitment to driving financial inclusion in Nigeria",
    "summarized_story": "The company has built an ecosystem that digitises payments and creates access to financial services for Agents, Consumers and Businesses.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos.\nLekan Akinjide, the Partnership Director of NowNow Digital Services, said, “We are a leading fintech and financial services enabler.\nNowNow offers more than financial inclusion; we want to educate Nigerians about Financial services by teaching them how to manage their money to help them achieve financial independence.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis; Head of Marketing & Communications, NowNow, Tasyana Bouran; and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos."
  },
  {
    "headline": "Fantasy sports in Africa: Can $3m funding make it popular?",
    "summarized_story": "The love for the game is now shared with the passion for fantasy football or football betting.\nWhile fantasy sports in Africa might be a fantasy (pun intended), compared to sports betting, it is big in other regions.\nAdvertisementInstead of betting on real-life football teams, fantasy football involves gambling on virtual teams created by the player-manager.\nSome other European leagues have a fantasy version of their leagues, with the Fantasy Liga and Fantasy Bundesliga owned by the Spanish and German leagues, respectively.\nAccording to football magazine FourFourTwo, FPL has eight million players globally who compete to be the Jose Mourinho of fantasy football."
  },
  {
    "headline": "Grocery shopping with the community",
    "summarized_story": "AdvertisementThere were appearances from countries like Sudan, Namibia, and Uganda, and we discussed all that on the Techpoint Africa podcast.\nHowever, Kenyan startup, Tushop, uses community group buying to help Kenyans save on food.\nSomeone — usually called a community leader — aggregates orders from individuals who live close to each other.\nIt is then relayed to the vendor, farmer, or distributor, after which it is delivered to the community leader.\nLast week on the Techpoint Africa Podcast, we spoke about white founders in Kenya, so it’s interesting to see a black female founder from Kenya today."
  },
  {
    "headline": "Kaduna train attack eyewitness account: How mobile technology saved lives",
    "summarized_story": "One survivor of the terror attack Monday on a Kaduna bound Abuja train, Anas Iro Danmusa, has recounted how his phone call and use of social media from inside the attacked train saved the lives of hundreds of passengers.\n268 and 269 you’ll see 33333333333 for both as phone numbers.\nCheck 223 and 224 you’ll see 6495999999 and 9292999999 as phone numbers respectively.\nAre those numbers phone numbers?\n“Finally, my heart goes out to those that lost their lives and their families, may their souls rest in peace."
  },
  {
    "headline": "Women’s empowerment is complex – Mfon Ekpo, CEO of The Discovery Centre",
    "summarized_story": "Mfon Ekpo is the CEO of The Discovery (Training and Development) Centre, a founding partner, and an Executive Director with the John Maxwell Team.\nWe are geared towards speed -speed of accomplishment, speed of election, speed of positioning, speed of recognition and the list goes on.\nEver felt imposter syndrome on the topic of brushing your teeth or bathing?\nYou have done it so many times, in so many ways that it would be laughable to have imposter syndrome about that.\nAs simplified as that example is, the point is – The triune factors of Expertise, Experience and Time destroys Imposter Syndrome."
  },
  {
    "headline": "I work a 9-5 but have always believed in having a ‘safety net’ – Faiza Abdulrahim CEO FA’AZE",
    "summarized_story": "FA’AZE originated from a combination of motivating influence, learnings from a previous business venture, and God’s perfect timing.\nThe primary motive in starting the business was to create a brand that represents how well modesty can be infused into fashion.\n– Maintaining Quality and Consistency: As a brand, quality of product and service is our number one priority.\nAssessing customers needs and being consistent in the quality of products we offer, allows us to build trust and effectively deliver services.\nI work a 9-5 but have always believed in having a ‘safety net’, and that is what FA’AZE is to me and more."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo partners GIZ, Swiss agency on 3 job centre projects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has entered into partnership with the Deutsche Gesellschaft Für Internationale Zusammenarbeit (GIZ) and Swiss Agency for Development Corporation (SDC) on the establishment of three jobcentres across the state.\nThe new job centres are to be established across the three senatorial districts of the state, including Uromi, Esan North West Local Government Area (LGA); Auchi in Etsako West LGA, and Usen in Ovia South East LGA.\n“We launched the existing centres in September 2021, at the Edo Innovation Hub, at Wire Road and Edo Production Centre at Sapele Road.\nDare noted: “Solving the issue of unskilled graduates, unemployment and under-employment in one swoop, since 2017, EdoJobs has recruited workers for over 200 firms within and outside the state.\n“With a mission to provide a highly skilled workforce in Edo State, EdoJobs has also birthed other initiatives."
  },
  {
    "headline": "Obaseki recommits to free, credible LG polls, harps on responsibility, accountability in politics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has pledged to work with the electoral body and all other relevant stakeholders to ensure that the forthcoming local government election in the state is free, fair and credible.\nObaseki gave the assurance when he received the executive members of the Edo State chapter of the Inter-Party Advisory Council of Nigeria (IPAC) who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha said the country is in tough and perilous times, charging government officials on the need to be responsible and accountable to the people.\nHe noted, “With the local government elections soon approaching, we need to sit and brainstorm on how to ensure that the election is free, fair and credible.\nWe thank you for your courage as we assure you of this administration’s open-door policy.”Earlier, the Chairman of Edo IPAC, Hon."
  },
  {
    "headline": "MTN Nigeria paid N757bn as tax in 2021",
    "summarized_story": "Telecom giant, MTN Nigeria Communications, paid a total of N757bn direct and indirect tax to government agencies in 2021.\nThis was disclosed during the National Tax Dialogue Event organised by the Federal Inland Revenue Service.\nA statement titled, ‘MTN Named Best Tax Compliant Organisation in Nigeria: … recognised as one of the top 20 taxpayers by FIRS,’ signed by the company’s secretary, Uto Ukpanah, revealed that the company’s total tax contribution to all government agencies reached N757.6bn in 2021.\n“In 2021, MTN Nigeria’s total tax contribution to all government agencies including the FIRS amounted to N757.6bn while FIRS collected a total of N6.4trn tax revenue in the year,” the statement said.\nThe Chief Financial Officer, MTN, Modupe Kadri, who received the awards on behalf of the company, said, “I am delighted at our performance and recognition at this year’s National Tax Dialogue event."
  },
  {
    "headline": "Fidelity Bank reports 35.7% growth in profit to N38.1bn for 2021",
    "summarized_story": "Fidelity Bank Plc, has recorded 35.7% growth in Profit Before Tax for its 2021 financial year to close the year at N38.1bn, according to the bank’s recently released financial result.\nThe growth in NIR reflects the significant increase in customer transactions resulting in 84.9% growth in trade income, 48.1% in account maintenance charge, and 47.2% increase in digital banking income.\nSimilarly, Total Deposits increased by 19.2% to N2.025tr from N1.699tr in 2020FY, Local currency deposits grew by 16.0% and account for 80.3% of Total Deposits while foreign currency deposits increased by 33.9% and accounts for 19.7% of Total Deposits from 17.5% in 2020FY.\nDetailing the contribution of the bank’s digital-led retail strategy to its financial performance, Onyeali-Ikpe stated, “Digital Banking gained further traction driven by new initiatives in our retail business and the enhancement of existing digital banking products.\nThe performance of the Bank’s share price is a reflection of the high investor confidence in its strong fundamentals and leadership team."
  },
  {
    "headline": "Rotimi Amaechi joins 2023 presidential race, maintains he is Igbo",
    "summarized_story": "Minister of Transportation and former governor of Rivers State, Chibuike Rotimi Amaechi, has joined the 2023 presidential race, maintaining that he is Igbo and can run on the Igbo platform.\nAddressing the question of his Igbo identity he said, “My birth names are Igbo names Chibuike Amaechi.\nI am an Igbo man.\nI have made myself clear repeatedly, that I, Chibuike Amaechi from Ikwerre, am an Igbo man.\n“Chibuike Amaechi is an Igbo man of Ikwerre stock."
  },
  {
    "headline": "Morocco faces Belgium, Cameroon meets Brazil, Senegal tackles Netherlands in World Cup group stage",
    "summarized_story": "Cameroon will face Brazil Serbia and Switzerland in the group stages of the 2022 FIFA World Cup in Qatar, just as Senegal will battle host nation Qatar, Ecuador and the Netherlands.\nMeanwhile, Ghana will look to overcome Portugal, Uruguay and South Korea, while Tunisia’s Carthage Eagles will confront France, Peru or UAE or Australia, Denmark.\nMorocco, on the other hand, will face Belgium, Canada and 2018 finalists, Croatia, according to Friday’s group stage draw.\nBelow is the full draw:Group A: Qatar, Ecuador, Senegal, NetherlandsGroup B: England, Iran, USA, Wales or Scotland or UkraineGroup C: Argentina, Saudi Arabia, Mexico, PolandGroup D: France, Peru or UAE or Australia, Denmark, TunisiaGroup E: Spain, Costa Rica or New Zealand, Germany, JapanGroup F: Belgium, Canada, Morocco, CroatiaGroup G: Brazil, Serbia, Switzerland, CameroonGroup H: Portugal, Ghana, Uruguay, South Korea— World Cup finals to be played from November 21 to December 18— Intercontinental playoffs to be contested on June 13-14 in Qatar:i) Winner of United Arab Emirates v Australia face Peruii) New Zealand v Costa Rica— European playoffs to be held in June on dates to be announcedFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "PUNCH Appoints Joseph Managing Director/Editor-in-Chief",
    "summarized_story": "The board of directors of Punch Nigeria Limited has appointed Adeyeye Joseph as the newspaper group’s managing director/editor-in-chief, effective, May 1, 2022.\nJoseph replaces Ademola Osinubi, who officially retires from the company on April 30, 2022.\nBefore this appointment, Joseph was editor of The PUNCH and at a time the editor of Saturday PUNCH.\nSpeaking on his appointment, Joseph expressed gratitude to God for the rare privilege.\nHe is an alumnus of the Lagos Business School Advanced Management Programme; the General Management Programme of Cranfield University, United Kingdom and the International Institute for Journalism, Germany’s newspaper management programme."
  },
  {
    "headline": "GoHealth: Gombe Launches Mobile Application Technology",
    "summarized_story": "Determined to revolutionise health services in Gombe State, Governor Muhammadu Inuwa Yahaya has launched a mobile application technology for Gombe State Contributory Healthcare Management Agency (GoHealth).\nThe governor maintained that the launch of the mobile application was in line with his administration’s aspiration towards providing quality and affordable healthcare services for the people through GoHealth.\nGovernor Yahaya also noted that GoHealth beneficiaries enjoy effective medical consultations, admissions, provision of regular medications and surgical operations all at no cost to them.\nThe governor noted that the stakeholder engagement also highlights the commencement of the second phase of GoHealth enrolment.\nShe said the launch of the GoHealth App in Gombe State was a quantum leap in the delivery of real time health services and therefore assured the government and people of the state that the GIZ would continue to support the efforts of the Gombe State government towards revitalizing the health sector."
  },
  {
    "headline": "NSCDC Acquires Gunboats To Fight Piracy, Oil Theft In Niger Delta",
    "summarized_story": "The Nigerian Security and Civil Defence Corps (NSCDC) has acquired gunboats for use in Niger Delta waters where economic crimes like piracy and oil pipeline vandalism are threatening the national economy.\nCrude oil theft, especially in the Bonny Terminal Network, Forcados Terminal Network and Brass Terminal Network is responsible for crude oil loss of about 91 per cent in Nigeria.\nNigeria lost $3.2 billion in crude oil theft between January 2021 and February 2022, according to government figures.\nA report from the UNODC says that oil workers in the Gulf of Guinea face unparalleled threats of piracy and robbery at sea.\nWe have met and discussed other security agencies on how to prevent this from happening again.”"
  },
  {
    "headline": "NSCDC Acquires Gunboats To Fight Piracy, Oil Theft In Niger Delta",
    "summarized_story": "The Nigerian Security and Civil Defence Corps (NSCDC) has acquired gunboats for use in Niger Delta waters where economic crimes like piracy and oil pipeline vandalism are threatening the national economy.\nCrude oil theft, especially in the Bonny Terminal Network, Forcados Terminal Network and Brass Terminal Network is responsible for crude oil loss of about 91 per cent in Nigeria.\nNigeria lost $3.2 billion in crude oil theft between January 2021 and February 2022, according to government figures.\nA report from the UNODC says that oil workers in the Gulf of Guinea face unparalleled threats of piracy and robbery at sea.\nWe have met and discussed other security agencies on how to prevent this from happening again.”"
  },
  {
    "headline": "NDIC Refunds Over N220bn To 535, 815 Victims Of Failed Banks",
    "summarized_story": "The Nigeria Deposit Insurance Corporation (NDIC) has disclosed that it has refunded N220 billion to 535,815 depositors, creditors and shareholders of failed banks in the country as of December 29, 2021.\nThe managing director, Bello Hassan, stated this at the ‘NDIC Day’ at the ongoing 33rd Enugu International Trade Fair in Enugu yesterday.\nHassan stated that the amount included insured and uninsured sums, adding that the corporation had declared full payment of insured and uninsured sums to depositors of 18 banks in-liquidation.\n“This implies that the corporation has realised liquidation dividends to pay all depositors of the banks who present themselves for payment,” he said.\nADVERTISEMENTThe fair was organized by the Enugu Chamber of Commerce Industries, Mines & Agriculture with the theme: “Opening up Nigerian business windows for competitiveness in the emerging global market”."
  },
  {
    "headline": "Anger as CBN Governor Emefiele's branded vehicles for 2023 presidency surface",
    "summarized_story": "Central Bank of Nigeria (CBN) Governor, Godwin Emefiele is seriously preparing for the 2023 presidency even though he has not officially made his intention known.\nBranded vehicles of the CBN governor have hit social media with a bang, setting tongues wagging.\nHe has been sponsoring some pressure groups to drum support for his ambition, even while still holding on as CBN governor.\nA Twitter user, Al Ameen reacted: “The worst CBN Governor in the history of Nigeria wants to contest for President.\nSince he has decided to be partisan, he has lost the moral TENACITY to still be presiding as the CBN governor ."
  },
  {
    "headline": "Sanwo-Olu pens golden words for Ebenezer Obey as he clocks 80",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, has congratulated an elder statesman and music maestro, Evangelist Ebenezer Obey-Fabiyi, on his 80th birthday celebration.\nGovernor Sanwo-Olu in a congratulatory message issued by his Chief Press Secretary, Gboyega Akosile, described “Chief Commander” Ebenezer Obey-Fabiyi, as an apostle of God, who is using music as a means of evangelism.\n“You are an apostle of God and a man that is also using music as a means of evangelism.\nWe want to thank God for the grace upon your life and for using music as a tool for a good cause in our society.\nWe thank God for your health."
  },
  {
    "headline": "Man in Honda car killed by truck down from Ojuelegba Bridge [Video]",
    "summarized_story": "A middle-aged man, yet to be identified, was crushed to death by a truck that fell off Ojuelegba Bridge in Lagos on Saturday night.\nThe man was driving a Honda Accord when the truck fell on his car.\n“How is it this hard for Lagos state Government to stop these Ojuelegba accidents?\nLagosTrafficreports suggested: “I think it’s time to stop Containers&Lorries from using Ojuelegba bridge.\nLagos State govt must not witness another casualty again."
  },
  {
    "headline": "BREAKING: IPOB cancels ‘sit at home’ in Southeast",
    "summarized_story": "Indigenous Peoples of Biafra (IPOB) has abrogated its sit-at-home directive in southeast Nigeria, saying the development is to embrace peace negotiations organised by the Anambra government.\nNAN reports that the decision was disclosed by the Chairman, Anambra Traditional Rulers Council, Igwe Nnaemeka Achebe, during a one-day peacebuilding and security meeting held in Awka on Saturday.\nHe said that the state government has set April 4 for prayers aimed at seeking God’s face to restore lasting peace in Anambra and South East as a whole.\n“Igboland has lost so much in the economic and social development of the zone and we are tired of the situation and want peace,” the traditional ruler said.\nThe speakers include Mr Uche Okafor, Anambra Speaker, who assured that the legislators would partner with the state government to enthrone lasting peace and economic development of the state and the zone."
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has officially joined the 2023 Presidential race.\nBello officially declared his decision to run for the Presidency on Saturday in Abuja.\nHis declaration lays to rest speculations surrounding him running for the Presidency in 2023.\nSpeaking, Zwingina described the Presidential aspirant as a detribalized Nigerian, who governs Kogi with appointees from other states.\nStressing that Nigeria needs Bello as a President, Zwingina noted that the “governor uprooted insecurity from Kogi, the state would have been a breeding ground for kidnapping and banditry, but for his leadership skills.”"
  },
  {
    "headline": "BREAKING: 2023: Yahaya Bello Officially Declares To Run For President",
    "summarized_story": "Governor Yahaya Bello of Kogi State has declared his candidacy for President in 2023.\nOn Saturday in Abuja, Bello formally announced his intention to run for President.\nHis announcement puts an end to rumors about him running for President in 2023.\nZwingina branded the Presidential candidate as a detribalized Nigerian who leads Kogi with appointees from other states, according to him.\nZwingina emphasized the importance of Bello as President, noting that the “governor removed instability from Kogi, the state would have been a breeding ground for kidnapping and banditry if it hadn’t been for his leadership qualities.”"
  },
  {
    "headline": "Ilesa COE Upgrade: PDP Has Lost Touch With Reality – Oyetola’s Spokesman",
    "summarized_story": "Spokesman to Governor Adegboyega Oyetola of Osun, Ismail Omipidan, has said the PDP has lost touch with reality, forgetting that the Governor has, in the last three years, always thought through his administration’s programmes and policies.\nHe was reacting to the claim by a faction of the Peoples Democratic Party, PDP, in Osun, that the Ilesa College of Education upgrade to a full-fledged University by the State Government was a deceit.\n“It is unfortunate that the PDP has decided to play politics with important issues.\n“Governor Oyetola has in the last three years plus fulfilled every promise he made.\nIjesa people know Oyetola; they know he is a man of impeccable character, whose word you can always take to the bank and you will return smiling,” Omipidan added."
  },
  {
    "headline": "[Breaking] Premier League: Benched by Eguavoen, Iheanacho scores as Leicester City cage Manchester United, Red Devils’ top 4 hope dims",
    "summarized_story": "Manchester United’s hopes of making next year’s Champions League were dented in a draw with Leicester.\nKelechi Iheanacho’s opener for Leicester ignited a slow game with Fred immediately equalising.\nJames Maddison appeared to have restored Leicester’s lead at Old Trafford but his strike was ruled out by the video assistant referee.\nWithout Cristiano Ronaldo, United barely threatened and the result leaves them three points off the top four.\nArsenal, in fourth, have two games in hand on United."
  },
  {
    "headline": "How I escaped Abuja-Kaduna train attack by whiskers, Obi of Onitsha opens up",
    "summarized_story": "One of the most prominent traditional rulers in Nigeria, Obi of Onitsha, Igwe Nnaemeka Alfred Achebe, has revealed how a last minute telephone call prompted him to escape attack by terrorists on Abuja-Kaduna train.\nThe attack left about eight passengers dead, scores of others wounded, 21 confirmed missing and 171 others “unaccounted for,” according to the figures confirmed by the Nigerian Railway Corporation (NRC) on Saturday.\nHe said at the meeting under the umbrella of Ahamefuna Socio-cultural organisation held in Enugu, the South East capital: “I was among the passengers meant to be on the train last Monday because I had a meeting I was supposed to be attending.\nThe gathering of the Igbo stakeholders and leaders of thought called on politicians from the area to stand firm in demanding right to the presidency, and particularly impress it on their political parties to zone tickets for the office to the region.\nThe event,had in attendance, top Igbo personalities, including, renowned businessman, Emmanuel Iwuanyanwu, former National Chairman of the Peoples Democratic Party (PDP) and former Governor of Enugu State, Okwesilieze Nwodo, and former Governor of Imo State, Achike Udenwa, alongside former ministers, senators, clerics, traditional rulers, women leaders and youth leaders."
  },
  {
    "headline": "Breaking: UK missile shoots down Russian Military helicopter in Ukraine",
    "summarized_story": "A British anti-aircraft missile has been used to shoot down a Russian helicopter in its first use in Ukraine, it has been reported.\nStarstreak is an advanced high-velocity missile that destroys targets using three laser-guided darts and was supplied to Ukraine by Britain in March.\nA Ministry of Defence source said the video, which was released on Friday, showed Starstreak in action over Ukraine, the Times has reported.\nUkrainian media has also reported that the Ukrainian armed forces shot down the helicopter with ‘the help of the most modern British Starstreak’.\nStarstreak was sent to Ukraine as part of weapons package from Britain that included Next Generation Light Anti-tank Weapon (NLAW) missiles."
  },
  {
    "headline": "FG’s Revised Covid Travel Protocol To Take Effect From Monday",
    "summarized_story": "The Federal Government’s revised COVID-19 travel protocol for travellers arriving in Nigeria is scheduled to take effect from Monday.\nThe new protocol stipulates that in-bound passengers to Nigeria who are fully vaccinated against COVID-19 are no longer required to carry out COVID-19 PCR test before boarding Nigeria-bound flights.\nAlso, fully vaccinated passengers arriving Nigeria will not be required to carry out Post-arrival PCR test or a Rapid Antigen Test upon arriving Nigeria.\nREAD ALSO: Ghana Ends Mandatory Face Mask-Wearing, Reopens Borders After Two Years“Children below the age of 18 years will be accorded the same privileges as persons who are fully vaccinated,” the new protocol document said.\nMeanwhile, all-inbound passengers, regardless of vaccination status, are expected to register via the online Nigeria International Travel Portal (NITP– https://nitp.ncdc.gov.ng)."
  },
  {
    "headline": "At Least 13 Killed In Fresh Bandit Attack On Zamfara Villages",
    "summarized_story": "At least 13 persons have been killed by armed bandits in attacks on different communities in Anka Local Government Area of Zamfara State.\nThe affected communities are Kadaddaba, Rafin Gero, and Babban Baye, all in Anka Local Government Area of Zamfara State.\nREAD ALSO: One Killed, Six Injured, Many Abducted As Terrorists Attack Katsina MarketAn indigene of Anka community, Yusuf Anka, told Channels Television that no less than fifteen persons were killed in three villages of Anka Local Government.\nOne of the villages is less than five kilometres away from Anka Local Government Headquarters,” he said.\nShehu said, “there was no any incident in Daki Takwas, the village is under Gummi Local Government and there was no attack in the village.”"
  },
  {
    "headline": "Yahaya Bello Declares For 2023 Presidency, Promises To Make 20m Nigerians Millionaires By 2030",
    "summarized_story": "﻿Kogi State Governor Yahaya Bello on Saturday formally declared to run for President in 2023.\nIn his speech, Governor Bello said he will build on the legacy of President Muhammadu Buhari by creating 20 million naira millionaires in the country by 2030.\n“It is therefore clear that our path to national prosperity lies in pulling millions of Nigeria out of poverty.\n“The Buhari administration has a target of lifting 100 million Nigerians out of poverty by the year 2030.\nDaughter of the presumed winner of the June 1993 presidential election, late Moshood Abiola, Hafsat Abiola-Costello, was named the Director-General of the Yahaya Bello presidential campaign."
  },
  {
    "headline": "Bola Ige: Soyinka Tackles Buhari Over Omisore’s Emergence As APC National Secretary",
    "summarized_story": "Nobel laureate Wole Soyinka on Saturday questioned President Muhammadu Buhari’s decision to back Iyiola Omisore as the new National Secretary of the All Progressives Congress.\nMr Omisore, the Nobel laureate argued, remains a prime suspect in the unsolved murder case of former Attorney-General and Minister of Justice, Bola Ige.\nREAD ALSO: Lawan, Gbajabiamila Ask Nigerians To Pray For Security As Ramadan Fast BeginsHe wondered how it was possible that the APC, headed by President Buhari, had now selected one of the prime suspects in the Bola Ige case as its National Secretary if it was really serious about prosecuting the unsolved murder.\n“To this layman, that investigative revisit is already hamstrung and disrobed of credibility,” Soyinka said.\n“I think the nation should simply relieve President Buhari of his pledge.”Read Soyinka’s full statement below:"
  },
  {
    "headline": "Religious Leaders Ask FG To Launch Massive Bombing of Bandits Inside Forests",
    "summarized_story": "A group of religious leaders under the umbrella of Pastors United for Change Association, has appealed to the Federal Government and military authorities to launch a massive onslaught and bombing of bandits inside their camps in the forest within the North West and Niger state in the North Central zone.\nThe religious leaders also appealed to President Muhammadu Buhari to use his position as the nation’s Commander-in-Chief to order for the immediate deployment of the newly acquired Super Tucano jets to dislodge the bandits from their enclaves inside the forest, as suggested by Governor Nasir El-Rufai of Kaduna State.\nThey also commended the Kaduna state Governor for the measures he has been taking to ensure that peace is restored in the state.\nHe, however, called on security agencies to redouble their efforts in order to ensure the perpetrators of the killings and attacks are brought to justice.\nHe also called on Muslims and Christians to use the holy month of Ramadan to pray for God’s intervention on the security challenges confronting the country."
  },
  {
    "headline": "APC Leadership has not been fair to Zamfara",
    "summarized_story": "Senator Kabiru Marafa says the All Progressives Congress has not been fair and just to the people of Zamfara StateHe says he and other party chieftains in the state are among the founding fathers of the APC but the party under the Mai Mala Buni led administration was not fair to them.\nSenator Kabiru Marafa stated this while speaking to Newsmen in Gusau, the Zamfara State CapitalThe former two term red Chamber lawmaker adds that he and former Abdul’azeez Yari remain in the APC to prove that they are card carrying and duly registered members of the party as against the stories making the round that they are notSenator Marafa further says if the people of Zamfara State decided not to continue to support the ruling APC is vase in the fact that they were not treated fairlyOver Seven hundred and fifty thousand APC Members according to him were registered before the registration was cancelled"
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "Babangida pledges support for PDP consensus arrangement",
    "summarized_story": "Former Military President, Ibrahim Badamasi Babangida has met with some aspirants contesting for the office of the president on the platform of the Peoples’ Democratic Party (PDP) for the forthcoming general.\nWhile briefing Journalists on Thursday after a closed door meeting with the three PDP Presidential aspirants for 2023 elections, former Senate President, Dr. Abubakar Bukola Saraki, Governor Aminu Waziri Tambuwal of Sokoto State and Bauchi State Governor, Senator Bala Mohammed.\nSpeaking on behalf of other Aspirants, Senator Abubakar Bukola Saraki said the visit to the former General Babangida was to seek his advice and guidance on the way to go and to achieve the planned consensus in the PDP."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "‘Court’s Decision to Strike Out that Suit is a Win for Democracy’ – Dave Umahi",
    "summarized_story": "Ebonyi State Governor David Umahi in this exclusive interview with ARISE News speaks on the court ruling which struck out the suit seeking his removal from office over his defection from the people’s democratic party to the All progressives congress."
  },
  {
    "headline": "Russian Forces Retreating from Kyiv Creating ‘Complete Disaster’ with Mines Around Homes, Ukraine’s Zelenskyy Warns",
    "summarized_story": "Russian forces are creating “a complete disaster”, leaving mines around homes and even corpses, Ukraine’s president has said.\nVolodymyr Zelenskyy issued the warning to his people early on Saturday as Russian troops continued to withdraw from areas around Kyiv.\nThe UK’s Ministry of Defence has said Ukrainian forces continue to advance against withdrawing Russian forces in the vicinity of Kyiv.\nRussian forces are also reported to have withdrawn from Hostomel airport near the capital, which has been subject to fighting since the first day of the conflict.\nThe Ministry of Defence said that the fuel lost from the ruined oil tanks, near the Russian city of Belgorod, could worsen the supply problems hampering the Russian military."
  },
  {
    "headline": "In Serbia, Pro-Russia is Seen as the Winning Election Stance Amid Ukraine War",
    "summarized_story": "Opposition party officials say Russia’s war in Ukraine has only strengthened Vucic’s dominance of Serbian politics and the mainstream media.\nSoon after Russian tanks entered Ukraine, the president’s election slogan changed to “Peace.\n“If we are ready to give up Kosovo, then we can impose sanctions on Russia,” Dacic said.\nThe support for Moscow makes Serbia somewhat of an outlier in Europe.\nElection polls predict Vucic will win the presidential election outright on Sunday."
  },
  {
    "headline": "Will Smith Resigns From Academy Over Chris Rock Oscars Slap Backlash",
    "summarized_story": "Will Smith, facing possible expulsion or suspension after he assaulted Chris Rock during last Sunday’s Oscars telecast, has instead resigned from the Academy of Motion Picture Arts & Sciences.\nIn a statement, Smith called his actions “shocking, painful and inexcusable” and said that he will accept any additional consequences that the Academy’s Board of Governors deems appropriate.\nI am heartbroken.”Smith also acknowledged that his actions overshadowed other winners at the 94th Academy Awards.\nThe Academy later said it asked Smith to leave the ceremony and he refused.\nDuring an appearance on GMA on Friday, Packer said that he said Smith should stay at the request of Rock — something Rock’s camp has denied."
  },
  {
    "headline": "Nigeria Ready to Lead Africa’s Digital Tech Race, Buhari Says as Microsoft Opens $200m Hub in Abuja",
    "summarized_story": "Nigeria President Muhammadu Buhari has expressed the readiness of Nigeria to lead the digital technology aspiration of the 54 African countries.\nThis is just as Microsoft opened its first engineering hub, the African Development Centre worth $200 million, in Abuja.\nBuhari said: “I have been informed that the African Development Centre in Nigeria is Microsoft’s first engineering hub in Africa as the current investment stands at about $200 million.\nThe Nigerian President said: “Our emphasis on the development of our Digital Economy has also positioned the sector as a prominent factor in the Nigerian economy.\nAs such, we urge you to continue to support the development of our digital economy."
  }
]